[
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21892/312",
        "location": "Infopark",
        "closing_date": "03 Feb 2026",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p>We are seeking a high-performing, self-driven <strong>Senior Business Development Executive</strong> to join our team at <strong>2Base Technologies</strong>. In this role, you will generate leads, build client relationships, and drive revenue through the sale of IT services and digital solutions. This individual contributor position requires end-to-end ownership of the sales process, from prospecting to closure. If you are passionate about technology, consultative selling, and business growth, we’d love to hear from you!</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Identify and generate qualified leads via outbound channels, referrals, and market research.</li>\n<li>Drive new business opportunities for <strong>web</strong>, <strong>mobile</strong>, and <strong>enterprise software development</strong> services.</li>\n<li>Manage the full sales cycle: lead qualification, client communication, requirement analysis, proposal preparation, pricing, negotiation, and closure.</li>\n<li>Propose tailored IT and digital transformation solutions aligned with client business objectives.</li>\n<li>Build relationships with key decision-makers (Founders, CXOs, Product Owners).</li>\n<li>Collaborate with delivery, design, and marketing teams to create compelling proposals and presentations.</li>\n<li>Maintain CRM records and provide sales forecasts/reports.</li>\n<li>Represent the company at networking events and client meetings to enhance visibility.</li>\n<li>Meet/exceed monthly/quarterly revenue targets consistently.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor’s degree or equivalent in <strong>IT/CS/BCA/B-Tech/CS/EC/MBA/Diploma</strong>.</li>\n<li><strong>2–5 years</strong> of B2B sales experience in <strong>IT services/digital solutions</strong>.</li>\n<li>Proven ability to manage sales pipelines and close deals independently.</li>\n<li>Strong knowledge of <strong>software development services</strong> (web/mobile apps, SaaS, enterprise solutions).</li>\n<li>Experience with international clients preferred.</li>\n<li>Proficiency in <strong>CRM systems</strong> (Zoho, HubSpot, Salesforce) and outbound tools (LinkedIn Sales Navigator).</li>\n<li>Excellent communication, presentation, and negotiation skills.</li>\n<li>Ability to work autonomously with minimal supervision.</li>\n<li>Strategic thinker who can address client pain points and position solutions.</li>\n</ul>\n<h3>Additional Experience</h3>\n<ul>\n<li><strong>2–5 years</strong> in sales/business development.</li>\n<li>Certifications in sales, digital marketing, or business consulting are a plus.</li>\n</ul>\n<p><strong>Contact</strong>: Share your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Software Development",
            "B2B Sales"
        ],
        "summary": "Senior Business Development Executive to drive IT services sales, manage full sales cycles, and meet revenue targets with 2-5 years of B2B experience."
    },
    {
        "job_title": "Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21893/312",
        "location": "Infopark",
        "closing_date": "03 Feb 2026",
        "job_description": "<p><strong>Business Analyst</strong></p>\n<p>The Business Analyst plays a key role in ensuring requirements are clearly understood, accurately documented, and traceable throughout the software development lifecycle. This role focuses on translating business and functional inputs into structured, standardized documentation that supports effective development, testing, and delivery. Working closely with business analysts, design teams, and technical stakeholders, the role ensures consistency, clarity, and alignment across all requirement artifacts.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Create Software Requirement Specifications (SRS) based on inputs from Core Business Analysts, stakeholder discussions, and requirement walkthroughs</li>\n<li>Prepare Business Requirement Documents (BRD) using approved templates while ensuring business intent and system behavior are clearly documented</li>\n<li>Participate in requirement discussions to understand business objectives, functional flows, dependencies, and assumptions before documentation</li>\n<li>Analyze requirements to identify gaps, ambiguities, and inconsistencies, and work with Core BAs to resolve them</li>\n<li>Document functional flows, business rules, and acceptance criteria where applicable to support development and QA teams</li>\n<li>Document wireframes, UI flows, validations, and UI specifications in collaboration with design and product teams</li>\n<li>Maintain change logs, version history, and document updates throughout the project lifecycle</li>\n<li>Create and manage traceability matrices linking business, functional, and technical requirements</li>\n<li>Maintain cross-references across BRD, SRS, UI, API, and related documentation</li>\n<li>Ensure documentation consistency, completeness, and alignment with approved scope and delivery timelines</li>\n<li>Ensure accurate and timely PMS updates with structured documentation details</li>\n<li>Support development, QA, UAT, and audit processes through clear, traceable, and up-to-date documentation</li>\n<li>Assist in requirement reviews, walkthroughs, and validation sessions with internal and client stakeholders</li>\n</ul>\n<h2>Requirements</h2>\n<h3>Required Skills and Experience</h3>\n<ul>\n<li>1 to 4 years of experience in Business Analysis documentation or related roles</li>\n<li>Strong experience in BRD and SRS creation</li>\n<li>Hands-on experience with documentation templates, standards, and version control</li>\n<li>Ability to document UI wireframes and functional flows clearly</li>\n<li>Working knowledge of APIs and system integrations for documentation purposes</li>\n<li>Experience with project management systems and documentation tools</li>\n<li>Strong attention to detail and ability to manage multiple documents in parallel</li>\n<li>Excellent written communication and stakeholder coordination skills</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field</li>\n<li>1 to 4 years of experience as a Business Analyst or Product Analyst</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "1-4 Years",
            "BRD/SRS Documentation",
            "UI/UX Documentation",
            "API Integration"
        ],
        "summary": "The Business Analyst translates business needs into structured documentation, ensuring clarity and traceability across development. Requires 1-4 years of experience in BRD/SRS creation and UI/API documentation."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21894/312",
        "location": "Infopark",
        "closing_date": "03 Feb 2026",
        "job_description": "<p><strong>Senior Business Analyst</strong></p>\n<p>At 2Base, we are rebuilding the Business Analyst function into a world-class, product-minded, clarity-driven team. This role is not a documentation role. It is not a screen updater role. It is not a support role. This is a core Business Analyst position responsible for functional modelling, system reasoning, requirement clarity, and building the foundation for correct development.</p>\n<p>As a Senior Business Analyst, you will be the functional brain of the project. You will ensure that the right problem is understood, broken down, analysed, validated, clarified, communicated, and owned end-to-end. You will drive requirement precision, reduce rework, and enable confident and aligned delivery across teams.</p>\n<p><strong>Key Responsibilities</strong>\n- Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.\n- Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.\n- Convert ambiguous client inputs into structured, logical, and actionable functional understanding.\n- Break large features into modules, workflows, components, and clear dependencies.\n- Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.\n- Translate business processes into functional logic that development teams can execute.\n- Decompose requirements into use-case flows, system behaviours, edge cases, alternate paths, validation rules, and dependencies.\n- Prepare high-quality documentation, including BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API requirement specs, and acceptance criteria.\n- Ensure all documentation is clear, logical, structured, testable, and ready for developers and QA to use.\n- Collaborate closely with developers, architects, QA, and product owners to validate feasibility and align understanding.\n- Ensure QA teams can derive test cases effectively from your functional logic and acceptance criteria.\n- Communicate confidently with clients, handle requirement discussions smoothly, and clarify misunderstandings immediately.\n- Push back politely on unclear or changing requirements and ensure final decisions are documented properly.\n- Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover to development.\n- Own the entire requirement lifecycle from discovery to development readiness with high accountability.\n- Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</p>\n<p><strong>Required Skills &amp; Experience</strong>\n- Minimum 4+ years of core Business Analyst experience with strong analytical and system-level thinking.\n- Ability to break down complex requirements into clear components, workflows, and functional logic.\n- Excellent verbal and written communication with confidence in client interactions and clarifications.\n- Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria with high clarity.\n- Ability to challenge assumptions politely, ask the right questions, and ensure zero ambiguity.\n- Strong collaboration experience with development, QA, architects, and cross-functional teams.\n- Understanding of API behaviours, integrations, data flows, and multi-module system interactions.\n- Ability to run requirement discussions, workshops, and independently lead discovery sessions.\n- Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.\n- Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.\n- Not suitable for UI-only thinkers, passive communicators, template-based writers, or those relying on AI for answers.\n- Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.\n- Candidates must align with 2Base’s structured thinking, clarity-driven culture, and transformation of the BA function.</p>\n<p><strong>Minimum Qualifications</strong>\n- Bachelor’s degree in Computer Science, Engineering, Business, or related field\n- 4 to 8 years of experience as a Business Analyst or Product Analyst\n- Experience in SaaS or scalable product environments\n- Exposure to AI/Automation, integrations, or multi-module systems\n- Ability to run independent client workshops\n- Must have independently handled requirement ownership for at least one full project lifecycle</p>\n<p><strong>Benefits</strong>\n- A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "SaaS",
            "API",
            "BRD/FRD/SRS"
        ],
        "summary": "Senior Business Analyst role at 2Base focuses on functional modeling, system reasoning, and requirement clarity to enable precise development. Requires 4+ years of experience in structured, product-driven BA work with SaaS and API expertise."
    },
    {
        "job_title": "Graphic Designer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21895/312",
        "location": "Infopark",
        "closing_date": "03 Feb 2026",
        "job_description": "<h2>About the Role</h2>\n<p>We are seeking a <strong>Creative Designer</strong> who demonstrates strong visual thinking, originality, and ownership of their work. The ideal candidate will stay connected to marketing and design trends, delivering high-quality visuals that enhance brand identity and audience engagement.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design engaging creatives for branding, marketing, and promotions</li>\n<li>Create assets like brochures, flyers, posters, social media graphics, website visuals, presentations, and email campaigns</li>\n<li>Conceptualize and translate ideas into clear visual communication</li>\n<li>Own design deliverables from concept to final output</li>\n<li>Maintain brand consistency across all touchpoints using brand guidelines</li>\n<li>Manage multiple projects simultaneously while meeting deadlines</li>\n<li>Collaborate with Marketing, Creative Leads, and Project Managers for updates and revisions</li>\n<li>Stay updated on design trends and tools</li>\n<li>Use modern design tools (e.g., AI/PS) to support ideation while ensuring originality</li>\n<li>Maintain organized design files and documentation</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Diploma/Bachelor’s in Graphic Design, Visual Arts, or related field</li>\n<li><strong>2 to 4 years</strong> of professional design experience</li>\n<li>Proficiency in Adobe Photoshop, Illustrator, InDesign, Premiere Pro, After Effects</li>\n<li>Working knowledge of MS Office (PowerPoint, Word)</li>\n<li>Basic HTML/CSS understanding</li>\n<li>Strong typography, layout, and design principles</li>\n<li>High attention to detail and visual judgment</li>\n<li>Excellent communication skills</li>\n</ul>\n<h2>Creativity &amp; Mindset</h2>\n<ul>\n<li>Quick creative thinking and problem-solving</li>\n<li>Ownership of work with accountability</li>\n<li>Self-discipline in reviewing submissions</li>\n<li>Ability to accept feedback and iterate efficiently</li>\n<li>Confidence in presenting design concepts</li>\n<li>Willingness to innovate beyond briefs</li>\n</ul>\n<h2>Portfolio Requirement</h2>\n<ul>\n<li>Mandatory portfolio showcasing branding, marketing creatives, and originality</li>\n<li>Ability to explain design intent, approach, and execution</li>\n</ul>\n<h2>Experience</h2>\n<ul>\n<li><strong>2 to 4 years</strong> of relevant industry experience</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Growth-driven environment with opportunities to lead, innovate, and upskill</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>careers@2basetechnologies.com</strong></p>",
        "tags": [
            "2-4 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Adobe InDesign"
        ],
        "summary": "Creative Graphic Designer with 2-4 years of experience needed to produce brand-aligned marketing assets using Adobe tools. Requires strong visual storytelling and collaboration skills."
    },
    {
        "job_title": "Sr.DevSecOps Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21896/312",
        "location": "Infopark",
        "closing_date": "03 Feb 2026",
        "job_description": "<h2>Senior DevSecOps Engineer</h2>\n<p>We are seeking a <strong>Senior DevSecOps Engineer</strong> to lead our cybersecurity, infrastructure automation, and DevSecOps practices as we transition to a secure, scalable, and modern engineering environment. This role will strengthen 2Base’s security posture, modernize pipelines, and foster a secure-by-design culture. You will collaborate with engineering, product, and leadership teams to ensure systems, applications, and cloud environments are secure, reliable, and future-ready.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define, implement, and enforce security standards, policies, and best practices across cloud and on-prem environments.</li>\n<li>Conduct security risk assessments, vulnerability scans, penetration testing, and execute mitigation plans.</li>\n<li>Architect and enhance secure CI/CD pipelines with automated compliance and governance checkpoints.</li>\n<li>Promote a \"Security First\" culture across engineering teams.</li>\n<li>Monitor, detect, investigate, and respond to security threats, incidents, breaches, and anomalies.</li>\n<li>Develop Infrastructure-as-Code practices using Terraform, Ansible, and automation frameworks.</li>\n<li>Design secure cloud architectures on AWS, Azure, or GCP for scalable, compliant deployments.</li>\n<li>Build and secure containerized environments with Docker and Kubernetes.</li>\n<li>Implement secure monitoring, logging, SIEM, and alerting systems.</li>\n<li>Improve system reliability, scalability, performance, and fault tolerance.</li>\n<li>Mentor DevOps engineers in secure development and operational excellence.</li>\n<li>Lead technical strategy, tool selection, and DevSecOps roadmap execution.</li>\n<li>Collaborate with BA, PM, and Engineering teams to align security and delivery goals.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>4–8 years in DevOps, Cloud, or Infrastructure engineering with strong security exposure.</li>\n<li>Hands-on CI/CD tools (Jenkins, GitLab CI, GitHub Actions).</li>\n<li>Expertise in AWS, Azure, or GCP with secure architecture focus.</li>\n<li>Proficiency in Infrastructure-as-Code (Terraform, Ansible).</li>\n<li>Experience securing Docker and Kubernetes environments.</li>\n<li>Networking knowledge (LAN/WAN, firewalls, VPN, load balancers).</li>\n<li>Familiarity with security frameworks (OWASP, NIST, CIS Benchmarks).</li>\n<li>Monitoring/logging tools (Prometheus, Grafana, ELK, CloudWatch, SIEM).</li>\n<li>Scripting skills (Python, Bash, Shell).</li>\n<li>Strong troubleshooting, analytical, and communication skills.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <a href=\"mailto:careers@2basetechnologies.com\">careers@2basetechnologies.com</a>.</p>",
        "tags": [
            "4–8 Years",
            "Terraform",
            "AWS",
            "Kubernetes"
        ],
        "summary": "Lead cybersecurity and DevSecOps practices, modernize secure pipelines, and architect scalable cloud environments with infrastructure automation and containerization."
    },
    {
        "job_title": "IT Business Coordinator (0-3 Years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/21883/109",
        "location": "Infopark",
        "closing_date": "04 Feb 2026",
        "job_description": "<p><strong>Position</strong>: IT Business Coordinator\n<strong>Experience</strong>: Junior Level (0 to 3 years)\n<strong>Vacancy</strong>: 2\n<strong>Work Timing</strong>: 2pm to 11pm</p>\n<h3>Responsibilities</h3>\n<ul>\n<li><strong>Lead Extraction</strong>:</li>\n<li>Use predefined criteria to identify and extract potential leads.</li>\n<li>Collect contact information (emails, phone numbers).</li>\n<li>\n<p>Conduct initial lead qualification based on company criteria.</p>\n</li>\n<li>\n<p><strong>Lead Research</strong>:</p>\n</li>\n<li>Research additional lead data via internet, social media, and digital platforms.</li>\n<li>Document LinkedIn/social media profiles of leads and clients.</li>\n<li>\n<p>Analyze competitors, prospective clients, and existing clients.</p>\n</li>\n<li>\n<p><strong>Outreach Campaigns</strong>:</p>\n</li>\n<li>Assist Digital Marketing (DM) and sales teams in outbound email campaigns.</li>\n<li>\n<p>Draft personalized emails to gauge client interest.</p>\n</li>\n<li>\n<p><strong>Sales &amp; Marketing Support</strong>:</p>\n</li>\n<li>Assist DM team with blog posting (content provided).</li>\n<li>\n<p>Post content on company social media pages (graphics provided by SEO/content team).</p>\n</li>\n<li>\n<p><strong>Appointment Scheduling</strong>:</p>\n</li>\n<li>\n<p>Schedule demos/meetings between qualified leads and sales representatives.</p>\n</li>\n<li>\n<p><strong>CRM &amp; Tracker Management</strong>:</p>\n</li>\n<li>Enter lead/prospect data into CRM/lead tracker systems.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Attention to detail</li>\n<li>Accuracy</li>\n<li>Self-motivation and concentration for repetitive tasks</li>\n<li>Time management</li>\n<li>Multitasking</li>\n<li>Proficiency in spreadsheets, document editors, and Google Workspace</li>\n</ul>\n<p><strong>Contact</strong>: Share resume at career@newagesysindia.com</p>",
        "tags": [
            "0-3 Years",
            "Lead Extraction",
            "CRM Management",
            "Social Media Profiling"
        ],
        "summary": "The IT Business Coordinator supports sales and marketing by managing leads, conducting research, and executing outreach campaigns. Responsibilities include CRM management, social media profiling, and appointment scheduling to drive business growth."
    },
    {
        "job_title": "Sales Outreach Expert – US Market (1-3 Years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/21884/109",
        "location": "Infopark",
        "closing_date": "04 Feb 2026",
        "job_description": "<p><strong>Job Title:</strong> Sales Outreach Expert – US Market\n<strong>Location:</strong> Kakkanad, Kochi (Work From Office)\n<strong>Shift:</strong> 5 PM – 2 AM IST</p>\n<p><strong>Role Summary:</strong>\nWe are seeking a motivated professional with <strong>1–3 years of experience</strong> in outbound cold calling, specifically targeting US-based leads. The role involves initiating meaningful conversations with potential clients, understanding their needs, and effectively introducing our IT services.</p>\n<p><strong>Key Responsibilities:</strong>\n- Make outbound cold calls to US-based businesses.\n- Engage decision-makers and present company offerings.\n- Maintain detailed call records and follow-up schedules.\n- Support lead generation and qualification processes.\n- Coordinate with internal teams for next steps.</p>\n<p><strong>Requirements:</strong>\n- <strong>1–3 years</strong> of experience in outbound cold calling (preferably US market).\n- Strong English communication skills (verbal and written).\n- Prior experience in the IT services domain is advantageous.\n- Comfortable working night shifts (US time zone).</p>\n<p><strong>Contact:</strong> Apply by sharing your updated resume at <strong>career@newagesysindia.com</strong>.</p>",
        "tags": [
            "1-3 Years",
            "Outbound Cold Calling",
            "US Market",
            "IT Services"
        ],
        "summary": "Sales Outreach Expert with 1-3 years of experience in US market cold calling for IT services. Requires strong communication and night shift availability."
    },
    {
        "job_title": "Content Writer (2-4 Years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/21885/109",
        "location": "Infopark",
        "closing_date": "04 Feb 2026",
        "job_description": "<h2>Job Title</h2>\n<p><strong>Content Writer (2-4 Years)</strong></p>\n<h2>Job Location</h2>\n<p>Kakkanad, Kochi, Kerala (WHO)</p>\n<h2>Shift Timing</h2>\n<p>11 PM - 8 PM IST</p>\n<h2>What We’re Looking For:</h2>\n<ul>\n<li><strong>2+ years</strong> of experience in content writing (preferably IT/tech domain)</li>\n<li>Familiar with <strong>Google Helpful Content</strong>, <strong>E-A-T</strong>, and <strong>E-E-A-T</strong> updates</li>\n<li>Experience in <strong>SEO writing</strong>, <strong>Keyword optimization</strong>, <strong>technical writing</strong>, and <strong>sales documents</strong></li>\n<li>Ability to create content for both <strong>marketing</strong> and <strong>internal documentation</strong></li>\n<li><strong>Excellent writing</strong>, <strong>editing</strong>, and <strong>research skills</strong></li>\n</ul>\n<h2>How to Apply</h2>\n<p>Click <a href=\"#\">here</a> to apply now or email your updated resume to <a href=\"mailto:career@newagesysindia.com\">career@newagesysindia.com</a>.</p>",
        "tags": [
            "2-4 Years",
            "SEO Writing",
            "Technical Writing",
            "Google E-A-T/E-E-A-T"
        ],
        "summary": "Content Writer (2-4 Years) for IT/tech domain with SEO and technical writing expertise in Kochi. Apply via email."
    },
    {
        "job_title": ".NET Project Lead (Exp: 8+ Years)",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21900/41",
        "location": "Infopark",
        "closing_date": "05 Feb 2026",
        "job_description": "<p><strong>.NET Project Lead (Exp: 8+ Years)</strong></p>\n<p>We are seeking an experienced <strong>.NET Project Lead</strong> to oversee project execution, guide development teams, and manage client interactions. This <strong>contract-based</strong> role demands strong technical expertise, excellent communication skills, and the ability to handle <strong>end-to-end project management</strong>.</p>\n<p><strong>Key Responsibilities:</strong>\n- Lead and mentor a <strong>.NET development team</strong>, overseeing project workflows\n- Manage client interactions, including <strong>requirement gathering</strong>, clarifications, demos, and status updates\n- Translate client expectations into clear technical tasks for the team\n- Design and develop applications using <strong>.NET / .NET Core</strong>\n- Develop and optimize <strong>Web APIs</strong> and ensure smooth integration with front-end applications\n- Conduct code reviews and enforce coding standards and best practices\n- Collaborate with <strong>QA, UI/UX, and product teams</strong> throughout the SDLC\n- Troubleshoot complex technical issues and ensure timely resolution\n- Work with <strong>MSSQL/MySQL</strong> and write efficient, optimized queries\n- Prepare clear technical documentation and project reports</p>\n<p><strong>Requirements:</strong>\n- <strong>8+ years</strong> of experience working with <strong>C#, .NET Framework / .NET Core</strong>\n- Proven experience leading small teams or development modules\n- Strong knowledge of <strong>Web API development</strong> and <strong>Entity Framework</strong>\n- Excellent communication and client-handling skills\n- Strong understanding of <strong>OOP, design patterns</strong>, and clean coding principles\n- Ability to manage timelines, priorities, and delivery quality\n- <strong>Knowledge of Angular</strong> is an added advantage\n- Experience in <strong>contract-based</strong> or fast-paced project environments is a plus</p>\n<p><strong>Contact:</strong> Share your updated resume at <strong>career@lucidplus.com</strong>.</p>",
        "tags": [
            "8+ Years",
            ".NET",
            "Web API",
            "C#"
        ],
        "summary": "Lead .NET projects, manage teams, and handle client interactions. Requires 8+ years of C#/.NET expertise and strong project management skills."
    },
    {
        "job_title": "Field Sales Executive – IT Sales (Exp: 0 - 1 Year)",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21901/41",
        "location": "Infopark",
        "closing_date": "05 Feb 2026",
        "job_description": "<p><strong>Field Sales Executive – IT Sales (Exp: 0 - 1 Year)</strong></p>\n<p>We are hiring energetic, confident <strong>Field Sales Executives</strong> eager to start a career in <strong>IT Sales</strong>. This role includes a mix of <strong>office-based lead generation</strong> and <strong>local client visits</strong>. This is an ideal opportunity for <strong>freshers</strong> who want <strong>fast learning</strong>, <strong>real client exposure</strong>, and <strong>quick career growth</strong>.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Identify potential clients and generate leads via calls, emails, LinkedIn, and field visits</li>\n<li>Understand client requirements and present IT solutions</li>\n<li>Manage and maintain CRM records and sales pipeline</li>\n<li>Conduct field visits to meet clients and build relationships (requires travel within assigned territory)</li>\n<li>Work towards monthly/quarterly targets with independence and accountability</li>\n<li>Collaborate with internal teams to ensure smooth onboarding of clients</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor’s degree (BBA/MBA preferred but not mandatory)</li>\n<li>Male candidates preferred</li>\n<li>Strong communication skills (English + Malayalam preferred)</li>\n<li>High energy, positive attitude, and target-driven mindset</li>\n<li>Proactive, self-motivated, and capable of working independently</li>\n<li>Willingness to travel for fieldwork as part of sales activities</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>Initial guidance and structured training in sales processes</li>\n<li>Exposure to clients across Kerala and beyond</li>\n<li>Opportunity to build a rewarding career in IT sales</li>\n<li>Fast-track growth for high performers</li>\n<li>Collaborative and learning-focused work environment</li>\n</ul>\n<p><strong>Contact:</strong> Share your updated resume at <strong>career@lucidplus.com</strong></p>",
        "tags": [
            "0-1 Year",
            "IT Sales",
            "Client Relationship Management",
            "Lead Generation"
        ],
        "summary": "Seeking a 0-1 year experienced Field Sales Executive to generate IT sales leads, conduct client visits, and manage CRM. Offers training, client exposure, and career growth in Kerala."
    },
    {
        "job_title": "Social Media Marketing Intern",
        "company": "Apro IT Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21881/420",
        "location": "Infopark",
        "closing_date": "06 Feb 2026",
        "job_description": "<p><strong>Social Media Marketing Intern</strong></p>\n<p>We are a fast-growing IT solutions and digital marketing firm seeking a motivated <strong>Social Media Marketing Intern</strong> to join our team. This role is ideal for someone passionate about creating content, tracking trends, and maintaining a strong social media presence for brands. You will manage client platforms, plan content calendars, and coordinate between teams and clients while ensuring organized reporting and performance tracking.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage clients’ social media platforms (Instagram, Facebook, LinkedIn, X, etc.) with timely, relevant, and engaging content.</li>\n<li>Generate fresh, trend-driven ideas to creatively showcase client brands.</li>\n<li>Create and manage monthly content calendars aligned with client brand tone and objectives.</li>\n<li>Schedule and publish posts per approved timelines.</li>\n<li>Collaborate with design and copywriting teams for brand-aligned visuals and captions.</li>\n<li>Conduct quality checks on live posts and ensure brand consistency.</li>\n<li>Coordinate with clients to meet deliverables and maintain clear communication.</li>\n<li>Update reports and performance trackers for internal reviews and feedback.</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Exposure to social media or content marketing work.</li>\n<li>Understanding of major social platforms and organic engagement best practices.</li>\n<li>Creativity, visual storytelling, and brand voice alignment.</li>\n<li>Strong organization, coordination, and follow-up skills.</li>\n<li>Familiarity with tools like Canva, Meta Business Suite, Hootsuite, or Buffer.</li>\n<li>Keen eye for trending content styles and social media aesthetics.</li>\n</ul>\n<h3>What You’ll Gain:</h3>\n<ul>\n<li>Real-world experience managing live client social media accounts.</li>\n<li>Foundation in content planning, brand communication, and client management.</li>\n<li>Mentorship from senior digital marketing professionals.</li>\n<li>Opportunities to contribute to creative brainstorming and campaign ideation.</li>\n</ul>\n<h3>Success Metrics:</h3>\n<ul>\n<li>Timely delivery of content calendars.</li>\n<li>Consistent brand representation across platforms.</li>\n<li>Effective client communication and deliverable management.</li>\n<li>Accuracy in reporting and documentation.</li>\n<li>Client satisfaction and feedback on coordination/creativity.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>hr@aproitsolutions.in</strong>.</p>",
        "tags": [
            "Entry Level",
            "Social Media Management",
            "Content Creation",
            "Canva/Hootsuite"
        ],
        "summary": "Social Media Marketing Intern managing client platforms, creating content, and collaborating with teams. Gains real-world experience, mentorship, and client management skills."
    },
    {
        "job_title": "Senior Business Development Executive",
        "company": "Fingent Global Solutions",
        "url": "https://infopark.in/company-jobs/details/21889/83",
        "location": "Infopark",
        "closing_date": "06 Feb 2026",
        "job_description": "<p><strong>Senior Business Development Executive</strong></p>\n<p>At Fingent, we believe that technology can make a meaningful difference to the lives around us. The lives of those who use it, the lives of those who build it, and to society at large. We create and provide software which is beautiful, usable, and compelling, to solve complex business challenges. We nurture smart people who bring out the best in themselves, their peers, and their clients.</p>\n<h3><strong>Skill Sets</strong></h3>\n<ul>\n<li>Good client handling and relationship management skills</li>\n<li>Strong follow-up and closure support abilities</li>\n<li>Self-motivated and target-driven approach</li>\n<li>Professional communication and business etiquette</li>\n<li><strong>3–4 years of experience in Business Development / Sales in the IT services industry</strong></li>\n<li>Hands-on experience in service sales (custom software, IT consulting, digital transformation, etc.)</li>\n<li>Strong understanding of B2B sales processes and lead generation techniques</li>\n<li>Excellent communication, presentation, and negotiation skills</li>\n<li>Ability to understand both business needs and technical concepts</li>\n<li>Experience working with cross-functional teams</li>\n<li>Familiarity with CRM tools</li>\n</ul>\n<h3><strong>Roles &amp; Responsibilities</strong></h3>\n<ul>\n<li>Identify and generate new business opportunities through outbound prospecting, referrals, networking, and digital channels.</li>\n<li>Build and maintain a strong pipeline of qualified leads for IT service offerings.</li>\n<li>Engage with prospective clients to understand their business challenges and requirements.</li>\n<li>Manage assigned leads through the complete sales cycle: qualification, requirement analysis, proposal coordination, and closure support.</li>\n<li>Navigate sales funnels effectively to achieve targeted conversion ratios.</li>\n<li>Maintain accurate records of all sales activities in the CRM system.</li>\n<li>Communicate Fingent’s service offerings clearly and effectively to prospective clients.</li>\n<li>Assist in presenting customized IT solutions aligned with customer business needs.</li>\n<li>Develop a strong understanding of Fingent’s technology stack and service portfolio.</li>\n<li>Work closely with Presales, Marketing, and Delivery teams to support proposal development and client presentations.</li>\n<li>Coordinate internal inputs required for RFPs, proposals, and client discussions.</li>\n</ul>\n<p><strong>Contact</strong>: If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@fingent.com</strong>.</p>",
        "tags": [
            "3–4 Years",
            "Business Development",
            "IT Services Sales",
            "CRM Tools"
        ],
        "summary": "Senior Business Development Executive at Fingent drives IT services sales, requiring 3–4 years of experience in B2B sales and cross-functional collaboration to deliver customized solutions."
    },
    {
        "job_title": "Sr. Talent Acquisition Specialist (2 -5 YEARS)",
        "company": "GALTech Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21852/189",
        "location": "Infopark",
        "closing_date": "07 Feb 2026",
        "job_description": "<p><strong>Sr. Talent Acquisition Specialist (2–5 Years)</strong></p>\n<p>We are seeking a proactive Talent Acquisition Specialist to oversee the full recruitment lifecycle. The ideal candidate will attract, screen, and hire top talent while ensuring a positive candidate experience.</p>\n<p><strong>Roles &amp; Responsibilities:</strong>\n- Manage end-to-end recruitment for multiple roles\n- Source candidates via job portals, social media, referrals, and networking\n- Screen resumes, conduct initial interviews, and coordinate with hiring managers\n- Schedule and manage interviews and follow-ups\n- Handle offer negotiations and onboarding coordination\n- Build and maintain a strong talent pipeline</p>\n<p><strong>Required Skills &amp; Qualifications:</strong>\n- Bachelor’s degree in HR, Business, or related field\n- 2–5 years of experience in recruitment or talent acquisition\n- Proficiency in sourcing techniques and job portals\n- Strong communication and interpersonal skills\n- Ability to manage multiple positions simultaneously\n- Familiarity with ATS and MS Office</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@galtech.org</strong>.</p>",
        "tags": [
            "2–5 Years",
            "Sourcing Techniques",
            "ATS",
            "MS Office"
        ],
        "summary": "A Senior Talent Acquisition Specialist is needed to manage full-cycle recruitment, source candidates, and coordinate hiring processes for diverse roles."
    },
    {
        "job_title": "Team Lead",
        "company": "Emsyne Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21897/76",
        "location": "Infopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>Team Lead</h2>\n<ul>\n<li><strong>Minimum 3+ years</strong> of experience in a Technical Lead or senior development role.</li>\n<li><strong>Experience</strong> in delivering enterprise applications (Housing Finance / Mortgage domain preferred).</li>\n<li><strong>Proven experience</strong> acting as a technical bridge between business stakeholders and development teams in delivery-focused roles.</li>\n<li><strong>Strong hands-on expertise</strong> in:</li>\n<li>.NET (4.8 / 6+) and C#</li>\n<li>ASP.NET Web API and RESTful services</li>\n<li>SQL Server (query writing, stored procedures, performance tuning)</li>\n<li>CI/CD pipelines and Git-based development workflows</li>\n<li><strong>Solid understanding</strong> of Agile / Scrum delivery practices.</li>\n<li><strong>Hands-on experience</strong> with ORM frameworks such as Entity Framework and Dapper.</li>\n<li><strong>Exposure</strong> to modern application architectures (layered, microservices, and event-driven).</li>\n</ul>\n<p><strong>Contact:</strong> Share your updated resume at jobs@emsyne.com if this opportunity aligns with your career goals.</p>",
        "tags": [
            "3+ Years",
            ".NET / C#",
            "SQL Server",
            "CI/CD"
        ],
        "summary": "Seeking a Team Lead with 3+ years in technical leadership, enterprise application delivery, and expertise in .NET, SQL Server, and CI/CD pipelines."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Linnk Outsource Solutions India Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21904/484",
        "location": "Infopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p>We are seeking a dynamic <strong>Business Development Executive</strong> to support the growth of our academy. In this role, you will:\n- Generate leads and drive student enrollments\n- Build strategic partnerships with schools and institutions\n- Conduct market research to identify growth opportunities\n- Promote educational programs through persuasive communication\n- Manage client relationships and expand our reach in the education sector</p>\n<p><strong>Experience Required</strong>: 0–6 months</p>\n<p><strong>Key Skills</strong>: \n- Sales &amp; lead generation\n- Relationship building\n- Market research\n- Persuasive communication\n- Networking\n- Client management</p>\n<p>This role is ideal for a motivated individual passionate about sales and education, who thrives on building connections and contributing to business growth. For consideration, please share your updated resume at <strong>theertha.ajay@linnk.com</strong>.</p>",
        "tags": [
            "0–6 Months",
            "Sales & Lead Generation",
            "Relationship Building",
            "Market Research"
        ],
        "summary": "Seeking a motivated Business Development Executive to drive student enrollments and strategic partnerships in the education sector. Requires 0–6 months of experience with skills in sales, relationship building, and market research."
    },
    {
        "job_title": "Backend Engineer-Integrations & API Orchestration",
        "company": "InApp Information Technologies India Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21853/329",
        "location": "Infopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Backend Engineer - Integrations &amp; API Orchestration</h2>\n<p><strong>Experience Required:</strong> 5-8 years</p>\n<h3>Role Summary</h3>\n<p>Responsible for building backend services, integrating with ACC/Procore/SharePoint, developing the Tool Server, and implementing the orchestration layer that wires agents together.</p>\n<h3>Mandatory Skills</h3>\n<ul>\n<li>Node.js</li>\n<li>FastAPI</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong experience with backend frameworks (FastAPI, Node.js, or .NET)</li>\n<li>Experience integrating REST APIs and OAuth-based authentication</li>\n<li>Proficiency in building service-oriented backends and microservices</li>\n<li>Familiarity with constructing connectors for third-party systems</li>\n<li>Experience with logging, retries, error handling, and async workflows</li>\n<li>Experience deploying on Azure or similar cloud platforms</li>\n<li>Understanding of interacting with LLM-based service layers is a plus</li>\n</ul>\n<h3>Contact</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@inapp.com</strong>.</p>",
        "tags": [
            "5-8 Years",
            "Node.js",
            "FastAPI",
            "Azure"
        ],
        "summary": "Backend Engineer builds integrations and API orchestration using Node.js/FastAPI, with expertise in cloud deployment and microservices."
    },
    {
        "job_title": "Business Development Trainee",
        "company": "SE-Mentor Solutions",
        "url": "https://infopark.in/company-jobs/details/21849/483",
        "location": "Infopark",
        "closing_date": "21 Feb 2026",
        "job_description": "<p><strong>Business Development Trainee</strong></p>\n<p>We are seeking a driven and enthusiastic <strong>Business Development Trainee</strong> for our <strong>Kochi</strong> location. This role is ideal for candidates with <strong>0–1 year of experience</strong> eager to gain practical exposure to business development, presales, and client engagement activities.</p>\n<h3>Internship Duration &amp; Location</h3>\n<ul>\n<li><strong>Duration</strong>: 6 Months</li>\n<li><strong>Location</strong>: Kochi</li>\n</ul>\n<h3>Key Duties and Responsibilities</h3>\n<ul>\n<li>Identify and research new business opportunities through market analysis, online research, and networking.</li>\n<li>Assist in engaging prospective clients to understand their needs and support solution presentations.</li>\n<li>Prepare proposals, presentations, pitch decks, and presales materials.</li>\n<li>Maintain client relationships to ensure satisfaction and identify upselling/cross-selling opportunities.</li>\n<li>Collaborate with sales and marketing teams on lead-generation and outreach strategies.</li>\n<li>Update CRM systems with lead and client data.</li>\n<li>Track sales activities and report on metrics and performance against targets.</li>\n</ul>\n<h3>Qualifications and Requirements</h3>\n<ul>\n<li>Currently pursuing or recently completed a Master’s degree in Business Administration, Marketing, or a related field.</li>\n<li><strong>0–1 year of experience</strong> (internships, academic projects, or part-time roles) in business development, sales, or client-facing roles.</li>\n<li>Strong interest in business development, presales, and sales strategy.</li>\n<li>Ability to communicate service offerings and business value clearly.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Proficiency in Microsoft Office Suite; CRM tools knowledge is an advantage.</li>\n<li>Self-motivated, eager to learn, and team-oriented.</li>\n</ul>\n<h3>What You Will Gain</h3>\n<ul>\n<li>Hands-on experience in business development and presales.</li>\n<li>Exposure to client interaction and real-time sales processes.</li>\n<li>Professional mentorship and skill development.</li>\n<li>Potential full-time employment opportunity based on performance.</li>\n</ul>\n<p><strong>Contact</strong>: Share your resume at <strong>akshay.r@se-mentor.com</strong>.</p>",
        "tags": [
            "0–1 Year",
            "CRM Tools",
            "Microsoft Office Suite",
            "Business Development"
        ],
        "summary": "Seeking a motivated Business Development Trainee in Kochi with 0–1 years of experience to support sales and client engagement. Offers hands-on training, mentorship, and potential full-time employment."
    },
    {
        "job_title": "Senior Linux System Administrator",
        "company": "Vtrio Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21862/119",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<p><strong>Senior Linux System Administrator</strong></p>\n<ul>\n<li><strong>Minimum 5+ years</strong> Operations Experience in 24x7 high-availability mixed Linux/Windows production environments.</li>\n<li><strong>Lead and manage</strong> a team of Linux System Administrators to ensure smooth daily operations.</li>\n<li><strong>Provide technical guidance and mentoring</strong> to team members.</li>\n<li><strong>Manage shift schedules</strong> and coordinate team activities.</li>\n<li><strong>Administer Linux and Windows servers</strong>, ticketing systems, and cPanel-based hosting environments.</li>\n<li><strong>Experience in AWS</strong> cloud infrastructure and services.</li>\n<li><strong>Fundamental understanding</strong> of Network and Load Balancing technologies.</li>\n<li><strong>Familiarity with scripting</strong> on Bash/Python/Ruby (preferred).</li>\n<li><strong>Strong written and verbal communication</strong> skills for collaboration with clients and customers.</li>\n</ul>\n<p><strong>Contact:</strong>\n- Email resumes to <strong>hr@vtrio.com</strong> if this opportunity aligns with your career goals.</p>",
        "tags": [
            "5+ Years",
            "Linux",
            "AWS",
            "Bash/Python/Ruby"
        ],
        "summary": "Senior Linux System Administrator leads team operations, manages Linux/Windows servers, and AWS environments with scripting skills."
    },
    {
        "job_title": "Java Developer (Spring Boot & Angular)",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/21845/401",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Java Developer (Spring Boot &amp; Angular)</strong></p>\n<p><strong>Experience:</strong> 5–10 Years\n<strong>Qualification:</strong> B.E / B.Tech, MCA, or other Computer/IT related field</p>\n<p><strong>Key Responsibilities:</strong>\n- Design, develop, and maintain scalable enterprise-level applications\n- Develop RESTful services and backend components using Java and Spring Boot\n- Collaborate with cross-functional teams in an Agile (Scrum) environment\n- Participate in sprint planning, daily stand-ups, reviews, and retrospectives\n- Ensure application performance, security, and scalability\n- Conduct code reviews and follow best development practices\n- Debug, troubleshoot, and optimize existing applications</p>\n<p><strong>Requirements:</strong>\n- 5–10 years of experience in Java application development\n- Strong hands-on expertise in Java and Spring Boot\n- Good to have working knowledge of Angular\n- Experience working on enterprise applications following standard Agile processes\n- Solid understanding of object-oriented programming and design principles\n- Good communication, analytical, and problem-solving skills\n- Ability to work effectively in a collaborative team environment</p>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>joinus@pearlsofttechnologies.com</strong></p>",
        "tags": [
            "5–10 Years",
            "Java",
            "Spring Boot",
            "Angular"
        ],
        "summary": "Seeking a Java Developer with 5–10 years of experience to design and develop scalable enterprise applications using Spring Boot and Angular. Requires expertise in Java, Agile processes, and collaboration in cross-functional teams."
    },
    {
        "job_title": "Manager- Sales & marketing",
        "company": "Dynamed Healthcare Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21854/132",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Job Summary</h2>\n<p>We are seeking a <strong>results-driven Marketing Manager</strong> to generate qualified leads, convert prospects into clients, and drive revenue growth for our branding, design, digital marketing, PR, SEO, and paid marketing services. The ideal candidate must have expertise in agency-style service selling, digital channels, and client acquisition strategies.</p>\n<h2>Key Responsibilities</h2>\n<h3>Lead Generation &amp; Sales</h3>\n<ul>\n<li>Develop and execute lead generation strategies for branding, design, social media, SEO, paid marketing, and PR services</li>\n<li>Identify potential clients through digital channels, outbound campaigns, partnerships, and networking</li>\n<li>Qualify inbound/outbound leads and convert them into sales opportunities</li>\n<li>Conduct client presentations, proposals, and pitch meetings</li>\n<li>Close deals to meet monthly/quarterly revenue targets</li>\n<li>Maintain sales pipeline and CRM</li>\n</ul>\n<h3>Service-Specific Marketing &amp; Selling</h3>\n<p><strong>Branding &amp; Design Services</strong>\n- Pitch brand identity, visual design systems, brand audits, and marketing collaterals\n- Collaborate with creative teams on proposals and case studies</p>\n<p><strong>Social Media Creative Development &amp; Management</strong>\n- Sell monthly social media packages, campaign-based creatives, and platform-specific content\n- Highlight analytics, engagement, and brand growth as measurable outcomes</p>\n<p><strong>Communication &amp; PR</strong>\n- Generate leads for press releases, media coordination, reputation management, and event PR\n- Build relationships with brands, startups, and corporate communication teams</p>\n<p><strong>Marketing Materials</strong>\n- Promote corporate profiles, pitch decks, sales kits, product catalogues, and campaign content</p>\n<p><strong>SEO Services</strong>\n- Identify businesses needing SEO and pitch customized solutions\n- Communicate SEO benefits, timelines, and performance reporting</p>\n<p><strong>Paid Marketing</strong>\n- Generate and close leads for Google, Meta, and LinkedIn ad campaigns\n- Explain campaign strategy, A/B testing, lead tracking, and optimization</p>\n<h3>Strategy, Planning &amp; Reporting</h3>\n<ul>\n<li>Create marketing/sales strategies aligned with business goals</li>\n<li>Track campaign performance, lead quality, conversion rates, and ROI</li>\n<li>Prepare weekly/monthly sales/lead performance reports</li>\n<li>Collaborate with internal teams for smooth post-sale onboarding/delivery</li>\n</ul>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li>Proven experience as a Marketing Manager/Business Development/Sales Manager in a digital marketing/creative agency</li>\n<li>Strong knowledge of branding, social media, SEO, paid ads, and PR services</li>\n<li>Excellent communication, negotiation, and presentation skills</li>\n<li>Ability to generate leads independently and close high-value deals</li>\n<li>Experience with CRM tools, proposal creation, and reporting</li>\n<li>Data-driven mindset focused on revenue and growth</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience handling B2B and corporate clients</li>\n<li>Understanding of digital marketing KPIs and analytics</li>\n<li>Prior experience selling retainer-based marketing services</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>anoop.rajan@dynamedhealth.com</strong></p>",
        "tags": [
            "3-5 Years",
            "Digital Marketing",
            "CRM Tools",
            "B2B Sales"
        ],
        "summary": "A Marketing Manager driving revenue through lead generation, client acquisition, and strategic sales of branding, digital marketing, and PR services."
    },
    {
        "job_title": "Immediate Opening for AIML",
        "company": "Aspire Systems Digital Private Limited",
        "url": "https://infopark.in/company-jobs/details/21855/36",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Immediate Opening for AI/ML</h2>\n<p><strong>Experience:</strong> 3-7 Years\n<strong>Location:</strong> Chennai/Bangalore/Kochi\n<strong>Notice Period:</strong> Immediate to 15 days</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead design and development of <strong>Computer Vision</strong> and <strong>NLP</strong>-based AI solutions using <strong>Deep Learning</strong> frameworks.</li>\n<li>Architect and implement production-ready <strong>ML pipelines</strong> using <strong>MLFlow</strong>, <strong>Kubeflow</strong>, and containerized environments.</li>\n<li>Build, fine-tune, and deploy models using <strong>TensorFlow</strong>, <strong>Keras</strong>, and <strong>PyTorch</strong>.</li>\n<li>Collaborate with data engineering teams to design data pipelines for model training and inference.</li>\n<li>Establish <strong>MLOps</strong> best practices including model versioning, monitoring, CI/CD, and governance.</li>\n<li>Mentor junior data scientists and ML engineers.</li>\n<li>Translate business problem statements into AI solutions through stakeholder collaboration.</li>\n<li>Optimize models for performance, scalability, and cost in <strong>Azure/AWS/GCP</strong> environments.</li>\n<li>Ensure compliance with <strong>responsible AI</strong>, privacy, and security standards.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>Deep Learning</strong> for <strong>Computer Vision</strong></li>\n<li><strong>TensorFlow</strong>, <strong>Keras</strong>, <strong>PyTorch</strong></li>\n<li><strong>NLP</strong> and <strong>LLM/GenAI</strong> frameworks</li>\n<li><strong>MLFlow</strong>, <strong>Kubeflow</strong> for MLOps</li>\n<li>End-to-end ML pipeline development and production deployment</li>\n<li><strong>Python</strong> programming with AI/ML libraries</li>\n<li><strong>RAG architectures</strong>, embeddings, vector databases</li>\n<li>Model monitoring, retraining strategies, and ML CI/CD</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li><strong>Docker</strong>, <strong>Kubernetes</strong>, cloud platforms</li>\n<li><strong>OCR</strong>, document processing, video analytics</li>\n<li><strong>LangChain</strong>, <strong>LlamaIndex</strong>, GenAI orchestration</li>\n<li><strong>Airflow</strong>, <strong>Spark</strong>, <strong>Kafka</strong></li>\n<li>Large dataset and distributed training experience</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>malavika.sabu@aspiresys.com</strong></p>",
        "tags": [
            "3-7 Years",
            "Deep Learning",
            "MLFlow/Kubeflow",
            "TensorFlow/PyTorch"
        ],
        "summary": "Lead AI/ML solutions with deep learning and MLOps expertise in computer vision/NLP. Requires 3-7 years of experience in production ML pipelines and cloud deployment."
    },
    {
        "job_title": "Immediate Opening for Technical Project Manager /APM (Dot Net )",
        "company": "Aspire Systems Digital Private Limited",
        "url": "https://infopark.in/company-jobs/details/21857/36",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Technical Project Manager / APM (Dot Net)</h2>\n<p><strong>Location:</strong> Chennai, Kochi, Bangalore\n<strong>Experience:</strong> 10 to 16 Years</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Must have proven experience with Project management</li>\n<li>Actively involved in code reviews and understanding of Design Patterns, Agile &amp; Metrics</li>\n<li>Experience in technical architecture/solutions of applications</li>\n<li>Strong troubleshooting skills and ability to provide direction in challenging situations</li>\n<li>Ensure overall project delivery excellence</li>\n<li>Manage revenue and cost (Direct and Total cost) - Optional</li>\n<li>Ensure projects understand product, technology, domain, and customer needs</li>\n<li>Develop/groom teams and support career aspirations</li>\n<li>Ensure compliance with organizational principles, practices, and processes</li>\n<li>Provide inputs to Account Managers for account mining opportunities and closures</li>\n<li>Participate in Sales Campaigns, webinars, promotional activities, and recruitment</li>\n<li>Create and maintain a Knowledge Repository</li>\n<li>Meet profitability expectations</li>\n<li>Achieve strategic customer objectives</li>\n<li>Maintain high customer satisfaction ratings</li>\n</ul>\n<h3>Contact:</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume at <strong>aryaraj.rajan@aspiresys.com</strong></p>",
        "tags": [
            "10+ Years",
            "Dot Net",
            "Agile",
            "Project Management"
        ],
        "summary": "Lead technical projects with Dot Net expertise, manage teams, and ensure customer satisfaction through Agile methodologies and strategic planning."
    },
    {
        "job_title": "Immediate Opening for Technical Project Manager (Python/Java/LAMP/Dot Net)",
        "company": "Aspire Systems Digital Private Limited",
        "url": "https://infopark.in/company-jobs/details/21858/36",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Technical Project Manager (Python/Java/LAMP/Dot Net)</h2>\n<p><strong>Location:</strong> Chennai, Kochi, Bangalore\n<strong>Experience:</strong> 12 to 15 Years</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Led end-to-end delivery of web and API projects, ensuring adherence to scope, timelines, and quality standards.</li>\n<li>Coordinated with cross-functional teams (developers, QA, DevOps) using Agile/Scrum methodology for sprints and releases.</li>\n<li>Oversaw application design and development with <strong>Java</strong>, <strong>Spring Boot</strong>, <strong>Hibernate</strong>, and <strong>RESTful APIs</strong>, ensuring scalability.</li>\n<li>Collaborated with frontend teams using <strong>ReactJS</strong>/<strong>Angular</strong> for backend integration.</li>\n<li>Defined project plans, tracked progress via <strong>JIRA</strong>/<strong>Azure DevOps</strong>, and provided stakeholder updates.</li>\n<li>Managed resource allocation, risk identification, and mitigation for on-time delivery.</li>\n<li>Participated in technical discussions, code reviews, and architectural decisions.</li>\n<li>Handled client communication, requirement gathering, and change management.</li>\n</ul>\n<p><strong>Contact:</strong> keerthana.jayaraj@aspiresys.com</p>",
        "tags": [
            "12-15 Years",
            "Java",
            "Spring Boot",
            "RESTful APIs"
        ],
        "summary": "Lead end-to-end web/API projects using Java/Spring Boot, manage Agile teams, and ensure client satisfaction with 12-15 years of experience."
    },
    {
        "job_title": "Operational Coordinator (Task, Project & ERP Support)",
        "company": "Spiralcode Innovates LLP",
        "url": "https://infopark.in/company-jobs/details/21859/507",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Role Overview</strong></p>\n<p>We are seeking an Operational Coordinator to manage project execution, coordinate teams, track tasks, and support ERP-based projects. This role requires strong follow-up skills, process discipline, and ERP functional understanding, making it ideal for someone who can bridge business needs and technical teams.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>Project &amp; Task Management</strong></li>\n<li>Plan, assign, and track project tasks across ERP and automation projects</li>\n<li>Monitor timelines, milestones, deliverables, and dependencies</li>\n<li>Ensure on-time completion of tasks with structured follow-ups</li>\n<li>\n<p>Maintain project trackers, schedules, and documentation</p>\n</li>\n<li>\n<p><strong>ERP Functional Support (Advantage)</strong></p>\n</li>\n<li>Understand ERP workflows (Sales, Purchase, Finance, HR, Inventory, CRM)</li>\n<li>Assist in requirement gathering, documentation, and validation</li>\n<li>Support ERPNext implementation activities and UAT coordination</li>\n<li>\n<p>Track ERP issues, enhancements, and testing feedback</p>\n</li>\n<li>\n<p><strong>Team &amp; Client Coordination</strong></p>\n</li>\n<li>Coordinate between ERP consultants, developers, QA, and clients</li>\n<li>Schedule meetings, demos, sprint reviews, and follow-ups</li>\n<li>Prepare MOM (Minutes of Meeting) and action trackers</li>\n<li>\n<p>Communicate progress, risks, and key updates to stakeholders</p>\n</li>\n<li>\n<p><strong>Operations &amp; Process Control</strong></p>\n</li>\n<li>Ensure Spiralcode SOPs and project standards are followed</li>\n<li>Identify risks, delays, and operational gaps</li>\n<li>Support workflow improvements and process optimization</li>\n<li>\n<p>Maintain structured reporting and performance tracking</p>\n</li>\n<li>\n<p><strong>Reporting &amp; Tools</strong></p>\n</li>\n<li>Maintain dashboards, KPIs, and project progress reports</li>\n<li>Work with ERPNext, Waves, ClickUp, Jira, Trello, or similar tools</li>\n<li>Generate weekly and monthly operational reports</li>\n</ul>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li><strong>Core Skills</strong></li>\n<li>Strong coordination, organization, and follow-up skills</li>\n<li>Excellent communication (English required; Malayalam preferred)</li>\n<li>Ability to manage multiple projects and deadlines</li>\n<li>\n<p>Process-oriented and detail-focused mindset</p>\n</li>\n<li>\n<p><strong>ERP &amp; Technical Advantage</strong></p>\n</li>\n<li>ERP functional knowledge (ERPNext / SAP / Odoo / Tally / similar)</li>\n<li>Understanding of business processes: Finance, HR, Inventory, Sales</li>\n<li>Experience in ERP implementation, support, or consulting is a plus</li>\n<li>Basic knowledge of IT/software project workflows</li>\n</ul>\n<p><strong>Preferred Candidate Profile</strong></p>\n<ul>\n<li>Experience in ERP, IT services, SaaS, or automation projects</li>\n<li>Familiar with business process mapping &amp; requirement analysis</li>\n<li>Responsible, proactive, and ownership-driven</li>\n<li>Passionate about structured execution and continuous improvement</li>\n</ul>\n<p><strong>📌 How to Apply</strong></p>\n<p>Interested candidates can apply through our careers page: <a href=\"https://www.spiralcode.in/career\">https://www.spiralcode.in/career</a></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@spiralcode.in</strong>.</p>",
        "tags": [
            "2-4 Years",
            "ERPNext",
            "ERP Functional Knowledge",
            "Project Management Tools"
        ],
        "summary": "Operational Coordinator to manage ERP and automation projects, coordinating teams and ensuring process discipline. Requires ERP functional knowledge and strong organizational skills."
    },
    {
        "job_title": "Software Engineer Trainee",
        "company": "Cloudium Software Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21860/158",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>About Us</strong></p>\n<p>Cloudium Software is a fast-growing tech company headquartered in Florida, with offices in Cochin and Vizag. We deliver cutting-edge digital solutions to industries like healthcare, insurance, and automotive, helping businesses transform digitally with custom-built services for SMBs and startups. Our flat organizational structure values collaboration, innovation, and every team member's contribution.</p>\n<p><strong>About the Role</strong></p>\n<p><strong>Role Designation:</strong> Software Engineer Trainee</p>\n<p><strong>Key Responsibilities</strong>\n- Take ownership of your learning journey by actively exploring company standards, tools, and technologies\n- Build foundational skills through hands-on assignments\n- Contribute to coding tasks and improve understanding of the development lifecycle\n- Shadow and learn from senior engineers by observing best practices and seeking feedback\n- Perform testing and debugging under guidance\n- Learn and practice using tools, frameworks, and technologies relevant to the role</p>\n<p><strong>Skills We’re Looking For</strong>\n- Foundational programming knowledge and problem-solving ability\n- Familiarity with version control systems (e.g., Git)\n- Understanding of basic coding principles and design concepts\n- Curiosity, initiative, and a self-starter mindset\n- Good verbal communication (English)</p>\n<p><strong>Work Experience Requirements</strong>\n- Freshers only</p>\n<p><strong>Who This Role Is Suited For</strong>\n- CGPA of 7.5 and above\n- Strong aptitude in math and logical reasoning\n- Clear intent of joining\n- Individuals with discipline and commitment</p>\n<p><strong>How to Apply</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@cloudium.io</strong>.</p>",
        "tags": [
            "Freshers",
            "Git",
            "Programming Fundamentals",
            "Problem Solving"
        ],
        "summary": "Cloudium Software seeks Software Engineer Trainees to build foundational skills through hands-on assignments and mentorship, ideal for freshers with strong problem-solving abilities and a commitment to learning."
    },
    {
        "job_title": "Product Designer Intern",
        "company": "YOUGotaGift Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21861/482",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Job Summary</h2>\n<p>We are seeking a <strong>Product Designer Intern</strong> to join our Product team. This internship offers hands-on experience in real-world product design, mentorship from seasoned designers, and the chance to contribute to live digital products. You will collaborate with product managers, developers, and designers to create intuitive, user-centric experiences for web and mobile platforms.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in designing user interfaces and user experiences for web and mobile applications.</li>\n<li>Translate product requirements into wireframes, user flows, mockups, and interactive prototypes.</li>\n<li>Collaborate with Product Managers, Developers, and Designers to refine designs based on stakeholder and user feedback.</li>\n<li>Conduct basic user research and usability testing, incorporating insights into design improvements.</li>\n<li>Support senior designers in refining visual designs, interaction patterns, and design consistency.</li>\n<li>Follow and maintain design guidelines, style guides, and design systems.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Currently pursuing or recently completed a degree in Design, HCI, UX/UI, Visual Design, or a related field, or equivalent practical experience.</li>\n<li>Basic understanding of UX principles, usability, and user-centered design.</li>\n<li>Familiarity with design tools such as Figma, Adobe XD, Sketch, or similar.</li>\n<li>Ability to create wireframes, mockups, and simple prototypes.</li>\n<li>Strong communication skills and willingness to learn and accept feedback.</li>\n<li>A portfolio showcasing academic, personal, or internship projects is a plus.</li>\n</ul>\n<h3>Good to Have:</h3>\n<ul>\n<li>Basic knowledge of HTML/CSS or front-end concepts.</li>\n<li>Exposure to design systems or accessibility standards.</li>\n<li>Curiosity about product thinking and problem-solving.</li>\n</ul>\n<h3>Location</h3>\n<p>Kozhikode, Kerala</p>\n<p><strong>Contact:</strong>\nEmail your resume to <strong>techcareers@yougotagift.com</strong>.</p>",
        "tags": [
            "Internship",
            "UX/UI",
            "Figma",
            "Design Systems"
        ],
        "summary": "Product Designer Intern to collaborate on web/mobile design, creating user interfaces and prototypes under mentorship."
    },
    {
        "job_title": "Junior Software Developer (.NET & JavaScript Frameworks)",
        "company": "Softop Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21863/462",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Junior Software Developer (.NET &amp; JavaScript Frameworks)</h2>\n<p>We are seeking a motivated and passionate <strong>Junior Software Developer</strong> to join our innovative development team. In this role, you will assist in the development and maintenance of web and mobile applications while working closely under the guidance of senior engineers. This is a fantastic opportunity for growth-oriented developers to sharpen their skills in a collaborative, professional environment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Code Contribution</strong>: Write clean, maintainable, and efficient code using C# / .NET Core for backend services.</li>\n<li><strong>UI Development</strong>: Assist in building user-facing features using modern JavaScript frameworks like Angular, AngularJS, or React.</li>\n<li><strong>Database Support</strong>: Help design and manage SQL Server databases, including writing and optimizing queries.</li>\n<li><strong>Testing &amp; Debugging</strong>: Identify, troubleshoot, and fix bugs to ensure the performance and reliability of applications.</li>\n<li><strong>Collaboration</strong>: Participate in team meetings, code reviews, and sprint planning to understand project requirements and standards.</li>\n<li><strong>Documentation</strong>: Assist in maintaining technical documentation for new features and system updates.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li><strong>Core Logic</strong>: Strong understanding of Object-Oriented Programming (OOP) principles using C#.</li>\n<li><strong>Web Fundamentals</strong>: Proficiency in HTML5, CSS3, and JavaScript.</li>\n<li><strong>Framework Exposure</strong>: Basic hands-on experience or academic projects using AngularJS, Angular, or React.</li>\n<li><strong>Database Basics</strong>: Knowledge of SQL Server and the ability to write basic CRUD operations and joins.</li>\n<li><strong>Soft Skills</strong>: Excellent problem-solving skills and a proactive \"eager-to-learn\" mindset.</li>\n<li><strong>Education</strong>: Bachelor’s degree in Computer Science, Information Technology, or a related field (or equivalent practical experience).</li>\n</ul>\n<h3>Nice to Have (Optional):</h3>\n<ul>\n<li>Familiarity with version control systems like Git.</li>\n<li>Exposure to reporting tools (e.g., SSRS, Power BI).</li>\n<li>Understanding of Agile/Scrum methodologies.</li>\n</ul>\n<h3>Contact Information:</h3>\n<ul>\n<li><strong>Application Deadline</strong>: 28-02-2026</li>\n<li><strong>Location</strong>: Kochi</li>\n<li><strong>Email</strong>: careers@softopsolutions.com</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "C# / .NET Core",
            "JavaScript Frameworks",
            "SQL Server"
        ],
        "summary": "Junior Software Developer role focusing on .NET and JavaScript frameworks for web/mobile apps, requiring 0-2 years of experience and foundational tech skills."
    },
    {
        "job_title": "Senior Magento Developer(Minimum 3-5 Years Experience)",
        "company": "9Commerce Technologies",
        "url": "https://infopark.in/company-jobs/details/21864/261",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Senior Magento Developer (Minimum 3-5 Years Experience)</h2>\n<p><strong>Location:</strong> Info park, Kochi\n<strong>Employment Type:</strong> Full-time (Work From Office)</p>\n<p>We are seeking a <strong>Senior Magento Developer</strong> with expertise in building and maintaining high-performing, scalable, enterprise-grade eCommerce applications. You will lead Magento application development and provide expertise across the full software development lifecycle, from concept and design to testing and documentation.</p>\n<h3>Must Haves:</h3>\n<ul>\n<li>Bachelor’s Degree in Computer Science or Computer Information Systems (preferred)</li>\n<li><strong>Minimum 2 years</strong> experience in Magento (preferably Magento 2) projects, including custom modules, payments, shipping, themes, and configurations</li>\n<li>Proficiency in <strong>Magento 2, PHP, MySQL, Ajax, HTML, CSS, XML, Knockout JS, GraphQL, API integration, Magento PWA</strong></li>\n<li>Experience with JavaScript frameworks like AngularJS, KnockoutJS, ReactJS</li>\n<li>Working experience in Magento upgrades and migrations</li>\n<li>Strong knowledge of <strong>PHP/MySQL</strong>, coding standards, design patterns, and database management systems (MySQL, MSSQL)</li>\n<li>Experience with PHP frameworks like ZEND and Drupal</li>\n<li>Familiarity with third-party APIs (Google, Facebook, etc.)</li>\n<li>Expertise in object-oriented analysis and design</li>\n<li>Proficiency in Scrum/Agile methodologies and full SDLC</li>\n<li>Experience with version control systems like GIT</li>\n</ul>\n<h3>Roles &amp; Responsibilities:</h3>\n<ul>\n<li>Support clients on real-time projects</li>\n<li>Execute full software development lifecycle (SDLC)</li>\n<li>Write well-designed, testable code</li>\n<li>Multitask across multiple projects</li>\n</ul>\n<p><strong>Interested candidates should email resumes to:</strong> hr@commerce9.io with the subject line <strong>\"Senior Magento Developer\"</strong> and include the following details:\n- Total Years of Exp\n- Relevant Exp\n- Current CTC\n- Expected CTC\n- Highest Qualification (Full time only)\n- Notice Period</p>",
        "tags": [
            "3-5 Years",
            "Magento 2",
            "PHP",
            "MySQL"
        ],
        "summary": "Senior Magento Developer needed for scalable e-commerce apps with 3-5 years experience in Magento 2, PHP, and MySQL. Requires full SDLC expertise and Agile methodology."
    },
    {
        "job_title": "Social Media & SEO Manager",
        "company": "Fine Destination",
        "url": "https://infopark.in/company-jobs/details/21865/497",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Key Responsibilities</strong></p>\n<ol>\n<li><strong>Oversee and grow social media channels</strong>: Create engaging content calendars, post schedules, and community management for LinkedIn (B2B networking), Instagram (visual travel stories), Facebook (client engagement), and emerging platforms to boost brand visibility and inquiries.</li>\n<li><strong>Lead SEO initiatives</strong>: Conduct keyword research, on-page/off-page optimization, and technical audits for websites focused on study abroad and travel services; track rankings and implement strategies to improve organic traffic using tools like Google Analytics, SEMrush, or Ahrefs.</li>\n<li><strong>Build and manage a content team</strong>: Recruit, train, and lead 2-4 junior creators/writers (SEO content specialists) to scale output; foster collaboration via Google Workspace and align with HRMS for performance tracking.</li>\n<li><strong>Analyse performance</strong>: Monitor KPIs (engagement rates, conversion funnels, ROI), generate monthly reports, and iterate strategies to reduce client acquisition costs in the competitive travel sector.</li>\n</ol>\n<p><strong>Qualifications &amp; Experience</strong></p>\n<ul>\n<li><strong>6+ years</strong> in social media management and SEO, ideally in travel/tourism, education consultancy, or B2B services; proven track record building pages from scratch.</li>\n<li>Expertise in platforms (LinkedIn Ads, Instagram, Facebook Insights) and SEO tools; hands-on with content creation (Canva, CapCut) and analytics.</li>\n<li>Team-building experience: Successfully hired/trained small digital teams in fast-paced settings.</li>\n<li>Willingness to build from ground zero, work UK shifts (evenings IST), and travel occasionally for shoots/events.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Strong in Indian digital marketing trends, multilingual content (English, Hindi, Malayalam for Kerala base).</li>\n<li>Bachelor's in Marketing/Digital Media; certifications in Google Analytics/SEO a plus.</li>\n</ul>\n<p><strong>Contact</strong>: If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>thr@finedestination.co.in</strong>.</p>",
        "tags": [
            "6+ Years",
            "SEO",
            "Social Media Management",
            "Google Analytics"
        ],
        "summary": "Manages social media and SEO for travel/education, leads content teams, improves online visibility. Requires 6+ years, SEO expertise, and team-building skills."
    },
    {
        "job_title": "PHP MySQL Internship",
        "company": "SaNDS Lab",
        "url": "https://infopark.in/company-jobs/details/21882/39",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>PHP MySQL Internship</h2>\n<p>We are seeking a motivated and enthusiastic intern to join our team as a PHP trainee. In this role, you will work closely with our development team to assist in various web development projects, utilizing your skills in PHP programming languages. This training offers a hands-on opportunity to gain valuable experience in real-world projects and enhance your skills in web development.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain web-based applications using PHP framework</li>\n<li>Collaborate with the team to identify, troubleshoot, and resolve software issues</li>\n<li>Write clean, well-designed, and efficient code following best practices</li>\n<li>Participate in all phases of software development life cycle</li>\n<li>Develop and maintain database schemas, queries, and scripts</li>\n<li>Collaborate with the team to design, develop, and integrate APIs</li>\n<li>Work with cross-functional teams to develop software solutions that meet client requirements</li>\n</ul>\n<h3>Training &amp; Selection:</h3>\n<ul>\n<li>The first two months will be provided as training with minimum cost</li>\n<li>Candidates will be selected based on their performance</li>\n<li>The number of positions available is 5</li>\n</ul>\n<h3>Contact Information:</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@sandslab.com</strong>.</p>",
        "tags": [
            "0-1 Years",
            "PHP",
            "MySQL",
            "API Development"
        ],
        "summary": "PHP trainee internship with hands-on training in web development, database management, and API integration. 5 positions available with potential for full-time placement after 2-month training."
    },
    {
        "job_title": "QA Intern",
        "company": "Nuvento Systems Private Limited",
        "url": "https://infopark.in/company-jobs/details/21886/58",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>QA Intern</h2>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Help create and run test plans and test cases.</li>\n<li>Identify and document defects and issues.</li>\n<li>Perform manual and automated testing.</li>\n<li>Work with developers and team members to understand requirements.</li>\n<li>Communicate test results and issues clearly.</li>\n<li>Update QA documentation and processes.</li>\n<li>Learn and apply QA best practices.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Any degree candidate (preferably in Computer Science, IT, or related field).</li>\n<li><strong>QA certification</strong></li>\n<li>Good verbal and written communication skills.</li>\n<li>Attention to detail and strong analytical skills.</li>\n<li>Basic understanding of software development and testing.</li>\n<li>Ability to work independently and in a team.</li>\n<li>Basic knowledge of automated testing tools is a plus.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>naseeba.parveen@nuvento.com</strong>.</p>",
        "tags": [
            "Internship",
            "QA Certification",
            "Automated Testing Tools",
            "Software Testing"
        ],
        "summary": "QA Intern role involves creating test plans, identifying defects, and collaborating with developers. Requires QA certification, communication skills, and basic software testing knowledge."
    },
    {
        "job_title": "HR Administrator",
        "company": "Planet Media India ( PMIN Agency Pvt.Ltd.)",
        "url": "https://infopark.in/company-jobs/details/21902/266",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>HR Administrator - Job Summary</h2>\n<p>We are seeking a proactive and organized HR Administrator to manage end-to-end HR operations, administrative activities, and client coordination for our healthcare services. The role involves recruitment, onboarding, compliance documentation, and regular communication with Australian clients.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Administration &amp; Documentation</strong>\n- Handle HR and administrative documentation including contracts, policies, and compliance records.\n- Ensure proper filing and digital storage of employee and client documents.\n- Support payroll, attendance, and leave management processes.\n- Maintain confidentiality of employee and organizational data.</p>\n<p><strong>HR &amp; Recruitment</strong>\n- Manage end-to-end recruitment processes including sourcing, screening, and scheduling interviews.\n- Coordinate employee onboarding and induction programs.\n- Verify and validate candidate qualifications, certifications, and background reports.\n- Maintain and update employee records and HR databases.</p>\n<p><strong>Client Communication (Australian Clients)</strong>\n- Communicate professionally with Australian healthcare clients via email, calls, and meetings.\n- Coordinate staffing requirements and compliance updates with clients.\n- Respond to client queries in a timely and accurate manner.\n- Maintain strong client relationships through regular follow-ups.</p>\n<p><strong>Compliance &amp; Reporting</strong>\n- Check and validate qualification reports, licenses, and regulatory documents.\n- Ensure adherence to healthcare industry standards and Australian compliance requirements.\n- Prepare and submit HR and compliance reports as required.</p>\n<p><strong>General Administration</strong>\n- Support day-to-day office operations.\n- Coordinate with internal teams for smooth workflow.\n- Assist management with reports, presentations, and audits.</p>\n<h3>Required Qualifications &amp; Skills</h3>\n<ul>\n<li>Bachelor’s degree in Human Resources, Business Administration, or related field.</li>\n<li>3 years of experience in HR/Admin (Healthcare experience preferred).</li>\n<li>Strong understanding of recruitment and onboarding processes.</li>\n<li>Experience in document verification and compliance checking.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to communicate effectively with international (Australian) clients.</li>\n<li>Proficiency in MS Office / Google Workspace and HR software.</li>\n<li>Strong organizational and multitasking abilities.</li>\n<li>Willingness to work in the early morning shift (6:00 AM – 3:00 PM).</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in healthcare staffing or medical recruitment.</li>\n<li>Knowledge of Australian healthcare compliance standards.</li>\n<li>Familiarity with HRMS / ATS tools.</li>\n<li>Customer service–oriented mindset.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@planetmedia.in</strong>.</p>",
        "tags": [
            "3 Years",
            "Healthcare HR",
            "Compliance Management",
            "Recruitment & Onboarding"
        ],
        "summary": "Seeking an HR Administrator to manage end-to-end HR operations, compliance, and client communication for healthcare services. Requires 3+ years of HR experience with a focus on recruitment and Australian healthcare compliance."
    },
    {
        "job_title": "UI/UX & Graphic Designer",
        "company": "AMIYON SOLUTIONS PVT LTD.",
        "url": "https://infopark.in/company-jobs/details/21888/117",
        "location": "Infopark",
        "closing_date": "02 Mar 2026",
        "job_description": "<p><strong>UI/UX &amp; Graphic Designer</strong></p>\n<p>We are seeking a creative and detail-oriented <strong>UI/UX Designer + Graphic Designer</strong> to join our team. This role is ideal for a passionate beginner who loves designing user-friendly digital experiences and creating eye-catching visual content. You will collaborate with product, marketing, and development teams to bring ideas to life.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>UI/UX Design</strong>\n- Design clean, modern, and user-friendly interfaces for web and mobile applications\n- Create wireframes, user flows, prototypes, and high-fidelity UI designs\n- Improve user experience based on feedback and usability best practices\n- Maintain design consistency using style guides and design systems\n- Collaborate with developers to ensure proper implementation of designs</p>\n<p><strong>Graphic Design</strong>\n- Create social media posts, banners, ads, and marketing creatives\n- Design branding materials such as logos, brochures, and presentations\n- Produce visual assets for websites, apps, and promotional campaigns\n- Ensure all designs align with brand guidelines</p>\n<h3>Required Skills</h3>\n<ul>\n<li>Basic understanding of UI/UX principles and design thinking</li>\n<li>Knowledge of <strong>Figma</strong> for UI design</li>\n<li>Knowledge of <strong>Photoshop</strong>, <strong>Illustrator</strong>, or <strong>Canva</strong> for graphic design</li>\n<li>Understanding of color, typography, and layout principles</li>\n<li>Ability to take feedback and improve designs</li>\n<li>Good communication and teamwork skills</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Basic knowledge of <strong>HTML/CSS</strong></li>\n<li>Experience working on live projects, internships, or personal design portfolios</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s degree or diploma in Design, Multimedia, Computer Applications, or related field (or equivalent practical skills)</li>\n<li>A portfolio showcasing UI/UX and graphic design work (academic or personal projects accepted)</li>\n</ul>\n<p><strong>Location:</strong> Infopark, Koratty, Thrissur\n<strong>Experience:</strong> 0–1 Year\n<strong>Job Type:</strong> Full-Time</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>thr@amiyon.com</strong>.</p>",
        "tags": [
            "0–1 Year",
            "Figma",
            "Photoshop/Illustrator/Canva",
            "UI/UX Design"
        ],
        "summary": "Creative UI/UX & Graphic Designer with 0-1 years experience designing user-friendly interfaces and visual content. Collaborates with teams to create digital and marketing materials."
    },
    {
        "job_title": "QA Engineer - AI Accuracy & Validation Testing",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/21903/401",
        "location": "Infopark",
        "closing_date": "02 Mar 2026",
        "job_description": "<h2>QA Engineer - AI Accuracy &amp; Validation Testing</h2>\n<p>We are seeking a QA Engineer to join our AI Quality Assurance team, focusing on <strong>accuracy, robustness, reliability, and ethical validation</strong> of AI/ML and Generative AI systems. This role goes beyond traditional QA and involves testing <strong>non-deterministic, data-driven, and probabilistic AI outputs</strong>.</p>\n<h3>Key Responsibilities</h3>\n<h4>AI-Specific Testing Responsibilities</h4>\n<ul>\n<li>Perform accuracy, validation, and consistency testing for AI/ML and Generative AI applications</li>\n<li>Test non-deterministic systems where the same input may produce different outputs</li>\n<li>Define and validate probabilistic acceptance criteria instead of fixed expected results</li>\n<li>Conduct model robustness testing using noisy, edge-case, and adversarial inputs</li>\n<li>Identify and report hallucinations in Generative AI (LLMs, chatbots, NLP systems)</li>\n<li>Perform prompt testing and prompt regression testing to ensure stable AI responses after model or prompt updates</li>\n<li>Validate explainability and justification of AI outputs (why a model produced a specific result)</li>\n<li>Execute fairness, bias, and ethical testing to detect skewed, unsafe, or discriminatory AI behaviour</li>\n</ul>\n<h4>Manual &amp; Automation Testing</h4>\n<ul>\n<li>Design and execute manual test cases for AI workflows, edge cases, and real-world scenarios</li>\n<li>Validate AI outputs against datasets, expected patterns, statistical thresholds, and business rules</li>\n<li>Develop and maintain automation scripts using <strong>Selenium with Python</strong> for AI-driven workflows</li>\n<li>Automate repetitive AI accuracy, regression, and validation tests</li>\n<li>Perform regression testing after model retraining, fine-tuning, or data updates</li>\n</ul>\n<h4>Collaboration &amp; Documentation</h4>\n<ul>\n<li>Work closely with AI/ML engineers and data teams to understand models, prompts, inputs, and outputs</li>\n<li>Analyse incorrect or inconsistent AI responses and log high-quality, detailed defects</li>\n<li>Work with structured and unstructured data (text, images, datasets) for testing</li>\n<li>Document test results, observations, risks, and AI improvement recommendations</li>\n<li>Participate in Agile/Scrum ceremonies and sprint QA activities</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Completed QA training in Manual and Automation Testing</li>\n<li>Strong understanding of testing fundamentals, SDLC, and STLC</li>\n<li><strong>Mandatory Python knowledge</strong> (academic projects or professional experience)</li>\n<li><strong>Mandatory experience or training in Selenium with Python</strong></li>\n<li>Ability to understand and test data-driven, logic-based, and AI-powered systems</li>\n<li>Strong analytical thinking and attention to detail</li>\n<li>Good verbal and written communication skills</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Basic understanding of AI/ML concepts (models, datasets, accuracy, precision, recall, etc.)</li>\n<li>Exposure to testing AI/ML applications, chatbots, NLP systems, LLMs, or recommendation engines</li>\n<li>Familiarity with PyTest or other Python-based automation frameworks</li>\n<li>Knowledge of test data preparation, validation, and labelling</li>\n<li>Familiarity with Agile/Scrum methodology</li>\n<li>Awareness of AI ethics, bias, and responsible AI principles</li>\n</ul>\n<h3>Education</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, IT, Engineering, Data Science, or a related field</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <a href=\"mailto:joinus@pearlsofttechnologies.com\">joinus@pearlsofttechnologies.com</a></p>",
        "tags": [
            "2-4 Years",
            "Python",
            "Selenium",
            "AI/ML Testing"
        ],
        "summary": "QA Engineer to test AI/ML systems for accuracy, robustness, and ethical compliance. Requires QA training, Python, and Selenium skills."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "Focaloid Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21898/366",
        "location": "Infopark",
        "closing_date": "03 Mar 2026",
        "job_description": "<p><strong>Senior Business Analyst</strong></p>\n<p>We are seeking a <strong>Senior Business Analyst</strong> to join our team and enhance our post-sales customer support. The ideal candidate will bring software industry experience, strong analytical capabilities, and a passion for customer service.</p>\n<p><strong>Responsibilities:</strong>\n- Gather and analyze customer requirements\n- Develop and maintain project plans\n- Coordinate with development teams to ensure timely, budget-compliant project delivery\n- Troubleshoot and resolve customer issues\n- Provide training and support to customers\n- Stay updated on the latest industry trends</p>\n<p><strong>Qualifications:</strong>\n- <strong>5+ years</strong> of experience in the software industry\n- Experience in post-sales support\n- Strong analytical and problem-solving skills\n- Excellent communication and interpersonal abilities\n- Ability to work independently and collaboratively\n- Passion for delivering exceptional customer service</p>\n<p><strong>Skills and Experience:</strong>\n- Strong understanding of the software development lifecycle\n- Experience with business analysis methodologies\n- Proficiency in project management tools and techniques\n- Excellent written and verbal communication skills</p>\n<p><strong>Contact:</strong>\nFor inquiries, email your resume to <strong>ajish.prabhakaran@focaloid.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Software Industry",
            "Project Management Tools",
            "Business Analysis Methodologies"
        ],
        "summary": "Senior Business Analyst with 5+ years in software industry to manage post-sales support, coordinate projects, and deliver customer training. Requires strong analytical skills, project management expertise, and excellent communication."
    },
    {
        "job_title": "Data Engineer - Python, SQL, Azure",
        "company": "Focaloid Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21899/366",
        "location": "Infopark",
        "closing_date": "03 Mar 2026",
        "job_description": "<h2>Data Engineer - Python, SQL, Azure</h2>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design and maintain data pipelines using ETL processes.</li>\n<li>Develop and optimize SQL queries for data extraction and transformation.</li>\n<li>Implement version-controlled workflows using Git.</li>\n<li>Create data models and visualizations in Power BI and Microsoft Fabric.</li>\n<li>Perform data analysis and support analytical workflows.</li>\n</ul>\n<h3>Skills Required</h3>\n<ul>\n<li><strong>Python</strong> for scripting and data processing.</li>\n<li><strong>SQL</strong> for querying and managing relational data.</li>\n<li><strong>Azure</strong> cloud services (e.g., Data Factory, Synapse).</li>\n<li><strong>ETL</strong> tools and frameworks.</li>\n<li><strong>Git</strong> for version control.</li>\n<li><strong>Power BI</strong> and <strong>Microsoft Fabric</strong> for data visualization and analytics.</li>\n<li>Strong communication and problem-solving skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>ajish.prabhakaran@focaloid.com</strong>.</p>",
        "tags": [
            "Not Specified",
            "Python",
            "SQL",
            "Azure"
        ],
        "summary": "Data Engineer role requiring Python, SQL, and Azure expertise to design pipelines, optimize queries, and create data visualizations."
    },
    {
        "job_title": "Hiring: Junior Full-Stack Engineer (Database & Data Modeling Focus)",
        "company": "Servsys Technology Services India Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21890/134",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Hiring: Junior Full-Stack Engineer (Database &amp; Data Modeling Focus)</h2>\n<p>📍 <strong>Location</strong>: Kochi, Kerala\n🧑‍💻 <strong>Work Mode</strong>: Hybrid\n🌙 <strong>Shift</strong>: US Shift (6:30 PM IST - 3:30 AM IST)\n🧭 <strong>Experience</strong>: 0–1 years\n💼 <strong>Type</strong>: Full-time</p>\n<p>We are seeking a <strong>Junior Full-Stack Engineer</strong> with a strong interest in <strong>database design</strong> and <strong>data modeling</strong>. This role emphasizes <strong>data-layer responsibilities</strong> while supporting broader <strong>backend</strong> and <strong>application development</strong> efforts.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and maintain <strong>database schemas</strong> and <strong>data models</strong></li>\n<li>Write and optimize <strong>SQL queries</strong></li>\n<li>Support <strong>backend services</strong> and <strong>data-driven features</strong></li>\n<li>Collaborate with <strong>frontend</strong> and <strong>backend engineers</strong> on data requirements</li>\n<li>Assist in improving <strong>data performance</strong>, <strong>consistency</strong>, and <strong>reliability</strong></li>\n<li>Contribute to overall <strong>application development</strong> as needed</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>0–1 years of experience or equivalent academic/project work</li>\n<li>Strong understanding of <strong>database fundamentals</strong> and <strong>SQL</strong></li>\n<li><strong>Backend programming experience</strong> (Python preferred, others acceptable)</li>\n<li>Familiarity with <strong>API-based backend systems</strong></li>\n<li>Basic understanding of <strong>frontend technologies</strong></li>\n<li>Strong <strong>communication</strong> and <strong>teamwork skills</strong></li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience with <strong>ORMs</strong>, <strong>migrations</strong>, or <strong>backend frameworks</strong></li>\n<li>Exposure to <strong>NoSQL databases</strong></li>\n<li>Academic or personal projects involving <strong>data modeling</strong></li>\n<li>Familiarity with <strong>Git</strong> and collaborative workflows</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Mentorship and hands-on experience</li>\n<li>Health insurance &amp; PF</li>\n<li>Cab facility (pickup &amp; drop)</li>\n<li>Supportive and collaborative work environment</li>\n</ul>\n<h3>Application Details</h3>\n<p>Please include your <strong>resume</strong>, <strong>relevant project details</strong>, and a <strong>GitHub profile</strong> (if available).</p>\n<p>📩 <strong>Email</strong>: <a href=\"mailto:anjana@servsys.com\">anjana@servsys.com</a></p>",
        "tags": [
            "0–1 Years",
            "SQL",
            "Python",
            "ORMs"
        ],
        "summary": "Junior Full-Stack Engineer focusing on database design and data modeling, supporting backend/frontend development with 0–1 years of experience."
    },
    {
        "job_title": "Hiring: Junior Full-Stack Engineer (Backend-First)",
        "company": "Servsys Technology Services India Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21891/134",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Hiring: Junior Full-Stack Engineer (Backend-First)</h2>\n<p>📍 Kochi, Kerala | 🧑‍💻 Hybrid | 🌙 US Shift (6:30 PM IST - 3:30 AM IST)\n🧭 Experience: 0–1 years | 💼 Full-time</p>\n<p>We are seeking a <strong>Junior Full-Stack Engineer</strong> with a backend-first focus to contribute across the stack while taking ownership of backend systems and integrations.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and maintain backend services and APIs</li>\n<li>Work with databases and backend integrations</li>\n<li>Contribute to frontend features for end-to-end delivery</li>\n<li>Collaborate with engineering and product teams</li>\n<li>Participate in code reviews and technical discussions</li>\n<li>Troubleshoot and enhance existing systems</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>0–1 years of experience or relevant project work</li>\n<li>Solid understanding of backend development concepts</li>\n<li>Proficiency in backend programming languages (Python, C, C++, Rust)</li>\n<li>Familiarity with databases and API-based systems</li>\n<li>Basic frontend knowledge (HTML, CSS, JavaScript)</li>\n<li>Strong teamwork and collaboration skills</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Hands-on Python experience for backend services/scripting</li>\n<li>Exposure to modern frontend frameworks (React is a plus)</li>\n<li>Git/version control experience</li>\n<li>Projects demonstrating full-stack capabilities</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Mentorship and structured learning programs</li>\n<li>Health insurance &amp; PF benefits</li>\n<li>Cab facility (pickup &amp; drop)</li>\n<li>Collaborative, growth-focused team culture</li>\n</ul>\n<h3>Application Details</h3>\n<ul>\n<li>Submit resume, GitHub profile (optional), and a project description</li>\n<li>Email: <strong>anjana@servsys.com</strong></li>\n</ul>",
        "tags": [
            "0–1 Years",
            "Python",
            "Databases/APIs",
            "Git"
        ],
        "summary": "Junior Full-Stack Engineer (backend focus) with 0-1 years experience in Python, databases, and team collaboration for full-stack projects."
    },
    {
        "job_title": "Developer – Node Js (2+Yrs)",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27346",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<p><strong>Company:</strong> GNX Digital Solutions (P) Ltd\n<strong>Location:</strong> Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581\n<strong>Website:</strong> <a href=\"https://gnxsolutions.in\">https://gnxsolutions.in</a>\n<strong>Job Title:</strong> Developer – Node Js (2+Yrs)\n<strong>Closing Date:</strong> 10, Feb 2026\n<strong>Published Date:</strong> 03, Feb 2026\n<strong>Contact Email:</strong> hr@gnxsolutions.in</p>\n<h3>Responsibilities Include:</h3>\n<ul>\n<li>A developer resource having experience in design, development, and implementation of backend solutions using <strong>NestJS</strong>.</li>\n<li>Collaborate with product managers, architects, and other stakeholders to understand project requirements and translate them into technical solutions.</li>\n<li>Review code and ensure adherence to coding standards, best practices, and project guidelines.</li>\n<li>Participate in architectural discussions and drive technical decisions to ensure scalability, performance, and maintainability of our applications.</li>\n<li>Troubleshoot and debug issues, and provide timely resolutions.</li>\n<li>Stay updated on emerging technologies and trends in <strong>Node.js</strong> and <strong>NestJS</strong> development, and incorporate them into our projects as appropriate.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Engineering, or related field.</li>\n<li>Minimum <strong>2 years</strong> of experience in <strong>Node.js</strong> development, with proficiency in <strong>NestJS</strong>.</li>\n<li>Proficiency in <strong>JavaScript/TypeScript</strong>, <strong>HTML</strong>, and <strong>CSS</strong>.</li>\n<li>Experience with relational and non-relational databases, such as <strong>PostgreSQL</strong>, <strong>MongoDB</strong>, or <strong>MySQL</strong>.</li>\n<li>Familiarity with microservices architecture and distributed systems.</li>\n<li>Solid understanding of <strong>RESTful APIs</strong> and asynchronous programming.</li>\n<li>Experience with containerization technologies such as <strong>Docker</strong> and container orchestration platforms like <strong>Kubernetes</strong>.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Strong problem-solving abilities and attention to detail.</li>\n<li>Experience with Agile development methodologies is a plus.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "NestJS",
            "Node.js",
            "Docker"
        ],
        "summary": "A Node.js developer with 2+ years of experience in backend solutions using NestJS, collaborating with teams, and working with databases and containerization technologies."
    },
    {
        "job_title": "BA cum Technical Project Manager – Python AI Project (2+ Years Relevant)",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27345",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company</strong>: GNX Digital Solutions (P) Ltd\n<strong>Location</strong>: Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581\n<strong>Website</strong>: <a href=\"https://gnxsolutions.in\">https://gnxsolutions.in</a>\n<strong>Closing Date</strong>: 10, Feb 2026\n<strong>Published Date</strong>: 03, Feb 2026\n<strong>Contact Email</strong>: hr@gnxsolutions.in</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Business Analysis</strong>: Requirement gathering, stakeholder coordination, BRD/FRD documentation, user stories, and process mapping.</li>\n<li><strong>Project Management</strong>: Agile/Scrum execution, sprint planning, risk tracking, and cross-team coordination.</li>\n<li><strong>Technical &amp; Application Knowledge</strong>: Python-based applications, AI/ML lifecycle, REST APIs, cloud basics (AWS/GCP), logging, and monitoring.</li>\n<li><strong>AI/Data Exposure</strong>: OCR, NLP, LLM-based workflows, data pipelines, model validation, and outputs.</li>\n<li><strong>Tools</strong>: JIRA, Confluence, Git, Postman.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Prompt engineering</li>\n<li>SQL basics</li>\n<li>Docker</li>\n<li>Security &amp; compliance awareness (ISO 27001)</li>\n<li>Document automation systems</li>\n<li>Client-facing solution discussions</li>\n</ul>\n<h3>Contact Information</h3>\n<p>For inquiries, email: <strong>hr@gnxsolutions.in</strong></p>",
        "tags": [
            "2+ Years",
            "Python",
            "AI/ML",
            "Agile/Scrum"
        ],
        "summary": "A BA cum Technical Project Manager role requiring Python and AI/ML expertise, with 2+ years of experience in agile project management and technical application development."
    },
    {
        "job_title": "BA cum Technical Project Manager – Power Automate RPA (3+Yrs)",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27344",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>GNX Digital Solutions (P) Ltd</h2>\n<p><strong>Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581</strong>\n<a href=\"https://gnxsolutions.in\">Visit Website</a></p>\n<h3><strong>BA cum Technical Project Manager – Power Automate RPA (3+Yrs)</strong></h3>\n<p><strong>Closing Date:</strong> 10, Feb 2026\n<strong>Job Published:</strong> 03, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@gnxsolutions.in\">hr@gnxsolutions.in</a></p>\n<h4><strong>Role Summary</strong></h4>\n<p>Own and manage the migration of RPA solutions from UiPath to Microsoft Power Automate, while acting as the account owner for production RPA operations. The role ensures delivery, platform stability, and customer satisfaction across all assigned automation use cases.</p>\n<h4><strong>Key Responsibilities</strong></h4>\n<ul>\n<li>Lead end-to-end UiPath to Power Automate migration, ensuring timelines, scope, and quality.</li>\n<li>Understand existing RPA use cases and ensure the delivery team has full clarity on business processes.</li>\n<li>Act as the single point of contact for the customer for all RPA-related matters.</li>\n<li>Resolve Power Automate–related issues including licensing, environment setup, server/VM, and tool-level challenges.</li>\n<li>Own support, maintenance, and stability of all production bots.</li>\n<li>Track risks, dependencies, and deliverables; drive issue resolution proactively.</li>\n<li>Manage change requests, enhancements, and ongoing automation roadmap.</li>\n</ul>\n<h4><strong>Preferred Skills</strong></h4>\n<ul>\n<li>Business analysis and stakeholder coordination.</li>\n<li>Project delivery and cross-team management.</li>\n<li>Hands-on understanding of Power Automate (Cloud &amp; Desktop) and RPA concepts.</li>\n<li>Experience or exposure to UiPath for migration and assessment.</li>\n<li>Strong Excel skills for tracking, reporting, and analysis.</li>\n<li>Strong PowerPoint presentation skills for customer updates, reviews, and governance.</li>\n</ul>\n<h4><strong>Good-to-Have</strong></h4>\n<ul>\n<li>Experience in RPA managed services or platform migrations.</li>\n<li>Client-facing account management experience.</li>\n<li>Awareness of enterprise security, compliance, and IT environments.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Power Automate",
            "UiPath",
            "Business Analysis"
        ],
        "summary": "Lead RPA migration from UiPath to Power Automate, ensuring production stability and customer satisfaction. Manage project delivery, stakeholder coordination, and technical support for automation solutions."
    },
    {
        "job_title": "Unity Developer",
        "company": "Travancore Analytics (P) Ltd",
        "url": "https://technopark.org/job-details/27343",
        "location": "Technopark",
        "closing_date": "20 Mar 2026",
        "job_description": "<p><strong>Unity Developer</strong></p>\n<p><strong>Company</strong>: Travancore Analytics (P) Ltd\n<strong>Location</strong>: Infopark, Cochin\n<strong>Contact Email</strong>: shobhi.cm@travancoreanalytics.com</p>\n<p><strong>Key Dates</strong>:\n- Job Published: 03, Feb 2026\n- Closing Date: 20, Mar 2026</p>\n<p><strong>Brief Description</strong>:\nWe are seeking a skilled Unity Developer with strong experience in XR (VR/AR) application or game development.</p>\n<p><strong>Experience Required</strong>: 2-3 Years</p>\n<p><strong>Responsibilities</strong>:\n- Hands-on experience with multiplayer systems and real-time interactive experiences.\n- Develop and maintain XR (VR/AR) applications using Unity.\n- Implement and manage multiplayer features using Photon/Mirror/NGO.\n- Optimize performance for XR devices.\n- Collaborate with designers and artists to deliver immersive experiences.\n- Debug, test, and maintain stable code.</p>\n<p><strong>Preferred Skills</strong>:\n- 2+ years of Unity development experience.\n- Strong C# and Unity fundamentals.\n- Experience with multiplayer development.\n- Hands-on experience in VR/AR (XR) development.\n- Good debugging and optimization skills.</p>\n<p><strong>Nice to Have</strong>:\n- Experience with version control (Git, Plastic SCM).\n- Portfolio demonstrating XR or Multiplayer projects.</p>\n<p><strong>Contact</strong>: Share your updated CV with shobhi.cm@travancoreanalytics.com.</p>",
        "tags": [
            "2-3 Years",
            "Unity",
            "C#",
            "Photon/Mirror/NGO"
        ],
        "summary": "We are seeking a Unity Developer with 2-3 years of experience in XR (VR/AR) application development, focusing on multiplayer systems and immersive experiences."
    },
    {
        "job_title": "Senior IOS Developer",
        "company": "Travancore Analytics (P) Ltd",
        "url": "https://technopark.org/job-details/27342",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>Senior iOS Developer</h2>\n<p><strong>Company:</strong> Travancore Analytics (P) Ltd\n<strong>Location:</strong> Infopark, Cochin\n<strong>Closing Date:</strong> 13, Mar 2026\n<strong>Published Date:</strong> 03, Feb 2026\n<strong>Contact Email:</strong> shobhi.cm@travancoreanalytics.com</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, test, and maintain iOS applications using Swift and related frameworks</li>\n<li>Collaborate with project managers, designers, and backend teams to define and implement features</li>\n<li>Ensure high performance, quality, and responsiveness of applications</li>\n<li>Identify and resolve bugs, performance issues, and application crashes</li>\n<li>Write clean, maintainable, and scalable code following best practices</li>\n<li>Review code and provide technical guidance to junior developers</li>\n<li>Stay updated with the latest iOS development trends and Apple platform updates</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>3 to 6 years of hands-on experience in iOS application development</li>\n<li>Strong proficiency in Swift and Xcode</li>\n<li>Experience with iOS SDK, UIKit, and Auto Layout</li>\n<li>Good understanding of architectural patterns such as MVC, MVVM, or similar</li>\n<li>Experience integrating RESTful APIs and third-party libraries</li>\n<li>Familiarity with Git or other version control systems</li>\n<li>Good communication and collaboration abilities</li>\n</ul>\n<p><strong>Application Process:</strong> Candidates may share their updated CV with shobhi.cm@travancoreanalytics.com</p>",
        "tags": [
            "3-6 Years",
            "Swift",
            "Xcode",
            "RESTful APIs"
        ],
        "summary": "Senior iOS Developer role requiring 3-6 years of experience in Swift, Xcode, and RESTful APIs for high-performance app development at Travancore Analytics."
    },
    {
        "job_title": "Senior Android Developer",
        "company": "Travancore Analytics (P) Ltd",
        "url": "https://technopark.org/job-details/27341",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>Travancore Analytics (P) Ltd</h2>\n<p><strong>Module No: 2805, 8th Floor, Yamuna SEZ IT Building, Phase 3 Campus, Technopark, 695583</strong>\n<a href=\"http://www.travancoreanalytics.com\">Visit Website</a></p>\n<h3>Senior Android Developer</h3>\n<p><strong>Closing Date:</strong> 13, Mar 2026\n<strong>Job Published:</strong> 03, Feb 2026\n<strong>Work Location:</strong> Infopark, Cochin\n<strong>Contact Email:</strong> <a href=\"mailto:shobhi.cm@travancoreanalytics.com\">shobhi.cm@travancoreanalytics.com</a></p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead the design, development, and deployment of Android applications.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Optimize applications for performance, scalability, and user experience.</li>\n<li>Mentor junior developers and provide technical guidance to the team.</li>\n<li>Stay updated with the latest Android development trends and best practices.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proven experience in Android development with a strong portfolio of released applications.</li>\n<li>Proficiency in Java/Kotlin and Android SDK.</li>\n<li>Strong understanding of mobile application architecture and development.</li>\n<li>Excellent problem-solving and leadership skills.</li>\n</ul>\n<p><strong>Candidates may share their updated CV with:</strong> <a href=\"mailto:shobhi.cm@travancoreanalytics.com\">shobhi.cm@travancoreanalytics.com</a></p>",
        "tags": [
            "3-6 Years",
            "Java/Kotlin",
            "Android SDK",
            "Mobile Application Architecture"
        ],
        "summary": "Senior Android Developer with 3-6 years of experience required to lead app development, collaborate with teams, and mentor juniors. Must have Java/Kotlin, Android SDK, and mobile architecture expertise."
    },
    {
        "job_title": "DotNet- Tech Lead",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/27340",
        "location": "Technopark",
        "closing_date": "07 Mar 2026",
        "job_description": "<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong>\n14th Floor, Carnival Technopark, Technopark Campus, Kariyavattom P.O., Trivandrum, 695581\n<a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<p><strong>DotNet - Tech Lead</strong></p>\n<p><strong>Closing Date:</strong> 07, Mar 2026\n<strong>Published:</strong> 03, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:vidhya.r@muthoot.com\">vidhya.r@muthoot.com</a></p>\n<h3>Brief Description</h3>\n<ul>\n<li>Provide technical guidance to a team of developers in building features for an enterprise .NET application with an Angular web-based frontend.</li>\n<li>Overall experience of <strong>8-16 years</strong>, with <strong>minimum 2 years as a Tech Lead</strong>.</li>\n<li>Customize existing applications to align with evolving business needs.</li>\n<li>Experienced in <strong>Technical Design</strong> and creating design documents.</li>\n<li>Must have hands-on experience with <strong>MySQL/MS SQL Server</strong>.</li>\n<li>Proficiency in <strong>ASP.NET, C#, VB.NET, JavaScript, jQuery, VBScript, HTML, XML, Ajax, and Angular</strong>.</li>\n<li>Familiarity with <strong>MVC, WCF, WPF, Design Patterns, LINQ, and Lambda Expressions</strong>.</li>\n<li>Strong skills in <strong>SQL scripting, stored procedures, and functions</strong>.</li>\n<li>Experience with <strong>Source &amp; Configuration Management (Git/SVN)</strong>.</li>\n<li><strong>API integrations</strong> (consuming APIs &amp; libraries) preferred.</li>\n<li><strong>Cloud Development</strong> experience is an added advantage.</li>\n<li>Ability to mentor <strong>5-8 team members</strong> and collaborate with superiors/business users for requirement gathering.</li>\n<li>Capacity to manage <strong>multiple projects with tight deadlines</strong>.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Advanced expertise in <strong>ASP.NET, C#, VB.NET, JavaScript, jQuery, HTML, XML, Ajax</strong>.</li>\n<li>Strong background in <strong>ADO.NET/SQL Server</strong>.</li>\n<li><strong>Angular</strong> experience is preferable.</li>\n<li>Knowledge of <strong>MVC, WCF, WPF, Design Patterns, LINQ, Lambda Expressions</strong>.</li>\n<li>Proficiency in <strong>SQL scripting, stored procedures, and functions</strong>.</li>\n<li>Experience with <strong>Source &amp; Configuration Management (Git/SVN)</strong>.</li>\n<li><strong>API integrations</strong> (consuming APIs &amp; libraries) preferred.</li>\n<li><strong>Cloud Development</strong> experience is an added advantage.</li>\n</ul>",
        "tags": [
            "8-16 Years",
            "ASP.NET",
            "C#",
            "Angular"
        ],
        "summary": "Lead .NET development for enterprise applications with Angular frontend. Requires 8-16 years of experience, including 2+ years as a Tech Lead, and expertise in C#, SQL, and API integrations."
    },
    {
        "job_title": "Lead MERN Stack Developer",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27339",
        "location": "Technopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Address:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Lead MERN Stack Developer</h3>\n<p><strong>Closing Date:</strong> 17, Feb 2026\n<strong>Job Published:</strong> 03, Feb 2026</p>\n<p><strong>Brief Description</strong>\nWe are seeking a <strong>Lead MERN Stack Developer</strong> with hands-on expertise in MongoDB, Express.js, React.js, and Node.js. The role requires technical leadership, architecture decisions, and team mentoring to deliver high-performance web applications.</p>\n<h3>Key Roles &amp; Responsibilities</h3>\n<ul>\n<li>Lead design, development, and delivery of scalable MERN stack applications.</li>\n<li>Define application architecture, coding standards, and best practices.</li>\n<li>Review code, enforce quality standards, and optimize performance.</li>\n<li>Mentor junior/mid-level developers.</li>\n<li>Design RESTful APIs, handle authentication/authorization, and ensure security.</li>\n<li>Develop responsive UI components using React.js (Hooks, Redux, Context API).</li>\n<li>Translate wireframes/UI/UX designs into functional interfaces.</li>\n<li>Manage MongoDB schemas, optimize queries, and ensure data integrity.</li>\n<li>Use Git and Agile/Scrum methodologies.</li>\n<li>Collaborate with product managers, designers, QA, and stakeholders.</li>\n<li>Handle deployment, production releases, and post-release support.</li>\n<li>Balance hands-on coding with team leadership.</li>\n<li>Drive continuous improvement and innovation.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Core MERN Skills</strong>\n- JavaScript (ES6+), TypeScript\n- Node.js, Express.js\n- React.js, Next.js (SSR, SSG, routing, performance optimization)\n- Hooks, Redux, Context API\n- MongoDB, Mongoose\n- REST APIs &amp; API testing (Postman)\n- HTML5, CSS3, Responsive Design\n- UI state management, component lifecycle understanding\n- Node.js debugging and performance tuning\n- Authentication, authorization, data protection practices\n- Asynchronous programming (Promises, async/await)</p>\n<p><strong>Tools &amp; Methodologies</strong>\n- Git, Jira\n- Agile/Scrum development\n- Unit &amp; integration testing</p>\n<p><strong>Leadership &amp; Soft Skills</strong>\n- Strong problem-solving and decision-making\n- Manage ambiguity and complex requirements\n- Excellent communication and stakeholder management\n- Proven team leadership and delivery experience\n- Business-oriented mindset focused on outcomes</p>\n<p><strong>Good to Have</strong>\n- Cloud deployment (AWS/Azure/GCP)\n- Basic AI/ML awareness (e.g., ChatGPT)\n- Performance testing/optimization\n- CI/CD pipeline exposure</p>\n<h3>Qualifications</h3>\n<ul>\n<li>B.Tech/BCA/M.Tech/MCA or equivalent</li>\n<li><strong>6+ years</strong> of professional MERN stack experience</li>\n<li>Prior experience as Lead/Senior Developer preferred</li>\n</ul>",
        "tags": [
            "6+ Years",
            "MERN Stack",
            "Technical Leadership",
            "React.js"
        ],
        "summary": "Lead MERN Stack Developer role requiring 6+ years of experience in full-stack development, technical leadership, and team mentoring. Responsibilities include designing scalable applications, guiding junior developers, and ensuring high-quality, secure solutions."
    },
    {
        "job_title": "Sr-Front End Developer- AngularJS/ ReactJS/NextJS",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/27338",
        "location": "Technopark",
        "closing_date": "07 Mar 2026",
        "job_description": "<h2>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</h2>\n<p><strong>Address</strong>: 14th Floor, Carnival Technopark, Technopark Campus, Kariyavattom P.O., Trivandrum, 695581\n<strong>Website</strong>: <a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<h3>Sr. Front End Developer (AngularJS/ReactJS/NextJS)</h3>\n<p><strong>Closing Date</strong>: 07, Mar 2026\n<strong>Job Published</strong>: 03, Feb 2026\n<strong>Contact Email</strong>: vidhya.r@muthoot.com</p>\n<h3>Brief Description</h3>\n<p>Frontend Developer (Angular JS / React JS / Next JS – Any One Stack)\nWe are seeking a skilled and passionate Frontend Developer to join our growing technology team. The ideal candidate should have strong hands-on experience in <strong>Angular JS</strong>, <strong>React JS</strong>, or <strong>Next JS</strong> and be capable of building modern, scalable, and high-performance web applications. This is a <strong>full-time</strong>, <strong>permanent</strong>, <strong>work-from-office</strong> role based at <strong>Technopark Phase 1, Trivandrum</strong>.</p>\n<h3>Job Details</h3>\n<ul>\n<li><strong>Role</strong>: Frontend Developer</li>\n<li><strong>Employment Type</strong>: Full-Time | Permanent</li>\n<li><strong>Work Mode</strong>: Work From Office</li>\n<li><strong>Office Location</strong>: Technopark Phase 1, Trivandrum</li>\n<li><strong>Experience Required</strong>: 3 to 10 Years</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and maintain responsive, user-friendly web applications using Angular JS / React JS / Next JS</li>\n<li>Collaborate with backend developers, UI/UX designers, and product managers to deliver high-quality solutions</li>\n<li>Translate UI/UX designs into clean, reusable, and efficient code</li>\n<li>Optimize applications for maximum speed, scalability, and performance</li>\n<li>Ensure cross-browser compatibility and responsiveness across devices</li>\n<li>Integrate RESTful APIs and handle data exchange between frontend and backend systems</li>\n<li>Implement best practices related to security, performance optimization, and code quality</li>\n<li>Debug, troubleshoot, and resolve application issues in development and production environments</li>\n<li>Participate in code reviews and contribute to continuous improvement of development standards</li>\n<li>Mentor junior team members when required and support team deliverables</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>3–10 years of hands-on experience in frontend development</li>\n<li>Strong proficiency in <strong>any one</strong> of the following frameworks:</li>\n<li>Angular JS</li>\n<li>React JS</li>\n<li>Next JS</li>\n<li>Solid understanding of HTML5, CSS3, JavaScript (ES6+)</li>\n<li>Experience with responsive design and modern UI frameworks</li>\n<li>Knowledge of state management concepts and tools</li>\n<li>Experience with API integration and asynchronous programming</li>\n<li>Familiarity with version control systems like Git</li>\n<li>Good understanding of frontend architecture and design patterns</li>\n<li>Strong problem-solving and debugging skills</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Experience with performance optimization and SEO best practices</li>\n<li>Exposure to cloud-based or large-scale enterprise applications</li>\n<li>Knowledge of unit testing frameworks</li>\n<li>Experience working in Agile/Scrum environments</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Permanent role with long-term career stability</li>\n<li>Opportunity to work on challenging and impactful projects</li>\n<li>Professional and collaborative work environment</li>\n<li>Career growth and learning opportunities</li>\n</ul>",
        "tags": [
            "3–10 Years",
            "Angular JS",
            "React JS",
            "Next JS"
        ],
        "summary": "Senior Frontend Developer with 3–10 years experience in Angular/React/Next JS to build scalable web apps at Muthoot Pappachan Technologies in Trivandrum."
    },
    {
        "job_title": "Developer RPA (2+Yrs)",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27337",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>GNX Digital Solutions (P) Ltd</h2>\n<p><strong>Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581</strong>\n<a href=\"https://gnxsolutions.in\">Company Website</a></p>\n<h3>Developer RPA (2+Yrs)</h3>\n<p><strong>Closing Date:</strong> 10, Feb 2026\n<strong>Job Published:</strong> 03, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@gnxsolutions.in\">hr@gnxsolutions.in</a></p>\n<h4>Key Responsibilities:</h4>\n<ul>\n<li>Lead and execute the migration of RPA processes from <strong>UiPath</strong> to <strong>Power Automate</strong>, ensuring scalability, reliability, and performance.</li>\n<li>Analyze and document existing <strong>UiPath</strong> workflows, dependencies, and logic to design equivalent or improved <strong>Power Automate</strong> solutions.</li>\n<li>Develop, test, and deploy automation workflows using <strong>Power Automate</strong>, <strong>UiPath</strong>, and <strong>VBA Macros</strong>.</li>\n<li>Integrate automation solutions with the <strong>Microsoft 365 ecosystem</strong> (SharePoint, Outlook, Excel, Teams, Power Apps, Dataverse).</li>\n<li>Create and maintain reusable automation components, libraries, and frameworks.</li>\n<li>Collaborate with business analysts and process owners to identify automation opportunities and enhance process efficiency.</li>\n<li>Troubleshoot, optimize, and maintain production bots and macro-based automations.</li>\n<li>Provide <strong>technical leadership and mentorship</strong> to junior RPA developers.</li>\n<li>Maintain clear documentation and version control of all automation projects.</li>\n</ul>\n<h4>Required Skills &amp; Qualifications:</h4>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or equivalent.</li>\n<li><strong>2+ years of hands-on experience</strong> in RPA development with <strong>UiPath</strong> and <strong>Power Automate</strong>.</li>\n<li>Proven experience in <strong>UiPath-to-Power Automate migration projects</strong>.</li>\n<li>Strong expertise in <strong>Excel Macros (VBA)</strong> development and automation.</li>\n<li>Knowledge of <strong>.NET, C#, JSON, REST APIs</strong>, and <strong>Microsoft Power Platform connectors</strong>.</li>\n<li>Good understanding of <strong>process analysis, optimization</strong>, and <strong>error-handling techniques</strong>.</li>\n<li>Experience with <strong>UiPath Orchestrator</strong>, <strong>Power Automate Cloud Flows</strong>, and <strong>Desktop Flows</strong>.</li>\n<li>Excellent analytical, debugging, and communication skills.</li>\n</ul>\n<h4>Preferred Skills:</h4>\n<ul>\n<li><strong>UiPath Advanced Developer Certification</strong> or <strong>Microsoft Power Platform Developer (PL-400 / PL-500)</strong> certification.</li>\n<li>Experience integrating <strong>Power Automate</strong> with <strong>Azure services</strong> or third-party APIs.</li>\n<li>Knowledge of <strong>Power BI</strong> and <strong>AI Builder</strong> is a plus.</li>\n<li>Prior experience in <strong>Agile/Scrum</strong> development environments.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Power Automate",
            "UiPath",
            "VBA Macros"
        ],
        "summary": "Migrate RPA processes from UiPath to Power Automate with 2+ years of experience in automation tools and VBA macros."
    },
    {
        "job_title": "Telecaller (English)",
        "company": "Naga Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27336",
        "location": "Technopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Naga Info Solutions (P) Ltd\n<strong>Location:</strong> Module No 2505, 5th Floor, Yamuna Building, Technopark Phase III, 695583\n<strong>Website:</strong> <a href=\"http://www.nagainfo.com\">http://www.nagainfo.com</a>\n<strong>Job Title:</strong> Telecaller (English)\n<strong>Closing Date:</strong> 17, Feb 2026\n<strong>Published Date:</strong> 03, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced Telecaller with confidence in handling both Indian and international calls. The ideal candidate must possess excellent English communication skills and basic computer knowledge to manage call-related documentation efficiently.</p>\n<h3>Experience Required</h3>\n<ul>\n<li><strong>2–4 years</strong> (Experience in international calls is preferred)</li>\n</ul>\n<h3>Role Highlights</h3>\n<ul>\n<li>Opportunity to work with international clients</li>\n<li>Exposure to global calling processes</li>\n<li>Professional and supportive work environment</li>\n<li>Competitive salary package based on experience</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Handle inbound and outbound calls professionally</li>\n<li>Communicate effectively with Indian and international clients</li>\n<li>Understand customer requirements and provide accurate information</li>\n<li>Maintain call records and follow-up details using computer systems</li>\n<li>Ensure high levels of customer satisfaction</li>\n<li>Adhere to defined communication and quality standards</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Mandatory:</strong>\n- Excellent English communication skills\n- Basic computer knowledge (MS Office, email, CRM tools)\n- Strong interpersonal and listening skills\n- Ability to handle international calling processes\n- Professional attitude with a customer-oriented mindset</p>\n<p><strong>Good to Have:</strong>\n- Prior experience in international voice processes\n- Familiarity with CRM or call management systems\n- Additional language skills\n- Experience in client handling or customer support roles</p>\n<h3>How to Apply</h3>\n<p>Interested candidates may send their CVs to: <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a></p>",
        "tags": [
            "2–4 Years",
            "English Communication",
            "CRM Tools",
            "International Call Handling"
        ],
        "summary": "Seeking a Telecaller with 2-4 years of experience to handle international calls, requiring strong English skills and CRM proficiency for client communication and documentation."
    },
    {
        "job_title": "Senior Node JS and React JS Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27335",
        "location": "Technopark",
        "closing_date": "19 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p><strong>Sr. Node JS and React JS Developer</strong></p>\n<h2>Work Arrangement</h2>\n<p><strong>On-site</strong></p>\n<h2>Experience</h2>\n<p><strong>6 - 9 years</strong></p>\n<h2>Employment Type</h2>\n<p><strong>Full-time</strong></p>\n<h2>Role Overview</h2>\n<p>We are seeking a Senior Node.js &amp; React.js Developer with strong hands-on experience in building scalable, high-performance web applications. This role requires technical leadership, deep problem-solving skills, and ownership of end-to-end feature delivery while mentoring junior engineers.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Architect, design, and develop scalable backend services using <strong>Node.js</strong></li>\n<li>Build robust, reusable, and responsive UI components using <strong>React.js</strong></li>\n<li>Own end-to-end development of features from design through production deployment</li>\n<li>Design and maintain RESTful and microservices-based APIs</li>\n<li>Ensure application security, performance, scalability, and reliability</li>\n<li>Conduct code reviews and enforce engineering best practices</li>\n<li>Mentor junior developers and provide technical guidance</li>\n<li>Collaborate with Product, UX, QA, and DevOps teams</li>\n<li>Drive technical decisions and participate in architectural discussions</li>\n<li>Troubleshoot complex production issues and perform root-cause analysis</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>6–9 years of experience in JavaScript-based full-stack development</li>\n<li>Strong hands-on expertise in <strong>Node.js</strong> and <strong>Express.js</strong></li>\n<li>Advanced experience with <strong>React.js</strong>, Hooks, Redux or Context API</li>\n<li>Proficiency in <strong>JavaScript (ES6+)</strong>, HTML5, and CSS3</li>\n<li>Strong experience with REST APIs and backend integration</li>\n<li>Working knowledge of databases such as MySQL, MongoDB, or PostgreSQL</li>\n<li>Experience with authentication and authorization (JWT, OAuth, API keys)</li>\n<li>Proficiency with <strong>Git</strong>, branching strategies, and peer code reviews</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Experience with <strong>TypeScript</strong> or <strong>Python</strong></li>\n<li>Exposure to cloud platforms such as <strong>AWS</strong>, <strong>Azure</strong>, or <strong>GCP</strong></li>\n<li>Experience with <strong>Docker</strong>, <strong>Kubernetes</strong>, and CI/CD pipelines</li>\n<li>Knowledge of <strong>Next.js</strong> or Server-Side Rendering concepts</li>\n<li>Familiarity with unit and integration testing frameworks (<strong>Jest</strong>, <strong>Mocha</strong>)</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong></li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong></li>\n<li>Dynamic, fast-paced, and innovation-driven work culture</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/senior-fullstack-developer-node-js-react\">Senior Fullstack Developer - Node JS &amp; React</a></p>",
        "tags": [
            "6-9 Years",
            "Node.js",
            "React.js",
            "JavaScript"
        ],
        "summary": "Senior Node.js & React.js Developer with 6-9 years experience needed for a leading US auto super app. Focus on scalable apps, mentorship, and innovation in a fast-paced environment."
    },
    {
        "job_title": "Desktop Support Engineer",
        "company": "Aptara Learning  (P) Ltd",
        "url": "https://technopark.org/job-details/27334",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About the Role</h2>\n<p>Aptara Learning (P) Ltd is seeking a <strong>Desktop Support Engineer</strong> to join their team at Technopark, Trivandrum. The role involves managing Windows and Mac systems, troubleshooting hardware/software issues, and providing end-user technical support. Responsibilities include maintaining system performance, ensuring security via antivirus tools, and supporting daily IT operations in a fast-paced environment.</p>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Minimum 1 year of experience</strong> in a Technopark or similar IT environment.</li>\n<li>Graduation or equivalent degree/diploma from a recognized institution.</li>\n<li>Strong understanding of <strong>Windows OS</strong> (Windows 10 &amp; 11 preferred).</li>\n<li>Working knowledge of <strong>Mac OS</strong> and Apple systems.</li>\n<li>Good understanding of <strong>anti-virus</strong> and endpoint security software.</li>\n<li>Knowledge of <strong>Microsoft Outlook</strong> and MS Office applications.</li>\n<li>Understanding of computer hardware and software components.</li>\n<li>Ability to diagnose and troubleshoot hardware failures.</li>\n<li>Experience in installing/uninstalling/troubleshooting applications.</li>\n<li>Knowledge of <strong>Domain and IP management</strong>.</li>\n<li>Ability to install/configure/share/troubleshoot printers and scanners.</li>\n<li>Decent understanding of <strong>networking concepts</strong>.</li>\n<li>Experience in maintaining <strong>IT inventory</strong> (PCs, laptops, servers, and software).</li>\n</ul>\n<h2>Additional Notes</h2>\n<ul>\n<li><strong>Immediate joiners preferred</strong>.</li>\n<li>Candidates must mention <strong>Current CTC</strong> and <strong>Expected CTC</strong>.</li>\n<li><strong>Trivandrum-based candidates preferred</strong>.</li>\n<li>Subject line for applications: <strong>“Application for Desktop Support Engineer”</strong>.</li>\n<li>Email applications to <strong>binu.sg@aptaracorp.com</strong>.</li>\n</ul>\n<p><strong>Closing Date</strong>: 08, Feb 2026\n<strong>Published Date</strong>: 03, Feb 2026\n<strong>Company Address</strong>: 8B, 8th Floor, Carnival Technopark Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Company Website</strong>: <a href=\"http://www.aptaracorp.com\">www.aptaracorp.com</a></p>",
        "tags": [
            "1 Year",
            "Windows OS",
            "Mac OS",
            "IT Asset Management"
        ],
        "summary": "Aptara Learning seeks a Desktop Support Engineer with 1+ year of IT experience, expertise in Windows/Mac systems, and IT operations. Candidates in Trivandrum with immediate availability are preferred."
    },
    {
        "job_title": "Content writer",
        "company": "Aptara Learning  (P) Ltd",
        "url": "https://technopark.org/job-details/27333",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<p><strong>Aptara Learning (P) Ltd</strong>\n8B, 8th Floor, Carnival Technopark Building, Technopark Phase -1, Trivandrum, 695581\n<a href=\"http://www.aptaracorp.com\">Visit Website</a></p>\n<p><strong>Content Writer</strong>\n- <strong>Closing Date:</strong> 08, Feb 2026\n- <strong>Job Published:</strong> 03, Feb 2026\n- <strong>Contact Email:</strong> <a href=\"mailto:gobika.g@aptaracorp.com\">gobika.g@aptaracorp.com</a></p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop clear, engaging, and well-structured written content tailored to diverse audiences and business needs.</li>\n<li>Ensure all content aligns with organizational standards, brand guidelines, and communication goals.</li>\n<li>Collaborate with stakeholders (marketing, design, technical teams) to create relevant and effective content.</li>\n<li>Conduct thorough research to ensure accuracy and relevance of information.</li>\n<li>Edit and proofread content for quality, clarity, and consistency across materials.</li>\n<li>Adapt content for different formats/channels while maintaining message and tone.</li>\n<li>Incorporate feedback from reviewers to refine content.</li>\n<li>Stay updated with industry trends, accessibility standards, and best practices.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Experience:</strong> 0 to 1 Year</li>\n<li>Bachelor’s degree in English Literature</li>\n<li>Excellent written/verbal communication skills in English</li>\n<li>Strong attention to detail and consistency</li>\n<li>Proficient in Microsoft Office</li>\n<li>Background in case captioning and audio description (preferred)</li>\n<li>Understanding of accessibility and content clarity</li>\n</ul>\n<p><strong>Application Instructions:</strong>\nInterested candidates should email their CV to <a href=\"mailto:gobika.g@aptaracorp.com\">gobika.g@aptaracorp.com</a> with the subject line: <em>Application for Content Writer</em>.</p>",
        "tags": [
            "0-1 Years",
            "English Literature",
            "Microsoft Office",
            "Case Captioning"
        ],
        "summary": "Content Writer role at Aptara Learning requires 0-1 years of experience, English Literature degree, and Microsoft Office proficiency. Responsibilities include creating engaging content aligned with brand guidelines and collaborating with cross-functional teams."
    },
    {
        "job_title": "Senior .NET Developer (Contract)",
        "company": "Aptara Learning  (P) Ltd",
        "url": "https://technopark.org/job-details/27332",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Senior .NET Developer (Contract)</h2>\n<p><strong>Company</strong>: Aptara Learning (P) Ltd\n<strong>Location</strong>: 8B, 8th Floor, Carnival Technopark Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Website</strong>: <a href=\"http://www.aptaracorp.com\">http://www.aptaracorp.com</a>\n<strong>Closing Date</strong>: 08, Feb 2026\n<strong>Job Published</strong>: 03, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:gobika.g@aptaracorp.com\">gobika.g@aptaracorp.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Senior .NET Developer (Contractor)</strong> to support the modernization of our enterprise web application. The ideal candidate will play a key role in converting our .NET Framework 4 (C#) web application to .NET 8 (Core), the latest version of Microsoft’s unified .NET platform, while enhancing system performance, scalability, and maintainability. This role requires a developer with strong SQL Server expertise, capable of managing and optimizing databases independently. The candidate will also help design and integrate AI-driven functionality into our platform to enhance user experience and operational insight.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Migration of existing .NET Framework 4 web applications to .NET 8.</li>\n<li>Refactor and optimize legacy code for improved maintainability and performance.</li>\n<li>Design and implement RESTful APIs and modern integration patterns.</li>\n<li>Collaborate with UI/UX and frontend teams utilizing modern JavaScript frameworks and libraries.</li>\n<li>Manage and optimize SQL Server databases, including stored procedures, indexing, and performance tuning.</li>\n<li>Assist in architecting and integrating AI and machine learning capabilities into the web platform (e.g., natural language processing, predictive analytics, or generative AI features).</li>\n<li>Provide technical mentorship and guidance to internal development staff.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>7+ years of professional experience in software development with a focus on C# and ASP.NET.</li>\n<li>Proven experience migrating legacy applications from .NET Framework to .NET 8.</li>\n<li>Proficiency in SQL Server, including query optimization, complex joins, triggers, and stored procedure development.</li>\n<li>Hands-on experience with modern JavaScript libraries and frameworks (e.g., jQuery, React, or Angular).</li>\n<li>Experience implementing or integrating AI/ML functionality (OpenAI API, Azure AI, or similar).</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Excellent communication skills and the ability to work collaboratively within a small team.</li>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field (or equivalent experience).</li>\n</ul>\n<p><strong>Interested candidates can share their CV to</strong>: <a href=\"mailto:gobika.g@aptaracorp.com\">gobika.g@aptaracorp.com</a> with the subject line: <em>Application for Senior .Net Developer</em></p>",
        "tags": [
            "7+ Years",
            ".NET 8",
            "SQL Server",
            "AI/ML"
        ],
        "summary": "Senior .NET Developer (Contract) role focuses on migrating legacy applications to .NET 8, optimizing SQL Server databases, and integrating AI/ML features. Requires 7+ years of experience in C#, ASP.NET, and modern web development."
    },
    {
        "job_title": "Senior Dotnet Developer",
        "company": "Nirast Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27331",
        "location": "Technopark",
        "closing_date": "20 Mar 2026",
        "job_description": "<p><strong>Company:</strong> NIRAST Solutions (P) Ltd\n<strong>Location:</strong> Amstor Building, Technopark Phase-1, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.nirasystems.com\">http://www.nirasystems.com</a>\n<strong>Job Title:</strong> Senior Dotnet Developer\n<strong>Closing Date:</strong> 20, Mar 2026\n<strong>Published Date:</strong> 03, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@nirasystems.com\">careers@nirasystems.com</a></p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, test, and maintain scalable applications using <strong>.NET Core</strong>, <strong>ASP.NET Core (MVC, WebAPI)</strong>, <strong>TypeScript</strong>, and <strong>Angular</strong>.</li>\n<li>Collaborate with product owners and cross-functional teams to deliver high-quality, scalable solutions.</li>\n<li>Own system architecture, integration strategies, and technical design decisions to enhance platform performance.</li>\n<li>Utilize <strong>AI-assisted development tools</strong> to accelerate coding, improve efficiency, and maintain code quality.</li>\n</ul>\n<h3>Required Skills:</h3>\n<ul>\n<li><strong>4+ years</strong> of software development experience.</li>\n<li>Strong hands-on experience with <strong>.NET Core 3+</strong>, <strong>ASP.NET Core</strong>, <strong>MVC</strong>, <strong>WebAPI</strong>, <strong>Angular (2+)</strong>, <strong>TypeScript</strong>.</li>\n<li>Experience with <strong>SQL &amp; NoSQL databases</strong>.</li>\n<li>Strong knowledge of <strong>OOP</strong>, <strong>SOLID principles</strong>, and unit testing (<strong>NUnit</strong>, <strong>XUnit</strong>, <strong>Moq</strong>).</li>\n<li>Experience with <strong>AWS cloud-native development</strong>.</li>\n<li>Familiarity with <strong>Git</strong>, <strong>CI/CD</strong>, <strong>NuGet</strong>, <strong>NPM</strong>, <strong>GitHub</strong>.</li>\n<li>Experience with <strong>AI-assisted development tools</strong>.</li>\n<li>Experience in <strong>DevOps tools</strong> (<strong>Azure DevOps</strong>, <strong>TFS</strong>).</li>\n<li>Excellent communication skills.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Microservices architecture</strong>.</li>\n<li><strong>OAuth 2.0 / OpenID Connect</strong>.</li>\n</ul>\n<h3>Job Type:</h3>\n<ul>\n<li><strong>Contract</strong>, <strong>Remote</strong>.</li>\n</ul>\n<h3>Timing:</h3>\n<ul>\n<li><strong>US Time Zone Overlap</strong>.</li>\n</ul>",
        "tags": [
            "4+ Years",
            ".NET Core",
            "ASP.NET Core",
            "Angular"
        ],
        "summary": "Senior Dotnet Developer role requiring 4+ years of experience in .NET Core, ASP.NET, and Angular with expertise in cloud-native development and AI-assisted tools."
    },
    {
        "job_title": "Business Development Executive (IT service)",
        "company": "Awdar Software Solutions Llp",
        "url": "https://technopark.org/job-details/27330",
        "location": "Technopark",
        "closing_date": "06 Feb 2026",
        "job_description": "<h2>AWDAR SOFTWARE SOLUTIONS LLP</h2>\n<p><strong>Module No 2301, 3rd Floor, Yamuna Building, Technopark Phase 3, Trivandrum, 695583</strong>\n<a href=\"https://ainexit.com\">Company Website</a></p>\n<h3>Job Title: Business Development Executive (IT Service)</h3>\n<p><strong>Closing Date:</strong> 06, Feb 2026\n<strong>Published Date:</strong> 03, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@awdar-solutions.com\">hr@awdar-solutions.com</a></p>\n<h3>Brief Description</h3>\n<p>We seek a proactive, results-driven <strong>Business Development Executive (IT Service)</strong> to expand our global client base. <strong>Prior IT industry experience is mandatory.</strong> The ideal candidate will develop sales strategies, achieve revenue goals, and build lasting client relationships while managing the sales pipeline and reporting to management.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Generate leads via cold calling, email campaigns, LinkedIn, and platforms like Upwork/Fiverr.</li>\n<li>Conduct product demos and service presentations (online/offline).</li>\n<li>Negotiate terms, close deals, and oversee client onboarding.</li>\n<li>Build/maintain client relationships for repeat business.</li>\n<li>Collaborate with internal teams to align proposals with project/client needs.</li>\n<li>Maintain records of client interactions, proposals, and follow-ups.</li>\n<li>Communicate technical requirements effectively with clients.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li><strong>Mandatory:</strong> Minimum 1 year of IT industry experience.</li>\n<li><strong>Education:</strong> Master’s/Bachelor’s in Business Administration, Marketing, B.Tech, M.Tech, or related fields.</li>\n<li><strong>Language:</strong> Proficiency in English (spoken/written); additional languages preferred.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Mandatory:</strong> Strong understanding of IT Services (web development, mobile apps, cloud services, data sciences).</li>\n<li>Experience in international sales and client acquisition.</li>\n<li>Interpersonal skills for stakeholder relationship-building.</li>\n<li>Technical skills: Certifications in Sales, Data Center Product Sales, Soft Skills; CRM tool familiarity.</li>\n<li>Business Intelligence &amp; Strategic Planning: Report creation, market analysis, strategic planning.</li>\n<li>Self-motivated, independent work capability.</li>\n<li>Excellent verbal/written communication.</li>\n</ul>\n<p><strong>Interested candidates should email their updated CV to <a href=\"mailto:hr@awdar-solutions.com\">hr@awdar-solutions.com</a>.</strong></p>",
        "tags": [
            "1+ Year",
            "IT Services",
            "CRM Tools",
            "Sales Strategy"
        ],
        "summary": "A Business Development Executive (IT Service) role requiring 1+ year of IT industry experience, focusing on sales strategy, client acquisition, and relationship management with CRM tool proficiency."
    },
    {
        "job_title": "Software Test Engineer - 2 to 3 years (Immediate Joiners Preferred)",
        "company": "Enfin Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/27309",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Enfin Technologies India (P) Ltd</h2>\n<p><strong>Location:</strong> C 24, -2 Floor, Thejaswini, Technopark Campus, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.enfintechnologies.com\">http://www.enfintechnologies.com</a></p>\n<h3>Job Title: Software Test Engineer</h3>\n<p><strong>Experience Required:</strong> 2 to 3 years\n<strong>Immediate Joiners Preferred</strong>\n<strong>Closing Date:</strong> 09, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@enfintechnologies.com\">hr@enfintechnologies.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a motivated and detail-oriented <strong>Software Test Engineer</strong> with 2 to 3 years of IT experience to join our growing team. The ideal candidate will support <strong>end-to-end testing</strong> across multiple projects and contribute to delivering high-quality software products. Immediate joiners are preferred.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Understand project requirements and prepare detailed test cases and scenarios</li>\n<li>Perform manual testing (functional, regression, sanity testing)</li>\n<li>Identify, log, track, and retest defects using defect tracking tools</li>\n<li>Collaborate with developers and cross-functional teams for quality deliverables</li>\n<li>Participate in test planning, execution, and reporting</li>\n<li>Support testing activities across all stages of the <strong>Software Development Life Cycle (SDLC)</strong></li>\n<li>Ensure adherence to quality standards and best testing practices</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>2 to 3 years of software testing experience</li>\n<li>Strong knowledge of <strong>manual testing concepts</strong></li>\n<li>Basic understanding of <strong>automation testing</strong> (added advantage)</li>\n<li>Familiarity with <strong>SDLC</strong> and <strong>STLC</strong> processes</li>\n<li>Strong communication and documentation skills</li>\n<li>Positive attitude with adaptability and willingness to learn</li>\n<li>Good team coordination and problem-solving abilities</li>\n</ul>\n<h3>Work Details</h3>\n<ul>\n<li><strong>Working Days:</strong> Monday to Friday</li>\n<li><strong>Work Timings:</strong> 9:30 AM – 6:30 PM</li>\n<li><strong>Work Mode:</strong> Work from Office</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email resumes to <a href=\"mailto:hr@enfintechnologies.com\">hr@enfintechnologies.com</a> with the subject: <strong>\"Enfin Software Test Engineer - [Mention your relevant QA experience]\"</strong>.</p>",
        "tags": [
            "2-3 Years",
            "Manual Testing",
            "SDLC/STLC",
            "Automation Testing"
        ],
        "summary": "Seeking a Software Test Engineer with 2-3 years of manual testing experience to ensure quality through SDLC processes and cross-functional collaboration. Requires strong communication and problem-solving skills."
    },
    {
        "job_title": "Reinforcement Learning (RL) Engineer",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27308",
        "location": "Technopark",
        "closing_date": "18 Feb 2026",
        "job_description": "<p><strong>GENROBOTIC INNOVATIONS (P) Ltd</strong></p>\n<p><strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a>\n<strong>Contact Email:</strong> career@genrobotics.org\n<strong>Closing Date:</strong> 18, Feb 2026\n<strong>Job Published:</strong> 02, Feb 2026</p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly skilled <strong>Reinforcement Learning (RL) Engineer</strong> to develop, implement, and optimize RL algorithms for real-world and simulation-based applications. The ideal candidate has strong foundations in machine learning, deep learning, control systems, and hands-on experience deploying RL models in production or embedded systems.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, implement, and optimize RL algorithms such as PPO, SAC, TD3, DQN, A3C, TRPO, etc.</li>\n<li>Develop custom reward functions, policy architectures, and learning workflows.</li>\n<li>Conduct research on state-of-the-art RL techniques and integrate into product or research pipelines.</li>\n<li>Build or work with simulation environments such as PyBullet, Mujoco, IsaacGym, CARLA, Gazebo, or custom environments.</li>\n<li>Integrate RL agents with environment APIs, physics engines, and sensor models.</li>\n<li>Deploy RL models on real systems (e.g., robots, embedded hardware, autonomous platforms).</li>\n<li>Optimize RL policies for latency, robustness, and real-world constraints.</li>\n<li>Work with control engineers to integrate RL with classical controllers (PID, MPC, etc.).</li>\n<li>Run large-scale experiments, hyperparameter tuning, and ablation studies.</li>\n<li>Analyze model performance, failure cases, and implement improvements.</li>\n<li>Work closely with robotics, perception, simulation, and software engineering teams.</li>\n<li>Document algorithms, experiments, and results for internal and external stakeholders.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Required Skills:</strong>\n- Strong expertise in Python, with experience in ML frameworks like PyTorch or TensorFlow.\n- Deep understanding of:\n  - Markov Decision Processes (MDP)\n  - Policy &amp; value-based RL\n  - Deep learning architectures (CNN, RNN, Transformers)\n  - Control theory fundamentals\n- Experience with RL libraries (stable-baselines3, RLlib, CleanRL, etc.).\n- Experience with simulation tools or robotics middleware (ROS/ROS2, Gazebo).</p>\n<p><strong>Added Advantage:</strong>\n- Experience in robotics, mechatronic, or embedded systems.\n- Experience with C++ for performance-critical applications.\n- Knowledge of GPU acceleration, CUDA, or distributed training.\n- Experience bringing RL models from simulation to real-world (Sim2Real).\n- Experience with cloud platforms (AWS/GCP/Azure).</p>\n<h3>Experience</h3>\n<ul>\n<li>2–5 years of hands-on RL experience (academic or industry).</li>\n<li>Published RL research papers (optional but preferred).</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s/Master’s/PhD in Computer Science, Robotics, AI, Machine Learning, or related field.</li>\n</ul>\n<h3>Location</h3>\n<ul>\n<li>Technopark, Thiruvananthapuram</li>\n</ul>\n<p><strong>For those interested in this position:</strong> <a href=\"#\">Click here to Apply</a></p>",
        "tags": [
            "2–5 Years",
            "Python",
            "PyTorch/TensorFlow",
            "Reinforcement Learning Libraries"
        ],
        "summary": "Develop and optimize reinforcement learning algorithms for real-world applications. Requires Python, ML frameworks, and simulation environment expertise."
    },
    {
        "job_title": "Embedded Engineer - BMS",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27307",
        "location": "Technopark",
        "closing_date": "18 Feb 2026",
        "job_description": "<h2>GENROBOTIC INNOVATIONS (P) Ltd</h2>\n<p><strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a>\n<strong>Closing Date:</strong> 18, Feb 2026\n<strong>Contact Email:</strong> career@genrobotics.org</p>\n<h3>Job Overview</h3>\n<p>We are seeking a skilled <strong>Battery Management System (BMS) Engineer</strong> with expertise in BMS architecture, components, and safety features. The ideal candidate will have experience in failure analysis, Li-Ion battery assembly (cylindrical, pouch, prismatic cells), and LV/HV battery system handling.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and test embedded software/firmware for BMS applications.</li>\n<li>Integrate/configure BMS hardware (microcontrollers, sensors, CAN, UART, SPI, I2C).</li>\n<li>Implement SOC, SOH, cell balancing algorithms, and safety controls.</li>\n<li>Collaborate with hardware engineers on PCB layouts and co-validation.</li>\n<li>Develop diagnostic tools and root-cause analysis for field issues.</li>\n<li>Document software design, validation protocols, and change logs.</li>\n<li>Integrate BMS data into higher-level systems/dashboards.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>Core Competencies:</strong> BMS architecture, failure analysis, Li-Ion battery assembly, LV/HV system handling.</li>\n<li><strong>Technical Expertise:</strong> DFA/DFS/DVA, thermal/energy management, SOP/work instruction preparation.</li>\n<li><strong>Protocols:</strong> RS485, Modbus, CAN, and custom protocol implementation.</li>\n<li><strong>Bonus:</strong> Knowledge of ISO 26262 functional safety standards.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> B.Tech in ECE/EEE</li>\n<li><strong>Experience:</strong> 2+ years in BMS development</li>\n<li><strong>Location:</strong> Technopark, Thiruvananthapuram</li>\n</ul>\n<p><strong>Application Link:</strong> <a href=\"#\">Click here to Apply</a></p>\n<p><strong>Note:</strong> Must include all responsibilities, skills, and qualifications from the original description.</p>",
        "tags": [
            "2+ Years",
            "Battery Management System (BMS)",
            "CAN/Modbus/RS485 Protocols",
            "Li-Ion Battery Assembly"
        ],
        "summary": "Embedded Engineer for BMS development with 2+ years experience in battery systems, protocols, and safety standards."
    },
    {
        "job_title": "Assistant General Manager - Finance",
        "company": "Applexus Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27306",
        "location": "Technopark",
        "closing_date": "19 Mar 2026",
        "job_description": "<h2><strong>APPLEXUS TECHNOLOGIES (P) Ltd</strong></h2>\n<p><strong>Address:</strong> 10th FLOOR, YAMUNA BUILDING, TECHNOPARK PHASE III CAMPUS, TRIVANDRUM, 695583\n<strong>Website:</strong> <a href=\"http://www.applexus.com\">http://www.applexus.com</a></p>\n<h3><strong>Assistant General Manager - Finance</strong></h3>\n<p><strong>Closing Date:</strong> 19, Mar 2026\n<strong>Job Published:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> krupa.thomas@applexus.com</p>\n<h3><strong>Brief Description</strong></h3>\n<p>Assistant General Manager level opening in Applexus, Technopark Ph III, Trivandrum.</p>\n<h3><strong>Key Roles and Responsibilities</strong></h3>\n<ul>\n<li>Oversee daily accounting in ERP systems for group entities.</li>\n<li>Manage revenue accounting, MIS reports, and monthly/quarterly financial close processes.</li>\n<li>Lead monthly/quarterly General Ledger close, journal entries review, and balance sheet reconciliations.</li>\n<li>Handle intercompany invoicing, accounting, and reporting across multiple entities.</li>\n<li>Manage AP/AR, ensuring accurate recording of revenue, expenses, and accruals.</li>\n<li>Ensure timely customer billing and periodic revenue completeness reviews.</li>\n<li>Approve fixed asset accounting and depreciation entries.</li>\n<li>Analyze financial data, create aggregate books for multi-country entities, and present consolidated group financial reports.</li>\n<li>Oversee audits of subsidiary entities' financial statements.</li>\n<li>Support VP Finance in financial close and tax return filings for group companies.</li>\n<li>Execute additional tasks assigned by VP Finance.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Professional qualification (CA/MBA).</li>\n<li>15+ years of experience in similar roles.</li>\n<li>Experience in IT/ITES or SEZ units.</li>\n<li>Excellent communication and relationship-building skills.</li>\n<li>Aptitude for automating reporting and AI tools.</li>\n<li>Strong analytical and quantitative abilities.</li>\n<li>Advanced Excel, PowerPoint, and Power BI skills.</li>\n<li>Experience with QuickBooks, Zoho, and other ERPs.</li>\n<li>Team-oriented, with strong interpersonal skills and confidentiality maintenance.</li>\n</ul>",
        "tags": [
            "15+ Years",
            "ERP (QuickBooks, Zoho)",
            "Power BI/Excel",
            "CA/MBA"
        ],
        "summary": "Assistant General Manager - Finance role at Applexus, requiring 15+ years of experience in accounting, ERP systems, and financial reporting for multi-country entities."
    },
    {
        "job_title": "Senior Mechanical Design Engineer (4 -6 Years)",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27305",
        "location": "Technopark",
        "closing_date": "18 Feb 2026",
        "job_description": "<h2>GENROBOTIC INNOVATIONS (P) Ltd</h2>\n<p><strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a></p>\n<h3>Senior Mechanical Design Engineer (4 - 6 Years)</h3>\n<p><strong>Closing Date:</strong> 18, Feb 2026\n<strong>Published:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> career@genrobotics.org</p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly skilled and innovative <strong>Senior Mechanical Design Engineer</strong> with a minimum of <strong>4 years of experience</strong> to join our dynamic Research &amp; Development team. The ideal candidate will have a comprehensive background in mechanical design and engineering principles, with a demonstrated ability to develop and implement cutting-edge products and solutions. The role involves the end-to-end design process, from initial concept through to production, including the prototyping and testing of mechanical components and systems to meet project requirements and company standards.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Generate innovative mechanical designs that meet project specifications and performance criteria.</li>\n<li>Employ CAD software (<strong>SolidWorks, SolidEdge</strong>) to create detailed 3D models and engineering drawings using <strong>ASME Y14.5</strong> standard.</li>\n<li>Conduct brainstorming sessions and design reviews to develop creative solutions to complex mechanical challenges.</li>\n<li>Perform feasibility studies to evaluate the technical and economic viability of new product ideas.</li>\n<li>Develop product specifications and requirements based on market research and stakeholder inputs.</li>\n<li>Create and maintain BOMs associated with engineering drawings.</li>\n<li>Develop detailed designs of mechanical components and assemblies, optimizing for manufacturability, assembly, and cost efficiency.</li>\n<li>Work closely with manufacturing teams to develop production processes and identify opportunities for automation and cost reduction.</li>\n<li>Create tolerance analyses and conduct <strong>FMEA</strong> (Failure Mode and Effects Analysis) to ensure robustness.</li>\n<li>Build physical prototypes using <strong>CNC machining, 3D printing</strong>, and traditional fabrication methods.</li>\n<li>Conduct thorough testing of prototypes using <strong>FEA</strong> (Finite Element Analysis) and other analytical tools.</li>\n<li>Refine designs based on test feedback and performance data.</li>\n<li>Integrate mechanical systems with electrical, software, and other subsystems.</li>\n<li>Identify opportunities for design improvements (performance, weight reduction, cost savings).</li>\n<li>Develop detailed project plans, track progress, and adjust timelines as needed.</li>\n<li>Collaborate with cross-functional teams for product launch, including production ramp-up and supply chain coordination.</li>\n<li>Prepare comprehensive technical documentation and maintain records of design iterations.</li>\n<li>Implement best practices in design processes and contribute to internal design standards.</li>\n<li>Stay current with advancements in mechanical engineering and evaluate new tools/technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Knowledge of mechanical design theory and design aspects.</strong></li>\n<li><strong>Experience with 3D CAD software</strong> (SolidWorks, SolidEdge).</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Ability to manage multiple projects independently.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Proficiency in <strong>DFMEA</strong> (Design Failure Mode and Effects Analysis).</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li><strong>Masters/Bachelor's degree in Mechanical Engineering.</strong></li>\n<li><strong>4-6 years of experience.</strong></li>\n<li><strong>Location:</strong> Technopark, Thiruvanathapuram.</li>\n</ul>\n<h3>Application</h3>\n<p><a href=\"#\">Click here to Apply</a></p>",
        "tags": [
            "4-6 Years",
            "SolidWorks",
            "SolidEdge",
            "FMEA"
        ],
        "summary": "Senior Mechanical Design Engineer with 4-6 years of experience in CAD software (SolidWorks, SolidEdge) and product development, focusing on end-to-end design, prototyping, and system integration."
    },
    {
        "job_title": "Business Development Manager - Software Sales",
        "company": "Hodo Medical Informatic Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27304",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<p><strong>Company:</strong> HODO MEDICAL INFORMATIC SOLUTIONS (P) Ltd\n<strong>Location:</strong> Module No- L-15, -1 Floor, Thejaswini Building, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://hodo.in\">https://hodo.in</a>\n<strong>Job Title:</strong> Business Development Manager - Software Sales\n<strong>Closing Date:</strong> 27 Feb 2026\n<strong>Job Published:</strong> 02 Feb 2026\n<strong>Contact Email:</strong> humanresources@hodo.in</p>\n<h3>Brief Description</h3>\n<p>Hodo Medical Informatic Solutions Pvt Ltd, a leading provider of innovative healthcare software solutions for hospitals and clinical laboratories, is seeking a motivated and experienced <strong>Business Development Manager</strong> with a strong background in <strong>software sales</strong>, particularly in the <strong>ERP domain</strong>.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Drive sales of healthcare software solutions to hospitals, clinical labs, and other healthcare institutions</li>\n<li>Achieve monthly, quarterly, and annual sales targets</li>\n<li>Build and maintain strong client and stakeholder relationships</li>\n<li>Identify new market opportunities for business growth</li>\n<li>Conduct product presentations and demonstrations</li>\n<li>Lead negotiations and close deals to meet revenue goals</li>\n<li>Collaborate with cross-functional teams to align sales strategies with customer needs</li>\n<li>Regular travel for client meetings across India</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor's degree in Engineering (BTech or equivalent); MBA preferred</li>\n<li>3-5 years of experience in software sales, with a focus on ERP solutions</li>\n<li>Proven track record of meeting/exceeding sales targets</li>\n<li>Strong knowledge of the Indian software sales market</li>\n<li>Excellent communication, negotiation, and relationship management skills</li>\n<li>Self-starter with a go-getter attitude</li>\n<li>Willingness to travel for client meetings</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary and incentive structure aligned with industry standards</li>\n<li>Opportunities for career growth and professional development</li>\n<li>Immediate joining available</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "ERP Solutions",
            "Healthcare Software Sales",
            "Cross-functional Team Collaboration"
        ],
        "summary": "Hodo Medical Informatic Solutions seeks a Business Development Manager to drive healthcare software sales, focusing on ERP solutions. Requires 3-5 years in software sales with strong client relationship and negotiation skills."
    },
    {
        "job_title": "Smart Sheet Developer- Contract",
        "company": "Ibil Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27302",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Company</strong>: IBIL Solutions (P) Ltd\n<strong>Address</strong>: 1A First Floor, Carnival Building, Phase 1, Technopark, 695581\n<strong>Website</strong>: <a href=\"https://www.ibilglobal.com\">https://www.ibilglobal.com</a>\n<strong>Contact Email</strong>: akash.deepu@ibilglobal.com</p>\n<p><strong>Job Title</strong>: Smart Sheet Developer\n<strong>Employment Type</strong>: Contract\n<strong>Location</strong>: Remote\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 02, Feb 2026</p>\n<h3>Role Summary</h3>\n<p>The Smartsheet Developer will design, develop, and maintain scalable Smartsheet-based solutions to support enterprise operations, workflow automation, and project delivery. Requires hands-on expertise in Smartsheet configuration, automation, and integrations to translate business requirements into user-friendly solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain Smartsheet solutions (sheets, dashboards, reports, forms) for business processes and operational tracking.</li>\n<li>Build and manage automated workflows using Smartsheet automation rules, alerts, approvals, and integrations.</li>\n<li>Collaborate with Business Analysts and stakeholders to gather requirements and deliver effective solutions.</li>\n<li>Optimize existing Smartsheet assets for performance, usability, and scalability.</li>\n<li>Ensure compliance with governance, security, access control, and data quality standards.</li>\n<li>Implement best practices for data structure, naming conventions, and documentation.</li>\n<li>Provide user support, training, and documentation for adoption and effective usage.</li>\n<li>Troubleshoot Smartsheet configurations, automations, and integrations.</li>\n<li>Support continuous improvement initiatives and automation opportunities across teams.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Minimum 5+ years</strong> of hands-on Smartsheet configuration and automation experience.</li>\n<li>Strong understanding of workflow design, business processes, and operational automation.</li>\n<li>Proven experience in enterprise-grade dashboards, reports, and forms.</li>\n<li>Focus on usability, data integrity, and user experience.</li>\n<li>Experience in cross-functional teams within Agile or project-based environments.</li>\n<li>Excellent analytical, problem-solving, and communication skills.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with Smartsheet APIs, connectors, or third-party integrations.</li>\n<li>Exposure to REST APIs, webhooks, or automation platforms (e.g., Power Automate, Zapier).</li>\n<li>Knowledge of governance models and security controls in Smartsheet.</li>\n<li>Smartsheet certification(s) is a plus.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Smartsheet Automation",
            "REST APIs",
            "Workflow Design"
        ],
        "summary": "Seeking a Smartsheet Developer with 5+ years of experience to design and automate enterprise workflows using Smartsheet, APIs, and integration tools. Requires expertise in configuration, automation, and workflow design for scalable solutions."
    },
    {
        "job_title": "Python Lead (6+Yrs)",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27301",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>GNX Digital Solutions (P) Ltd</strong></p>\n<p><strong>Location:</strong> Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581</p>\n<p><strong>Job Title:</strong> Python Lead (6+Yrs)\n<strong>Closing Date:</strong> 09, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> hr@gnxsolutions.in</p>\n<h3>Role Overview</h3>\n<p>As a Python Lead, you will:\n- Architect modular, maintainable, and high-performance backend systems.\n- Own the backend lifecycle: design → development → testing → deployment.\n- Build and scale RESTful APIs, microservices, and data pipelines.\n- Drive clean code practices and provide technical mentorship to the team.\n- Collaborate with Product Managers, UI/UX Designers, QA Engineers, and DevOps for seamless delivery.\n- Continuously evaluate and adopt the latest tools, frameworks, and best practices.\n- Ensure system performance, security, and fault-tolerance at scale.</p>\n<h3>Preferred Skills</h3>\n<p><strong>Core Tech Stack &amp; Must-Have Skills</strong>\n- 6+ years of hands-on Python backend development.\n- Strong experience with Django, Flask, or FastAPI (at least one in production).\n- Proficiency in RESTful API design and integration with ORMs (e.g., SQLAlchemy, Django ORM).\n- Solid understanding of data modeling, schema design, and database optimization.\n- Experience with PostgreSQL, MySQL, MongoDB, or similar databases.\n- Familiarity with Docker, Git, and CI/CD tools (GitHub Actions, Jenkins, etc.).\n- Hands-on with cloud platforms: AWS, GCP, or Azure (at least one).\n- Expertise in unit testing, debugging, and performance profiling.</p>\n<p><strong>Bonus Points</strong>\n- Experience with Kubernetes or other orchestration tools.\n- Familiarity with message brokers like Kafka, RabbitMQ, or Celery.\n- Knowledge of monitoring/logging tools: Prometheus, Grafana, Sentry, etc.\n- Basic understanding of frontend technologies (React/JS/CSS).\n- Prior experience leading Agile/Scrum teams, especially in distributed environments.</p>",
        "tags": [
            "6+ Years",
            "Python",
            "Django/Flask/FastAPI",
            "PostgreSQL/MySQL/MongoDB"
        ],
        "summary": "Lead Python backend development for scalable systems. Requires 6+ years of experience with Python frameworks, databases, and cloud platforms."
    },
    {
        "job_title": "UI / UX Designer",
        "company": "Subhosting Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27300",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Overview</h2>\n<p>SubHosting Innovations (P) Ltd is a dynamic company specializing in web hosting solutions and cutting-edge web application development. We are seeking a <strong>UI/UX Designer</strong> to join our team at Technopark Phase 3 Campus, Thiruvananthapuram, Kerala.</p>\n<h2>Job Description</h2>\n<p>We are looking for a creative, user-focused UI/UX Designer with <strong>2+ years of experience</strong> to design intuitive, engaging, and visually appealing digital products. The ideal candidate will collaborate closely with developers to deliver seamless user experiences across web and mobile platforms.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Conduct user research, usability testing, and competitor analysis</li>\n<li>Translate requirements into user flows, wireframes, prototypes, and high-fidelity UI designs</li>\n<li>Design responsive and pixel-perfect web and mobile interfaces</li>\n<li>Develop, maintain, and scale design systems and reusable UI components</li>\n<li>Work closely with developers to ensure accurate and efficient design handoff</li>\n<li>Review implemented UI and suggest improvements to maintain design quality</li>\n<li>Ensure accessibility, usability, and consistency across all platforms</li>\n<li>Continuously improve designs based on client feedback and data insights</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>2+ years</strong> of professional experience in UX/UI design</li>\n<li>Strong proficiency in <strong>Figma</strong> (Adobe XD / Sketch is a plus)</li>\n<li>Solid understanding of UX principles, interaction design, and usability standards</li>\n<li>Expert-level knowledge of <strong>HTML &amp; CSS</strong> with responsive design experience</li>\n<li>Experience with <strong>design systems</strong> and component-based design</li>\n<li>Ability to work independently and manage multiple projects</li>\n<li>Strong communication, collaboration, and problem-solving skills</li>\n<li>Attention to detail and a user-centered mindset</li>\n</ul>\n<h2>Qualification</h2>\n<ul>\n<li>Bachelor’s degree in any discipline (Computer Science or related fields preferred)</li>\n</ul>\n<h2>Contact Information</h2>\n<p>Interested candidates should send their resume to <strong>careers@subhosting.net</strong>.</p>",
        "tags": [
            "2+ Years",
            "Figma",
            "HTML/CSS",
            "Design Systems"
        ],
        "summary": "UI/UX Designer needed for a full-time role at SubHosting Innovations, requiring 2+ years of experience in designing responsive web/mobile interfaces with Figma, HTML/CSS, and design systems."
    },
    {
        "job_title": "Executive Assistant (Job Code-IIITMK/HR/OA/01202)",
        "company": "Indian Institute Of Information Technology And Management - Kerala (Iiitm-K)",
        "url": "https://technopark.org/job-details/27299",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>About the Organization</h2>\n<p>The Indian Institute of Information Technology and Management – Kerala (IIITMK) is an autonomous institution established by the Government of Kerala with a vision to advance knowledge and innovation in the fields of Information Technology and Electronics Innovation &amp; Research Excellence, Entrepreneurship Development, Product Development, and Academic &amp; Industry Collaboration. IIITMK continues to play a pivotal role in shaping Kerala’s digital future, empowering students, researchers, and entrepreneurs to transform ideas into impactful solutions.</p>\n<h2>Job Overview</h2>\n<p><strong>Position</strong>: Executive Assistant (Job Code-IIITMK/HR/OA/01202)\n<strong>Location</strong>: IIITM-K Campus, Technopark, Karyavattom PO, Thiruvananthapuram, 695581\n<strong>Closing Date</strong>: 10, Feb 2026\n<strong>Job Published</strong>: 02, Feb 2026\n<strong>Contact Email</strong>: careers@iiitmk.ac.in</p>\n<h2>Required Qualifications</h2>\n<ul>\n<li>Graduate in any discipline from a recognized and reputed University/Institution with 60% marks.</li>\n<li>Additional qualification of Degree/Diploma in Office Management will be preferred.</li>\n</ul>\n<h2>Experience</h2>\n<ul>\n<li>3 to 5 years experience in any reputed organisation.</li>\n<li>Well-versed with computer applications: MS Office (Word/Excel/PowerPoint) &amp; use of AI tools.</li>\n</ul>\n<h2>Roles &amp; Responsibilities</h2>\n<ul>\n<li>Answer and direct phone calls in a courteous manner.</li>\n<li>Organize and maintain office files, records, and documents.</li>\n<li>Order and manage office supplies to ensure continuous availability.</li>\n<li>Assist with data entry, document preparation, and other clerical tasks.</li>\n<li>Coordinate and schedule meetings and appointments.</li>\n<li>Greet visitors and provide assistance as needed.</li>\n<li>Support administrative staff with various tasks and projects.</li>\n<li>Maintain office cleanliness and organization.</li>\n<li>Handle basic bookkeeping tasks, such as expense tracking.</li>\n<li>Assist in preparing reports, presentations, and spreadsheets.</li>\n<li>Ensure confidentiality of sensitive information.</li>\n<li>Collaborate with team members to support business operations.</li>\n<li>Perform other related duties as assigned by management.</li>\n</ul>\n<h2>Application Details</h2>\n<ul>\n<li>Applications may be submitted online using the link: <a href=\"https://forms.gle/9HCx4dmdzcqV1jsr5\">https://forms.gle/9HCx4dmdzcqV1jsr5</a></li>\n<li>Date of Interview: 11.02.2026 from 09:00 AM</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "MS Office",
            "AI Tools",
            "Office Management"
        ],
        "summary": "IIITM-K seeks an Executive Assistant with 3-5 years of office management experience, MS Office proficiency, and AI tool familiarity for a 3-year contract on externally funded projects."
    },
    {
        "job_title": "Scientist (RF/VLSI Design/Material Science) Job Code -IIITMK/HR/SCT/012026",
        "company": "Indian Institute Of Information Technology And Management - Kerala (Iiitm-K)",
        "url": "https://technopark.org/job-details/27298",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>Indian Institute of Information Technology and Management - Kerala (IIITM-K)</h2>\n<p><strong>Address:</strong> IIITM-K Campus, Technopark, Karyavattom PO, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.iiitmk.ac.in\">www.iiitmk.ac.in</a>\n<strong>Contact Email:</strong> careers@iiitmk.ac.in</p>\n<h3>Job Title</h3>\n<p>Scientist (RF/VLSI Design/Material Science)\n<strong>Job Code:</strong> IIITMK/HR/SCT/012026\n<strong>Closing Date:</strong> 10, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026</p>\n<h3>About the Institution</h3>\n<p>The Indian Institute of Information Technology and Management – Kerala (IIITMK) is an autonomous institution established by the Government of Kerala. It focuses on advancing knowledge in Information Technology, Electronics Innovation, Research Excellence, Entrepreneurship Development, and Academic-Industry Collaboration. IIITMK plays a pivotal role in Kerala’s digital future by empowering students, researchers, and entrepreneurs to transform ideas into impactful solutions.</p>\n<h3>Job Overview</h3>\n<p>Applications are invited for a <strong>three-year contract</strong> position under externally funded projects. The role involves promoting scientific discoveries and solving challenges in <strong>Design/Material Science</strong>.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Collaborate with teams to develop projects for seed investment, grant funding, or industry partnerships.</li>\n<li>Deliver scientific insights and program support for translational science projects.</li>\n<li>Identify early-stage innovations and advance ideas to attract investment or industry development.</li>\n<li>Lead IP development, R&amp;D project evaluation, and translational research.</li>\n<li>Establish academic-industry collaborations and maintain links with researchers.</li>\n<li>Provide expertise on structuring translational projects and defining project milestones.</li>\n<li>Influence a culture of translatable science through training programs.</li>\n<li>Utilize EDA tools, material simulations, or experimental work.</li>\n<li>Collaborate with EDA companies (e.g., Synopsys) and foundries (e.g., Skywater/TSMC).</li>\n</ul>\n<h3>Required Qualifications</h3>\n<p><strong>Essential:</strong>\n- PhD in Electronics/Material Science or related fields, <strong>OR</strong> MTech with 3 years’ experience and <strong>three IEEE journal papers</strong>.\n- <strong>Minimum 3 years of work experience</strong> (including up to 3 years of PhD/postdoctoral research with Q1/Q2 journal publications).</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with 2D materials.</li>\n</ul>\n<h3>Application Process</h3>\n<ul>\n<li><strong>Interview Date:</strong> 11.02.2026 at 09:00 AM</li>\n<li><strong>Application Deadline:</strong> 12:00 PM on 10.02.2026</li>\n<li><strong>Application Link:</strong> <a href=\"https://forms.gle/9HCx4dmdzcqV1jsr5\">https://forms.gle/9HCx4dmdzcqV1jsr5</a></li>\n</ul>",
        "tags": [
            "3+ Years",
            "RF/VLSI Design",
            "Material Science",
            "EDA Tools"
        ],
        "summary": "Scientist role at IIITM-K for RF/VLSI Design/Material Science with 3+ years experience, requiring PhD and translational research expertise in electronics or material science."
    },
    {
        "job_title": "Customer Engagement Manager (Job Code : IIITMK/HR/CEM/012026)",
        "company": "Indian Institute Of Information Technology And Management - Kerala (Iiitm-K)",
        "url": "https://technopark.org/job-details/27297",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<p><strong>Indian Institute of Information Technology and Management - Kerala (IIITM-K)</strong></p>\n<p><strong>Campus:</strong>\nTechnopark, Karyavattom PO, Thiruvananthapuram, 695581\n<a href=\"http://www.iiitmk.ac.in\">Visit Website</a></p>\n<p><strong>Job Title:</strong> Customer Engagement Manager\n<strong>Job Code:</strong> IIITMK/HR/CEM/012026\n<strong>Closing Date:</strong> 10, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@iiitmk.ac.in\">careers@iiitmk.ac.in</a></p>\n<p><strong>Brief Description</strong></p>\n<p>The Indian Institute of Information Technology and Management – Kerala (IIITMK) is an autonomous institution established by the Government of Kerala. It focuses on advancing knowledge and innovation in Information Technology, Electronics Innovation, Research Excellence, Entrepreneurship Development, and Academic &amp; Industry Collaboration. Applications can be submitted online via <a href=\"https://forms.gle/9HCx4dmdzcqV1jsr5\">this link</a>.</p>\n<p><strong>Job Overview</strong></p>\n<p>IIITMK invites applications for a <strong>Customer Engagement Manager</strong> role on a three-year contract for externally funded projects. The role involves managing relationships with customers, government stakeholders, and institutional partners, with responsibilities spanning event management, logistics, recruitment, and performance reporting.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>Customer &amp; Stakeholder Engagement</strong></li>\n<li>Act as the primary point of contact for customers, government departments, and institutional stakeholders.</li>\n<li>Build and sustain strong engagement with government officials and key customers.</li>\n<li>Develop and implement strategies to enhance satisfaction and service delivery.</li>\n<li>\n<p>Handle customer issues, escalations, and feedback promptly.</p>\n</li>\n<li>\n<p><strong>Government &amp; Institutional Engagement</strong></p>\n</li>\n<li>Coordinate with central and state government departments for execution, reviews, and compliance.</li>\n<li>Manage official communication, meetings, and documentation.</li>\n<li>\n<p>Represent the organization in government meetings, workshops, and review forums.</p>\n</li>\n<li>\n<p><strong>Event &amp; Logistics Management</strong></p>\n</li>\n<li>Plan and execute customer engagement events, workshops, conferences, and outreach programs.</li>\n<li>Manage end-to-end logistics (vendors, venues, travel, accommodation, materials).</li>\n<li>\n<p>Ensure events are delivered on time and within budget.</p>\n</li>\n<li>\n<p><strong>Recruitment &amp; Workforce Coordination</strong></p>\n</li>\n<li>Coordinate recruitment of engagement and support staff.</li>\n<li>Support onboarding, deployment, and HR documentation.</li>\n<li>\n<p>Liaise with HR/Administration teams to ensure adequate manpower.</p>\n</li>\n<li>\n<p><strong>Reporting &amp; Performance Monitoring</strong></p>\n</li>\n<li>Prepare reports on customer engagement, stakeholder interactions, and event performance.</li>\n<li>Track KPIs related to customer satisfaction and engagement outcomes.</li>\n<li>Submit periodic reports to management and government stakeholders.</li>\n</ul>\n<p><strong>Qualifications &amp; Experience</strong></p>\n<ul>\n<li><strong>Essential Qualification:</strong> Four-year engineering undergraduate degree.</li>\n<li><strong>Preferred Qualifications:</strong> Postgraduate degree (MBA/PGDEMA/PGDM/MSc/M.Tech).</li>\n<li><strong>Experience:</strong> Minimum 8 years of combined professional experience in:</li>\n<li>Customer/stakeholder engagement</li>\n<li>Government department interaction</li>\n<li>Event/workshop organization</li>\n<li>Logistics coordination</li>\n<li>Recruitment and workforce management</li>\n</ul>\n<p><strong>Preferred Skills</strong>\n- Strong customer and stakeholder relationship management\n- Excellent communication and coordination abilities\n- Experience in government-facing and multi-stakeholder environments\n- Strong organizational and problem-solving skills\n- Proficiency in MS Office and reporting tools</p>",
        "tags": [
            "8+ Years",
            "Customer Engagement",
            "Government Interaction",
            "Event Management"
        ],
        "summary": "Customer Engagement Manager at IIITM-K requires 8+ years in stakeholder relations, government coordination, and event logistics. Focus on strategic engagement and operational execution for digital innovation projects."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27296",
        "location": "Technopark",
        "closing_date": "07 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd\n<strong>Location:</strong> Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a>\n<strong>Closing Date:</strong> 07, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3>Role Overview</h3>\n<p>We are seeking an energetic and confident <strong>Telesales Executive</strong> to join our growing team. This role is ideal for individuals passionate about sales and customer interaction, aiming to start or build a career in sales. As a Telesales Executive, you will drive business growth through outbound calls, customer engagement, and sales closures.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Make outbound calls to potential and existing customers</li>\n<li>Promote products/services with clarity, professionalism, and friendliness</li>\n<li>Explain product features, pricing, and benefits effectively</li>\n<li>Handle customer queries and provide accurate information</li>\n<li>Follow up on leads and maintain customer records</li>\n<li>Build and maintain strong customer relationships</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> 0–1 year (Freshers welcome)</li>\n<li>Immediate joiners preferred</li>\n<li>Open to both male and female candidates</li>\n<li><strong>Fluency in Malayalam required</strong></li>\n<li>Willingness to work from the office</li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li><strong>Basic Pay:</strong> ₹14,000–₹20,000/month</li>\n<li>Performance-based incentives</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates must apply with the subject line: <strong>“Telesales Executive”</strong>.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Confident and professional telephone etiquette</li>\n<li>Ability to handle rejection positively and remain self-motivated</li>\n<li>Strong customer interaction and relationship-building skills</li>\n<li>Excellent verbal communication skills</li>\n<li>Effective time management and organizational abilities</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Malayalam",
            "Telesales",
            "Customer Relationship Management"
        ],
        "summary": "Telesales Executive role involves outbound calls, customer engagement, and sales closures. Requires Malayalam fluency and 0-1 years of experience."
    },
    {
        "job_title": "Senior Software Engineer: Python",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27295",
        "location": "Technopark",
        "closing_date": "14 Feb 2026",
        "job_description": "<p><strong>TRENSER Technology Solutions (P) Ltd</strong></p>\n<p><strong>Senior Software Engineer: Python</strong></p>\n<p><strong>Location:</strong> Thejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Company Website:</strong> <a href=\"http://www.trenser.com\">http://www.trenser.com</a>\n<strong>Closing Date:</strong> 14, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@trenser.com\">careers@trenser.com</a></p>\n<h3>Overview</h3>\n<p>We are seeking an experienced Python Developer to join our team and contribute to the development of scalable, high-quality backend systems. The ideal candidate should have strong hands-on experience in Python-based frameworks and a solid understanding of modern backend architectures.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, test, and maintain backend applications using Python</li>\n<li>Build and consume RESTful APIs and work within a microservices-based architecture</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver features</li>\n<li>Write clean, maintainable, and efficient code following best practices</li>\n<li>Participate in code reviews, debugging, and performance optimization</li>\n<li>Ensure application security, scalability, and reliability</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>5+ years</strong> of hands-on experience in backend development using Python</li>\n<li>Proven experience working with Python 3.x in production environments</li>\n<li>Minimum 5 years of experience with frameworks such as Flask or FastAPI</li>\n<li>Experience in designing and developing RESTful services and microservices</li>\n<li>Hands-on experience with relational and NoSQL databases (PostgreSQL, MySQL, MongoDB)</li>\n<li>Experience working in containerized environments using Docker and CI/CD pipelines</li>\n<li>Strong proficiency in Python 3.x</li>\n<li>Good understanding of data structures, algorithms, and OOP principles</li>\n<li>Proficiency with Git/GitHub/GitLab</li>\n</ul>\n<h3>Contact</h3>\n<p>For inquiries, reach out to <a href=\"mailto:careers@trenser.com\">careers@trenser.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Python 3.x",
            "Flask/FastAPI",
            "Docker/CI-CD"
        ],
        "summary": "Senior Python Developer needed for scalable backend systems. Requires 5+ years of Python expertise and experience with microservices, REST APIs, and containerization."
    },
    {
        "job_title": "Mobile Application Developer",
        "company": "Xilligence",
        "url": "https://technopark.org/job-details/27294",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Xilligence</strong>\n611-615, 6th Floor, Nila, Technopark, Trivandrum, Kerala - 695581\n<a href=\"http://www.xilligence.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> libin.raj@xilligence.com</p>\n<h2>Role Overview</h2>\n<p>We are seeking a <strong>Mobile Application Developer</strong> with expertise in <strong>Wearable &amp; Native Development</strong>. The role focuses on <strong>WatchOS/WearOS native extensions</strong> and complex mobile features such as <strong>Biometrics</strong> and <strong>GPS</strong>.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Develop and maintain native mobile applications for WatchOS/WearOS platforms.</li>\n<li>Implement advanced features like biometric authentication and GPS tracking.</li>\n<li>Collaborate with cross-functional teams to design and deliver high-quality software solutions.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>React Native</strong></li>\n<li><strong>WatchOS/WearOS</strong> development</li>\n<li><strong>Biometrics</strong> integration</li>\n<li><strong>GPS</strong> functionality</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li><strong>4-6 Years</strong> of relevant experience</li>\n<li><strong>0-30 Days</strong> notice period</li>\n<li><strong>Full Time (WFO)</strong> mode of work</li>\n<li><strong>Trivandrum (Technopark), Kerala</strong> location</li>\n</ul>",
        "tags": [
            "4-6 Years",
            "React Native",
            "WatchOS/WearOS",
            "Biometrics"
        ],
        "summary": "Seeking a Mobile App Developer with 4-6 years of experience in WatchOS/WearOS and Biometrics/GPS features. Full-time role in Trivandrum, Kerala."
    },
    {
        "job_title": "Lead /Architect - Java",
        "company": "Ospyn Technologies Ltd",
        "url": "https://technopark.org/job-details/27293",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Info</h2>\n<p><strong>Ospyn Technologies Ltd</strong>\n1st Floor, Kabani Building,\nTechnopark Phase-4, Pallipuram,\nThiruvananthapuram, 695317\n<a href=\"http://www.ospyn.com\">http://www.ospyn.com</a></p>\n<h2>Job Details</h2>\n<p><strong>Role</strong>: Lead / Architect - Java\n<strong>Closing Date</strong>: 28, Feb 2026\n<strong>Published</strong>: 02, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@ospyn.com\">careers@ospyn.com</a></p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Hands-on experience in Java development</li>\n<li>Sound experience in Java, Java EE, Hibernate</li>\n<li>Proficiency in Java frameworks: Spring Framework, Spring MVC, Spring Boot</li>\n<li>Experience with SQL, JDBC, JPA</li>\n<li>Knowledge of JavaScript, jQuery, React, and other front-end technologies</li>\n<li>Experience with APIs (REST), SDKs, CLI tools</li>\n<li>Familiarity with Document Management / Enterprise Content Management domain</li>\n<li>Conduct requirement analysis</li>\n<li>Develop high-quality, detailed designs</li>\n<li>Identify risks and create mitigation plans</li>\n<li>Apply coding standards and best practices</li>\n<li>Review code and provide feedback</li>\n<li>Lead teams and mentor developers</li>\n<li>Set strategic direction for the team</li>\n<li>Stay updated on industry technology trends</li>\n<li>Collaborate in distributed teams to build scalable, distributed applications using Java &amp; J2EE</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Qualification</strong>: B.Tech/BE/MCA/M.Tech</li>\n<li><strong>Experience</strong>: 8 to 15 years</li>\n<li><strong>Location</strong>: Trivandrum</li>\n<li><strong>DOJ</strong>: Immediate to 30 Days</li>\n</ul>",
        "tags": [
            "8-15 Years",
            "Java",
            "Spring Framework",
            "REST APIs"
        ],
        "summary": "Lead/Architect - Java role requiring 8-15 years of experience in Java development, team leadership, and scalable application design with Spring and REST APIs."
    },
    {
        "job_title": "Backend Developer",
        "company": "Xilligence",
        "url": "https://technopark.org/job-details/27292",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Address:</strong> Xilligence, 611-615, 6th Floor, Nila, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.xilligence.com\">http://www.xilligence.com</a></p>\n<h2>Job Details</h2>\n<p><strong>Position:</strong> Backend Developer\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published On:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> sruthi.mohan@xilligence.com</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Expertise in <strong>Node.js</strong> and <strong>GraphQL</strong> for backend development</li>\n<li>Design and implement <strong>Headless CMS</strong> solutions</li>\n<li>Manage <strong>enterprise API connections</strong> and integrations</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>4-7 Years</strong> of relevant experience</li>\n<li><strong>0-30 Days</strong> notice period</li>\n<li><strong>Full Time (WFO)</strong> work mode</li>\n<li><strong>Trivandrum (Technopark), Kerala</strong> location</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Node.js</strong></li>\n<li><strong>API</strong> development</li>\n<li><strong>GraphQL</strong></li>\n<li><strong>AI</strong> (Artificial Intelligence)</li>\n</ul>",
        "tags": [
            "4-7 Years",
            "Node.js",
            "GraphQL",
            "API"
        ],
        "summary": "Seeking a Backend Developer with 4-7 years of experience in Node.js and GraphQL for API integrations and Headless CMS. Full-time position at Xilligence in Trivandrum, Kerala."
    },
    {
        "job_title": "Senior Full-Stack Developer",
        "company": "Xilligence",
        "url": "https://technopark.org/job-details/27291",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Info</h2>\n<p><strong>Xilligence</strong>\n611-615, 6th Floor, Nila, Technopark, Trivandrum, 695581\n<a href=\"http://www.xilligence.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Role</strong>: Senior Full-Stack Developer\n<strong>Closing Date</strong>: 28, Feb 2026\n<strong>Published On</strong>: 02, Feb 2026\n<strong>Mode of Work</strong>: Full Time\n<strong>Location</strong>: Trivandrum (Technopark), Kerala</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Develop and maintain <strong>React Native</strong> (Mobile) and <strong>React.js</strong> (Web) applications</li>\n<li>Ensure feature parity across mobile and web platforms</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>React Native</strong></li>\n<li><strong>React.js</strong></li>\n<li><strong>Node.js</strong></li>\n<li><strong>AI</strong></li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li><strong>8-11 Years</strong> of experience</li>\n<li>Notice Period: <strong>0-30 days</strong></li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Email</strong>: <a href=\"mailto:devika.chandana@xilligence.com\">devika.chandana@xilligence.com</a></p>",
        "tags": [
            "8-11 Years",
            "React Native",
            "React.js",
            "Node.js"
        ],
        "summary": "Senior Full-Stack Developer with expertise in React Native and React.js, maintaining cross-platform feature parity. Based in Trivandrum, Kerala."
    },
    {
        "job_title": "Customer Success Executive - English",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27290",
        "location": "Technopark",
        "closing_date": "06 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Customer Success Executive</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a <strong>Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our US clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Address customer queries through <strong>phone, email, chat, and social media channels</strong>.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to <strong>products, orders, returns, and general support requests</strong>.</li>\n<li>Maintain accurate <strong>customer records and feedback</strong> in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking <strong>customer satisfaction metrics</strong> and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Proven experience (2-5 years)</strong> in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills to handle US customers.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work in rotational shifts (morning, noon, and night).</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Email</strong>: careers@way.com</li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a></li>\n</ul>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Customer Service",
            "US Customer Communication"
        ],
        "summary": "Customer Success Executive handling US client inquiries via multiple channels with 2-5 years of experience. Focus on resolving issues and improving customer satisfaction in a tech-driven auto super app environment."
    },
    {
        "job_title": "Senior/Lead Executive Presales",
        "company": "Ospyn Technologies Ltd",
        "url": "https://technopark.org/job-details/27289",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2><strong>Senior/Lead Executive Presales</strong> at Ospyn Technologies Ltd</h2>\n<p><strong>Location:</strong> Trivandrum / Remote\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@ospyn.com\">careers@ospyn.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a dynamic and technically proficient <strong>Presales Executive</strong> to join our growing team. The ideal candidate will bridge the sales and technical teams by delivering product demonstrations, managing bid/proposal responses, and providing technical solutions to client needs.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ol>\n<li><strong>Product Demonstrations &amp; Presentations</strong></li>\n<li>Conduct client-specific product demos (on-site and remote) to showcase solution capabilities.</li>\n<li>Tailor presentations to address client requirements and highlight value propositions.</li>\n<li>\n<p>Gather and analyze customer feedback to inform product development and sales strategies.</p>\n</li>\n<li>\n<p><strong>Bid &amp; Proposal Management</strong></p>\n</li>\n<li>Lead RFP/RFQ/RFI responses and collaborate with technical, legal, and finance teams.</li>\n<li>Ensure timely, compliant, and high-quality bid submissions.</li>\n<li>Maintain a repository of reusable proposal templates and documentation.</li>\n</ol>\n<h3><strong>Preferred Skills &amp; Competencies</strong></h3>\n<ul>\n<li>Excellent verbal and written communication/presentation skills</li>\n<li>Strong understanding of sales/presales processes</li>\n<li>Technical proficiency in company products/solutions</li>\n<li>Proposal writing and documentation experience</li>\n<li>Ability to manage multiple bids/demos simultaneously</li>\n<li>Strong interpersonal and client-facing skills</li>\n</ul>\n<h3><strong>Preferred Qualifications</strong></h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, IT, Business, or related fields</li>\n<li>Familiarity with MS Office (PowerPoint, Excel, Word), CRM software, and bid management platforms</li>\n</ul>\n<h3><strong>Work Environment</strong></h3>\n<ul>\n<li>Occasional travel for client meetings and on-site demos</li>\n</ul>\n<p><strong>Employment Type:</strong> Full-time\n<strong>Experience Required:</strong> 5 to 10 years in Presales, Bid Management, or Proposal Writing within IT/Software</p>",
        "tags": [
            "5 to 10 years",
            "Product Demonstrations",
            "Bid Management",
            "Proposal Writing"
        ],
        "summary": "Senior/Lead Presales Executive at Ospyn Technologies requires 5-10 years of experience in IT/Software, managing bids, and delivering product demos to bridge sales and technical teams."
    },
    {
        "job_title": "Linux System Administrator",
        "company": "Ospyn Technologies Ltd",
        "url": "https://technopark.org/job-details/27288",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Ospyn Technologies Ltd</h2>\n<p><strong>Location:</strong> 1st Floor, Kabani Building, Technopark Phase-4, Pallipuram, Thiruvananthapuram, 695317\n<strong>Website:</strong> <a href=\"http://www.ospyn.com\">http://www.ospyn.com</a>\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> careers@ospyn.com</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Manage and maintain large-scale Linux server infrastructure (physical, virtual, and cloud).</li>\n<li>Plan and execute OS upgrades, patching, and kernel updates with minimal downtime.</li>\n<li>Perform capacity planning, performance tuning, and system optimization.</li>\n<li>Design and implement automated scripts and Ansible playbooks for configuration management and deployments.</li>\n<li>Configure and secure services such as Apache, Nginx, MySQL/PostgreSQL, Tomcat, JBoss, WebLogic, FTP, NFS, and Samba.</li>\n<li>Troubleshoot complex system, network, and application issues across multiple environments.</li>\n<li>Set up and manage firewall rules, SELinux, auditing, and system hardening measures.</li>\n<li>Monitor and manage logs, system health, and alerts using tools like Zabbix, Prometheus, Grafana, or Nagios.</li>\n<li>Manage centralized backup systems, disaster recovery plans, and storage (LVM, RAID, SAN/NAS).</li>\n<li>Participate in incident, change, and problem management processes.</li>\n<li>Support DevOps processes and CI/CD pipeline integrations.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Expertise in Linux (RHEL/CentOS/Ubuntu) system administration and troubleshooting.</li>\n<li>Strong scripting experience in Bash, Python, or Perl.</li>\n<li>Proficiency in server hardening, auditing, and securing Linux systems.</li>\n<li>Hands-on experience with virtualization technologies (KVM, VMware, Proxmox).</li>\n<li>Basic knowledge of database administration (MySQL, MariaDB, PostgreSQL).</li>\n<li>Familiarity with container technologies (Docker) and basic Kubernetes.</li>\n<li>Solid understanding of networking fundamentals: TCP/IP, DNS, DHCP, LDAP, VPN.</li>\n<li>Experience with Git, Jenkins, and CI/CD pipelines.</li>\n</ul>\n<h3>Education &amp; Certifications</h3>\n<ul>\n<li>Bachelor's Degree in Engineering (BE) or Master’s in Computer Applications (MCA).</li>\n<li>Certifications: RHCSA / RHCE or equivalent.</li>\n<li>Exposure to cloud platforms (AWS, Azure, GCP).</li>\n<li>Familiarity with HAProxy, Load Balancing, and clustering.</li>\n</ul>\n<h3>Additional Requirements</h3>\n<ul>\n<li>Strong communication and collaboration skills.</li>\n<li>Ability to lead small tasks or mentor junior staff.</li>\n<li>Capable of prioritizing and managing multiple tasks in high-pressure environments.</li>\n<li>Willingness to work in on-call rotation and provide extended support when required.</li>\n<li><strong>Experience:</strong> 2-4 years</li>\n<li><strong>Location:</strong> Thiruvananthapuram</li>\n<li><strong>Notice Period:</strong> 30 to 45 Days</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "Linux Administration",
            "Ansible",
            "Cloud Platforms"
        ],
        "summary": "Linux System Administrator role managing infrastructure, automation, and security. Requires 2-4 years with Linux, Ansible, and cloud platforms."
    },
    {
        "job_title": "GRC Analyst",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27287",
        "location": "Technopark",
        "closing_date": "19 Mar 2026",
        "job_description": "<h2>Company Info</h2>\n<p><strong>ECS BUSINESS SOLUTIONS (P) Ltd</strong>\nModule No. 422, 423 and 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, Trivandrum, 695581\n<a href=\"https://www.ecsfin.com\">Visit Website</a></p>\n<p><strong>Contact:</strong>\n- Email: <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role:</strong> GRC Analyst\n<strong>Closing Date:</strong> 19, Mar 2026\n<strong>Published:</strong> 02, Feb 2026\n<strong>Location:</strong> Trivandrum\n<strong>Experience:</strong> 1–2+ years (Freshers with relevant exposure encouraged)</p>\n<h2>Key Responsibilities</h2>\n<h3>ISO 27001 &amp; SOC 2 Compliance</h3>\n<ul>\n<li>Support implementation and maintenance of the Information Security Management System (ISMS)</li>\n<li>Assist in ISO/IEC 27001 and SOC 2 Type II compliance activities</li>\n<li>Collect, review, and organize audit evidence</li>\n<li>Support internal and external audits (ISO 27001, SOC 2)</li>\n<li>Track corrective actions and remediation plans</li>\n</ul>\n<h3>Policies, Procedures &amp; Documentation</h3>\n<ul>\n<li>Draft, review, and update information security policies, standards, and guidelines</li>\n<li>Maintain version-controlled GRC documentation repositories</li>\n<li>Ensure alignment with ISO 27001 control requirements</li>\n</ul>\n<h3>Risk Management</h3>\n<ul>\n<li>Assist in risk identification and assessment activities</li>\n<li>Maintain risk registers and track risk treatment actions</li>\n<li>Follow up with stakeholders on mitigation and closure</li>\n</ul>\n<h3>Third-Party / Vendor Risk</h3>\n<ul>\n<li>Conduct basic third-party risk assessments</li>\n<li>Review vendor security questionnaires and evidence</li>\n<li>Track vendor remediation and follow-ups</li>\n</ul>\n<h3>Training &amp; Awareness</h3>\n<ul>\n<li>Support compliance and security awareness training initiatives</li>\n<li>Ensure policies and procedures are communicated and accessible</li>\n<li>Assist in compliance awareness campaigns</li>\n</ul>\n<h3>Reporting &amp; Metrics</h3>\n<ul>\n<li>Maintain compliance trackers, audit logs, and evidence matrices</li>\n<li>Prepare basic compliance and risk reports</li>\n<li>Support dashboard and status reporting for leadership</li>\n</ul>\n<h2>Required Qualifications</h2>\n<h3>Education</h3>\n<ul>\n<li>Bachelor’s degree in:</li>\n<li>Information Technology</li>\n<li>Computer Science</li>\n<li>Information Security</li>\n<li>Cybersecurity</li>\n<li>Risk Management</li>\n<li>Related field</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li>Minimum 1 year in:</li>\n<li>GRC</li>\n<li>IT audit</li>\n<li>IT compliance</li>\n<li>Information security</li>\n<li>Risk management</li>\n<li>OR</li>\n<li>Internship, academic project, or practical exposure to ISO 27001/SOC 2</li>\n</ul>\n<h2>Mandatory Skills &amp; Knowledge</h2>\n<ul>\n<li>Working knowledge of ISO/IEC 27001 framework</li>\n<li>ISMS concepts</li>\n<li>Risk assessment and treatment</li>\n<li>High-level understanding of Annex A controls</li>\n<li>Basic understanding of SOC 2 Trust Services Criteria</li>\n<li>Information security principles:</li>\n<li>Access control</li>\n<li>Asset management</li>\n<li>Incident management</li>\n<li>Risk management</li>\n<li>Strong documentation and written communication skills</li>\n<li>Attention to detail and structured thinking</li>\n<li>Proficiency in:</li>\n<li>MS Excel / Google Sheets</li>\n<li>Word / Documentation tools</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Awareness of:</li>\n<li>NIST Cybersecurity Framework (NIST CSF)</li>\n<li>GDPR</li>\n<li>CSA CAIQ</li>\n<li>Exposure to GRC tools</li>\n<li>Certifications/training (in progress or completed):</li>\n<li>ISO 27001 Foundation / Lead Implementer / Lead Auditor</li>\n<li>Exposure to SaaS, fintech, BFSI, or regulated environments</li>\n</ul>\n<h2>Key Competencies</h2>\n<ul>\n<li>Willingness to learn and grow in GRC and cybersecurity</li>\n<li>Ability to work with technical and non-technical stakeholders</li>\n<li>Strong organizational and follow-up skills</li>\n<li>Ethical mindset and confidentiality awareness</li>\n<li>Good verbal and written communication skills</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "ISO/IEC 27001",
            "SOC 2",
            "Information Security Management System (ISMS)"
        ],
        "summary": "ECS Fin seeks a GRC Analyst with 1-2 years experience to support ISO/IEC 27001 and SOC 2 compliance, risk management, and documentation."
    },
    {
        "job_title": "Lead Full Stack Developer",
        "company": "Good Methods Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27286",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>About CareRevenue and the team</h2>\n<p>CareRevenue builds cloud platforms that modernize U.S. dental practices. We are now spinning up an independent, startup-mode team to super-charge Revenue Cycle Management (RCM) with AI, automation, and data-driven workflows. This team will operate as a tech-agnostic innovation unit focused on transforming manual RCM processes into scalable, tech-enabled solutions.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Take untapped RCM opportunities, design full-stack solutions that solve real problems and ship them to production, and iterate on real-world feedback.</li>\n<li>Select and justify the best tools/frameworks per project; implement PoCs when needed.</li>\n<li>Build and maintain secure, scalable APIs, UIs, automations, and data pipelines.</li>\n<li>Integrate third-party systems (EHR, CRM, payment gateways, RPA bots).</li>\n<li>Uphold code quality with reviews, automated tests, CI/CD, and cloud-native best practices.</li>\n<li>Mentor junior engineers in problem-solving and tech-agnostic thinking.</li>\n<li>Work closely with the RCM operations team to understand pain points and identify high-impact automation opportunities.</li>\n<li>Focus on measurable business outcomes rather than processes, with emphasis on RCM performance metrics improvement.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>8 – 12 yrs</strong> designing, coding, testing, and running production software end-to-end.</li>\n<li>Proven ability to learn new stacks fast and pick “best-fit” tech (language, framework, cloud, DB) per use case.</li>\n<li>Deep grasp of computer-science fundamentals, distributed systems, and REST/gRPC/GraphQL API design.</li>\n<li>Solid understanding of front-end ↔ back-end integration patterns (contract design, API gateways, auth flows) and real-time communication (WebSockets, SSE, pub-sub, event streams).</li>\n<li>Hands-on cloud (AWS / GCP / Azure) with container orchestration and observability.</li>\n<li>Strong unit/integration testing discipline; Git &amp; trunk-based workflows. Bias for metrics-driven decisions and rapid experimentation.</li>\n<li>Outcome-focused approach that prioritizes solving real business problems over following rigid processes.</li>\n<li>Excellent written &amp; verbal communication with non-technical stakeholders.</li>\n</ul>\n<p><strong>Location:</strong> Kochi, Trivandrum (Onsite)\n<strong>Notice Period:</strong> Immediate - 30 days\n<strong>Contact Email:</strong> careers@carerevenue.com</p>",
        "tags": [
            "8-12 Years",
            "Cloud (AWS/GCP/Azure)",
            "API Design (REST/gRPC/GraphQL)",
            "Automation (RPA, Data Pipelines)"
        ],
        "summary": "Lead Full Stack Developer needed for AI-driven RCM solutions. Requires 8-12 years of experience in cloud, API design, and automation."
    },
    {
        "job_title": "Assistant Finance Officer ( Job Code -IIITMK/HR/AFO/012026)",
        "company": "Indian Institute Of Information Technology And Management - Kerala (Iiitm-K)",
        "url": "https://technopark.org/job-details/27285",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>About IIITM-K</h2>\n<p>The Indian Institute of Information Technology and Management – Kerala (IIITMK) is an autonomous institution established by the Government of Kerala. Its mission is to advance knowledge and innovation in Information Technology, Electronics Innovation &amp; Research, Entrepreneurship Development, and Academic &amp; Industry Collaboration.</p>\n<h2>Job Overview</h2>\n<p><strong>Position</strong>: Assistant Finance Officer\n<strong>Job Code</strong>: IIITMK/HR/AFO/012026\n<strong>Location</strong>: IIITM-K Campus, Technopark, Karyavattom PO, Thiruvananthapuram, 695581\n<strong>Closing Date</strong>: 09, Feb 2026\n<strong>Contact Email</strong>: careers@iiitmk.ac.in</p>\n<h2>Roles &amp; Responsibilities</h2>\n<ul>\n<li>Reports to Finance Officer (FO); supports the finance division and provides data/analysis for FO decisions</li>\n<li>Assists in budget implementation and expenditure monitoring</li>\n<li>Prepares audit schedules, reconciles accounts, and supports compliance documentation</li>\n<li>Drafts reports, maintains ledgers, prepares vouchers/statements</li>\n<li>Processes invoices, maintains procurement records, and assists in tender documentation</li>\n<li>Executes payroll processing and maintains employee financial records</li>\n<li>Ensures accuracy of entries and prevents clerical errors</li>\n<li>Manages execution, record-keeping, and operational support</li>\n</ul>\n<h2>Required Qualifications</h2>\n<ul>\n<li>Bachelor’s Degree in Commerce/Finance/Accounting</li>\n<li>Preference for CA (Inter), ICWA (Inter), or MBA (Finance)</li>\n</ul>\n<h2>Experience</h2>\n<ul>\n<li>3-5 years of professional experience in accounts/finance, preferably in government, autonomous institutions, or organizations</li>\n<li>Exposure to budget preparation, Government grants, and procurement rules</li>\n<li>Strong practical knowledge of financial processes is advantageous</li>\n</ul>\n<h2>Skills &amp; Knowledge</h2>\n<ul>\n<li>Strong knowledge of double-entry accounting, statutory compliance, and financial reporting</li>\n<li>Ability to manage payroll, procurement, and internal audit systems</li>\n<li>Familiarity with GST, Income Tax, and other statutory filings</li>\n</ul>\n<h2>Application Details</h2>\n<ul>\n<li><strong>Interview Date</strong>: 10.02.2026 from 09:00 AM</li>\n<li><strong>Application Deadline</strong>: 12:00 PM on 09.02.2026</li>\n<li><strong>Application Submission</strong>: Online until the deadline</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "CA/ICWA/MBA (Finance)",
            "Government Grants",
            "GST/Income Tax Compliance"
        ],
        "summary": "Assistant Finance Officer at IIITM-K handles financial operations, requiring 3-5 years of experience in accounts/finance, preferably in government or autonomous institutions. Key skills include statutory compliance, payroll management, and budgeting."
    },
    {
        "job_title": "Salesforce Developers",
        "company": "Tricta Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27284",
        "location": "Technopark",
        "closing_date": "01 Mar 2026",
        "job_description": "<p><strong>Tricta Technologies (P) Ltd</strong>\n4th Floor Module No-7(a), Gayatri Roof Top, Technopark Campus, Trivandrum – 695581\n<a href=\"https://www.tricta.com\">https://www.tricta.com</a></p>\n<p><strong>Salesforce Developers</strong>\n<strong>Closing Date:</strong> 01, Mar 2026\n<strong>Job Published:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@tricta.com\">hr@tricta.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking experienced professionals in <strong>Developers</strong>, <strong>Architects</strong>, <strong>QA/Test Analysts</strong>, and <strong>Functional Consultants</strong> roles. Ideal candidates possess strong platform expertise, hands-on project experience, and relevant certifications to contribute to designing, building, testing, and delivering scalable Salesforce solutions. If you are passionate about CRM and cloud solutions and thrive in collaborative, client-focused environments, explore our openings.</p>\n<h3>Experience</h3>\n<ul>\n<li><strong>Mid-Level:</strong> 5+ Years of hands-on Salesforce development experience</li>\n<li><strong>Senior:</strong> 8+ Years of hands-on Salesforce development experience</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Core Technologies:</strong> Apex, Lightning Web Components (LWC), Aura (legacy where applicable)</li>\n<li><strong>Development:</strong> Salesforce configuration/customization, SOQL/SOSL, Governor Limits, performance optimization</li>\n<li><strong>Integration:</strong> REST/SOAP integrations, API-based integration</li>\n<li><strong>Automation:</strong> Salesforce Flows, validation rules, automation best practices</li>\n<li><strong>Tools:</strong> Familiarity with CI/CD procedures and tools</li>\n</ul>\n<h3>Certifications</h3>\n<ul>\n<li><strong>Must Have:</strong> Salesforce Admin and PD1</li>\n<li><strong>Nice to Have:</strong> Advanced Admin and PD2</li>\n</ul>\n<h3>Cloud Expertise</h3>\n<ul>\n<li><strong>Required:</strong> Sales Cloud, Service Cloud</li>\n<li><strong>Strong Plus:</strong> Revenue Cloud (CPQ, Billing)</li>\n<li><strong>Desirable:</strong> Experience Cloud, Industry Clouds</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Apex",
            "Lightning Web Components",
            "REST/SOAP Integrations"
        ],
        "summary": "Tricta Technologies seeks experienced Salesforce Developers with 5+ years in hands-on development, expertise in Apex and Lightning Web Components, and proficiency in REST/SOAP integrations. Candidates must hold Salesforce Admin and PD1 certifications to deliver scalable CRM solutions."
    },
    {
        "job_title": "Finance Officer (Job Code -IIITMK/HR/FO/012026)",
        "company": "Indian Institute Of Information Technology And Management - Kerala (Iiitm-K)",
        "url": "https://technopark.org/job-details/27283",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>Indian Institute of Information Technology and Management - Kerala (IIITM-K)</strong></p>\n<p><strong>Campus:</strong>\nTechnopark, Karyavattom PO, Thiruvananthapuram, 695581</p>\n<p><strong>Contact:</strong>\nEmail: <a href=\"mailto:careers@iiitmk.ac.in\">careers@iiitmk.ac.in</a>\nWebsite: <a href=\"http://www.iiitmk.ac.in\">www.iiitmk.ac.in</a></p>\n<p><strong>Job Title:</strong> Finance Officer (Job Code - IIITMK/HR/FO/012026)\n<strong>Closing Date:</strong> 09, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026</p>\n<p><strong>About the Organization:</strong>\nIIITM-K is an autonomous institution established by the Government of Kerala, focused on advancing knowledge in Information Technology, Electronics Innovation, and Entrepreneurship. It plays a pivotal role in Kerala’s digital future through academic-industry collaboration and innovation.</p>\n<p><strong>Job Overview:</strong>\nIIITM-K invites applications for a <strong>Finance Officer</strong> to lead the Centre of Excellence (CoE) on IIoT Sensors, drive incubation programs, and ensure strategic financial management for externally funded projects. The role is for a three-year contract.</p>\n<p><strong>Key Responsibilities:</strong>\n- Prepare budgets, financial forecasts, and advise the Director/Board on financial matters.\n- Ensure compliance with CAG, GFR, Kerala Treasury rules, and liaise with auditors.\n- Approve balance sheets, income/expenditure statements, and oversee tendering, contract approvals, and vendor payments.\n- Supervise salary disbursement, employee benefits, and tax compliance.\n- Advise on financial viability of projects, grants, and endowments.</p>\n<p><strong>Qualifications &amp; Experience:</strong>\n- <strong>Education:</strong> Master’s in Commerce/Finance Management or professional qualifications (CA, ICWA, MBA-Finance) from a recognized institution.\n- <strong>Experience:</strong> 5–15 years in finance/accounts (government/autonomous institutions/reputed organizations); 2–5 years in senior supervisory roles (e.g., Assistant/Deputy Manager, Chief Accounts Officer).\n- <strong>Preferred Skills:</strong> Strong knowledge of government accounting rules, auditing standards, taxation, procurement, and fund management in higher education/research institutions.</p>\n<p><strong>Application Details:</strong>\n- <strong>Interview Date:</strong> 10.02.2026 at 09:00 AM\n- <strong>Application Deadline:</strong> 12:00 PM on 09.02.2026\n- <strong>Submission:</strong> Online application via the institute’s portal.</p>",
        "tags": [
            "5-15 Years",
            "Government Accounting",
            "Financial Regulations",
            "Project Management"
        ],
        "summary": "Lead financial operations for IIITM-K’s CoE on IIoT Sensors, ensuring compliance and strategic financial management for externally funded projects."
    },
    {
        "job_title": "Chief Executive Officer (CEO) CoE on IIoT Sensors (Job Code -IIITMK/HR/IIoT/CEO/012026)",
        "company": "Indian Institute Of Information Technology And Management - Kerala (Iiitm-K)",
        "url": "https://technopark.org/job-details/27282",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Indian Institute of Information Technology and Management - Kerala (IIITM-K)</h2>\n<p><strong>Address:</strong> IIITM-K Campus, Technopark, Karyavattom PO, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.iiitmk.ac.in\">www.iiitmk.ac.in</a>\n<strong>Job Title:</strong> Chief Executive Officer (CEO) - CoE on IIoT Sensors (Job Code - IIITMK/HR/IIoT/CEO/012026)\n<strong>Closing Date:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> careers@iiitmk.ac.in</p>\n<h3>Brief Description</h3>\n<p>The Indian Institute of Information Technology and Management – Kerala (IIITMK), an autonomous institution under the Government of Kerala, seeks a dynamic leader to head its Centre of Excellence (CoE) on IIoT Sensors. The role involves driving innovation in incubation programs, fostering strategic partnerships, and supporting startups in the semiconductor and electronics industry.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Strategic Leadership:</strong> Develop and implement the strategic roadmap for the incubation center, aligning with Governing Board directives and ensuring deliverables, timelines, and financial benchmarks.</li>\n<li><strong>Operational Excellence:</strong> Oversee daily operations, budget management, and establish efficient processes for startup success.</li>\n<li><strong>Ecosystem Development:</strong> Build collaborations with academia, industry, and funding organizations to create a robust startup ecosystem.</li>\n<li><strong>Startup Support:</strong> Guide early-stage startups toward scalability, providing access to prototyping, test beds, markets, and pilot opportunities.</li>\n<li><strong>Sustainability &amp; Innovation:</strong> Drive cutting-edge resource development for semiconductor electronics startups and promote global innovation.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Essential:</strong> 4-year Undergraduate Degree or Master's Degree.</li>\n<li><strong>Desirable:</strong> MBA/MSc in operations/systems, or MTech/PhD.</li>\n<li><strong>Experience:</strong> Minimum 5 years in industry, government, or startup leadership roles. Research experience during MTech/MBA/PhD may count toward this requirement.</li>\n</ul>\n<h3>Application Details</h3>\n<ul>\n<li><strong>Interview Date:</strong> 10.02.2026 from 09:00 AM</li>\n<li><strong>Application Deadline:</strong> 12:00 PM on 09.02.2026</li>\n<li><strong>Submission Method:</strong> Online application via the institute's portal.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "IIoT Sensors",
            "Startup Ecosystem Development",
            "Semiconductor Electronics"
        ],
        "summary": "Lead IIITMK's CoE on IIoT Sensors, driving incubation programs and fostering innovation in semiconductor electronics startups."
    },
    {
        "job_title": "Software Engineer - .NET",
        "company": "Muthoot Mercantile Ltd-It Wing",
        "url": "https://technopark.org/job-details/27281",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Muthoot Mercantile Limited is a leading Non-Banking Financial Company (NBFC) headquartered in Thiruvananthapuram, Kerala. Registered with the RBI, the company specializes in the gold loan sector and emphasizes trust, transparency, and customer relationships. With a wide branch network across multiple Indian states, Muthoot Mercantile handles customer gold assets with care and expertise.</p>\n<h2>Position Overview</h2>\n<p>We are seeking a proactive and results-driven <strong>Software Engineer - .NET</strong> to join our IT Wing. The ideal candidate will have hands-on experience in <strong>.NET Core</strong>, <strong>MVC</strong>, <strong>WPF</strong>, <strong>WCF</strong>, <strong>Angular/React</strong>, <strong>SQL</strong>, and <strong>Azure</strong>, and will provide technical leadership to a team of developers.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Mentor junior team members and conduct code reviews.</li>\n<li>Develop high-quality software solutions using <strong>.NET Core</strong>, <strong>Angular/React</strong>, <strong>MS SQL</strong>, and <strong>Azure</strong>.</li>\n<li>Collaborate with cross-functional teams to translate project requirements into technical specifications.</li>\n<li>Troubleshoot complex technical issues and stay updated on the latest .NET technologies.</li>\n<li>Participate in scrum meetings, analyze requirements, and communicate directly with clients.</li>\n<li>Assign tasks to junior developers and guide their growth.</li>\n<li>Manage project timelines, prioritize tasks, and ensure deadlines are met.</li>\n<li>Convert legacy projects to <strong>.NET</strong> when required.</li>\n<li>Learn new technologies and adapt to evolving business needs.</li>\n<li>Code, debug, test, and document features while ensuring thorough testing.</li>\n</ul>\n<h2>Preferred Skills &amp; Qualifications</h2>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field.</li>\n<li><strong>3+ years</strong> of experience in <strong>.NET</strong> technologies.</li>\n<li>Proficiency in <strong>.NET Core</strong>, <strong>C#</strong>, <strong>MVC</strong>, <strong>WPF</strong>, <strong>WCF</strong>, <strong>Web API</strong>.</li>\n<li>Strong frontend skills in <strong>Angular/React</strong>, <strong>TypeScript</strong>, <strong>HTML/CSS/JavaScript</strong>.</li>\n<li>Experience with <strong>Azure</strong> services (e.g., App Service, Functions) and <strong>Azure DevOps</strong>.</li>\n<li>Excellent problem-solving and communication skills.</li>\n<li>Familiarity with <strong>Git</strong> and <strong>Agile</strong> methodologies.</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Competitive salary and performance-based incentives.</li>\n<li>Opportunities for career growth and exposure to cutting-edge technologies.</li>\n<li>PF/ESI/Medical Insurance benefits.</li>\n<li>A collaborative and innovative work environment.</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Send your resume to <strong>hr@muthootenterprises.com</strong> with the subject line <strong>\"Application for Software Engineer - .NET\"</strong>. Include details about your notice period, current CTC, and expected CTC. Visit <a href=\"http://www.muthootenterprises.com\">www.muthootenterprises.com</a> for more information.</p>\n<p><strong>Application Deadline</strong>: 08, Feb 2026\n<strong>Job Published</strong>: 02, Feb 2026</p>",
        "tags": [
            "3+ Years",
            ".NET Core",
            "Angular/React",
            "Azure"
        ],
        "summary": "Muthoot Mercantile seeks a .NET Software Engineer to lead development, mentor teams, and drive technical innovation in a leading NBFC."
    },
    {
        "job_title": "System Administrator",
        "company": "Xminds Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/27280",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Name:</strong> Xminds Infotech (P) Ltd\n<strong>Address:</strong> T4 &amp; T8, 7th, Thejaswini, Technopark Rd, Technopark Campus, Phase I, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.xminds.com\">http://www.xminds.com</a>\n<strong>Contact Email:</strong> <a href=\"mailto:careers@xminds.com\">careers@xminds.com</a></p>\n<h2>Job Details</h2>\n<p><strong>Role:</strong> System Administrator\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026</p>\n<h2>Brief Description</h2>\n<p>The System Administrator is responsible for managing, maintaining, and supporting the organization’s IT infrastructure. The role ensures the availability, security, and optimal performance of Windows and Linux systems, network infrastructure, and associated services, while adhering to organizational policies and industry best practices.</p>\n<h2>Key Responsibilities</h2>\n<h3>System Administration (Linux &amp; Windows)</h3>\n<ul>\n<li>Install, configure, administer, and maintain Windows and Linux server environments.</li>\n<li>Manage user accounts, access controls, permissions, and security configurations.</li>\n<li>Monitor system health, performance, and capacity to ensure high availability and reliability.</li>\n<li>Perform regular system updates, patches, and backups to maintain system integrity.</li>\n<li>Diagnose and resolve hardware, software, and operating system issues, with primary focus on Linux-based systems.</li>\n<li>Ensure compliance with internal IT policies and security standards.</li>\n</ul>\n<h3>Network Administration</h3>\n<ul>\n<li>Configure, manage, and maintain network infrastructure, including routers, switches, firewalls, and wireless devices.</li>\n<li>Monitor network performance, uptime, and security across all environments.</li>\n<li>Implement and manage network security controls, including firewalls, VPNs, and access restrictions.</li>\n<li>Conduct routine network audits and health checks, recommending improvements where required.</li>\n<li>Configure and manage DNS, DHCP, and other essential network services.</li>\n<li>Ensure stable, secure, and efficient connectivity across LAN, WAN, and wireless networks.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Minimum 2+ years of relevant experience in system and network administration.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Linux Administration",
            "Windows Server",
            "Network Security"
        ],
        "summary": "Manages Windows/Linux systems and network infrastructure, ensuring security, performance, and compliance with IT policies."
    },
    {
        "job_title": "Digital Marketing Expert ( 4+ years of experience )",
        "company": "Marvelloux Apps (P) Ltd",
        "url": "https://technopark.org/job-details/27279",
        "location": "Technopark",
        "closing_date": "15 Feb 2026",
        "job_description": "<h2>Marvelloux Apps (P) Ltd</h2>\n<p><strong>Location:</strong> Ground Floor, Gayatri Building, Technopark Phase I, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.marvelloux.com\">http://www.marvelloux.com</a>\n<strong>Contact Email:</strong> hr@marvelloux.com</p>\n<h3>Job Title: Digital Marketing Expert</h3>\n<p><strong>Experience Required:</strong> 4-6 years\n<strong>Closing Date:</strong> 15, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Manage SEO/SEM, email marketing, social media, and display advertising campaigns.</li>\n<li>Utilize web analytics tools (e.g., Google Analytics, SEMrush) for performance tracking.</li>\n<li>Develop and execute digital marketing strategies aligned with B2B/B2C SaaS/IT service-based industry needs.</li>\n<li>Collaborate with cross-functional teams to achieve business objectives.</li>\n<li>Analyze campaign data to optimize marketing efforts and improve ROI.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li><strong>4-6 years of experience</strong> as a Digital Marketing Expert or similar role.</li>\n<li>Proven expertise in digital marketing concepts and best practices.</li>\n<li><strong>Experience in B2B/B2C SaaS/IT service-based industry</strong> is mandatory.</li>\n<li>Proficiency in SEO/SEM, email marketing, social media, and display advertising.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Excellent communication and interpersonal abilities.</li>\n<li>Ability to work independently and in a team environment.</li>\n<li>Bachelor’s degree in Marketing, Business, or a related field.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Certifications in Google Analytics, Google Ads, HubSpot, or similar platforms.</li>\n<li>Experience with marketing automation tools and CRM systems.</li>\n<li>Knowledge of HTML/CSS and content management systems (e.g., WordPress).</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>Competitive salary and benefits package.</li>\n<li>Opportunity to work with a dynamic and innovative team.</li>\n<li>Career growth and development opportunities.</li>\n<li>Flexible working environment.</li>\n</ul>",
        "tags": [
            "4-6 Years",
            "SEO/SEM",
            "Google Analytics",
            "B2B/B2C SaaS"
        ],
        "summary": "Digital Marketing Expert with 4-6 years of experience in B2B/B2C SaaS/IT industry. Requires SEO/SEM, analytics, and campaign management skills. Offers competitive salary and growth opportunities."
    },
    {
        "job_title": "UI/UX Designer ( 3+ Years of Experience)",
        "company": "Marvelloux Apps (P) Ltd",
        "url": "https://technopark.org/job-details/27278",
        "location": "Technopark",
        "closing_date": "15 Feb 2026",
        "job_description": "<h2>Marvelloux Design Studio</h2>\n<p><strong>Location:</strong> Technopark, TVM\n<strong>Work Mode:</strong> Office-based\n<strong>Experience Required:</strong> 3-5 Years\n<strong>Contact Email:</strong> hr@marvelloux.com\n<strong>Closing Date:</strong> 15, Feb 2026</p>\n<h3>About Us</h3>\n<p>Marvelloux Design Studio is a dynamic and innovative design studio dedicated to crafting exceptional digital experiences. We specialize in user interface (UI), user experience (UX), and customer experience (CX) design, working with diverse clients to create solutions that delight users and drive business success.</p>\n<h3>Job Description</h3>\n<p>As a UI/UX/CX Designer at Marvelloux, you will:\n- Create visually appealing and user-centric designs for websites, web applications, and digital products\n- Conduct user research and translate insights into design decisions\n- Develop interactive prototypes and wireframes\n- Define information architecture for optimal user flow\n- Design intuitive interfaces with branding consistency\n- Conduct usability testing and iterate designs\n- Create customer journey maps\n- Collaborate with cross-functional teams\n- Communicate design concepts to clients\n- Stay updated with industry trends and design tools</p>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>3-5 years of experience in UI/UX Designing</li>\n<li>Excellent communication and presentation skills</li>\n<li>Proven portfolio in UI, UX, and CX design</li>\n<li>Proficiency in Adobe Creative Suite, Sketch, Figma</li>\n<li>Knowledge of HTML, CSS, JavaScript</li>\n<li>Strong problem-solving and attention to detail</li>\n<li>Agile/iterative design experience</li>\n<li>Usability/accessibility expertise</li>\n<li>Design systems and component-based design skills</li>\n</ul>\n<p><strong>Application Deadline:</strong> 15, Feb 2026\n<strong>Submit resume and portfolio to:</strong> hr@marvelloux.com</p>",
        "tags": [
            "3-5 Years",
            "UI/UX Design",
            "Figma",
            "Agile Methodologies"
        ],
        "summary": "UI/UX Designer with 3-5 years experience creating digital experiences through collaborative design and prototyping. Requires expertise in design tools and user research."
    },
    {
        "job_title": "Mobile App Developer",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/27277",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>QWY Software (P) Ltd</strong></p>\n<p><strong>Address:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581\n<strong>Industry:</strong> IT/ITES covering E-com, Logistics and Hyperlocal Delivery Services</p>\n<h3>Mobile App Developer</h3>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> careers@qwysoft.com</p>\n<h4>Brief Description</h4>\n<p>We are seeking a <strong>Mobile App Developer</strong> with expertise in <strong>Android (Kotlin/XML &amp; Jetpack Compose)</strong>, <strong>iOS (Swift)</strong>, and/or <strong>Flutter</strong> to build and maintain high-quality mobile applications with <strong>REST APIs</strong>, <strong>Firebase</strong>, and <strong>maps &amp; location features</strong>.</p>\n<h4>Responsibilities</h4>\n<ul>\n<li>Develop and maintain Android, iOS, and Flutter mobile apps</li>\n<li>Integrate REST APIs and Firebase (Analytics, FCM, Crashlytics)</li>\n<li>Implement maps and location tracking features</li>\n<li>Handle app lifecycle, permissions, and background tasks</li>\n<li>Optimize performance, stability, and code quality</li>\n<li>Collaborate with design and backend teams</li>\n</ul>\n<h4>Preferred Skills</h4>\n<p><strong>Experience:</strong> 2-4 Years</p>\n<p><strong>Android:</strong>\n- Kotlin, XML, Jetpack Compose\n- Activity &amp; Fragment lifecycle\n- Services &amp; Broadcast Receivers\n- Google Maps integration\n- Google Play Store distribution (AAB, signing, testing tracks)</p>\n<p><strong>iOS:</strong>\n- Swift\n- CocoaPods &amp; Swift Package Manager\n- App lifecycle &amp; background tasks\n- App Store submission, certificates, TestFlight</p>\n<p><strong>Flutter:</strong>\n- Flutter (Dart)\n- State management: Provider, BLoC</p>\n<p><strong>General:</strong>\n- REST API integration\n- Firebase Analytics\n- Git version control</p>\n<h4>Application Instructions</h4>\n<p>Interested candidates should email their CV to <strong>careers@qwysoft.com</strong> with the subject line <strong>\"Mobile App Developer\"</strong>.</p>",
        "tags": [
            "2-4 Years",
            "Android (Kotlin/XML, Jetpack Compose)",
            "iOS (Swift)",
            "Flutter (Dart)"
        ],
        "summary": "Mobile App Developer with 2-4 years of experience in Android, iOS, and Flutter, focusing on REST APIs, Firebase, and location features."
    },
    {
        "job_title": "Junior Customer Success Executive / Business Development Executive",
        "company": "Sequoiaat India (P) Ltd",
        "url": "https://technopark.org/job-details/27276",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>SequoiaAT India (P) Ltd</h2>\n<p><strong>Module No.1A, Ground Floor, PERIYAR Building, Phase-I Campus, Technopark, 695581</strong>\n<a href=\"http://www.sequoiaat.com\">http://www.sequoiaat.com</a></p>\n<p><strong>Job Title:</strong> Junior Customer Success Executive / Business Development Executive\n<strong>Closing Date:</strong> 28 Feb 2026\n<strong>Job Published:</strong> 02 Feb 2026\n<strong>Contact Email:</strong> recruitment@sequoiaat.com</p>\n<h3>Role Overview</h3>\n<p>We are seeking a junior-level professional to handle <strong>product demos</strong>, <strong>customer onboarding</strong>, <strong>basic issue resolution</strong>, and <strong>paid feature adoption</strong> for the Offrd platform. This customer-facing role requires excellent communication skills and basic technical understanding. <strong>Immediate joiners (within 30 days)</strong> are preferred.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Product Demos &amp; Onboarding</strong>\n- Conduct live product demos via Zoom/Teams\n- Onboard new customers and guide them through key features\n- Explain product value and real-life use cases</p>\n<p><strong>Customer Support &amp; Issue Handling</strong>\n- Serve as the first point of contact for customer-reported issues\n- Troubleshoot minor functional/configuration issues\n- Coordinate with engineering/product teams for complex issues\n- Ensure timely follow-ups and customer satisfaction</p>\n<p><strong>Paid Feature Adoption &amp; Upsell</strong>\n- Educate customers on premium/paid features\n- Persuade upgrades by highlighting benefits/ROI\n- Support trial-to-paid conversions</p>\n<p><strong>Customer Communication</strong>\n- Maintain professional, empathetic communication\n- Handle objections, questions, and feedback\n- Document customer interactions and issues</p>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>1–2 years</strong> of experience in SaaS product demos, customer success, support, or pre-sales</li>\n<li>Excellent spoken/written <strong>English</strong></li>\n<li>Ability to speak <strong>Hindi</strong> (preferred)</li>\n<li>Basic understanding of <strong>web/mobile applications</strong> and <strong>SaaS workflows</strong></li>\n<li>Proficiency with <strong>Zoom/Teams/Google Meet</strong> and <strong>ticketing/CRM tools</strong> (basic level)</li>\n<li>Strong problem-solving and analytical skills</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "SaaS",
            "Zoom/Teams",
            "CRM Tools"
        ],
        "summary": "Junior role for customer onboarding, demos, and paid feature adoption. Requires 1-2 years in SaaS, English proficiency, and basic tech skills."
    },
    {
        "job_title": "Senior Back End Engineers  - Node.js",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27275",
        "location": "Technopark",
        "closing_date": "07 Feb 2026",
        "job_description": "<p><strong>Company:</strong> iBoson Innovations (P) Ltd\n<strong>Location:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.iboson.io\">www.iboson.io</a>\n<strong>Job Title:</strong> Senior Back End Engineer - Node.js\n<strong>Closing Date:</strong> 07, Feb 2026\n<strong>Published Date:</strong> 02, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:career@ibosoninnov.com\">career@ibosoninnov.com</a></p>\n<p><strong>Brief Description</strong>:\nAt iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to build next-gen solutions. We are expanding our team and seeking a skilled Node.js Developer to develop robust, scalable, and high-performance backend systems for our products.</p>\n<p><strong>Responsibilities</strong>:\n- Design, develop, and maintain scalable server-side applications using Node.js.\n- Develop and integrate RESTful APIs and third-party services.\n- Optimize back-end processes for performance, security, and scalability.\n- Collaborate with front-end developers to integrate user-facing elements.\n- Manage and implement database solutions (SQL/NoSQL).\n- Debug, troubleshoot, and resolve back-end issues efficiently.\n- Follow best practices in code quality, testing, and documentation.</p>\n<p><strong>Preferred Skills/Requirements</strong>:\n- <strong>5+ years</strong> of experience in back-end development with Node.js.\n- Strong understanding of JavaScript, TypeScript, and asynchronous programming.\n- Experience building and managing RESTful APIs and microservices architecture.\n- Proficiency in databases (MongoDB, MySQL, or PostgreSQL).\n- Knowledge of authentication/authorization mechanisms (JWT, OAuth).\n- Strong grasp of OOP concepts.\n- Experience with server-side frameworks like Express.js, Nest.js, or similar.\n- Familiarity with cloud platforms (AWS, Google Cloud, or Azure).\n- Understanding of Agile methodologies and CI/CD pipelines.\n- Exposure to AI integrations and AR technology is a plus.</p>\n<p><strong>What We Offer</strong>:\n- Work-life balance with flexible timings.\n- Opportunities to work on challenging, high-impact projects.\n- Learning and career growth opportunities.\n- Collaborative, engineering-driven culture.</p>\n<p><strong>Join us</strong> to innovate with AR &amp; AI technologies and contribute to impactful projects. Apply at <a href=\"mailto:career@ibosoninnov.com\">career@ibosoninnov.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "JavaScript/TypeScript",
            "RESTful APIs"
        ],
        "summary": "Senior Back End Engineer with Node.js expertise to build scalable systems for AR/AI solutions. Requires 5+ years experience and proficiency in RESTful APIs, databases, and cloud platforms."
    },
    {
        "job_title": "Creative & Expert Web Developer (UI/UX + WordPress + Shopify)",
        "company": "Medowa Global (P) Ltd",
        "url": "https://technopark.org/job-details/27274",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Job Posting: Creative &amp; Expert Web Developer (UI/UX + WordPress + Shopify)</h2>\n<p><strong>Company</strong>: Medowa Global (P) Ltd\n<strong>Location</strong>: 2 Floor, SBC 7, Thejaswini Building, Phase I, Technopark Trivandrum, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.medowaglobal.com\">www.medowaglobal.com</a>\n<strong>Closing Date</strong>: 28, Feb 2026\n<strong>Published On</strong>: 01, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:hr@medowaglobal.com\">hr@medowaglobal.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a creative, expert, and dedicated web professional capable of managing complete website projects from Figma prototypes to live websites. The ideal candidate will adapt to new AI tools and techniques while delivering high-quality results.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design modern UI/UX in Figma and create interactive prototypes</li>\n<li>Apply strong design principles (color themes, typography, spacing, visual hierarchy)</li>\n<li>Convert Figma designs into responsive, user-friendly websites</li>\n<li>Develop and customize websites using WordPress &amp; Shopify</li>\n<li>Work with all major CMS platforms and adapt to new CMS when required</li>\n<li>Explore and use new AI tools/techniques to improve productivity and quality</li>\n<li>Ensure website performance, responsiveness, and cross-device compatibility</li>\n<li>Handle real client projects and deliver on time with commitment</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Minimum 2 years of professional experience</li>\n<li>Strong portfolio with Figma prototypes + live websites</li>\n<li>Excellent understanding of UI/UX principles</li>\n<li>Hands-on experience with WordPress, Shopify &amp; other CMS</li>\n<li>Creative mindset with strong knowledge of color theory &amp; typography</li>\n<li>Dedicated, hardworking, and self-driven learner who adapts to new AI tools</li>\n<li>Ability to work independently and take ownership of projects</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>HTML, CSS, JavaScript</li>\n<li>WordPress Theme &amp; Plugin Customization</li>\n<li>Shopify Theme Editing &amp; App Integration</li>\n<li>Checkout Optimization (Shopify)</li>\n<li>UX Research, Wireframing &amp; User Flows</li>\n<li>SEO Basics &amp; Website Performance Optimization</li>\n<li>Responsive Frameworks (Bootstrap, Tailwind)</li>\n<li>Page Builders (Elementor, Gutenberg)</li>\n<li>Image Optimization &amp; Core Web Vitals</li>\n<li>Website Speed Optimization</li>\n<li>Communication Skills</li>\n<li>Time Management</li>\n</ul>\n<p><strong>Application Instructions</strong>: Send your CV + portfolio (Figma + live links) to <a href=\"mailto:hr@medowaglobal.com\">hr@medowaglobal.com</a>. Applications are accepted via email only. Do not contact via phone/WhatsApp.</p>\n<p><strong>Note</strong>: Freshers or basic learners should not apply.</p>",
        "tags": [
            "2+ Years",
            "Figma",
            "WordPress",
            "Shopify"
        ],
        "summary": "Creative web developer with 2+ years of experience in UI/UX design, WordPress, and Shopify. Requires strong Figma skills and AI tool adaptation. Apply via email to Technopark, Trivandrum."
    }
]