[
    {
        "job_title": "Sr.DevSecOps",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21264/312",
        "location": "Infopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Senior DevSecOps Engineer</h2>\n<p>We are looking for a Senior DevSecOps Engineer who will lead our cybersecurity, infrastructure automation, and DevSecOps practices as we transition into a secure, scalable, and modern engineering environment. This role is responsible for strengthening 2Base’s security posture, modernizing our pipelines, and guiding the team towards a secure-by-design culture. You will work closely with engineering, product, and leadership teams to ensure that our systems, applications, and cloud environments are secure, reliable, and future-ready.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define, implement, and enforce security standards, policies, and best practices across cloud and on-prem environments.</li>\n<li>Conduct security risk assessments, perform vulnerability scans, coordinate penetration testing activities, and execute mitigation plans.</li>\n<li>Architect, maintain, and enhance secure CI/CD pipelines with automated compliance and governance checkpoints.</li>\n<li>Promote and uphold a strong “Security First” culture across engineering, ensuring secure design and development practices.</li>\n<li>Continuously monitor, detect, investigate, and respond to security threats, incidents, breaches, and anomalies.</li>\n<li>Develop, own, and mature Infrastructure-as-Code practices using Terraform, Ansible, and other automation frameworks.</li>\n<li>Design and lead secure cloud architectures across AWS, Azure, or GCP to support scalable and compliant deployments.</li>\n<li>Build, operate, and secure containerized environments using Docker and Kubernetes with enforced security baselines.</li>\n<li>Implement and maintain secure monitoring, logging, SIEM, and alerting systems for infrastructure and application layers.</li>\n<li>Improve and optimize system reliability, scalability, performance, and fault tolerance across all critical workloads.</li>\n<li>Mentor, guide, and upskill DevOps engineers in secure development, automation, and operational excellence.</li>\n<li>Lead technical strategy, decision-making, tool selection, process improvements, and DevSecOps roadmap execution.</li>\n<li>Collaborate closely with BA, PM, and Engineering teams to ensure security, performance, and delivery objectives align with organisational goals.</li>\n</ul>\n<h3>Requirements</h3>\n<h4>Required Skills &amp; Experience</h4>\n<ul>\n<li>4–8 years of experience in DevOps, Cloud, or Infrastructure engineering with strong security exposure.</li>\n<li>Hands-on experience with CI/CD tools such as Jenkins, GitLab CI, or GitHub Actions.</li>\n<li>Strong expertise in AWS, Azure, or GCP cloud platforms with a focus on secure architecture.</li>\n<li>Proficiency in Infrastructure-as-Code using Terraform, Ansible, or similar tools.</li>\n<li>Experience securing and managing Docker and Kubernetes environments.</li>\n<li>Strong understanding of networking technologies: LAN/WAN, firewalls, VPN, load balancers.</li>\n<li>Knowledge of security frameworks and standards (OWASP, NIST, CIS Benchmarks).</li>\n<li>Experience with monitoring and logging tools (Prometheus, Grafana, ELK, CloudWatch, SIEM solutions).</li>\n<li>Strong scripting skills (Python, Bash, Shell).</li>\n<li>Excellent troubleshooting, analytical, and problem-solving skills.</li>\n<li>Strong communication and collaboration skills with the ability to influence engineering teams.</li>\n</ul>\n<h4>Preferred Qualifications (Good to Have)</h4>\n<ul>\n<li>Diploma / Degree / B.Tech in IT, CS, MCA</li>\n<li>Experience in SOC operations or exposure to SIEM and SOAR tools.</li>\n<li>Relevant certifications such as:<ul>\n<li>AWS Security / DevOps Engineer – Professional</li>\n<li>Certified Kubernetes Security Specialist (CKS)</li>\n<li>CEH, CompTIA Security+, or equivalent.</li>\n</ul>\n</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@2basetechnologies.com</p>",
        "tags": [
            "4-8 Years",
            "DevSecOps",
            "AWS",
            "Terraform"
        ],
        "summary": "Seeking a Senior DevSecOps Engineer to lead cybersecurity and automation. Responsibilities include enhancing security posture, modernizing pipelines, and fostering a secure-by-design culture."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21265/312",
        "location": "Infopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Senior Business Analyst</h2>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.</li>\n<li>Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.</li>\n<li>Convert ambiguous client inputs into structured, logical, and actionable functional understanding.</li>\n<li>Break large features into modules, workflows, components, and clear dependencies.</li>\n<li>Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.</li>\n<li>Translate business processes into functional logic that development teams can execute.</li>\n<li>Decompose requirements into use-case flows, system behaviours, edge cases, alternate paths, validation rules, and dependencies.</li>\n<li>Prepare high-quality documentation, including BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API requirement specs, and acceptance criteria.</li>\n<li>Ensure all documentation is clear, logical, structured, testable, and ready for developers and QA to use.</li>\n<li>Collaborate closely with developers, architects, QA, and product owners to validate feasibility and align understanding.</li>\n<li>Ensure QA teams can derive test cases effectively from your functional logic and acceptance criteria.</li>\n<li>Communicate confidently with clients, handle requirement discussions smoothly, and clarify misunderstandings immediately.</li>\n<li>Push back politely on unclear or changing requirements and ensure final decisions are documented properly.</li>\n<li>Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover to development.</li>\n<li>Own the entire requirement lifecycle from discovery to development readiness with high accountability.</li>\n<li>Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>Required Skills &amp; Experience</strong></p>\n<ul>\n<li>Minimum 4+ years of core Business Analyst experience with strong analytical and system-level thinking.</li>\n<li>Ability to break down complex requirements into clear components, workflows, and functional logic.</li>\n<li>Excellent verbal and written communication with confidence in client interactions and clarifications.</li>\n<li>Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria with high clarity.</li>\n<li>Ability to challenge assumptions politely, ask the right questions, and ensure zero ambiguity.</li>\n<li>Strong collaboration experience with development, QA, architects, and cross-functional teams.</li>\n<li>Understanding of API behaviours, integrations, data flows, and multi-module system interactions.</li>\n<li>Ability to run requirement discussions, workshops, and independently lead discovery sessions.</li>\n<li>Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.</li>\n<li>Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.</li>\n<li>Not suitable for UI-only thinkers, passive communicators, template-based writers, or those relying on AI for answers.</li>\n<li>Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.</li>\n<li>Candidates must align with 2Base’s structured thinking, clarity-driven culture, and transformation of the BA function.</li>\n</ul>\n<p><strong>Minimum Qualifications</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, Business, or related field</li>\n<li>4 to 8 years of experience as a Business Analyst or Product Analyst</li>\n<li>Experience in SaaS or scalable product environments</li>\n<li>Exposure to AI/Automation, integrations, or multi-module systems</li>\n<li>Ability to run independent client workshops</li>\n<li>Must have independently handled requirement ownership for at least one full project lifecycle</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@2basetechnologies.com</p>",
        "tags": [
            "4+ Years",
            "Business Analysis",
            "SaaS",
            "API"
        ],
        "summary": "Seeking a Senior Business Analyst with 4+ years experience in requirement analysis and system understanding. Must excel in client communication and documentation for SaaS products."
    },
    {
        "job_title": "Graphic Designer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21266/312",
        "location": "Infopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Graphic Designer</h2>\n<p>We are looking for a highly creative, self-driven Graphic Designer who can take full ownership of ideation and visual execution. The ideal candidate is someone who not only designs but also thinks creatively, proposes fresh ideas, and transforms concepts into compelling visual experiences, without requiring constant direction.</p>\n<p>You will collaborate closely with our Marketing, Creative, and Development teams to build strong brand experiences across digital and print media. A willingness to experiment, learn new tools, and adopt AI-enhanced creative workflows is expected.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Conceptualize and produce visually compelling assets, including marketing materials, presentation decks, brand collateral, web and digital banners, posters, advertisements, and social media content.</li>\n<li>Independently generate creative ideas, visual concepts, and mood boards aligned with campaign messaging and business goals.</li>\n<li>Utilize traditional design tools (Adobe Creative Suite) alongside modern AI-powered platforms (e.g., Adobe Firefly, Midjourney, Freepik AI, DALL-E, Shutterstock AI) to enhance speed, creativity, and productivity.</li>\n<li>Adapt and refine AI-generated assets to maintain originality, brand consistency, legal compliance, and creative integrity.</li>\n<li>Ensure all visual outputs adhere to brand guidelines, layout principles, typography standards, and quality expectations.</li>\n<li>Manage multiple projects simultaneously while prioritizing deadlines and maintaining accuracy, consistency, and quality.</li>\n<li>Incorporate feedback with a positive, ownership-driven attitude and continuously improve designs based on performance insights.</li>\n<li>Collaborate with cross-functional teams (Marketing, Product, Development) to deliver visuals aligned with messaging, UX, and campaign strategies.</li>\n<li>Stay updated with industry design standards, AI design trends, digital storytelling approaches, and new creative tools.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor’s degree in Graphic Design, Visual Arts, Visual Communication, or related field.</li>\n<li>Proven experience in graphic design with a strong portfolio demonstrating originality, creativity, and design proficiency (mandatory).</li>\n<li>Expert-level proficiency in Adobe Photoshop, Illustrator, and InDesign, and working familiarity with tools like Premiere Pro, After Effects, or Figma.</li>\n<li>Experience or openness to working with AI-assisted design tools (Adobe Firefly, Midjourney, Canva AI, Freepik AI, Stable Diffusion, etc.).</li>\n<li>Familiarity with design automation workflows such as smart resizing, templates, asset reuse, and variable content design.</li>\n<li>Understanding of HTML &amp; CSS is an advantage.</li>\n<li>Strong sense of color theory, composition, visual hierarchy, and typography.</li>\n<li>Ability to communicate design rationale clearly and confidently present creative decisions.</li>\n<li>A proactive mindset with the ability to work independently, take initiative, and deliver results with minimal supervision.</li>\n</ul>\n<h3>He/She must be:</h3>\n<ol>\n<li>Creative thinker, not just an executor</li>\n<li>Ownership-driven, proactive, and self-motivated</li>\n<li>Curious about trends, AI advancements, and new design possibilities</li>\n<li>Understands design as a balance between aesthetics, message, and business impact.</li>\n</ol>\n<h3>Experience:</h3>\n<ul>\n<li>1-2 years of experience</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@2basetechnologies.com</p>",
        "tags": [
            "1-2 Years",
            "Graphic Design",
            "Adobe Creative Suite",
            "AI Design Tools"
        ],
        "summary": "Seeking a creative Graphic Designer for ideation and visual execution. Responsibilities include creating digital and print assets using AI tools, collaborating with teams, and maintaining brand consistency."
    },
    {
        "job_title": "Content Writer Intern",
        "company": "KL Koncepts Lab Media and IT Park",
        "url": "https://infopark.in/company-jobs/details/21267/332",
        "location": "Infopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Content Writer Intern</h2>\n<p><strong>Position:</strong> Content Writer Intern\n<strong>Location:</strong> Koratty Infopark, Thrissur\n<strong>Duration:</strong> 3-6 Months</p>\n<h3>Internship Overview</h3>\n<p>Konceptslab Media &amp; IT Park Pvt. Ltd. is looking for a creative and detail-oriented Content Writer Intern to join our marketing and communications team. This internship offers an excellent opportunity to develop professional writing skills, gain hands-on experience in content strategy, and work across multiple digital platforms. Ideal for students or fresh graduates with a passion for storytelling and digital communication.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Write and edit engaging content for blogs, websites, social media, newsletters, and marketing campaigns.</li>\n<li>Collaborate with the design and digital marketing teams to create cohesive and impactful communication materials.</li>\n<li>Conduct research on industry-related topics and develop original content ideas.</li>\n<li>Assist in developing SEO-friendly content aligned with brand tone and audience interests.</li>\n<li>Proofread and ensure grammatical accuracy, clarity, and consistency across all content formats.</li>\n<li>Contribute creative ideas for social media campaigns, brand storytelling, and marketing initiatives.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Pursuing or recently completed a degree in English, Journalism, Mass Communication, Marketing, or a related field.</li>\n<li>Strong writing, editing, and proofreading skills with attention to detail.</li>\n<li>Basic understanding of SEO, keyword usage, and digital content best practices.</li>\n<li>Creative mindset with the ability to adapt writing style to different platforms and audiences.</li>\n<li>Good communication and time management skills.</li>\n</ul>\n<h3>What You’ll Gain at Konceptslab</h3>\n<ul>\n<li>Hands-on experience in content creation and digital brand communication.</li>\n<li>Exposure to real-time marketing campaigns and cross-functional collaboration.</li>\n<li>Guidance and mentorship from experienced content and marketing professionals.</li>\n<li>Internship certificate and performance-based recommendation letter.</li>\n<li>Potential opportunity for full-time employment upon successful completion of the internship.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@konceptslab.com</p>",
        "tags": [
            "0-1 Years",
            "Content Writing",
            "SEO",
            "Digital Marketing"
        ],
        "summary": "Seeking a Content Writer Intern for a 3-6 month internship. Responsibilities include writing, editing, and researching content for various digital platforms."
    },
    {
        "job_title": "NextJs Developer (7 Months - 1+ Years)",
        "company": "Woxro",
        "url": "https://infopark.in/company-jobs/details/21268/399",
        "location": "Infopark",
        "closing_date": "10 Dec 2025",
        "job_description": "<h2>NextJs Developer (7 Months - 1+ Years)</h2>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Freshers with any 7 months internship experience can apply.</li>\n<li>Strong proficiency in JavaScript, including ES6+ features such as async/await, destructuring, and arrow functions.</li>\n<li>Extensive experience with Next.js and React, including a deep understanding of routing, rendering methods, and state management.</li>\n<li>Proficiency in GSAP and Framer Motion for animating UI components, enhancing interactivity, and optimizing performance.</li>\n<li>Experience with Three.js for integrating 3D content and interactive graphics into websites.</li>\n<li>Familiarity with CSS preprocessors like SCSS or LESS for writing maintainable and scalable stylesheets.</li>\n<li>Hands-on experience with Git for version control, ensuring efficient collaboration within the development team.</li>\n<li>Understanding of RESTful APIs and experience integrating them into frontend applications to communicate with backend services.</li>\n<li>Knowledge of web performance optimization techniques, including lazy loading, code splitting, and caching, to ensure fast and efficient web performance.</li>\n<li>Strong problem-solving skills, attention to detail, and a passion for creating high quality, maintainable code.</li>\n<li>Knowledge of deployment would be great.</li>\n<li>Deploy apps to AWS or cloud environments.</li>\n</ul>\n<h3>Performance &amp; Optimization:</h3>\n<ul>\n<li>Optimize application performance, SEO, and page load time (Lighthouse, Core Web Vitals).</li>\n<li>Manage images and assets with Next/Image, and lazy loading strategies.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@woxro.com</p>",
        "tags": [
            "7 Months - 1+ Years",
            "Next.js",
            "React",
            "JavaScript"
        ],
        "summary": "Seeking a NextJs Developer with 7 months to 1+ years of experience. Responsibilities include optimizing performance and integrating features using Next.js, React, and JavaScript."
    },
    {
        "job_title": "Digital Marketing Executive (6 Months to 1 YEAR)",
        "company": "GALTech Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21263/189",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Digital Marketing Executive (6 Months to 1 YEAR)</h2>\n<p>We are seeking a skilled and driven Digital Marketing Executive to join our team and elevate our digital marketing initiatives.</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Analyze website performance using SEO tools to ensure optimal functionality.</li>\n<li>Conduct thorough keyword research, implement on-page and off-page optimization, and perform detailed backlink analysis.</li>\n<li>Develop and execute social media strategies to enhance brand awareness and engagement.</li>\n<li>Keep up-to-date with social media trends and industry best practices.</li>\n<li>Plan and implement PPC campaigns to increase traffic and drive conversions.</li>\n<li>Monitor and evaluate the performance of digital campaigns, adjusting strategies as needed.</li>\n<li>Create compelling content for social media campaigns and other digital marketing channels.</li>\n</ul>\n<h3>Skills and Requirements:</h3>\n<ul>\n<li>Minimum of 6 months to 1 years of experience in digital marketing.</li>\n<li>Proficient in on-page and off-page optimization techniques.</li>\n<li>Experience in creating and managing social media campaigns.</li>\n<li>Ability to manage various social media channels, including Facebook, Twitter, Instagram, LinkedIn, etc.</li>\n<li>Skilled in executing campaigns using Google Ads and other PPC platforms.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@galtech.org</p>",
        "tags": [
            "6 Months to 1 YEAR",
            "SEO",
            "Social Media Marketing",
            "PPC"
        ],
        "summary": "Seeking a Digital Marketing Executive with 6 months to 1 year of experience. Responsibilities include SEO, social media, and PPC campaign management to drive brand awareness and conversions."
    },
    {
        "job_title": "Project Manager/ Product Owner",
        "company": "Cloudium Software Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21262/158",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Product Owner / Project Manager</h2>\n<p><strong>Position Overview:</strong>\nWe are seeking a highly motivated and detail-oriented Product Owner / Project Manager to join our team. This dual-role position requires a deep understanding of user needs, the ability to master various domains, and the skills to translate those needs into actionable requirements for our development team. The ideal candidate will ensure that our products meet the highest standards of quality and efficiency.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>1. Product Ownership:</strong>\n- Engage with stakeholders to understand and document business needs and user requirements.\n- Analyze and suggest improvements/enhancement for a live production application.\n- Develop and maintain a clear product vision and roadmap.\n- Create, prioritize, and manage the product backlog.\n- Translate business requirements into detailed user stories and acceptance criteria.\n- Ensure the development team understands the product vision and requirements.\n- Act as the primary point of contact for all product-related questions and issues.</p>\n<p><strong>2. Project Management:</strong>\n- Plan, manage, and track project timelines, deliverables, and milestones.\n- Coordinate and facilitate regular project meetings, including sprint planning, daily stand-ups, and retrospectives.\n- Identify and mitigate project risks and issues.\n- Ensure projects are delivered on time, within scope, and within budget.\n- Communicate project status and updates to stakeholders regularly.</p>\n<p><strong>3. Quality Assurance:</strong>\n- Define user acceptance criteria and validate QA test cases for completeness and quality.\n- Collaborate with QA teams to ensure thorough testing and quality assurance processes.\n- Review and approve test plans and test cases.\n- Ensure that all products meet the highest standards of quality before release.</p>\n<p><strong>4. Team Collaboration:</strong>\n- Foster a collaborative and efficient working environment within the team.\n- Provide clear guidance and support to team members.\n- Continuously seek opportunities to improve processes and efficiency.</p>\n<p><strong>Qualifications:</strong>\n- Bachelor’s degree in Computer Science, Business, or a related field.\n- Proven experience as a Product Owner, Project Manager, or similar role in a software development environment.\n- Strong understanding of Agile methodologies and Scrum framework.\n- Excellent communication, presentation, and interpersonal skills.\n- Ability to think from an end-user perspective and translate needs into actionable requirements.\n- Strong organizational and multitasking skills.\n- Proactive and solution-oriented mindset.\n- Experience with project management tools (e.g., Jira, Trello, Asana).</p>\n<p><strong>Preferred Skills:</strong>\n- Certified Scrum Product Owner (CSPO) or similar certification.\n- Experience in a small or startup environment.\n- Technical background or understanding of software development processes.</p>\n<p><em>Nothing in this position description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.</em></p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at daya.m@cloudium.io</p>",
        "tags": [
            "5+ Years",
            "Agile",
            "Scrum",
            "Jira"
        ],
        "summary": "Seeking a Product Owner/Project Manager with experience in Agile and Scrum. Responsibilities include managing product backlogs, project timelines, and stakeholder communication for high-quality software delivery."
    },
    {
        "job_title": "Business Analyst (Qatar – Onshore)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25755",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Business Analyst (Qatar – Onshore)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> Qatar (Onshore)\n<strong>Closing Date:</strong> December 12, 2025\n<strong>Job Published:</strong> December 06, 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are seeking an experienced Business Analyst with strong analytical, communication, and stakeholder-management skills to join our team in Qatar. The ideal candidate will have 8–10 years of professional experience, a strong understanding of business processes, and proven expertise working with clients across the Middle East region. Fluency in Arabic and a valid Qatar Resident Permit/Qatar ID (QID) are mandatory.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Engage with business users, clients, and stakeholders to gather, analyze, and document business requirements.</li>\n<li>Translate business needs into detailed functional specifications and user stories.</li>\n<li>Drive requirement workshops, meetings, interviews, and business process reviews.</li>\n<li>Analyze existing workflows and propose process improvements, optimization opportunities, and automation strategies.</li>\n<li>Support solution design by working closely with technical, product, and development teams.</li>\n<li>Conduct impact assessments, feasibility studies, and gap analyses for new initiatives.</li>\n<li>Support project planning, testing (SIT/UAT), and deployment activities.</li>\n<li>Create documentation including BRDs, FRDs, process flows, user manuals, and test cases.</li>\n<li>Ensure alignment between business objectives and project deliverables.</li>\n<li>Maintain effective communication with key stakeholders across multiple departments.</li>\n<li>Provide ongoing analytical support for enhancements, change requests, and issue resolution.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>8–10 years of experience as a Business Analyst in a structured business or technology environment.</li>\n</ul>\n<p><strong>Mandatory:</strong></p>\n<ul>\n<li>Valid Qatar ID / Resident Permit.</li>\n<li>Fluency in Arabic (spoken and written).</li>\n<li>Experience working with Middle East (GCC) clients, preferably Qatar.</li>\n<li>Strong understanding of business analysis frameworks, methodologies, and tools (e.g., BPMN, UML, Agile, Scrum, Waterfall).</li>\n<li>Proven experience conducting requirement sessions and managing diverse stakeholder groups.</li>\n<li>Ability to develop clear documentation, business cases, and analytical reports.</li>\n<li>Strong problem-solving, critical-thinking, and decision-making abilities.</li>\n<li>Excellent communication, presentation, and interpersonal skills.</li>\n<li>Experience with digital transformation, technology projects, or enterprise systems is preferred.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Recruitment:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>\n<p><strong>Company Address:</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Company Website:</strong> http://www.reflectionsglobal.com</p>",
        "tags": [
            "8-10 Years",
            "Business Analysis",
            "Arabic",
            "Qatar"
        ],
        "summary": "Experienced Business Analyst needed in Qatar with 8-10 years of experience. Must be fluent in Arabic and have a Qatar ID. Responsibilities include requirement gathering and stakeholder management."
    },
    {
        "job_title": "Delivery Manager (Qatar – Onshore )",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25754",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Delivery Manager - Qatar (Onshore)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> Qatar\n<strong>Closing Date:</strong> December 12, 2025\n<strong>Published:</strong> December 06, 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>About the Role:</strong></p>\n<p>This role involves overseeing the development of applications offshore, testing at the client site with the assistance of client Subject Matter Experts (SMEs), negotiating change requests, and coordinating production infrastructure readiness. A significant portion of the work includes coordinating with client SMEs on requirements and specific features, securing SME support, and preparing the necessary environments. Experience in implementing new applications at client sites is beneficial. The role also requires substantial stakeholder management, escalation management, and senior leadership engagement.</p>\n<p><strong>Preferred Skills and Qualifications:</strong></p>\n<ul>\n<li><strong>Delivery Manager Profile:</strong> Should possess strong experience working with client senior leadership and a solid understanding of application development and implementation.</li>\n<li><strong>Project Manager (Development):</strong> Should have good exposure to application development and implementation.</li>\n<li><strong>Project Manager (Infrastructure):</strong> Should have significant experience in setting up virtual machines and connectivity for application deployment.</li>\n<li><strong>Languages:</strong> Fluent in Arabic is highly preferred due to client communication.</li>\n<li><strong>Geographical Experience:</strong> Must have experience working with Middle East clients, particularly with ministries.</li>\n<li><strong>Visa:</strong> Must possess a Resident Permit/Qatar ID.</li>\n</ul>\n<p><strong>Application Process:</strong></p>\n<p>Interested candidates are requested to forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current CTC, and expected CTC.</p>\n<p><strong>Important Notice:</strong></p>\n<p>Reflections Info Systems (P) Ltd does not charge any fees for job applications or recruitment. Be aware of potential fraudsters. All official communication will be through our official website, LinkedIn, or official HR email addresses. For any clarification or alerts regarding recruitment, please contact careers@reflectionsinfos.com.</p>\n<p><strong>Company Address:</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>",
        "tags": [
            "5+ Years",
            "Application Development",
            "Stakeholder Management",
            "Arabic"
        ],
        "summary": "Delivery Manager role in Qatar requiring offshore development oversight, client coordination, and stakeholder management. Arabic fluency and Middle East client experience are essential."
    },
    {
        "job_title": "Senior Database Administrator",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25753",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Senior Database Administrator</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 06, Dec 2025\n<strong>Closing Date:</strong> 12, Dec 2025</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Optimize database queries for fast and efficient data retrieval, especially for complex or high-volume operations.</li>\n<li>Design and implement effective indexing strategies to reduce query execution times and improve overall database performance.</li>\n<li>Monitor and profile slow or inefficient queries, recommending best practices for rewriting or re-architecting.</li>\n<li>Continuously analyze SQL query execution plans to identify and optimize bottlenecks.</li>\n<li>Schedule and execute regular database maintenance tasks, including backups, consistency checks, and index rebuilding.</li>\n<li>Implement automated monitoring systems to track database performance, availability, and critical parameters (CPU, memory, disk I/O, replication).</li>\n<li>Proactively diagnose and resolve database issues (e.g., locking, deadlocks, data corruption) before they impact users or operations.</li>\n<li>Implement and manage database clustering, replication, and failover strategies for high availability and disaster recovery (e.g., SQL Server Always On, Oracle RAC, MySQL Group Replication).</li>\n<li>Monitor resource consumption and plan for growth to ensure effective scaling with increasing data volume and transaction load.</li>\n<li>Analyze and optimize resource usage (CPU, memory, disk, network) to reduce operational costs.</li>\n<li>Ensure adherence to database licensing models and identify opportunities for cost reduction.</li>\n<li>Use cloud cost analysis tools (e.g., AWS Cost Explorer, Azure Cost Management) to monitor and optimize cloud database spend, identifying right-sizing or reservation opportunities.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Primary Skills:</strong> 7+ years of experience in Microsoft SQL Server administration.</li>\n<li><strong>Behavioral Competencies:</strong> Communication, Teamwork, Digital Mindset, Operational Excellence, Analytical Ability, Customer Centricity, Business and Market Acumen, Empathy, Growth Mindset.</li>\n</ul>\n<h3>Certifications:</h3>\n<ul>\n<li>Bachelor's degree in computer science, software engineering, or a related field.</li>\n<li>Microsoft SQL certifications (MTA Database, MCSA: SQL Server, MCSE: Data Management and Analytics) are advantageous.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems (P) Ltd does not charge any fee for job applications. Be cautious of fraudsters. Official communication is solely through our website or LinkedIn, and all HR emails originate from official HR email addresses. Contact careers@reflectionsinfos.com for any clarifications or alerts regarding this matter.</p>",
        "tags": [
            "8+ Years",
            "Microsoft SQL Server",
            "Database Performance Tuning",
            "High Availability"
        ],
        "summary": "Seeking an experienced Senior Database Administrator with 8+ years in SQL Server. Responsibilities include performance tuning, maintenance, high availability, and cost optimization. Apply via email."
    },
    {
        "job_title": "Senior Java Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25752",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Senior Java Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Application Closing Date:</strong> December 12, 2025\n<strong>Job Published:</strong> December 06, 2025</p>\n<h3>Introduction</h3>\n<p>We are looking for candidates with 10+ years of experience for this Senior Java Architect role.</p>\n<h3>Job Description</h3>\n<p>The Senior Java Architect is responsible for designing, developing, and overseeing the architecture of enterprise-level Java applications. This role ensures that systems are scalable, high-performing, and secure by leveraging modern Java frameworks and best practices. The Java Architect will collaborate with cross-functional teams to integrate various technologies (such as messaging, caching, databases, API gateways, security infrastructures, workflow engines, deployment mechanisms, etc.) into a cohesive solution and guide developers in implementing robust, maintainable code.</p>\n<h3>Core Responsibilities</h3>\n<ul>\n<li>Define the overall architecture for Java-based applications, including the use of microservices, APIs, and integration patterns to meet business requirements.</li>\n<li>Select and govern the use of Java frameworks (e.g., Spring Boot, Spring Security, Hibernate/JPA) to ensure consistency and quality across projects.</li>\n<li>Lead the end-to-end modernization of a mission-critical on-premises platform, ensuring near-zero data loss and minimal downtime during migration.</li>\n<li>Design and deliver solutions that can run alongside existing systems, support phased rollout across multiple data centers and a DR site, meet strict uptime and performance SLAs, and align with existing monitoring and integration mechanisms.</li>\n<li>Collaborate with Database and Infrastructure teams to define how applications interact with databases and run in containerized environments (e.g., Oracle Database for OLTP and Redis for caching).</li>\n<li>Establish coding standards, conduct code reviews, and mentor development teams on best practices for error handling, logging, and secure coding.</li>\n</ul>\n<h3>Technical Skills (MUST HAVE)</h3>\n<ul>\n<li>Expert-level proficiency in Java (Java SE/EE, ideally including recent versions) and in-depth knowledge of the Java ecosystem.</li>\n<li>Strong experience with Java frameworks and libraries: Spring Boot for microservices, Spring Security for authentication and authorization, Hibernate/JPA for ORM, and related tools.</li>\n<li>Hands-on experience designing and implementing microservices architectures and RESTful APIs, including inter-service communication patterns and API documentation (OpenAPI/Swagger).</li>\n<li>Solid understanding of relational databases, especially Oracle database design and SQL.</li>\n<li>Strong understanding of API security and authentication/authorization mechanisms (e.g., OAuth2, OpenID Connect, JWT).</li>\n</ul>\n<h3>Experience and Soft Skills (MUST HAVE)</h3>\n<ul>\n<li>10+ years of experience in software development with at least 2–3 years in an architect role focused on Java applications.</li>\n<li>Proven track record in designing and delivering large-scale, distributed systems and enterprise applications using Java technologies.</li>\n<li>Strong leadership in guiding development teams, conducting design reviews, and driving architectural governance.</li>\n<li>Excellent communication skills, with the ability to explain complex technical concepts to stakeholders and produce clear architectural documentation and diagrams.</li>\n</ul>\n<h3>Responsibilities (SHOULD HAVE)</h3>\n<ul>\n<li>Design integration solutions using enterprise messaging and API management tools (e.g., implementing event streaming with Apache Kafka and using API gateways such as IBM API Connect for external integrations).</li>\n<li>Work closely with DevOps teams to integrate build and deployment pipelines (e.g., Azure DevOps or Jenkins) and containerization platforms (such as Docker and OpenShift) into the development lifecycle.</li>\n<li>Monitor and troubleshoot the architecture during development and testing, and address performance bottlenecks or security vulnerabilities using monitoring tools, logs, and APM solutions.</li>\n</ul>\n<h3>Technical Skills (SHOULD HAVE)</h3>\n<ul>\n<li>Knowledge of messaging and streaming platforms like Apache Kafka to support event-driven architecture.</li>\n<li>Experience with caching and session management solutions (e.g., Redis or in-memory grids) to improve performance and scalability.</li>\n<li>Experience with API gateway products (such as IBM API Connect) for managing internal and external APIs.</li>\n<li>Proficiency with DevOps and deployment tooling: Git for source control, CI/CD pipelines (Azure DevOps Pipelines or Jenkins), Docker for containerization, and Kubernetes/OpenShift for orchestration.</li>\n<li>Knowledge of monitoring and logging frameworks and tools (e.g., Elastic Stack/ELK for log aggregation and APM tools like Dynatrace) to ensure the health and performance of Java applications in production.</li>\n</ul>\n<h3>Experience (SHOULD HAVE)</h3>\n<ul>\n<li>Experience optimizing application performance, including profiling Java applications, tuning garbage collection, and applying caching strategies to achieve high throughput and low latency.</li>\n<li>Prior involvement in secure software development practices, including integrating static code analysis or vulnerability scanning into the development process, and familiarity with DevSecOps concepts.</li>\n</ul>\n<h3>Technical Skills and Experience (NICE TO HAVE)</h3>\n<ul>\n<li>Exposure to NoSQL or multi-model databases and the ability to choose the appropriate data storage technology for specific use cases.</li>\n<li>Experience with reactive frameworks or newer JDK features that can improve responsiveness and scalability.</li>\n<li>Broader experience with different API gateways, logging stacks, and APM tools beyond those explicitly mentioned.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Job Applications:</strong></p>\n<p>This is to notify job seekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. Please contact <strong>careers@reflectionsinfos.com</strong> for any clarification or alerts on this subject.</p>",
        "tags": [
            "10+ Years",
            "Java",
            "Microservices",
            "Spring Boot"
        ],
        "summary": "Seeking a Senior Java Architect with 10+ years of experience to design and oversee enterprise Java application architecture. Role involves modernizing platforms and ensuring scalability, performance, and security."
    },
    {
        "job_title": "Senior Front-End Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25751",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Senior Front-End Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Closing Date:</strong> December 12, 2025\n<strong>Job Published:</strong> December 06, 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems is seeking highly experienced candidates (10+ years) for the Senior Front-End Architect position.</p>\n<h3>Job Description</h3>\n<p>The Front-End Architect will be responsible for defining and guiding the user interface architecture for large-scale, mission-critical web applications. The goal is to ensure that front-end solutions are performant, maintainable, secure, and consistent across modules by leveraging modern JavaScript frameworks and best practices. This role involves close collaboration with product owners, UX designers, backend architects, GIS teams, and DevOps to deliver robust, user-friendly interfaces that seamlessly integrate with APIs, real-time data feeds, and mapping components.</p>\n<h3>Core Responsibilities:</h3>\n<ul>\n<li>Define overall architecture and standards for front-end applications, including framework selection, component design, state management, and integration with backend APIs and real-time services.</li>\n<li>Lead the modernization of legacy front-end applications (e.g., Adobe Flex, older web UIs) into modern, component-based SPAs using Angular or React, minimizing disruption to ongoing operations.</li>\n<li>Design and deliver front-end solutions that can coexist with legacy UIs during transition, support phased rollouts, and meet strict performance and availability requirements.</li>\n<li>Architect reusable UI components, layout systems, and design patterns for complex, data-rich screens (grids, dashboards, real-time views, map-based visualizations).</li>\n<li>Collaborate with backend, integration, and GIS teams to define API contracts, data models, and mapping integrations (e.g., ESRI).</li>\n<li>Ensure front-end applications are built with strong security practices, including secure handling of authentication/authorization, input validation, and protection against common web vulnerabilities.</li>\n<li>Establish coding standards, UI architecture guidelines, and best practices for component design, state management, error handling, logging, testing, and performance optimization.</li>\n<li>Conduct design and code reviews and provide mentoring to development teams.</li>\n</ul>\n<h3>Technical Skills (MUST HAVE):</h3>\n<ul>\n<li>Expert-level proficiency in modern JavaScript/TypeScript and deep understanding of browser fundamentals.</li>\n<li>Strong hands-on experience with Angular or React and their ecosystems.</li>\n<li>Solid experience architecting large-scale, modular front-end applications, including component-based design, reusable UI libraries, and shared design systems.</li>\n<li>Experience modernizing legacy UIs to SPAs, including strategies for co-existence and phased migration.</li>\n<li>Strong understanding of integrating front-end applications with RESTful APIs and real-time communication mechanisms (e.g., WebSockets, SignalR).</li>\n<li>Hands-on experience with front-end build and tooling ecosystems (e.g., Webpack, Vite, Angular CLI, npm/yarn).</li>\n<li>Good understanding of front-end security fundamentals (authentication, token handling, CSRF, XSS).</li>\n<li>Experience with responsive design and cross-browser compatibility.</li>\n</ul>\n<h3>Experience and Soft Skills (MUST HAVE):</h3>\n<ul>\n<li>10+ years of experience in front-end or full-stack development, with at least 3-4 years in a lead or architect role.</li>\n<li>Proven experience designing and delivering complex, data-intensive or real-time front-end applications in mission-critical environments.</li>\n<li>Strong leadership abilities to guide engineers and drive architectural decisions.</li>\n<li>Excellent communication skills for collaboration with various teams and stakeholders.</li>\n</ul>\n<h3>Responsibilities (SHOULD HAVE):</h3>\n<ul>\n<li>Work with DevOps and infrastructure teams to define CI/CD pipelines for front-end applications.</li>\n<li>Collaborate with UX and product teams to balance usability, design, performance, and technical feasibility.</li>\n<li>Monitor and troubleshoot front-end performance and stability using developer tools and monitoring platforms.</li>\n</ul>\n<h3>Technical Skills (SHOULD HAVE):</h3>\n<ul>\n<li>Experience with front-end performance optimization techniques (bundle analysis, code splitting, lazy loading, caching).</li>\n<li>Familiarity with integrating mapping libraries and GIS components (e.g., ESRI JavaScript API).</li>\n<li>Working knowledge of accessibility standards (e.g., WCAG) and practices.</li>\n<li>Familiarity with CI/CD practices for front-end applications.</li>\n</ul>\n<h3>Experience (SHOULD HAVE):</h3>\n<ul>\n<li>Prior involvement in modernization projects migrating legacy front ends to Angular or React.</li>\n<li>Experience in environments with multiple data centres, strict SLAs, and stringent security requirements.</li>\n</ul>\n<h3>Secondary Skills (NICE TO HAVE):</h3>\n<ul>\n<li>Exposure to other front-end frameworks or libraries (e.g., Vue, Svelte) or micro-frontend architectures.</li>\n<li>Experience with design systems or component libraries (e.g., Material, Bootstrap) and tools like Storybook.</li>\n<li>Familiarity with analytics and user behaviour tracking tools.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note on Job Scams:</strong></p>\n<p>Be aware that some fraudsters may promise jobs with Reflections Info Systems for a fee. Reflections Info Systems <strong>never</strong> asks for payment for job opportunities. We contact candidates exclusively through our official website or LinkedIn, and all official employment-related emails are sent from the HR email ID: careers@reflectionsinfos.com. Please contact careers@reflectionsinfos.com for any clarification or to report suspicious activity.</p>",
        "tags": [
            "10+ Years",
            "Angular",
            "React",
            "JavaScript"
        ],
        "summary": "Seeking a Senior Front-End Architect with 10+ years of experience. Responsibilities include defining UI architecture, modernizing legacy systems, and ensuring performance and security for large-scale web applications."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25750",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Closing Date:</strong> December 12, 2025\n<strong>Job Published:</strong> December 06, 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>Reflections Info Systems is seeking a seasoned Technical Delivery Manager with 14+ years of experience to lead the successful delivery of complex technical projects and solutions. The ideal candidate possesses a strong technology background, exceptional project management skills, and excels at cross-functional collaboration. This role demands end-to-end ownership of project delivery, ensuring alignment with business objectives, managing stakeholder expectations, and promoting technical excellence.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Project Delivery Management:</strong>\n- Oversee the planning, execution, and delivery of multiple technical projects.\n- Manage project scope, timelines, budgets, risks, and quality.\n- Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n<p><strong>Team Leadership:</strong>\n- Lead and mentor cross-functional technical teams, fostering collaboration and innovation.\n- Conduct regular performance reviews and provide growth opportunities for team members.</p>\n<p><strong>Stakeholder Engagement:</strong>\n- Act as a bridge between technical teams, business stakeholders, and clients.\n- Communicate project status, risks, and solutions effectively to all stakeholders.</p>\n<p><strong>Technical Expertise:</strong>\n- Collaborate with architects and engineers to define technical solutions.\n- Provide input on architecture, design, and implementation strategies.</p>\n<p><strong>Process Improvement:</strong>\n- Identify opportunities to improve project delivery processes and tools.\n- Implement best practices in software development and delivery.</p>\n<p><strong>Risk and Issue Management:</strong>\n- Proactively identify project risks and develop mitigation strategies.\n- Resolve technical and operational challenges in a timely manner.</p>\n<p><strong>Customer Focus:</strong>\n- Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</p>\n<h3>Preferred Skills:</h3>\n<p><strong>Experience:</strong>\n- 14 years of experience in technology delivery roles, including hands-on development and leadership.\n- Proven experience delivering large-scale, complex projects with diverse teams.\n- Manage P&amp;L for a portfolio of accounts, ensuring revenue growth and profitability.\n- Plan and manage team ramp-ups and ramp-downs using pyramid planning, external hiring, and internal sourcing.\n- Drive account management activities including financial tracking, invoice collection, margin improvements, and resource planning.\n- Build strong client relationships through regular interactions, QBRs, and on-site visits.\n- Support account mining by identifying new opportunities, preparing proposals, and influencing stakeholders.</p>\n<p><strong>Technical Expertise:</strong>\n- Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.\n- Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</p>\n<p><strong>Project Management:</strong>\n- Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.\n- Certification such as PMP, CSM, or equivalent is an advantage.</p>\n<p><strong>Leadership and Communication:</strong>\n- Excellent team leadership, people management, and conflict resolution skills.\n- Strong communication, presentation, and negotiation abilities.</p>\n<h3>Education:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Experience managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices and frameworks.</li>\n<li>Strong business acumen with the ability to align technical goals with business strategy.</li>\n</ul>\n<p><strong>Application Instructions:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Fraudulent Job Offers:</strong></p>\n<p>Beware of fraudsters posing as Reflections Info Systems employees who solicit payments for job opportunities. Reflections Info Systems <strong>never</strong> asks for payment for employment. Official communication comes only through our website or LinkedIn, and all HR emails originate from the official HR email ID. Contact careers@reflectionsinfos.com for any clarification or alerts regarding this matter.</p>",
        "tags": [
            "14+ Years",
            "Agile",
            "Cloud Technologies",
            "Project Management"
        ],
        "summary": "Seeking a seasoned Technical Delivery Manager with 14+ years of experience to oversee complex project delivery. Must excel in team leadership, stakeholder engagement, and technical expertise for high-quality solutions."
    },
    {
        "job_title": "GIS Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25749",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>GIS Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Closing Date:</strong> 12, Dec 2025\n<strong>Job Published:</strong> 06, Dec 2025</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems is seeking a highly experienced GIS Architect with over 10 years of experience to design and govern the geospatial architecture for a large, mission-critical enterprise platform. This role is crucial for a platform that heavily relies on mapping, location intelligence, and real-time spatial data.</p>\n<h3>Core Responsibilities</h3>\n<ul>\n<li>Define the overall GIS architecture, including ArcGIS Enterprise components, geodatabases, map/feature services, and real-time GIS services, ensuring scalability, high availability, and security across multiple data centres and a DR site.</li>\n<li>Lead the modernization of legacy GIS implementations into a modern ArcGIS Enterprise–based landscape, including rationalizing map services, refactoring geodatabases, and standardizing service publishing and consumption patterns.</li>\n<li>Design and govern GIS services used by web, desktop, mobile, and control-room applications, ensuring consistent APIs, performance, and cartographic standards across incident management, resource tracking, analytics, and reporting.</li>\n<li>Collaborate closely with application, integration, and backend architects to define how GIS services are consumed by business modules (e.g., call taking, dispatch, resource management) and to ensure optimal data flows between GIS and transactional systems.</li>\n<li>Define standards for spatial data modelling, including base maps, operational layers, network datasets, address data, and other reference layers needed for routing, proximity analysis, and spatial queries.</li>\n<li>Ensure that GIS components and data are designed to support active-active data centres and DR, including replication strategies, synchronization, and failover behaviour.</li>\n<li>Work with infrastructure and database teams to define and optimize the hosting environment for GIS servers, data stores, and geodatabases (e.g., ArcGIS Enterprise + Oracle), including capacity planning and performance tuning.</li>\n<li>Establish best practices for GIS security, including user and role management, service-level permissions, data access policies, and integration with enterprise identity providers.</li>\n<li>Provide technical leadership and guidance to GIS developers, analysts, and administrators, reviewing designs and implementations to ensure alignment with the target GIS architecture.</li>\n<li>Define and maintain standards for GIS data governance, including data lifecycle, versioning, editing workflows, quality checks, and publication processes.</li>\n<li>Collaborate with reporting and analytics teams to provide GIS-enabled analytics, dashboards, and spatial insights that support operations and management decision-making.</li>\n<li>Contribute to capacity planning and performance testing activities, ensuring that GIS components meet response-time and throughput requirements for high-load scenarios.</li>\n<li>Participate in incident reviews and root cause analysis for GIS-related issues, identifying improvements to architecture, configuration, or operational processes.</li>\n<li>Support the definition of backup, restore, and archival strategies for GIS data and services in alignment with enterprise RPO/RTO objectives.</li>\n</ul>\n<h3>Technical Skills</h3>\n<p><strong>MUST HAVE:</strong></p>\n<ul>\n<li>Strong hands-on experience with ArcGIS Enterprise (Portal for ArcGIS, ArcGIS Server, ArcGIS Data Store) in on-premises, multi-server or multi-data-centre deployments.</li>\n<li>Solid experience with ArcGIS Pro or equivalent desktop tools for managing geodatabases, authoring maps, publishing services, and performing advanced spatial analysis.</li>\n<li>Deep understanding of enterprise geodatabases (ArcGIS with Oracle), including schema design, indexing, spatial types, and performance tuning for spatial queries.</li>\n<li>Knowledge of publishing and managing map services, feature services, geoprocessing services, and network analysis services for high-volume, real-time operational use.</li>\n<li>Experience designing and implementing GIS solutions for routing, nearest resource identification, geocoding, reverse geocoding, and other spatial operations required by operational systems.</li>\n<li>Familiarity with integrating GIS services into web and mobile applications via REST APIs, JavaScript APIs, and other client SDKs.</li>\n<li>Understanding of GIS performance optimization, including service caching, scale settings, layer optimization, and map design for high-density, real-time use.</li>\n<li>Good understanding of security concepts in GIS platforms, including authentication, authorization, SSL/TLS, and integration with enterprise identity providers.</li>\n</ul>\n<p><strong>SHOULD HAVE:</strong></p>\n<ul>\n<li>Experience with real-time or near real-time GIS components (GeoEvent Server or equivalent) for streaming data such as vehicle locations, sensors, or event feeds.</li>\n<li>Familiarity with scripting and automation (Python, ArcPy, or PowerShell) for GIS administration, data processing, and bulk operations.</li>\n<li>Working knowledge of integrating GIS with message buses or event streaming platforms (Kafka, ActiveMQ) to support real-time workflows.</li>\n<li>Understanding of load balancing and clustering for GIS servers, and how they interact with web tiers and application gateways.</li>\n</ul>\n<p><strong>NICE TO HAVE:</strong></p>\n<ul>\n<li>Exposure to advanced GIS analytics and big data processing (spatial analysis over large incident datasets, heatmaps, temporal/spatial clustering).</li>\n<li>Experience with other GIS platforms or open-source geospatial tools (QGIS, PostGIS, GeoServer) and understanding of when they complement ArcGIS.</li>\n<li>Familiarity with 3D GIS, indoor mapping, or advanced visualization capabilities.</li>\n<li>Knowledge of integrating GIS with BI tools and data platforms (data warehouses, data lakes, or visualization tools) for spatial reporting.</li>\n</ul>\n<h3>Experience and Soft Skills</h3>\n<ul>\n<li>8+ years of experience in GIS solution design and implementation, with at least 3–4 years in an architect or lead role on enterprise GIS platforms.</li>\n<li>Proven experience delivering GIS solutions for mission-critical, operational environments that require strict uptime, data accuracy, and performance.</li>\n<li>Experience working in multi-datacentre and DR-enabled environments, including understanding replication, synchronization, and high-availability patterns for GIS.</li>\n<li>Strong ability to collaborate with application, database, infrastructure, and operations teams and to influence the design of systems that depend on GIS capabilities.</li>\n<li>Excellent communication and documentation skills, including the ability to clearly describe GIS architectures, data flows, and design decisions to both technical and non-technical stakeholders.</li>\n<li>Prior involvement in modernization or migration projects moving from legacy GIS setups to ArcGIS Enterprise or similar modern GIS stacks.</li>\n<li>Experience working in environments with strong security, compliance, or regulatory requirements, and supporting audits from a GIS perspective.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Please be aware that some fraudsters may attempt to promise jobs at Reflections Info Systems for a fee. Reflections Info Systems never requests payment for job opportunities. We only contact candidates through our official website or LinkedIn, and all employment-related emails are sent from our official HR email address. For any clarification or alerts regarding this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "10+ Years",
            "ArcGIS Enterprise",
            "Geodatabases",
            "GIS Architecture"
        ],
        "summary": "Seeking a GIS Architect with 10+ years of experience to design and govern a mission-critical enterprise geospatial platform. Responsibilities include modernization, integration, and ensuring high availability and security."
    },
    {
        "job_title": "Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25748",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Infrastructure Architect at Reflections Info Systems (P) Ltd</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Closing Date:</strong> 12, Dec 2025\n<strong>Job Published:</strong> 06, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 10+ years of experience for this role.</p>\n<h3>Job Description</h3>\n<p>The Infrastructure Architect will lead the architectural design and implementation of robust, scalable, secure, and high-performance infrastructure across multi-site data centers. This includes virtualization, OpenShift orchestration, backup and recovery, and disaster recovery strategies. The role ensures infrastructure readiness for modern workloads such as microservices, integration platforms, databases, data lakehouse, GIS, and DevOps tools, with a strong focus on automation, availability, and compliance.</p>\n<h3>Core Responsibilities:</h3>\n<ul>\n<li>Design infrastructure blueprints supporting multi-site deployments with isolated yet synchronized application environments.</li>\n<li>Lead deployment architecture for VMware vSphere and vSAN clusters and oversee infrastructure provisioning for Red Hat OpenShift and IBM Cloud Pak platforms.</li>\n<li>Plan compute, storage, and networking configurations while integrating observability and security tools (e.g., EFK, Dynatrace, ManageEngine, IBM Guardium).</li>\n<li>Guide infrastructure setup for major workloads, including ArcGIS Enterprise, Oracle DB, Cloudera Data Platform, and IBM Cloud Pak for Integration.</li>\n<li>Define and implement inter-site network architecture, IP schemes, and DR solutions using tools like Zerto and Dell RecoverPoint.</li>\n<li>Ensure high availability, performance, and redundancy for enterprise systems such as analytics, middleware, and data platforms.</li>\n<li>Establish standards for infrastructure monitoring, logging, and alerting using Dynatrace, VMware vRealize, and EFK stack.</li>\n<li>Architect scalable backup and recovery strategies using SAN/NAS and orchestration tools like Perpetuuiti with clear RTO/RPO objectives.</li>\n</ul>\n<h3>Technical Skills (MUST HAVE):</h3>\n<ul>\n<li>Expertise in VMware vSphere, vSAN, and hyper-converged infrastructure platforms.</li>\n<li>Experience architecting infrastructure for Red Hat OpenShift and containerized workloads.</li>\n<li>Proficient in SAN/NAS provisioning, backup architecture, and integration with enterprise platforms such as Oracle, Cloudera, and ArcGIS.</li>\n<li>Solid understanding of data center networking—firewalls, load balancers, DNS, SD-WAN, VPNs, and inter-site connectivity.</li>\n<li>Hands-on with automation and configuration tools like Ansible, Terraform, Workspace ONE UEM, and backup/replication tools (e.g., Zerto, Dell RecoverPoint).</li>\n<li>Familiarity with monitoring and logging stacks like Dynatrace, EFK, IBM Guardium, and Splunk.</li>\n<li>Working knowledge of disaster recovery, failover design, and resilient multi-site infrastructure planning.</li>\n</ul>\n<h3>Experience and Soft Skills:</h3>\n<ul>\n<li>12+ years in IT infrastructure, including 4+ years in infrastructure architecture for enterprise scale environments.</li>\n<li>Demonstrated success in designing and deploying data centers or private/hybrid cloud platforms.</li>\n<li>Proficient in documenting infrastructure using tools like Visio, Draw.io, and Confluence for operational workflows and runbooks.</li>\n<li>Strong cross-functional collaboration with application, DevOps, security, and network teams to ensure seamless infrastructure delivery and support.</li>\n<li>Excellent communication, analytical, and problem-solving skills with a focus on reliability, scalability, and performance.</li>\n</ul>\n<h3>SHOULD HAVE - Responsibilities:</h3>\n<ul>\n<li>Define standards for infrastructure service naming, resource tagging, and version control practices.</li>\n<li>Drive capacity planning initiatives for compute, storage, and network utilization across environments.</li>\n<li>Automate infrastructure provisioning using tools like Ansible and Terraform for consistency and repeatability.</li>\n<li>Implement security best practices, including RBAC, Active Directory integration, and access policy enforcement.</li>\n<li>Contribute to DR validation planning and lead coordination of environment-level failover and recovery testing.</li>\n</ul>\n<h3>SHOULD HAVE - Technical Skills:</h3>\n<ul>\n<li>Familiarity with infrastructure integration needs for platforms such as IBM CP4I, ArcGIS Server, and OpenShift Data Foundation.</li>\n<li>Strong understanding of container networking models, ingress controllers, service mesh (e.g., Istio), and persistent volume provisioning.</li>\n<li>Hands-on experience in provisioning and hardening enterprise OS environments on Windows Server and Red Hat Enterprise Linux.</li>\n</ul>\n<h3>SHOULD HAVE - Experience:</h3>\n<ul>\n<li>Experience managing infrastructure for regionally distributed applications with replication and failover requirements.</li>\n<li>Involvement in high availability infrastructure setups supporting clustered databases (e.g., Oracle RAC), big data (e.g., Hadoop), or containerized microservices.</li>\n</ul>\n<h3>NICE TO HAVE - Technical Skills and Experience:</h3>\n<ul>\n<li>Experience in GitOps and ability to support GitOps based infrastructure provisioning and configuration management.</li>\n<li>Familiarity with advanced telemetry and observability integrations, including NOC dashboard design and cross-platform health visualization.</li>\n<li>Exposure to service mesh observability, infrastructure policy automation, or zero-touch provisioning approaches.</li>\n</ul>\n<h3>Important Notice:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details. </p>\n<p><strong>Fraud Alert:</strong> Please be advised that some fraudsters may promise jobs with Reflections Info Systems for a fee. Reflections Info Systems <strong>never</strong> asks for payment for job opportunities. We communicate with candidates solely through our official website or LinkedIn, and all employment-related emails originate from our official HR email address. For any clarifications or alerts regarding this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "12+ Years",
            "VMware vSphere",
            "Red Hat OpenShift",
            "Disaster Recovery"
        ],
        "summary": "Seeking an Infrastructure Architect with 10+ years of experience to design and implement robust, scalable, and secure multi-site data center infrastructure. Role focuses on virtualization, orchestration, backup, and disaster recovery for modern workloads."
    },
    {
        "job_title": "Solution Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25747",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Solution Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Published:</strong> 06, Dec 2025\n<strong>Closing Date:</strong> 12, Dec 2025</p>\n<h3>Introduction</h3>\n<p>We are looking for a Solution Architect to support the design and delivery of scalable, secure, and high-performing technology solutions for our clients. This role combines hands-on technical expertise with strong architectural thinking. You will work closely with senior architects, delivery teams, and stakeholders to understand business needs, create robust solution designs, and ensure successful implementation across multiple projects.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Architecture &amp; Design</strong></p>\n<ul>\n<li>Assist in creating solution architectures, high-level designs, and technical diagrams.</li>\n<li>Contribute to the development and evolution of technical strategies for assigned services or projects.</li>\n<li>Evaluate new technologies, tools, and frameworks for potential use in client solutions.</li>\n<li>Support and contribute to proof-of-concepts, prototypes, and feasibility assessments.</li>\n</ul>\n<p><strong>Collaboration &amp; Delivery</strong></p>\n<ul>\n<li>Work closely with development teams to ensure adherence to architectural standards and design principles.</li>\n<li>Participate in code reviews, technical design sessions, and agile ceremonies.</li>\n<li>Collaborate with multidisciplinary teams (policy, product, engineering, QA) to ensure user-centric designs.</li>\n<li>Assist in defining how we build and operate open-source, cloud-first solutions at scale.</li>\n</ul>\n<p><strong>Governance &amp; Stakeholder Engagement</strong></p>\n<ul>\n<li>Work with both technical and non-technical stakeholders to clarify requirements and support technology decisions.</li>\n<li>Communicate architectural vision and solution rationale clearly across teams.</li>\n<li>Identify deeper underlying problems and contribute to broader digital transformation initiatives.</li>\n<li>Support profession-based activities such as defining architecture standards, guidelines, and best practices.</li>\n<li>Contribute actively to communities of practice to strengthen awareness, inclusivity, and technical excellence.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<p><strong>Technical Skills</strong></p>\n<ul>\n<li>Solid understanding of software development principles and system design concepts.</li>\n<li>Hands-on experience with at least one programming language (Java, Python, C#, or similar).</li>\n<li>Practical knowledge across the web stack—from frontend technologies to backend, cloud, infrastructure, and networking.</li>\n<li>Experience with cloud-first architectures (AWS, Azure, or GCP) and designing solutions that leverage cloud-native capabilities.</li>\n<li>Knowledge of databases, integration patterns, APIs, and microservices.</li>\n<li>Familiarity with open-source technologies and modern development practices.</li>\n</ul>\n<p><strong>Professional Skills</strong></p>\n<ul>\n<li>Experience working with technical teams in an agile delivery environment.</li>\n<li>Ability to work collaboratively with stakeholders to reach agreement on technical decisions.</li>\n<li>Strong analytical and problem-solving skills, with the ability to identify broader architectural implications beyond immediate issues.</li>\n<li>Excellent communication skills with the ability to simplify complex technical concepts for different audiences.</li>\n</ul>\n<h3>Certifications:</h3>\n<p>(Not specified in the description)</p>\n<h3>Educational Background:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Software Engineering, or related technical field.</li>\n</ul>\n<h3>Application Process:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment-related emails are sent through the official HR email ID. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "5+ Years",
            "Cloud Architecture",
            "Solution Design",
            "Agile"
        ],
        "summary": "Seeking a Solution Architect to design scalable tech solutions. Role involves hands-on technical expertise, architectural thinking, and stakeholder collaboration for client projects."
    },
    {
        "job_title": "DevOps Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25746",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>DevOps Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 06, Dec 2025\n<strong>Closing Date:</strong> 12, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 8+ years of experience for this role.</p>\n<h3>Description</h3>\n<p>The DevOps Architect is responsible for defining and driving the end-to-end DevOps strategy, tooling, and practices for mission-critical, on-premises and hybrid applications. This role designs and oversees CI/CD pipelines, infrastructure-as-code, environment strategy, and observability to ensure that applications are built, tested, released, and operated in a reliable, secure, and repeatable manner across multiple data centres and DR sites. The DevOps Architect works closely with application, infrastructure, security, and operations teams to enable seamless modernization of legacy systems into containerized and microservices-based architectures, while maintaining strict uptime, performance, and compliance requirements.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Define the overall DevOps architecture, standards, and practices for building, testing, releasing, and operating applications across multiple on-premises environments.</li>\n<li>Design and implement CI/CD pipelines (e.g., Azure DevOps or Jenkins) for Java, .NET, front-end, GIS, database systems, and integration services, ensuring automated build, test, security scanning, and deployment.</li>\n<li>Lead the DevOps enablement for modernization of legacy applications into microservices and containerized workloads, ensuring coexistence with existing monolithic and legacy stacks during the transition.</li>\n<li>Design deployment strategies (e.g., blue-green, canary, rolling updates) suitable for mission-critical, 24×7 systems running in multi-datacenter and DR setups with strict SLAs.</li>\n<li>Define and implement infrastructure-as-code (IaC) standards (e.g., Terraform, Ansible) for provisioning and managing infrastructure, middleware, Kubernetes/OpenShift clusters, and shared services in a consistent, repeatable way.</li>\n<li>Collaborate closely with Application, Integration, Database, Infrastructure, Security, and Network teams to ensure that pipelines, deployment patterns, and operational processes align with existing on-prem standards, DR strategies, and compliance requirements.</li>\n<li>Establish and enforce configuration management practices (e.g., environment-specific configurations, secrets management, feature flags) across all environments.</li>\n<li>Define and implement logging, monitoring, and alerting standards (e.g., ELK/EFK, Prometheus, Grafana, APM tools) to ensure observability of applications, services, and infrastructure.</li>\n<li>Drive adoption of DevSecOps practices by integrating security checks (SAST, DAST, dependency scanning, container scanning) into CI/CD pipelines and release processes.</li>\n<li>Define environment strategy and naming conventions and ensure consistent topology, tagging, and baseline configurations across multiple environments.</li>\n<li>Implement automated quality gates in CI/CD pipelines, including unit tests, integration tests, security checks, code coverage, and policy compliance checks.</li>\n<li>Work with Security teams to align DevSecOps practices with organizational policies and compliance requirements, including auditability and evidence collection for releases.</li>\n<li>Drive continuous improvement of build and deployment times, pipeline reliability, and overall development productivity.</li>\n<li>Contribute to and review operational runbooks, incident response procedures, and DR playbooks from a DevOps and automation perspective.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Technical Skills</h4>\n<ul>\n<li>Strong hands-on experience with CI/CD tools such as Azure DevOps Pipelines, Jenkins, or GitLab CI for automating build, test, and deployment workflows.</li>\n<li>Proficiency with source control and branching strategies (e.g., GitFlow, trunk-based development) and integration with work item/issue tracking.</li>\n<li>Solid experience with containerization and orchestration using Docker and Kubernetes/OpenShift in on-premises or hybrid environments.</li>\n<li>Practical knowledge of infrastructure-as-code tools (e.g., Terraform, Ansible) for provisioning and configuring compute, storage, networking, and platform services.</li>\n<li>Strong understanding of Linux-based environments, shell scripting, and automation for application and infrastructure operations.</li>\n<li>Experience with centralized logging and monitoring stacks (e.g., Elastic Stack/ELK/EFK, Prometheus, Grafana) and APM tools (e.g., Dynatrace, AppDynamics, New Relic).</li>\n<li>Good understanding of networking fundamentals relevant to DevOps (e.g., load balancers, ingress controllers, DNS, certificates, firewall rules, service mesh concepts).</li>\n<li>Experience integrating artifact repositories (e.g., Nexus, Artifactory, Azure Artifacts) with CI/CD pipelines to manage build outputs and dependencies.</li>\n<li>Familiarity with service mesh or advanced traffic management concepts (e.g., Istio, Linkerd, API gateways) as part of blue-green/canary deployment strategies.</li>\n<li>Working knowledge of security tools and scanners (e.g., SonarQube, OWASP ZAP, Snyk, Trivy, Aqua, or similar) integrated with CI/CD.</li>\n<li>Knowledge of scripting/programming languages used for automation (e.g., Bash, PowerShell, Python, or Groovy).</li>\n<li>Exposure to cloud platforms (e.g., Azure, AWS) and hybrid DevOps patterns (on-prem plus cloud) even if current deployment is primarily on-premises.</li>\n<li>Experience with GitOps approaches using tools like Argo CD or Flux for Kubernetes-based deployments.</li>\n<li>Familiarity with SRE practices (e.g., error budgets, SLOs/SLIs, reliability engineering) and how they tie into monitoring and alerting design.</li>\n<li>Experience with secrets management tools (e.g., HashiCorp Vault, Key Management Services) and policy-as-code tools (e.g., Open Policy Agent, Azure Policy).</li>\n</ul>\n<h4>Experience and Soft Skills</h4>\n<ul>\n<li>8+ years of experience in DevOps, build and release engineering, or infrastructure engineering, with at least 3–4 years in a lead/architect role.</li>\n<li>Proven experience implementing DevOps practices for large-scale, distributed, mission-critical systems with strict uptime and performance SLAs.</li>\n<li>Experience working in environments with multiple data centres and DR sites, including supporting failover, recovery testing, and environment synchronization.</li>\n<li>Strong communication and collaboration skills, with the ability to work closely with architects, developers, testers, infrastructure, security, and operations teams.</li>\n<li>Ability to document DevOps architectures, pipelines, standards, and operational runbooks clearly and consistently.</li>\n<li>Prior involvement in modernization projects where legacy applications were incrementally migrated to microservices and containers while maintaining business continuity.</li>\n<li>Experience coordinating releases across multiple teams and systems, including change management and release governance in regulated or high-security environments.</li>\n</ul>\n<h3>Important Notice</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details. Please be aware that fraudsters may impersonate Reflections Info Systems, promising jobs for a fee. Reflections Info Systems never requests payment for job opportunities. Communication is exclusively through our official website or LinkedIn, and all employment-related emails originate from our official HR email ID. For any clarification or to report suspicious activity, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "8+ Years",
            "DevOps",
            "CI/CD",
            "Kubernetes"
        ],
        "summary": "Seeking an experienced DevOps Architect to define and drive end-to-end DevOps strategy for on-premises and hybrid applications. Responsibilities include designing CI/CD pipelines, IaC, and observability for reliable and secure operations."
    },
    {
        "job_title": "Security Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25745",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Security Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Closing Date:</strong> December 12, 2025\n<strong>Job Published:</strong> December 06, 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Description</h3>\n<p>The Security Architect is responsible for defining and governing the security architecture for mission-critical, on-premises enterprise platforms running across multiple data centres and a dedicated disaster recovery site. This role designs and reviews security controls across applications, integrations, data, infrastructure, and identities to ensure confidentiality, integrity, and availability. The Security Architect works closely with application, integration, infrastructure, network, and DevOps teams to embed security into the modernization of legacy systems into microservices and containerized workloads, while meeting strict regulatory, audit, and compliance requirements.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Define the overall security architecture and reference patterns for applications, APIs, integrations, and data flows across multiple on-premises environments and data centres.</li>\n<li>Establish and maintain security standards for identity and access management (e.g., SSO, MFA, RBAC), network security (segmentation, firewalls, VPNs), and endpoint protection in alignment with enterprise policies.</li>\n<li>Work closely with Application, Integration, and API teams to ensure secure design of microservices, web applications, mobile/MDT clients, and external-facing APIs (including authentication, authorization, input validation, and secure session handling).</li>\n<li>Collaborate with Infrastructure and Network teams to ensure secure configurations of servers, containers, Kubernetes/OpenShift clusters, databases, load balancers, and WAFs in on-prem data centres and DR sites.</li>\n<li>Define and review security controls for integrations with external systems (e.g., government systems, third-party services), including secure connectivity, data protection in transit and at rest, and endpoint hardening.</li>\n<li>Oversee the implementation of logging, monitoring, and alerting for security events, working with SIEM/SOC teams to ensure effective detection, correlation, and response to threats.</li>\n<li>Drive secure SDLC and DevSecOps practices by embedding security requirements, threat modelling, and security testing (SAST, DAST, dependency and container scanning) into development and CI/CD pipelines.</li>\n<li>Conduct architecture and design reviews for new solutions and change requests, identifying risks and recommending mitigations to ensure compliance with security and regulatory requirements.</li>\n<li>Define and maintain security baselines, hardening guides, and configuration benchmarks for platforms, middleware, and databases used in the environment.</li>\n<li>Lead or contribute to threat modelling exercises and risk assessments for key applications, integrations, and infrastructure components, and ensure that findings are translated into actionable controls.</li>\n<li>Define and review policies for secure access to environments (e.g., privileged access, just-in-time access, break-glass accounts) in collaboration with Infrastructure and Operations teams.</li>\n<li>Support incident response and forensic analysis activities by ensuring appropriate logging, evidence collection, and coordination with SOC or security operations teams.</li>\n<li>Contribute to business continuity and disaster recovery planning from a security perspective, ensuring that DR strategies maintain required security controls and data protection.</li>\n<li>Provide security guidance and coaching to architects, developers, DevOps engineers, and operations teams, promoting a security-by-design and security-by-default culture.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Technical Skills:</strong>\n- Strong understanding of security architecture principles for enterprise applications, APIs, microservices, and integrations in on-premises and hybrid environments.\n- Hands-on knowledge of identity and access management concepts and technologies, such as Active Directory/LDAP, SSO, MFA, RBAC, OAuth2, OpenID Connect, and JWT-based authentication.\n- Good understanding of application security fundamentals, including OWASP Top 10, secure coding practices, input validation, output encoding, and secure session/token management.\n- Experience working with network security controls, including firewalls, VPNs, reverse proxies, WAFs, network zoning, and secure remote access patterns.\n- Familiarity with securing containerized workloads and orchestration platforms (e.g., Docker and Kubernetes/OpenShift), including image scanning, runtime security, and secure configuration of clusters.\n- Knowledge of database and data security, including encryption at rest and in transit, database hardening, least privilege, and secure access patterns for Oracle and other relational databases.\n- Experience with security logging and monitoring, SIEM platforms, and integration of application and infrastructure logs into centralized monitoring for security analytics.\n- Experience integrating security tools and scanners into CI/CD pipelines (e.g., SAST, DAST, dependency scanning, container image scanning) and interpreting results for remediation.\n- Familiarity with secrets management tools and practices (e.g., secure storage of keys, certificates, tokens, and passwords; rotation and lifecycle management).\n- Knowledge of endpoint and server hardening practices and baseline frameworks (e.g., CIS benchmarks or equivalent).\n- Working knowledge of encryption technologies (e.g., TLS, certificates, key management) and their application to APIs, services, and data stores.</p>\n<p><strong>Experience and Soft Skills:</strong>\n- 10+ years of experience in information security, application security, or infrastructure security, with at least 3-4 years in a security architect or equivalent role.\n- Proven experience designing or reviewing security architectures for large-scale, mission-critical systems with strict uptime, performance, and compliance requirements.\n- Experience working in multi-datacentre and DR-enabled environments, including understanding of security implications of failover, replication, and high availability.\n- Strong ability to collaborate with cross-functional teams (application, infrastructure, DevOps, network, operations) and influence secure design decisions.\n- Excellent written and verbal communication skills, with the ability to clearly articulate risks, options, and recommendations to both technical and non-technical stakeholders.\n- Prior involvement in modernization projects where legacy applications and integrations were migrated to more modern architectures while maintaining or improving security posture.\n- Experience in environments subject to regulatory, audit, or compliance requirements (e.g., ISO 27001, SOC 2, PCI DSS, or similar), with familiarity in preparing or supporting audits.</p>\n<p><strong>Secondary Skills:</strong>\n<strong>Technical Skills and Experience:</strong>\n- Exposure to zero-trust architecture concepts and their practical application in on-prem or hybrid environments.\n- Experience with policy-as-code and security-as-code approaches (e.g., using tools such as Open Policy Agent) for enforcing security controls consistently.\n- Familiarity with SRE and observability concepts (e.g., SLIs/SLOs, error budgets) and how security ties into reliability and operational dashboards.\n- Experience with data classification, data loss prevention (DLP), and privacy-by-design principles.</p>\n<p><strong>Certifications:</strong>\n- Security certifications such as CISSP, CISM, or SABSA that demonstrate strong security architecture or governance knowledge.\n- Technical security certifications such as Certified Cloud Security Professional (CCSP), GIAC (e.g., GCSA, GWEB), or vendor-specific security certifications.\n- Any formal training or certification in secure software development, DevSecOps, or application security testing.</p>\n<p><strong>Important Note:</strong>\nInterested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details. Please be aware that fraudsters may promise jobs with Reflections Info Systems for a fee. Reflections Info Systems never charges any fee for job opportunities. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent from our official HR email ID. For any clarification or alerts regarding this subject, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "10+ Years",
            "Security Architecture",
            "DevSecOps",
            "Kubernetes"
        ],
        "summary": "Security Architect to define and govern security architecture for on-premises enterprise platforms. Role involves designing and reviewing security controls across applications, data, and infrastructure."
    },
    {
        "job_title": "SALES SPECIALIST -AI",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/25744",
        "location": "Technopark",
        "closing_date": "20 Jan 2026",
        "job_description": "<h2>Sales Specialist - AI</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd</p>\n<p><strong>Location:</strong> SBC Module 15, 2nd Floor, Thejaswini Building, Technopark Phase 1, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.reizendretail.in</p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 20 Jan 2026</p>\n<p><strong>Job Published:</strong> 06 Dec 2025</p>\n<h3>Brief Description</h3>\n<p>We are hiring a Sales Specialist to lead the marketing initiatives for our AI products and services and drive business growth. This strategic role requires excellent communication with a great attitude and the ability to set and achieve sales targets. The ideal candidate will have good academics and a results-oriented mindset.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and implement a strategic sales plan to achieve company sales targets and objectives.</li>\n<li>Identify new opportunities and potential clients, actively prospecting and generating leads.</li>\n<li>Build and maintain strong relationships with key clients, understanding their needs and providing tailored solutions to meet their requirements.</li>\n<li>Develop, execute, and monitor marketing programs for our AI products and services across a variety of channels in line with the GTM strategy derived.</li>\n<li>Research the market, analyze trends, and provide advice on defining the organization's marketing strategy to effectively reach the target market.</li>\n<li>Collaborate with internal teams, including product and sales, to develop and monitor strategic marketing initiatives.</li>\n<li>Analyze and report on the performance and efficiency of marketing campaigns.</li>\n<li>Create marketing materials, such as sales and product collateral, while ensuring brand guidelines are met.</li>\n<li>Work with external agencies and vendors to execute marketing programs.</li>\n<li>Write, proofread, and edit creative and technical content across different mediums to support marketing initiatives.</li>\n<li>Provide expert advice on branding, positioning, communications, and other marketing issues.</li>\n<li>Give direction to marketing efforts, utilizing the most effective methods and tools.</li>\n<li>Stay updated on emerging trends and share best practices, fostering knowledge and insights.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Excellent Academics.</li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li>6–11 LPA (Competitive fixed salary &amp; Attractive performance-based incentives &amp; ESOPs)</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>B.Tech in Non-IT disciplines OR Bachelor’s/Master’s in Mathematics/Statistics OR Technical degree with MBA</li>\n</ul>\n<h3>Experience Required</h3>\n<ul>\n<li>0-3 years</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "AI",
            "Sales",
            "Marketing"
        ],
        "summary": "Seeking a Sales Specialist for AI products to drive business growth. Requires strong communication, sales target achievement, and marketing initiative leadership."
    },
    {
        "job_title": "QUALITY CONTROL MANAGER",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/25743",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Quality Control Manager</h2>\n<p><strong>Company:</strong> Yarab Technologies (P) Ltd\n<strong>Location:</strong> Module No: 2706, 7th Floor, Yamuna building, Phase-III Campus, Technopark, Kazhakootam , 695581\n<strong>Website:</strong> http://www.yrtechnologies.co.in\n<strong>Contact Email:</strong> jobs@yarabltd.co.uk\n<strong>Published Date:</strong> 05, Dec 2025\n<strong>Closing Date:</strong> 12, Dec 2025</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage an effective regulatory compliance program.</li>\n<li>Adhere to and maintain the integrity of the Quality Control Department's operational policies.</li>\n<li>Report to Management on compliance risks and issues through detailed reports, proactively.</li>\n<li>Create and manage effective action plans in response to audit discrepancies and compliance violations.</li>\n<li>Regularly audit operational areas, transactions, and communications.</li>\n<li>Assess company operations to determine compliance risk and suggest corrective action plans.</li>\n<li>Ensure all employees are educated on the latest regulations and processes.</li>\n<li>Resolve employee concerns about regulatory compliance.</li>\n<li>Serve as the Single Point of Contact (SPOC) for U.K Counterparts.</li>\n<li>Manage and develop initial and ongoing training programs.</li>\n<li>Create and submit Weekly and Monthly Reports.</li>\n<li>Manage the end-to-end lifecycle of insurance schemes, ensuring market relevance and profitability.</li>\n<li>Develop and maintain strong relationships with brokers, insurers, and stakeholders.</li>\n<li>Monitor scheme performance, analyzing key metrics to drive continuous improvement.</li>\n<li>Ensure all schemes comply with UK regulatory standards and industry best practices.</li>\n<li>Identify opportunities to innovate and expand the portfolio of insurance schemes.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Multitasker</li>\n<li>Excellent communication skills (both written and verbal)</li>\n<li>Goal Oriented</li>\n<li>Strong Leadership qualities</li>\n<li>Excellent knowledge of MS Office</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Quality Control",
            "Regulatory Compliance",
            "Insurance Schemes"
        ],
        "summary": "Manage regulatory compliance and insurance schemes. Ensure adherence to standards, train employees, and report on risks and performance."
    },
    {
        "job_title": "Senior Quality Control Analyst – Insurance Domain",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/25742",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Senior Quality Control Analyst – Insurance Domain</h2>\n<p><strong>Company:</strong> Yarab Technologies (P) Ltd\n<strong>Location:</strong> Module No: 2706, 7th Floor, Yamuna building, Phase-III Campus, Technopark, Kazhakootam , 695581\n<strong>Website:</strong> http://www.yrtechnologies.co.in\n<strong>Contact Email:</strong> jobs@yarabltd.co.uk</p>\n<p><strong>Closing Date:</strong> 12, Dec 2025\n<strong>Job Published:</strong> 05, Dec 2025</p>\n<h3>Job Summary</h3>\n<p>The Senior Quality Control Manager is responsible for maintaining quality excellence and compliance integrity across insurance operations. The role involves performing quality audits, compliance checks, performance analysis, and implementing improvement measures to ensure accuracy, efficiency, and adherence to regulatory and organizational standards.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead the Quality Control function across operational and compliance teams.</li>\n<li>Develop, implement, and continuously improve the QC policy framework, SOPs, and monitoring plans.</li>\n<li>Supervise daily QC checks on policy issuance, claims processing, reporting accuracy, and regulatory logs.</li>\n<li>Conduct periodic internal audits and prepare MIS reports for senior management.</li>\n<li>Identify process gaps and drive corrective or preventive actions.</li>\n<li>Coordinate with the Compliance Department to align QC controls with FCA / GFSC / FSA Seychelles expectations.</li>\n<li>Ensure version control and documentation integrity across product, claims, and broker correspondence.</li>\n<li>Train and mentor the QC team to maintain a culture of accuracy and accountability.</li>\n<li>Prepare quarterly quality dashboards and present findings to the Board or Executive Committee.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Graduate degree in Business, Risk, or related field (Master’s preferred).</li>\n<li>5–8 years of managerial experience in quality control / compliance / audit within financial services or insurance.</li>\n<li>Strong knowledge of control testing, audit planning, and process automation.</li>\n<li>Proficiency in Excel, CRM systems, and QA tools.</li>\n<li>Excellent analytical, documentation, and leadership skills</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "Quality Control",
            "Insurance",
            "Compliance"
        ],
        "summary": "Senior QC Analyst maintains quality and compliance in insurance operations. Responsibilities include audits, analysis, and implementing improvements for accuracy and adherence."
    },
    {
        "job_title": "Business Development Associate",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/25740",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Yarab Technologies (P) Ltd</h2>\n<p><strong>Contact Information:</strong>\nModule No: 2706, 7th Floor, Yamuna building, Phase-III Campus, Technopark, Kazhakootam , 695581\nhttp://www.yrtechnologies.co.in\nContact Email: jobs@yarabltd.co.uk</p>\n<p><strong>Closing Date:</strong> 12, Dec 2025\n<strong>Job Published:</strong> 05, Dec 2025</p>\n<h2>Role Overview:</h2>\n<p>Yarab Technologies (P) Ltd is looking for a proactive and customer-focused Insurance Sales Agent to handle inbound and outbound calls, provide exceptional service, and drive sales growth. The role involves resolving queries, promoting insurance products, and ensuring compliance with regulatory standards.</p>\n<h2>Key Responsibilities:</h2>\n<h3>Inbound &amp; Outbound Call Handling:</h3>\n<ul>\n<li>Manage calls from UK customers, addressing inquiries and providing accurate product information.</li>\n<li>Proactively follow up with potential and existing customers for cross-selling and up-selling opportunities.</li>\n</ul>\n<h3>Sales Achievement:</h3>\n<ul>\n<li>Achieve and exceed monthly and quarterly sales targets.</li>\n<li>Cross-sell and up-sell relevant insurance products or services to meet customer needs.</li>\n</ul>\n<h3>Customer Experience:</h3>\n<ul>\n<li>Maintain high levels of customer satisfaction through effective communication, active listening, and problem-solving.</li>\n<li>Resolve queries promptly and ensure a positive customer journey.</li>\n</ul>\n<h3>Record Management:</h3>\n<ul>\n<li>Accurately document customer interactions and transactions in the CRM system.</li>\n<li>Ensure data accuracy for reporting and compliance purposes.</li>\n</ul>\n<h3>Team Collaboration:</h3>\n<ul>\n<li>Work closely with team members to achieve overall sales and customer service goals.</li>\n<li>Share best practices and support colleagues to enhance team performance.</li>\n</ul>\n<h3>Compliance &amp; Quality Assurance:</h3>\n<ul>\n<li>Adhere to FCA regulations, Consumer Duty principles, and company policies during all interactions.</li>\n<li>Follow approved scripts and maintain high compliance scores in quality audits.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<h3>Skills &amp; Competencies:</h3>\n<ul>\n<li>Strong communication and interpersonal skills.</li>\n<li>Proven ability to handle sales objections and negotiate effectively.</li>\n<li>Customer-focused mindset with problem-solving abilities.</li>\n<li>Comfortable working in a target-driven environment.</li>\n<li>Basic technical proficiency with CRM systems and telephony platforms.</li>\n</ul>\n<h3>Qualifications &amp; Experience:</h3>\n<ul>\n<li>Experience in insurance sales, call center operations, or financial services (preferred).</li>\n<li>Knowledge of FCA guidelines and UK insurance market regulations (advantageous).</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Insurance Sales",
            "FCA Regulations",
            "CRM"
        ],
        "summary": "Seeking a customer-focused Insurance Sales Agent to handle calls, resolve queries, and drive sales. Must achieve targets while ensuring high customer satisfaction and compliance."
    }
]