[
    {
        "job_title": "Product Manager",
        "company": "WORKSENT TECHNOLOGIES PVT LTD",
        "url": "https://infopark.in/company-jobs/details/20795/164",
        "location": "Infopark",
        "closing_date": "21 Oct 2025",
        "job_description": "<h2>Product Manager</h2>\n<p><strong>About DeskDay</strong></p>\n<p>DeskDay is a fast-growing SaaS company redefining how Managed Service Providers (MSPs) deliver IT services. We’re building the next generation of Professional Services Automation; chat-first, AI-powered, and designed to cut through the noise so teams can focus on what matters most.</p>\n<p><strong>Role:</strong> Product Manager\n<strong>Experience:</strong> 2-4 years\n<strong>Location:</strong> Infopark, Kochi</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Collaborate with designers, architects, executives, and end-users to bring new product ideas to life.</li>\n<li>Lead product discovery, scenario envisioning, and UX/technical design for AI-driven features.</li>\n<li>Define product requirements, write user stories, and manage the backlog in Agile sprints.</li>\n<li>Partner with engineering to design, ship, and scale platform solutions.</li>\n<li>Conduct customer and market research to inform roadmap priorities.</li>\n<li>Deliver product demos, customer training, and partner enablement sessions.</li>\n<li>Capture market insights and shape product strategy for DeskDay’s AI ecosystem.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>2–3 years of experience in product management and project management.</li>\n<li>Proven track record shipping SaaS products (AI/automation or workflow solutions are a strong plus).</li>\n<li>Experience working in Agile with cross-functional engineering and design teams.</li>\n<li>Strong communication skills (able to present to executives and explain technical concepts clearly).</li>\n<li>Data-driven mindset: confident in defining metrics, analyzing usage data, and applying insights.</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (MBA a plus).</li>\n</ul>\n<h2>Preferred</h2>\n<ul>\n<li>Hands-on familiarity with AI/ML platforms and SaaS services.</li>\n<li>Experience in building agent frameworks, conversational UX, or automation platforms.</li>\n<li>Comfort with ambiguity and fast-moving environments; proactive and self-driven.</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@deskday.ai</p>",
        "tags": [
            "2-4 Years",
            "Product Management",
            "SaaS",
            "AI"
        ],
        "summary": "Product Manager needed for DeskDay to lead AI-driven SaaS product development. Responsibilities include discovery, requirements definition, and strategy for a next-gen automation platform."
    },
    {
        "job_title": "Full Stack Engineer",
        "company": "WORKSENT TECHNOLOGIES PVT LTD",
        "url": "https://infopark.in/company-jobs/details/20797/164",
        "location": "Infopark",
        "closing_date": "21 Oct 2025",
        "job_description": "<h2>Full Stack Engineer</h2>\n<p><strong>About DeskDay</strong></p>\n<p>DeskDay is a fast-growing SaaS company redefining how Managed Service Providers (MSPs) deliver IT services. We’re building the next generation of Professional Services Automation; chat-first, AI-powered, and designed to cut through the noise so teams can focus on what matters most.</p>\n<p><strong>Role:</strong> Full Stack Engineer\n<strong>Experience:</strong> 2-4 years\n<strong>Location:</strong> Infopark, Kochi</p>\n<p><strong>What you’ll bring (Must-Haves)</strong></p>\n<ul>\n<li><strong>Frontend:</strong> React</li>\n<li><strong>Backend:</strong> Node.js</li>\n<li><strong>Database:</strong> PostgreSQL</li>\n<li><strong>Languages:</strong> TypeScript</li>\n<li>Hands-on experience in designing and working with microservices</li>\n</ul>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Implement and maintain user interfaces for new and existing features</li>\n<li>Develop, integrate, and scale backend APIs to support platform functionality</li>\n<li>Collaborate with designers and developers to ensure seamless UI/UX consistency</li>\n<li>Optimize workflows and implement AI-driven solutions to automate and enhance product features</li>\n<li>Participate in daily stand-ups, sprint planning, and code reviews with the team</li>\n</ul>\n<p><strong>What we’re looking for</strong></p>\n<ul>\n<li>2–3 years of proven experience as a Full Stack Engineer</li>\n<li>Solid understanding of front-end and back-end best practices</li>\n<li>Ability to design, build, and maintain scalable services</li>\n<li>Strong problem-solving mindset and eagerness to learn</li>\n<li>Deeper understanding of design patterns and ability to identify use cases and use it wherever required.</li>\n<li>Ability to identify chokepoints and mitigate them.</li>\n<li>Strong database querying skills and query optimization skills.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at careers@deskday.ai</p>",
        "tags": [
            "2-4 Years",
            "React",
            "Node.js",
            "TypeScript"
        ],
        "summary": "Full Stack Engineer with 2-4 years experience at DeskDay in Kochi. Implement UIs, scale APIs, and optimize workflows using React, Node.js, and TypeScript."
    },
    {
        "job_title": "Automation Test Engineer",
        "company": "WORKSENT TECHNOLOGIES PVT LTD",
        "url": "https://infopark.in/company-jobs/details/20798/164",
        "location": "Infopark",
        "closing_date": "21 Oct 2025",
        "job_description": "<h2>Automation Test Engineer</h2>\n<p><strong>About DeskDay:</strong>\nDeskDay is a fast-growing SaaS company redefining how Managed Service Providers (MSPs) deliver IT services. We’re building the next generation of Professional Services Automation; chat-first, AI-powered, and designed to cut through the noise so teams can focus on what matters most.</p>\n<p><strong>Role:</strong> Automation Test Engineer</p>\n<p><strong>Experience:</strong> 3-4 years</p>\n<p><strong>Location:</strong> Infopark, Kochi</p>\n<p><strong>What You’ll Bring:</strong>\n- Expertise in Automation Tools: Playwright, Selenium, or Cypress\n- Strong Testing Framework Knowledge\n- Experience with Performance/Load Testing Tools\n- Familiarity with API and Mobile Testing\n- Scripting Skills: Proficient in Java, JavaScript, or Python</p>\n<p><strong>Key Responsibilities:</strong>\n- Design, develop, and execute manual and automated test cases\n- Perform functional, regression, integration, and UAT testing\n- Integrate automated tests into CI/CD pipelines for continuous testing and faster feedback\n- Maintain comprehensive test documentation (test cases, results, defect reports)\n- Collaborate closely with developers and product owners to prioritize and resolve issues</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at careers@deskday.ai</p>",
        "tags": [
            "3-4 Years",
            "Playwright",
            "Selenium",
            "Cypress"
        ],
        "summary": "Seeking an Automation Test Engineer with 3-4 years of experience in Playwright, Selenium, or Cypress. Responsibilities include designing, developing, and executing test cases and integrating them into CI/CD pipelines."
    },
    {
        "job_title": "AWS AI Engineer / Developer",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/20791/387",
        "location": "Infopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>AWS AI Engineer / Developer</h2>\n<p><strong>Location:</strong> Kochi/ Remote\n<strong>Experience:</strong> 3 - 6 years\n<strong>Shift Time:</strong> 12:30 pm to 09:30 pm IST or 01:30 pm to 10:30 pm IST\n<strong>Notice Period:</strong> 0 - 15 days</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Implement agentic AI workflows for clinical source verification, discrepancy detection, and intelligent query generation.</li>\n<li>Build and integrate LLM-powered agents using AWS Bedrock and open-source frameworks (LangChain, AutoGen).</li>\n<li>Develop event-driven pipelines utilizing AWS Lambda, Step Functions, and EventBridge.</li>\n<li>Optimize prompt engineering, retrieval-augmented generation (RAG), and multi-agent communication.</li>\n<li>Integrate AI agents with external systems through secure APIs.</li>\n<li>Experience in healthcare/Life Sciences AI solutions with regulatory compliance is preferred.</li>\n<li>Collaborate with data engineers for PHI/PII-safe ingestion pipelines.</li>\n<li>Monitor, test, and fine-tune AI workflows for accuracy, latency, and compliance.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Engineering, or a related field.</li>\n<li>3–6 years of experience in AI/ML engineering with hands-on LLM/agentic AI development.</li>\n<li>Strong coding skills in Python/TypeScript and experience with LangChain, LlamaIndex, or AutoGen.</li>\n<li>Familiarity with AWS AI services such as Bedrock, SageMaker, Textract, and Comprehend Medical.</li>\n<li>Experience in API integrations and event-driven architectures.</li>\n<li>Experience in healthcare/Life Sciences AI solutions with regulatory compliance is preferred.</li>\n<li>A problem-solving mindset with the ability to experiment and iterate quickly.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@alignminds.com.</p>",
        "tags": [
            "3-6 Years",
            "AWS Bedrock",
            "LangChain",
            "LLM"
        ],
        "summary": "Seeking an AWS AI Engineer with 3-6 years of experience in LLM/agentic AI development. Responsibilities include building AI workflows using AWS Bedrock and LangChain, with healthcare experience preferred. Apply at careers@alignminds.com."
    },
    {
        "job_title": "Machine Learning Engineer",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/20792/387",
        "location": "Infopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Machine Learning Engineer</h2>\n<p><strong>Location:</strong> Kochi/ Remote\n<strong>Experience:</strong> 3 - 6 years\n<strong>Shift Time:</strong> 12:30 pm to 09:30 pm IST or 01:30 pm to 10:30 pm IST\n<strong>Notice Period:</strong> 0 - 15 days</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and deploy ML models for Agentic AI use cases.</li>\n<li>Work with the AWS AI/ML ecosystem, including SageMaker, Bedrock, Lambda, Step Functions, S3, DynamoDB, and Kinesis.</li>\n<li>Preprocess and engineer features from structured, unstructured, and streaming data.</li>\n<li>Collaborate with data engineers to ensure high-quality, well-curated training datasets.</li>\n<li>Implement LLM fine-tuning, embeddings, and retrieval-augmented generation (RAG) pipelines.</li>\n<li>Evaluate and optimize models for accuracy, performance, scalability, and cost-efficiency.</li>\n<li>Integrate models into production applications and APIs.</li>\n<li>Work with MLOps teams to automate training, testing, deployment, and monitoring workflows.</li>\n<li>Perform experimentation, A/B testing, and model validation to ensure reliability.</li>\n<li>Document experiments, pipelines, and best practices for reproducibility.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>3–6 years of experience in ML engineering (adjust based on seniority).</li>\n<li>Strong programming skills in Python, including libraries like NumPy, Pandas, Scikit-learn, PyTorch, and TensorFlow.</li>\n<li>Solid understanding of the ML lifecycle, encompassing data preprocessing, training, evaluation, and deployment.</li>\n<li>Experience with AWS services for ML, such as SageMaker, Lambda, ECS/EKS, Step Functions, and Bedrock.</li>\n<li>Familiarity with large language models (LLMs), Natural Language Processing (NLP), and embeddings.</li>\n<li>Strong knowledge of APIs and microservice deployment.</li>\n<li>Experience with ML pipeline orchestration tools (e.g., Airflow, Kubeflow, MLflow).</li>\n<li>Understanding of data versioning, experiment tracking, and model registry concepts.</li>\n<li>Proficiency in SQL/NoSQL databases and vector databases (e.g., Weaviate, Pinecone, FAISS).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@alignminds.com.</p>",
        "tags": [
            "3-6 Years",
            "AWS",
            "Python",
            "LLMs"
        ],
        "summary": "Seeking an ML Engineer with 3-6 years of experience to design, develop, and deploy ML models using AWS. Responsibilities include LLM implementation, data engineering, and MLOps."
    },
    {
        "job_title": "Senior AWS Solutions/AI Architect",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/20793/387",
        "location": "Infopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Senior AWS Solutions/AI Architect</h2>\n<p><strong>Location:</strong> Kochi / Remote</p>\n<p><strong>Experience:</strong> 3 - 6 years</p>\n<p><strong>Shift Time:</strong> 12:30 PM to 09:30 PM IST or 01:30 PM to 10:30 PM IST</p>\n<p><strong>Notice Period:</strong> 0 - 15 days</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead architecture design for agentic AI systems leveraging AWS services (Bedrock, SageMaker, Lambda, Step Functions, EventBridge, OpenSearch, DynamoDB).</li>\n<li>Define multi-agent orchestration strategies for clinical data workflows, source verification, and discrepancy resolution.</li>\n<li>Evaluate trade-offs between LLM-based reasoning, rules engines, and hybrid AI architectures.</li>\n<li>Experience in healthcare/Life Sciences AI solutions with regulatory compliance preferred.</li>\n<li>Mentor AI engineers, developers, and DevOps teams on agent-based architectures.</li>\n<li>Collaborate with clinical SMEs, compliance teams, and sponsors to align technical design with business outcomes.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor’s/Master’s in Computer Science, AI, or related field (PhD a plus).</li>\n<li>8–12 years in AI/ML engineering with 3–5 years in cloud-native AI architecture.</li>\n<li>Hands-on experience with AWS AI stack (Bedrock, SageMaker, Comprehend Medical, Textract, Kendra, Lex).</li>\n<li>Strong understanding of agentic AI frameworks (LangChain, LlamaIndex, Haystack, CrewAI, AutoGen).</li>\n<li>Proven expertise in workflow orchestration (Step Functions, Airflow, Temporal) and multi-agent pipelines.</li>\n<li>Experience in healthcare/Life Sciences AI solutions with regulatory compliance.</li>\n<li>Strong leadership, stakeholder communication, and solution governance skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@alignminds.com</p>",
        "tags": [
            "3-6 Years",
            "AWS",
            "AI Architecture",
            "Agentic AI"
        ],
        "summary": "Seeking a Senior AWS Solutions/AI Architect with 3-6 years of experience to design agentic AI systems on AWS. Responsibilities include leading architecture, defining orchestration strategies, and mentoring teams."
    },
    {
        "job_title": "UI Developer (Front-End)-2 Years",
        "company": "GALTech Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20803/189",
        "location": "Infopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>UI Developer (Front-End)</h2>\n<p>We are looking for a Senior UI Developer (Front End) to join our team and help us build the next generation of user interfaces. In this role, you will be responsible for designing, developing, and implementing high-quality, user-friendly interfaces for our products.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Design, develop, and implement high-quality, user-friendly interfaces.</li>\n<li>Work closely with other members of the team to ensure that our interfaces are aligned with our business goals and meet the needs of our users.</li>\n<li>Stay current with industry trends and best practices in front end development.</li>\n<li>Collaborate with other teams to ensure that our interfaces are integrated with other systems and components.</li>\n</ul>\n<h3>Skills and Requirements</h3>\n<ul>\n<li>2+ Years of experience in UI development.</li>\n<li>Strong understanding of HTML, CSS, JavaScript and Wordpress.</li>\n<li>Experience with React will be considered an added advantage.</li>\n<li>Experience with user interface design principles and best practices.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Maintain high standards of code quality and ensure compliance with industry best practices.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and collaboration skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@galtech.org</p>",
        "tags": [
            "2+ Years",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "summary": "Seeking a UI Developer with 2+ years of experience in front-end development. Responsibilities include designing and implementing user interfaces using HTML, CSS, and JavaScript."
    },
    {
        "job_title": "Jr. Client Coordinator – Immigration Services",
        "company": "Unilaw Global Private Limited",
        "url": "https://infopark.in/company-jobs/details/20790/496",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Jr. Client Coordinator – Immigration Services</h2>\n<p>We are seeking a detail-oriented and proactive Jr. Client Coordinator to manage client interactions and documentation processes for U.S. immigration cases. The ideal candidate will serve as a bridge between clients and our internal teams, ensuring smooth communication, accurate document collection, and timely case processing. Exceptional proficiency in English communication (spoken and written) is essential for this role, as you will interact with international clients and handle sensitive documentation.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Serve as the primary point of contact for clients throughout the immigration process.</li>\n<li>Collect, review, and organize required documents and information based on specific U.S. visa categories (H-1B, L-1, B1/B2, etc.).</li>\n<li>Communicate clearly with clients to explain requirements, timelines, and process updates.</li>\n<li>Coordinate with internal legal and operations teams to ensure accuracy and compliance in submissions.</li>\n<li>Maintain up-to-date case records and document trackers using internal systems.</li>\n<li>Ensure all client data is handled with confidentiality and professionalism.</li>\n<li>Follow up with clients for missing documents or clarifications in a timely manner.</li>\n<li>Assist in preparing status reports and supporting documentation for management review.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in Business Administration, English, Communications, or a related field.</li>\n<li>Excellent command of English – both written and verbal.</li>\n<li>Strong interpersonal skills and professional telephone/email etiquette.</li>\n<li>High attention to detail and organizational skills.</li>\n<li>Ability to handle multiple cases simultaneously and meet deadlines.</li>\n<li>Familiarity with U.S. immigration processes or document handling will be an added advantage.</li>\n<li>Proficiency in MS Office tools (Word, Excel, Outlook); experience with CRM or document management software is a plus.</li>\n</ul>\n<h3>Preferred Qualities:</h3>\n<ul>\n<li>A positive, client-focused attitude with the ability to handle inquiries patiently and professionally.</li>\n<li>Self-motivated, responsible, and able to work effectively in a team-based environment.</li>\n<li>Eagerness to learn about global mobility and immigration operations.</li>\n<li>Male candidates preferred.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@unilawtech.com</p>",
        "tags": [
            "0-1 Years",
            "Client Coordination",
            "Immigration Services",
            "Documentation"
        ],
        "summary": "Seeking a detail-oriented Jr. Client Coordinator for U.S. immigration cases. Responsibilities include client communication, document management, and case processing coordination."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Fine Destination",
        "url": "https://infopark.in/company-jobs/details/20794/497",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Business Development Executive (Study Abroad)</h2>\n<p><strong>Office Location:</strong> Marine Drive, Kochi</p>\n<p><strong>Experience:</strong> Minimum 3 years in Business Development / Education Consulting</p>\n<h3>About Knowledge Bazar:</h3>\n<p>Knowledge Bazar is a dynamic and growing study-abroad startup dedicated to helping students achieve their global education goals. We collaborate with colleges, universities, and educational institutions to create impactful career opportunities and international learning experiences.</p>\n<h3>Job Overview:</h3>\n<p>We are seeking a result-oriented Business Development Executive with at least 3 years of experience in the education, study abroad, or institutional partnership domain. The ideal candidate will leverage their professional network to build partnerships with colleges and institutes, identify business opportunities, and drive lead generation and conversions. The role involves travel within and around Kochi.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Identify, approach, and build partnerships with colleges, universities, and educational institutions.</li>\n<li>Leverage existing contacts to create business opportunities and increase brand presence for Knowledge Bazar.</li>\n<li>Generate high-quality leads and convert them into confirmed business.</li>\n<li>Maintain strong relationships with institutional stakeholders, counsellors, and decision-makers.</li>\n<li>Conduct meetings, presentations, and seminars to promote study-abroad programs.</li>\n<li>Collaborate with internal teams to develop partnership proposals and marketing collaterals.</li>\n<li>Track performance metrics and report business progress periodically.</li>\n<li>Represent the company at educational fairs, seminars, and events (local &amp; regional travel involved).</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree or higher, preferably in Business, Marketing, or Education.</li>\n<li>Minimum 3 years of experience in business development or institutional outreach (education/study abroad industry preferred).</li>\n<li>Proven ability to generate and convert leads independently.</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li>Ability to build and maintain long-term relationships with academic institutions.</li>\n<li>Self-motivated, target-driven, and open to frequent travel within Kerala (especially around Kochi).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@finedestination.co.in</p>",
        "tags": [
            "3+ Years",
            "Business Development",
            "Study Abroad",
            "Partnerships"
        ],
        "summary": "Seeking a Business Development Executive for a study abroad startup in Kochi. Requires 3+ years of experience in partnerships and lead generation within the education sector."
    },
    {
        "job_title": "Sales Outreach Expert – US Market (1-3 Years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/20800/109",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Sales Outreach Expert – US Market</h2>\n<p><strong>Location:</strong> Kakkanad, Kochi (Work From Office)\n<strong>Shift:</strong> 5 PM – 2 AM IST</p>\n<p><strong>Role Summary:</strong>\nWe are looking for a motivated professional with 1–3 years of experience in outbound cold calling, specifically to US-based leads. The primary responsibility is to initiate meaningful conversations with potential leads, understand their needs, and introduce our IT services effectively.</p>\n<p><strong>Key Responsibilities:</strong>\n- Make outbound cold calls to businesses in the US market\n- Engage decision-makers and introduce company offerings\n- Maintain call records and follow-up schedules\n- Support lead generation and qualification as needed\n- Coordinate with internal teams for next steps</p>\n<p><strong>Requirements:</strong>\n- 1–3 years of experience in outbound cold calling (preferably US market)\n- Strong communication skills in English (verbal &amp; written)\n- Prior experience in the IT services domain is a plus\n- Comfortable working in a night shift (US time zone)</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@newagesysindia.com</p>",
        "tags": [
            "1-3 Years",
            "Outbound Cold Calling",
            "US Market",
            "Lead Generation"
        ],
        "summary": "Seeking a Sales Outreach Expert with 1-3 years of US outbound cold calling experience. Responsibilities include engaging leads, understanding needs, and introducing IT services."
    },
    {
        "job_title": "SEO Expert (1-2 Years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/20801/109",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>SEO Expert</h2>\n<p><strong>Location:</strong> Infopark, Kochi\n<strong>Experience:</strong> 1-2 Years</p>\n<h3>About Us:</h3>\n<p>NewAgeSysIT, a division of NewAgeSys, Inc. (est. 1994), is a fast-growing digital solutions company based in Princeton, NJ. We serve global clients across industries like healthcare, logistics, education, and more.</p>\n<h3>Role Overview:</h3>\n<p>We’re looking for a results-driven SEO Expert to lead our organic growth and lead generation efforts. You’ll work closely with content, development, and marketing teams to execute effective SEO strategies.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Conduct keyword research and optimize web content</li>\n<li>Implement On-page, Off-page, and Technical SEO best practices</li>\n<li>Collaborate with developers on site performance and Technical SEO</li>\n<li>Build backlinks and manage Off-page strategies</li>\n<li>Track performance metrics and generate SEO reports</li>\n<li>Guide and mentor junior team members</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>1+ years of hands-on SEO experience</li>\n<li>Strong knowledge of SEO tools (GA, Search Console, Ahrefs, etc.)</li>\n<li>Familiarity with WordPress, HTML/CSS/JS, and CMS platforms</li>\n<li>Excellent analytical and leadership skills</li>\n</ul>\n<h3>Bonus Skills:</h3>\n<ul>\n<li>Local SEO, schema markup, CRO, and content marketing experience</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work with a global team on cutting-edge projects</li>\n<li>Opportunity to lead and grow a team</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@newagesysindia.com</p>",
        "tags": [
            "1-2 Years",
            "SEO",
            "Google Analytics",
            "Ahrefs"
        ],
        "summary": "Seeking an SEO Expert with 1-2 years of experience to drive organic growth. Responsibilities include keyword research, on-page/off-page/technical SEO, and performance reporting."
    },
    {
        "job_title": "Content Writer (2-4 Years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/20802/109",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Job Title: Content Writer</h2>\n<p><strong>Location:</strong> Kakkanad, Kochi, Kerala\n<strong>Shift Timing:</strong> 11 PM - 8 PM IST</p>\n<h3>What We’re Looking For:</h3>\n<ul>\n<li><strong>Experience:</strong> 2+ years of experience in content writing, preferably within the IT/tech domain.</li>\n<li><strong>Content Standards:</strong> Familiarity with Google Helpful Content, E-A-T, and E-E-A-T updates.</li>\n<li><strong>Technical Skills:</strong> Experience in SEO writing, Keyword optimization, technical writing, and sales documents.</li>\n<li><strong>Content Versatility:</strong> Ability to create content for both marketing and internal documentation purposes.</li>\n<li><strong>Core Skills:</strong> Excellent writing, editing, and research skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@newagesysindia.com.</p>",
        "tags": [
            "2-4 Years",
            "Content Writing",
            "SEO",
            "Technical Writing"
        ],
        "summary": "Seeking a Content Writer with 2-4 years of experience in IT/tech. Responsibilities include SEO writing, technical documentation, and marketing content creation."
    },
    {
        "job_title": "Application Support Engineer - Internship",
        "company": "TutorComp Infotech (I) Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/20805/44",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Application Support Engineer - Internship</h2>\n<h3>Job Description</h3>\n<p>We are looking for an enthusiastic Application Support Engineer to join our team. Please find the details as mentioned below:</p>\n<ul>\n<li>Identifying hardware and software solutions.</li>\n<li>Troubleshooting technical issues.</li>\n<li>Diagnosing and repairing faults.</li>\n<li>Resolving network issues.</li>\n<li>Installing and configuring hardware and software.</li>\n<li>Speaking to customers to quickly get to the root of their problem.</li>\n<li>Providing timely and accurate customer feedback.</li>\n<li>Talking customers through a series of actions to resolve a problem.</li>\n<li>Following up with clients to ensure the problem is resolved.</li>\n<li>Replacing or repairing the necessary parts.</li>\n<li>Supporting the roll-out of new applications.</li>\n<li>Providing support in the form of procedural documentation.</li>\n<li>Managing multiple cases at one time.</li>\n<li>Testing and evaluating new technologies.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Working knowledge of office automation products and computer peripherals, like printers and scanners, and -cellular devices.</li>\n<li>Hands-on experience with Windows/Linux/Mac OS environments.</li>\n<li>Knowledge of managing network equipment’s &amp; anti-virus programs.</li>\n<li>Remote troubleshooting for End-user issues (Software and Hardware).</li>\n<li>Walking customers through installing applications and computer peripherals.</li>\n<li>Proven work experience as a Desktop Support Engineer or Technical Support Engineer or similar role.</li>\n<li>Experience – 6 months</li>\n<li>Good communication skills in English.</li>\n<li>Good time-management skills</li>\n<li>Location: Info Park, Cochin</li>\n<li>CTC: Best in the industry</li>\n</ul>\n<h3>About Us</h3>\n<p>TutorComp is an online tutoring global leader providing personalized tutors all over the world. We enable students across the World to learn, excel and stay ahead of the knowledge and innovation curve. Our exceedingly qualified and expert tutors enable students to outperform and deliver outstanding grades. Our mission is to make learning easily accessible to students, and to leverage technology and global talent. Our global operations are supported through an extensive network at various worldwide markets of United States, United Kingdom, Hong Kong, Singapore, Australia, France, India, UAE (Abu Dhabi, Ajman, Dubai, and Sharjah), Kuwait, Bahrain, Qatar, Saudi Arabia and Malaysia.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tutorcomp.com</p>",
        "tags": [
            "6 Months Experience",
            "Troubleshooting",
            "Windows/Linux/Mac OS",
            "Customer Support"
        ],
        "summary": "Seeking an enthusiastic Application Support Engineer intern. Responsibilities include troubleshooting technical issues, providing customer support, and testing new technologies."
    },
    {
        "job_title": "LinkedIn Branding Specialist",
        "company": "MarketBytes WebWorks Private Limited",
        "url": "https://infopark.in/company-jobs/details/20799/460",
        "location": "Infopark",
        "closing_date": "17 Nov 2025",
        "job_description": "<h2>LinkedIn Branding Specialist</h2>\n<p>At MarketBytes WebWorks Pvt Ltd, we help brands, leaders, and organizations craft powerful digital identities. As our client base grows, we’re looking for a LinkedIn Branding Specialist to join our dynamic team and take charge of creating impactful personal and business branding strategies on LinkedIn.</p>\n<p>If you live and breathe LinkedIn, love storytelling, and know how to turn posts into conversations and conversations into opportunities, this role is for you!</p>\n<h3>What You’ll Do:</h3>\n<ul>\n<li>Plan, strategize, and manage LinkedIn pages for multiple clients (personal &amp; business).</li>\n<li>Optimize profiles for better visibility and credibility.</li>\n<li>Develop content strategies aligned with each client’s goals.</li>\n<li>Write engaging posts, captions, and thought-leadership content.</li>\n<li>Coordinate with the design team for visuals and carousels.</li>\n<li>Engage with audiences, build communities, and manage comments/interactions.</li>\n<li>Track analytics, report performance, and refine strategies.</li>\n<li>Stay updated with LinkedIn trends, algorithm updates, and content best practices.</li>\n</ul>\n<h3>What We’re Looking For:</h3>\n<ul>\n<li>1–3 years of experience in LinkedIn marketing, branding, or social media management.</li>\n<li>Strong grasp of B2B communication and personal branding.</li>\n<li>Excellent copywriting and storytelling skills.</li>\n<li>Basic understanding of design tools (Canva/Figma) or creative direction.</li>\n<li>Analytical mindset with attention to detail.</li>\n<li>Passion for digital growth, networking, and staying ahead of trends.</li>\n</ul>\n<h3>Why MarketBytes?</h3>\n<ul>\n<li>Work with a creative and growing team in a fast-evolving digital agency.</li>\n<li>Exposure to diverse industries, from startups to established brands.</li>\n<li>Opportunities for upskilling and personal growth.</li>\n<li>Creative freedom and a collaborative work culture.</li>\n</ul>\n<h3>Contact Information:</h3>\n<p>Interested? Send your portfolio and resume to hr@marketbyteswebworks.com with the subject line: “Application – LinkedIn Branding Specialist”</p>\n<p>Let’s build brands that make an impact. If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@marketbyteswebworks.com.</p>",
        "tags": [
            "1-3 Years",
            "LinkedIn",
            "Branding",
            "Content Strategy"
        ],
        "summary": "Seeking a LinkedIn Branding Specialist to create impactful personal and business branding strategies. Responsibilities include content strategy, copywriting, community engagement, and analytics for diverse clients."
    },
    {
        "job_title": "ACCOUNTANT",
        "company": "TouchWorld Technology",
        "url": "https://infopark.in/company-jobs/details/20804/352",
        "location": "Infopark",
        "closing_date": "19 Jan 2026",
        "job_description": "<h2>Accountant</h2>\n<p>We are looking for a detail-oriented and proactive Accountant with hands-on experience in Tally and accounting software to join our dynamic team. The ideal candidate should have a strong understanding of accounting principles, financial record maintenance, and day-to-day bookkeeping operations.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage day-to-day accounting operations and ensure accurate financial record keeping.</li>\n<li>Handle accounts payable/receivable, journal entries, and bank reconciliations.</li>\n<li>Prepare and maintain invoices, bills, and vouchers systematically.</li>\n<li>Assist in preparing monthly, quarterly, and annual financial reports.</li>\n<li>Ensure compliance with statutory requirements such as GST, TDS, and other filings.</li>\n<li>Support audits by providing relevant data and documentation.</li>\n<li>Monitor cash flow, expense reports, and budget utilization.</li>\n<li>Collaborate with the management team to provide financial insights and reports.</li>\n<li>Maintain confidentiality of financial data and ensure data accuracy.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in Commerce, Finance, or Accounting.</li>\n<li>Minimum 1 year of experience in accounting or a similar role.</li>\n<li>Proficiency in Tally and accounting software is mandatory.</li>\n<li>Strong understanding of accounting principles and financial reporting.</li>\n<li>Experience in GST filing, invoice management, and reconciliation.</li>\n<li>Excellent attention to detail and numerical accuracy.</li>\n<li>Good communication and organizational skills.</li>\n<li>Ability to manage multiple tasks and meet deadlines efficiently.</li>\n</ul>\n<h3>Nice to Have (Advantages):</h3>\n<ul>\n<li>Experience in payroll processing and financial statement preparation.</li>\n<li>Familiarity with Excel-based reporting and data analysis.</li>\n<li>Knowledge of ERP or cloud-based accounting tools.</li>\n</ul>\n<p><strong>Job Type:</strong> Onsite, Full-time\n<strong>Location:</strong> Infopark, Cochin\n<strong>Experience:</strong> Minimum 1 Year\n<strong>Contact:</strong> Send CV: hrteam@touchworldtechnology.com</p>\n<p><strong>IMMEDIATE JOINER</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hrteam@touchworldtechnology.com</p>",
        "tags": [
            "1+ Years",
            "Tally",
            "Accounting Software",
            "GST Filing"
        ],
        "summary": "Detail-oriented Accountant needed with Tally and accounting software proficiency. Responsibilities include financial record keeping, reporting, and compliance for an onsite, full-time role."
    },
    {
        "job_title": "System / Server Admin",
        "company": "Nestsoft TechnoMaster PVT LTD",
        "url": "https://infopark.in/company-jobs/details/20796/439",
        "location": "Infopark",
        "closing_date": "17 Oct 2026",
        "job_description": "<h1>Server / System Administrator</h1>\n<p><strong>Nestsoft TechnoMaster PVT Ltd</strong> is seeking an experienced Server / System Administrator to provide expert training and consulting on server and system management. The role involves delivering high-quality, practical guidance to students and professionals through online sessions on an hourly basis.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Conduct online training sessions on server administration, system management, and related technologies.</li>\n<li>Provide real-time consulting and troubleshooting support for clients and trainees.</li>\n<li>Prepare training materials, documentation, and practical exercises.</li>\n<li>Mentor students and professionals to develop hands-on skills in server and system administration.</li>\n<li>Share industry best practices and solutions for server and network environments.</li>\n</ul>\n<h2>Requirements:</h2>\n<ul>\n<li>Proven expertise as a Server / System Administrator with extensive practical experience.</li>\n<li>Strong knowledge of Windows Server, Linux/Unix systems, virtualization, networking, and cloud technologies.</li>\n<li>Experience in training or mentoring is highly desirable.</li>\n<li>Excellent communication skills for online teaching and consulting.</li>\n<li>Ability to provide flexible, hourly-based sessions.</li>\n</ul>\n<h2>How to Apply:</h2>\n<p>Interested candidates can apply via email at: <strong>hr@nestsoft.com</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@nestsoft.com</strong></p>",
        "tags": [
            "5+ Years",
            "Server Administration",
            "Linux/Unix",
            "Windows Server"
        ],
        "summary": "Experienced Server/System Administrator needed for online training and consulting. Deliver practical guidance on server management and related technologies hourly."
    },
    {
        "job_title": "Finance Trainee",
        "company": "Analyse Digital Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24375",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Finance Trainee</h2>\n<p><strong>Company:</strong> Analysed Digital Business Solutions (P) Ltd\n<strong>Location:</strong> Padmanabha, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> http://www.analysedigital.com</p>\n<p><strong>Contact Email:</strong> careers@analysedigital.com</p>\n<p><strong>Closing Date:</strong> 31, Oct 2025\n<strong>Job Published:</strong> 18, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a proactive and detail-oriented candidate to join our digital agency. This role involves handling daily financial operations, client billing, budgeting, and reporting within a fast-paced, creative environment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage day-to-day financial transactions and bookkeeping using Tally.</li>\n<li>Ensure accurate and timely client billing, tracking receivables, and coordinating with account managers for payment follow-ups.</li>\n<li>Oversee payroll processing, vendor payments, and employee reimbursements.</li>\n<li>Work closely with account managers to prepare budgets for client projects.</li>\n<li>Track project expenses, analyse variances, and provide insights to optimize profitability.</li>\n<li>Support in client billing management and monitor receivables in coordination with the client servicing team.</li>\n<li>Generate monthly, quarterly, and annual financial reports using Tally.</li>\n<li>Provide P&amp;L, budget forecasts, and cash flow statements with insights for strategic decisions.</li>\n<li>Perform revenue and cost analysis to support agency growth initiatives.</li>\n<li>Ensure compliance with local financial regulations, including timely tax filings.</li>\n<li>Maintain accurate records for audits, assist with annual audit processes, and liaise with auditors.</li>\n<li>Prepare and submit necessary tax filings and manage GST compliance.</li>\n<li>Recommend process improvements and leverage Tally to streamline accounting operations.</li>\n<li>Stay updated on relevant financial regulations and agency industry standards.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Finance, Accounting, or a related field.</li>\n<li>0-1 years of finance or accounting experience, with a strong focus on Tally software.</li>\n<li>Knowledge in TDS &amp; GST compliance.</li>\n<li>Proficiency in Tally and advanced Excel skills for data analysis.</li>\n<li>Strong analytical skills and attention to detail.</li>\n<li>Familiarity with other financial tools is a plus.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Tally",
            "GST",
            "Excel"
        ],
        "summary": "Finance Trainee role managing daily financial operations, client billing, budgeting, and reporting. Requires Tally proficiency and 0-1 years of experience."
    },
    {
        "job_title": "Sr. SE - Java & C#/.NET",
        "company": "Ecesis Care (P) Ltd",
        "url": "https://technopark.org/job-details/24372",
        "location": "Technopark",
        "closing_date": "23 Oct 2025",
        "job_description": "<h2>Senior Software Engineer - Java &amp; C#/.NET</h2>\n<p><strong>Company:</strong> ECESIS CARE (P) Ltd\n<strong>Location:</strong> 4th FLOOR, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> https://www.ecesistech.com\n<strong>Closing Date:</strong> 23, Oct 2025\n<strong>Job Published:</strong> 18, Oct 2025\n<strong>Contact Email:</strong> amrithas@ecesistech.com</p>\n<h3>About Us:</h3>\n<p>At ECESIS, we have built a strong reputation over the years as a trusted partner in management consulting and talent acquisition, with a specialized focus on the advanced manufacturing sector. Our success is driven by our ability to consistently deliver world-class, high-quality talent, particularly in the areas of precision engineering, assembly line operations, and other skilled manpower across diverse industrial domains. Among our esteemed clients is a listed Japanese company that is set to begin its operations in Technopark, Thiruvananthapuram, further reinforcing our standing as a premier recruitment partner in the region.</p>\n<p>We are seeking a versatile and skilled Software Engineer to join our dynamic multinational team. This role requires a developer with a strong foundation in both backend and desktop application development. The ideal candidate will possess approximately 3 years of experience in Java and the Spring framework for building robust backend services, and around 2 years of experience developing desktop applications using C# .NET with WPF. A solid understanding of front-end technologies like JavaScript and CSS is also required to contribute to various layers of our applications.</p>\n<p><strong>MANDATORY SKILLS:</strong> Java Spring Boot, .NET Framework, C# with WPF, HTML, CSS, SQL/NoSQL Databases</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable backend services &amp; APIs using Java (Spring Boot).</li>\n<li>Build and enhance Windows desktop applications using C# .NET (WPF).</li>\n<li>Collaborate with cross-functional and multinational teams to deliver end-to-end software solutions.</li>\n<li>Develop responsive UIs for web and desktop apps using JavaScript, HTML, CSS.</li>\n<li>Write clean, efficient, and reusable code in Java and C#.</li>\n<li>Handle application lifecycle — coding, debugging, testing, and performance optimization.</li>\n<li>Integrate and manage databases, both relational and NoSQL.</li>\n<li>Ensure UI/UX feasibility, system security, and data protection best practices.</li>\n<li>Participate in code reviews to maintain high standards and share knowledge.</li>\n<li>Troubleshoot and upgrade existing software for stability and performance.</li>\n<li>Contribute across all phases of SDLC — from concept to deployment.</li>\n</ul>\n<h3>Key Requirements (Concise Summary):</h3>\n<p><strong>Technical Skills (Mandatory):</strong></p>\n<ul>\n<li>~3 years backend development in Java (Spring Boot, Spring MVC)</li>\n<li>~2 years in C# .NET (WPF desktop apps)</li>\n<li>Proficient in JavaScript, HTML5, CSS3</li>\n<li>Strong OOP and REST API experience</li>\n<li>Skilled with SQL databases (PostgreSQL/MySQL/SQL Server) &amp; ORMs (Hibernate, Entity Framework)</li>\n<li>Familiar with Git and Agile practices</li>\n</ul>\n<p><strong>Nice-to-Have:</strong></p>\n<ul>\n<li>Modern JS frameworks (Vue.js/React/Angular)</li>\n<li>Cloud platforms (AWS/Azure/GCP)</li>\n<li>ASP.NET, Docker/Kubernetes, CI/CD tools, RabbitMQ/Kafka</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Leadership &amp; mentoring ability</li>\n<li>Excellent communication &amp; client interaction skills</li>\n<li>Strong analytical, problem-solving, and teamwork mindset</li>\n<li>Ownership, accountability, and adaptability</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>Bachelor’s/Master’s in Computer Science, Engineering, or related field</li>\n</ul>\n<h3>Benefits Highlights:</h3>\n<ul>\n<li>Health &amp; life insurance</li>\n<li>National Pension Scheme option</li>\n<li>Flexible work &amp; generous leave policy</li>\n<li>Team events &amp; performance bonuses</li>\n<li>Career growth aligned with individual goals</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates can send their updated resume to amrithas@ecesistech.com with the subject line: \"Application for Software Engineer - Java &amp; C#/.NET\".</p>",
        "tags": [
            "3+ Years",
            "Java Spring Boot",
            "C# .NET WPF",
            "JavaScript"
        ],
        "summary": "Seeking a Software Engineer with Java/Spring Boot for backend and C#/.NET/WPF for desktop apps. Requires 3 years Java and 2 years C# experience."
    },
    {
        "job_title": "Sr. Marketing Executive",
        "company": "Ecesis Care (P) Ltd",
        "url": "https://technopark.org/job-details/24371",
        "location": "Technopark",
        "closing_date": "23 Oct 2025",
        "job_description": "<h2>Sr. Marketing Executive</h2>\n<p><strong>Company:</strong> ECESIS CARE (P) Ltd\n<strong>Location:</strong> 4th FLOOR, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> https://www.ecesistech.com</p>\n<p><strong>Job Published:</strong> 18, Oct 2025\n<strong>Closing Date:</strong> 23, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly motivated and ambitious Marketing Executive with 1 to 3 years of experience to join our team. This is a high-impact role where you will report directly to senior management, working as a key individual contributor with the unique opportunity to create and lead our marketing team as we grow. You will be instrumental in driving our marketing initiatives, taking on significant responsibilities, and tackling the exciting challenges of exponential business growth. This role offers a chance to work in a vibrant, cross-cultural environment, crafting and executing strategies for a global audience with a special focus on the Japanese market.</p>\n<h3>Requirements</h3>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li><strong>Education:</strong> A bachelor’s degree in any field with a Master’s degree in marketing, Business Administration, Communications, or a related field.</li>\n<li><strong>Experience:</strong> 1-3 years of proven experience in a B2B marketing role, preferably within the Technology, SaaS, or IT Services industry.</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Strategy &amp; Execution:</strong> Assist in developing and implementing comprehensive B2B marketing strategies to increase brand awareness, drive lead generation, and support sales objectives.</li>\n<li><strong>Digital Marketing:</strong> Manage and execute campaigns across various digital channels including SEO/SEM, email marketing, social media (especially LinkedIn), and content marketing.</li>\n<li><strong>Content Creation:</strong> Develop compelling marketing collateral such as blog posts, case studies, whitepapers, social media updates, and website content tailored to a global B2B audience.</li>\n<li><strong>Japan Market Focus:</strong><ul>\n<li>Conduct market research to understand the nuances, trends, and competitive landscape of the Japanese market.</li>\n<li>Adapt and localize marketing campaigns and materials to resonate with Japanese business culture and audience preferences.</li>\n<li>Collaborate with the sales team to generate market-specific leads and support their outreach efforts in Japan.</li>\n</ul>\n</li>\n<li><strong>Analytics &amp; Reporting:</strong> Monitor, analyze, and report on the performance of marketing campaigns using tools like Google Analytics, CRM dashboards, and other analytics platforms. Use data-driven insights to optimize future strategies.</li>\n<li><strong>Collaboration:</strong> Work closely with cross-functional teams, including sales, product development, and technical experts, to ensure a cohesive and effective marketing approach.</li>\n<li><strong>Lead Nurturing:</strong> Manage marketing automation platforms to nurture leads through the sales funnel, ensuring a smooth transition from marketing-qualified leads (MQLs) to sales-qualified leads (SQLs).</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Must-Have Skills:</strong></p>\n<ul>\n<li><strong>Digital Marketing Proficiency:</strong> Strong, hands-on knowledge of core digital marketing concepts and tools, including:<ul>\n<li>SEO/SEM (Google Ads, keyword research)</li>\n<li>Social Media Marketing (LinkedIn, etc.)</li>\n<li>Email Marketing &amp; Automation (e.g., HubSpot, Marketo, Mailchimp)</li>\n<li>Content Management Systems (e.g., WordPress)</li>\n</ul>\n</li>\n<li><strong>Content &amp; Communication:</strong> Excellent written and verbal communication skills in English, with a flair for creating engaging and professional B2B content.</li>\n<li><strong>Analytical Mindset:</strong> Ability to analyze data, interpret metrics, and make data-driven decisions. Experience with Google Analytics is essential.</li>\n<li><strong>Proactive &amp; Ownership Attitude:</strong> A self-starter with a strong sense of ownership, eager to take on new challenges and bigger responsibilities.</li>\n<li><strong>Adaptability:</strong> Ability to thrive in a fast-paced, high-growth, and multicultural work environment.</li>\n</ul>\n<p><strong>Highly Desirable Skills (Brownie Points):</strong></p>\n<ul>\n<li>Japanese Market Exposure: Prior experience in marketing to or working with the Japanese market is a significant advantage.</li>\n<li>Cultural Acumen: Familiarity with Japanese business culture, etiquette, and communication styles.</li>\n<li>Language Skills: Proficiency in the Japanese language (reading, writing, and/or speaking) is a major plus but not a mandatory requirement.</li>\n<li>CRM Experience: Hands-on experience with CRM software like Salesforce or Zoho CRM.</li>\n<li>Tech Savvy: A genuine interest in technology and the ability to grasp complex technical concepts and translate them into marketing messages.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A competitive salary and benefits package.</li>\n<li>High visibility and direct mentorship, reporting directly to senior leadership.</li>\n<li>A clear career path from a foundational individual contributor to a team leader.</li>\n<li>The opportunity to take ownership of key marketing functions and make a real impact.</li>\n<li>Direct exposure to international business strategy and operations.</li>\n<li>A collaborative, supportive, and dynamic work culture.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates can send their updated resume to amrithas@ecesistech.com with the subject line: \"Application for Sr. Marketing Executive\".</p>",
        "tags": [
            "1-3 Years",
            "B2B Marketing",
            "Digital Marketing",
            "Japanese Market"
        ],
        "summary": "Seeking a motivated Marketing Executive with 1-3 years of B2B experience for a high-impact role. Focus on global strategy with a key emphasis on the Japanese market."
    },
    {
        "job_title": "Sales Specialist( AI )  - 0-3 Yrs Exp",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24370",
        "location": "Technopark",
        "closing_date": "01 Dec 2025",
        "job_description": "<h2>Sales Specialist (AI)</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum , 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 01, Dec 2025\n<strong>Job Published:</strong> 17, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are hiring an AI Sales Specialist to lead the marketing initiatives for our AI products and services and drive business growth. This strategic role requires excellent communication with a great attitude and the ability to set and achieve sales targets. The ideal candidate will have good academics and a results-oriented mind-set.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and implement a strategic sales plan to achieve company sales targets and objectives.</li>\n<li>Identify new opportunities and potential clients, actively prospecting and generating leads.</li>\n<li>Build and maintain strong relationships with key clients, understanding their needs and providing tailored solutions to meet their requirements.</li>\n<li>Develop, execute, and monitor marketing programs for our AI products and services across a variety of channels in line with the GTM strategy derived.</li>\n<li>Research the market, analyse trends, and provide advice on defining the organization's marketing strategy to effectively reach the target market.</li>\n<li>Collaborate with internal teams, including product and sales, to develop and monitor strategic marketing initiatives.</li>\n<li>Analyse and report on the performance and efficiency of marketing campaigns.</li>\n<li>Create marketing materials, such as sales and product collateral, while ensuring brand guidelines are met.</li>\n<li>Work with external agencies and vendors to execute marketing programs.</li>\n<li>Write, proofread, and edit creative and technical content across different mediums to support marketing initiatives.</li>\n<li>Provide expert advice on branding, positioning, communications, and other marketing issues.</li>\n<li>Give direction to marketing efforts, utilizing the most effective methods and tools.</li>\n<li>Stay updated on emerging trends and share best practices, fostering knowledge and insights.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Excellent Academics.</li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li>6–11 LPA (Competitive fixed salary &amp; Attractive performance-based incentives &amp; ESOPs)</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>B.Tech in Non-IT disciplines, OR Bachelor’s/Master’s in Mathematics/Statistics, OR Technical degree with MBA</li>\n</ul>\n<h3>Experience Required</h3>\n<ul>\n<li>0-3 years</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "AI Sales",
            "Marketing Strategy",
            "Lead Generation"
        ],
        "summary": "Seeking an AI Sales Specialist with 0-3 years of experience to lead marketing initiatives and drive business growth. Requires excellent communication and a results-oriented mindset."
    },
    {
        "job_title": "Senior Software Developer (Java, React, MongoDB)",
        "company": "Ainsurtech (P) Ltd",
        "url": "https://technopark.org/job-details/24369",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Software Developer (Java, React, MongoDB)</h2>\n<p>AInsurtech (P) Ltd\nAInsurtech Private Limited, Module #2705, Yamuna Building, Phase III, Technopark, 695583\nhttps://www.ainsurtek.com</p>\n<p><strong>Contact Email:</strong> hr@ainsurtek.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain back-end services and RESTful APIs using Java (Spring Boot or similar frameworks).</li>\n<li>Build responsive and engaging front-end interfaces with React.js (Hooks, Redux).</li>\n<li>Manage and optimize data storage, queries, and performance in MongoDB.</li>\n<li>Collaborate with cross-functional teams to deliver new features.</li>\n<li>Maintain code quality, documentation, and testing.</li>\n<li>Troubleshoot, debug, and upgrade existing systems.</li>\n<li>Contribute to architecture discussions and testing strategies.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>3+ years of professional experience in software development.</li>\n<li>Strong expertise in Java, Spring/Spring Boot, and Hibernate.</li>\n<li>Proven experience building SPAs using React.js.</li>\n<li>Hands-on experience with MongoDB and NoSQL data modeling.</li>\n<li>Understanding of RESTful APIs and Git version control.</li>\n<li>Experience in Agile environments (Scrum/Kanban).</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or equivalent.</li>\n</ul>\n<h3>Bonus Skills:</h3>\n<ul>\n<li>Experience with cloud platforms (AWS, Azure, GCP).</li>\n<li>Knowledge of Docker, Kubernetes, or other container technologies.</li>\n<li>Familiarity with CI/CD pipelines and DevOps practices.</li>\n<li>Exposure to SQL or other NoSQL databases.</li>\n<li>Understanding of Microservices or Event-Driven Architecture.</li>\n<li>Experience with testing tools (JUnit, Mockito, Jest, Enzyme).</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Java",
            "React",
            "MongoDB"
        ],
        "summary": "Seeking a Senior Software Developer to design and build back-end services with Java and front-end interfaces with React. Must have 3+ years of experience and expertise in Java, React, and MongoDB."
    },
    {
        "job_title": "Software Engineer – Angular Development",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24368",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Software Engineer – Angular Development</h2>\n<p><strong>Company:</strong> TRENSER Technology Solutions (P) Ltd\n<strong>Location:</strong> Thejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.trenser.com\n<strong>Contact Email:</strong> careers@trenser.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Overview</h3>\n<p>This position is for a Software Engineer responsible for developing Angular applications in a long-term software project for a German client. The job location is Trivandrum, India. The engineer will work closely with the existing project team on technical and management aspects, including requirement elicitation, software component designing, and implementation. The role requires taking assigned tasks to completion with a focus on deliverable quality. Candidates should possess self-initiative, decision-making, and self-directing capabilities, working with minimal supervision and a “go-getter” attitude.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Perform software requirements analysis and determine the functional and non-functional requirements of the project.</li>\n<li>Write product quality code and perform developer-level verification.</li>\n<li>Communicate with clarity regarding requirements and expectations of deliverables.</li>\n<li>Ensure on-time delivery of the product with quality.</li>\n<li>Identify possible risks and prepare contingency plans.</li>\n<li>Work closely with stakeholders, including customers, to ensure successful execution of the project.</li>\n<li>Manage priority changes and conflicts gracefully with stakeholders involved.</li>\n<li>Address customer escalations and be able to think quickly to identify and solve issues in the product.</li>\n<li>Proactively use/suggest tools and systems to improve quality, productivity, etc.</li>\n<li>Stay up-to-date on relevant technology and process advancements.</li>\n</ul>\n<h3>Qualifications and Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> More than four years of experience in Angular applications development.</li>\n<li><strong>Technical Skills:</strong></li>\n<li>Proficient with JavaScript/TypeScript.</li>\n<li>Proficient in debugging web pages to isolate functional (JavaScript) and style (CSS) issues.</li>\n<li>Familiarity with RESTful APIs to connect Angular applications to back-end services.</li>\n<li>Knowledge of other web technologies and UI/UX standards.</li>\n<li>Understanding of Material design principles and guidelines.</li>\n<li>Familiarity with Authentication and Authorization concepts and frameworks.</li>\n<li>Familiarity with other JavaScript based frameworks like ReactJS / React Native is an added advantage.</li>\n<li>Good understanding of software development lifecycles (SDLC), version control, and traceability.</li>\n<li>Experience in developing software under Waterfall and Agile development methodology.</li>\n<li>Knowledgeable and well-versed with various development tools for designing, coding, debugging/troubleshooting, testing, bug tracking, collaboration, and source control.</li>\n<li><strong>Education:</strong> Bachelor’s degree or equivalent in Engineering discipline - Computer/ Electronics.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Angular",
            "JavaScript/TypeScript",
            "RESTful APIs"
        ],
        "summary": "Software Engineer needed for Angular development on a German client project in Trivandrum. Responsibilities include requirements analysis, coding, and ensuring quality deliverables."
    },
    {
        "job_title": "Senior Software Engineer- Embedded",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24367",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Software Engineer - Embedded</h2>\n<p><strong>Company:</strong> TRENSER Technology Solutions (P) Ltd\n<strong>Location:</strong> Thejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.trenser.com\n<strong>Contact Email:</strong> careers@trenser.com\n<strong>Application Closing Date:</strong> 31, Oct 2025\n<strong>Job Published Date:</strong> 17, Oct 2025</p>\n<h3>Overview</h3>\n<p>TRENSER Technology Solutions is seeking a Senior Software Engineer specializing in Embedded systems. This role involves developing embedded firmware and applications for a long-term client. The position is based in Trivandrum, India, and requires close collaboration with the existing project team on both technical and management aspects. Responsibilities include requirement elicitation, software component design, and implementation, ensuring the quality of all deliverables. The ideal candidate will be self-motivated, possess strong decision-making and self-directing capabilities, and work effectively with minimal supervision, demonstrating a \"can-do\" attitude.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Perform software requirements analysis to determine functional and non-functional project requirements.</li>\n<li>Write production-quality code and conduct thorough developer testing.</li>\n<li>Communicate requirements and deliverable expectations with clarity.</li>\n<li>Ensure timely completion of assigned tasks while maintaining high code quality.</li>\n<li>Collaborate closely with stakeholders, including customers, to ensure project success.</li>\n<li>Manage priority changes and conflicts gracefully with involved stakeholders.</li>\n<li>Address customer escalations and rapidly identify and solve product issues.</li>\n<li>Stay current with advancements in relevant technologies and processes.</li>\n</ul>\n<h3>Qualifications and Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> More than 4 years of experience in developing firmware, drivers, middleware, and applications in Embedded Linux/RTOS.</li>\n<li><strong>Programming:</strong> Proficient in Embedded C/C++.</li>\n<li><strong>Operating Systems:</strong> Sound knowledge of Embedded Linux/RTOS internals.</li>\n<li><strong>Software Development:</strong> Good understanding of Software Development Lifecycles (SDLC) and version control tools.</li>\n<li><strong>Methodologies:</strong> Experience developing software under both Waterfall and Agile methodologies.</li>\n<li><strong>Tools:</strong> Knowledgeable and well-versed with various development tools for design, coding, debugging/troubleshooting, testing, bug tracking, collaboration, and source control.</li>\n<li><strong>Education:</strong> Bachelor's degree or equivalent in Electronics Engineering or a related discipline.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Embedded Linux",
            "RTOS",
            "Embedded C/C++"
        ],
        "summary": "Senior Embedded Software Engineer to develop firmware and applications. Responsibilities include analysis, design, implementation, and testing for client projects. Requires C/C++ and Embedded Linux/RTOS experience."
    },
    {
        "job_title": "Finance Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/24366",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Finance Trainee</h2>\n<p><strong>Company:</strong> ZenturioTech (P) Ltd\n<strong>Location:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> https://zenturiotech.com\n<strong>Contact Email:</strong> admin@zenturiotech.com</p>\n<p><strong>Closing Date:</strong> 31 October 2025\n<strong>Job Published:</strong> 17 October 2025</p>\n<h3>Brief Description</h3>\n<p>Are you detail-driven, analytical and passionate about making numbers tell a story? ZenturioTech is a growing startup on a mission, looking for a Finance Trainee eager to dive into real-world financial operations and help shape sustainable growth. If you love Excel sheets, budgets, and learning how a business runs from the inside out, let's talk.</p>\n<h3>What You’ll Be Doing:</h3>\n<ul>\n<li>Assist with financial data entry, record-keeping, and documentation.</li>\n<li>Support in preparing expense reports, invoices, and reimbursement tracking.</li>\n<li>Help maintain budgets, forecasts, and internal financial reports.</li>\n<li>Participate in financial analysis and research tasks as assigned.</li>\n<li>Ensure accuracy and confidentiality of financial information.</li>\n<li>Collaborate with the operations and management teams to streamline finance processes.</li>\n</ul>\n<h3>You’re a Great Fit If You:</h3>\n<ul>\n<li>Have a keen eye for detail and a love for organized data.</li>\n<li>Are pursuing or have completed a degree in Finance, Accounting, Commerce, or related fields.</li>\n<li>Are comfortable working with spreadsheets and financial tools.</li>\n<li>Are eager to learn, adapt, and contribute in a fast-paced startup environment.</li>\n<li>Take ownership and show initiative.</li>\n<li>Value integrity, accuracy, and teamwork.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Be part of a high-growth startup journey from day one.</li>\n<li>Gain hands-on experience and real-world financial exposure.</li>\n<li>Receive mentorship from experienced professionals.</li>\n<li>Open doors for career advancement based on your performance.</li>\n</ul>\n<p><strong>Ready to grow with us? Drop your resume to admin@zenturiotech.com. Let’s build something amazing together!</strong></p>",
        "tags": [
            "0-2 Years",
            "Finance",
            "Accounting",
            "Excel"
        ],
        "summary": "Seeking a detail-oriented Finance Trainee for a growing startup. Assist with financial operations, gain hands-on experience, and contribute to sustainable growth. Apply now!"
    },
    {
        "job_title": "Software Engineer (Nodejs)",
        "company": "Innovation Incubator Advisory Pvt Ltd.",
        "url": "https://technopark.org/job-details/24365",
        "location": "Technopark",
        "closing_date": "15 Nov 2025",
        "job_description": "<h2>Software Engineer (Node.js)</h2>\n<p><strong>Company:</strong> Innovation Incubator Advisory Pvt Ltd.\n<strong>Location:</strong> 4th Floor, Module No. 421, Nila Building, Phase I, Technopark, 695581\n<strong>Website:</strong> https://innovationincubator.com\n<strong>Contact Email:</strong> fannie.na@iinerds.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 15 Nov 2025</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and implement robust, scalable, and maintainable Node.js applications.</li>\n<li>Architect and build efficient APIs using industry best practices and design patterns.</li>\n<li>Work closely with front-end developers and other team members to deliver a seamless user experience.</li>\n<li>Optimize existing Node.js applications for performance and scalability.</li>\n<li>Write clean, well-documented, and maintainable code.</li>\n<li>Conduct code reviews and contribute to improving code quality across the team.</li>\n<li>Stay up-to-date with the latest trends and technologies in the Node.js ecosystem.</li>\n<li>Troubleshoot and debug complex application issues.</li>\n<li>Participate in the design and implementation of DevOps practices for continuous integration and delivery.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>5+ years of experience in Node.js development.</li>\n<li>In-depth knowledge of Amazon Web Services (AWS), Lambda, and Serverless programming.</li>\n<li>In-depth knowledge of asynchronous programming concepts and patterns.</li>\n<li>Experience with popular Node.js frameworks.</li>\n<li>Strong understanding of JavaScript best practices.</li>\n<li>Experience with building and integrating APIs.</li>\n<li>Experience with databases.</li>\n<li>Experience with unit testing frameworks.</li>\n<li>Excellent problem-solving and debugging skills.</li>\n<li>Strong communication and collaboration skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>5+ years of experience in Node.js development.</li>\n<li>In-depth knowledge of Amazon Web Services (AWS), Lambda, and Serverless programming.</li>\n<li>In-depth knowledge of asynchronous programming concepts and patterns.</li>\n<li>Experience with popular Node.js frameworks.</li>\n<li>Strong understanding of JavaScript best practices.</li>\n<li>Experience with building and integrating APIs.</li>\n<li>Experience with databases.</li>\n<li>Experience with unit testing frameworks.</li>\n<li>Excellent problem-solving and debugging skills.</li>\n<li>Strong communication and collaboration skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Node.js",
            "AWS Lambda",
            "Serverless"
        ],
        "summary": "Seeking a Node.js Software Engineer with 5+ years of experience. Responsibilities include designing, developing, and optimizing scalable Node.js applications and APIs using AWS Lambda."
    },
    {
        "job_title": "Data Engineer",
        "company": "Orisysindia Consultancy Services (P) Ltd",
        "url": "https://technopark.org/job-details/24364",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Data Engineer</h2>\n<p><strong>Company:</strong> Orisysindia Consultancy Services (P) Ltd\n<strong>Location:</strong> D3, 6th Floor, Bhavani Building\n<strong>Website:</strong> http://www.orisys.in\n<strong>Contact Email:</strong> recruitment@orisys.in</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 24, Oct 2025</p>\n<p><strong>Number of Open Positions:</strong> 4\n<strong>Mode of Work:</strong> Willing to work in any Shift</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and maintain ETL pipelines for multiple source systems, including SAP, Korber WMS, OpSuite ePOS, and internal BI systems.</li>\n<li>Design and implement SSIS-based data workflows, incorporating staging, data quality rules, and Change Data Capture (CDC) logic for near real-time updates.</li>\n<li>Collaborate with the DBA on schema design, indexing, and performance tuning for SQL Server 2019/2022.</li>\n<li>Build reusable components and scripts for data loading, transformation, and validation.</li>\n<li>Perform unit testing, documentation, and version control of data solutions using GitLab/Jenkins CI/CD.</li>\n<li>Work closely with backend developers and analysts to align data models with reporting needs.</li>\n<li>Troubleshoot and resolve data-related issues during development and post-deployment.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li>4–6 years of experience in data engineering or ETL development.</li>\n<li>Strong hands-on expertise in:<ul>\n<li>SSIS (SQL Server Integration Services)</li>\n<li>SQL Server 2019/2022 (T-SQL, stored procedures, indexing, CDC)</li>\n<li>ETL development for ERP/warehouse systems (SAP preferred)</li>\n<li>Dimensional modeling, star schema design, and SCD2 implementation.</li>\n</ul>\n</li>\n<li>Experience working with source systems like SAP, WMS, POS or retail systems is highly desirable.</li>\n<li>Proficiency in data quality frameworks, staging strategies, and workflow orchestration.</li>\n<li>Good understanding of data warehousing concepts and performance optimization.</li>\n<li>Familiarity with CI/CD for data workflows (GitLab, Jenkins, etc.).</li>\n<li>Strong communication and documentation skills for collaboration across teams.</li>\n<li>Knowledge in using AI Code accelerators for development activities.</li>\n</ul>",
        "tags": [
            "4-6 Years",
            "SSIS",
            "SQL Server 2019/2022",
            "ETL"
        ],
        "summary": "Seeking a Data Engineer with 4-6 years of experience to develop and maintain ETL pipelines. Responsibilities include SSIS, SQL Server, and collaboration for data solutions."
    },
    {
        "job_title": "QC Engineer -Structural",
        "company": "Grid Engineering Services",
        "url": "https://technopark.org/job-details/24363",
        "location": "Technopark",
        "closing_date": "17 Nov 2025",
        "job_description": "<h2>QC Engineer - Structural at Grid Engineering Services</h2>\n<p><strong>Location:</strong> Nila, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<strong>Company Website:</strong> https://gridengineeringservices.com\n<strong>Contact Email:</strong> hr@grdeng.com\n<strong>Contact Mobile:</strong> +919633888544</p>\n<p><strong>Closing Date:</strong> 17, Nov 2025\n<strong>Job Published:</strong> 17, Oct 2025</p>\n<h3>Brief Description</h3>\n<ul>\n<li>Assign tasks, set performance expectations, and supervise the rebar detailing team to meet quality and drawing production goals.</li>\n<li>Communicate effectively with clients to understand their requirements and address their concerns.</li>\n<li>Review shop drawings and Bar Bending Schedules (BBS) in accordance with Middle East standards.</li>\n<li>Verify drawings to ensure they meet design requirements.</li>\n<li>Monitor project progress and ensure timely delivery of shop drawings and submission schedules.</li>\n</ul>\n<h3>Preferred Skills and Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> BE/BTech in Civil Engineering.</li>\n<li><strong>Experience:</strong> Minimum of 4-6 years of experience as a QC engineer, expertized in shop drawing checking.</li>\n<li><strong>Project Experience:</strong> Middle East project experience is required.</li>\n<li><strong>Technical Skills:</strong> Strong understanding of rebar detailing codes and standards. Proficiency in rebar detailing software such as AutoCAD, CADS RC, ZW CAD, Rebar CAD, etc.</li>\n<li><strong>Communication:</strong> Excellent communication skills in English and strong interpersonal skills.</li>\n</ul>\n<h3>Salary</h3>\n<p>Between 25,000/- to 65,000/-</p>\n<p><strong>To Apply:</strong> Send your CV to hr@grdeng.com</p>",
        "tags": [
            "4-6 Years",
            "Shop Drawing Checking",
            "Rebar Detailing",
            "Middle East Standards"
        ],
        "summary": "Seeking a QC Engineer - Structural with 4-6 years of experience in rebar detailing and shop drawing checking. Responsibilities include client communication, drawing review, and project monitoring."
    },
    {
        "job_title": "Odoo Server Admin",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/24362",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Odoo Server Administrator</h2>\n<p><strong>Company:</strong> PromptTech Global (P) Ltd\n<strong>Location:</strong> Technopark Campus, Trivandrum\n<strong>Website:</strong> https://prompttechsolutions.com\n<strong>Contact Email:</strong> hr@prompttechglobal.com</p>\n<p><strong>Closing Date:</strong> October 31, 2025\n<strong>Job Published:</strong> October 17, 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced and proactive Odoo Server Administrator to manage and maintain our Odoo ERP infrastructure. The ideal candidate will be responsible for the deployment, configuration, performance tuning, monitoring, and troubleshooting of Odoo servers (both community and enterprise editions). You will also collaborate closely with the development and functional teams to ensure system availability, security, and scalability.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Install, configure, and maintain Odoo servers (on-premise or cloud environments).</li>\n<li>Manage Linux servers (primarily Ubuntu/Debian) that host Odoo environments.</li>\n<li>Perform regular updates, upgrades, and patches to the Odoo system and its dependencies.</li>\n<li>Monitor system performance, troubleshoot issues, and ensure high availability of services.</li>\n<li>Configure and maintain PostgreSQL databases used by Odoo, including backups and restorations.</li>\n<li>Implement and manage Odoo multi-instance architecture (if required).</li>\n<li>Automate tasks using shell scripting and other tools to improve operational efficiency.</li>\n<li>Set up and manage SSL certificates, reverse proxy (Nginx), and domain configurations.</li>\n<li>Implement security best practices including firewall rules, fail2ban, and user access controls.</li>\n<li>Collaborate with developers to support deployment pipelines (CI/CD) and Git-based workflows.</li>\n<li>Maintain documentation related to server configurations, architecture, and SOPs.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field.</li>\n<li>2+ years of experience in system administration, with specific experience managing Odoo environments.</li>\n<li>Strong hands-on experience with Linux (Ubuntu/Debian) server administration.</li>\n<li>Solid understanding of Odoo architecture and PostgreSQL database management.</li>\n<li>Experience with Nginx, Apache, and SSL/TLS configuration.</li>\n<li>Familiarity with Docker, Kubernetes, or other container orchestration tools is a plus.</li>\n<li>Good understanding of network security, firewalls, and access control.</li>\n<li>Strong troubleshooting, problem-solving, and communication skills.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Odoo",
            "Linux",
            "PostgreSQL"
        ],
        "summary": "Seeking an Odoo Server Administrator to manage ERP infrastructure. Responsibilities include deployment, configuration, monitoring, and troubleshooting Odoo servers and related systems."
    },
    {
        "job_title": "Odoo developer",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/24361",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Odoo Developer</h2>\n<p><strong>Company:</strong> PromptTech Global (P) Ltd\n<strong>Website:</strong> https://prompttechsolutions.com\n<strong>Location:</strong> Module No 315, Nila Building, Technopark Campus, 695581\n<strong>Contact Email:</strong> hr@prompttechglobal.com\n<strong>Closing Date:</strong> 31 Oct 2025\n<strong>Job Published:</strong> 17 Oct 2025</p>\n<h3>About Us:</h3>\n<p>PromptTech is a visionary organisation empowering global small and medium enterprises with innovative technologies and expertise. We optimise operations, enhance customer experiences, and drive growth. Our commitment to quality ensures reliable services that exceed expectations. Our domain expertise lies in Business Process Integration, InsurTech Solutions and Business Support Services.</p>\n<h3>Job Description:</h3>\n<p>We are seeking a skilled Odoo Developer with hands-on experience in the implementation, customization, and maintenance of various Odoo modules. The ideal candidate will have a strong understanding of the Odoo framework and the ability to configure and optimize modules to support critical business functions.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and implement Odoo solutions across key modules.</li>\n<li>Customize Odoo modules to meet unique client needs while ensuring seamless integration and operational efficiency.</li>\n<li>Work with internal teams and clients to gather requirements, provide technical support, and develop effective implementation strategies.</li>\n<li>Perform debugging and resolve technical issues within the Odoo ecosystem to maintain system performance and reliability.</li>\n<li>Conduct routine audits and manage updates to ensure optimal system performance.</li>\n<li>Provide training and support to users for effective utilization of Odoo modules.</li>\n<li>Provide complete &amp; professional documentation for tasks needing development.</li>\n<li>Analyse customers’ needs and business processes in order to map them properly with Odoo.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong proficiency in Python, JavaScript, XML, and SQL.</li>\n<li>Hands-on experience with Odoo's core framework.</li>\n<li>Excellent problem-solving skills and a customer-focused approach.</li>\n<li>Strong ability to communicate effectively with team members and clients.</li>\n</ul>\n<h3>Required Experience:</h3>\n<ul>\n<li>Minimum 1 year.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Odoo",
            "Python",
            "JavaScript"
        ],
        "summary": "Seeking an Odoo Developer to implement, customize, and maintain Odoo modules. Requires proficiency in Python, JavaScript, XML, SQL, and Odoo's core framework."
    },
    {
        "job_title": "Accountant",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/24360",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Accountant</h2>\n<p><strong>Company:</strong> PromptTech Global (P) Ltd\n<strong>Location:</strong> Module No 315, Nila Building, Technopark Campus, 695581\n<strong>Website:</strong> https://prompttechsolutions.com</p>\n<p><strong>Closing Date:</strong> 31 October 2025\n<strong>Job Published:</strong> 17 October 2025\n<strong>Contact Email:</strong> hr@prompttechglobal.com</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Maintain accounts individually with sound knowledge of the latest version of Tally.</li>\n<li>Process journal entries, invoices, month-end closures, and reconciliations.</li>\n<li>Record financial transactions, manage accounts payable and accounts receivable.</li>\n<li>Ensure timely payments and collection follow-ups.</li>\n<li>Maintain and balance accounts by verifying, allocating, posting, and reconciling transactions, and resolving discrepancies.</li>\n<li>Issue and verify purchase orders.</li>\n<li>Maintain and reconcile the general ledger by preparing subsidiary accounts, trial balances, and reconciling entries.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Minimum 3 years of proven experience as a Finance Executive or in a similar role.</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>High attention to detail and accuracy in financial data entry.</li>\n<li>Ability to work in a fast-paced environment and adapt to changes.</li>\n<li>Knowledge of Accounting and Bookkeeping.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Tally",
            "Accounting",
            "Bookkeeping"
        ],
        "summary": "Seeking an Accountant with 3+ years experience in Tally to manage accounts, process entries, and perform reconciliations. Responsibilities include AP/AR, GL maintenance, and financial data accuracy."
    },
    {
        "job_title": "Odoo Sales Consultant",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/24359",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Odoo Sales Consultant</h2>\n<p><strong>Company:</strong> PromptTech Global (P) Ltd\n<strong>Location:</strong> Module No 315, Nila Building, Technopark Campus, 695581\n<strong>Website:</strong> https://prompttechsolutions.com\n<strong>Contact Email:</strong> hr@prompttechglobal.com</p>\n<p><strong>Closing Date:</strong> 31, Oct 2025\n<strong>Job Published:</strong> 17, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced Odoo Sales Consultant to join our team. The ideal candidate will have in-depth knowledge of Odoo ERP modules, excellent client relationship skills, and a proven track record in ERP/IT solution sales. This role involves understanding client business needs, demonstrating Odoo solutions, and driving end-to-end sales processes.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and develop new business opportunities for Odoo ERP solutions.</li>\n<li>Conduct client meetings to understand requirements and propose tailored Odoo solutions.</li>\n<li>Deliver product demonstrations, presentations, and proof-of-concepts to prospective clients.</li>\n<li>Collaborate with the technical team to ensure feasibility and accurate proposals.</li>\n<li>Prepare and present commercial offers, proposals, and contracts.</li>\n<li>Build and maintain long-term relationships with clients to ensure satisfaction and repeat business.</li>\n<li>Meet and exceed sales targets and KPIs.</li>\n<li>Stay updated on Odoo product features, updates, and market trends.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor’s degree in Business, IT, Computer Science, or related field.</li>\n<li>Minimum 2–5 years of experience in ERP/Software solution sales (Odoo experience preferred).</li>\n<li>Strong knowledge of Odoo modules (Sales, Inventory, Accounting, CRM, HR, etc.).</li>\n<li>Excellent communication, presentation, and negotiation skills.</li>\n<li>Ability to understand business processes and translate them into Odoo solutions.</li>\n<li>Self-motivated with strong problem-solving and client-handling skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "Odoo",
            "ERP Sales",
            "Client Relationship Management"
        ],
        "summary": "Seeking an Odoo Sales Consultant with 2-5 years of ERP sales experience. Responsibilities include client needs assessment, Odoo demonstrations, and driving sales processes."
    },
    {
        "job_title": "Digital Marketing Specialist",
        "company": "Joopium Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24358",
        "location": "Technopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>Digital Marketing Specialist</h2>\n<p><strong>Company:</strong> JOOPIUM TECHNOLOGIES (P) Ltd\n<strong>Location:</strong> Technopark, Kazhakootam, Trivandrum\n<strong>Contact Email:</strong> careers@joopiumtechnologies.com\n<strong>Website:</strong> https://joopiumtechnologies.com\n<strong>Job Type:</strong> Full-Time\n<strong>Experience:</strong> 1-2 Years\n<strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 10, Nov 2025</p>\n<h3>Job Summary</h3>\n<p>We are seeking a talented and results-driven Digital Marketing Specialist to plan, develop, and manage our online marketing strategies. The ideal candidate will have hands-on experience in SEO, SEM, social media marketing, content creation, and analytics, with the ability to work independently and communicate effectively with international clients.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and execute comprehensive digital marketing campaigns to achieve business goals.</li>\n<li>Conduct market research and competitor analysis to inform marketing strategies.</li>\n<li><strong>Search Engine Optimization (SEO):</strong> Optimize website content and structure to improve search rankings and drive organic traffic. Perform keyword research and technical SEO audits to identify growth opportunities.</li>\n<li><strong>Social Media Marketing:</strong> Manage and grow company presence across Facebook, Instagram, LinkedIn, and other platforms.</li>\n<li><strong>Paid Advertising:</strong> Create, manage, and optimize ad campaigns across Google Ads, Meta Ads, and other platforms.</li>\n<li><strong>Content Creation:</strong> Develop engaging content such as blog posts, videos, and infographics to support marketing initiatives.</li>\n<li><strong>Analytics &amp; Reporting:</strong> Track and analyze digital marketing metrics (traffic, engagement, conversions) using tools like Google Analytics. Provide regular performance reports and insights to the internal team.</li>\n<li>Communicate and coordinate with UK-based clients for campaign planning and updates.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong understanding of digital marketing principles and channels (SEO, SEM, SMM).</li>\n<li>Proficient in tools such as Google Ads, Google Analytics, Facebook Ads Manager, and other relevant platforms.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to multitask, manage deadlines, and adapt to a fast-paced environment.</li>\n<li>Creative thinker with strong analytical and problem-solving abilities.</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "SEO",
            "SEM",
            "Social Media Marketing"
        ],
        "summary": "Seeking a Digital Marketing Specialist with 1-2 years of experience in SEO, SEM, social media, and content creation. Responsibilities include campaign management, client communication, and analytics."
    },
    {
        "job_title": "Junior PHP Developer (Work From Home) Immediate Joiners Preferred",
        "company": "Leader It (P) Ltd",
        "url": "https://technopark.org/job-details/24357",
        "location": "Technopark",
        "closing_date": "23 Oct 2025",
        "job_description": "<h2>Junior PHP Developer (Work From Home)</h2>\n<p><strong>Company:</strong> LEADER IT (P) Ltd\n<strong>Location:</strong> Remote\n<strong>Published:</strong> 17-Oct-2025\n<strong>Closes:</strong> 23-Oct-2025</p>\n<p><strong>Contact:</strong> jobsindia@leadergroup.com\n<strong>Website:</strong> http://www.leaderit.in/</p>\n<h3>Brief Description</h3>\n<p>We are looking for an enthusiastic PHP Developer with 1–2 years of experience to join our development team. The selected candidate will work closely under the guidance of a lead developer, gaining hands-on experience in building, customizing, and optimizing PHP-based applications. This is an excellent opportunity for someone eager to learn, grow, and contribute in a collaborative, performance-driven environment. Immediate joiners are preferred.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop, customize, and maintain PHP-based applications and plugins.</li>\n<li>Enhance existing features and implement new ones based on project requirements.</li>\n<li>Optimize database queries and improve application performance.</li>\n<li>Configure and integrate third-party tools such as Redis, caching layers, and APIs.</li>\n<li>Debug and resolve issues to ensure application stability and scalability.</li>\n<li>Collaborate with senior developers and follow best practices under mentorship.</li>\n<li>Maintain documentation for code, workflows, and integrations.</li>\n<li>Assist in version upgrades while ensuring compatibility with custom changes.</li>\n</ul>\n<h3>Skills Required:</h3>\n<ul>\n<li><strong>Core Technologies:</strong> PHP (OOP, MVC concepts), MySQL/MariaDB, HTML, CSS, JavaScript, JQuery</li>\n<li><strong>Framework/Tools:</strong> Symfony (preferred), Composer, Git</li>\n<li><strong>Databases:</strong> Query optimization, indexing, schema handling</li>\n<li><strong>Version Control:</strong> Git/GitHub or GitLab workflows</li>\n<li><strong>Environment:</strong> Linux, LAMP stack, Docker (preferred)</li>\n<li><strong>Problem-Solving:</strong> Debugging skills, ability to analyze logs and performance bottlenecks</li>\n<li><strong>Soft Skills:</strong> Eagerness to learn, willingness to work under guidance</li>\n</ul>\n<h3>Nice to Have (Optional Skills):</h3>\n<ul>\n<li>Familiarity with open-source PHP applications and plugin development.</li>\n<li>Experience with Docker-based environments.</li>\n<li>Basic knowledge of frontend frameworks (Vue.js) for UI customization.</li>\n<li>Understanding of caching systems like Redis or Memcached.</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "PHP",
            "Symfony",
            "MySQL"
        ],
        "summary": "Seeking an enthusiastic Junior PHP Developer with 1-2 years of experience for a remote role. Responsibilities include application development, optimization, and collaboration under senior guidance."
    },
    {
        "job_title": "Technical Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24356",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Technical Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Closing Date:</strong> October 24, 2025\n<strong>Job Published:</strong> October 17, 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 10+ years of experience for this role.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Architecture &amp; Design</strong></p>\n<ul>\n<li>Define, design, and implement end-to-end technical architectures for enterprise-grade solutions.</li>\n<li>Architect scalable and secure cloud-native applications leveraging AWS, Azure, or GCP.</li>\n<li>Provide design guidance on 3D imaging applications, data processing, and visualization workflows.</li>\n<li>Establish standards for API design and integration, ensuring reusability, performance, and security.</li>\n</ul>\n<p><strong>Development &amp; Implementation</strong></p>\n<ul>\n<li>Guide development teams in implementing solutions using Python, .NET, and C#.</li>\n<li>Drive adoption of containerization (Docker, Kubernetes) for deployment and orchestration.</li>\n<li>Ensure efficient use of databases including PostgreSQL and MongoDB for structured and unstructured data.</li>\n</ul>\n<p><strong>Collaboration &amp; Leadership</strong></p>\n<ul>\n<li>Collaborate with business stakeholders to translate requirements into technical roadmaps.</li>\n<li>Provide mentorship and technical leadership to engineers and developers.</li>\n<li>Conduct code reviews, enforce best practices, and ensure compliance with architectural guidelines.</li>\n</ul>\n<p><strong>Quality &amp; Performance</strong></p>\n<ul>\n<li>Ensure system performance, reliability, and scalability through proper architectural decisions.</li>\n<li>Lead proof-of-concepts (POCs) and evaluate new tools/technologies for adoption.</li>\n<li>Oversee security, compliance, and data governance practices.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Information Management, Computer Science, Data Science, or a related field.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proven experience as a Technical Architect or Solution Architect in complex, large-scale systems.</li>\n<li>Experience in front-end technologies - Angular/React.</li>\n<li>Programming Languages: Python, .NET, C#.</li>\n<li>Databases: PostgreSQL, MongoDB.</li>\n<li>Cloud Platforms: AWS, Azure, or GCP.</li>\n<li>API Design: REST, GraphQL, or gRPC.</li>\n<li>Containerization: Docker (Kubernetes experience is a plus).</li>\n<li>Exposure to 3D imaging technologies, visualization frameworks, or computational graphics.</li>\n<li>Strong knowledge of microservices architecture and enterprise integration patterns.</li>\n<li>Excellent problem-solving, analytical, and communication skills.</li>\n<li>Ability to lead cross-functional teams and drive technology strategies.</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Experience with CI/CD pipelines, DevOps practices, and Infrastructure as Code (Terraform/Ansible).</li>\n<li>Knowledge of AI/ML workflows in imaging and data analysis.</li>\n<li>Familiarity with Agile/Scrum methodologies.</li>\n</ul>\n<h3>Application Process:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Please be aware that some fraudsters may promise jobs with Reflections Info Systems for a fee. Reflections Info Systems never seeks payment for job opportunities. We contact candidates exclusively through our official website or LinkedIn. All employment-related communications are sent from our official HR email ID. For any clarification or alerts regarding this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "10+ Years",
            "AWS",
            "Python",
            "Microservices"
        ],
        "summary": "Seeking a Technical Architect with 10+ years of experience to design enterprise-grade solutions, lead development teams, and ensure system quality. Responsibilities include cloud-native architecture, API design, and technical leadership."
    },
    {
        "job_title": "Senior DotNet Developer + Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24355",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Senior DotNet Developer + Azure</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Closing Date:</strong> October 24, 2025\n<strong>Job Published:</strong> October 17, 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking experienced candidates with 8+ years of experience for the role of Senior DotNet Developer + Azure.</p>\n<p><strong>Working Hours:</strong> 12:00 PM - 9:00 PM</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, enhance, document, and maintain robust applications using .NET Core 6/8+, C#, REST APIs, T-SQL, and modern JavaScript/jQuery.</li>\n<li>Integrate and support third-party APIs and external services.</li>\n<li>Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack.</li>\n<li>Identify, prioritize, and execute tasks throughout the Software Development Life Cycle (SDLC).</li>\n<li>Participate in Agile/Scrum ceremonies and manage tasks using Jira.</li>\n<li>Understand technical priorities, architectural dependencies, risks, and implementation challenges.</li>\n<li>Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>8+ years of hands-on development experience with:</strong></p>\n<ul>\n<li>C#, .NET Core 6/8+, Entity Framework / EF Core</li>\n<li>JavaScript, jQuery, REST APIs</li>\n<li>Expertise in MS SQL Server, including: Complex SQL queries, Stored Procedures, Views, Functions, Packages, Cursors, Tables, and Object Types</li>\n<li>Skilled in unit testing with XUnit, MSTest</li>\n<li>Strong in software design patterns, system architecture, and scalable solution design</li>\n<li>Ability to lead and inspire teams through clear communication, technical mentorship, and ownership</li>\n<li>Strong problem-solving and debugging capabilities</li>\n<li>Ability to write reusable, testable, and efficient code</li>\n<li>Develop and maintain frameworks and shared libraries to support large-scale applications</li>\n<li>Excellent technical documentation, communication, and leadership skills</li>\n<li>Microservices and Service-Oriented Architecture (SOA)</li>\n<li>Experience in API Integrations</li>\n</ul>\n<p><strong>2+ years of hands with Azure Cloud Services, including:</strong></p>\n<ul>\n<li>Azure Functions</li>\n<li>Azure Durable Functions</li>\n<li>Azure Service Bus, Event Grid, Storage Queues</li>\n<li>Blob Storage, Azure Key Vault, SQL Azure</li>\n<li>Application Insights, Azure Monitoring</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Familiarity with AngularJS, ReactJS, and other front-end frameworks</li>\n<li>Experience with Azure API Management (APIM)</li>\n<li>Knowledge of Azure Containerization and Orchestration (e.g., AKS/Kubernetes)</li>\n<li>Experience with Azure Data Factory (ADF) and Logic Apps</li>\n<li>Exposure to Application Support and operational monitoring</li>\n<li>Azure DevOps - CI/CD pipelines (Classic / YAML)</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Job Applications:</strong></p>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Azure",
            "C#"
        ],
        "summary": "Seeking an experienced Senior DotNet Developer with 8+ years in .NET Core and Azure. Responsibilities include designing, developing, and maintaining robust applications and cloud services."
    },
    {
        "job_title": "Sr. Data Architect - Snowflake & SAP BW/ECC",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24354",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Sr. Data Architect - Snowflake &amp; SAP BW/ECC</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Closing Date:</strong> 24, Oct 2025\n<strong>Job Published:</strong> 17, Oct 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>A minimum of 10 years of experience in data engineering, encompassing the development and scaling of data warehouse and data lake platforms. The candidate should possess a strong background in both Snowflake and SAP BW/ECC environments, demonstrating leadership in technical design, architecture, and implementation of complex data solutions. Understand SAP ABAP programs, reports, interfaces, and enhancements.</p>\n<p><strong>Working hours:</strong> 8 hours, with a few hours of overlap during EST Time zone. This overlap is mandatory for meetings.\n<strong>Working hours:</strong> 12 PM - 9 PM</p>\n<h3>Responsibilities</h3>\n<ul>\n<li><strong>Mandatory Skills:</strong> Snowflake experience, Data Architecture experience, ETL process experience, Large Data migration solutioning experience.</li>\n<li>Lead the design and architecture of data solutions leveraging Snowflake, ensuring scalability, performance, and reliability.</li>\n<li>Oversee the implementation of data pipelines, ETL processes, and data governance frameworks within Snowflake environments.</li>\n<li>Ensure efficient data extraction from SAP BW/ECC systems, understand Standard SAP objects (ABAP Logics etc.) and BW transformations.</li>\n<li>Collaborate with stakeholders to understand business requirements and translate them into technical specifications and data models.</li>\n<li>Develop and maintain data architecture standards, guidelines, and best practices, including data governance principles and DataOps methodologies.</li>\n<li>Provide technical guidance and mentorship to data engineering teams, fostering skill development and knowledge sharing.</li>\n<li>Conduct performance tuning and optimization of Snowflake databases and queries.</li>\n<li>Stay updated on emerging trends and advancements in Snowflake, cloud data technologies, data governance, and DataOps practices.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Extensive experience in designing and implementing data solutions using Snowflake, DBT.</li>\n<li>Proficiency in data modeling, schema design, and optimization within Snowflake environments.</li>\n<li>Strong understanding of SAP BW/ECC systems, including data extraction, transformation, and loading (ETL/ELT) processes. Experience in integrating SAP data into cloud data platforms.</li>\n<li>Strong understanding of cloud data warehousing concepts and best practices, particularly with Snowflake.</li>\n<li>Expertise in python/java/scala, SQL, ETL processes, and data integration techniques, with a focus on Snowflake.</li>\n<li>Familiarity with other cloud platforms and data technologies (e.g., AWS, Azure, GCP).</li>\n<li>Proficiency in SAP ABAP (Advanced Business Application Programming) development.</li>\n<li>Experience in designing, developing, and implementing SAP ABAP programs, reports, interfaces, and enhancements.</li>\n<li>Demonstrated experience in implementing data governance frameworks and DataOps practices.</li>\n<li>Working experience in SAP environments.</li>\n<li>Familiarity with real-time streaming technologies and Change Data Capture (CDC) mechanisms.</li>\n<li>Knowledge of data governance principles and DataOps methodologies.</li>\n<li>Proven track record of architecting and delivering complex data solutions in cloud platforms/Snowflake.</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Experience with data visualization tools (e.g., Tableau, Power BI) is a plus.</li>\n<li>Knowledge of data security and compliance standards.</li>\n<li>Excellent communication and presentation skills, with the ability to convey complex technical concepts to juniors and non-technical stakeholders.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Ability to work effectively in a collaborative team environment and lead cross-functional initiatives.</li>\n</ul>\n<h3>Certifications</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Systems, or related field.</li>\n<li>Certifications related to Snowflake (e.g., SnowPro core/Snowpro advanced Architect/Snowpro advanced Data Engineer) are desirable but not mandatory.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Please be aware that some fraudsters are promising jobs with Reflections Info Systems for a fee. Reflections Info Systems <strong>never</strong> asks for payment for job opportunities. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent from our official HR email address. For any clarification or alerts regarding this, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "10+ Years",
            "Snowflake",
            "SAP BW/ECC",
            "Data Architecture"
        ],
        "summary": "Seeking a Sr. Data Architect with 10+ years of experience in data engineering, Snowflake, and SAP BW/ECC. Responsibilities include designing, implementing, and leading complex data solutions."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24353",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Full Stack Developer at Reflections Info Systems (P) Ltd</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 24, Oct 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>The full-stack software engineer’s primary job role will be to design and develop solutions using NodeJS, and related technologies. This includes developing backend services and corresponding client-side counterparts.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, test, and maintain high-quality web applications using Angular (version 16+).</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Ensure the technical feasibility of UI/UX designs.</li>\n<li>Participate in code reviews, providing constructive feedback to peers.</li>\n<li>Troubleshoot and debug applications, ensuring optimal performance.</li>\n<li>Stay up-to-date with emerging trends and technologies in front-end development.</li>\n<li>Mentor and guide junior developers, fostering a collaborative and productive work environment.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Minimum of 4 years of professional experience in front-end development.</li>\n<li>Strong proficiency in Angular (version 16+) and related technologies.</li>\n<li>Node JS, Nest JS, Kafka, Redis, Javascript, HTML, CSS</li>\n<li>RESTful API integration</li>\n<li>Experience working with Docker and containerized applications</li>\n<li>Experience working with Kubernetes or other container orchestration tools</li>\n<li>Hands-on knowledge and understanding of AWS environments</li>\n<li>Experience in full-stack development</li>\n<li>Knowledge of RDBMS and Document Database</li>\n<li>Experience with Agile and Scrum development methodologies</li>\n<li>Exposure to continuous integration (CI/CD)</li>\n<li>Knowledge of version control systems such as Git and TFS</li>\n<li>Good analytical and problem-solving skills</li>\n<li>Up-to-date knowledge of latest technologies, tools, and platforms</li>\n<li>Ability to complete tasks with minimum supervision</li>\n<li>Ability to play a leadership role</li>\n<li>Node JS</li>\n<li>Nest JS framework</li>\n<li>Angular</li>\n<li>Kafka / Event architecture / RabbitMQ</li>\n<li>Redis / Caching</li>\n<li>Javascript</li>\n<li>HTML, CSS</li>\n<li>Microservices &amp; Cloud</li>\n<li>Knowledge / Understanding in continuous integration (CI/CD)</li>\n<li>RDBMS/NoSQL/MongoDB</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Knowledge in Laravel is an addon</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment-related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "4+ Years",
            "Angular",
            "NodeJS",
            "AWS"
        ],
        "summary": "Full Stack Developer needed to design and develop solutions using NodeJS and Angular. Responsibilities include web application development, optimization, and collaboration with teams."
    },
    {
        "job_title": "Student Mentor for Online Classes (Females Only)",
        "company": "Doubtbox Edutainment (P) Ltd",
        "url": "https://technopark.org/job-details/24352",
        "location": "Technopark",
        "closing_date": "21 Oct 2025",
        "job_description": "<h2>Student Mentor for Online Classes (Females Only)</h2>\n<p><strong>Company:</strong> Doubtbox Edutainment (P) Ltd\n<strong>Website:</strong> http://www.doubtbox.com\n<strong>Location:</strong> 1st Floor, Nila Building, Technopark, Trivandrum, 695581</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> October 21, 2025\n*   <strong>Time:</strong> 10:30 AM - 5:30 PM\n*   <strong>Contact Email:</strong> hr@doubtbox.com</p>\n<h3>About Doubtbox:</h3>\n<p>Doubtbox is a leading personalized LIVE Learning platform for students in classes 1-12 (CBSE/ICSE/State Boards), dedicated to making learning engaging and enjoyable. We focus on personalized LIVE Online Teaching tailored to individual learning styles.</p>\n<p>For the past decade, our self-learning content was distributed by Malayala Manorama, reaching over 100,000 students. We have received investment from the Times of India group and were recognized as Amazon Edstart's best EdTech start-up of 2020. We currently have a pool of approximately 1000 teachers and are expanding into the Middle East.</p>\n<h3>Job Summary:</h3>\n<ul>\n<li>Provide guidance and support to students in academic, personal, and career development.</li>\n<li>Assist students in setting goals and developing action plans.</li>\n<li>Offer advice on study techniques, time management, and effective learning strategies.</li>\n<li>Help students navigate academic programs, resources, and opportunities.</li>\n<li>Serve as a role model and motivator for student success.</li>\n<li>Address student concerns, challenges, and questions related to their education.</li>\n<li>Monitor student progress and academic performance.</li>\n<li>Foster a supportive and inclusive environment for student growth.</li>\n<li>Collaborate with faculty and staff to promote student success.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Communication Skills:</strong> Active listening and effective communication.</li>\n<li><strong>Empathy:</strong> Understanding and relating to student challenges.</li>\n<li><strong>Patience:</strong> Supporting students at their own pace.</li>\n<li><strong>Problem-Solving:</strong> Helping students find solutions to academic and personal issues.</li>\n<li><strong>Organizational Skills:</strong> Assisting with study habits, time management, and goal-setting.</li>\n<li><strong>Adaptability:</strong> Adjusting mentoring approaches to individual needs.</li>\n<li><strong>Motivational Skills:</strong> Inspiring students to reach their potential.</li>\n<li><strong>Reporting Skills:</strong> Proficiency in Word, Excel, and PowerPoint.</li>\n<li><strong>Education:</strong> Graduates in Science or Mathematics preferred.</li>\n</ul>\n<h3>Walk-In Venue:</h3>\n<p>DOUBTBOX EDUTAINMENT (P) Ltd,\n1st Floor, Nila building,\nTechnopark Phase 1, Trivandrum</p>\n<p><strong>Note:</strong> This position is open to <strong>Female Candidates only</strong>.</p>\n<h3>Technopark Entry Pass Information:</h3>\n<p>Candidates are required to apply for a Technopark Campus entry pass to attend the walk-in interview. This can be done via the mobile app or web browser. The entry pass will be sent to your registered mobile number/email. Show the softcopy on your gadget at the Technopark Entrance Gate.</p>\n<p>For those without smartphones, print your hardcopy entry pass from the self-operating Kiosks at the Reception Building near the Main Gate using the provided OTP.</p>\n<ul>\n<li><strong>Mobile App Download (Android):</strong> [Link Provided]</li>\n<li><strong>Mobile App Download (iOS):</strong> [Link Provided]</li>\n<li><strong>Website URL:</strong> vms.technopark.org</li>\n<li><strong>User Manual:</strong> [Link Provided]</li>\n</ul>\n<p><strong>Important:</strong> Original certificates will be verified at the Entry Gate for walk-in interview access.</p>",
        "tags": [
            "0+ Years",
            "Mentoring",
            "Student Support",
            "EdTech"
        ],
        "summary": "Seeking female Student Mentors for online classes at Doubtbox Edutainment. Provide academic and personal guidance to students in classes 1-12."
    },
    {
        "job_title": "Graphics Designer",
        "company": "Toonz Animation India (P) Ltd",
        "url": "https://technopark.org/job-details/24351",
        "location": "Technopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Graphics Designer</h2>\n<p><strong>Company:</strong> Toonz Animation India (P) Ltd\n<strong>Location:</strong> Technopark Campus, Trivandrum, Kerala, India\n<strong>Contact:</strong> hr@toonzanimationindia.com\n<strong>Closing Date:</strong> 30, November 2025\n<strong>Job Published:</strong> 17, October 2025</p>\n<p><strong>Company Website:</strong> http://www.toonz.co</p>\n<h3>Creative Concept &amp; Visual Design</h3>\n<ul>\n<li>Develop original visual concepts and graphics for a variety of animation-related needs including character art, environments, marketing campaigns, pitch decks, and digital assets.</li>\n<li>Ensure every design aligns with the studio’s creative vision and storytelling goals.</li>\n</ul>\n<h3>Expert Software Skills</h3>\n<ul>\n<li>Demonstrate expert-level proficiency in Adobe Creative Suite (Photoshop, Illustrator, After Effects, InDesign), and other tools like Figma or CorelDraw.</li>\n<li>Understanding of motion graphics and UI/UX is a plus.</li>\n</ul>\n<h3>Team Collaboration</h3>\n<ul>\n<li>Collaborate with directors, animators, and other creative departments to translate ideas into compelling visual outputs.</li>\n<li>Provide creative input during brainstorming and storyboarding stages.</li>\n</ul>\n<h3>Branding &amp; Asset Development</h3>\n<ul>\n<li>Create and maintain visual branding across multiple platforms.</li>\n<li>Develop style guides, templates, and reusable graphic libraries to ensure consistency in visual storytelling.</li>\n</ul>\n<h3>Project &amp; Time Management</h3>\n<ul>\n<li>Handle multiple tasks and design requests simultaneously, often under tight deadlines.</li>\n<li>Maintain quality control and attention to detail across all outputs.</li>\n</ul>\n<h3>Communication &amp; Presentation</h3>\n<ul>\n<li>Present and explain design concepts clearly to internal teams or clients.</li>\n<li>Take constructive feedback positively and refine designs accordingly.</li>\n<li>Must possess strong interpersonal and communication skills.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Visual Communication:</strong> A deep understanding of how to communicate effectively through visual elements like imagery, typography, and layout. This includes the ability to translate complex ideas into clear and engaging visuals.</li>\n<li><strong>Typography:</strong> Mastery of typography, including font selection, hierarchy, spacing, and how to use type to convey tone and meaning. In animation, this extends to kinetic typography – animating text to enhance storytelling.</li>\n<li><strong>Color Theory:</strong> A strong grasp of color psychology, color palettes, and how to use color effectively to evoke emotions, create visual harmony, and establish branding.</li>\n<li><strong>Communication Skills:</strong> Excellent verbal and written communication skills to articulate design concepts, provide feedback, and present ideas effectively.</li>\n<li><strong>Problem-Solving:</strong> The ability to identify and solve creative and technical challenges that may arise during the animation production process.</li>\n<li><strong>Adaptability and Continuous Learning:</strong> Staying updated with the latest animation trends, software advancements, and industry best practices.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Adobe Creative Suite",
            "Visual Communication",
            "Typography"
        ],
        "summary": "Creative Graphics Designer needed for Toonz Animation India. Develop visual concepts, collaborate with teams, and manage projects with expert software skills in Adobe Suite."
    },
    {
        "job_title": "Trainee-Inside Sales (Candidates with MBA Marketing Preferred)",
        "company": "Softnotions Technologies Pvt Ltd",
        "url": "https://technopark.org/job-details/24349",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Trainee - Inside Sales</h2>\n<p><strong>Company:</strong> Softnotions Technologies Private Limited</p>\n<p><strong>Location:</strong> GE, Ground Floor, Padmanabham Technopark Campus, Thiruvananthapuram, Kerala, India 695 581</p>\n<p><strong>Website:</strong> http://www.softnotions.com</p>\n<p><strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<p><strong>Publish Date:</strong> 17, Oct 2025</p>\n<p><strong>Closing Date:</strong> 24, Oct 2025</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Conduct market research and identify potential international clients in targeted verticals (US, Europe, Middle East, etc.).</li>\n<li>Generate qualified leads through outbound email campaigns, LinkedIn prospecting, and cold calls.</li>\n<li>Build and maintain a strong prospect pipeline in the CRM system.</li>\n<li>Understand Softnotions' service offerings and communicate value propositions to potential clients.</li>\n<li>Schedule and coordinate meetings or demos for the Business Development Manager or Technical Sales Team.</li>\n<li>Support RFP/RFI processes with background data and initial documentation.</li>\n<li>Maintain reports and dashboards to track outreach and conversion metrics.</li>\n<li>Collaborate with marketing and delivery teams to align messaging and client approach.</li>\n<li>Assist in proposal follow-ups, nurturing leads, and handling basic client queries.</li>\n</ul>\n<h3>Required Skills &amp; Attributes:</h3>\n<ul>\n<li>Strong communication skills – written and verbal (English proficiency is a must).</li>\n<li>Good understanding of technology trends, software development, and digital transformation concepts.</li>\n<li>High attention to detail, responsiveness, and follow-through.</li>\n<li>Positive attitude, growth mindset, and eagerness to learn.</li>\n<li><strong>Education:</strong> BSC/BTech (CS) + MBA (Marketing) Preferred.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Market Research",
            "Lead Generation",
            "CRM"
        ],
        "summary": "Trainee Inside Sales role at Softnotions. Responsibilities include market research, lead generation, and client communication. MBA Marketing preferred."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24348",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 24, Oct 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems is seeking a seasoned Technical Delivery Manager with 14+ years of experience to oversee the successful delivery of complex technical projects and solutions. The ideal candidate will possess a strong technology background, exceptional project management skills, and the ability to collaborate effectively with cross-functional teams. This role demands end-to-end ownership of project delivery, ensuring alignment with business objectives, managing stakeholder expectations, and driving technical excellence.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Project Delivery Management:</strong>\n- Oversee the planning, execution, and delivery of multiple technical projects.\n- Manage project scope, timelines, budgets, risks, and quality.\n- Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n<p><strong>Team Leadership:</strong>\n- Lead and mentor cross-functional technical teams, fostering collaboration and innovation.\n- Conduct regular performance reviews and provide growth opportunities for team members.</p>\n<p><strong>Stakeholder Engagement:</strong>\n- Act as a liaison between technical teams, business stakeholders, and clients.\n- Communicate project status, risks, and solutions effectively to all stakeholders.</p>\n<p><strong>Technical Expertise:</strong>\n- Collaborate with architects and engineers to define technical solutions.\n- Provide input on architecture, design, and implementation strategies.</p>\n<p><strong>Process Improvement:</strong>\n- Identify opportunities to enhance project delivery processes and tools.\n- Implement best practices in software development and delivery.</p>\n<p><strong>Risk and Issue Management:</strong>\n- Proactively identify project risks and develop mitigation strategies.\n- Resolve technical and operational challenges in a timely manner.</p>\n<p><strong>Customer Focus:</strong>\n- Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</p>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<p><strong>Experience:</strong>\n- 14 years of experience in technology delivery roles, including hands-on development and leadership.\n- Proven experience delivering large-scale, complex projects with diverse teams.\n- Manage P&amp;L for a portfolio of accounts, ensuring revenue growth and profitability.\n- Plan and manage team ramp-ups and ramp-downs using pyramid planning, external hiring, and internal sourcing.\n- Drive account management activities including financial tracking, invoice collection, margin improvements, and resource planning.\n- Build strong client relationships through regular interactions, QBRs, and on-site visits.\n- Support account mining by identifying new opportunities, preparing proposals, and influencing stakeholders to grow the business.</p>\n<p><strong>Technical Expertise:</strong>\n- Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.\n- Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</p>\n<p><strong>Project Management:</strong>\n- Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.\n- Certification such as PMP, CSM, or equivalent is an advantage.</p>\n<p><strong>Leadership and Communication:</strong>\n- Excellent team leadership, people management, and conflict resolution skills.\n- Strong communication, presentation, and negotiation abilities.</p>\n<p><strong>Education:</strong>\n- Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</p>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Experience managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices and frameworks.</li>\n<li>Strong business acumen with the ability to align technical goals with business strategy.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates should forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Be aware of fraudsters demanding fees for job offers. Reflections Info Systems never requests payment. We contact candidates via our official website or LinkedIn, and all official emails come from the HR email ID. Contact <strong>careers@reflectionsinfos.com</strong> for any clarifications or alerts.</p>",
        "tags": [
            "14+ Years",
            "Project Management",
            "Cloud Technologies",
            "Agile"
        ],
        "summary": "Seeking an experienced Technical Delivery Manager to oversee complex project delivery. Responsibilities include team leadership, stakeholder management, and driving technical excellence."
    },
    {
        "job_title": "Data Engineering - Project Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24347",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Data Engineering - Project Manager</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 24, Oct 2025</p>\n<h3>Introduction</h3>\n<p>We are looking for candidates with over 13 years of experience for this role.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Own the end-to-end delivery of data platform, AI, BI, and analytics projects, ensuring alignment with business objectives and stakeholder expectations.</li>\n<li>Develop and maintain comprehensive project plans, roadmaps, and timelines for data ingestion, transformation, governance, AI/ML models, and analytics deliverables.</li>\n<li>Lead cross-functional teams including data engineers, data scientists, BI analysts, architects, and business stakeholders to deliver high-quality, scalable solutions on time and within budget.</li>\n<li>Define, prioritize, and manage product and project backlogs covering data pipelines, data quality, governance, AI services, and BI dashboards or reporting tools.</li>\n<li>Collaborate closely with business units to capture and translate requirements into actionable user stories and acceptance criteria for data and analytics solutions.</li>\n<li>Oversee BI and analytics areas including dashboard development, embedded analytics, self-service BI enablement, and ad hoc reporting capabilities.</li>\n<li>Ensure data quality, lineage, security, and compliance requirements are integrated throughout the project lifecycle, in collaboration with governance and security teams.</li>\n<li>Coordinate UAT, performance testing, and user training to ensure adoption and successful rollout of data and analytics products.</li>\n<li>Act as the primary point of contact for all project stakeholders, providing regular status updates, managing risks and issues, and escalating as necessary.</li>\n<li>Facilitate agile ceremonies such as sprint planning, backlog grooming, demos, and retrospectives, fostering a culture of continuous improvement.</li>\n<li>Drive post-deployment monitoring and optimization of data and BI solutions to meet evolving business needs and performance standards.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Overall 13+ Years of Experience in IT with 6+ years of experience as a Technical Product Manager, Technical Program Manager, or Delivery Lead.</li>\n<li>Hands-on development experience in data engineering, including data pipelines, ETL processes, and data integration workflows.</li>\n<li>Proven track record managing data engineering, analytics, or AI/ML projects end to end.</li>\n<li>Solid understanding of modern data architecture: data lakes, warehouses, pipelines, ETL/ELT, governance, and AI tooling.</li>\n<li>Hands-on familiarity with cloud platforms (e.g., Azure, AWS, GCP) and DataOps/MLOps practices.</li>\n<li>Strong knowledge of Agile methodologies, sprint planning, and backlog grooming.</li>\n<li>Excellent communication and stakeholder management skills, including working with senior execs and technical leads.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Background in computer science, engineering, data science, or analytics.</li>\n<li>Experience or Solid Understanding with data engineering tools and services in AWS, Azure &amp; GCP.</li>\n<li>Exposure or Solid Understanding of BI, Analytics, LLMs, RAG, prompt engineering, or agent-based AI systems.</li>\n<li>Experience leading cross-functional teams in matrixed environments.</li>\n<li>Certifications: PMP, CSM, SAFe, or equivalent are a plus.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "13+ Years",
            "Data Engineering",
            "Project Management",
            "Agile"
        ],
        "summary": "Seeking an experienced Project Manager to lead data platform, AI, BI, and analytics projects. Must have strong data engineering, cloud, and Agile skills for end-to-end delivery."
    },
    {
        "job_title": "Technical Project Manager (Application Development)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24346",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Technical Project Manager (Application Development)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd</p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581</p>\n<p><strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 24, Oct 2025</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems is seeking a highly experienced Technical Project Manager (Tech PM) with 13+ years of overall IT experience, including 4-6 years in technical project management. The role involves leading end-to-end execution of custom application development and integration projects, primarily using .NET stacks with modern client frameworks and integration platforms. The ideal candidate must possess a strong technical background coupled with project delivery expertise to drive complex, cross-functional initiatives from discovery to production rollout. This position demands hands-on experience across the entire software/product development lifecycle (SDLC), encompassing planning, estimation, design, development, testing, and release, while collaborating closely with engineering, product, and client stakeholders.</p>\n<h3>Job Description</h3>\n<ul>\n<li>Manage end-to-end delivery of custom software development and integration projects utilizing Java, .NET, and related technologies.</li>\n<li>Develop and maintain comprehensive project plans, define project timelines, identify critical dependencies, and meticulously track project progress.</li>\n<li>Coordinate effectively with cross-functional teams, including developers, QA engineers, UI/UX designers, and DevOps specialists, to ensure seamless project execution.</li>\n<li>Oversee all phases of the Software Development Lifecycle (SDLC): requirements finalization, development, integration, comprehensive testing (unit, system, User Acceptance Testing (UAT), Non-Functional Requirements (NFR)), and deployment.</li>\n<li>Collaborate closely with architects and technical leads to ensure strict adherence to the defined technical direction and architectural design.</li>\n<li>Proactively identify, assess, and manage project risks, scope changes, and schedule adjustments.</li>\n<li>Act as the primary liaison for clients and stakeholders, providing regular status updates and efficiently resolving any arising issues.</li>\n<li>Ensure high-quality deliverables and timely project completion through effective team coordination and clear, consistent communication.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>\n<p><strong>Technical &amp; Delivery Expertise</strong></p>\n<ul>\n<li>13+ years of overall IT experience, with 4–6 years in Technical Project Management.</li>\n<li>Strong understanding of custom application development on Java/.NET stacks.</li>\n<li>Proven experience managing:<ul>\n<li>Backend/API development</li>\n<li>Integration using tools such as Apache Camel, IBM Integration Stack</li>\n<li>Database interactions with Oracle, SQL Server</li>\n<li>Client-side development using React/Angular</li>\n<li>Deployment on cloud platforms (AWS, Azure)</li>\n</ul>\n</li>\n<li>Familiarity with Microservices architecture, Continuous Integration/Continuous Deployment (CI/CD) pipelines, and DevOps practices.</li>\n</ul>\n</li>\n<li>\n<p><strong>Project Management</strong></p>\n<ul>\n<li>Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li>Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.</li>\n<li>Proficiency with project management tools: Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience managing globally distributed teams.</li>\n<li>Strong understanding of enterprise-level integrations and technology ecosystems.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Excellent communication and stakeholder engagement capabilities.</li>\n<li>Strong leadership, problem-solving, and organizational skills.</li>\n<li>Ability to articulate technical concepts clearly to both technical and non-technical audiences.</li>\n</ul>\n<h3>Important Notice Regarding Fraudulent Offers:</h3>\n<p>Interested candidates are invited to send their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current, and expected CTC details. Please be aware that some individuals may attempt to defraud job seekers by promising employment with Reflections Info Systems for a fee. Reflections Info Systems <strong>never</strong> requests payment for job opportunities. We communicate with candidates exclusively through our official website or LinkedIn. All employment-related emails will be sent from our official HR email address. For any clarifications or to report suspicious activity, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Java",
            "Project Management"
        ],
        "summary": "Seeking a Technical Project Manager with 13+ years of experience to lead application development projects. Requires strong technical skills in .NET/Java and end-to-end SDLC management."
    },
    {
        "job_title": "Web Designer / Digital Marketing",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24345",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Globcom Solutions (P) Ltd</h2>\n<p><strong>Module:</strong> 2502, 5th floor, Yamuna Building\n<strong>Address:</strong> Technopark Phase -3, Thiruvananthapuram , 695583\n<strong>Website:</strong> http://www.globcomsolution.com</p>\n<h2>Web Designer / Digital Marketing</h2>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<p><strong>Contact Email:</strong> rajesh@globcomsolution.com</p>\n<h3>Brief Description</h3>\n<p>Globcom Solutions is seeking a versatile professional with a minimum of 1 year of experience in both digital marketing and web design. This role is ideal for a dual specialist.</p>\n<h3>Role:</h3>\n<ul>\n<li>Dual Specialist – Digital Marketing &amp; Web Design</li>\n</ul>\n<h3>Skills Required:</h3>\n<ul>\n<li>SEO</li>\n<li>Google Ads</li>\n<li>Meta Ads</li>\n<li>Email Campaigns</li>\n<li>Website design (HTML, CSS, JavaScript, React, responsive layouts)</li>\n<li>UI/UX understanding and branding alignment</li>\n<li>Strong reporting and communication skills</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong reporting and communication skills</li>\n</ul>\n<h3>Experience:</h3>\n<ul>\n<li>Minimum 1 year</li>\n</ul>\n<h3>Additional Skills:</h3>\n<ul>\n<li>Web Development &amp; Design skill</li>\n<li>SEO</li>\n<li>Google Ads</li>\n<li>YouTube Ads</li>\n<li>A/B testing</li>\n<li>KPI reporting</li>\n</ul>\n<p><strong>To Apply:</strong> Send your CV to rajesh@globcomsolution.com</p>\n<p><strong>Location:</strong> Technopark TVM</p>",
        "tags": [
            "1+ Years",
            "Digital Marketing",
            "Web Design",
            "SEO"
        ],
        "summary": "Seeking a versatile Digital Marketing and Web Design specialist with 1+ years of experience. Responsibilities include SEO, ad campaigns, and website design using various technologies."
    },
    {
        "job_title": "Customer Service Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24344",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Customer Service Executive</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com</p>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/customer-success-executive</p>\n<p><strong>Closing Date:</strong> 19, Oct 2025\n<strong>Job Published:</strong> 17, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. We offer services like auto insurance, parking, and EV charging, utilizing cutting-edge AI, machine learning, and data analytics to provide innovative solutions. We have been featured by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and recognized as the top Product in Insurance by UnitQ.</p>\n<h3>Job Title: Customer Success/Service Executive</h3>\n<p><strong>Experience:</strong> 0 - 5 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused individual for our voice process team as a Customer Success Executive. This role requires delivering excellent customer service and professionally handling client inquiries via phone.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Address customer queries through phone, email, chat, and social media channels.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to products, orders, returns, and general support requests.</li>\n<li>Maintain accurate customer records and feedback in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking customer satisfaction metrics and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience (2-5 years) in customer service or a similar role is a plus.</li>\n<li>Freshers are welcome.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations professionally.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "0-5 Years",
            "Customer Service",
            "Voice Process",
            "CRM"
        ],
        "summary": "Customer Success Executive needed for Way.com's voice process team. Responsibilities include handling customer inquiries and resolving issues efficiently. Freshers welcome."
    },
    {
        "job_title": "Designer - UX/UI",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24342",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>UX Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/ux-designer</p>\n<p><strong>About Us:</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car owners. Recognized by Bloomberg and Andreessen Horowitz, we are transforming car ownership to be easier, more affordable, and rewarding.</p>\n<p><strong>Job Title:</strong> UX Designer\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview:</strong>\nWe are looking for a talented UX Designer with strong UI skills to collaborate with product and engineering teams. Your goal will be to create delightful user experiences for millions of car owners.</p>\n<p><strong>Roles and Responsibilities:</strong>\n- Collaborate with senior designers to translate requirements into seamless user journeys.\n- Conduct research and translate insights into wireframes and prototypes.\n- Create user-friendly, visually appealing interfaces for web and mobile.\n- Contribute to the design system and maintain consistency across products.\n- Participate in usability testing and iterative improvements.</p>\n<p><strong>Preferred Skills:</strong>\n- 2-4 years of UX/UI design experience.\n- Strong understanding of UX principles and interaction design.\n- Proficiency in Figma or similar tools.\n- Good visual/UI design sense with attention to detail.\n- Portfolio demonstrating UX problem-solving and polished UI work.</p>\n<p><strong>Why you will love working with us?</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Opportunity to make a meaningful impact across 10+ million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth in a rapidly scaling technology company.\n- Competitive compensation.</p>\n<p><strong>Closing Date:</strong> October 19, 2025\n<strong>Job Published:</strong> October 17, 2025</p>",
        "tags": [
            "2-4 Years",
            "UX/UI Design",
            "Figma",
            "Interaction Design"
        ],
        "summary": "Seeking a talented UX Designer with strong UI skills to create delightful experiences for millions of car owners. Collaborate with product and engineering teams to transform requirements into seamless user journeys."
    },
    {
        "job_title": "Senior Designer - UX",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24341",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Senior UX Designer - Way.com</h2>\n<p><strong>Location:</strong> Thiruvananthapuram, India\n<strong>Company:</strong> Way Dot Com (P) Ltd</p>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-uxui-designer</p>\n<h3>About Us</h3>\n<p>Way.com is America's dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions. Recognized by Bloomberg and Andreessen Horowitz, Way.com is making car ownership easier, more affordable, and rewarding.</p>\n<h3>Job Title</h3>\n<p>Senior UX Designer</p>\n<h3>Work Arrangement</h3>\n<p>On-site</p>\n<h3>Employment Type</h3>\n<p>Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Senior UX Designer with exceptional UX thinking and a strong UI eye to craft world-class experiences for Way.com's car super-app, influencing millions of users. You will be instrumental in designing key product flows.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead end-to-end design of core product experiences.</li>\n<li>Solve complex user problems with simple, intuitive interfaces.</li>\n<li>Collaborate closely with Product, Engineering, and Marketing teams to align business goals with user needs.</li>\n<li>Elevate design quality by mentoring team members and establishing design standards.</li>\n<li>Build and validate design solutions through research, prototyping, and usability testing.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li><strong>6+ years of experience</strong> in UX design with strong UI design capabilities.</li>\n<li>Expertise in user-centered design principles and modern design tools (e.g., Figma).</li>\n<li>A strong portfolio showcasing impactful product design work.</li>\n<li>Ability to clearly communicate design rationale to stakeholders.</li>\n<li>Experience leading design for large-scale web and mobile products is a plus.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Closing Date:</strong> October 19, 2025\n<strong>Job Published:</strong> October 17, 2025</p>",
        "tags": [
            "6+ Years",
            "UX Design",
            "UI Design",
            "Figma"
        ],
        "summary": "Seeking a Senior UX Designer to lead product experience design. This role involves solving complex user problems with intuitive interfaces and collaborating with cross-functional teams. Requires 6+ years of experience and strong portfolio."
    },
    {
        "job_title": "Senior Executive - Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24340",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Senior Executive - Operations</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>About Us</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded the top Product in Insurance by UnitQ, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Senior Operations Executive\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview</strong>\nWe are seeking an experienced Senior Operations Executive with expertise in operations management and process optimization.</p>\n<p><strong>Roles and Responsibilities</strong>\n- Manage daily operations in the Airport Parking vertical.\n- Ensure operational efficiency and effectiveness.\n- Oversee and improve various operational processes.\n- Coordinate with different teams and stakeholders to achieve operational goals.\n- Deliver excellent customer service to our clients.</p>\n<p><strong>Preferred Skills</strong>\n- Strong interpersonal and communication skills (verbal and written).\n- Experience in operations management and process optimization.\n- Analytical skills for problem-solving and data analysis.\n- Ability to work well in a team and collaborate effectively.\n- Excellent organizational and multitasking abilities.\n- Attention to detail and ability to prioritize tasks.\n- Flexibility to work in night shifts and weekends.\n- Eager to learn and adapt to new challenges.\n- Experience in the automotive industry is a plus.\n- Bachelor's degree in business administration or a related field.\n- Strong Excel and Data Handling skills.</p>\n<p><strong>Why you will love working with us?</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Opportunity to make a meaningful impact across 10+ million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth in a rapidly scaling technology company.\n- Competitive compensation.</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-operations-executive</p>",
        "tags": [
            "5+ Years",
            "Operations Management",
            "Process Optimization",
            "Excel"
        ],
        "summary": "Seeking an experienced Senior Operations Executive for Way.com's Airport Parking vertical. Responsibilities include managing daily operations, ensuring efficiency, and improving processes. Requires strong analytical and communication skills."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24339",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Manager - Project</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com\n<strong>Closing Date:</strong> October 19, 2025\n<strong>Job Published:</strong> October 17, 2025</p>\n<p><strong>About Us</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We use AI, machine learning, and data analytics to offer innovative solutions. Recognized by Bloomberg and Andreessen Horowitz, we are making car ownership easier and more affordable.</p>\n<p><strong>Job Title:</strong> Project Manager\n<strong>Experience:</strong> 8+ years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a seasoned Project Manager with 8+ years of experience to lead strategic projects from start to finish. The ideal candidate will possess strong leadership, domain expertise, and execution skills to ensure successful project delivery within scope, timeline, and budget.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Lead the full project lifecycle for multiple medium to large-scale initiatives.</li>\n<li>Define and manage project scope, objectives, deliverables, and success criteria.</li>\n<li>Develop and execute detailed project plans, including resource allocation, timelines, and budgets.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate issues as needed.</li>\n<li>Manage stakeholder relationships, ensuring clear communication and alignment across all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams for smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes and policies.</li>\n<li>Mentor and guide junior team members to enhance project management capabilities.</li>\n<li>Promote best practices and continuous improvement in project delivery.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s degree in Engineering, Business Administration, or a related field (Master’s degree is an advantage).</li>\n<li>8+ years of proven project management experience, preferably in a fintech platform.</li>\n<li>Strong expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in project management tools such as MS Project, JIRA, Asana, Trello, or similar.</li>\n<li>In-depth knowledge of Agile, Waterfall, or hybrid project management methodologies.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities under pressure.</li>\n<li>Certifications like PMP, PRINCE2, or Agile (Scrum Master/SAFe) are highly preferred.</li>\n<li>Experience with tools like MPP.</li>\n<li>Ability to work with multiple teams and drive for execution and results.</li>\n</ul>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a meaningful impact on over 10 million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/project-manager</p>",
        "tags": [
            "8+ Years",
            "Project Management",
            "Agile",
            "Fintech"
        ],
        "summary": "Seeking an experienced Project Manager to lead strategic initiatives. Drive projects from initiation to completion ensuring scope, timeline, and budget adherence."
    },
    {
        "job_title": "iOS Team Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24338",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>iOS Team Lead</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>About Us</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services including auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions for car ownership. We have been recognized by Bloomberg and ranked highly among fast-growing companies worldwide, making car ownership easier, more affordable, and rewarding.</p>\n<p><strong>Job Title:</strong> iOS Technical Lead\n<strong>Experience Required:</strong> 10–15 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Closing Date:</strong> October 19, 2025\n<strong>Job Published:</strong> October 17, 2025</p>\n<p><strong>Role Overview</strong>\nWe are seeking a seasoned iOS Technical Lead with proven expertise in Swift to lead the full iOS application development lifecycle. You will be responsible for architecting scalable, high-performance mobile solutions, mentoring the development team, and ensuring our products deliver exceptional user experiences.</p>\n<p><strong>Key Responsibilities</strong>\n- <strong>iOS Development Leadership:</strong> Lead end-to-end app development with Swift, delivering scalable, efficient, and high-quality solutions.\n- <strong>Cross-Functional Collaboration:</strong> Partner with Product Managers and Designers to transform requirements into seamless, user-friendly mobile experiences.\n- <strong>Performance Optimization:</strong> Improve app responsiveness, stability, and performance across multiple iOS devices and OS versions.\n- <strong>Mentorship &amp; Code Quality:</strong> Conduct code reviews, enforce best coding standards, and mentor junior developers to elevate overall team output.\n- <strong>Testing &amp; Documentation:</strong> Ensure app reliability through thorough unit testing, clear documentation, and adherence to clean architecture practices.\n- <strong>Backend &amp; API Integration:</strong> Work with backend teams to enable secure, efficient, and smooth API integrations.\n- <strong>Innovation &amp; Improvement:</strong> Drive adoption of new tools, processes, and best practices to accelerate development and improve quality.\n- <strong>Feature Ownership:</strong> Take complete ownership of features from design to deployment, including post-release monitoring and optimization.\n- <strong>Continuous Learning:</strong> Keep pace with evolving iOS technologies to deliver modern, future-ready solutions.</p>\n<p><strong>Preferred Skills</strong>\n- 10+ years of mobile app development experience, including 6+ years in iOS development.\n- Deep expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.\n- Strong understanding of RESTful APIs, JSON parsing, and third-party library integration.\n- Skilled in architecting complex mobile apps using modular design patterns such as MVVM, MVI, or MVP.\n- Proficient in CI/CD workflows, automated testing, code review processes, and App Store deployments.\n- Demonstrated leadership in team management and mentoring iOS developers.\n- Experience with tools like Firebase, Mixpanel, or equivalent analytics/crash reporting platforms.\n- Solid understanding of web application ecosystems and cross-platform compatibility challenges.</p>\n<p><strong>Nice to Have:</strong>\n- Hands-on experience with Core Bluetooth, Core Location, or real-time service integrations (e.g., EV charging or roadside assistance).\n- Background in mobility, transportation, or automotive technology platforms.\n- Familiarity with Kotlin Multiplatform or other cross-platform development frameworks.</p>\n<p><strong>Why you will love working with us?</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Opportunity to make a meaningful impact across 10+ million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth in a rapidly scaling technology company.\n- Competitive compensation.</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/ios-technical-lead</p>",
        "tags": [
            "10+ Years",
            "Swift",
            "iOS Development",
            "Team Leadership"
        ],
        "summary": "Lead iOS application development using Swift, focusing on architecture, team mentorship, and exceptional user experiences. Requires 10-15 years of experience."
    },
    {
        "job_title": "Team Lead - SEO",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24337",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Team Lead - SEO</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Closing Date:</strong> October 19, 2025\n<strong>Published:</strong> October 17, 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership. Recognized by Bloomberg and Andreessen Horowitz, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Team Lead - SEO</h3>\n<p><strong>Experience:</strong> 9 - 11 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a highly skilled Team Lead, SEO to lead our organic growth initiatives and enhance our search engine presence. This leadership role involves driving the development and execution of comprehensive SEO strategies, managing a team of SEO specialists, and collaborating cross-functionally to optimize our digital footprint. Ideal candidates possess a deep understanding of search algorithms, technical SEO, content strategy, and a passion for driving results.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies:</strong> Define and implement a robust SEO roadmap aligned with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team:</strong> Manage a team of SEO professionals, fostering a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO:</strong> Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management:</strong> Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making:</strong> Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration:</strong> Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization:</strong> Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis:</strong> Conduct SEO audits, monitor competitor strategies, and identify new opportunities.</li>\n<li><strong>SEO Performance Reporting:</strong> Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data to make data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li>Understanding of PPC advertising and its relationship with organic search.</li>\n<li>Experience working in a high-growth startup or fast-paced environment.</li>\n<li>Familiarity with social media marketing and its impact on SEO.</li>\n<li>Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead</p>",
        "tags": [
            "9-11 Years",
            "SEO",
            "Google Analytics",
            "SEMrush"
        ],
        "summary": "Lead SEO strategies and team for America's #1 auto super app. Drive organic growth through technical SEO, content, and data analysis. Requires 9-11 years of experience."
    },
    {
        "job_title": "Social Media - Marketing Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24336",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Social Media Marketing Manager at Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/manager-social-media-marketing\n<strong>Closing Date:</strong> October 19, 2025\n<strong>Job Published:</strong> October 17, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide innovative and personalized solutions. Recognized by Bloomberg and Andreessen Horowitz, we aim to make car ownership easier, affordable, and rewarding.</p>\n<h3>Job Title</h3>\n<p>Social Media Marketing Manager</p>\n<h3>Experience</h3>\n<p>9 to 12 Years</p>\n<h3>Work Arrangement</h3>\n<p>On-site</p>\n<h3>Employment Type</h3>\n<p>Full-time</p>\n<h3>Role Overview</h3>\n<p>Way.com is seeking a creative, strategic, and results-oriented Social Media Marketing Manager to lead our brand's digital growth. This role involves owning the strategy and execution of our social media presence to drive brand awareness, deepen community engagement, and foster meaningful interactions across multiple platforms. Collaboration with cross-functional teams is essential to deliver a unified, data-driven social strategy that amplifies our brand voice and achieves measurable business impact.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Strategic Leadership:</strong> Define and implement platform-specific strategies aligned with Way.com’s brand voice, identity, and growth objectives, ensuring consistency and innovation.</li>\n<li><strong>Content Strategy &amp; Execution:</strong> Lead the planning, creation, and scheduling of engaging content for platforms including Instagram, Facebook, LinkedIn, X/Twitter, and TikTok, optimized for reach and performance.</li>\n<li><strong>Community Management:</strong> Manage daily interactions, respond to comments and messages in a brand-consistent manner, and cultivate an engaged online community.</li>\n<li><strong>Brand Growth &amp; Advocacy:</strong> Design and launch creative campaigns to deepen emotional connections, foster loyalty, and encourage user advocacy.</li>\n<li><strong>Analytics &amp; Optimization:</strong> Monitor KPIs, analyze performance data, and continuously refine strategies to maximize ROI, reach, and engagement.</li>\n<li><strong>Influencer &amp; Partnership Development:</strong> Identify, engage, and collaborate with influencers, creators, and partners to expand brand presence.</li>\n<li><strong>Trend &amp; Innovation Leadership:</strong> Stay informed about emerging trends, platform updates, and tools to maintain a competitive brand presence.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with design, content, product, and customer support teams for cohesive messaging and impactful campaigns.</li>\n<li><strong>Budget &amp; Resource Management:</strong> Oversee social media budgets and allocate resources for maximum ROI.</li>\n<li><strong>Reputation Management:</strong> Monitor brand sentiment, address feedback proactively, and protect Way.com’s reputation across platforms.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, or a related field (Master’s degree is a plus).</li>\n<li>Minimum 9 years of experience in social media marketing with a proven track record of successful campaigns and brand growth.</li>\n<li>Deep understanding of major social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.) and their business development roles.</li>\n<li>Proficiency in social media management tools (e.g., Hootsuite, Sprout Social, Buffer) and analytics tools (e.g., Google Analytics, Socialbakers).</li>\n<li>Exceptional communication and leadership skills.</li>\n<li>Strong creative acumen combined with strategic thinking.</li>\n<li>Expertise in paid social media strategies and advertising.</li>\n<li>Ability to manage multiple projects efficiently under tight deadlines.</li>\n<li>Passion for digital innovation and staying current with social media trends and technologies.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "9+ Years",
            "Social Media Marketing",
            "Content Strategy",
            "Community Management"
        ],
        "summary": "Seeking a Social Media Marketing Manager with 9-12 years of experience to lead digital growth. Responsibilities include strategy, content execution, community engagement, and analytics across platforms."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24335",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Customer Success Executive - Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 19, Oct 2025\n<strong>Job Published:</strong> 17, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. We offer services like auto insurance, parking, and EV charging, leveraging AI, machine learning, and data analytics to provide innovative solutions. We've been recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ.</p>\n<h3>Job Title: Customer Success Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused individual to join our voice process team as a Customer Success Executive. This role is crucial for delivering excellent customer service, managing inquiries over the phone professionally and efficiently.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Address customer queries through phone, email, chat, and social media channels.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to products, orders, returns, and general support requests.</li>\n<li>Maintain accurate customer records and feedback in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking customer satisfaction metrics and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proven experience (2-5 years) in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<h3>Why You Will Love Working with Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/customer-success-executive</p>",
        "tags": [
            "2-5 Years",
            "Customer Service",
            "CRM",
            "Communication Skills"
        ],
        "summary": "Customer Success Executive role at Way.com, a US auto super app. Responsibilities include handling customer inquiries and resolving issues via phone and other channels."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24334",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\n<strong>Published Date:</strong> 17-Oct-2025\n<strong>Closing Date:</strong> 19-Oct-2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, we are simplifying and enhancing the car ownership experience.</p>\n<h3>Job Title: Spanish Customer Success Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused Spanish Customer Success Executive for our voice process team. This role is crucial for providing excellent customer service to our Spanish-speaking clients, professionally and efficiently handling all phone inquiries.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction:</strong> Manage inbound and outbound calls, providing prompt and effective resolutions for customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence:</strong> Deliver empathetic and professional support to ensure a positive customer experience in every interaction.</li>\n<li><strong>Issue Escalation:</strong> Identify, prioritize, and escalate complex cases to the relevant departments for swift resolution.</li>\n<li><strong>Documentation:</strong> Maintain accurate records of all customer interactions and ensure databases are up-to-date.</li>\n<li><strong>Performance Goals:</strong> Consistently meet or exceed targets for customer satisfaction, first-call resolution, and overall productivity.</li>\n<li><strong>Product Knowledge:</strong> Stay well-informed about company products and services to provide accurate and current information to customers.</li>\n<li><strong>Team Collaboration:</strong> Work collaboratively with colleagues to foster a supportive and high-performing work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Fluency in both <strong>Spanish and English</strong> (written and spoken) is essential for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably within a voice process environment.</li>\n<li>Strong interpersonal and communication skills, characterized by a patient and empathetic approach.</li>\n<li>Ability to multitask effectively and manage time efficiently in a fast-paced setting.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is considered an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Make a meaningful impact on over 10 million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear pathways for career growth within a rapidly scaling technology company.</li>\n<li>Receive competitive compensation.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Spanish",
            "Customer Service",
            "Voice Process"
        ],
        "summary": "Seeking a Spanish Customer Success Executive for a voice process role. Responsibilities include customer interaction, issue resolution, and service excellence for Spanish-speaking clients."
    },
    {
        "job_title": "Product Team Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24333",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com</p>\n<h2>Product Team Manager</h2>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 19, Oct 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions that redefine car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, we are making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Product Manager</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Product Manager to lead the development and delivery of impactful product features that enhance user experience and drive business growth. You will collaborate closely with engineering, design, and data teams to rapidly transform innovative ideas into market-ready solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>End-to-End Product Ownership:</strong> Drive product features from ideation to launch, ensuring alignment with business goals and delivery of high-quality outcomes.</li>\n<li><strong>Data-Driven Decision Making:</strong> Leverage analytics and user feedback to identify opportunities and implement impactful product enhancements.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with engineering, design, and data teams to deliver seamless, timely product releases.</li>\n<li><strong>Performance Management:</strong> Track product performance metrics and execute strategies to maximize growth, retention, and engagement.</li>\n<li><strong>Stakeholder Alignment:</strong> Clearly communicate priorities, timelines, and progress to stakeholders, ensuring transparency and alignment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 3–7 years of experience in product management.</li>\n<li><strong>Product Strategy &amp; Roadmapping:</strong> Defining product vision, goals, long-term plans, and translating them into a prioritized roadmap.</li>\n<li><strong>Data-Driven Decision Making:</strong> Using quantitative and qualitative data to inform choices, validate assumptions, and measure product performance.</li>\n<li><strong>User-Centric Design Thinking:</strong> Applying a creative, iterative problem-solving approach focused on user needs.</li>\n<li><strong>Stakeholder Management:</strong> Building and maintaining positive relationships with stakeholders, ensuring alignment and effective communication.</li>\n<li><strong>Agile Product Development:</strong> Utilizing flexible, iterative methods for quick development and delivery, adapting to feedback.</li>\n<li><strong>Market &amp; Competitive Analysis:</strong> Researching industry trends, customer behavior, and competitor offerings.</li>\n<li><strong>A/B Testing &amp; Experimentation:</strong> Comparing product variations to determine optimal performance.</li>\n<li><strong>Go-To-Market Execution:</strong> Planning and executing successful product launches, including positioning, messaging, and channel selection.</li>\n<li><strong>Wireframing &amp; Prototyping:</strong> Creating visual blueprints and interactive mockups for concept testing and development guidance.</li>\n<li><strong>User Research:</strong> Collecting and analyzing user feedback, observations, and data to understand behaviors, needs, and motivations.</li>\n<li><strong>Education:</strong> Bachelor’s degree in Engineering or an MBA from a Tier 1 institute.</li>\n<li><strong>Track Record:</strong> Proven track record of launching successful user-facing products.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Apply Here</h3>\n<p>https://waydot.greythr.com/hire/jobs/product-manager</p>",
        "tags": [
            "3-7 Years",
            "Product Management",
            "Data-Driven Decision Making",
            "Agile Product Development"
        ],
        "summary": "Product Manager needed for Way.com to drive feature development and user experience. Collaborate with cross-functional teams to launch impactful solutions and achieve business growth."
    },
    {
        "job_title": "Performance Marketing Manager - SEM",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24332",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Address:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Website:</strong> http://www.way.com</p>\n<h2>Performance Marketing Manager - SEM</h2>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 19, Oct 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering over 10 million customers with services including auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to offer innovative, personalized solutions. Recognized by Bloomberg and Andreessen Horowitz, we are simplifying car ownership.</p>\n<h3>Job Title: Digital Marketing Manager / Performance Marketing Manager</h3>\n<h3>Experience: 6 to 8 Years</h3>\n<h3>Work Arrangement: On-site</h3>\n<h3>Employment Type: Full-time</h3>\n<h3>Role Overview</h3>\n<p>We are seeking a data-driven Digital Marketing / Performance Marketing Manager to lead our paid media efforts, focusing on Search Engine Marketing (SEM) across Google Ads, Bing Ads, and other platforms. You will drive performance across key verticals such as Airport Parking, City Parking, Auto Insurance, and Car Repair &amp; Maintenance. This role is ideal for individuals with experience managing high-scale budgets and executing award-winning campaigns.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, launch, and optimize high-performance SEM campaigns to meet traffic, conversion, and revenue goals.</li>\n<li>Conduct comprehensive keyword research, structure campaigns effectively, and perform A/B testing on ads and landing pages.</li>\n<li>Track and analyze key performance metrics (CTR, CPC, CVR, ROAS) to identify opportunities for scalability and efficiency.</li>\n<li>Collaborate with cross-functional teams (analytics, product, content, design) for campaign execution and iteration.</li>\n<li>Leverage beta features, automation tools, and emerging ad formats to maintain a competitive advantage.</li>\n<li>Develop and present detailed performance reports, insights, and strategic recommendations to stakeholders.</li>\n<li>Ensure full compliance with platform advertising policies and maintain strong quality scores.</li>\n<li>Stay updated on AI-driven innovations in digital advertising and adopt new features from Google, Meta, Microsoft, and other major platforms.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>6+ years of hands-on experience in digital/performance marketing, with a strong SEM focus.</li>\n<li>Experience managing $100K+/month in paid media spend, preferably for US-based markets.</li>\n<li>Proficiency in Google Ads, Bing Ads, and tools like Google Analytics, Looker Studio, SA360.</li>\n<li>Proven expertise with AI-powered advertising solutions (e.g., Google Performance Max, Meta Advantage+, DSA, automated audience expansion).</li>\n<li>Google Ads Certification required; Meta Blueprint or multi-channel expertise is a plus.</li>\n<li>Prior experience in e-commerce, mobility, or booking-based platforms is highly desirable.</li>\n<li>Exposure to beta product testing, new feature launches, or award-winning campaigns is a strong advantage.</li>\n<li>Agency background with multi-client and multi-platform experience is a plus.</li>\n<li>Excellent analytical, project management, and communication skills.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>",
        "tags": [
            "6-8 Years",
            "SEM",
            "Google Ads",
            "Performance Marketing"
        ],
        "summary": "Lead paid media SEM efforts for America's dominant auto super app. Drive performance across key verticals using data-driven strategies and advanced tools."
    },
    {
        "job_title": "Business Executive - Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24331",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Location:</strong> Thiruvananthapuram\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/business-operations-executive\n<strong>Closing Date:</strong> October 19, 2025\n<strong>Job Published:</strong> October 17, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America's dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz's Marketplace 100, and rated #1 Product in Insurance by UnitQ, we are dedicated to making car ownership easier, more affordable, and rewarding.</p>\n<h3>Job Title: Business Operations Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>Way.com seeks a detail-driven and proactive <strong>Business Operations Executive</strong> to ensure efficient and high-quality operations within our <strong>Airport Parking division</strong>. The role involves managing daily workflows, coordinating with internal teams, maintaining vendor relationships, and resolving operational challenges to guarantee seamless service delivery. This position is ideal for individuals who excel in fast-paced environments, think strategically about operations, and are committed to delivering exceptional results.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Operational Oversight:</strong> Oversee daily operations to ensure timely, efficient, and high-quality service delivery.</li>\n<li><strong>Process Improvement:</strong> Identify gaps, streamline workflows, and escalate critical issues to minimize disruptions.</li>\n<li><strong>Data Management &amp; Reporting:</strong> Maintain accurate records, trackers, and reports to support data-driven decision-making.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with internal teams to align operational processes with business objectives and enhance efficiency.</li>\n<li><strong>Vendor &amp; Stakeholder Management:</strong> Serve as the primary point of contact for vendors and partners, ensuring SLA adherence, clear communication, and prompt issue resolution.</li>\n<li><strong>Customer Experience:</strong> Deliver superior service standards, address operational needs swiftly, and ensure customer satisfaction.</li>\n<li><strong>Adaptability &amp; Special Projects:</strong> Contribute to ad-hoc initiatives and be flexible for evening, night, or weekend support as required.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong verbal and written communication skills for effective engagement with teams and stakeholders.</li>\n<li>Excellent organizational and multitasking capabilities with proven ability to manage competing priorities.</li>\n<li>High attention to detail and a proactive, solution-oriented approach to problem-solving.</li>\n<li>Analytical mindset with the ability to interpret data and identify trends.</li>\n<li>Proficiency in Microsoft Excel (intermediate to advanced level) is mandatory.</li>\n<li>Collaborative team player who can also work independently.</li>\n<li>Willingness to work night shifts and weekends based on business needs.</li>\n<li>Adaptability and eagerness to learn in a dynamic, fast-paced environment.</li>\n<li>Prior experience in business operations or the automotive industry is advantageous, though not required.</li>\n</ul>\n<h3>Why you will love working with us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Chance to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Operations Management",
            "Microsoft Excel",
            "Vendor Management"
        ],
        "summary": "Seeking a Business Operations Executive for Airport Parking division. Responsibilities include operational oversight, process improvement, and vendor management. Requires strong analytical and communication skills."
    },
    {
        "job_title": "Sales and Business Development Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24330",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd - Business Development Executive</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 19, Oct 2025\n<strong>Job Published:</strong> 17, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers through services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions that transform car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and named the top Product in Insurance by UnitQ, Way.com is committed to making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Business Development Executive</h3>\n<p><strong>Experience:</strong> 3 to 5 Years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a driven and results-oriented Business Development Executive to accelerate our market growth. In this role, you will identify new business opportunities, build and nurture strong client relationships, and close high-value deals that directly contribute to our revenue and market expansion. If you thrive in a target-driven environment and excel at turning prospects into long-term partners, this role is for you.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Lead Generation:</strong> Source, engage, and qualify prospective clients through calls, personalized emails, and digital outreach.</li>\n<li><strong>Sales Presentations:</strong> Craft and deliver persuasive proposals that highlight solutions and communicate clear value propositions.</li>\n<li><strong>CRM Management:</strong> Accurately update and manage prospect data, monitor pipeline progress, and ensure timely follow-ups within the CRM.</li>\n<li><strong>Target Achievement:</strong> Consistently achieve or exceed sales goals and KPIs to drive revenue growth.</li>\n<li><strong>Relationship Management:</strong> Build and nurture long-term client relationships to encourage loyalty, repeat business, and high-value referrals.</li>\n<li><strong>Reporting &amp; Analysis:</strong> Generate detailed sales reports and provide actionable insights to enhance productivity.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience in B2B sales with a track record of consistently meeting or exceeding targets.</li>\n<li>3–5 years of sales experience; prior exposure to the e-commerce sector is a strong advantage.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong negotiation, persuasion, and relationship management capabilities.</li>\n<li>Self-motivated, goal-driven, and able to work independently with minimal supervision.</li>\n<li>Proficiency in CRM software (e.g., Zoho) and Microsoft Office Suite.</li>\n<li>Resilient and positive mindset with the ability to handle rejection and bounce back quickly.</li>\n<li>Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<h3>Why you will love working with us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Make a meaningful impact across a growing base of 10+ million users.</li>\n<li>Join a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/business-development-manager</p>",
        "tags": [
            "3-5 Years",
            "B2B Sales",
            "CRM Software",
            "Relationship Management"
        ],
        "summary": "Seeking a Business Development Executive with 3-5 years of B2B sales experience. Drive market growth by identifying opportunities, building relationships, and closing deals for America's dominant automotive super app."
    },
    {
        "job_title": "Senior Engineer - QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24329",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/senior-qa-engineer</p>\n<p><strong>Closing Date:</strong> October 19, 2025\n<strong>Job Published:</strong> October 17, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions that redefine car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, Way.com is committed to making car ownership easier, more affordable, and rewarding.</p>\n<h3>Job Title &amp; Details</h3>\n<ul>\n<li><strong>Title:</strong> Senior QA Automation Engineer</li>\n<li><strong>Experience Required:</strong> 5–8 years</li>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n</ul>\n<h3>Role Overview</h3>\n<p>We are looking for an experienced Senior QA Automation Engineer with a strong background in Java-based test automation. This role involves designing and maintaining scalable automation frameworks, developing comprehensive testing strategies, and collaborating with cross-functional teams to integrate quality assurance throughout the software development lifecycle.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Test Strategy &amp; Design:</strong> Develop detailed test strategies and plans based on complex business requirements, ensuring complete test coverage.</li>\n<li><strong>Automation Frameworks:</strong> Design, build, and enhance scalable automation frameworks using Core Java and modern testing tools.</li>\n<li><strong>Collaboration &amp; Quality Ownership:</strong> Work closely with developers, product managers, and QA teams to embed quality across all stages of the software development lifecycle.</li>\n<li><strong>Functional &amp; E2E Testing:</strong> Conduct thorough functional and end-to-end testing to verify accuracy, performance, and user experience.</li>\n<li><strong>Automation Execution:</strong> Create and execute automated test scripts for web and API testing using Selenium WebDriver, Rest Assured, and related technologies.</li>\n<li><strong>CI/CD Enablement:</strong> Integrate test automation into CI/CD pipelines (e.g., Jenkins) to support continuous testing and accelerate release cycles.</li>\n<li><strong>Issue Resolution:</strong> Monitor, troubleshoot, and resolve automation failures to ensure test suite reliability.</li>\n<li><strong>Documentation &amp; Standards:</strong> Develop and maintain reusable test cases, structured scripts, and clear documentation for scalability.</li>\n<li><strong>Defect Tracking:</strong> Record, track, and collaborate with engineering teams on timely defect resolution and quality delivery.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Minimum 5 years of experience in test automation using Java.</li>\n<li>Strong knowledge of Core Java, including object-oriented principles, exception handling, multi-threading, and file handling.</li>\n<li>Proficiency in Java Collections (Lists, Sets, Maps, Queues) with a solid understanding of data structures and algorithms.</li>\n<li>Hands-on experience with Selenium WebDriver, including dynamic element handling, custom wait strategies, and cross-browser compatibility.</li>\n<li>Proficiency in REST API testing using Rest Assured, covering request modeling, authentication, and API validation.</li>\n<li>Experience with Jenkins or similar CI/CD tools for test suite integration and automation pipeline management.</li>\n<li>Familiarity with load and performance testing tools (e.g., JMeter, K6, Locust) and the ability to identify performance bottlenecks.</li>\n<li>Strong attention to detail, problem-solving abilities, and the capacity to work independently and collaboratively in a fast-paced environment.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to contribute to the #1 Auto Super app in the US.</li>\n<li>Make a significant impact on over 10 million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Receive competitive compensation.</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Seeking a Senior QA Automation Engineer with 5-8 years of Java-based automation experience. Responsibilities include designing frameworks, executing tests, and integrating with CI/CD pipelines."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24328",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Senior Java Developer - Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 19, Oct 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-java-developer</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, Andreessen Horowitz, and UnitQ, we are making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Senior Java Engineer</h3>\n<p><strong>Experience Required:</strong> 5–12 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced Senior Java Developer with deep expertise in Java, Spring Boot, MySQL, and RESTful APIs. This role involves architecting, developing, and optimizing high-performance, scalable applications, establishing technical standards, and mentoring junior team members.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Build, enhance, and maintain Java applications leveraging the Spring Boot framework, ensuring robust, scalable, and high-quality solutions.</li>\n<li>Partner with Product Owners, Architects, and other stakeholders to convert business needs into effective technical designs.</li>\n<li>Develop and integrate RESTful APIs to support application features and streamline system interoperability.</li>\n<li>Continuously improve application performance through code optimization, refactoring, and scalability enhancements.</li>\n<li>Lead code reviews, guide and mentor junior developers, and help drive adoption of best engineering practices.</li>\n<li>Keep abreast of advancements in the Java ecosystem and proactively apply relevant technologies.</li>\n<li>Diagnose, troubleshoot, and resolve complex technical issues to maintain system stability and reliability.</li>\n<li>Uphold industry standards and organizational guidelines throughout the software development lifecycle.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent work experience).</li>\n<li>Minimum of 5+ years of professional Java development experience, with strong proficiency in Spring Boot and MySQL.</li>\n<li>In-depth knowledge of Java SE and Java EE concepts, including multi-threading, design patterns, and JVM internals.</li>\n<li>Solid experience in designing and implementing RESTful APIs.</li>\n<li>Proficiency in MySQL (or other relational databases) and writing efficient SQL queries.</li>\n<li>Familiarity with modern version control tools, particularly Git.</li>\n<li>Experience working within Agile methodologies (Scrum, Kanban, etc.).</li>\n<li>Strong problem-solving, debugging, and troubleshooting skills.</li>\n<li>Excellent communication skills and ability to collaborate in a team environment.</li>\n<li>Proven ability to mentor and guide junior developers.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-java-developer</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Seeking a Senior Java Developer with 5-12 years of experience. Responsibilities include developing scalable Java applications using Spring Boot and RESTful APIs, and mentoring junior developers."
    },
    {
        "job_title": "Senior Frontend developer - React.js",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24327",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Frontend Developer - React.js</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>Experience - 5 years</p>\n<p>We are seeking a highly skilled and experienced Front-End Developer with a minimum of 5 years of professional experience to join our dynamic team. The ideal candidate will be proficient in building robust, scalable, and high-performance web applications using React.js, Next.js, and TypeScript. You will play a crucial role in designing, developing, and maintaining user-centric interfaces, ensuring an exceptional user experience across various platforms.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and implement responsive and accessible user interfaces using React.js, Next.js, and TypeScript.</li>\n<li>Translate UI/UX designs and wireframes into high-quality code, ensuring visual fidelity and adherence to design specifications.</li>\n<li>Build reusable components and front-end libraries for future use, promoting code consistency and efficiency.</li>\n<li>Collaborate closely with product managers, UI/UX designers, and back-end developers to define requirements and deliver integrated solutions.</li>\n<li>Optimize application performance, ensuring fast loading times, smooth interactions, and efficient resource utilization.</li>\n<li>Implement and maintain state management solutions within React applications (e.g., Redux, Recoil, Context API).</li>\n<li>Write clean, maintainable, and well-documented code, adhering to best practices and coding standards.</li>\n<li>Conduct thorough testing and debugging of front-end components and features.</li>\n<li>Participate in code reviews, providing constructive feedback and ensuring code quality.</li>\n<li>Stay updated with emerging front-end technologies, trends, and best practices, and advocate for their adoption where appropriate.</li>\n<li>Troubleshoot and resolve front-end issues, bugs, and performance bottlenecks.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Minimum of 5 years of professional experience in front-end web development.</li>\n<li>Expert-level proficiency in React.js, including modern React features (Hooks, Context API, etc.).</li>\n<li>Strong command of TypeScript for building type-safe and maintainable codebases.</li>\n<li>Solid understanding of HTML5, CSS3, and JavaScript.</li>\n<li>Experience with state management libraries (e.g., Redux, MobX, Recoil) and data fetching libraries (e.g., React Query, SWR).</li>\n<li>Proficiency with version control systems, particularly Git.</li>\n<li>Familiarity with testing frameworks (e.g., Jest, React Testing Library).</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and collaboration skills, with the ability to work effectively in a team environment.</li>\n</ul>\n<p><strong>Nice to have:</strong> Next.js experience</p>",
        "tags": [
            "5+ Years",
            "React.js",
            "TypeScript",
            "Next.js"
        ],
        "summary": "Seeking a Senior Frontend Developer with 5+ years of experience in React.js, Next.js, and TypeScript. Responsibilities include designing, developing, and optimizing user interfaces."
    },
    {
        "job_title": "Salesforce DevOps Engineer",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24326",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Salesforce DevOps Engineer</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<p><strong>Job Published:</strong> October 17, 2025\n<strong>Closing Date:</strong> October 31, 2025</p>\n<h3>Brief Description</h3>\n<p>Experience 3+ years</p>\n<p>As a Salesforce DevOps Engineer, you will be responsible for streamlining release management processes, building scalable CI/CD pipelines, and ensuring secure, compliant, and high-quality deployments across Salesforce environments. Your expertise in version control, automation, and deployment tools will enable faster delivery cycles, improved collaboration, and reduced risk in production. You will collaborate closely with development teams, architects, and administrators to implement DevOps best practices within the Salesforce ecosystem.</p>\n<p><strong>Preferred Clouds:</strong>\n- Sales Cloud\n- Service Cloud\n- Salesforce Platform</p>\n<p><strong>Must-have Technical Skills:</strong>\n- 3+ years of Salesforce platform experience with a focus on DevOps and release management\n- Hands-on experience with Salesforce DX for source-driven development\n- Strong expertise in CI/CD pipelines using tools such as GitHub Actions, Azure DevOps, or Jenkins\n- Proficiency in version control systems (Git) and branching strategies (Git Flow, release-based)\n- Proven ability to implement and optimize deployments using third-party DevOps tools (e.g., Gearset, Copado, AutoRABIT)\n- Solid understanding of Salesforce metadata management, sandbox strategies, and change set alternatives\n- Experience with integration and automation of deployments across multiple environments\n- Strong knowledge of Salesforce security models, profiles, and permission sets with DevOps governance in mind\n- Ability to monitor, troubleshoot, and resolve deployment failures and performance issues\n- Familiarity with infrastructure-as-code principles and environment management</p>\n<p><strong>Desirable Technical Skills:</strong>\n- Experience implementing test automation frameworks for Salesforce (e.g., Selenium with Salesforce apps)\n- Experience with data migration strategies and tools (Data Loader, MuleSoft, or ETL platforms)\n- Familiarity with observability and monitoring tools for Salesforce environments\n- Experience integrating Salesforce with analytics tools (e.g., Tableau, CRM Analytics)\n- Understanding of enterprise integration patterns and middleware technologies</p>\n<p><strong>Interpersonal Skills:</strong>\n- Ability to work collaboratively in a team environment\n- Excellent verbal and written communication skills\n- Ability to drive best practices and influence adoption of DevOps culture in a Salesforce environment</p>\n<p><strong>Certifications:</strong>\n- Salesforce Certified Administrator &amp; Advanced Administrator\n- Salesforce Certified Platform App Builder (or Developer I)\n- Copado Certified DevOps Engineer (Nice-to-have)</p>",
        "tags": [
            "3+ Years",
            "Salesforce DX",
            "CI/CD",
            "Git"
        ],
        "summary": "Salesforce DevOps Engineer to streamline releases and build CI/CD pipelines. Requires 3+ years of Salesforce experience, Salesforce DX, and CI/CD tools."
    },
    {
        "job_title": "Business Development Executive – Product Sales (Field Work)",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24325",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Business Development Executive – Product Sales (Field Work)</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, Kerala, India\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com\n<strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Brief Description</h3>\n<p><strong>Experience Required:</strong> 3–4 Years</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Drive product sales through direct client interactions, field visits, and relationship-building.</li>\n<li>Identify, prospect, and convert new clients while maintaining strong relationships with existing customers.</li>\n<li>Develop and deliver tailored product presentations, demos, and proposals to address client requirements.</li>\n<li>Collaborate with internal teams to maximize sales outcomes and revenue growth.</li>\n<li>Engage in proactive field prospecting through client meetings, networking, and cold calling.</li>\n<li>Strategize effective approaches to achieve sales targets and expand market presence.</li>\n<li>Present new product offerings and features to enhance customer engagement and retention.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Requirements &amp; Skills</strong></p>\n<ul>\n<li>3–4 years of proven experience in product sales/business development, preferably in IT/ITeS or related industries.</li>\n<li>Strong background in field sales with hands-on experience in outbound prospecting.</li>\n<li>Excellent communication, negotiation, and interpersonal skills with a customer-focused approach.</li>\n<li>Ability to identify product differentiators and present clear value propositions.</li>\n<li>Competency in sales forecasting, pipeline management, and achieving targets.</li>\n<li>Self-motivated, adaptable, and committed to representing the company positively in all client engagements.</li>\n</ul>",
        "tags": [
            "3-4 Years",
            "Product Sales",
            "Business Development",
            "Field Sales"
        ],
        "summary": "Seeking a Business Development Executive for product sales with 3-4 years of experience. Drive sales through field work, prospecting, and client relationship management to achieve targets."
    },
    {
        "job_title": "Senior Pre-Sales Engineer",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24324",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Pre-Sales Engineer</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Closing Date:</strong> 31, Oct 2025\n<strong>Job Published:</strong> 17, Oct 2025\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<h3>About the Role:</h3>\n<p>We are seeking a seasoned and customer-focused Senior Pre-Sales Engineer to partner with our sales team in crafting tailored, value-driven solutions for clients. This role requires a strong blend of technical expertise, business acumen, and communication skills. You will play a critical role in identifying client needs, designing strategic solutions, and contributing to proposal development that accelerates business growth.</p>\n<h3>Responsibilities:</h3>\n<p><strong>1. Sales &amp; Pre-Sales Enablement</strong>\n- Collaborate with the sales team to understand client requirements and position appropriate technology solutions.\n- Lead pre-sales activities including customer meetings, discovery sessions, workshops, and product demonstrations.\n- Assist in lead qualification and shape them into solution-driven opportunities aligned to business outcomes.</p>\n<p><strong>2. Solution Design &amp; Documentation</strong>\n- Translate business and technical requirements into scalable, practical solution architectures.\n- Create high-quality solution proposals, technical write-ups, and effort estimates.\n- Draft Statements of Work (SOW), functional specifications, and client-facing documentation.</p>\n<p><strong>3. Proposal Management</strong>\n- Respond to RFPs, RFIs, and RFQs with well-structured, customized, and technically robust responses.\n- Collaborate with internal stakeholders to ensure proposals meet both technical and business requirements.\n- Design and deliver compelling pitch presentations that showcase solution strengths and differentiators.</p>\n<p><strong>4. Client Interaction &amp; Relationship Building</strong>\n- Present solutions to clients and address technical queries with clarity and confidence.\n- Establish trust and position yourself as a strategic technical advisor throughout the sales cycle.\n- Effectively communicate architecture, benefits, implementation plans, and ROI to stakeholders.</p>\n<p><strong>5. Solution Costing &amp; Commercial Viability</strong>\n- Work with finance and delivery teams to build accurate cost models and pricing strategies.\n- Ensure all proposed solutions are technically feasible, commercially viable, and contractually sound.</p>\n<p><strong>6. Market Awareness &amp; Internal Collaboration</strong>\n- Stay updated with emerging technologies, market trends, and competitor offerings.\n- Partner with delivery, product management, legal, and business development teams throughout the deal lifecycle.\n- Provide solution feedback to influence product development and go-to-market strategies.</p>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, Information Technology, or a related field.</li>\n<li>8+ years of experience in pre-sales, solution consulting, or technical sales roles.</li>\n<li>Strong experience designing and presenting enterprise-level IT solutions across industries.</li>\n<li>Excellent verbal, written, and presentation skills with the ability to influence technical and non-technical audiences.</li>\n<li>Proficiency in drafting technical documents, solution architectures, cost estimations, and SOWs.</li>\n<li>Proven ability to manage multiple opportunities simultaneously in a fast-paced environment.</li>\n<li>Familiarity with solution-selling frameworks, value-based selling, and customer-centric methodologies.</li>\n</ul>",
        "tags": [
            "8+ Years",
            "Pre-Sales",
            "Solution Architecture",
            "Proposal Management"
        ],
        "summary": "Seeking a Senior Pre-Sales Engineer with 8+ years of experience to design tailored client solutions. Role involves technical expertise, sales collaboration, and proposal development for business growth."
    },
    {
        "job_title": "Senior Cloud Infrastructure and DevOps",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24323",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Cloud Infrastructure and DevOps</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com\n<strong>Published Date:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>Experience: 8+ years</p>\n<p>We are seeking a technically proficient and self-motivated Senior to design and implement secure cloud environments on leading Cloud Service Providers (Azure or OCI). The role requires familiarity with DevOps practices and Kubernetes orchestration. The successful candidate will work independently and collaborate directly with customers to deliver tailored, high-impact solutions. A solid foundation in Linux, KVM (Kernel-based Virtual Machine), and experience with open-source technologies will be a strong asset.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design and implement secure, scalable, and resilient cloud architectures on Azure or GCI.</li>\n<li>Build and manage containerized environments using Kubernetes, focusing on orchestration and deployment pipelines.</li>\n<li>Lead DevOps initiatives such as CI/CD, infrastructure automation, and proactive monitoring.</li>\n<li>Apply system hardening practices and align with industry-standard security frameworks.</li>\n<li>Engage with customers to understand needs and offer clear, effective technical guidance.</li>\n<li>Optimize cloud resource utilization for cost and performance efficiency.</li>\n<li>Manage virtualization environments using Linux and KVM.</li>\n<li>Maintain clear technical documentation, including designs, guidelines, and processes.</li>\n<li>Support and guide team members through mentoring and knowledge sharing.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Hands-on experience in building secure cloud solutions on Azure or OCI.</li>\n<li>Familiarity with Kubernetes for orchestration and scaling.</li>\n<li>Proficiency in DevOps tools (e.g., Jenkins, Git, Terraform, Ansible).</li>\n<li>Strong understanding of Linux system administration and troubleshooting.</li>\n<li>Practical exposure to KVM virtualization.</li>\n<li>Awareness of system hardening techniques and cloud security best practices.</li>\n<li>Ability to independently manage tasks and collaborate across teams.</li>\n<li>Clear communication and customer-facing skills.</li>\n</ul>\n<h2>Preferred Skills &amp; Experience</h2>\n<ul>\n<li>Around 12 years of overall experience in IT, with 4–6 years in a senior or lead technical role.</li>\n<li>Certifications such as Azure Administrator or Architect, Oracle Cloud Infrastructure (OCI) Multicloud Architect Associate etc.</li>\n<li>Familiarity with Infrastructure as Code (IaC) practices.</li>\n<li>Exposure to monitoring and observability tools (e.g., Prometheus, Grafana, ELK).</li>\n<li>Understanding of compliance standards and data protection regulations.</li>\n</ul>",
        "tags": [
            "8+ Years",
            "Azure",
            "OCI",
            "Kubernetes"
        ],
        "summary": "Seeking a Senior Cloud Infrastructure and DevOps professional with 8+ years experience. Responsibilities include designing secure cloud environments on Azure/OCI and managing Kubernetes."
    },
    {
        "job_title": "Senior Software Engineer – Python /Generative AI",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24322",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Software Engineer – Python / Generative AI</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Brief Description</h3>\n<p><strong>Experience:</strong> 5+ years</p>\n<p>We are seeking an experienced Senior Python Engineer – Generative AI to design, develop, and deploy large-scale AI-driven applications. The ideal candidate will bring strong expertise in Python development, LLM integration, and knowledge-augmented architectures (RAG/KAG), along with hands-on experience in building robust APIs, AI workflows, and scalable agentic systems. This role requires a solid understanding of modern data processing pipelines, distributed systems, caching strategies, and containerized deployments.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and maintain large-scale Python applications leveraging Generative AI technologies.</li>\n<li>Integrate and utilize pre-trained LLMs via APIs (OpenAI, Anthropic, Hugging Face, etc.).</li>\n<li>Design and implement Retrieval-Augmented Generation (RAG) and Knowledge-Augmented Generation (KAG) pipelines.</li>\n<li>Build document processing and text extraction workflows for search, indexing, retrieval, and document intelligence.</li>\n<li>Develop robust REST APIs using FastAPI or Flask.</li>\n<li>Create and orchestrate workflows with n8n.</li>\n<li>Integrate and build agentic AI systems using Langchain, vLLM, Langraph, Agno, and (optionally) Foundry agents.</li>\n<li>Develop and optimize complex agentic pipelines for decision-making and automation.</li>\n<li>Implement distributed task queues using Celery and RabbitMQ.</li>\n<li>Design and implement various caching mechanisms: semantic caching, in-memory caching (Redis, Memcached), distributed caching (Redis Cluster), etc.</li>\n<li>Work with RDBMS, NoSQL, and Vector Databases (Pinecone, Qdrant, Milvus, Chroma DB, Elasticsearch).</li>\n<li>Containerize applications using Docker for scalable deployment.</li>\n<li>Ensure code quality and reliability through unit testing (PyTest).</li>\n<li>Monitor application health and performance using Prometheus and Grafana.</li>\n<li>Leverage Microsoft Azure services such as Durable Functions, Service Bus, and Document Intelligence for cloud-native solutions.</li>\n<li>Collaborate with cross-functional teams to define requirements and deliver solutions.</li>\n<li>Maintain comprehensive documentation and adhere to best coding practices.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>5+ years of professional Python development experience.</li>\n<li>Experience integrating LLMs and NLP APIs (OpenAI, Anthropic, Hugging Face, etc.).</li>\n<li>Practical expertise in RAG/KAG architectures for knowledge retrieval/augmentation.</li>\n<li>Experience with document processing, NLP workflows, and document intelligence solutions.</li>\n<li>Advanced API development skills with FastAPI and/or Flask.</li>\n<li>Hands-on experience with agentic/graph-based frameworks: Langchain, vLLM, Langraph, Agno.</li>\n<li>Experience with workflow automation tools (n8n).</li>\n<li>Proficiency with distributed task queues (Celery, RabbitMQ).</li>\n<li>Expertise in caching mechanisms: semantic caching, in-memory (Redis/Memcached), distributed caching schemes.</li>\n<li>Experience with RDBMS, NoSQL, and Vector Databases (Pinecone, Qdrant, Milvus, Chroma DB, Elasticsearch).</li>\n<li>Skilled in containerization using Docker.</li>\n<li>Practical experience with monitoring tools: Prometheus and Grafana.</li>\n<li>Proficient in writing unit tests using PyTest.</li>\n<li>Familiarity with Azure services: Durable Functions, Service Bus, Document Intelligence.</li>\n<li>Strong communication and teamwork abilities.</li>\n<li>Commitment to code quality, documentation, and software engineering best practices.</li>\n</ul>\n<h3>Preferred/Plus Skills:</h3>\n<ul>\n<li>Experience working with Foundry agents or similar agentic frameworks.</li>\n<li>Experience implementing YOLO models for vision or document AI applications.</li>\n<li>Familiarity with Google AI Studio for rapid prototyping or LLM integration.</li>\n<li>Prior experience deploying or orchestrating GenAI solutions on Microsoft Azure.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Python",
            "Generative AI",
            "LLM Integration"
        ],
        "summary": "Seeking a Senior Python Engineer with 5+ years of experience in Generative AI. Responsibilities include developing AI applications, integrating LLMs, and building RAG/KAG pipelines."
    },
    {
        "job_title": "AI ML Architect",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24321",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>AI/ML Architect at PIT Solutions (P) Ltd</h2>\n<p><strong>Location:</strong> Technopark, Thiruvananthapuram, Kerala, India\n<strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com\n<strong>Closing Date:</strong> October 31, 2025\n<strong>Job Published:</strong> October 17, 2025</p>\n<p><strong>Overview:</strong></p>\n<p>PIT Solutions is seeking an experienced AI/ML Architect to lead the design, development, and implementation of advanced artificial intelligence and machine learning solutions. This role requires a strong background as a Software Architect, preferably from a product company, with a deep understanding of AI and Data Science domains, including at least 2 years of hands-on experience, and a significant focus on Natural Language Processing (NLP).</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Solution Architecture:</strong> Design robust, scalable AI/ML solutions addressing complex business needs, leveraging software architecture expertise.</li>\n<li><strong>Innovative Problem Solving:</strong> Develop creative approaches to complex problems using AI/ML and software architecture skills.</li>\n<li><strong>AI Virtual Assistants:</strong> Build AI virtual assistants utilizing Google Dialogflow, OpenAI GPT, and Azure Bot Service.</li>\n<li><strong>Platform Expertise:</strong> Architect AI solutions using services within Google Cloud Platform.</li>\n<li><strong>Serverless Functions:</strong> Implement serverless functions (Azure Functions, Google Cloud Functions) for efficient AI service deployment.</li>\n<li><strong>Cloud Firestore Integration:</strong> Integrate Firebase Cloud Firestore for real-time data synchronization and storage.</li>\n<li><strong>Image Processing:</strong> Apply image processing techniques with TensorFlow or OpenCV for data insights.</li>\n<li><strong>Model Training and Evaluation:</strong> Develop and evaluate custom TensorFlow models for specialized tasks.</li>\n<li><strong>Deployment and Optimization:</strong> Deploy, optimize, and manage AI models on cloud platforms.</li>\n<li><strong>AI/DS Expertise:</strong> Apply AI and Data Science knowledge to develop advanced ML algorithms.</li>\n<li><strong>NLP Focus:</strong> Develop NLP-based solutions for text analysis, sentiment analysis, and chatbots.</li>\n<li><strong>Continuous Learning:</strong> Stay updated with AI/ML trends and eagerly learn new technologies.</li>\n<li><strong>Collaboration:</strong> Work with cross-functional teams to translate business requirements into AI/ML solutions.</li>\n<li><strong>Experimentation and Prototyping:</strong> Rapidly prototype and experiment with AI/ML approaches.</li>\n<li><strong>Technical Leadership:</strong> Provide technical guidance and mentorship to junior team members.</li>\n</ul>\n<p><strong>Preferred Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science or equivalent.</li>\n<li>Overall 8+ years of industry experience.</li>\n<li>At least 2+ years in AI/ML, Data Science, or related fields.</li>\n<li>Proven Software Architect experience, ideally in a product company.</li>\n<li>Extensive experience designing and implementing AI/ML solutions, focusing on open-source LLMs and virtual assistants.</li>\n<li>Expertise in Natural Language Processing (NLP).</li>\n<li>Strong programming skills in Python, .NET.</li>\n<li>Proficiency with TensorFlow for custom model development.</li>\n<li>Strong understanding of Google Cloud Platform services.</li>\n<li>Hands-on experience with Azure and Google Cloud serverless functions.</li>\n<li>Familiarity with Firebase Cloud Firestore.</li>\n<li>Expertise in image processing using TensorFlow, OpenCV, or similar libraries.</li>\n<li>Eagerness to learn new technologies and a growth mindset.</li>\n<li>Excellent problem-solving, critical thinking, and analytical skills.</li>\n<li>Strong communication and collaboration abilities.</li>\n</ul>",
        "tags": [
            "8+ Years",
            "AI/ML",
            "NLP",
            "Google Cloud Platform"
        ],
        "summary": "Seeking an AI/ML Architect with 8+ years experience to design and implement cutting-edge AI/ML solutions. Must have strong NLP focus and experience with cloud platforms."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24320",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Business Analyst</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India , 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a detail-oriented and results-driven Senior Business Analyst to join our growing team. This role is ideal for someone who excels at bridging the gap between business needs and technical solutions. You will collaborate with stakeholders, product teams, and developers to translate complex business requirements into actionable technical specifications - ensuring the delivery of impactful and high-quality digital products.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Requirement Gathering:</strong> Quickly understand business goals and elicit clear, concise functional and non-functional requirements.</li>\n<li><strong>Stakeholder Collaboration:</strong> Work with cross-functional teams to align business objectives and define the solution scope.</li>\n<li><strong>Business Analysis:</strong> Plan and approach complex analysis situations using structured methodologies.</li>\n<li><strong>Technical Understanding:</strong> Translate business needs into technical requirements with an understanding of software lifecycle and system processes.</li>\n<li><strong>Developer Support:</strong> Collaborate with the development team to clarify and refine requirements during the development lifecycle.</li>\n<li><strong>Solution Customization:</strong> Support system configuration, debugging, and customization to meet business goals.</li>\n<li><strong>Release Coordination:</strong> Assist the release team with planning and executing smooth deployments.</li>\n<li><strong>Quality Assurance:</strong> Conduct functional testing and validations to ensure solution quality and usability.</li>\n<li><strong>Issue Management:</strong> Track, document, and resolve issues efficiently, ensuring minimal disruption.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven ability to work in dynamic environments with tight timelines.</li>\n<li>Excellent written and verbal communication skills for effective stakeholder engagement.</li>\n<li>Strong analytical and research skills with the ability to synthesize complex information.</li>\n<li>Experience working on software development projects, including Agile teams.</li>\n<li>Familiarity with tools such as JIRA, Confluence, and requirement documentation platforms.</li>\n<li>Prior exposure to AI, machine learning, or data-driven projects is a valuable addition.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Business Analysis",
            "Agile",
            "JIRA"
        ],
        "summary": "Seeking a Senior Business Analyst with 5+ years of experience to translate business needs into technical specifications. Collaborate with stakeholders and developers to deliver high-quality digital products."
    },
    {
        "job_title": "Senior Full Stack Developer - .NET",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24319",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Full Stack Developer - .NET</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop clean, testable code using .NET programming languages.</li>\n<li>Collaborate with team leads to design technical specifications and architecture.</li>\n<li>Test and debug various .NET applications to ensure optimal performance.</li>\n<li>Review and refactor code for efficiency and scalability.</li>\n<li>Deploy fully functional applications, ensuring seamless integration.</li>\n<li>Upgrade and maintain existing programs to enhance functionality.</li>\n<li>Document development and operational procedures comprehensively.</li>\n</ul>\n<h3>Required Skills and Qualifications:</h3>\n<ul>\n<li>Extensive experience with .NET Framework and C#, with at least 8 years in professional settings.</li>\n<li>Proficiency in .NET/.NET Core, ASP.NET, C#, SQL Server, MVC, REST, Web API, JavaScript, HTML5, CSS, and frameworks like Angular, Vue.js or React.js.</li>\n<li>Strong understanding of Object-Oriented Programming (OOP) concepts, including dependency injection, asynchronous programming, and unit testing.</li>\n<li>Awareness of microservice architecture, DevOps practices, and containerization concepts (e.g., Docker, Kubernetes).</li>\n<li>Familiarity with agile development environments.</li>\n<li>Excellent troubleshooting abilities and problem-solving skills.</li>\n<li>Effective communication skills, both verbal and written.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience with cloud platforms such as Azure or AWS.</li>\n<li>Knowledge of CI/CD pipelines and automated deployment strategies.</li>\n<li>Familiarity with frontend frameworks like React.js.</li>\n</ul>",
        "tags": [
            "8+ Years",
            ".NET",
            "C#",
            "Full Stack Development"
        ],
        "summary": "Seeking an experienced Senior Full Stack Developer proficient in .NET and C#. Responsibilities include developing, testing, and deploying applications, collaborating on architecture, and maintaining code."
    },
    {
        "job_title": "Senior React Native Developer",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24318",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior React Native Developer</h2>\n<p>PIT Solutions (P) Ltd\nModule No. 209-N, 9th Floor, Yamuna, SEZ IT Building,\nTechnopark Phase III, Thiruvananthapuram, Kerala, India , 695583\nhttp://www.pitsolutions.com</p>\n<p><strong>Job Published:</strong> 17, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<h3>About the role</h3>\n<p>We are seeking a Senior React Native Developer with 5+ years of experience in mobile application development and 3+ years working with React Native. The ideal candidate should be proficient in cross-platform mobile development, state management, API integration, and performance optimization. You will collaborate with product teams to build high-quality iOS and Android applications while mentoring junior developers.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain efficient, reusable, and reliable React Native applications.</li>\n<li>Collaborate with designers, product managers, and developers to build and release high-quality products.</li>\n<li>Optimize app performance, responsiveness, and scalability.</li>\n<li>Conduct code reviews and share best practices with the team.</li>\n<li>Write and maintain unit and integration tests (Jest, Detox).</li>\n<li>Identify and resolve bottlenecks and bugs.</li>\n<li>Mentor junior developers and foster a culture of continuous learning.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>5+ years of experience in mobile development, including 3+ years in React Native.</li>\n<li>Proficiency in JavaScript/TypeScript and React Native core libraries.</li>\n<li>Strong knowledge of iOS and Android development.</li>\n<li>Experience with state management libraries (Redux, MobX).</li>\n<li>Expertise in RESTful API integration and third-party libraries.</li>\n<li>Proficiency with Git and version control workflows.</li>\n<li>Solid understanding of UI/UX best practices.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience with writing native modules for React Native.</li>\n<li>Familiarity with CI/CD pipelines and cloud services (AWS, Firebase, Azure).</li>\n<li>Background in Agile methodologies.</li>\n<li>Contributions to open-source projects (a plus).</li>\n</ul>",
        "tags": [
            "5+ Years",
            "React Native",
            "JavaScript",
            "Mobile Development"
        ],
        "summary": "Seeking a Senior React Native Developer with 5+ years of mobile experience. Responsibilities include app development, optimization, and mentoring. Must be proficient in React Native, state management, and API integration."
    }
]