[
    {
        "job_title": "Event Management Interns",
        "company": "Phases India Technology Solutions Pvt Ltd.",
        "url": "https://infopark.in/company-jobs/details/20702/381",
        "location": "Infopark",
        "closing_date": "13 Oct 2025",
        "job_description": "<h2>Event Management Interns</h2>\n<p>We are looking for 2 energetic and motivated full-time interns to join the team driving the GTech Marathon 2026 (www.gtechmarathon.com), one of Kerala’s largest marathon events. This is a paid, 5-month internship where you’ll get hands-on experience in event management, marketing, and community engagement, while working closely with CEOs of leading tech companies.</p>\n<h3>What You’ll Get</h3>\n<ul>\n<li>Opportunity to work with CEOs of leading tech companies</li>\n<li>Hands-on exposure to real-world event management</li>\n<li>Experience in marketing, communications, and operations</li>\n<li>A chance to network with top professionals in the tech ecosystem</li>\n<li>Learn, grow, and boost your career journey</li>\n</ul>\n<h3>Internship Details</h3>\n<ul>\n<li><strong>Duration:</strong> October 2025 – February 2026 (Full-time)</li>\n<li><strong>Work:</strong></li>\n<li>Office-based (support, coordination, marketing, communications)</li>\n<li>Field-based (event support, Infopark visits, coordination with teams)</li>\n</ul>\n<h3>Who Should Apply?</h3>\n<p>We are looking for energetic, enthusiastic, and sports-minded individuals who are eager to learn and contribute.</p>\n<p><strong>Location:</strong> Kochi</p>\n<h3>Apply Now</h3>\n<p>Apply Now through the link below and be part of one of Kerala’s most exciting marathon events.\nhttps://podio.com/webforms/30508177/2577615</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at _@c.c</p>",
        "tags": [
            "5 Months Experience",
            "Event Management",
            "Marketing",
            "Community Engagement"
        ],
        "summary": "Seeking 2 full-time interns for the GTech Marathon 2026, a 5-month paid role. Gain hands-on experience in event management, marketing, and community engagement."
    },
    {
        "job_title": "Governance, Risk and Compliance Lead",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20707/4",
        "location": "Infopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Governance, Risk and Compliance (GRC) Lead</h2>\n<h3>Position Summary</h3>\n<p>The GRC Lead will spearhead the strategic governance, risk management, and compliance agenda to enhance the organization's cybersecurity resilience and ensure regulatory adherence.</p>\n<p>As a pivotal leader and collaborator, the GRC Lead will be responsible for the development, implementation, and ongoing enhancement of the GRC framework, ensuring its alignment with business objectives, regulatory requirements, and industry best practices. This role involves managing GRC operations, leading cross-functional teams, engaging with executive leadership, and guiding strategic risk decisions to protect organizational resilience.</p>\n<h3>Key Responsibilities</h3>\n<h4>Strategic Governance &amp; Leadership</h4>\n<ul>\n<li>Lead the design, execution, and maturation of the organization’s comprehensive GRC strategy, including policy governance, risk management frameworks, compliance programs, and continuous improvement initiatives.</li>\n<li>Oversee the governance structure, encompassing policy lifecycle management, control frameworks, and compliance awareness programs.</li>\n<li>Align GRC objectives with business goals and regulatory mandates through close collaboration with executive leadership and key stakeholders.</li>\n<li>Provide leadership, mentoring, and development support to GRC analysts and related teams.</li>\n</ul>\n<h4>Risk Management &amp; Compliance Oversight</h4>\n<ul>\n<li>Direct enterprise-wide risk identification, assessment, mitigation strategies, and control effectiveness reviews.</li>\n<li>Supervise compliance operations, including audit management, regulatory assessments, and compliance reporting, to ensure adherence to global standards (ISO 27001, NIST, GDPR, PCI-DSS, SOC2).</li>\n<li>Champion the definition of risk appetite and monitor risk tolerance in alignment with organizational priorities.</li>\n</ul>\n<h4>Process Improvement &amp; Tooling</h4>\n<ul>\n<li>Guide the selection, deployment, and optimization of GRC tools and platforms (e.g., RSA Archer, ServiceNow GRC) to support scalable risk and compliance management.</li>\n<li>Drive automation efforts to improve risk intelligence, compliance tracking, and reporting accuracy.</li>\n<li>Identify and implement best practices and process improvements to boost operational efficiency and risk visibility.</li>\n</ul>\n<h4>Collaboration &amp; Communication</h4>\n<ul>\n<li>Act as the primary liaison for GRC matters across IT, Security, Legal, Compliance, and Business units.</li>\n<li>Translate complex risk and compliance information into clear, actionable recommendations for executive leadership and technical teams.</li>\n<li>Lead training, awareness programs, and communication efforts to foster a culture of governance and risk mindfulness.</li>\n<li>Engage with external partners, auditors, and regulators for GRC-related assessments and benchmarking.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>7–8 years of progressive experience in Governance, Risk, and Compliance within cybersecurity or related fields.</li>\n<li>Proven leadership experience in managing GRC programs, teams, and strategic initiatives.</li>\n<li>Deep expertise in regulatory standards and frameworks (ISO 27001, NIST, GDPR, PCI-DSS, SOC2).</li>\n<li>Strong background with GRC platforms such as RSA Archer, ServiceNow GRC, or similar.</li>\n<li>Experience managing audits, risk assessments, compliance initiatives, and regulatory interactions.</li>\n<li>Excellent strategic thinking, interpersonal, and communication skills.</li>\n<li>Relevant certifications such as CISA, CISM, CISSP, CRISC, or PMP are highly desirable.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with GRC automation and integration within DevSecOps or cloud security contexts.</li>\n<li>Familiarity with IT and security control frameworks (CIS Controls, MITRE ATT&amp;CK).</li>\n<li>Industry experience in regulated sectors like finance, healthcare, or government.</li>\n<li>Strong analytical and problem-solving skills with a data-driven mindset.</li>\n</ul>\n<h3>Professional Attributes</h3>\n<ul>\n<li>Strategic and visionary leader with the ability to influence at all levels.</li>\n<li>Collaborative and team-oriented approach with proven mentoring skills.</li>\n<li>Detail-oriented, quality-focused, and proactive in risk anticipation.</li>\n<li>Passionate about continuous learning and adapting to emerging cybersecurity trends.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at merin.cb@arttechgroup.com</p>",
        "tags": [
            "7-8 Years",
            "GRC",
            "NIST",
            "RSA Archer"
        ],
        "summary": "Lead GRC strategy, risk management, and compliance for cybersecurity resilience. Drive framework implementation, oversee operations, and ensure regulatory adherence. Requires 7-8 years of experience."
    },
    {
        "job_title": "Senior HR Generalist",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20703/85",
        "location": "Infopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Senior HR Generalist</h2>\n<p><strong>About Techversant</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, React Native, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong></p>\n<p>Techversant is seeking an experienced HR Generalist to join our dynamic team. The HR Generalist will play a crucial role in supporting various HR functions, including payroll processing &amp; management, performance management, employee relations, HR policies, and procedures, compensation management &amp; HR operations activities for the location. The ideal candidate should have 3-6 years of HR experience, excellent interpersonal skills, and a strong understanding of HR best practices. This is a challenging and rewarding opportunity for someone looking to make a significant impact in a fast-paced environment.</p>\n<h2>Roles and Responsibilities</h2>\n<ol>\n<li><strong>Payroll Processing:</strong><ul>\n<li>Ensure accurate and timely processing of payroll for employees, including reviewing timesheets, calculating overtime, deductions, and benefits.</li>\n<li>Collaborate with finance and accounting departments to reconcile payroll discrepancies and resolve any issues.</li>\n<li>Stay updated on payroll laws and regulations to ensure compliance and recommend process improvements.</li>\n</ul>\n</li>\n<li><strong>Performance Management:</strong><ul>\n<li>Coordinate and assist in the performance management process, including goal-setting, performance evaluations, and feedback sessions.</li>\n<li>Provide guidance to managers and employees on performance-related matters, including addressing performance concerns, developing performance improvement plans, and recognizing outstanding achievements.</li>\n<li>Monitor and track performance metrics and provide reports to management for decision-making purposes.</li>\n</ul>\n</li>\n<li><strong>Employee Relations:</strong><ul>\n<li>Serve as a point of contact for employee inquiries, concerns, and grievances, ensuring prompt and effective resolution.</li>\n<li>Conduct investigations into employee complaints or misconduct allegations, maintaining confidentiality and adhering to legal requirements.</li>\n<li>Provide guidance and support to managers in handling employee relations issues, including disciplinary actions, terminations, and workplace conflict resolution.</li>\n</ul>\n</li>\n<li><strong>HR Policies and Procedures:</strong><ul>\n<li>Develop, implement, and communicate HR policies, procedures, and guidelines to ensure compliance with applicable laws and regulations.</li>\n<li>Regularly review and update employee handbooks, HR manuals, and related documents.</li>\n<li>Provide training and guidance to employees and managers on HR policies, procedures, and compliance requirements.</li>\n</ul>\n</li>\n<li><strong>Onboarding:</strong><ul>\n<li>Conduct new employee orientations and ensure a smooth onboarding experience.</li>\n</ul>\n</li>\n<li><strong>HR Data Management and Reporting:</strong><ul>\n<li>Maintain accurate and up-to-date employee records, including personal information, employment history, benefits enrollment, and performance evaluations.</li>\n<li>Generate HR reports and metrics for management, providing insights and recommendations for improvement.</li>\n<li>Ensure data integrity and confidentiality, complying with data protection regulations.</li>\n</ul>\n</li>\n</ol>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s degree in Human Resources, Business Administration, or a related field.</li>\n<li>3-8 years of progressive experience in HR roles, with a focus on payroll processing, performance management, and employee relations.</li>\n<li>Strong knowledge of HR best practices, employment laws, and regulations.</li>\n<li>Experience with payroll software and HRIS systems.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Ability to handle sensitive and confidential information with integrity.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Detail-oriented with excellent organizational skills.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n<li>HR certification (e.g., SHRM-CP, PHR) is a plus.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "3-8 Years",
            "Payroll Processing",
            "Performance Management",
            "Employee Relations"
        ],
        "summary": "Seeking an experienced HR Generalist with 3-8 years of experience in payroll, performance management, and employee relations. This role supports various HR functions in a fast-paced environment."
    },
    {
        "job_title": "Project Manager Requirement for AI Product Development",
        "company": "Pagematics India Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/20711/467",
        "location": "Infopark",
        "closing_date": "20 Oct 2025",
        "job_description": "<h2>Project Manager - AI Product Development</h2>\n<p>This is a full-time, on-site role for a Project Manager specializing in AI Product Development, based in Cherthala.</p>\n<h3>Role Description</h3>\n<p>The Project Manager will be responsible for overseeing all day-to-day project activities, encompassing planning, execution, and finalization of AI product development projects. Key duties include defining project scope, meticulously managing schedules and budgets, fostering collaboration among cross-functional teams, and ensuring that all projects are delivered on time and meet established quality standards. The role also entails leading research and development (R&amp;D) efforts and providing strategic direction for AI product initiatives. We are seeking a seasoned project manager to lead the development of a sophisticated AI-based product, coordinating across multiple vendor teams to ensure seamless execution and successful delivery.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Client and Leadership Interface</strong>: Serve as the primary point of contact for the client's leadership team, delivering regular and comprehensive updates on project status, potential risks, and key deliverables.</li>\n<li><strong>Multi-Vendor Coordination</strong>: Effectively manage and oversee the collaboration efforts of five distinct vendor teams, ensuring alignment, synergy, and consistent progress towards project goals.</li>\n<li><strong>Technical Oversight</strong>: Direct and manage the integration of cutting-edge AI technologies, Amazon cloud services, and facilitate external product coordination.</li>\n</ul>\n<h3>Ideal Candidate Profile:</h3>\n<h4>Certifications:</h4>\n<ul>\n<li>PMP and/or Scrum Master certifications are highly desired.</li>\n</ul>\n<h4>Qualifications:</h4>\n<ul>\n<li>Demonstrated analytical skills and experience in Research and Development (R&amp;D).</li>\n<li>Proficiency in communication and program management.</li>\n<li>Exceptional organizational and multitasking capabilities.</li>\n<li>Relevant experience in AI product development is considered a significant advantage.</li>\n<li>A Bachelor's degree in Computer Science, Engineering, or a closely related field.</li>\n<li>A minimum of 10 years of project management experience within complex technology environments, with a specific focus on AI and cloud technologies.</li>\n</ul>\n<h4>Skills:</h4>\n<ul>\n<li>Robust communication and coordination skills are essential for managing multi-vendor dynamics and ensuring successful project delivery.</li>\n</ul>\n<p>If this opportunity aligns with your career aspirations, please submit your updated resume to remya.ps@pagematics.in.</p>",
        "tags": [
            "10+ Years",
            "AI",
            "Cloud Technologies",
            "PMP/Scrum Master"
        ],
        "summary": "Project Manager needed for AI product development in Cherthala. Oversee planning, execution, and delivery across multiple vendors, managing AI and cloud tech integration. PMP/Scrum Master preferred."
    },
    {
        "job_title": "System Administrator",
        "company": "Cyberion Software Solutions Pvt. Ltd",
        "url": "https://infopark.in/company-jobs/details/20704/502",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>System Administrator</h2>\n<p>We are looking for a System Administrator with hands-on experience managing and maintaining IT infrastructure. The role requires strong expertise in Azure Active Directory, Windows Server, Azure, AWS cloud platforms and a variety of Microsoft technologies, including IIS Web Server, MS SQL Administration, and Microsoft 365 administration.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Windows &amp; Server Administration</strong>\n- Install, configure, and manage Windows Server environments.\n- Manage Azure Active Directory (AD), Group Policies, DNS, and DHCP.\n- Perform regular system updates, patches, and backups.</p>\n<p><strong>Hosting &amp; Application Support</strong>\n- Configure and maintain IIS hosting for web applications.\n- Manage Blazor application hosting and troubleshoot deployment issues.\n- Support and configure Apache servers for web hosting requirements.</p>\n<p><strong>Containerization &amp; Virtualization</strong>\n- Deploy and manage applications using Docker containers.\n- Perform basic administration of VMware ESXi / vCenter for virtualized infrastructure.</p>\n<p><strong>Cloud Platforms</strong>\n- Manage and monitor AWS instances including EC2, S3, IAM, and networking.\n- Work with Azure VM, DevOps for CI/CD pipelines, source code management, and release automation.</p>\n<p><strong>Microsoft Ecosystem</strong>\n- Administer Office 365 services (Exchange Online, Teams, SharePoint, OneDrive).\n- Manage users, licenses, and policies across Microsoft Admin Centers (Entra ID / Azure AD, Security, Compliance, Endpoint Manager, Exchange, Teams).</p>\n<h3>Skills &amp; Qualifications:</h3>\n<ul>\n<li>Proven experience as an IT/System Administrator or similar role.</li>\n<li>Strong knowledge of Windows Server administration and Azure Active Directory.</li>\n<li>Hands-on experience with IIS, Blazor hosting, Apache, Nginx.</li>\n<li>Good understanding of Docker and containerized deployments.</li>\n<li>Familiarity with AWS services and Azure DevOps pipelines.</li>\n<li>Knowledge of VMware basics (ESXi/vCenter).</li>\n<li>Proficiency in Office 365 administration and Microsoft Admin Centers.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@cyberionsoft.com.</p>",
        "tags": [
            "5+ Years",
            "Azure Active Directory",
            "Windows Server",
            "AWS"
        ],
        "summary": "System Administrator needed for IT infrastructure management. Requires expertise in Azure AD, Windows Server, AWS, and Microsoft 365. Responsibilities include server, cloud, and application support."
    },
    {
        "job_title": "Database Developer",
        "company": "Cyberion Software Solutions Pvt. Ltd",
        "url": "https://infopark.in/company-jobs/details/20705/502",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h1>Database Developer</h1>\n<h2>Key Skills:</h2>\n<ul>\n<li>MS SQL Server 2008/2008 R2/2012/2014, 2022/2020 TSQL, Stored Procedure, XML, RDBMS, SDLC.</li>\n<li>ERP, Inventory, Finance.</li>\n</ul>\n<h2>Technical Skills:</h2>\n<ul>\n<li>Expert SQL Server 2008/2014 development skills with emphasis on Development of Transact SQL procedures, functions, views.</li>\n<li>Ability to write a query to do almost anything in MS SQL Server.</li>\n<li>Hands-on SQL-XML programming skills, XML Extraction and Transformation.</li>\n<li>Troubleshooting and Performance Tuning.</li>\n<li>Data Modelling, Design and Analysis.</li>\n</ul>\n<h2>Non-Technical Skills:</h2>\n<ul>\n<li>ERP Business and System Analysis skills.</li>\n<li>Production support experience.</li>\n<li>Proven experience in handling multiple deliverables efficiently.</li>\n<li>Ability to work independently with minimal supervision.</li>\n<li>Sound knowledge of the SDLC process.</li>\n<li>Proficient working on various projects together at the same time and achieving resounding success.</li>\n<li>Highly effective working in a team, as well as working independently.</li>\n</ul>\n<h2>Nice to have Skills:</h2>\n<ul>\n<li>Very Good communication skills - both verbal and written is a MUST.</li>\n<li>Knowledge in SQL Server Integration Services (SSIS) for ETL.</li>\n<li>Good in performance tuning especially tuning complex queries, procedure and indexing strategies.</li>\n<li>3+ years of working experience in a software development environment.</li>\n</ul>\n<p><strong>NOTE:</strong> SHOULD BE STRONG IN TSQL PROGRAMMING.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@cyberionsoft.com</p>",
        "tags": [
            "3+ Years",
            "MS SQL Server",
            "TSQL",
            "ERP"
        ],
        "summary": "Seeking a Database Developer with 3+ years of experience in MS SQL Server and TSQL programming. Must have strong skills in TSQL, stored procedures, and database development."
    },
    {
        "job_title": "IT Support – Trainee",
        "company": "Nymbl",
        "url": "https://infopark.in/company-jobs/details/20710/323",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>IT Support – Trainee</h2>\n<h3>About the Role:</h3>\n<p>We are looking for an enthusiastic and proactive IT Support – Trainee to join the Group IT team. The ideal candidate will assist in providing technical support, managing IT assets, coordinating with vendors, and helping ensure smooth day-to-day IT operations. This is an excellent opportunity for fresh graduates who are eager to start their career in IT infrastructure and support.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Laptop Configuration</strong>:</li>\n<li>Perform OS installations, driver updates, and software setup for new laptops.</li>\n<li>\n<p>Configure and troubleshoot basic hardware and software issues.</p>\n</li>\n<li>\n<p><strong>Basic Network Troubleshooting</strong>:</p>\n</li>\n<li>Assist in diagnosing and resolving network connectivity issues (LAN/Wi-Fi).</li>\n<li>Provide first-level support for VPN connections and remote access troubleshooting.</li>\n<li>\n<p>Demonstrate basic knowledge of common network devices (Router, Switch, AP etc.)</p>\n</li>\n<li>\n<p><strong>Print Management Support</strong>:</p>\n</li>\n<li>Provide basic printer setup, driver installation, and connectivity troubleshooting.</li>\n<li>\n<p>Assist in monitoring print queues and managing printer access for end users.</p>\n</li>\n<li>\n<p><strong>Access Control Support</strong>:</p>\n</li>\n<li>\n<p>Support the IT team in managing access control systems (Biometric devices, door access, etc.)</p>\n</li>\n<li>\n<p><strong>Asset Management</strong>:</p>\n</li>\n<li>Maintain and update IT asset inventory including laptops, peripherals, and accessories.</li>\n<li>\n<p>Assist in tracking allocation and retrieval of IT assets for employees.</p>\n</li>\n<li>\n<p><strong>Microsoft 365 and End-User Software Support</strong>:</p>\n</li>\n<li>Provide first-level support for Microsoft 365 applications (Outlook, Teams, OneDrive, SharePoint, etc.).</li>\n<li>Assist users in troubleshooting login, sync, and configuration issues.</li>\n<li>\n<p>Support users with MS Office and other end-user software installations and troubleshooting.</p>\n</li>\n<li>\n<p><strong>Vendor Coordination</strong>:</p>\n</li>\n<li>Coordinate with IT hardware and software vendors for procurement, repairs, and delivery.</li>\n<li>\n<p>Follow up on warranty and AMC-related tasks.</p>\n</li>\n<li>\n<p><strong>Documentation &amp; Reporting</strong>:</p>\n</li>\n<li>Maintain IT-related documentation such as user access records, handover forms, and ticket logs.</li>\n<li>Prepare basic reports on support activities and asset movement.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s Degree or Diploma in Computer Science, Information Technology, or related field.</li>\n<li>Basic understanding of Windows OS, networking fundamentals, and Microsoft 365 applications.</li>\n<li>Strong troubleshooting, communication, and coordination skills.</li>\n<li>Eagerness to learn new technologies and grow in IT support/infrastructure.</li>\n<li>Good written and verbal communication skills, including professional email etiquette for internal and external correspondence.</li>\n<li>Ability to work both independently and as part of a team.</li>\n</ul>\n<h3>Preferred Skills (Good to Have):</h3>\n<ul>\n<li>Familiarity with IT asset management tools or ticketing systems.</li>\n<li>Basic knowledge of cloud services (M365, Azure, Active Directory, Entra ID, or similar)</li>\n<li>Awareness of system security and data protection practices.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@benymbl.co</p>",
        "tags": [
            "0-1 Years",
            "Microsoft 365",
            "Troubleshooting",
            "IT Support"
        ],
        "summary": "Seeking an enthusiastic IT Support Trainee for technical assistance, asset management, and operations. Excellent opportunity for fresh graduates to build an IT career."
    },
    {
        "job_title": "UIUX Developer-2 years",
        "company": "Techware Lab Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/20708/268",
        "location": "Infopark",
        "closing_date": "15 Nov 2025",
        "job_description": "<h2>UI/UX Developer</h2>\n<p><strong>Experience:</strong> 2 Years\n<strong>Location:</strong> Infopark 2\n<strong>Employment Type:</strong> Full-time</p>\n<h3>About the Role:</h3>\n<p>We are looking for a creative and detail-oriented UI/UX Developer with 2 years of experience to join our front-end development team. The ideal candidate will have strong design sensibilities combined with solid technical skills to build responsive, pixel-perfect, and user-friendly web interfaces.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop responsive, high-quality front-end interfaces with pixel-perfect precision.</li>\n<li>Work with component-based design systems and reusable component libraries.</li>\n<li>Collaborate with designers and developers to implement UI/UX best practices.</li>\n<li>Ensure cross-browser compatibility and adherence to mobile-first design principles.</li>\n<li>Participate in version control workflows using Git.</li>\n<li>Integrate and maintain front-end components within React.js and Next.js frameworks.</li>\n<li>Optimize front-end performance and maintain clean, maintainable code.</li>\n</ul>\n<h3>Mandatory Requirements:</h3>\n<ul>\n<li>Proficiency in HTML5, CSS3 / SCSS, JavaScript (ES6+), TypeScript, and GSAP.</li>\n<li>Proven experience in responsive web design and mobile-first development.</li>\n<li>Hands-on experience with Next.js and React.js.</li>\n<li>Familiarity with Git and version control workflows.</li>\n<li>Ability to build pixel-perfect, component-based, and scalable front-end solutions.</li>\n<li>Experience working with design systems and reusable component libraries.</li>\n</ul>\n<h3>Nice to Have:</h3>\n<ul>\n<li>Proficiency in Figma for UI/UX design and prototyping.</li>\n<li>Exposure to Blender (3D modeling).</li>\n<li>Basic understanding of Three.js for 3D or interactive web experiences.</li>\n</ul>\n<h3>Key Skills:</h3>\n<p>UI/UX Design • HTML5 • CSS3 / SCSS • JavaScript (ES6+) • TypeScript • React.js • Next.js • GSAP • Responsive Design • Git • Design Systems • Figma</p>\n<h3>Contact Information:</h3>\n<p>Interested candidates shall send the updated profile to \"careers@techwarelab.com\" with the subject line \"Application for UIUX Developer\". If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techwarela.com</p>",
        "tags": [
            "2 Years",
            "React.js",
            "Next.js",
            "HTML/CSS"
        ],
        "summary": "Seeking a creative UI/UX Developer with 2 years of experience to build responsive web interfaces using React.js and Next.js. Responsibilities include front-end development, collaboration, and optimization."
    },
    {
        "job_title": "Accountant",
        "company": "Medowa Global (P) Ltd",
        "url": "https://technopark.org/job-details/24186",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Accountant</h2>\n<p><strong>Company:</strong> Medowa Global (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, Kerala, India\n<strong>Address:</strong> 2nd Floor, SBC 7, Thejaswini Building, Phase I, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.medowaglobal.com\n<strong>Contact Email:</strong> hr@medowaglobal.com</p>\n<p><strong>Job Published:</strong> 12, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Job Description:</h3>\n<p>We are looking for an experienced and talented Accountant to join our dynamic team.</p>\n<h3>Duties and Responsibilities (Accounts Department):</h3>\n<ul>\n<li>Petty cash management</li>\n<li>Estimate and invoice preparation</li>\n<li>Receivables and payables management</li>\n<li>Recording of daily transactions</li>\n<li>Zoho books management</li>\n<li>Filing of GST details</li>\n<li>Invoice/bills/voucher filing</li>\n<li>Timely preparation of various reports</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Cell phone reimbursement</li>\n<li>Internet reimbursement</li>\n<li>Paid sick time</li>\n</ul>\n<h3>Schedule:</h3>\n<ul>\n<li>Day shift</li>\n</ul>\n<h3>Ability to commute/relocate:</h3>\n<ul>\n<li>Thiruvananthapuram, Kerala: Reliably commute or planning to relocate before starting work (Required)</li>\n</ul>\n<h3>Education:</h3>\n<ul>\n<li>Bachelor's (Required)</li>\n</ul>\n<h3>Job Types:</h3>\n<ul>\n<li>Full-time</li>\n<li>Permanent</li>\n<li>On-site</li>\n</ul>\n<h3>Preferred Skills &amp; Requirements:</h3>\n<p><strong>Qualification:</strong>\n- B.com/M.com or any other in a related field</p>\n<p><strong>Experience:</strong>\n- 6 months - 2 Years</p>\n<p><strong>Skills and Knowledge:</strong>\n- Must have working knowledge in Zoho books</p>",
        "tags": [
            "6 Months - 2 Years",
            "Zoho Books",
            "Accounting",
            "GST Filing"
        ],
        "summary": "Seeking an Accountant with 6 months to 2 years of experience in accounting and Zoho Books. Responsibilities include daily transactions, invoicing, and GST filing."
    },
    {
        "job_title": "Customer Support Executive",
        "company": "Joopium Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24185",
        "location": "Technopark",
        "closing_date": "01 Nov 2025",
        "job_description": "<h2>Customer Support Executive at JOOPIUM TECHNOLOGIES (P) Ltd</h2>\n<p><strong>Company:</strong> JOOPIUM TECHNOLOGIES (P) Ltd\n<strong>Location:</strong> 4TH FLOOR AMSTOR ANNEXE AMSTOR HOUSE, TECHNOPARK KAZHAKOOTAM TRIVANDRUM, 695581\n<strong>Website:</strong> https://joopiumtechnologies.com\n<strong>Contact Email:</strong> careers@joopiumtechnologies.com</p>\n<p><strong>Closing Date:</strong> 01, Nov 2025\n<strong>Job Published:</strong> 11, Oct 2025</p>\n<hr />\n<h2>Brief Description</h2>\n<p><strong>Experience Level:</strong> Freshers / 0–1 Year\n<strong>Job Type:</strong> Full-Time\n<strong>Working Days:</strong> 6 per week\n<strong>Working Hours:</strong> 8 hours per day (Rotational Shifts – weekly allocation)</p>\n<hr />\n<h2>Job Summary</h2>\n<p>We are looking for a proactive and detail-oriented Customer Support Executive to join our team. The role involves supporting restaurant partners and resellers by managing onboarding, resolving operational issues, and providing product guidance. The ideal candidate should have strong communication skills, an aptitude for technology, and a customer-first mind-set.</p>\n<hr />\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Shortlist restaurants in specific areas and conduct online research on cuisine, services, online ordering, booking systems, and competitor platforms.</li>\n<li>Contact potential customers to promote and sell products and services such as the Order System, Booking System, SMS Marketing, and Google Reservation.</li>\n<li>Assist restaurant owners and resellers with software installation and configuration via phone or video calls.</li>\n<li>Monitor ERP systems for pending orders and failed payments; promptly inform restaurant owners and help resolve issues.</li>\n<li>Schedule and coordinate appointments between resellers and restaurant management.</li>\n<li>Communicate with customers regarding order-related matters, including cancellations and payment issues.</li>\n<li>Coordinate with resellers and restaurant owners to claim or restore access to their Google My Business accounts.</li>\n<li>Maintain accurate communication logs and follow up on assigned customer cases.</li>\n<li>Communicate directly with restaurant management and resellers via calls, emails, or WhatsApp, as instructed by management.</li>\n<li>Collaborate with internal teams to ensure smooth day-to-day operations.</li>\n</ul>\n<hr />\n<h2>Perks &amp; Benefits</h2>\n<ul>\n<li>Opportunity to work with international clients and resellers</li>\n<li>Exposure to real-world customer management systems</li>\n</ul>\n<hr />\n<h2>Preferred Skills</h2>\n<ul>\n<li>Excellent verbal and written communication skills</li>\n<li>Strong problem-solving and multitasking abilities</li>\n<li>Basic understanding of ERP systems</li>\n<li>Familiarity with Google Workspace and CRM tools</li>\n<li>Customer-oriented attitude with attention to detail</li>\n</ul>",
        "tags": [
            "0-1 Year",
            "Customer Support",
            "ERP Systems",
            "Google Workspace"
        ],
        "summary": "Seeking a detail-oriented Customer Support Executive to assist restaurant partners and resellers. Responsibilities include onboarding, issue resolution, and product guidance."
    },
    {
        "job_title": "Educator & Podcast Presenter",
        "company": "Richinnovations Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24184",
        "location": "Technopark",
        "closing_date": "25 Oct 2025",
        "job_description": "<h2>Educator &amp; Podcast Presenter</h2>\n<p><strong>Company:</strong> Richinnovations Technologies (P) Ltd\n<strong>Location:</strong> KSUM, Ground floor, Tejaswini Building, Technopark, Kazhakuttom, Trivandrum, Kerala, India.\n<strong>Contact Email:</strong> hr@richinnovations.in\n<strong>Website:</strong> https://www.richinnovationsplc.com\n<strong>Job Published:</strong> 11, Oct 2025\n<strong>Closing Date:</strong> 25, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>If you are preparing for competitive exams like UPSC Civil Services, SSC, Kerala PSC, or similar exams and are looking for a way to earn while you learn, this is the perfect opportunity. Whether you’ve cleared the preliminary rounds, reached the interview stage, or are still on your journey, this full-time role allows you to use your knowledge, support your studies, and gain valuable experience in the same field.</p>\n<p>Our client is developing a new platform for competitive exam aspirants and is looking for motivated and passionate female candidates to join as Content Creators in the role of Educator &amp; Podcast Presenter. A good voice and strong communication skills are essential, along with a willingness to collaborate with a team and be part of the early stages of the platform’s growth. Fluency in English and Malayalam is required.</p>\n<h3>What You’ll Do:</h3>\n<ul>\n<li>Host podcasts related to exam preparation, providing valuable insights and guidance to aspirants.</li>\n<li>Create engaging study material to help learners understand key concepts effectively.</li>\n<li>Contribute ideas to enhance content delivery and make learning more interactive and impactful.</li>\n<li>Collaborate with the team to shape the platform in its early stages and improve the overall learning experience.</li>\n</ul>\n<h3>What We’re Looking For:</h3>\n<ul>\n<li>Strong knowledge of competitive exams (UPSC Civil Services, SSC, Kerala PSC, and other similar exams).</li>\n<li>Experience in clearing preliminary rounds or reaching the interview stage is a plus.</li>\n<li>Awareness of other competitive exams (conducted by the Union and State Governments) is beneficial.</li>\n<li>Bachelor’s degree in any field.</li>\n<li>Good command of English and Malayalam.</li>\n<li>A good, energetic voice with strong presentation skills for audio podcasts—no prior experience required.</li>\n<li>Active on social media and familiar with content trends (preferred but not required).</li>\n<li>Self-motivated, proactive, and full of ideas.</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>Full-time position with a flexible work environment – work from anywhere at your convenience.</li>\n<li>A platform to showcase your expertise and help aspirants succeed.</li>\n<li>A creative and supportive environment where your ideas matter.</li>\n<li>No prior work experience required – just passion and knowledge.</li>\n<li>Collaborate with a talented and creative team in a supportive culture.</li>\n<li>Continuous learning and professional development opportunities.</li>\n<li>Contract-based role with the potential to convert into a permanent position based on performance.</li>\n</ul>",
        "tags": [
            "0+ Years",
            "Podcast Hosting",
            "Content Creation",
            "Competitive Exams"
        ],
        "summary": "Seeking passionate female candidates for an Educator & Podcast Presenter role. Earn while you learn by hosting podcasts and creating study material for competitive exam aspirants."
    },
    {
        "job_title": "Client Enablement Associate",
        "company": "Softnotions Technologies Pvt Ltd",
        "url": "https://technopark.org/job-details/24183",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Softnotions Technologies Pvt Ltd</h2>\n<p><strong>Company:</strong> Softnotions Technologies Private Limited\n<strong>Location:</strong> GE, Ground Floor, Padmanabham Technopark Campus, Thiruvananthapuram, Kerala, India 695 581\n<strong>Website:</strong> http://www.softnotions.com</p>\n<h2>Client Enablement Associate</h2>\n<p><strong>Closing Date:</strong> 17-Oct-2025\n<strong>Job Published:</strong> 11-Oct-2025\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>New client acquisition and business development.</li>\n<li>Ensure that all sales opportunities are fully captured and explored.</li>\n<li>Ensuring timely response and an excellent level of client service to all enquiries and active projects.</li>\n<li>Arrange and attend meetings with prospective clients as per business requirements.</li>\n<li>Adhere to Company Registration process with new clients.</li>\n<li>Negotiating &amp; winning business and handing over accounts to the project manager.</li>\n<li>Developing strong relationships with existing clients and developing other opportunities.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Guiding creative development, proposal (PPT) preparation, and presentation.</li>\n<li>End-to-end development of pitch presentations in coordination with the design and operations team.</li>\n<li>Managing internal pitch process, taking and writing briefs, in internal meetings.</li>\n<li>MBA Marketing with an engineering background preferred, with a passion for sales and marketing.</li>\n<li>Excellent communication skills.</li>\n<li>IT Experience - Must have Minimum 1 year in IT services (Sales).</li>\n<li>Preference for Immediate Joinees.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Sales",
            "Business Development",
            "Client Relations"
        ],
        "summary": "Seeking a Client Enablement Associate for new client acquisition and business development. Responsibilities include managing sales opportunities and client relationships."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/24182",
        "location": "Technopark",
        "closing_date": "16 Oct 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Company:</strong> Prayan Animation Studio (P) Ltd\n<strong>Location:</strong> E-12, Tejaswini-1, Technopark, Trivandrum, Kerala, India, 695 581\n<strong>Website:</strong> http://www.prayananimation.com</p>\n<p><strong>Job Published:</strong> 11, Oct 2025\n<strong>Closing Date:</strong> 16, Oct 2025</p>\n<p><strong>Contact Email:</strong> jobs@prayananimation.com</p>\n<h3>Job Overview:</h3>\n<p>Prayan Animation Studio is seeking a dynamic and results-driven Business Development Executive to join their team. The ideal candidate will possess 2-3 years of experience in business development, with a proven ability to acquire new clients, manage client relationships, and drive business growth within the animation and creative sectors. This role presents an excellent opportunity to contribute to the expansion of a leading animation studio.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Research and identify potential clients across industries such as entertainment, advertising, education, gaming, and others requiring animation and creative services.</li>\n<li>Employ diverse strategies to attract new clients, including cold calling, networking, attending industry events, and utilizing social media.</li>\n<li>Cultivate and maintain strong, enduring relationships with clients.</li>\n<li>Act as the primary point of contact for client communications, promptly addressing inquiries and meeting client needs.</li>\n<li>Collaborate with creative and production teams to ensure client requirements are met to the highest standards.</li>\n<li>Develop and maintain a robust pipeline of potential leads and clients.</li>\n</ul>\n<h3>Preferred Skills and Qualifications:</h3>\n<ul>\n<li><strong>Education:</strong> MBA in Marketing or a related field.</li>\n<li><strong>Experience:</strong> 2-3 years in business development and client management, preferably within the animation, media, or creative industries.</li>\n<li>Strong understanding of client relationship management principles.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Proficiency in Microsoft Excel and CRM tools.</li>\n<li>Ability to work effectively both independently and as part of a team.</li>\n<li>Self-motivated, results-driven, with a passion for delivering exceptional client service.</li>\n<li>Strong problem-solving capabilities and creative thinking skills.</li>\n</ul>\n<h3>Job Details:</h3>\n<ul>\n<li><strong>Job Type:</strong> Full-time</li>\n<li><strong>Schedule:</strong> Day shift</li>\n<li><strong>Relocation:</strong> Must be able to commute or plan to relocate to Trivandrum, Kerala.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>To apply, please submit your resume and a link to your online portfolio showcasing your best work to <strong>jobs@prayananimation.com</strong>. Please use the subject line: \"Resume – Business Development Executive (BDE)\".</p>\n<p><strong>Expected Start Date:</strong> Immediate Joining.</p>",
        "tags": [
            "2-3 Years",
            "Business Development",
            "Client Management",
            "Animation"
        ],
        "summary": "Seeking a Business Development Executive with 2-3 years of experience to drive growth in animation services. Responsibilities include client acquisition, relationship management, and pipeline development."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24181",
        "location": "Technopark",
        "closing_date": "13 Oct 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd\n<strong>Location:</strong> 1st Floor, M Squared Building, Annex 1, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> www.trainonexsolutions.in</p>\n<p><strong>Published:</strong> October 11, 2025\n<strong>Closing Date:</strong> October 13, 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals.</p>\n<p>This is a great opportunity for individuals looking for a job.</p>\n<h3>Requirements:</h3>\n<ul>\n<li>Immediate joiners needed</li>\n<li>Work from office opportunity</li>\n<li>Experience: 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Fluency with Malayalam Language required</li>\n</ul>\n<p><strong>Please mention the subject line as \"Telesales Executive\" in your email.</strong></p>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Communication"
        ],
        "summary": "Seeking a motivated Telesales Executive to drive sales over the phone, build customer relationships, and identify/qualify leads for company growth. Immediate joiners with Malayalam fluency preferred."
    },
    {
        "job_title": "Trainee Sales Engineer(MBA Freshers)",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24180",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Trainee Sales Engineer (MBA Freshers)</h2>\n<p><strong>Company:</strong> TECHVANTAGE SYSTEMS (P) Ltd</p>\n<p><strong>Locations:</strong>\n- Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\n- 2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.techvantagesystems.com</p>\n<p><strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 31, Oct 2025\n<strong>Job Published:</strong> 11, Oct 2025</p>\n<h3>Brief Description</h3>\n<ul>\n<li>Assist in identifying new business opportunities in the IT/software domain.</li>\n<li>Support the sales cycle — from lead generation to client engagement.</li>\n<li>Build and maintain client relationships with guidance from senior team members.</li>\n<li>Understand client requirements and help prepare proposals and presentations.</li>\n<li>Stay updated on market trends and emerging technologies.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>Masters degree in Business, Marketing or a related field.</li>\n<li>0–1 year of experience or strong interest in IT sales/business development.</li>\n<li>Good communication and interpersonal skills.</li>\n<li>Basic understanding of IT products/services (cloud, web, SaaS, etc.) is a plus.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Hands-on learning in tech sales and client management.</li>\n<li>Mentorship from experienced professionals.</li>\n<li>Growth opportunity to transition into a full-time Sales Engineer role.</li>\n<li>Collaborative and supportive work culture.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "IT Sales",
            "Business Development",
            "Client Relationship Management"
        ],
        "summary": "Seeking MBA freshers for a Trainee Sales Engineer role. Responsibilities include lead generation, client engagement, and market trend analysis. Offers hands-on tech sales experience and mentorship."
    },
    {
        "job_title": "Intern Sales Engineer(MBA Freshers)",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24179",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Intern Sales Engineer (MBA Freshers)</h2>\n<p><strong>Company:</strong> TECHVANTAGE SYSTEMS (P) Ltd</p>\n<p><strong>Locations:</strong>\n*   Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\n*   2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.techvantagesystems.com</p>\n<p><strong>Contact:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Job Published:</strong> 11, Oct 2025</p>\n<p><strong>Closing Date:</strong> 31 Oct, 2025</p>\n<h3>Brief Description:</h3>\n<ul>\n<li>Assist in identifying new business opportunities in the IT/software domain.</li>\n<li>Support the sales cycle — from lead generation to client engagement.</li>\n<li>Build and maintain client relationships with guidance from senior team members.</li>\n<li>Understand client requirements and help prepare proposals and presentations.</li>\n<li>Stay updated on market trends and emerging technologies.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>Masters degree in Business, Marketing or a related field.</li>\n<li>0–1 year of experience or strong interest in IT sales/business development.</li>\n<li>Good communication and interpersonal skills.</li>\n<li>Basic understanding of IT products/services (cloud, web, SaaS, etc.) is a plus.</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>Hands-on learning in tech sales and client management.</li>\n<li>Mentorship from experienced professionals.</li>\n<li>Growth opportunity to transition into a full-time Sales Engineer role.</li>\n<li>Collaborative and supportive work culture.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "IT Sales",
            "Business Development",
            "Client Management"
        ],
        "summary": "Seeking MBA Freshers for an Intern Sales Engineer role. Gain experience in IT sales, client engagement, and business development with growth opportunities."
    },
    {
        "job_title": "Senior Full-Stack Developer (3-6 yrs Exp)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24178",
        "location": "Technopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>Senior Full-Stack Developer</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, 2nd Floor, Thejaswini Building, Technopark Phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in</p>\n<p><strong>Job Published:</strong> 11 October 2025\n<strong>Closing Date:</strong> 25 November 2025\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<h3>Job Summary:</h3>\n<p>We are looking for an experienced and highly skilled Senior Full Stack Developer with a strong command of React.js and Node.js to take a leading role in building complex, scalable, and secure web applications. You’ll be expected to contribute to the architecture and development of both frontend and backend systems, mentor junior developers, and collaborate closely with product and design teams.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead the design, development, and deployment of full-stack applications using React.js (front-end) and Node.js (back-end).</li>\n<li>Architect robust, secure, and scalable backend systems using Express.js and modern API design principles.</li>\n<li>Experience working with microservices architecture, serverless frameworks, and distributed systems.</li>\n<li>Translate business and product requirements into high-quality technical solutions.</li>\n<li>Write high-performance, reusable, and modular code following industry best practices and coding standards.</li>\n<li>Oversee database design, manage complex queries, and optimize performance in MySQL and PostgreSQL.</li>\n<li>Familiarity with build tools like Webpack, Babel, etc., and package managers such as npm or Yarn.</li>\n<li>Develop and maintain comprehensive test coverage through unit and integration tests.</li>\n<li>Conduct code reviews, provide mentorship, and enforce clean code practices across the team.</li>\n<li>Lead troubleshooting and debugging efforts across full-stack environments.</li>\n<li>Contribute to and maintain CI/CD pipelines to ensure reliable deployment processes.</li>\n<li>Collaborate cross-functionally with Product Managers, Designers, QA, and DevOps.</li>\n<li>Ensure applications meet security, accessibility, and performance benchmarks.</li>\n<li>Advocate for and help adopt emerging technologies and AI developer tools like Cursor AI or Cline.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>3–6 years of hands-on experience in full-stack development with a primary focus on React.js and Node.js or Next JS.</li>\n<li>Deep understanding of JavaScript (ES6+), HTML5, CSS3, and modern front-end development practices.</li>\n<li>Strong architectural understanding of web applications, MVC patterns, and modular design.</li>\n<li>Proficient in MySQL and PostgreSQL, including schema design, indexing, joins, and query optimization.</li>\n<li>Demonstrated experience with unit testing frameworks (Jest, Mocha, etc.) and test-driven development (TDD).</li>\n<li>Proficient in version control systems like Git and workflows such as GitFlow.</li>\n<li>Strong understanding of asynchronous programming, authentication, and authorization protocols (JWT, OAuth).</li>\n<li>Proven experience in setting up and managing CI/CD pipelines and deployment automation.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Experience with TypeScript in both front-end and back-end environments.</li>\n<li>Exposure to containerization tools like Docker and experience deploying to cloud platforms (AWS, GCP, Firebase).</li>\n<li>Familiarity with GraphQL, WebSockets, or event-driven systems.</li>\n<li>Hands-on experience with AI-powered dev tools (e.g., Cursor AI, Cline, GitHub Copilot).</li>\n<li>Experience mentoring junior developers and leading sprint-based teams in an Agile environment.</li>\n<li>Familiarity with monitoring, alerting, and observability tools (e.g., Sentry, New Relic, Prometheus).</li>\n<li>Exposure to performance profiling and browser-based debugging.</li>\n</ul>\n<p><strong>Location:</strong> Trivandrum (Work from office)\n<strong>Salary:</strong> ₹600,000.00 - ₹1,200,000.00 per year</p>\n<p><strong>Job Types:</strong> Full-time, Permanent\n<strong>Work Location:</strong> In person</p>",
        "tags": [
            "3-6 Years",
            "React.js",
            "Node.js",
            "Full-Stack"
        ],
        "summary": "Seeking a Senior Full-Stack Developer with 3-6 years experience in React.js and Node.js. Lead development, mentor juniors, and build scalable web applications."
    },
    {
        "job_title": "Online Internship-Research&Documentation",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24177",
        "location": "Technopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>REIZEND (P) Ltd - Online Internship: Research &amp; Documentation</h2>\n<p><strong>Company:</strong> REIZEND PRIVATE LIMITED\n<strong>Location:</strong> Technopark phase 1, Trivandrum, 695581 (Remote Internship)\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Job Published:</strong> 11, Oct 2025\n<strong>Closing Date:</strong> 25, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for interns currently pursuing management or relevant academic courses who are interested in gaining real-world exposure through online research and documentation tasks.</p>\n<p><strong>Role:</strong> Research &amp; Documentation Intern\n<strong>Mode:</strong> Remote\n<strong>Duration:</strong> 3 Months\n<strong>Stipend:</strong> ₹10000 per month.</p>\n<h2>Key Responsibilities:</h2>\n<ul>\n<li>Conduct structured online research based on given topics.</li>\n<li>Create and maintain documentation, reports, and summaries.</li>\n<li>Assist in organizing relevant data for internal analysis or presentations.</li>\n</ul>\n<h2>What you'll Gain:</h2>\n<ul>\n<li>Internship Certificate</li>\n<li>Hands-on exposure to real-time research and documentation.</li>\n<li>Opportunity to work with a collaborative and professional team.</li>\n</ul>\n<h2>How to Apply:</h2>\n<p>Interested candidates can share their CV. Please mention \"Internship – Research &amp; Documentation\" in the subject line.</p>\n<h2>Preferred Skills:</h2>\n<ul>\n<li>Pursuing MBA, BBA, or similar management (open to other relevant academic streams as well).</li>\n<li>Good Academics.</li>\n<li>Strong internet research skills and attention to detail.</li>\n<li>Good command over written English and basic documentation tools (Google Docs/Sheets, MS Word, etc.).</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Research",
            "Documentation",
            "Management"
        ],
        "summary": "Seeking management students for a 3-month remote Research & Documentation internship. Gain real-world exposure and hands-on experience. Stipend provided."
    },
    {
        "job_title": "Junior Devops Engineer-Tech Support",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24176",
        "location": "Technopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>Junior DevOps Engineer - Tech Support</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala (Preferred candidate locations: Kerala, Tamil Nadu, and Karnataka)\n<strong>Address:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai\n<strong>Closing Date:</strong> 25, Nov 2025\n<strong>Job Published:</strong> 11, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a proactive &amp; highly skilled Technical Support Engineer to provide exceptional technical support to overseas projects, working in rotational shifts to ensure 24/7 availability. This role involves troubleshooting complex issues across cloud platforms, networking, application architectures, and DevOps toolchains. The ideal candidate should be self-motivated, a collaborator, agile, and a continuous learner.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Provide technical support and troubleshoot issues related to cloud platforms and services such as Fargate, ECS, DynamoDB, BigQuery, SNS etc.</li>\n<li>Understand problems by consuming logs and metrics from various sources using services like CloudWatch, Prometheus, Grafana, Loki, Alert Managers, and Splunk etc.</li>\n<li>Analyze and resolve networking challenges, including load balancers, API gateways, reverse proxies, ingress controllers, and service-to-service communications.</li>\n<li>Work on issues related to client-server communications, firewalls, and virtual machines.</li>\n<li>Collaborate with DevOps teams to manage and troubleshoot toolchains like Docker, Kubernetes, Jenkins, Ingress Controllers etc.</li>\n<li>Act as the first point of contact for technical queries and escalate issues when necessary.</li>\n<li>Liaise with development and operations teams to identify root causes and resolve incidents effectively.</li>\n<li>Document troubleshooting steps, solutions, and maintain a knowledge base for recurring issues.</li>\n<li>Collaborate with cross-functional teams to implement best practices for monitoring and incident response.</li>\n<li>Participate in shift handovers and provide timely updates on ongoing issues.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Cloud Platforms and Services</strong></p>\n<ul>\n<li>Hands-on knowledge working with Fargate and ECS for managing and troubleshooting containerized workloads.</li>\n<li>Proficiency with DynamoDB and BigQuery for analyzing data and making decisions based on the analysis.</li>\n<li>Hands-on knowledge of SNS for debugging message delivery issues and integration workflows.</li>\n</ul>\n<p><strong>Monitoring and Logging Tools</strong></p>\n<ul>\n<li>Proficiency in CloudWatch Logs, Loki, and Splunk for consuming and analyzing logs to identify and resolve issues.</li>\n<li>Hands-on knowledge with Prometheus and Grafana for analyzing metrics using dashboards and monitoring system health.</li>\n<li>Knowledge of Alert Manager for configuring and managing alert escalation.</li>\n<li>Ability to interpret metrics from various sources and create actionable insights.</li>\n</ul>\n<p><strong>Networking and Security</strong></p>\n<ul>\n<li>Understanding of load balancers (e.g., ALB, NLB) for distributing traffic and troubleshooting connectivity issues.</li>\n<li>Knowledge in API Gateways like AWS API Gateway or NGINX for managing API traffic.</li>\n<li>Knowledge of reverse proxies and ingress controllers (e.g., NGINX Ingress, Traefik) for managing internal/external traffic.</li>\n<li>Understanding service-to-service communications, including DNS, HTTP/HTTPS, and gRPC protocols.</li>\n<li>Hands-on knowledge with firewalls, security groups, and IAM roles for secure communications.</li>\n<li>Troubleshooting skills for VM-related issues in platforms like AWS EC2 or equivalent.</li>\n</ul>\n<p><strong>DevOps Toolchains</strong></p>\n<ul>\n<li>Proficiency with Docker for managing container images and runtime debugging.</li>\n<li>Understanding of Kubernetes concepts for managing deployments, ingress setups, and pod-related issues, along with related troubleshooting commands and mechanisms.</li>\n<li>Knowledge of CI/CD pipeline building tools such as Jenkins, GitHub Actions, ArgoCD for building, deploying, and managing automated pipelines.</li>\n<li>Understanding of Ingress controllers (e.g., NGINX, Traefik) and SSL termination for secure routing.</li>\n</ul>\n<p><strong>Troubleshooting and Incident Management</strong></p>\n<ul>\n<li>Strong problem-solving skills to identify root causes using logs, metrics, and system-level debugging.</li>\n<li>Ability to document detailed troubleshooting steps and solutions for recurring issues.</li>\n</ul>\n<p><strong>Collaboration and Communication</strong></p>\n<ul>\n<li>Ability to work with cross-functional teams (DevOps, development, and operations) to resolve incidents.</li>\n<li>Skills in effective and proactive communication to escalate issues and provide updates during shift handovers.</li>\n<li>Proficiency with tools like Slack, JIRA, Confluence, or Google Workspace for collaboration and issue tracking.</li>\n</ul>\n<h3>Additional Information</h3>\n<p><strong>Salary Package:</strong> 4 - 6 LPA\n<strong>Work Type:</strong> Work From Office\n<strong>Location:</strong> Trivandrum\n<strong>Experience:</strong> 0.5 - 2 years</p>",
        "tags": [
            "0.5-2 Years",
            "DevOps",
            "Cloud Platforms",
            "Troubleshooting"
        ],
        "summary": "Seeking a skilled Technical Support Engineer with 0.5-2 years of experience for overseas projects. Role involves troubleshooting cloud, networking, and DevOps issues in a rotational shift environment."
    },
    {
        "job_title": "Senior Asset Artist (Team Lead)",
        "company": "Technocil (P) Ltd",
        "url": "https://technopark.org/job-details/24175",
        "location": "Technopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>Senior Asset Artist (Team Lead)</h2>\n<p><strong>Company:</strong> TECHNOCIL (P) Ltd\n<strong>Location:</strong> 2806 Module, 8th Floor, Yamuna, Phase -III, Technopark, 695583\n<strong>Website:</strong> http://www.technocil.com\n<strong>Contact Email:</strong> hr@technocil.com\n<strong>Job Published:</strong> 11, October 2025\n<strong>Closing Date:</strong> 25, November 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a Senior Asset Artist (Team Lead) with a minimum of 15 years of experience in the animation industry to lead our asset creation team. The ideal candidate will have deep expertise in Maya, Blender, and Unreal Engine, combined with strong artistic vision and proven leadership capabilities. You will oversee the creation of high-quality 3D assets while guiding a talented team to maintain artistic consistency, technical excellence, and production efficiency.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Lead and mentor the 3D asset team, ensuring high standards of quality and productivity.</li>\n<li>Create, review, and oversee the development of props, environments, and characters for real-time and cinematic use.</li>\n<li>Utilise Maya and Blender for advanced modelling, texturing, UV mapping, and asset optimisation.</li>\n<li>Develop detailed textures and materials using Substance Painter and maintain adherence to PBR workflows.</li>\n<li>Integrate, test, and optimise assets in Unreal Engine to ensure top-tier performance and visual fidelity.</li>\n<li>Collaborate with designers, animators, and technical artists for seamless pipeline integration.</li>\n<li>Establish and maintain best practices, asset workflows, and quality benchmarks.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Minimum 15 years of experience in the animation or game development industry.</li>\n<li>Proven leadership experience with the ability to guide, mentor, and inspire a creative team.</li>\n<li>Strong proficiency in Maya, Blender, and Unreal Engine.</li>\n<li>Extensive experience with Substance Painter and PBR material workflows.</li>\n<li>Deep understanding of real-time rendering, optimization, and asset pipeline management.</li>\n<li>Excellent communication, problem-solving, and organizational skills.</li>\n<li>Strong artistic eye with attention to detail, composition, and aesthetics.</li>\n</ul>",
        "tags": [
            "15+ Years",
            "Maya",
            "Blender",
            "Unreal Engine"
        ],
        "summary": "Lead a 3D asset team with 15+ years of experience. Expertise in Maya, Blender, and Unreal Engine required for high-quality asset creation and team guidance."
    },
    {
        "job_title": "Senior Unity Developer",
        "company": "Technocil (P) Ltd",
        "url": "https://technopark.org/job-details/24174",
        "location": "Technopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>Senior Unity Developer</h2>\n<p><strong>Company:</strong> TECHNOCIL (P) Ltd</p>\n<p><strong>Location:</strong> 2806 Module, 8th Floor, Yamuna, Phase -III, Technopark, 695583</p>\n<p><strong>Website:</strong> http://www.technocil.com</p>\n<p><strong>Contact Email:</strong> hr@technocil.com</p>\n<p><strong>Job Published:</strong> 11, Oct 2025</p>\n<p><strong>Closing Date:</strong> 25, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a Senior Unity Developer to lead our dynamic team. The ideal candidate should have around 10 years of experience in developing high-quality interactive applications, games, or simulations using Unity 3D. In this role, you will collaborate closely with designers, artists, and fellow developers to bring creative visions to life, delivering immersive, engaging, and technically robust experiences across platforms.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead and manage a team of VR professionals.</li>\n<li>Develop and optimize VR/AR applications using Unity and C#.</li>\n<li>Work with Meta Quest, HoloLens, WebXR, and other VR/AR platforms to create seamless user experiences.</li>\n</ul>\n<h3>Preferred Skills &amp; Requirements:</h3>\n<ul>\n<li>Around 10 years of experience in Unity development, focusing on VR/AR applications.</li>\n<li>Strong proficiency in C# and object-oriented programming.</li>\n<li>Hands-on experience with Meta Quest, HoloLens, and WebXR development.</li>\n<li>Expertise in VR SDKs (Oculus SDK, OpenXR, SteamVR) and AR SDKs (ARKit, ARCore, Vuforia).</li>\n<li>Experience in UI/UX design for VR/AR, including gesture-based and hand-tracking interactions.</li>\n<li>Strong understanding of 3D graphics, shaders, physics, and rendering optimization.</li>\n<li>Ability to integrate APIs, plugins, and third-party libraries into Unity applications.</li>\n</ul>\n<p><strong>Job Type:</strong> Full-time</p>\n<p><strong>Pay:</strong> ₹80,000.00 - ₹1,00,000.00 per month</p>",
        "tags": [
            "10+ Years",
            "Unity",
            "VR/AR Development",
            "C#"
        ],
        "summary": "Lead a team as a Senior Unity Developer with 10 years of experience. Develop VR/AR applications using Unity and C#, focusing on Meta Quest and HoloLens."
    },
    {
        "job_title": "UI/Graphic Designer – AR/VR, Games & Interactive Experiences",
        "company": "Tiltlabs Consultancy Services (P) Ltd",
        "url": "https://technopark.org/job-details/24173",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>UI/Graphic Designer – AR/VR, Games &amp; Interactive Experiences</h2>\n<p><strong>Company:</strong> TILTLABS CONSULTANCY SERVICES (P) Ltd\n<strong>Location:</strong> Technopark, Trivandrum, Kerala, India\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 31, Oct 2025\n<strong>Contact Email:</strong> careers@tiltlabs.io</p>\n<h3>Job Summary:</h3>\n<p>We are seeking a passionate and skilled UI/Graphic Designer to create visually stunning and user-centric interfaces for AR/VR applications, game experiences, and interactive platforms. The ideal candidate possesses strong graphic design skills, a deep understanding of user experience, and interaction flow. You will collaborate with creative, development, and product teams to design immersive, intuitive, and engaging digital experiences across various platforms, including games, gamified apps, web, and mobile interfaces.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design visually compelling and functional UI for AR/VR applications, game interfaces, and gamified systems, ensuring seamless user journeys in immersive environments.</li>\n<li>Develop visual storyboards to illustrate and communicate concepts, user journeys, and interaction flows for gamified projects and immersive applications.</li>\n<li>Utilize Generative AI tools (e.g., MidJourney, Adobe Firefly) for innovative visual solutions, prompt-based illustrations, and creative asset generation.</li>\n<li>Develop wireframes, mockups, and interactive prototypes to communicate design intent and user flow.</li>\n<li>Create high-quality graphics, icons, 2D assets, and motion elements aligned with gameplay or immersive experiences.</li>\n<li>Collaborate with developers, artists, and product managers to translate requirements into cohesive design solutions.</li>\n<li>Define and maintain UI style guides, design systems, and component libraries for project consistency.</li>\n<li>Design and optimize interfaces for web and mobile applications, applying responsive and platform-specific principles.</li>\n<li>Contribute to project visual branding by creating marketing and in-app assets that reflect product identity.</li>\n<li>Conduct usability reviews and iterate designs based on feedback and testing results.</li>\n<li>Stay updated on design trends in games, XR, and interactive media, integrating innovative UI patterns.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in Graphic Design, Animation, VFX, Interaction Design, or a related field.</li>\n<li>2–3 years of experience in UI/UX or graphic design, preferably in AR/VR, gaming, or interactive media.</li>\n<li>Proficiency in design software such as Figma, Adobe XD, Photoshop, Illustrator, After Effects.</li>\n<li>Strong portfolio showcasing UI design for games, immersive experiences, or applications, with visual design and motion skills.</li>\n<li>Understanding of user-centered design principles, interaction flow, and accessibility.</li>\n<li>Familiarity with real-time engines (Unity, Unreal) or XR design principles is a plus.</li>\n<li>Ability to manage multiple projects, deliver on time, and adapt to evolving creative requirements.</li>\n<li>Excellent communication, collaboration, and presentation skills.</li>\n<li>A keen eye for detail, color, composition, and motion, with a passion for blending art and usability.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Experience designing HUDs, menus, and UI systems for games or AR/VR environments.</li>\n<li>Exposure to gamification principles and user motivation design.</li>\n<li>Ability to create 2D animations and motion graphics for UI feedback or transitions.</li>\n<li>Knowledge of front-end development basics for smooth design-to-dev handoff.</li>\n<li>Familiarity with brand and marketing asset design.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "UI/UX Design",
            "AR/VR",
            "Game Design"
        ],
        "summary": "Seeking a UI/Graphic Designer for AR/VR and games. Responsibilities include interface design, prototyping, and asset creation. Requires 2-3 years of experience and proficiency in design tools."
    },
    {
        "job_title": "Technical Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24172",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Technical Architect - Reflections Info Systems (P) Ltd</h2>\n<p><strong>Location:</strong> Thiruvananthapuram, Kerala, India\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Closing Date:</strong> October 17, 2025\n<strong>Job Published:</strong> October 10, 2025</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems is seeking candidates with over 10 years of experience for the role of Technical Architect.</p>\n<h3>Responsibilities</h3>\n<p><strong>Architecture &amp; Design</strong>\n- Define, design, and implement end-to-end technical architectures for enterprise-grade solutions.\n- Architect scalable and secure cloud-native applications leveraging AWS, Azure, or GCP.\n- Provide design guidance on 3D imaging applications, data processing, and visualization workflows.\n- Establish standards for API design and integration, ensuring reusability, performance, and security.</p>\n<p><strong>Development &amp; Implementation</strong>\n- Guide development teams in implementing solutions using Python, .NET, and C#.\n- Drive adoption of containerization (Docker, Kubernetes) for deployment and orchestration.\n- Ensure efficient use of databases including PostgreSQL and MongoDB for structured and unstructured data.</p>\n<p><strong>Collaboration &amp; Leadership</strong>\n- Collaborate with business stakeholders to translate requirements into technical roadmaps.\n- Provide mentorship and technical leadership to engineers and developers.\n- Conduct code reviews, enforce best practices, and ensure compliance with architectural guidelines.</p>\n<p><strong>Quality &amp; Performance</strong>\n- Ensure system performance, reliability, and scalability through proper architectural decisions.\n- Lead proof-of-concepts (POCs) and evaluate new tools/technologies for adoption.\n- Oversee security, compliance, and data governance practices.</p>\n<h3>Qualifications</h3>\n<p><strong>Certifications &amp; Education</strong>\n- Bachelor’s degree in Information Management, Computer Science, Data Science, or a related field.</p>\n<p><strong>Preferred Skills</strong>\n- Proven experience as a Technical Architect or Solution Architect in complex, large-scale systems.\n- <strong>Programming Languages:</strong> Python, .NET, C#\n- <strong>Databases:</strong> PostgreSQL, MongoDB\n- <strong>Cloud Platforms:</strong> AWS, Azure, or GCP\n- <strong>API Design:</strong> REST, GraphQL, or gRPC\n- <strong>Containerization:</strong> Docker (Kubernetes experience is a plus)\n- Exposure to 3D imaging technologies, visualization frameworks, or computational graphics.\n- Strong knowledge of microservices architecture and enterprise integration patterns.\n- Excellent problem-solving, analytical, and communication skills.\n- Ability to lead cross-functional teams and drive technology strategies.</p>\n<p><strong>Secondary Skills</strong>\n- Experience with CI/CD pipelines, DevOps practices, and Infrastructure as Code (Terraform/Ansible).\n- Knowledge of AI/ML workflows in imaging and data analysis.\n- Familiarity with Agile/Scrum methodologies.</p>\n<h3>Application Process</h3>\n<p>Interested candidates are invited to forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current, and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers</h3>\n<p>It has come to our attention that some individuals are falsely claiming to offer jobs with Reflections Info Systems for a fee. Please be advised that Reflections Info Systems <strong>never</strong> requests any payment for job applications or offers. We communicate with candidates exclusively through our official website or LinkedIn, and all official employment-related emails originate from our official HR email ID. For any clarification or to report suspicious activity, please contact us at careers@reflectionsinfos.com.</p>",
        "tags": [
            "10+ Years",
            "AWS",
            "Python",
            "Architecture"
        ],
        "summary": "Seeking a Technical Architect with 10+ years of experience to define and implement enterprise-grade solutions. Responsibilities include cloud architecture, development guidance, and technical leadership."
    },
    {
        "job_title": "Senior DotNet Developer+Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24171",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Senior DotNet Developer + Azure</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 17, Oct 2025</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems is seeking experienced candidates for the role of Senior DotNet Developer with Azure expertise. This position requires a minimum of 8 years of professional experience.</p>\n<p><strong>Working Hours:</strong> 12:00 PM - 9:00 PM</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Design, develop, enhance, document, and maintain robust applications using .NET Core 6/8+, C#, REST APIs, T-SQL, and modern JavaScript/jQuery.</li>\n<li>Integrate and support third-party APIs and external services.</li>\n<li>Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack.</li>\n<li>Identify, prioritize, and execute tasks throughout the Software Development Life Cycle (SDLC).</li>\n<li>Participate in Agile/Scrum ceremonies and manage tasks using Jira.</li>\n<li>Understand technical priorities, architectural dependencies, risks, and implementation challenges.</li>\n<li>Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<p>**Primary Skills (8+ years of hands-on development experience):</p>\n<ul>\n<li>C#, .NET Core 6/8+, Entity Framework / EF Core</li>\n<li>JavaScript, jQuery, REST APIs</li>\n<li>Expertise in MS SQL Server, including: Complex SQL queries, Stored Procedures, Views, Functions, Packages, Cursors, Tables, and Object Types.</li>\n<li>Skilled in unit testing with XUnit, MSTest.</li>\n<li>Strong in software design patterns, system architecture, and scalable solution design.</li>\n<li>Ability to lead and inspire teams through clear communication, technical mentorship, and ownership.</li>\n<li>Strong problem-solving and debugging capabilities.</li>\n<li>Ability to write reusable, testable, and efficient code.</li>\n<li>Develop and maintain frameworks and shared libraries to support large-scale applications.</li>\n<li>Excellent technical documentation, communication, and leadership skills.</li>\n<li>Microservices and Service-Oriented Architecture (SOA).</li>\n<li>Experience in API Integrations.</li>\n</ul>\n<p>**Azure Cloud Services (2+ years of hands-on experience):</p>\n<ul>\n<li>Azure Functions</li>\n<li>Azure Durable Functions</li>\n<li>Azure Service Bus, Event Grid, Storage Queues</li>\n<li>Blob Storage, Azure Key Vault, SQL Azure</li>\n<li>Application Insights, Azure Monitoring</li>\n</ul>\n<p>**Secondary Skills:</p>\n<ul>\n<li>Familiarity with AngularJS, ReactJS, and other front-end frameworks.</li>\n<li>Experience with Azure API Management (APIM).</li>\n<li>Knowledge of Azure Containerization and Orchestration (e.g., AKS/Kubernetes).</li>\n<li>Experience with Azure Data Factory (ADF) and Logic Apps.</li>\n<li>Exposure to Application Support and operational monitoring.</li>\n<li>Azure DevOps - CI/CD pipelines (Classic / YAML).</li>\n</ul>\n<h2>Application Process:</h2>\n<p>Interested candidates are requested to forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice Regarding Fraudulent Job Offers:</strong></p>\n<p>It has come to our attention that some individuals are falsely claiming to offer jobs with Reflections Info Systems for a fee. Please be aware that Reflections Info Systems <strong>never</strong> solicits payment for job opportunities. We communicate with candidates exclusively through our official website or LinkedIn, and all employment-related emails are sent from our official HR email address. For any clarification or to report suspicious activity, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Azure",
            "C#"
        ],
        "summary": "Seeking an experienced Senior DotNet Developer with 8+ years of experience in .NET Core and Azure. Responsibilities include application development, integration, and collaboration within an Agile environment."
    },
    {
        "job_title": "Agile Coach/Agile PM",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24170",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Agile Coach / Agile PM</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 17, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced Agile Coach / Agile Project Manager with 8–10 years of experience in driving Agile transformation, facilitating delivery, and coaching teams to adopt Agile values and practices. The ideal candidate will have a strong background in Scrum, Kanban, and scaled Agile frameworks, with proven expertise in stakeholder management, change management, and project delivery.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Act as a servant leader and coach for Agile teams, ensuring effective adoption of Agile principles and practices.</li>\n<li>Guide multiple teams and stakeholders through Agile ways of working, including Scrum, Kanban, SAFe, or LeSS.</li>\n<li>Facilitate workshops, sprint planning, reviews, retrospectives, and program increment (PI) planning sessions.</li>\n<li>Partner with leadership to define and implement Agile transformation strategies, including metrics for success.</li>\n<li>Remove impediments, resolve conflicts, and ensure smooth cross-functional collaboration.</li>\n<li>Drive continuous improvement initiatives and embed a culture of learning and innovation.</li>\n<li>Mentor Scrum Masters, Product Owners, and team members to build strong Agile leadership across the organization.</li>\n<li>Track and report progress using Agile metrics (velocity, burn-down, lead time, NPS, etc.) to stakeholders.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>8–10 years of experience in IT project management, with at least 5+ years in Agile coaching or Agile PM roles.</li>\n<li>Strong expertise in Scrum, Kanban, Agile scaling frameworks (SAFe, LeSS, or equivalent).</li>\n<li>Hands-on experience in managing Agile projects/programs with distributed or cross-functional teams.</li>\n<li>Proven ability to engage with senior stakeholders, manage expectations, and influence change.</li>\n<li>Excellent facilitation, mentoring, and coaching skills.</li>\n<li>Strong knowledge of Jira, Confluence, Rally, or other Agile lifecycle management tools.</li>\n<li>Excellent communication, problem-solving, and leadership skills.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Agile certifications: SAFe Program Consultant (SPC), Certified Scrum Master (CSM), ICP-ACC, PMI-ACP, or equivalent.</li>\n<li>Experience in Agile transformation at scale in complex enterprise environments.</li>\n<li>Exposure to hybrid delivery models integrating Agile with Waterfall for large-scale programs.</li>\n<li>Knowledge of DevOps, CI/CD, and modern engineering practices.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "8-10 Years",
            "Agile Coach",
            "Scrum",
            "SAFe"
        ],
        "summary": "Seeking an experienced Agile Coach/PM with 8-10 years of experience in Agile transformation and delivery. Guide teams, facilitate Agile practices, and mentor stakeholders for successful implementation."
    },
    {
        "job_title": ".Net Technical Architect",
        "company": "Ospyn Technologies Ltd",
        "url": "https://technopark.org/job-details/24169",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>.Net Technical Architect</h2>\n<p><strong>Company:</strong> Ospyn Technologies Ltd\n<strong>Location:</strong> Technopark Phase-4, Pallipuram, Thiruvananthapuram, 695317\n<strong>Website:</strong> http://www.ospyn.com\n<strong>Closing Date:</strong> 31, Oct 2025\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Contact Email:</strong> careers@ospyn.com</p>\n<h3>Brief Description</h3>\n<p>Ospyn Technologies Ltd is seeking a skilled .Net Technical Architect to design and lead the development of end-to-end solutions. This role involves significant architectural design, team leadership, and cloud infrastructure management.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Architect and design end-to-end solutions using .NET Core, C#, Angular, and AWS services.</li>\n<li>Lead and mentor a team of developers, conducting code reviews and enforcing coding standards.</li>\n<li>Collaborate with product owners, business analysts, and QA to define technical requirements and deliverables.</li>\n<li>Implement and enforce layered architecture (Domain, Application, Infrastructure, API) and clean code principles.</li>\n<li>Oversee cloud infrastructure design, deployment, and automation on AWS (e.g., Lambda, ECS, RDS, S3).</li>\n<li>Ensure application security, observability (OpenTelemetry), and compliance with company and AWS best practices.</li>\n<li>Drive adoption of CI/CD pipelines, automated testing, and DevOps practices.</li>\n<li>Stay current with emerging technologies and AWS services; recommend improvements and optimizations.</li>\n<li>Document architectural decisions and maintain technical documentation.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Engineering, or related field.</li>\n<li>8+ years of experience in software development with strong expertise in C# and .NET Core.</li>\n<li>3+ years of experience with Angular (v8+ preferred).</li>\n<li>Proven experience architecting and deploying applications on AWS (Lambda, ECS, RDS, S3, API Gateway, etc.).</li>\n<li>Solid understanding of RESTful API design, microservices, and distributed systems.</li>\n<li>Experience with infrastructure-as-code (CloudFormation, CDK, or Terraform).</li>\n<li>Strong knowledge of software design patterns, SOLID principles, and layered architecture.</li>\n<li>Hands-on experience with CI/CD, automated testing, and code quality tools.</li>\n<li>Excellent communication, leadership, and mentoring skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>AWS Certified Solutions Architect (Associate or Professional) or equivalent AWS certification.</li>\n<li>Experience with OpenTelemetry, distributed tracing, and application monitoring.</li>\n<li>Familiarity with containerization (Docker) and orchestration (Kubernetes/ECS).</li>\n<li>Exposure to Agile/Scrum methodologies.</li>\n</ul>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "AWS",
            "Angular"
        ],
        "summary": "Seeking a .Net Technical Architect to design solutions using .NET Core, C#, Angular, and AWS. Responsibilities include team leadership, cloud infrastructure management, and driving DevOps practices."
    },
    {
        "job_title": "Apprenticeship at Electronics Technology Parks-Kerala (Technopark)",
        "company": "Electronics Technology Parks Kerala (Technopark)",
        "url": "https://technopark.org/job-details/24168",
        "location": "Technopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Apprenticeship at Electronics Technology Parks-Kerala (Technopark)</h2>\n<p><strong>Organization:</strong> Electronics Technology Parks Kerala (Technopark)\n<strong>Location:</strong> Park Centre, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> https://technopark.in\n<strong>Contact Email:</strong> apprenticeship@technopark.in</p>\n<p><strong>Closing Date:</strong> 15, October 2025\n<strong>Job Published:</strong> 10, October 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking talented and driven graduates for paid apprenticeships at Park Centre, Technopark. This is an excellent opportunity to gain hands-on experience in Electronics and Communication. The contract duration is 1 year.</p>\n<h3>Requirements</h3>\n<ul>\n<li>Diploma in Electronics and Communication, Electrical and Electronics, Electronics &amp; Instrumentation, and Applied Electronics (graduates from 2021 onwards).</li>\n<li>Ability to communicate clearly and consistently.</li>\n<li>A natural interest in working with people.</li>\n<li>Ability to work in a fast-paced and dynamic environment.</li>\n</ul>\n<h3>Duties and Responsibilities</h3>\n<ul>\n<li>Monitor and operate the CCTV surveillance system from the Control Room on a continuous basis.</li>\n<li>Perform live monitoring of all access points, perimeters, and critical areas within the Technopark campus to ensure security and safety.</li>\n<li>Log and report any suspicious activity, unauthorized access, or system anomalies to the concerned authority immediately.</li>\n<li>Register and respond to grievances and complaints received in the Control Room; coordinate follow-up actions as necessary.</li>\n<li>Maintain clear and accurate records of incidents, system faults, or maintenance needs in the Control Room logbook.</li>\n<li>Assist AMC technicians or authorized service personnel with on-ground support, system checks, or troubleshooting as required.</li>\n<li>Ensure proper functioning of all surveillance equipment and report any technical issues or malfunctions without delay.</li>\n<li>Adhere to Standard Operating Procedures (SOPs) and always maintain confidentiality and data security.</li>\n<li>Maintain cleanliness and operational readiness of the Control Room environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p>(Not specified in the original description)</p>\n<h3>Shift Timings</h3>\n<p>Operators will work in rotating 8-hour shifts:\n- Morning Shift: 6:00 AM to 2:00 PM\n- Afternoon Shift: 2:00 PM to 10:00 PM\n- Night Shift: 10:00 PM to 6:00 AM</p>\n<h3>Stipend</h3>\n<p>Rs. 15,000/month.</p>\n<h3>How to Apply</h3>\n<p>Interested candidates may send their resumes to apprenticeship@technopark.in with the subject line “Application for Technician Apprentice – Control Room”. Please attach scanned copies of your certificates along with your resume.</p>\n<p><strong>Last date to apply is 15.10.2025.</strong></p>\n<p><strong>Note:</strong> The vacancies notified here are subject to change without assigning any reason, and Technopark reserves the right to change, modify, add, or cancel the recruitment process if required.</p>",
        "tags": [
            "1 Year Apprenticeship",
            "Electronics and Communication",
            "CCTV Surveillance",
            "Technopark"
        ],
        "summary": "Technopark seeks graduates for a 1-year paid apprenticeship in Electronics and Communication. Responsibilities include CCTV monitoring and campus security assistance."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24167",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 17, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>Reflections Info Systems is seeking a seasoned Technical Delivery Manager with 14+ years of experience to oversee the successful delivery of complex technical projects and solutions. The ideal candidate will possess a strong technology background, exceptional project management skills, and the ability to collaborate effectively with cross-functional teams. This role demands end-to-end ownership of project delivery, ensuring alignment with business goals, managing stakeholder expectations, and driving technical excellence.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Project Delivery Management:</strong>\n- Oversee the planning, execution, and delivery of multiple technical projects.\n- Manage project scope, timelines, budgets, risks, and quality.\n- Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n<p><strong>Team Leadership:</strong>\n- Lead and mentor cross-functional technical teams, fostering collaboration and innovation.\n- Conduct regular performance reviews and provide growth opportunities for team members.</p>\n<p><strong>Stakeholder Engagement:</strong>\n- Act as a bridge between technical teams, business stakeholders, and clients.\n- Communicate project status, risks, and solutions effectively to all stakeholders.</p>\n<p><strong>Technical Expertise:</strong>\n- Collaborate with architects and engineers to define technical solutions.\n- Provide input on architecture, design, and implementation strategies.</p>\n<p><strong>Process Improvement:</strong>\n- Identify opportunities to improve project delivery processes and tools.\n- Implement best practices in software development and delivery.</p>\n<p><strong>Risk and Issue Management:</strong>\n- Proactively identify project risks and develop mitigation strategies.\n- Resolve technical and operational challenges in a timely manner.</p>\n<p><strong>Customer Focus:</strong>\n- Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</p>\n<h3>Preferred Skills:</h3>\n<p><strong>Experience:</strong>\n- 14 years of experience in technology delivery roles, including hands-on development and leadership responsibilities.\n- Proven experience in delivering large-scale, complex projects with diverse teams.\n- Manage P&amp;L for a portfolio of accounts, ensuring revenue growth and profitability.\n- Plan and manage team ramp-ups and ramp-downs using a mix of pyramid planning, external hiring, and internal sourcing.\n- Drive account management activities including financial tracking, invoice collection, margin improvements, and resource planning.\n- Build strong client relationships through regular interactions, QBRs, and on-site visits.\n- Support account mining by identifying new opportunities, preparing proposals, and influencing stakeholders to grow the business.</p>\n<p><strong>Technical Expertise:</strong>\n- Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.\n- Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</p>\n<p><strong>Project Management:</strong>\n- Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.\n- Certification such as PMP, CSM, or equivalent is an advantage.</p>\n<p><strong>Leadership and Communication:</strong>\n- Excellent team leadership, people management, and conflict resolution skills.\n- Strong communication, presentation, and negotiation abilities.</p>\n<h3>Education:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Experience in managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices and frameworks.</li>\n<li>Strong business acumen with the ability to align technical goals with business strategy.</li>\n</ul>\n<hr />\n<p><strong>Application Instructions:</strong>\nInterested candidates are requested to forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Fraudulent Job Offers:</strong>\nBe aware that some individuals may falsely claim to offer employment with Reflections Info Systems for a fee. Reflections Info Systems <strong>never</strong> requests payment for job opportunities. All official communication will originate from our website or LinkedIn, and all employment-related emails will come from our official HR email address. For any clarifications or alerts concerning this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "14+ Years",
            "Project Management",
            "Agile",
            "Cloud Technologies"
        ],
        "summary": "Seeking a seasoned Delivery Manager with 14+ years experience in technical project delivery. Responsibilities include project oversight, team leadership, and stakeholder management for complex solutions."
    },
    {
        "job_title": "Data Engineering - Project Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24166",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Data Engineering - Project Manager at Reflections Info Systems (P) Ltd</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 17, Oct 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced candidate with 13+ years of experience for the role of Data Engineering - Project Manager.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Own the end-to-end delivery of data platform, AI, BI, and analytics projects, ensuring alignment with business objectives and stakeholder expectations.</li>\n<li>Develop and maintain comprehensive project plans, roadmaps, and timelines for data ingestion, transformation, governance, AI/ML models, and analytics deliverables.</li>\n<li>Lead cross-functional teams including data engineers, data scientists, BI analysts, architects, and business stakeholders to deliver high-quality, scalable solutions on time and within budget.</li>\n<li>Define, prioritize, and manage product and project backlogs covering data pipelines, data quality, governance, AI services, and BI dashboards or reporting tools.</li>\n<li>Collaborate closely with business units to capture and translate requirements into actionable user stories and acceptance criteria for data and analytics solutions.</li>\n<li>Oversee BI and analytics area including dashboard development, embedded analytics, self-service BI enablement, and ad hoc reporting capabilities.</li>\n<li>Ensure data quality, lineage, security, and compliance requirements are integrated throughout the project lifecycle, in collaboration with governance and security teams.</li>\n<li>Coordinate UAT, performance testing, and user training to ensure adoption and successful rollout of data and analytics products.</li>\n<li>Act as the primary point of contact for all project stakeholders, providing regular status updates, managing risks and issues, and escalating as necessary.</li>\n<li>Facilitate agile ceremonies such as sprint planning, backlog grooming, demos, and retrospectives, fostering a culture of continuous improvement.</li>\n<li>Drive post-deployment monitoring and optimization of data and BI solutions to meet evolving business needs and performance standards.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Primary Skills</h4>\n<ul>\n<li>Overall 13+ Years of Experience in IT with 6+ years of experience as a Technical Product Manager, Technical Program Manager, or Delivery Lead.</li>\n<li>Hands-on development experience in data engineering, including data pipelines, ETL processes, and data integration workflows.</li>\n<li>Proven track record managing data engineering, analytics, or AI/ML projects end to end.</li>\n<li>Solid understanding of modern data architecture: data lakes, warehouses, pipelines, ETL/ELT, governance, and AI tooling.</li>\n<li>Hands-on familiarity with cloud platforms (e.g., Azure, AWS, GCP) and DataOps/MLOps practices.</li>\n<li>Strong knowledge of Agile methodologies, sprint planning, and backlog grooming.</li>\n<li>Excellent communication and stakeholder management skills, including working with senior execs and technical leads.</li>\n</ul>\n<h4>Secondary Skills</h4>\n<ul>\n<li>Background in computer science, engineering, data science, or analytics.</li>\n<li>Experience or Solid Understanding with data engineering tools and services in AWS, Azure &amp; GCP.</li>\n<li>Exposure or Solid Understanding of BI, Analytics, LLMs, RAG, prompt engineering, or agent-based AI systems.</li>\n<li>Experience leading cross-functional teams in matrixed environments.</li>\n<li>Certifications: PMP, CSM, SAFe, or equivalent are a plus.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "13+ Years",
            "Data Engineering",
            "Project Management",
            "Agile Methodologies"
        ],
        "summary": "Seeking an experienced Data Engineering Project Manager with 13+ years in IT. Responsibilities include end-to-end project delivery, team leadership, and ensuring alignment with business objectives."
    },
    {
        "job_title": "Technical Project Manager (Application Development)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24165",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Technical Project Manager (Application Development)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Published:</strong> 10, Oct 2025\n<strong>Closing:</strong> 17, Oct 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly experienced Technical Project Manager (Tech PM) with over 13 years of experience to oversee the complete execution of custom application development and integration projects. These projects primarily utilize .NET stacks, modern client frameworks, and integration platforms. The ideal candidate will possess a robust technical background coupled with strong project delivery skills, enabling them to lead complex, cross-functional initiatives from initial discovery to production rollout.</p>\n<p>This role demands hands-on experience across the entire software/product development lifecycle, encompassing planning, estimation, design, development, testing, and release, in close collaboration with engineering, product, and client stakeholders.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Manage end-to-end delivery of custom software development and integration projects using Java, .NET, and related technologies.</li>\n<li>Create and maintain project plans, define timelines, identify dependencies, and track progress.</li>\n<li>Coordinate with cross-functional teams including developers, QA, UI/UX, and DevOps to ensure smooth execution.</li>\n<li>Oversee all stages of the SDLC: requirements finalization, development, integration, testing (unit, system, UAT, NFR), and deployment.</li>\n<li>Work closely with architects and leads to ensure alignment with technical direction and design.</li>\n<li>Identify and manage risks, scope changes, and schedule adjustments proactively.</li>\n<li>Serve as the primary point of contact for clients and stakeholders, providing regular updates and resolving issues.</li>\n<li>Ensure quality and timely delivery through effective team coordination and clear communication.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Technical &amp; Delivery Expertise</strong></p>\n<ul>\n<li>13+ years of overall IT experience, with 4–6 years of Technical Project Management experience.</li>\n<li>Strong understanding of custom application development on Java/.NET stacks.</li>\n<li>Experience managing:</li>\n<li>Backend/API development</li>\n<li>Integration using tools like Apache Camel, IBM Integration Stack</li>\n<li>Database interactions (Oracle, SQL Server)</li>\n<li>Client-side development using React/Angular</li>\n<li>Deployment on cloud platforms (AWS, Azure)</li>\n<li>Familiarity with Microservices architecture, CI/CD pipelines, and DevOps practices.</li>\n</ul>\n<p><strong>Project Management</strong></p>\n<ul>\n<li>Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li>Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.</li>\n<li>Tools: Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</li>\n</ul>\n<p><strong>Secondary Skills</strong></p>\n<ul>\n<li>Experience managing globally distributed teams.</li>\n<li>Strong understanding of enterprise-level integrations and technology ecosystems.</li>\n</ul>\n<p><strong>Soft Skills</strong></p>\n<ul>\n<li>Excellent communication and stakeholder engagement capabilities.</li>\n<li>Strong leadership, problem-solving, and organizational skills.</li>\n<li>Ability to articulate technical topics to both technical and non-technical audiences.</li>\n</ul>\n<h3>Application Process</h3>\n<p>Interested candidates are requested to forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Fraudulent Job Offers:</strong></p>\n<p>Please be aware that some individuals may claim to offer jobs at Reflections Info Systems for a fee. Reflections Info Systems <em>never</em> requests payment for job opportunities. We exclusively contact candidates through our official website or LinkedIn, and all employment-related correspondence is sent from our official HR email address. For any clarifications or alerts regarding this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Application Development",
            "Project Management"
        ],
        "summary": "Seeking an experienced Technical Project Manager for application development and integration projects. Requires strong technical and delivery expertise in .NET stacks and SDLC management."
    },
    {
        "job_title": "Data Engineer",
        "company": "Lambdazen India (P) Ltd1",
        "url": "https://technopark.org/job-details/24164",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Data Engineer</h2>\n<p><strong>Company:</strong> LambdaZen India (P) Ltd\n<strong>Location:</strong> 13th Floor, Amstor Building, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> http://www.lzindia.co.in\n<strong>Contact Email:</strong> sreesankar@lambdazen.com\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 24, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced Data Engineer with deep expertise in Azure Databricks to design, develop, and maintain high-performance data pipelines and analytical platforms. The ideal candidate has hands-on experience building scalable data solutions on Azure, integrating diverse data sources, and enabling data-driven insights across teams.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, build, and optimize ETL/ELT pipelines using Azure Databricks (PySpark/SQL).</li>\n<li>Develop and maintain Delta Lake-based data architectures for reliability, scalability, and performance.</li>\n<li>Integrate data from multiple sources including APIs, streaming platforms, and on-prem databases into Azure Data Lake Storage (ADLS).</li>\n<li>Manage data orchestration and workflow automation using Azure Data Factory (ADF) or Databricks Workflows.</li>\n<li>Collaborate with analysts, data scientists, and application developers to ensure clean, high-quality, and well-documented data.</li>\n<li>Implement and maintain data quality, validation, and monitoring frameworks within Databricks.</li>\n<li>Optimize data pipelines for cost, speed, and reliability using Databricks clusters, caching, and partitioning.</li>\n<li>Implement data governance, lineage, and access control in accordance with corporate security policies.</li>\n<li>Support real-time or near real-time data streaming using Azure Event Hubs, Kafka, or Delta Live Tables.</li>\n<li>Continuously evaluate new Azure and Databricks capabilities to enhance platform performance.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field.</li>\n<li>3–6 years of hands-on experience in data engineering, with at least 2+ years in Azure Databricks.</li>\n<li>Strong proficiency in PySpark, SQL, and data modeling.</li>\n<li>Experience with Azure Data Lake Storage (ADLS), Azure Synapse, Azure Data Factory, and Azure Key Vault.</li>\n<li>Deep understanding of Delta Lake architecture, ACID transactions, and schema evolution.</li>\n<li>Experience implementing CI/CD for Databricks using GitHub Actions, Azure DevOps, or similar tools.</li>\n<li>Strong knowledge of data partitioning, caching, and performance tuning in Spark environments.</li>\n<li>Solid grasp of data governance and security best practices within Azure (e.g., RBAC, Managed Identities).</li>\n</ul>",
        "tags": [
            "3-6 Years",
            "Azure Databricks",
            "PySpark",
            "Delta Lake"
        ],
        "summary": "Experienced Data Engineer with Azure Databricks expertise needed for designing and maintaining data pipelines. Responsibilities include ETL, Delta Lake architecture, and data integration on Azure."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24163",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Address:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Website:</strong> http://www.way.com</p>\n<p><strong>Job Title:</strong> Customer Success Executive\n<strong>Closing Date:</strong> 12, Oct 2025\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. Utilizing AI, machine learning, and data analytics, we provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, Andreessen Horowitz, and UnitQ, we are making car ownership easier, more affordable, and rewarding.</p>\n<h3>Job Details</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused Customer Success Executive for our voice process team. This role requires delivering excellent customer service via phone, handling inquiries with professionalism and efficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Address customer queries through phone, email, chat, and social media channels.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to products, orders, returns, and general support requests.</li>\n<li>Maintain accurate customer records and feedback in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking customer satisfaction metrics and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience (2-5 years) in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/customer-success-executive</p>",
        "tags": [
            "2-5 Years",
            "Customer Service",
            "Voice Process",
            "CRM"
        ],
        "summary": "Customer Success Executive for Way.com's voice process. Responsibilities include handling customer inquiries, troubleshooting issues, and maintaining records to ensure customer satisfaction."
    },
    {
        "job_title": "Designer - UX",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24161",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>UX Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/ux-designer\n<strong>Job Published:</strong> October 10, 2025\n<strong>Closing Date:</strong> October 12, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, and awarded top Product in Insurance by UnitQ, Way.com simplifies, makes more affordable, and enhances the car ownership experience.</p>\n<h3>Job Title: UX Designer</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for a highly talented UX Designer with strong UI skills to collaborate with product and engineering teams. Your role will be instrumental in crafting exceptional user experiences for millions of car owners.</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Collaborate with senior designers to translate requirements into seamless user journeys.</li>\n<li>Conduct research and translate insights into wireframes and prototypes.</li>\n<li>Create user-friendly, visually appealing interfaces for web and mobile platforms.</li>\n<li>Contribute to the design system and maintain design consistency across products.</li>\n<li>Participate in usability testing and drive iterative improvements.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>2-4 years</strong> of UX/UI design experience.</li>\n<li>Strong understanding of UX principles and interaction design.</li>\n<li>Proficiency in <strong>Figma</strong> or similar design tools.</li>\n<li>Good visual/UI design sense with a keen attention to detail.</li>\n<li>A portfolio demonstrating UX problem-solving skills and polished UI work.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Make a meaningful impact on over 10 million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Receive competitive compensation.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "UX/UI",
            "Figma",
            "Interaction Design"
        ],
        "summary": "Seeking a UX Designer with strong UI skills to craft delightful experiences for millions. Collaborate with teams, create user journeys, and design interfaces for Way.com's auto super app."
    },
    {
        "job_title": "Senior Designer - UX",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24160",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Senior Designer - UX</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 12, Oct 2025\n<strong>Job Published:</strong> 10, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Senior UX Designer</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for a <strong>Senior UX Designer</strong> with exceptional UX thinking and a strong eye for UI to shape world-class experiences at Way.com. You will play a critical role in designing flows that power our car super-app, influencing millions of users.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead end-to-end design of core product experiences</li>\n<li>Solve complex user problems with simple, intuitive interfaces</li>\n<li>Work closely with Product, Engineering, and Marketing teams to align business goals and user needs</li>\n<li>Elevate design quality by mentoring team members and setting standards</li>\n<li>Build and validate design solutions through research, prototyping, and usability testing</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li><strong>6+ years of experience</strong> in UX design with strong UI design capabilities.</li>\n<li>Expertise in user-centered design principles and <strong>modern design tools</strong> (Figma, etc.)</li>\n<li>Strong portfolio showcasing impactful <strong>product design work</strong>.</li>\n<li>Ability to communicate design rationale clearly to stakeholders.</li>\n<li>Experience in leading design for <strong>large-scale web and mobile products</strong> is a plus</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-uxui-designer</p>",
        "tags": [
            "6+ Years",
            "UX Design",
            "UI Design",
            "Figma"
        ],
        "summary": "Seeking a Senior UX Designer to shape world-class experiences for Way.com's automotive super app. Requires 6+ years of experience in UX/UI design with modern tools like Figma."
    },
    {
        "job_title": "Senior Operations - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24159",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Senior Operations Executive</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>About Us</strong>\nWay.com is America's dominant automotive super app, serving over 10 million customers with services including auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide personalized solutions that simplify car ownership. Recognized by Bloomberg and Andreessen Horowitz, we are making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Senior Operations Executive\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview</strong>\nWe are looking for a Senior Operations Executive with proven experience in operations management and process optimization.</p>\n<p><strong>Roles and Responsibilities</strong>\n- Manage daily operations within the Airport Parking vertical.\n- Ensure operational efficiency and effectiveness.\n- Oversee and improve various operational processes.\n- Coordinate with different teams and stakeholders to achieve operational goals.\n- Deliver excellent customer service.</p>\n<p><strong>Preferred Skills</strong>\n- Strong interpersonal and communication skills (verbal and written).\n- Experience in operations management and process optimization.\n- Analytical skills for problem-solving and data analysis.\n- Ability to work collaboratively in a team environment.\n- Excellent organizational and multitasking abilities.\n- Attention to detail and strong task prioritization skills.\n- Flexibility to work night shifts and weekends.\n- Eagerness to learn and adapt to new challenges.\n- Experience in the automotive industry is a plus.\n- Bachelor's degree in business administration or a related field.\n- Strong Excel and Data Handling skills.</p>\n<p><strong>Why you will love working with us?</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Make a meaningful impact across 10+ million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth in a rapidly scaling technology company.\n- Competitive compensation.</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-operations-executive</p>\n<p><strong>Closing Date:</strong> 12, Oct 2025\n<strong>Job Published:</strong> 10, Oct 2025</p>",
        "tags": [
            "Experience Required",
            "Operations Management",
            "Process Optimization",
            "Data Analysis"
        ],
        "summary": "Seeking a Senior Operations Executive for Way.com's Airport Parking vertical. Responsibilities include daily management, process improvement, and stakeholder coordination."
    },
    {
        "job_title": "Clinical Research Coordinator",
        "company": "Hiworth Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24158",
        "location": "Technopark",
        "closing_date": "06 Nov 2025",
        "job_description": "<h2>Clinical Research Coordinator</h2>\n<p>Hiworth Solutions (P) Ltd\nC-23, Thejaswini Building, Technopark, Trivandrum. 695581\nhttp://www.hiworthsolutions.com</p>\n<p><strong>Contact Email:</strong> hr@hiworthsolutions.com</p>\n<p><strong>Closing Date:</strong> 06, Nov 2025\n<strong>Job Published:</strong> 10, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>A US firm's cardiac research division, in association with Hiworth Solutions Pvt Ltd in Technopark, is seeking a Clinical Research Coordinator. You will be an essential part of our mission to deliver cutting-edge cardiac therapies through clinical trials. This role involves supporting physicians and research staff by managing daily study activities, coordinating patient visit data and details, and ensuring protocol compliance in all research-related tasks.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in coordinating all aspects of clinical trial activities, including patient scheduling, follow-up, and communication.</li>\n<li>Obtain informed consent from study participants and provide education regarding study procedures.</li>\n<li>Collect and accurately document clinical data in source records and electronic data capture (EDC) systems.</li>\n<li>Monitor and report patient safety data, including adverse events.</li>\n<li>Maintain organized and complete regulatory documentation and subject files.</li>\n<li>Assist with IRB submissions, amendments, and study start-up activities.</li>\n<li>Prepare for and participate in monitoring visits and sponsor audits.</li>\n<li>Coordinate the collection and process of blood or lab specimens in accordance with study protocols.</li>\n<li>Accurately enter patient and study data into electronic data capture (EDC) systems.</li>\n<li>Review and verify data from source documents to ensure completeness and accuracy.</li>\n<li>Organize, maintain, and update clinical trial files, logs, and documentation.</li>\n<li>Assist research staff with tracking visit schedules, reports, and study milestones.</li>\n<li>Respond to data queries from sponsors or monitors in a timely and professional manner.</li>\n<li>Support regulatory filings and assist in maintaining study binders and audit readiness.</li>\n<li>Collaborate with team members to ensure data is collected and entered within protocol-specified timelines.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>Degree or Diploma in Practical Nursing.</li>\n<li>1–2 years of experience in a healthcare or clinical research setting preferred.</li>\n<li>Familiarity with medical records and basic clinical documentation.</li>\n<li>Strong communication and organizational skills.</li>\n<li>Ability to multitask and work independently in a fast-paced environment.</li>\n<li>Basic understanding of Good Clinical Practice (GCP) and clinical research is a plus (training available).</li>\n<li>Good command over the English language.</li>\n<li>Willingness to work on US shifts.</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Clinical Research",
            "GCP",
            "EDC Systems"
        ],
        "summary": "Clinical Research Coordinator needed for cardiac trials. Responsibilities include patient coordination, data management, and ensuring protocol compliance. Requires nursing degree/diploma and research experience."
    },
    {
        "job_title": "Client Service Manager",
        "company": "Fresh Mind Ideas (P) Ltd",
        "url": "https://technopark.org/job-details/24157",
        "location": "Technopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>Client Service Manager at FRESH MIND IDEAS (P) Ltd</h2>\n<p><strong>Company:</strong> FRESH MIND IDEAS PVT. LTD\n<strong>Location:</strong> [Your Location / Remote Option]\n<strong>Contact Email:</strong> careers@freshmindideas.com\n<strong>Closing Date:</strong> November 10, 2025\n<strong>Job Published:</strong> October 10, 2025</p>\n<h3>About the Role</h3>\n<p>As a Client Service Manager at Fresh Mind Ideas, you will be the primary point of contact for clients, ensuring their goals are met and exceeded. You will manage client relationships, oversee the execution of digital marketing projects, and work closely with internal teams (design, web, content, digital marketing) to deliver outstanding results. You will report to the CEO / Director of Client Services.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Act as the main liaison between clients and internal teams, ensuring smooth communication and alignment.</li>\n<li>Understand client business goals and translate them into actionable marketing strategies and deliverables.</li>\n<li>Oversee and manage multiple projects simultaneously, ensuring they are delivered on time, within scope, and within budget.</li>\n<li>Coordinate with internal teams (Design, Web, Digital Marketing, Content) to ensure project milestones are met.</li>\n<li>Monitor campaign performance, analytics, and KPIs, and present insights and reports to clients regularly.</li>\n<li>Identify upsell/cross-sell opportunities to grow client accounts.</li>\n<li>Handle client escalations and provide proactive solutions.</li>\n<li>Contribute to the agency’s reputation by maintaining strong client satisfaction and retention.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Opportunity to work with leading brands and global projects.</li>\n<li>A collaborative and creative work culture that encourages innovation.</li>\n<li>Competitive salary + incentives based on client retention and growth.</li>\n<li>Continuous learning &amp; growth opportunities in branding, digital, and strategy.</li>\n</ul>\n<h3>Skills &amp; Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Business Administration, Communications, or related field.</li>\n<li>Proven experience (4–7 years) in client servicing, account management, or digital marketing project management.</li>\n<li>Strong knowledge of digital marketing channels (SEO, SEM, Social Media, Content, Performance Marketing, Branding).</li>\n<li>Excellent communication and presentation skills with the ability to explain strategies and results clearly.</li>\n<li>Strong project management and organizational skills; ability to handle multiple clients/projects.</li>\n<li>Proficiency with digital marketing tools &amp; platforms (Google Ads, Meta Ads, Analytics, HubSpot/CRM tools, etc.).</li>\n<li>Problem-solving mindset with the ability to handle pressure and client expectations.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume and portfolio/case studies to careers@freshmindideas.com with the subject line: Application – Client Service Manager</p>",
        "tags": [
            "4-7 Years",
            "Client Servicing",
            "Digital Marketing",
            "Project Management"
        ],
        "summary": "Client Service Manager needed with 2-3 years of experience. Manage client relationships and digital marketing projects, liaising between clients and internal teams for successful project delivery."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24156",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.com\n<strong>Location:</strong> Thiruvananthapuram, Kerala, India\n<strong>Address:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Closing Date:</strong> October 12, 2025\n<strong>Job Published:</strong> October 10, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering over 10 million customers with services like auto insurance, parking, and EV charging. We use AI, machine learning, and data analytics to offer innovative, personalized solutions for car ownership. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, Way.com is simplifying car ownership.</p>\n<h2>Job Title: Project Manager</h2>\n<p><strong>Experience:</strong> 8+ years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a highly experienced Project Manager with over 8 years of experience to lead strategic projects from conception to completion. The ideal candidate will possess strong leadership, domain knowledge, and execution skills to ensure projects are delivered successfully within scope, on time, and within budget.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead the full project lifecycle for multiple medium to large-scale initiatives.</li>\n<li>Define and manage project scope, objectives, deliverables, and success criteria.</li>\n<li>Develop and execute detailed project plans, including resource allocation, timelines, and budgets.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate issues as needed.</li>\n<li>Manage stakeholder relationships, ensuring clear communication and alignment across all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams for smooth execution.</li>\n<li>Ensure quality standards and adherence to organizational processes and policies.</li>\n<li>Mentor and guide junior team members to enhance project management capabilities.</li>\n<li>Promote best practices and continuous improvement in project delivery.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Business Administration, or a related field (Master’s degree is a plus).</li>\n<li>Minimum 8 years of proven project management experience, preferably in a fintech platform.</li>\n<li>Strong expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in project management tools such as MS Project, JIRA, Asana, Trello, or similar.</li>\n<li>In-depth knowledge of Agile, Waterfall, or hybrid project management methodologies.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities, especially under pressure.</li>\n<li>Certifications like PMP, PRINCE2, or Agile (Scrum Master/SAFe) are highly preferred.</li>\n<li>Experience with tools like MPP is beneficial.</li>\n<li>Ability to work effectively with multiple teams, driving for execution and results.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact on over 10 million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/project-manager</p>",
        "tags": [
            "8+ Years",
            "Project Management",
            "Agile",
            "Fintech"
        ],
        "summary": "Seeking an experienced Project Manager to lead strategic initiatives from start to finish. Requires 8+ years of experience in project management, preferably in fintech, with strong leadership and execution skills."
    },
    {
        "job_title": "iOS Team Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24155",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>iOS Technical Lead</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd / Way.com India Pvt Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/ios-technical-lead\n<strong>Closing Date:</strong> 12, Oct 2025\n<strong>Job Published:</strong> 10, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers with services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions that transform car ownership. Recognized by Bloomberg, Andreessen Horowitz, and UnitQ, we are making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: iOS Technical Lead</h3>\n<p><strong>Experience Required:</strong> 10–15 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for a seasoned iOS Technical Lead with strong Swift expertise to lead the entire iOS application development lifecycle. This role involves architecting scalable, high-performance mobile solutions, mentoring the development team, and ensuring exceptional user experiences.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>iOS Development Leadership:</strong> Lead end-to-end app development using Swift, focusing on scalable, efficient, and high-quality solutions.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with Product Managers and Designers to translate requirements into seamless, user-friendly mobile experiences.</li>\n<li><strong>Performance Optimization:</strong> Enhance app responsiveness, stability, and performance across various iOS devices and OS versions.</li>\n<li><strong>Mentorship &amp; Code Quality:</strong> Conduct code reviews, uphold coding standards, and mentor junior developers to improve team output.</li>\n<li><strong>Testing &amp; Documentation:</strong> Ensure app reliability through comprehensive unit testing, clear documentation, and adherence to clean architecture practices.</li>\n<li><strong>Backend &amp; API Integration:</strong> Collaborate with backend teams for secure, efficient, and smooth API integrations.</li>\n<li><strong>Innovation &amp; Improvement:</strong> Drive the adoption of new tools, processes, and best practices to accelerate development and enhance quality.</li>\n<li><strong>Feature Ownership:</strong> Take full ownership of features from design through deployment, including post-release monitoring and optimization.</li>\n<li><strong>Continuous Learning:</strong> Stay updated with evolving iOS technologies to deliver modern, future-ready solutions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>10+ years of mobile app development experience, with at least 6+ years specifically in iOS development.</li>\n<li>Deep expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.</li>\n<li>Strong understanding of RESTful APIs, JSON parsing, and integrating third-party libraries.</li>\n<li>Proficiency in architecting complex mobile apps using modular design patterns like MVVM, MVI, or MVP.</li>\n<li>Experience with CI/CD workflows, automated testing, code review processes, and App Store deployments.</li>\n<li>Demonstrated leadership experience in team management and mentoring iOS developers.</li>\n<li>Familiarity with tools such as Firebase, Mixpanel, or similar analytics/crash reporting platforms.</li>\n<li>Solid understanding of web application ecosystems and cross-platform compatibility challenges.</li>\n</ul>\n<h3>Nice to Have:</h3>\n<ul>\n<li>Hands-on experience with Core Bluetooth, Core Location, or real-time service integrations (e.g., EV charging or roadside assistance).</li>\n<li>Background in mobility, transportation, or automotive technology platforms.</li>\n<li>Familiarity with Kotlin Multiplatform or other cross-platform development frameworks.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact on over 10 million users.</li>\n<li>Be part of a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth paths within a rapidly scaling technology company.</li>\n<li>Competitive compensation package.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/ios-technical-lead</p>",
        "tags": [
            "10+ Years",
            "Swift",
            "iOS",
            "UIKit"
        ],
        "summary": "Lead iOS app development using Swift, architecting scalable solutions and mentoring teams. Join America's top auto super app for significant user impact."
    },
    {
        "job_title": "Team Lead - SEO",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24154",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Team Lead - SEO</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Technopark Phase-III, Thiruvananthapuram, India\n<strong>Website:</strong> http://www.way.com\n<strong>Closing Date:</strong> 12, Oct 2025\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to offer innovative solutions, making car ownership easier, more affordable, and rewarding. Recognized by Bloomberg and Andreessen Horowitz, we are a fast-growing company transforming the automotive industry.</p>\n<h3>Job Title: Team Lead - SEO</h3>\n<p><strong>Experience:</strong> 9 - 11 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for a skilled Team Lead, SEO to lead our organic growth and enhance search engine presence. This leadership role involves developing and executing comprehensive SEO strategies, managing a team of SEO specialists, and collaborating cross-functionally to optimize our digital footprint. We seek individuals with a deep understanding of search algorithms, technical SEO, content strategy, and a passion for driving results.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies:</strong> Define and implement a robust SEO roadmap aligned with business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team:</strong> Manage SEO professionals, fostering continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO:</strong> Improve keyword rankings, content performance, and backlink quality for enhanced organic visibility.</li>\n<li><strong>Technical SEO Management:</strong> Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making:</strong> Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration:</strong> Work with content creators, developers, and product teams to integrate SEO best practices.</li>\n<li><strong>Local &amp; Mobile SEO Optimization:</strong> Enhance local search presence and mobile-first indexing strategies.</li>\n<li><strong>Competitive &amp; Market Analysis:</strong> Conduct SEO audits, monitor competitor strategies, and identify new opportunities.</li>\n<li><strong>SEO Performance Reporting:</strong> Provide insights and recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data for data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li>Understanding of PPC advertising and its relationship with organic search.</li>\n<li>Experience in a high-growth startup or fast-paced environment.</li>\n<li>Familiarity with social media marketing and its impact on SEO.</li>\n<li>Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead</p>",
        "tags": [
            "9-11 Years",
            "SEO",
            "Technical SEO",
            "SEMrush"
        ],
        "summary": "Lead SEO strategies and a team to enhance organic growth. Requires 9-11 years of experience in technical SEO, content, and link-building with strong analytical skills."
    },
    {
        "job_title": "Social Media Marketing Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24153",
        "location": "Technopark",
        "closing_date": "22 Nov 2025",
        "job_description": "<h2>Social Media Marketing Manager</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/manager-social-media-marketing</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize AI, machine learning, and data analytics to provide innovative, personalized car ownership solutions. Recognized by Bloomberg and Andreessen Horowitz, we are making car ownership easier, more affordable, and rewarding.</p>\n<h3>Job Title: Social Media Marketing Manager</h3>\n<p><strong>Experience:</strong> 9 to 12 Years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for a creative, strategic, and results-oriented Social Media Marketing Manager to lead our brand's digital growth. This role involves owning the strategy and execution of our social media presence to drive brand awareness, community engagement, and meaningful interactions across various platforms. Collaboration with cross-functional teams is key to delivering a unified, data-driven social strategy that amplifies our brand voice and achieves measurable business impact.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Strategic Leadership:</strong> Define and implement platform-specific strategies aligned with Way.com’s brand voice, identity, and growth objectives, ensuring consistency and innovation.</li>\n<li><strong>Content Strategy &amp; Execution:</strong> Lead content planning, creation, and scheduling for platforms like Instagram, Facebook, LinkedIn, X/Twitter, and TikTok, optimizing for engagement and reach.</li>\n<li><strong>Community Management:</strong> Drive daily interactions, respond to comments and messages in a brand-consistent manner, and cultivate an engaged online community.</li>\n<li><strong>Brand Growth &amp; Advocacy:</strong> Design and launch creative campaigns to foster loyalty and encourage user advocacy.</li>\n<li><strong>Analytics &amp; Optimization:</strong> Monitor KPIs, analyze performance data, and continuously refine strategies to maximize ROI, reach, and engagement.</li>\n<li><strong>Influencer &amp; Partnership Development:</strong> Identify, engage, and collaborate with influencers and partners to expand brand presence.</li>\n<li><strong>Trend &amp; Innovation Leadership:</strong> Stay updated on emerging social media trends, platform updates, and tools.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with design, content, product, and customer support teams for cohesive messaging and campaigns.</li>\n<li><strong>Budget &amp; Resource Management:</strong> Oversee social media budgets and allocate resources for maximum ROI.</li>\n<li><strong>Reputation Management:</strong> Monitor brand sentiment, address feedback proactively, and protect the brand's reputation.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, or a related field (Master’s is a plus).</li>\n<li>Minimum 9 years of experience in social media marketing with a proven track record.</li>\n<li>Deep understanding of major social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.).</li>\n<li>Proficiency in social media management tools (e.g., Hootsuite, Sprout Social, Buffer) and analytics tools (e.g., Google Analytics, Socialbakers).</li>\n<li>Exceptional communication and leadership skills.</li>\n<li>Strong creative acumen and strategic thinking capabilities.</li>\n<li>Expertise in paid social media strategies and advertising.</li>\n<li>Ability to manage multiple projects under tight deadlines.</li>\n<li>Passion for digital innovation and social media trends.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Closing Date:</strong> 22, Nov 2025\n<strong>Job Published:</strong> 10, Oct 2025</p>",
        "tags": [
            "9-12 Years",
            "Social Media Marketing",
            "Content Strategy",
            "Community Management"
        ],
        "summary": "Seeking a Social Media Marketing Manager with 9+ years of experience to lead digital growth. Responsibilities include strategy, content, community engagement, and analytics to drive brand awareness and business impact."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24152",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\n<strong>Closing Date:</strong> October 12, 2025\n<strong>Job Published:</strong> October 10, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide innovative solutions, transforming car ownership. Recognized by Bloomberg and Andreessen Horowitz, we are making car ownership easier, more affordable, and rewarding.</p>\n<h3>Job Title: Spanish Customer Success Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused individual to join our voice process team as a Spanish Customer Success Executive. This role involves providing excellent customer service to our Spanish-speaking clients, handling inquiries over the phone with professionalism and efficiency.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Customer Interaction:</strong> Manage inbound and outbound calls, delivering prompt and effective resolutions to customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence:</strong> Provide empathetic, professional support to ensure a positive customer experience in every interaction.</li>\n<li><strong>Issue Escalation:</strong> Identify, prioritize, and escalate complex cases to the appropriate departments for swift resolution.</li>\n<li><strong>Documentation:</strong> Maintain accurate records of customer interactions and keep databases up to date.</li>\n<li><strong>Performance Goals:</strong> Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge:</strong> Stay informed on company products and services to provide customers with accurate and up-to-date information.</li>\n<li><strong>Team Collaboration:</strong> Work closely with colleagues to foster a supportive, collaborative, and high-performing work environment.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Fluent in both <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong interpersonal and communication skills, with a patient and empathetic approach.</li>\n<li>Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</p>",
        "tags": [
            "0-2 Years",
            "Spanish",
            "Customer Service",
            "Voice Process"
        ],
        "summary": "Spanish Customer Success Executive for Way.com's automotive super app. Handle customer inquiries via voice process, ensuring excellent service and efficient issue resolution."
    },
    {
        "job_title": "Programme Manager - CEO's Office",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24151",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Programme Manager - Office of the CEO</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/program-manager-office-of-the-ceo</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and ranked highly among fast-growing companies, Way.com is simplifying, making more affordable, and rewarding car ownership.</p>\n<h3>Job Title: Programme Manager - Office of the CEO</h3>\n<p><strong>Experience Required:</strong> 7 to 12 years in programme management, strategy, or senior executive roles.\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>This is a high-impact role for a decisive leader who can navigate bureaucracy, ensure accountability, and drive results. The Programme Manager will manage the CEO’s office, clarifying priorities, overseeing execution, and ensuring outcomes are achieved.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Execute CEO Directives:</strong> Translate the CEO’s vision into actionable initiatives and ensure timely execution.</li>\n<li><strong>Eliminate Barriers:</strong> Proactively identify and remove obstacles and streamline processes to maintain project momentum.</li>\n<li><strong>Enforce Deadlines and Budgets:</strong> Drive accountability to ensure all deliverables are met within defined timelines and financial parameters.</li>\n<li><strong>Provide Actionable Insights:</strong> Present the CEO with well-analyzed solutions and strategic recommendations.</li>\n<li><strong>Strengthen Leadership Accountability:</strong> Hold senior leaders accountable for their commitments and ensure strong execution.</li>\n<li><strong>Streamline Operations:</strong> Simplify processes and align workflows to enhance speed, transparency, and efficiency.</li>\n<li><strong>Drive Closure:</strong> Track all initiatives, projects, and escalations to full resolution, ensuring no tasks or issues remain pending.</li>\n<li><strong>Support CEO Effectiveness:</strong> Manage priorities, workload, and scheduling to maintain the CEO’s focus, mental clarity, and long-term effectiveness.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Education:</strong> Engineering degree or Management Degree (MBA/PGDM).</li>\n<li><strong>Experience:</strong> 7–12 years in programme management, strategy, or senior executive roles.</li>\n<li><strong>Proven Track Record:</strong> Demonstrated success in delivering outcomes in high-pressure, complex environments.</li>\n<li><strong>Commanding Presence:</strong> Ability to influence, lead, and enforce decisions across the organization.</li>\n<li><strong>Mindset:</strong> Relentless, disciplined, and outcome-obsessed.</li>\n<li><strong>Judgment &amp; Discretion:</strong> Ability to handle sensitive personal and professional matters for the CEO with trust and discretion.</li>\n</ul>\n<h3>Success Metrics:</h3>\n<ul>\n<li><strong>Project Delivery:</strong> 100% of strategic programmes and high-priority projects delivered on time and within budget.</li>\n<li><strong>Decision Enablement:</strong> CEO receives actionable information within deadlines 100% of the time.</li>\n<li><strong>Accountability Enforcement:</strong> Zero unresolved staff or departmental issues beyond agreed timelines.</li>\n<li><strong>Process Efficiency:</strong> Key processes are reviewed, streamlined, and operating with maximum clarity and speed.</li>\n<li><strong>Cross-Functional Alignment:</strong> Initiatives executed without misalignment or delays across functions.</li>\n<li><strong>CEO Mental &amp; Physical Wellbeing:</strong> Proactive management of the CEO's schedule and high-stress situations to ensure focus and avoid overload.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Closing Date:</strong> October 12, 2025\n<strong>Job Published:</strong> October 10, 2025</p>",
        "tags": [
            "7-12 Years",
            "Programme Management",
            "Strategy",
            "Executive Leadership"
        ],
        "summary": "Seeking a decisive Programme Manager for the CEO's office to drive execution, enforce accountability, and eliminate barriers. This role ensures strategic initiatives are delivered on time and within budget."
    },
    {
        "job_title": "Product Team Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24150",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Address:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Website:</strong> http://www.way.com</p>\n<p><strong>Job Title:</strong> Product Team Manager\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 12, Oct 2025\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/product-manager</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. We offer services from auto insurance and parking to EV charging and more. Using cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Way.com has been featured by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide, and recognized as the top Product in Insurance by UnitQ. We are making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Details</h3>\n<p><strong>Job Title:</strong> Product Manager\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Product Manager to own the development and delivery of impactful product features that enhance user experience and drive business growth. You will collaborate closely with engineering, design, and data teams to transform innovative ideas into market-ready solutions swiftly.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>End-to-End Product Ownership:</strong> Drive product features from ideation to launch, ensuring alignment with business goals and delivery of high-quality outcomes.</li>\n<li><strong>Data-Driven Decision Making:</strong> Leverage analytics and user feedback to identify opportunities and implement impactful product enhancements.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with engineering, design, and data teams to deliver seamless, timely product releases.</li>\n<li><strong>Performance Management:</strong> Track product performance metrics and execute strategies to maximize growth, retention, and engagement.</li>\n<li><strong>Stakeholder Alignment:</strong> Communicate priorities, timelines, and progress clearly to stakeholders, ensuring transparency and alignment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 3–7 years of experience in product management.</li>\n<li><strong>Product Strategy &amp; Roadmapping:</strong> Defining a clear vision, goals, and long-term plan for a product, and translating them into a prioritized roadmap that guides development and release.</li>\n<li><strong>Data-Driven Decision Making:</strong> Using quantitative and qualitative data to inform choices, validate assumptions, and measure product performance for better business outcomes.</li>\n<li><strong>User-Centric Design Thinking:</strong> Applying a creative, iterative problem-solving approach focused on understanding user needs and delivering solutions that enhance their experience.</li>\n<li><strong>Stakeholder Management:</strong> Building and maintaining positive relationships with individuals or groups who have an interest in the product, ensuring alignment and effective communication.</li>\n<li><strong>Agile Product Development:</strong> Using flexible, iterative methods to develop and deliver product features quickly, adapting to feedback and changing requirements.</li>\n<li><strong>Market &amp; Competitive Analysis:</strong> Researching industry trends, customer behavior, and competitor offerings to identify opportunities and threats for product positioning.</li>\n<li><strong>A/B Testing &amp; Experimentation:</strong> Comparing two or more variations of a product element with real users to determine which performs best.</li>\n<li><strong>Go-To-Market Execution:</strong> Planning and carrying out the strategies needed to launch a product successfully, including positioning, messaging, and channel selection.</li>\n<li><strong>Wireframing &amp; Prototyping:</strong> Creating visual blueprints and interactive mockups of a product to test concepts and guide development before final build.</li>\n<li><strong>User Research:</strong> Collecting and analyzing feedback, observations, and data from real users to understand their behaviors, needs, and motivations.</li>\n<li><strong>Education:</strong> Bachelor’s degree in Engineering or an MBA from a Tier 1 institute.</li>\n<li><strong>Track Record:</strong> Proven track record of launching successful user-facing products.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a <strong>meaningful impact</strong> across 10+ million users.</li>\n<li>Dynamic, <strong>fast-paced, and innovation-driven</strong> work culture.</li>\n<li>Clear pathways for <strong>career growth</strong> in a rapidly scaling technology company.</li>\n<li><strong>Competitive compensation</strong>.</li>\n</ul>\n<p><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/product-manager</p>",
        "tags": [
            "3-7 Years",
            "Product Management",
            "Data-Driven Decision Making",
            "Agile Product Development"
        ],
        "summary": "Seeking a Product Manager to develop impactful features for America's top auto super app. Drive product growth through data-driven decisions and cross-functional collaboration."
    },
    {
        "job_title": "Performance Marketing Manager - SEM",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24149",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com</p>\n<p><strong>Job Title:</strong> Digital Marketing Manager / Performance Marketing Manager\n<strong>Employment Type:</strong> Full-time\n<strong>Work Arrangement:</strong> On-site\n<strong>Closing Date:</strong> October 12, 2025\n<strong>Job Published:</strong> October 10, 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to offer innovative solutions, making car ownership easier and more rewarding. We've been recognized by Bloomberg, ranked on Andreessen Horowitz’s Marketplace list, and awarded Product of the Year in Insurance by UnitQ.</p>\n<h3>Role Overview</h3>\n<p>We are looking for a data-driven Performance Marketing Manager to lead our paid media efforts, with a primary focus on Search Engine Marketing (SEM) across Google Ads, Bing Ads, and other platforms. You will drive performance for key verticals including Airport Parking, City Parking, Auto Insurance, and Car Repair &amp; Maintenance. This role is ideal for individuals with experience managing high-scale budgets and delivering successful campaigns.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, launch, and optimize high-performance SEM campaigns to meet traffic, conversion, and revenue goals.</li>\n<li>Conduct comprehensive keyword research, build well-structured campaigns, and perform A/B testing on ads and landing pages.</li>\n<li>Track and analyze key performance metrics (CTR, CPC, CVR, ROAS) to identify opportunities for scalability and efficiency.</li>\n<li>Collaborate with cross-functional teams (analytics, product, content, design) for effective campaign execution.</li>\n<li>Utilize beta features, automation tools, and new ad formats to maintain a competitive advantage.</li>\n<li>Develop and present detailed performance reports, insights, and strategic recommendations to stakeholders.</li>\n<li>Ensure full compliance with platform advertising policies and maintain strong quality scores.</li>\n<li>Stay current with AI-driven innovations in digital advertising and adopt new features from Google, Meta, Microsoft, etc.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>6+ years of hands-on digital/performance marketing experience, with a strong SEM focus.</li>\n<li>Experience managing $100K+/month in paid media spend, preferably for US markets.</li>\n<li>Strong command of Google Ads, Bing Ads, and tools like Google Analytics, Looker Studio, SA360.</li>\n<li>Proven expertise with AI-powered advertising solutions (e.g., Google Performance Max, Meta Advantage+, DSA).</li>\n<li>Google Ads Certification is required; Meta Blueprint or multi-channel expertise is a plus.</li>\n<li>Prior experience in e-commerce, mobility, or booking-based platforms is highly desirable.</li>\n<li>Exposure to beta product testing, new feature launches, or award-winning campaigns is a strong advantage.</li>\n<li>Agency background with multi-client and multi-platform experience is a plus.</li>\n<li>Excellent analytical, project management, and communication skills.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact on over 10 million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>",
        "tags": [
            "6-8 Years",
            "SEM",
            "Google Ads",
            "Performance Marketing"
        ],
        "summary": "Seeking a Performance Marketing Manager with 6-8 years experience to lead SEM efforts. Responsibilities include campaign optimization, data analysis, and cross-functional collaboration for key verticals."
    },
    {
        "job_title": "Business Executive - Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24148",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Business Operations Executive - Way Dot Com (P) Ltd</h2>\n<p><strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/business-operations-executive</p>\n<p><strong>Job Published:</strong> October 10, 2025\n<strong>Closing Date:</strong> October 12, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America's dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz's Marketplace 100, and awarded #1 Product in Insurance by UnitQ, Way.com is simplifying car ownership.</p>\n<h3>Job Overview</h3>\n<p><strong>Job Title:</strong> Business Operations Executive\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p>We are seeking a detail-driven and proactive Business Operations Executive to ensure smooth, efficient, and high-quality operations within our Airport Parking division. This role involves managing daily workflows, coordinating with internal teams, maintaining vendor relationships, and resolving operational challenges to ensure seamless service delivery. The ideal candidate thrives in fast-paced environments, thinks strategically about operations, and is committed to delivering exceptional results.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Operational Oversight:</strong> Oversee daily operations to ensure timely, efficient, and high-quality service delivery.</li>\n<li><strong>Process Improvement:</strong> Identify gaps, streamline workflows, and escalate critical issues to minimize disruptions.</li>\n<li><strong>Data Management &amp; Reporting:</strong> Maintain accurate records, trackers, and reports to enable data-driven decision-making.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with internal teams to align operational processes with business objectives and drive efficiency.</li>\n<li><strong>Vendor &amp; Stakeholder Management:</strong> Act as the primary point of contact for vendors and partners, ensuring SLA adherence, clear communication, and prompt issue resolution.</li>\n<li><strong>Customer Experience:</strong> Deliver superior service standards, address operational needs swiftly, and ensure customer satisfaction.</li>\n<li><strong>Adaptability &amp; Special Projects:</strong> Contribute to ad-hoc initiatives and remain flexible for evening, night, or weekend support as required.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong verbal and written communication skills.</li>\n<li>Excellent organizational and multitasking capabilities.</li>\n<li>High attention to detail and a proactive, solution-oriented approach.</li>\n<li>Analytical mindset with the ability to interpret data.</li>\n<li>Proficiency in Microsoft Excel (intermediate to advanced level) is mandatory.</li>\n<li>Collaborative team player with the ability to work independently.</li>\n<li>Willingness to work night shifts and weekends.</li>\n<li>Adaptability and eagerness to learn.</li>\n<li>Prior experience in business operations or the automotive industry is an advantage.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Chance to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/business-operations-executive</p>",
        "tags": [
            "0-2 Years",
            "Operations Management",
            "Microsoft Excel",
            "Customer Service"
        ],
        "summary": "Business Operations Executive needed for Airport Parking division. Ensure smooth operations, manage vendors, and resolve issues for seamless service delivery. Requires strong communication and Excel skills."
    },
    {
        "job_title": "Sales and Business Development Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24147",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Sales and Business Development Executive</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/business-development-manager\n<strong>Closing Date:</strong> 12, Oct 2025\n<strong>Job Published:</strong> 10, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, and awarded top Product in Insurance by UnitQ, we aim to make car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Business Development Executive</h3>\n<p><strong>Experience:</strong> 3 to 5 Years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a driven and results-oriented Business Development Executive to accelerate our market growth. In this role, you will identify new business opportunities, build and nurture strong client relationships, and close high-value deals that directly contribute to our revenue and market expansion. If you thrive in a target-driven environment and excel at turning prospects into long-term partners, this role is for you.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Lead Generation:</strong> Source, engage, and qualify prospective clients through calls, personalized emails, and digital outreach.</li>\n<li><strong>Sales Presentations:</strong> Craft and deliver persuasive proposals that highlight solutions and communicate clear value propositions.</li>\n<li><strong>CRM Management:</strong> Accurately update and manage prospect data, monitor pipeline progress, and ensure timely follow-ups within the CRM.</li>\n<li><strong>Target Achievement:</strong> Consistently achieve or exceed sales goals and KPIs to drive revenue growth.</li>\n<li><strong>Relationship Management:</strong> Build and nurture long-term client relationships to encourage loyalty, repeat business, and high-value referrals.</li>\n<li><strong>Reporting &amp; Analysis:</strong> Generate detailed sales reports and provide actionable insights to enhance productivity.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience in B2B sales with a track record of consistently meeting or exceeding targets.</li>\n<li>3–5 years of sales experience; prior exposure to the e-commerce sector is a strong advantage.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong negotiation, persuasion, and relationship management capabilities.</li>\n<li>Self-motivated, goal-driven, and able to work independently with minimal supervision.</li>\n<li>Proficiency in CRM software (e.g., Zoho) and Microsoft Office Suite.</li>\n<li>Resilient and positive mindset with the ability to handle rejection and bounce back quickly.</li>\n<li>Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<h3>Why you will love working with us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Make a meaningful impact across a growing base of 10+ million users.</li>\n<li>Join a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "B2B Sales",
            "CRM",
            "Relationship Management"
        ],
        "summary": "Seeking a Business Development Executive with 3-5 years of experience to drive market growth. Responsibilities include lead generation, client relationship building, and achieving sales targets for America's leading auto super app."
    },
    {
        "job_title": "Senior Engineer - QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24146",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-qa-engineer</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services including auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, ranked on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, Way.com is simplifying car ownership.</p>\n<h3>Job Details</h3>\n<ul>\n<li><strong>Job Title:</strong> Senior QA Automation Engineer</li>\n<li><strong>Experience Required:</strong> 5–8 years</li>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n<li><strong>Job Published:</strong> October 10, 2025</li>\n<li><strong>Closing Date:</strong> October 12, 2025</li>\n</ul>\n<h3>Role Overview</h3>\n<p>We are looking for an experienced Senior QA Automation Engineer with strong expertise in Java-based test automation. This role involves designing and maintaining scalable automation frameworks, developing robust testing strategies, and collaborating with cross-functional teams to integrate quality into the entire software development lifecycle.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Test Strategy &amp; Design:</strong> Develop detailed test strategies and plans from complex business requirements, ensuring comprehensive test coverage.</li>\n<li><strong>Automation Frameworks:</strong> Design, build, and enhance scalable automation frameworks using Core Java and modern testing tools.</li>\n<li><strong>Collaboration &amp; Quality Ownership:</strong> Partner with developers, product managers, and QA teams to embed quality throughout the SDLC.</li>\n<li><strong>Functional &amp; E2E Testing:</strong> Conduct thorough functional and end-to-end testing to verify accuracy, performance, and user experience.</li>\n<li><strong>Automation Execution:</strong> Create and execute automated test scripts for web and API testing using Selenium WebDriver, Rest Assured, and related technologies.</li>\n<li><strong>CI/CD Enablement:</strong> Integrate test automation into CI/CD pipelines (e.g., Jenkins) to support continuous testing and faster releases.</li>\n<li><strong>Issue Resolution:</strong> Monitor, troubleshoot, and resolve automation failures to ensure test suite reliability.</li>\n<li><strong>Documentation &amp; Standards:</strong> Develop and maintain reusable test cases, structured scripts, and clear documentation for scalability.</li>\n<li><strong>Defect Tracking:</strong> Log, track, and collaborate with engineering teams to ensure timely defect resolution and quality delivery.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 5+ years in test automation using Java.</li>\n<li><strong>Core Java:</strong> Strong knowledge of object-oriented principles, exception handling, multi-threading, and file handling.</li>\n<li><strong>Java Collections:</strong> Proficiency with Lists, Sets, Maps, Queues, and a solid understanding of data structures and algorithms.</li>\n<li><strong>Selenium WebDriver:</strong> Hands-on experience with dynamic element handling, custom waits, and cross-browser testing.</li>\n<li><strong>REST API Testing:</strong> Proficiency with Rest Assured for request modeling, authentication, and API validation.</li>\n<li><strong>CI/CD:</strong> Experience with Jenkins or similar tools for pipeline integration and maintenance.</li>\n<li><strong>Performance Testing:</strong> Familiarity with tools like JMeter, K6, or Locust, and the ability to identify performance bottlenecks.</li>\n<li><strong>Soft Skills:</strong> Strong attention to detail, problem-solving abilities, and the capacity to work independently and collaboratively in a fast-paced environment.</li>\n</ul>\n<h3>Why Work With Us?</h3>\n<ul>\n<li>Work for the #1 Auto Super app in the US.</li>\n<li>Make a significant impact on over 10 million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven culture.</li>\n<li>Benefit from clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Receive competitive compensation.</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Seeking a Senior QA Automation Engineer with 5-8 years of Java automation experience. Design scalable frameworks, develop testing strategies, and collaborate to ensure quality across the SDLC."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24145",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>About Us:</strong>\nWay.com is America’s leading automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize AI, machine learning, and advanced data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, we are dedicated to making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Senior Java Engineer\n<strong>Experience Required:</strong> 5–12 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview:</strong>\nWe are seeking an experienced Senior Java Developer with deep expertise in Java, Spring Boot, MySQL, and RESTful APIs. This role involves architecting, developing, and optimizing high-performance, scalable applications, establishing technical standards, and mentoring junior team members.</p>\n<p><strong>Roles and Responsibilities:</strong></p>\n<ul>\n<li>Build, enhance, and maintain Java applications leveraging the Spring Boot framework, ensuring robust, scalable, and high-quality solutions.</li>\n<li>Partner with Product Owners, Architects, and other stakeholders to convert business needs into effective technical designs.</li>\n<li>Develop and integrate RESTful APIs to support application features and streamline system interoperability.</li>\n<li>Continuously improve application performance through code optimization, refactoring, and scalability enhancements.</li>\n<li>Lead code reviews, guide and mentor junior developers, and help drive adoption of best engineering practices.</li>\n<li>Keep abreast of advancements in the Java ecosystem and proactively apply relevant technologies.</li>\n<li>Diagnose, troubleshoot, and resolve complex technical issues to maintain system stability and reliability.</li>\n<li>Uphold industry standards and organizational guidelines throughout the software development lifecycle.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent work experience).</li>\n<li>Minimum of 5+ years of professional Java development experience, with strong proficiency in Spring Boot and MySQL.</li>\n<li>In-depth knowledge of Java SE and Java EE concepts, including multi-threading, design patterns, and JVM internals.</li>\n<li>Solid experience in designing and implementing RESTful APIs.</li>\n<li>Proficiency in MySQL (or other relational databases) and writing efficient SQL queries.</li>\n<li>Familiarity with modern version control tools, particularly Git.</li>\n<li>Experience working within Agile methodologies (Scrum, Kanban, etc.).</li>\n<li>Strong problem-solving, debugging, and troubleshooting skills.</li>\n<li>Excellent communication skills and ability to collaborate in a team environment.</li>\n<li>Proven ability to mentor and guide junior developers.</li>\n</ul>\n<p><strong>Why you will love working with us?</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-java-developer</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Seeking a Senior Java Developer with 5-12 years experience. Responsibilities include developing scalable Java applications, APIs, and mentoring junior developers using Spring Boot and MySQL."
    },
    {
        "job_title": "Sr Oracle Database Administrator",
        "company": "Ospyn Technologies Ltd",
        "url": "https://technopark.org/job-details/24144",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Sr. Oracle Database Administrator</h2>\n<p><strong>Company:</strong> Ospyn Technologies Ltd\n<strong>Location:</strong> 1st Floor, Kabani Building, Technopark Phase-4, Pallipuram, Thiruvananthapuram, 695317\n<strong>Website:</strong> http://www.ospyn.com</p>\n<p><strong>Closing Date:</strong> 31st October 2025\n<strong>Job Published:</strong> 10th October 2025\n<strong>Contact Email:</strong> careers@ospyn.com</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Oracle DB installation, configuration, and patch management</li>\n<li>Database backup and recovery using RMAN</li>\n<li>Performance tuning and query optimization</li>\n<li>Experience with RAC, Data Guard, and ASM</li>\n<li>Knowledge of Linux/Unix environments</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Experience:</strong> 5 to 8 Years</li>\n<li><strong>Location:</strong> Trivandrum</li>\n<li><strong>Qualification:</strong> B.Tech/M.Tech/MCA/M.Sc</li>\n<li><strong>Notice Period:</strong> 30 to 45 Days</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "Oracle Database",
            "RMAN",
            "RAC"
        ],
        "summary": "Seeking an experienced Sr. Oracle Database Administrator for installation, backup, recovery, and performance tuning. Must have experience with RAC, Data Guard, and ASM."
    },
    {
        "job_title": "Software Developer Intern",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/24143",
        "location": "Technopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Software Developer Intern</h2>\n<p><strong>Company:</strong> Lean Transitions Solutions\n<strong>Location:</strong> Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Website:</strong> http://www.LeanTransitionSolutions.com\n<strong>Contact Email:</strong> careers@ltslean.com\n<strong>Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 15, Oct 2025</p>\n<h3>About Us</h3>\n<p>Founded over a decade ago, Lean Transition Solutions Ltd (LTS) is a UK-headquartered, ISO 9001:2015 certified company advocating Industry 4.0. LTS delivers Lean Industry 4.0 software and Leadership 4.0 solutions globally to world-class organizations, including Fortune 500 companies, with offices in India, Germany, Poland, the United States, UAE, Jordan, and Mexico.</p>\n<p>Our dedicated team ensures client requirements are met with bespoke software solutions that address industrial and manufacturing challenges. We provide breakthrough lean software solutions across various industries, from service to manufacturing.</p>\n<p>At LTS, we foster a culture rooted in core values: Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<h3>Your Role as a Software Developer Intern</h3>\n<p>As a Software Developer Intern, you will:</p>\n<ul>\n<li><strong>Assist in Software Development:</strong> Work closely with developers to design, develop, test, and maintain web and mobile applications.</li>\n<li><strong>Code and Debug:</strong> Write clean, efficient, and well-documented code for various applications and systems.</li>\n<li><strong>Collaborate:</strong> Participate in team meetings, code reviews, and brainstorming sessions to contribute ideas and enhance software functionality.</li>\n<li><strong>Support in Testing:</strong> Assist the QA team in writing test cases, performing manual testing, and debugging issues to ensure high-quality software releases.</li>\n<li><strong>Learn &amp; Implement Technologies:</strong> Gain exposure to a range of technologies, frameworks, and development tools.</li>\n<li><strong>Problem Solving:</strong> Troubleshoot and resolve software bugs, ensuring the delivery of high-quality applications.</li>\n<li><strong>Documentation:</strong> Assist in creating technical documentation, user guides, and reports for development work.</li>\n<li><strong>Research and Innovate:</strong> Explore new technologies and approaches to improve development processes and software solutions.</li>\n</ul>\n<h3>Desired Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> B.Tech (2024 or 2025 passed out).</li>\n<li><strong>Programming Knowledge:</strong> Strong understanding of at least one programming language (e.g., Java, C++, Python, JavaScript).</li>\n<li><strong>Basic Knowledge of Web Development:</strong> Familiarity with HTML, CSS, JavaScript, and frameworks like Laravel, React, Angular, or Node.js is a plus.</li>\n<li><strong>Database Knowledge:</strong> Basic understanding of SQL and relational databases (e.g., MySQL, PostgreSQL) is desirable.</li>\n<li><strong>Problem-Solving Skills:</strong> Strong analytical thinking and the ability to solve complex problems.</li>\n<li><strong>Team Player:</strong> Ability to work collaboratively in a team-oriented environment.</li>\n<li><strong>Self-Learning:</strong> Willingness to learn new technologies and development practices.</li>\n<li><strong>Good Communication Skills:</strong> Ability to communicate technical concepts clearly and effectively.</li>\n<li><strong>Additional Qualifications:</strong> Certifications or prior internship experience in software development will be considered a plus.</li>\n</ul>\n<h3>Additional Details</h3>\n<ul>\n<li><strong>Location:</strong> Lean Transition Solutions, Periyar Building Technopark</li>\n<li><strong>Duration:</strong> 3 months (with the possibility of a permanent job offer based on performance)</li>\n<li><strong>Type:</strong> Paid</li>\n<li><strong>Mode:</strong> In Office</li>\n</ul>\n<p><strong>To Apply:</strong>\nInterested candidates can send their updated resume to careers@ltslean.com with the subject line \"Software Developer Intern\".</p>",
        "tags": [
            "0-2 Years",
            "Software Development",
            "Python",
            "JavaScript"
        ],
        "summary": "Seeking a Software Developer Intern to assist in designing, developing, and testing applications. Must have strong programming knowledge and problem-solving skills."
    },
    {
        "job_title": "Quality Analyst Intern",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/24142",
        "location": "Technopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Quality Analyst Intern</h2>\n<p><strong>Company:</strong> Lean Transitions Solutions\n<strong>Location:</strong> Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Website:</strong> http://www.LeanTransitionSolutions.com\n<strong>Contact Email:</strong> careers@ltslean.com\n<strong>Closing Date:</strong> 15, Oct 2025\n<strong>Job Published:</strong> 10, Oct 2025</p>\n<h3>About Lean Transitions Solutions (LTS)</h3>\n<p>Founded over a decade ago with headquarters in the United Kingdom, Lean Transition Solutions Ltd (LTS) is an ISO 9001:2015 certified company advocating Industry 4.0. LTS delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions for world-class organizations globally, including Fortune 500 companies. We have global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico. Our dedicated team ensures client requirements are met and our bespoke software solutions address industrial and manufacturing challenges across various sectors.</p>\n<p>At LTS, we uphold our company culture and nurture core values: Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<h3>About the Role</h3>\n<p>This is a paid internship position for a Quality Analyst Intern.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Manual Testing:</strong> Perform functional, performance, security, and usability testing for web and mobile products across various OS platforms (Windows, Android, Mac, iOS).</li>\n<li><strong>Test Case Creation:</strong> Create detailed test cases based on product requirements and contribute to evolving product requirements.</li>\n<li><strong>Test Execution:</strong> Maintain, execute, and perform exploratory and regression testing on test builds.</li>\n<li><strong>Bug Reporting:</strong> Identify, isolate, interpret, and report bugs; work closely with developers to analyze issues and ensure resolution.</li>\n<li><strong>Test Reporting:</strong> Create and maintain useful test reports with proper metrics; keep the bug database up to date.</li>\n<li><strong>Test Environment Setup:</strong> Set up appropriate test environments and test data.</li>\n<li><strong>Collaboration:</strong> Collaborate in release and deployment planning, ensuring clear communication of progress from a QA perspective.</li>\n<li><strong>Documentation:</strong> Maintain clear and thorough documentation of work and communicate technical issues effectively with developers and project management.</li>\n<li><strong>Teamwork:</strong> Act as a reliable team player, demonstrating ownership and commitment to tasks.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Freshers with a B.Tech background are welcome, especially those with internship experience or certifications in Software Testing.</li>\n<li><strong>Test Scenarios:</strong> Ability to create clear, concise, and comprehensive test scenarios.</li>\n<li><strong>Agile/Scrum Experience:</strong> Prior experience working in an Agile/Scrum development environment.</li>\n<li><strong>UX Guidelines Knowledge:</strong> Familiarity with UX guidelines, configuration requirements, and known issues across platforms (OS and devices).</li>\n<li><strong>Communication Skills:</strong> Strong verbal and written communication skills.</li>\n<li><strong>SQL &amp; Scripting Knowledge:</strong> Basic knowledge of SQL and scripting languages.</li>\n<li><strong>Performance Testing:</strong> Basic knowledge of Performance Testing, Load Testing, and UX Compliance Testing.</li>\n<li><strong>Problem-Solving:</strong> Strong analytical skills.</li>\n</ul>\n<h3>Additional Details</h3>\n<ul>\n<li><strong>Location:</strong> Lean Transition Solutions, Periyar Building, Technopark, Trivandrum</li>\n<li><strong>Duration:</strong> 3 months (with the possibility of a permanent job offer based on performance)</li>\n<li><strong>Type:</strong> Paid internship</li>\n<li><strong>Mode:</strong> In Office</li>\n</ul>\n<p><strong>To Apply:</strong></p>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line \"Quality Analyst Intern\".</p>",
        "tags": [
            "0-1 Years",
            "Manual Testing",
            "Agile",
            "SQL"
        ],
        "summary": "Quality Analyst Intern role at Lean Transitions Solutions. Responsibilities include manual testing, bug reporting, and test execution. Interns gain experience in a 3-month paid program."
    },
    {
        "job_title": "UI/UX & Product Designer - Experienced",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24140",
        "location": "Technopark",
        "closing_date": "24 Nov 2025",
        "job_description": "<h2>UI/UX &amp; Product Designer - Experienced</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai\n<strong>Job Published:</strong> 10, Oct 2025\n<strong>Closing Date:</strong> 24, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a talented Product &amp; UI/UX Designer who can transform our software into intuitive, user-friendly products that delight our clients.</p>\n<h3>Role Overview</h3>\n<p>As a Product &amp; UI/UX Designer, you will own the end-to-end design process, from understanding user needs to crafting visually appealing interfaces and ensuring a seamless user experience. You will collaborate with product managers, engineers, and stakeholders to balance innovation with practical, effective solutions.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Conduct user research, interviews, and competitor analysis in collaboration with product managers and engineers.</li>\n<li>Translate insights into wireframes, storyboards, user flows, sitemaps, and prototypes.</li>\n<li>Design and develop graphic user interface elements, including menus, tabs, widgets, and interactive components.</li>\n<li>Build UI mock-ups and prototypes to clearly illustrate product functionality and look.</li>\n<li>Create original graphic designs and present drafts to internal teams and stakeholders.</li>\n<li>Identify and troubleshoot UX issues, making adjustments based on user feedback and usability testing.</li>\n<li>Ensure products are usable, accessible, and enjoyable for end users.</li>\n<li>Collaborate with cross-functional teams to align design with product strategy and goals.</li>\n<li>Maintain design consistency and adhere to brand guidelines across all digital products.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s/Master’s/Diploma in Design or related field preferred.</li>\n<li>Strong portfolio of design projects.</li>\n<li>Proficiency in Photoshop and wire framing/prototyping tools (Figma, Sketch, etc.).</li>\n<li>Knowledge of HTML, CSS, and Bootstrap is a plus.</li>\n<li>Good understanding of colour, typography, layout, and interactive design.</li>\n<li>Strong communication and teamwork skills.</li>\n</ul>\n<h3>Experience Required</h3>\n<ul>\n<li>2 plus years.</li>\n</ul>\n<p><strong>Work Type:</strong> Work From Office\n<strong>Location:</strong> Trivandrum\n<strong>Salary Package:</strong> 5-7 LPA</p>",
        "tags": [
            "2+ Years",
            "UI/UX Design",
            "Figma",
            "Photoshop"
        ],
        "summary": "Seeking a Product & UI/UX Designer for end-to-end design. Responsibilities include user research, prototyping, and interface design. Requires strong portfolio and tool proficiency."
    },
    {
        "job_title": "Product & UI/UX Designer -2+ Yrs Exp",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24139",
        "location": "Technopark",
        "closing_date": "24 Nov 2025",
        "job_description": "<h2>REIZEND (P) Ltd</h2>\n<p><strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum , 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<h2>Product &amp; UI/UX Designer - 2+ Years Experience</h2>\n<p><strong>Closing Date:</strong> 24, Nov 2025\n<strong>Job Published:</strong> 10, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a talented Product &amp; UI/UX Designer who can transform our software into intuitive, user-friendly products that delight our clients.</p>\n<h3>Role Overview</h3>\n<p>As a Product &amp; UI/UX Designer, you will own the end-to-end design process, from understanding user needs to crafting visually appealing interfaces and ensuring a seamless user experience. You will collaborate with product managers, engineers, and stakeholders to balance innovation with practical, effective solutions.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Conduct user research, interviews, and competitor analysis in collaboration with product managers and engineers.</li>\n<li>Translate insights into wireframes, storyboards, user flows, sitemaps, and prototypes.</li>\n<li>Design and develop graphic user interface elements, including menus, tabs, widgets, and interactive components.</li>\n<li>Build UI mock-ups and prototypes to clearly illustrate product functionality and look.</li>\n<li>Create original graphic designs and present drafts to internal teams and stakeholders.</li>\n<li>Identify and troubleshoot UX issues, making adjustments based on user feedback and usability testing.</li>\n<li>Ensure products are usable, accessible, and enjoyable for end users.</li>\n<li>Collaborate with cross-functional teams to align design with product strategy and goals.</li>\n<li>Maintain design consistency and adhere to brand guidelines across all digital products.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s/Master’s/Diploma in Design or related field preferred.</li>\n<li>Strong portfolio of design projects.</li>\n<li>Proficiency in Photoshop and wireframing/prototyping tools (Figma, Sketch, etc.).</li>\n<li>Knowledge of HTML, CSS, and Bootstrap is a plus.</li>\n<li>Good understanding of color, typography, layout, and interactive design.</li>\n<li>Strong communication and teamwork skills.</li>\n</ul>\n<p><strong>Experience Required:</strong> 2 plus years\n<strong>Work Location:</strong> Trivandrum (Work From Office)\n<strong>Salary Package:</strong> 5-7 LPA</p>",
        "tags": [
            "2+ Years",
            "UI/UX Design",
            "Figma",
            "Photoshop"
        ],
        "summary": "Seeking a Product & UI/UX Designer with 2+ years of experience to create intuitive and user-friendly software. Responsibilities include user research, prototyping, and collaborating with cross-functional teams."
    }
]