[
    {
        "job_title": "SMO Executive (Google Ads & Meta Ads)",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22895",
        "location": "Technopark",
        "closing_date": "22 Aug 2025",
        "job_description": "<h2>SMO Executive (Google Ads &amp; Meta Ads) - Walk-In</h2>\n<p><strong>HoneyKode Technologies (P) Ltd</strong>\nD-2 Module, 6th floor, Bhavani Building, Technopark Campus, 695581\nhttp://www.honeykode.com</p>\n<p><strong>Walk-In Date:</strong> 22, Aug 2025\n<strong>Time:</strong> 11:00 AM - 3:30 PM\n<strong>Job Published:</strong> 18, Aug 2025</p>\n<p><strong>Contact Email:</strong> nandu@honeykode.com</p>\n<p><strong>Brief Description:</strong>\n- Manage and optimize Google Ads and Meta (Facebook &amp; Instagram) ad campaigns.\n- Plan and execute Social Media Optimization (SMO) strategies to grow organic reach.\n- Monitor ad performance, analyze metrics, and prepare reports.\n- Coordinate with the design/content team to create engaging ad creatives.\n- Research competitors, trends, and audience behavior to improve ROI.</p>\n<p><strong>Preferred Skills:</strong>\n- Hands-on experience with Google Ads and Meta Ads Manager.\n- Strong understanding of SMO strategies and social media algorithms.\n- Knowledge of campaign budgeting, targeting, and A/B testing.\n- Analytical mindset with basic reporting skills.\n- Ability to meet deadlines and work in a fast-paced environment.</p>\n<p><strong>Education:</strong>\n- Any graduate (Marketing / Digital Marketing certification preferred).</p>\n<p><strong>Walk-In Venue:</strong>\nHoneyKode Technologies Pvt Ltd\n6th Floor | Bhavani | Technopark | Trivandrum</p>\n<p><strong>Date:</strong> 22/08/2025\n<strong>Time:</strong> 11am\n<strong>Contact Person:</strong> Max - 9746450771</p>\n<p><strong>Documents Required:</strong>\n- Updated Resume\n- Government-issued ID (Aadhaar/PAN/Driving License)\n- Educational Certificates (original &amp; photocopies)\n- Experience Certificates (if any)</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.\nCandidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\nClick here to download the Mobile App for Android\nClick here to download the Mobile App for iOS</p>\n<p><strong>Website URL:</strong>\nvms.technopark.org\nClick here for the User Manual</p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "1+ Years",
            "Google Ads",
            "Meta Ads Manager",
            "SMO Strategies",
            "Campaign Budgeting"
        ],
        "summary": "HoneyKode Technologies is hiring an SMO Executive to manage Google and Meta ad campaigns. The role involves optimizing ads, planning SMO strategies, and analyzing performance metrics."
    },
    {
        "job_title": "Programme Manager - Office of the CEO",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22894",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Programme Manager - Office of the CEO</h2>\n<p><strong>About Way.com</strong></p>\n<p>Way.com is America’s leading automotive super app, empowering over 10 million customers across various services, including auto insurance, parking, and EV charging. Leveraging AI, machine learning, and data analytics, Way.com delivers personalized solutions, transforming car ownership. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list and as the top Product in Insurance by UnitQ.</p>\n<p><strong>Role Overview</strong></p>\n<p>This high-impact role requires a decisive leader who can drive results. The Programme Manager will oversee the CEO’s office, ensuring clear priorities, executed actions, and delivered outcomes.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Execute CEO Directives: Translate the CEO’s vision into actionable initiatives and ensure timely execution.</li>\n<li>Eliminate Barriers: Anticipate challenges and remove obstacles to maintain momentum.</li>\n<li>Enforce Deadlines and Budgets: Drive accountability to ensure deliverables are completed on time and within budget.</li>\n<li>Provide Actionable Insights: Present the CEO with well-analyzed solutions and strategic recommendations.</li>\n<li>Strengthen Leadership Accountability: Hold senior leaders responsible for commitments and execution.</li>\n<li>Streamline Operations: Simplify processes to enhance speed and efficiency across teams.</li>\n<li>Drive Closure: Track initiatives and projects to full resolution.</li>\n<li>Support CEO Effectiveness: Manage priorities and scheduling to safeguard the CEO’s focus and effectiveness.</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li>Education: Engineering degree or Management Degree (MBA/PGDM).</li>\n<li>Experience: 7–12 years in programme management, strategy, or senior executive roles.</li>\n<li>Proven Track Record: Delivered outcomes in high-pressure environments.</li>\n<li>Commanding Presence: Able to influence and lead across the organization.</li>\n<li>Mindset: Relentless, disciplined, outcome-obsessed.</li>\n<li>Judgment &amp; Discretion: Trusted to manage sensitive matters for the CEO.</li>\n</ul>\n<p><strong>Success Metrics</strong></p>\n<ul>\n<li>Project Delivery: 100% of strategic programmes delivered on time and within budget.</li>\n<li>Decision Enablement: CEO receives actionable information within deadlines 100% of the time.</li>\n<li>Accountability Enforcement: Zero unresolved issues beyond agreed timelines.</li>\n<li>Process Efficiency: Key processes are streamlined and operating at maximum clarity and speed.</li>\n<li>Cross-Functional Alignment: Initiatives executed without misalignment or delays.</li>\n<li>CEO Mental &amp; Physical Wellbeing: Ensure CEO maintains focus and avoids overload.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p>Contact Email: careers@way.com</p>",
        "tags": [
            "7-12 Years",
            "Programme Management",
            "Strategy",
            "Executive Roles"
        ],
        "summary": "Seeking a Programme Manager for the CEO's office at Way.com, to drive strategic initiatives and ensure efficient operations. The ideal candidate will have 7-12 years of experience."
    },
    {
        "job_title": "Performance Marketing Manager (SEM)",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22893",
        "location": "Technopark",
        "closing_date": "28 Sep 2025",
        "job_description": "<h2>Performance Marketing Manager (SEM)</h2>\n<p><strong>About Us</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Digital Marketing Manager / Performance Marketing Manager</p>\n<p><strong>Experience:</strong> 6 to 8 Years</p>\n<p><strong>Work Arrangement:</strong> On-site</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking a data-driven and results-oriented Digital Marketing / Performance Marketing Manager to lead our paid media efforts—primarily focused on Search Engine Marketing (SEM) across Google Ads, Bing Ads, and other relevant platforms. You’ll drive performance across our key verticals: Airport Parking, City Parking, Auto Insurance, Car Repair &amp; Maintenance, and more. If you’ve managed high-scale budgets, tested beta products, and delivered award-winning campaigns, this is your opportunity to make an impact.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design, launch, and optimize high-performance SEM campaigns to achieve traffic, conversion, and revenue goals.</li>\n<li>Conduct comprehensive keyword research, create well-structured campaigns, and execute A/B testing across ads and landing pages.</li>\n<li>Track and analyze key performance metrics (CTR, CPC, CVR, ROAS) to identify opportunities for scalability and efficiency improvements.</li>\n<li>Collaborate with cross-functional teams (analytics, product, content, and design) to ensure effective campaign execution and iteration.</li>\n<li>Leverage beta features, automation tools, and emerging ad formats to maintain a competitive edge.</li>\n<li>Develop and present detailed performance reports, insights, and strategic recommendations to stakeholders.</li>\n<li>Maintain full compliance with platform advertising policies while ensuring strong quality scores.</li>\n<li>Stay updated on AI-driven innovations in digital advertising, adopting new features and tools launched by Google, Meta, Microsoft, and other major platforms.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>6+ years of hands-on experience in digital/performance marketing with a strong focus on SEM.</li>\n<li>Experience managing $100K+/month in paid media spend, preferably for US-based markets.</li>\n<li>Strong command of platforms including Google Ads, Bing Ads, and tools such as Google Analytics, Looker Studio, SA360, etc.</li>\n<li>Proven expertise with AI-powered advertising solutions (e.g., Google Performance Max, Meta Advantage+, DSA, automated audience expansion).</li>\n<li>Google Ads Certification required; Meta Blueprint or multi-channel expertise is a plus.</li>\n<li>Prior experience in e-commerce, mobility, or booking-based platforms is highly desirable.</li>\n<li>Exposure to beta product testing, new feature launches, or award-winning campaigns is a strong advantage.</li>\n<li>Agency background with multi-client and multi-platform experience is a plus.</li>\n<li>Excellent analytical, project management, and communication skills.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p>Contact Email: careers@way.com\nApply Now: https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>",
        "tags": [
            "6-8 Years",
            "SEM",
            "Google Ads",
            "Google Analytics"
        ],
        "summary": "Way.com is looking for a data-driven Performance Marketing Manager to lead SEM efforts across various platforms. The ideal candidate will drive performance, optimize campaigns, and leverage AI-powered advertising solutions."
    },
    {
        "job_title": "Project Manager IT (CSM)",
        "company": "Hybcloud Technologies (P) Ltd (Cloud Control)",
        "url": "https://technopark.org/job-details/22892",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Project Manager IT (CSM)</h2>\n<p><strong>About Us:</strong></p>\n<p>CLOUD CONTROL SOLUTIONS (HYBCLOUD) is a leading provider of cloud migration and application management solutions. We specialize in leveraging cutting-edge technologies like Docker, containers, Kubernetes, and cloud platforms to optimize our clients' digital transformation journey. We are seeking a dynamic and customer-focused Project Manager to join our team and play a pivotal role in ensuring the success of our projects.</p>\n<p><strong>Job Summary:</strong></p>\n<p>We are looking for a skilled Project Manager who will serve as a bridge between our clients and our technical teams. The ideal candidate will excel in both customer relationship management and project coordination. You will be responsible for ensuring the successful delivery of cloud migration and application management projects, meeting customer expectations, and fostering long-term client relationships.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>Client Engagement:</strong></p>\n<ul>\n<li>Act as the primary point of contact for clients, understanding their needs, objectives, and success criteria.</li>\n<li>Build and nurture strong client relationships by providing exceptional customer service and support throughout the project lifecycle.</li>\n</ul>\n<p><strong>Project Management:</strong></p>\n<ul>\n<li>Collaborate with technical teams to plan, execute, and monitor cloud migration and application management projects.</li>\n<li>Develop project plans, schedules, and budgets, and ensure adherence to project timelines and budgets.</li>\n</ul>\n<p><strong>Communication and Reporting:</strong></p>\n<ul>\n<li>Regularly communicate project progress, milestones, and challenges to clients, ensuring transparency and alignment with client expectations.</li>\n<li>Prepare and deliver project status reports and presentations to clients and internal stakeholders.</li>\n</ul>\n<p><strong>Issue Resolution:</strong></p>\n<ul>\n<li>Identify and address project-related issues promptly and effectively, working with cross-functional teams to find solutions.</li>\n<li>Escalate critical issues to senior management as needed.</li>\n</ul>\n<p><strong>Quality Assurance:</strong></p>\n<ul>\n<li>Ensure the quality and delivery of project deliverables meet or exceed client expectations.</li>\n<li>Conduct project reviews and quality assessments to identify areas for improvement.</li>\n</ul>\n<p><strong>Risk Management:</strong></p>\n<ul>\n<li>Proactively identify project risks and develop risk mitigation plans.</li>\n<li>Manage changes in project scope, schedule, and costs.</li>\n</ul>\n<p><strong>Customer Satisfaction:</strong></p>\n<ul>\n<li>Measure and evaluate customer satisfaction through surveys and feedback mechanisms.</li>\n<li>Take corrective actions to enhance customer experience and project success.</li>\n</ul>\n<p><strong>Documentation and Knowledge Sharing:</strong></p>\n<ul>\n<li>Maintain accurate project documentation, including project plans, schedules, and client communication records.</li>\n<li>Share knowledge and best practices with internal teams for continuous improvement.</li>\n</ul>\n<p><strong>Preferred Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor's/Master's degree in a relevant field (e.g., Business, IT, Project Management).</li>\n<li>Proven experience as a Project Coordinator or similar role in the IT or cloud services industry.</li>\n<li>Strong understanding of cloud technologies, Docker, containers, Kubernetes, and cloud platforms.</li>\n<li>Excellent project management skills, including the ability to create and manage project plans.</li>\n<li>Exceptional communication, negotiation, and interpersonal skills.</li>\n<li>Customer-centric mindset with a passion for ensuring customer success.</li>\n<li>Problem-solving and critical-thinking abilities.</li>\n<li>Knowledge of project management tools and methodologies (e.g., Agile, Scrum) is a plus.</li>\n<li>Project management certification (e.g., PMP, CAPM) is a plus.</li>\n<li>At least 8+ years of experience as project manager or system analyst</li>\n<li>Strong communication and presentation skills.</li>\n<li>Excellent organizational and leadership abilities.</li>\n</ul>\n<p>Job Type: Full-time</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: asprasad@ecloudcontrol.com</li>\n<li>Website: http://www.ecloudcontrol.com</li>\n<li>Address: HybCloud Technologies (P) Ltd (Cloud Control)ACE-12, 4th Floor, C-DAC Building, Technopark, Trivandrum, Kerala, India , 695582</li>\n</ul>",
        "tags": [
            "8+ Years",
            "Project Management",
            "Kubernetes",
            "Cloud Technologies"
        ],
        "summary": "HybCloud Technologies is seeking a skilled Project Manager to manage cloud migration and application management projects. The candidate will serve as a bridge between clients and technical teams."
    },
    {
        "job_title": "Data Architect/Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22891",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Data Architect/Manager</h2>\n<p><strong>About Us</strong>\nWay.com is America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, they deliver innovative, personalized solutions that transform car ownership. Way.com was featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ.</p>\n<p><strong>Job Title:</strong> Data Architect/Manager</p>\n<p><strong>Work Arrangement:</strong> On-site</p>\n<p><strong>Experience:</strong> 10+ years</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview</strong>\nWe are seeking a visionary and hands-on Data Architect/Manager to design, build, and optimize high-performance, scalable data ecosystems that power intelligent decision-making and accelerate business growth. This role requires a strategic thinker with deep technical expertise—capable of balancing long-term architectural vision with practical execution in a fast-paced, innovation-driven environment.</p>\n<p><strong>Key Responsibilities</strong>\n- Design Scalable Data Architectures – Build and implement resilient data models, infrastructure, and pipelines to ensure scalability, performance, and adaptability.\n- Leadership &amp; Mentorship – Guide and inspire data engineers and analysts to deliver consistently high-impact results.\n- Business-Aligned Data Strategy – Partner with product, engineering, business, and design teams to align data initiatives with organizational objectives.\n- Technology Innovation – Assess, adopt, and oversee advanced data platforms and tools to address current needs and drive future innovation.\n- End-to-End Data Ownership – Oversee data ingestion, transformation, storage, access, and lifecycle management with a focus on efficiency, security, and reliability.\n- Governance &amp; Compliance – Define and enforce standards to ensure data quality, integrity, and adherence to regulatory requirements.\n- Actionable Insights – Provide architectural guidance and analytics that empower leadership with strategic decision-making.\n- Data-Driven Culture – Advocate best practices, standardization, and data literacy across the organization.\n- Clear Communication – Keep stakeholders informed through transparent reporting, proactive risk management, and timely resolution of issues.</p>\n<p><strong>Preferred Skills</strong>\n- Proven leadership and team management capabilities with a focus on mentoring, motivation, and team growth.\n- Strong analytical and problem-solving abilities.\n- Excellent communication skills with the ability to convey complex technical concepts to both technical and non-technical stakeholders.\n- Exceptional attention to detail to maintain high standards in performance, accuracy, and security within system architecture.\n- Ability to balance leadership duties with technical execution while managing competing priorities.\n- Effective project and stakeholder management skills, focused on achieving measurable business outcomes.</p>\n<p><strong>Why You Will Love Working With Us</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Opportunity to make a meaningful impact across 10+ million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth in a rapidly scaling technology company.\n- Competitive compensation.</p>\n<p><strong>Contact Information</strong>\ncareers@way.com</p>\n<p><strong>Apply Now:</strong>\nhttps://waydot.greythr.com/hire/jobs/data-architectmanager</p>",
        "tags": [
            "10+ Years",
            "Data Architecture",
            "Data Modeling",
            "Data Governance"
        ],
        "summary": "Seeking a Data Architect/Manager to design and optimize scalable data ecosystems. This role involves leadership, strategy alignment, and driving a data-driven culture to enable business growth."
    },
    {
        "job_title": "Graphic Designer (DaVinci Resolve, Photoshop, Premiere Pro)",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22890",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Graphic Designer (DaVinci Resolve, Photoshop, Premiere Pro) - Walk-In</h2>\n<p><strong>HoneyKode Technologies (P) Ltd</strong>\nD-2 Module, 6th floor, Bhavani Building, Technopark Campus, 695581\nhttp://www.honeykode.com\nContact Email: nandu@honeykode.com</p>\n<p><strong>Walk-In Date:</strong> 21, Aug 2025\n<strong>Time:</strong> 11:00:00 to 15:00:00</p>\n<p>We are seeking a creative and detail-oriented Graphic Designer with strong expertise in DaVinci Resolve, Adobe Photoshop, and Adobe Premiere Pro. The ideal candidate will be responsible for designing compelling visuals, editing videos, and delivering high-quality digital content aligned with our brand.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and edit graphics, videos, and marketing materials.</li>\n<li>Color grading and video enhancements using DaVinci Resolve.</li>\n<li>Photo editing, retouching, and creative design in Photoshop.</li>\n<li>Video editing and motion graphics using Premiere Pro.</li>\n<li>Collaborate with the marketing and content teams to create consistent branding.</li>\n<li>Meet project deadlines while maintaining high design standards.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proficiency in DaVinci Resolve, Adobe Photoshop, and Adobe Premiere Pro.</li>\n<li>Strong understanding of color theory, typography, and layout.</li>\n<li>Knowledge of video formats, codecs, and export settings.</li>\n<li>Creative mindset with attention to detail.</li>\n<li>Ability to work independently and manage multiple projects.</li>\n<li>[Optional: 1+ year of experience in graphic/video design or a strong portfolio.]</li>\n</ul>\n<p><strong>Walk-In Venue:</strong>\nHoneyKode Technologies Pvt Ltd\n6th Floor | Bhavani | Technopark | Trivandrum\nDate: 21/08/2025 Time: 11am Contact Person: Max - 9746450771</p>\n<p><strong>Documents Required:</strong></p>\n<ul>\n<li>Updated Resume</li>\n<li>Government-issued ID (Aadhaar/PAN/Driving License)</li>\n<li>Educational Certificates (original &amp; photocopies)</li>\n<li>Experience Certificates (if any)</li>\n</ul>\n<p><strong>Walk-In Entry Pass</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App</strong>\nClick here to download the Mobile App for Android\nClick here to download the Mobile App for iOS</p>\n<p><strong>Website URL</strong>\nvms.technopark.org\nClick here for the User Manual</p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "1+ Years",
            "DaVinci Resolve",
            "Adobe Photoshop",
            "Adobe Premiere Pro"
        ],
        "summary": "HoneyKode Technologies is looking for a Graphic Designer proficient in video editing and graphic design. The role involves creating compelling visuals and collaborating with marketing teams."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22889",
        "location": "Technopark",
        "closing_date": "19 Aug 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\nwww.trainonexsolutions.in</p>\n<p><strong>Closing Date:</strong> 19, Aug 2025\n<strong>Job Published:</strong> 18, Aug 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li><strong>Experience:</strong> 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Have fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Customer interaction",
            "Communication",
            "Malayalam Language"
        ],
        "summary": "Join Trainonex Solutions as a Telesales Executive, driving sales and building customer relationships. This role requires fluency in Malayalam and offers an immediate, office-based opportunity."
    },
    {
        "job_title": "Sales Executive Intern",
        "company": "Tiltlabs Consultancy Services (P) Ltd",
        "url": "https://technopark.org/job-details/22888",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Sales Executive Intern</h2>\n<p><strong>TILTLABS CONSULTANCY SERVICES (P) Ltd</strong> is seeking a proactive and enthusiastic Sales/Marketing Intern to join our team. This internship is ideal for fresh graduates or students looking to gain practical experience in client relations, marketing, and sales support. You’ll be involved in a range of activities, from client communication and market research to supporting marketing campaigns, all while collaborating with cross-functional teams.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Assist in lead generation, preparing marketing materials, and supporting promotional campaigns.</li>\n<li>Respond to client inquiries and deliver exceptional customer service.</li>\n<li>Collaborate with internal teams to ensure marketing initiatives align with business goals.</li>\n<li>Support digital marketing efforts, including social media engagement and content creation.</li>\n<li>Conduct market research to identify trends and explore new opportunities.</li>\n<li>Foster and maintain strong client relationships through effective and timely communication.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Strong verbal and written communication skills.</li>\n<li>A customer-centric mindset with a passion for relationship building.</li>\n<li>Basic understanding of market research and data analysis.</li>\n<li>Familiarity with social media platforms and digital marketing tools is a plus.</li>\n<li>Interest in the technology or entertainment industry is preferred.</li>\n<li>Currently pursuing or recently completed a degree in Marketing, Communications, Business Administration, or a related field.</li>\n<li>Preference will be given to female candidates.</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<p>This internship offers valuable exposure, hands-on learning, and the opportunity to work with a creative and supportive team.</p>\n<p>We’d love to hear from you—apply today!</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Company:</strong> TILTLABS CONSULTANCY SERVICES (P) Ltd</li>\n<li><strong>Address:</strong> GH, Ground Floor, Carnival Technopark Building, Technopark, Trivandrum, Kerala, India , 695581</li>\n<li><strong>Website:</strong> http://www.tiltlabs.io</li>\n<li><strong>Closing Date:</strong> 31, Aug 2025</li>\n<li><strong>Job Published:</strong> 18, Aug 2025</li>\n<li><strong>Contact Email:</strong> careers@tiltlabs.io</li>\n</ul>",
        "tags": [
            "Freshers",
            "Market Research",
            "Client Relations",
            "Digital Marketing"
        ],
        "summary": "TILTLABS is looking for a Sales Executive Intern to assist in marketing, lead generation, and client communication. This role is ideal for fresh graduates interested in gaining hands-on experience."
    },
    {
        "job_title": "Full Stack Developer with WebGL Expertise",
        "company": "Tiltlabs Consultancy Services (P) Ltd",
        "url": "https://technopark.org/job-details/22887",
        "location": "Technopark",
        "closing_date": "25 Aug 2025",
        "job_description": "<h2>Full Stack Developer with WebGL Expertise</h2>\n<p><strong>TILTLABS CONSULTANCY SERVICES (P) Ltd</strong>\nGH, Ground Floor,\nCarnival Technopark Building,\nTechnopark, Trivandrum, Kerala, India, 695581\n<a href=\"http://www.tiltlabs.io\">http://www.tiltlabs.io</a></p>\n<p><strong>Closing Date:</strong> 25, Aug 2025\n<strong>Job Published:</strong> 18, Aug 2025\n<strong>Contact Email:</strong> careers@tiltlabs.io</p>\n<p>We are seeking a skilled Fullstack React Developer with 1-2 years of professional experience and a strong foundation in WebGL to join our innovative team. In this role, you will contribute to the development of high-performance web applications, leveraging your expertise in React.js, WebGL, and modern web development practices to deliver immersive and visually compelling user experiences.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable, responsive web applications using React.js and modern frontend frameworks.</li>\n<li>Implement WebGL-based graphics rendering to create interactive 3D/2D visualizations, as well as dynamic UI components.</li>\n<li>Collaborate with UI/UX designers and backend engineers to ensure seamless integration of frontend and backend systems.</li>\n<li>Write clean, efficient, and maintainable code while adhering to industry best practices and performance optimization techniques.</li>\n<li>Debug, troubleshoot, and resolve technical issues across the stack to ensure application stability and reliability.</li>\n<li>Participate in code reviews, architectural discussions, and Agile ceremonies to drive continuous improvement.</li>\n<li>Stay updated with emerging trends in WebGL, graphics programming, and full-stack development to propose innovative solutions.</li>\n<li>Mentor junior developers and contribute to knowledge-sharing initiatives within the team.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience).</li>\n<li>1-2 years of professional experience in full-stack/frontend development with a strong focus on React.js.</li>\n<li>Proven experience with WebGL (Three.js, Babylon.js, or raw WebGL) for rendering interactive graphics.</li>\n<li>Solid understanding of HTML5, CSS3, JavaScript (ES6+), and TypeScript.</li>\n<li>Experience with state management (Redux, MobX, or Context API).</li>\n<li>Familiarity with RESTful APIs, GraphQL, and asynchronous programming.</li>\n<li>Proficiency with Git and collaborative development workflows.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Excellent communication and teamwork abilities in an Agile environment.</li>\n</ul>\n<p><strong>Preferred Skills (Bonus):</strong></p>\n<ul>\n<li>Experience with Node.js and server-side development.</li>\n<li>Knowledge of database systems (MongoDB, PostgreSQL, Firebase).</li>\n<li>Familiarity with CI/CD pipelines, automated testing (Jest, Cypress), and DevOps practices.</li>\n<li>Exposure to shader programming (GLSL) and performance optimization in WebGL.</li>\n<li>Understanding of Agile/Scrum methodologies.</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Work on cutting-edge projects at the intersection of web development and interactive graphics.</li>\n<li>Collaborate with a talented, forward-thinking team passionate about innovation.</li>\n<li>Opportunities for professional growth, leadership, and technical mentorship.</li>\n<li>Competitive compensation, flexible work culture, and impactful contributions to high-profile products.</li>\n</ul>\n<p>If you are a driven developer with a passion for WebGL and full-stack React development, we’d love to hear from you!</p>",
        "tags": [
            "1-2 Years",
            "React.js",
            "WebGL",
            "JavaScript"
        ],
        "summary": "Seeking a Fullstack React Developer with WebGL experience to develop high-performance web applications. Responsibilities include designing, developing, and maintaining scalable web applications while implementing WebGL-based graphics."
    },
    {
        "job_title": "Senior Python Developer",
        "company": "Experion Technologies (I) (P) Ltd",
        "url": "https://technopark.org/job-details/22886",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Senior Python Developer</h2>\n<p><strong>Experion Technologies (I) (P) Ltd</strong>\n407, 4th Floor, Thejaswini, Technopark Campus\nThiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.experionglobal.com\">http://www.experionglobal.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 18, Aug 2025\n<strong>Contact Email:</strong> sandra.paul@experionglobal.com</p>\n<h3>Job Purpose</h3>\n<p>As a Senior Python Developer, you will design, develop, and maintain robust, scalable microservices and backend systems. You’ll work closely with product managers, architects, and other engineers to deliver high-quality software solutions, mentor junior developers, and help shape our technical direction.</p>\n<h3>Job Description / Duties and Responsibilities</h3>\n<ul>\n<li>Architect, design, and implement scalable microservices using Python (e.g., FastAPI, Django, Flask)</li>\n<li>Build and maintain RESTful APIs and backend services for high-availability, distributed systems</li>\n<li>Ensure consistency, availability, and service orchestration across distributed systems.</li>\n<li>Integrate with third-party services and APIs (e.g. external data sources).</li>\n<li>Optimize application performance, reliability, and security (including data management and compliance).</li>\n<li>Participate in code reviews, provide constructive feedback, and mentor junior developers.</li>\n<li>Collaborate with cross-functional teams (DevOps, QA, Product) to deliver features using Agile methodologies.</li>\n<li>Write clean, maintainable, well-tested code following standard best practices.</li>\n<li>Troubleshoot, debug, and resolve production issues, ensuring minimal downtime.</li>\n<li>Document technical designs, processes, and architectural decisions.</li>\n<li>Stay updated with emerging trends and technologies in Python and microservices.</li>\n<li>Adhere to ISMS policies and procedures.</li>\n</ul>\n<h3>Job Specification / Skills and Competencies</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Engineering, or related field.</li>\n<li>5+ years of professional Python development experience.</li>\n<li>2+ years of hands-on experience designing and building microservices architectures.</li>\n<li>Strong proficiency with Python frameworks (FastAPI, Django, Flask).</li>\n<li>Exposure on containerization and orchestration tools (Docker, Kubernetes).</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Skills – Mandatory:</strong> Python, FastAPI</li>\n<li><strong>Skills - Primary:</strong> Microservices, SQL</li>\n<li><strong>Skills - Good to have:</strong> DevOps CI/CD Exposure</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Python",
            "Microservices",
            "FastAPI"
        ],
        "summary": "Seeking a Senior Python Developer to design, develop, and maintain scalable microservices and backend systems. Requires 5+ years of Python development experience and proficiency with frameworks like FastAPI."
    },
    {
        "job_title": "FLUTTER DEVELOPER EXPERIENCED (1.5 - 3 years exp)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22885",
        "location": "Technopark",
        "closing_date": "02 Oct 2025",
        "job_description": "<h2>Flutter Developer</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building\nTechnopark Phase 1, 695581\nhttps://shmsolutions.in</p>\n<p><strong>Experience:</strong> 1.5 - 3 years\n<strong>Closing Date:</strong> 02, Oct 2025\n<strong>Job Published:</strong> 18, Aug 2025\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Develop mobile applications using the Flutter framework and Dart programming language.</li>\n<li>Work with designers to create user-friendly and visually appealing interfaces.</li>\n<li>Test and fix issues in the application code to ensure it works properly.</li>\n<li>Optimize the performance of the app, including reducing size and improving speed.</li>\n<li>Collaborate with other team members, such as designers and backend developers.</li>\n<li>Use version control systems, like Git, to manage code and collaborate with others.</li>\n<li>Document code, processes, and project requirements for future reference.</li>\n<li>Stay updated with the latest trends and advancements in mobile app development.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proficient in Flutter framework and Dart programming language.</li>\n<li>Knowledge of mobile app development principles and best practices.</li>\n<li>Familiarity with front-end technologies like HTML, CSS, and JavaScript.</li>\n<li>Understanding of UI/UX design principles and ability to work with designers.</li>\n<li>Experience with RESTful APIs and integrating backend services.</li>\n<li>Familiarity with version control systems, particularly Git.</li>\n<li>Knowledge of agile development methodologies and collaborative tools.</li>\n<li>Problem-solving and analytical thinking skills.</li>\n<li>Good communication and teamwork abilities.</li>\n</ul>\n<h3>Qualification:</h3>\n<p>Bachelors or Master’s degree in computer or related fields.</p>\n<p><strong>Salary:</strong> 35K - 40K</p>",
        "tags": [
            "1.5-3 Years",
            "Flutter",
            "Dart",
            "RESTful APIs"
        ],
        "summary": "We are seeking a Flutter Developer to create mobile applications, work with designers, and optimize app performance. Proficiency in Flutter and Dart, experience with RESTful APIs, and familiarity with Git are required."
    },
    {
        "job_title": "Spanish Customer Support Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22884",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. </p>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for a dynamic and customer-focused individual to join our team as a Spanish Customer Success Executive in our voice process. This role involves delivering excellent customer service to our Spanish-speaking clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage inbound and outbound calls, delivering prompt and effective resolutions to customer queries, concerns, and complaints.</li>\n<li>Provide empathetic, professional support to ensure a positive customer experience in every interaction.</li>\n<li>Identify, prioritize, and escalate complex cases to the appropriate departments for swift resolution.</li>\n<li>Maintain accurate records of customer interactions and keep databases up to date.</li>\n<li>Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li>Stay informed on company products and services to provide customers with accurate and up-to-date information.</li>\n<li>Work closely with colleagues to foster a supportive, collaborative, and high-performing work environment.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Fluent in both <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong interpersonal and communication skills, with a patient and empathetic approach.</li>\n<li>Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<p><strong>Why You Will Love Working with Us:</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@way.com</p>\n<p><strong>Location:</strong> Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram</p>\n<p><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</p>",
        "tags": [
            "1+ Years",
            "Spanish Language",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "Way.com is seeking a Spanish Customer Success Executive to provide excellent customer service to Spanish-speaking clients. The role involves handling inquiries, resolving issues, and ensuring customer satisfaction through effective communication."
    },
    {
        "job_title": "Senior E-mail Marketing Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22883",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Way.com - Senior B2C Email Marketing Specialist</h2>\n<p><strong>About Us:</strong>\nWay.com is America’s leading automotive super app, serving over 10 million customers with solutions ranging from auto insurance and parking to EV charging. We leverage AI, machine learning, and data analytics to transform car ownership, making it easier, more affordable, and more rewarding. Recognized by Bloomberg and Andreessen Horowitz, we offer a dynamic, innovation-driven work culture.</p>\n<p><strong>Job Title:</strong> Senior B2C Email Marketing Specialist</p>\n<p><strong>Experience:</strong> 4 to 6 Years</p>\n<p><strong>Work Arrangement:</strong> On-site</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview:</strong>\nWe are seeking a results-driven Senior B2C Email Marketing Specialist to lead our product-focused email marketing efforts. This role requires expertise in Mailchimp, a strategic approach to customer engagement, and the ability to drive product growth, retention, and conversions through data-backed campaigns.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Email Strategy &amp; Execution:</strong> Design and implement impactful email marketing strategies.</li>\n<li><strong>Campaign Management:</strong> Plan, launch, and optimize campaigns using Mailchimp.</li>\n<li><strong>Audience Segmentation:</strong> Utilize customer insights to build segmented lists and deliver personalized messaging.</li>\n<li><strong>Performance Optimization:</strong> Conduct A/B testing to continuously enhance performance.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with product, design, and content teams.</li>\n<li><strong>Analytics &amp; Reporting:</strong> Track KPIs, analyze campaign results, and provide actionable recommendations.</li>\n<li><strong>Compliance &amp; Best Practices:</strong> Ensure campaigns align with regulations and industry standards.</li>\n<li><strong>Market Awareness:</strong> Stay informed on emerging email marketing trends and tools.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>4–6 years of hands-on experience in B2C email marketing, ideally within digital product or SaaS environments.</li>\n<li>Proven expertise in Mailchimp, including automation setup and performance reporting.</li>\n<li>Solid understanding of customer journey mapping and lifecycle marketing strategies.</li>\n<li>Working knowledge of HTML/CSS for email design is a plus.</li>\n<li>Strong data-driven approach, with experience using tools such as Google Analytics and UTM tracking.</li>\n<li>Ability to craft engaging, action-oriented email copy.</li>\n<li>Excellent analytical skills with a focus on optimizing campaign performance.</li>\n<li>Proficient in A/B testing.</li>\n<li>Exceptional communication and cross-functional collaboration skills.</li>\n</ul>\n<p><strong>Why you will love working with us?</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p><strong>Apply Here:</strong>\nhttps://waydot.greythr.com/hire/jobs/senior-product-email-marketing-specialist-b2c</p>\n<p><strong>Closing Date:</strong> 21,Aug 2025</p>",
        "tags": [
            "4-6 Years",
            "Mailchimp",
            "B2C Email Marketing",
            "Google Analytics"
        ],
        "summary": "Way.com is looking for a Senior B2C Email Marketing Specialist to drive customer engagement and product growth through data-backed email campaigns using Mailchimp. The ideal candidate will optimize performance and collaborate cross-functionally."
    },
    {
        "job_title": "Regional Operations Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22881",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Regional Operations Manager</h2>\n<p><strong>Way.com</strong> is seeking a strategic and results-driven Regional Manager to lead regional performance, boost sales, and strengthen vendor relationships. This role requires operational expertise, problem-solving skills, and a passion for customer experience.</p>\n<p><strong>About Way.com:</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. The company leverages AI, machine learning, and advanced data analytics to deliver personalized solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Oversee daily operations across assigned regions, ensuring accuracy, efficiency, and consistent sales performance with timely reporting.</li>\n<li>Collaborate with marketing teams to synchronize campaigns with operational goals, maintain data integrity, and generate actionable insights.</li>\n<li>Lead, coach, and motivate high-performing teams, fostering a culture of accountability, collaboration, and excellence.</li>\n<li>Establish and maintain strong, trust-based relationships with vendors to drive mutual success and long-term partnerships.</li>\n<li>Partner with cross-functional teams to identify new opportunities, implement innovative sales strategies, and enhance customer satisfaction.</li>\n<li>Act as the primary escalation point for critical operational challenges, driving swift resolutions and implementing process improvements.</li>\n<li>Continuously evaluate and refine workflows to improve scalability, efficiency, and overall operational effectiveness.</li>\n<li>Demonstrate flexibility by supporting night shifts and occasional weekends to meet business requirements and ensure seamless operations.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>A Bachelor’s degree in any discipline.</li>\n<li>Minimum 3 years of experience in Operations or a related functional area.</li>\n<li>Exceptional communication skills, both written and verbal.</li>\n<li>Strong cold-calling skills.</li>\n<li>Highly organized and a natural team player.</li>\n<li>Proficiency in Google Workspace, Microsoft Excel, and internal ticketing or CRM systems.</li>\n<li>A solution-driven mindset.</li>\n<li>Comfortable working independently and managing real-time challenges.</li>\n<li>Strong analytical thinking.</li>\n<li>A growth mindset with a willingness to continuously up-skill.</li>\n</ul>\n<p><strong>Why Work at Way.com?</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p>Apply Now: https://waydot.greythr.com/hire/jobs/regional-manager-operations</p>",
        "tags": [
            "3-7 Years",
            "Operations",
            "Vendor Management",
            "Sales"
        ],
        "summary": "Seeking a Regional Operations Manager to lead performance, drive sales, and manage vendor relationships at Way.com. The ideal candidate has proven operational expertise and is passionate about customer experience."
    },
    {
        "job_title": "Senior HR Director - Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22880",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Senior Director – HR Operations</h2>\n<p><strong>About Way.com</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. We're making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Role Overview</strong></p>\n<p>We’re looking for a visionary, results-oriented leader to head our end-to-end HR operations. As Senior Director – HR Operations, you’ll champion operational excellence across the entire employee lifecycle.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>Operational Leadership</strong></p>\n<ul>\n<li>Oversee end-to-end HR operations including talent acquisition, onboarding, payroll, benefits, compliance, performance management, and offboarding.</li>\n<li>Design and implement scalable, technology-driven processes to enhance efficiency, accuracy, and compliance.</li>\n<li>Champion automation and AI-powered solutions to streamline recruitment, engagement, and HR analytics workflows.</li>\n</ul>\n<p><strong>Data-Driven Strategy</strong></p>\n<ul>\n<li>Build a comprehensive HR analytics framework with real-time dashboards to inform strategic decision-making.</li>\n<li>Track and report key metrics such as hiring velocity, payroll accuracy, retention, engagement, and productivity.</li>\n<li>Apply predictive and prescriptive analytics to strengthen workforce planning, reduce attrition, and boost performance.</li>\n</ul>\n<p><strong>Performance &amp; Talent Management</strong></p>\n<ul>\n<li>Collaborate with business and HR leaders to refine performance management systems including OKRs, feedback loops, appraisals, and talent reviews.</li>\n<li>Ensure fairness, consistency, and timeliness across all performance-related processes.</li>\n</ul>\n<p><strong>Compliance, Risk &amp; Governance</strong></p>\n<ul>\n<li>Ensure strict compliance with labor laws, organizational policies, and regulatory requirements.</li>\n<li>Lead audits, conduct risk assessments, and update policies to mitigate legal and operational risks.</li>\n</ul>\n<p><strong>Leadership &amp; Collaboration</strong></p>\n<ul>\n<li>Build, mentor, and lead a high-performing HR operations team with a culture of innovation and continuous improvement.</li>\n<li>Partner with Finance, Legal, and IT teams to deliver seamless cross-functional support.</li>\n<li>Act as a strategic advisor to the executive team, providing actionable, data-driven insights to maximize HR’s impact and organizational success.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>15+ years of progressive HR experience, with at least 5 years in a leadership role overseeing HR operations.</li>\n<li>Prior experience in product or technology companies with fast-paced, high-growth environments.</li>\n<li>Strong hands-on expertise in HR technology platforms (HRIS, ATS, payroll systems) and AI-enabled tools for recruitment, employee service, or performance management.</li>\n<li>Proven experience in delivering data-driven results across HR functions.</li>\n<li>Demonstrated ability to scale HR operations, build shared services models, and drive automation and process excellence.</li>\n<li>Strong understanding of compliance and labor laws across regions (India/US/global preferred).</li>\n<li>Excellent leadership, project management, and communication skills.</li>\n<li>Experience working in global or distributed teams.</li>\n<li>Certification in HR Analytics, AI in HR, Six Sigma, or SHRM/SPHR preferred.</li>\n<li>Proficiency in tools like Power BI, Tableau, Workday, Darwinbox, SAP SuccessFactors, or other HRMS tools.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/senior-director-hr-operations</li>\n</ul>",
        "tags": [
            "15+ Years",
            "HR Technology Platforms",
            "HR Analytics",
            "Compliance"
        ],
        "summary": "Seeking a Senior Director – HR Operations to lead end-to-end HR operations, championing operational excellence and leveraging technology. This role requires 15+ years of HR experience and expertise in data-driven strategies."
    },
    {
        "job_title": "SOFTWARE TESTING (FRESHERS/2024/2025 PASSOUTS)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22879",
        "location": "Technopark",
        "closing_date": "02 Oct 2025",
        "job_description": "<h2>Software Testing (Freshers/2024/2025 Passouts)</h2>\n<p>SMARTHMS &amp; SOLUTIONS (P) Ltd is seeking a highly motivated and passionate individual to join their team as a Test and Implementation Engineer. This position is perfect for a graduate with a strong desire to learn and grow in the field.</p>\n<p><strong>Job Responsibilities:</strong></p>\n<ul>\n<li>Configure, implement, and demonstrate software products.</li>\n<li>Manage the implementation cycle, including requirements validation and overseeing projects with specific development requirements.</li>\n<li>Conduct internal testing and guide clients through user acceptance to go-live status.</li>\n<li>Develop and deliver training for both administrators and end-users.</li>\n<li>Document all customer interactions in the designated CRM and provide excellent customer experiences.</li>\n<li>Guide and drive the client towards the best solution for their business needs.</li>\n<li>Analyze existing systems, interface requirements, and business processes.</li>\n<li>Partner with clients to understand their business and related needs.</li>\n<li>Perform testing and provide final QA/QC before the client is ready to go live.</li>\n<li>Test all aspects of the product/system, including function/component, system, performance, regression, and service.</li>\n<li>Work with the development team to identify and capture test cases.</li>\n<li>Ensure version management and set up test environments.</li>\n<li>Design test plans and develop test cases/scenarios/usage cases.</li>\n<li>Execute test cases.</li>\n<li>Provide feedback on usability and serviceability.</li>\n<li>Trace the result to quality risk and report it to concerned people.</li>\n<li>Good Communication Skill, able to articulate and a command on English.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience required: 0 to 1 year</li>\n<li>Salary: 2.5 lakh to 4 lakh per annum</li>\n</ul>\n<p><strong>Contact Information:</strong>\nKindly share your resume to careers@shmsolutions.in</p>\n<p><strong>Address:</strong>\nSMARTHMS &amp; SOLUTIONS (P) Ltd\nSBC 14, -2 Floor, Thejaswini Building and\nGround Floor, Chandragiri Building\nTechnopark Phase 1, 695581\nhttps://shmsolutions.in</p>",
        "tags": [
            "0-1 Year",
            "Software Testing",
            "Test Cases",
            "QA/QC"
        ],
        "summary": "Join SMARTHMS & SOLUTIONS as a Test and Implementation Engineer. This role involves testing, implementation, and client interaction to ensure successful product deployment and quality assurance."
    },
    {
        "job_title": "Marketing Manager - Digital (SEM)",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22878",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Digital Marketing Manager (SEM)</h2>\n<p><strong>About Us:</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services from auto insurance to EV charging. Utilizing AI, machine learning, and advanced data analytics, Way.com delivers personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, Way.com is simplifying car ownership.</p>\n<p><strong>Job Title:</strong> Digital Marketing Manager (SEM)</p>\n<p><strong>Experience:</strong> 6 to 8 Years</p>\n<p><strong>Work Arrangement:</strong> On-site</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview:</strong>\nWe are seeking a results-driven SEM Manager to spearhead our paid search strategy. You will drive high-quality traffic, enhance online visibility, and increase revenue through impactful SEM campaigns. Manage and optimize campaigns on Google Ads and Bing Ads, collaborating with cross-functional teams to deliver cohesive, conversion-focused digital experiences.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute comprehensive SEM strategies.</li>\n<li>Perform deep keyword research and audience segmentation.</li>\n<li>Manage and optimize paid search campaigns across Google Ads, Bing Ads, and other platforms.</li>\n<li>Utilize analytics tools (e.g., Google Analytics) to evaluate performance and extract insights.</li>\n<li>Deliver clear, actionable reports highlighting KPIs and trends.</li>\n<li>Collaborate with content, design, and development teams to optimize ad copy and landing pages.</li>\n<li>Monitor industry trends and emerging SEM tools.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, or a related field.</li>\n<li>Minimum of 6 years of experience in search engine marketing, preferably within an e-commerce or online booking environment.</li>\n<li>Proven track record in planning, executing, and optimizing SEM campaigns across multiple platforms.</li>\n<li>Strong analytical skills to interpret complex data.</li>\n<li>Prior experience working in the US market, managing monthly SEM budgets of $100,000 or more.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Proficiency in Google Ads and Bing Ads platforms.</li>\n<li>Google Ads Certification is preferred.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us:</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>",
        "tags": [
            "6-8 Years",
            "SEM",
            "Google Ads",
            "Bing Ads"
        ],
        "summary": "Way.com is looking for a Digital Marketing Manager to lead SEM strategies, optimize campaigns on Google Ads and Bing Ads, and drive revenue. The ideal candidate has 6-8 years of experience and strong analytical skills."
    },
    {
        "job_title": "Marketing Manager - Social Media",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22877",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Social Media Marketing Manager</h2>\n<p><strong>About Way.com</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. They offer services ranging from auto insurance and parking to EV charging and more. Way.com leverages cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership. Recognized as a top company by Bloomberg, Andreessen Horowitz, and UnitQ.</p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking a creative, strategic, and results-oriented Social Media Marketing Manager to lead the next stage of our brand’s digital growth. You will own the strategy and execution of our social media presence—driving brand awareness, deepening community engagement, and creating meaningful interactions across multiple platforms. This role requires collaborating with cross-functional teams to deliver a unified, data-driven social strategy that amplifies our brand voice and delivers measurable business impact.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Strategic Leadership: Define and implement platform-specific strategies that reflect Way.com’s brand voice, identity, and growth objectives while ensuring consistency and innovation across all channels.</li>\n<li>Content Strategy &amp; Execution: Lead the planning, creation, and scheduling of impactful content for Instagram, Facebook, LinkedIn, X/Twitter, TikTok, and other platforms, optimized for engagement, reach, and performance.</li>\n<li>Community Management: Drive daily interactions by responding to comments, messages, and user content in a personable, brand-consistent manner. Cultivate and grow an engaged, loyal online community.</li>\n<li>Brand Growth &amp; Advocacy: Design and launch creative campaigns that deepen emotional connections, foster loyalty, and encourage user advocacy.</li>\n<li>Analytics &amp; Optimization: Monitor KPIs, analyze performance data, and continuously refine strategies to maximize ROI, reach, and engagement.</li>\n<li>Influencer &amp; Partnership Development: Identify, engage, and collaborate with influencers, creators, and partners to expand brand presence and credibility.</li>\n<li>Trend &amp; Innovation Leadership: Stay ahead of emerging trends, platform updates, and tools to maintain a fresh, competitive brand presence.</li>\n<li>Cross-Functional Collaboration: Partner with design, content, product, and customer support teams to deliver cohesive messaging and high-impact campaigns.</li>\n<li>Budget &amp; Resource Management: Oversee social media budgets and allocate resources strategically to ensure maximum ROI.</li>\n<li>Reputation Management: Monitor brand sentiment, address feedback proactively, and protect Way.com’s reputation across platforms.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, or a related field (Master’s degree is a plus).</li>\n<li>Minimum 9 years of experience in social media marketing, with a proven track record in executing successful campaigns and growing brand presence.</li>\n<li>Deep understanding of all major social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.) and their role in business development.</li>\n<li>Proficiency in social media management tools (e.g., Hootsuite, Sprout Social, Buffer) and analytics tools (e.g., Google Analytics, Socialbakers).</li>\n<li>Exceptional communication and leadership skills with the ability to inspire and guide a team.</li>\n<li>Strong creative acumen combined with strategic thinking capabilities.</li>\n<li>Expertise in paid social media strategies and advertising techniques.</li>\n<li>Ability to manage multiple projects efficiently under tight deadlines.</li>\n<li>Passion for digital innovation and staying up to date with evolving social media trends and technologies.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li>Email: careers@way.com</li>\n<li>Apply Now: https://waydot.greythr.com/hire/jobs/manager-social-media-marketing</li>\n</ul>\n<p><strong>Company Information</strong></p>\n<p>Way Dot Com (P) Ltd\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\nhttp://www.way.com</p>",
        "tags": [
            "9-12 Years",
            "Social Media Marketing",
            "Content Strategy",
            "Data Analytics"
        ],
        "summary": "Way.com is seeking a Social Media Marketing Manager to drive brand awareness and engagement across various platforms. This role involves strategic leadership, content creation, and data-driven optimization."
    },
    {
        "job_title": "Business & Sales Development Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22875",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>About Us</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, and recognized as the top Product in Insurance by UnitQ.</p>\n<p><strong>Job Overview</strong></p>\n<p>We are seeking a driven and results-oriented Business Development Executive to accelerate our market growth. In this role, you will identify new business opportunities, build and nurture strong client relationships, and close high-value deals that directly contribute to our revenue and market expansion.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Lead Generation – Source, engage, and qualify prospective clients through calls, personalized emails, and digital outreach.</li>\n<li>Sales Presentations – Craft and deliver persuasive proposals that highlight solutions and communicate clear value propositions.</li>\n<li>CRM Management – Accurately update and manage prospect data, monitor pipeline progress, and ensure timely follow-ups within the CRM.</li>\n<li>Target Achievement – Consistently achieve or exceed sales goals and KPIs to drive revenue growth.</li>\n<li>Relationship Management – Build and nurture long-term client relationships to encourage loyalty, repeat business, and high-value referrals.</li>\n<li>Reporting &amp; Analysis – Generate detailed sales reports and provide actionable insights to enhance performance.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Proven experience in B2B sales with a track record of consistently meeting or exceeding targets.</li>\n<li>3–5 years of sales experience; prior exposure to the e-commerce sector is a strong advantage.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong negotiation, persuasion, and relationship management capabilities.</li>\n<li>Self-motivated, goal-driven, and able to work independently with minimal supervision.</li>\n<li>Proficiency in CRM software (e.g., Zoho) and Microsoft Office Suite.</li>\n<li>Resilient and positive mindset with the ability to handle rejection and bounce back quickly.</li>\n<li>Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<p><strong>Why you will love working with us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Make a meaningful impact across a growing base of 10+ million users.</li>\n<li>Join a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact</strong>\ncareers@way.com</p>\n<p><strong>Apply Now</strong>\nhttps://waydot.greythr.com/hire/jobs/business-development-manager</p>",
        "tags": [
            "3-5 Years",
            "B2B Sales",
            "CRM Software",
            "Relationship Management"
        ],
        "summary": "Way.com is seeking a Business Development Executive to drive market growth through new business opportunities and strong client relationships. The role involves lead generation, sales presentations, and achieving sales targets."
    },
    {
        "job_title": "Business Executive - Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22874",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Business Operations Executive</h2>\n<p><strong>Way.com</strong> is looking for a detail-driven and proactive Business Operations Executive to ensure smooth, efficient, and high-quality operations in our Airport Parking division. </p>\n<p><strong>About Us</strong></p>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers — from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace 100 list of fastest-growing companies worldwide, and recognized as the #1 Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Role Overview</strong>\nYou will manage daily workflows, coordinate with internal teams, maintain vendor relationships, and resolve operational challenges to ensure seamless service delivery. If you excel in fast-paced environments, think strategically about operations, and are committed to delivering exceptional results, we’d love to have you on our team.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Operational Oversight – Oversee daily operations to ensure timely, efficient, and high-quality service delivery.</li>\n<li>Process Improvement – Identify gaps, streamline workflows, and escalate critical issues to minimize disruptions.</li>\n<li>Data Management &amp; Reporting – Maintain accurate records, trackers, and reports to enable data-driven decision-making.</li>\n<li>Cross-Functional Collaboration – Partner with internal teams to align operational processes with business objectives and drive efficiency.</li>\n<li>Vendor &amp; Stakeholder Management – Act as the primary point of contact for vendors and partners, ensuring SLA adherence, clear communication, and prompt issue resolution.</li>\n<li>Customer Experience – Deliver superior service standards, address operational needs swiftly, and ensure customer satisfaction.</li>\n<li>Adaptability &amp; Special Projects – Contribute to ad-hoc initiatives and remain flexible for evening, night, or weekend support as required.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Strong verbal and written communication skills with the ability to engage effectively across teams and stakeholders.</li>\n<li>Excellent organizational and multitasking capabilities, with proven ability to manage competing priorities.</li>\n<li>High attention to detail and a proactive, solution-oriented approach to problem-solving.</li>\n<li>Analytical mindset with the ability to interpret data and identify trends.</li>\n<li>Proficiency in Microsoft Excel (intermediate to advanced level) is mandatory.</li>\n<li>Collaborative team player who can also work independently when required.</li>\n<li>Willingness to work night shifts and weekends based on business needs.</li>\n<li>Adaptability and eagerness to learn in a dynamic, fast-paced environment.</li>\n<li>Prior experience in business operations or the automotive industry is an advantage, though not required.</li>\n</ul>\n<p><strong>Why you will love working with us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Chance to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong>\nEmail: careers@way.com</p>\n<p><strong>Apply Now:</strong>\nhttps://waydot.greythr.com/hire/jobs/business-operations-executive</p>",
        "tags": [
            "0-1 Years",
            "Business Operations",
            "Microsoft Excel",
            "Vendor Management"
        ],
        "summary": "Way.com is seeking a Business Operations Executive to oversee operations in their Airport Parking division. The role involves process improvement, vendor management, and ensuring excellent customer service."
    },
    {
        "job_title": "Content Specialist - QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22873",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Content QA Specialist</h2>\n<p><strong>Way.com</strong> is seeking a detail-oriented and quality-focused <strong>Content QA Specialist</strong> to serve as the final gatekeeper before content is published. This role ensures every blog, article, and landing page meets the highest standards of accuracy, originality, SEO performance, and brand consistency. The specialist will identify low-quality or AI-generated content, maintain compliance with Google’s EEAT principles (Experience, Expertise, Authoritativeness, Trustworthiness), and enhance overall content effectiveness.</p>\n<p><strong>About Us</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. </p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>Content Review &amp; Editorial Excellence</strong></li>\n<li>Review blogs, articles, and landing pages for grammar, clarity, tone, and alignment with brand voice.</li>\n<li>Correct factual errors, improve phrasing, and resolve formatting issues to maintain high editorial quality.</li>\n<li><strong>SEO &amp; Performance Optimization</strong></li>\n<li>Evaluate on-page SEO elements including meta tags, headers, internal linking, and keyword usage.</li>\n<li>Analyze content depth, relevance, and user value; flag material that lacks substance or actionable insights.</li>\n<li><strong>AI &amp; Plagiarism Detection</strong></li>\n<li>Identify AI-generated or low-quality content through manual assessment and automated tools.</li>\n<li>Perform plagiarism checks to ensure originality and protect brand credibility.</li>\n<li><strong>EEAT &amp; Credibility Assurance</strong></li>\n<li>Validate author credentials and verify sources, particularly for YMYL (Your Money or Your Life) topics.</li>\n<li>Ensure all content meets EEAT standards to enhance authority, expertise, and trustworthiness.</li>\n<li><strong>QA Process Enhancement</strong></li>\n<li>Maintain and refine QA checklists, processes, and best practices for consistent quality.</li>\n<li>Provide clear, constructive feedback to writers and editors to drive continuous improvement.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Minimum of <strong>2 years’ experience</strong> in content quality assurance, editing, or SEO.</li>\n<li>Exceptional manual editing skills with strong attention to detail.</li>\n<li>Solid understanding of SEO fundamentals and Google’s content quality guidelines.</li>\n<li>Ability to identify AI-generated content and assess it for human readability.</li>\n<li>Proficiency with tools such as Grammarly, Copyscape, Copyleaks, Originality.ai, or similar.</li>\n<li>Skilled at identifying low-value or thin content and providing actionable improvement recommendations.</li>\n<li>Comfortable working in a high-volume, fast-paced content production environment.</li>\n<li>Educational or professional background in journalism, digital marketing, or technical writing.</li>\n<li>Experience with content management systems such as WordPress.</li>\n<li>Familiarity with structured data, Yoast SEO plugin, and content scoring tools.</li>\n<li>Understanding of content compliance processes and fact-checking workflows.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us?</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/content-qa-specialist</li>\n</ul>\n<p><strong>Company Information</strong></p>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com</p>\n<p>Closing Date: 21, Aug 2025\nJob Published: 18, Aug 2025</p>",
        "tags": [
            "2+ Years",
            "SEO",
            "Content Quality Assurance",
            "Editing"
        ],
        "summary": "Way.com is looking for a Content QA Specialist to ensure content accuracy, originality, and SEO performance. The role involves reviewing content, identifying AI-generated material, and enhancing overall content effectiveness."
    },
    {
        "job_title": "Senior Engineer - QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22872",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p><strong>About Way.com</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. They provide services ranging from auto insurance and parking to EV charging and more. Way.com utilizes AI, machine learning, and advanced data analytics to deliver personalized solutions, aiming to make car ownership easier and more affordable.</p>\n<p><strong>Job Overview</strong></p>\n<p>Way.com is looking for an experienced Senior QA Automation Engineer with expertise in Java-based test automation. You will be responsible for designing and maintaining scalable automation frameworks, developing robust testing strategies, and collaborating with cross-functional teams to ensure quality throughout the software development lifecycle.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>Test Strategy &amp; Design:</strong> Translate business requirements into detailed test strategies and plans.</li>\n<li><strong>Automation Frameworks:</strong> Design, build, and enhance scalable automation frameworks using Core Java and modern testing tools.</li>\n<li><strong>Collaboration &amp; Quality Ownership:</strong> Work with developers, product managers, and QA teams to embed quality.</li>\n<li><strong>Functional &amp; E2E Testing:</strong> Perform functional and end-to-end testing to validate accuracy, performance, and user experience.</li>\n<li><strong>Automation Execution:</strong> Develop and execute automated test scripts for web and API testing with Selenium WebDriver and Rest Assured.</li>\n<li><strong>CI/CD Enablement:</strong> Integrate test automation into CI/CD pipelines (e.g., Jenkins).</li>\n<li><strong>Issue Resolution:</strong> Monitor, troubleshoot, and resolve automation failures.</li>\n<li><strong>Documentation &amp; Standards:</strong> Create and maintain reusable test cases and documentation.</li>\n<li><strong>Defect Tracking:</strong> Record, track, and collaborate on defect resolution.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>5+ years of experience in test automation using Java.</li>\n<li>Strong knowledge of Core Java.</li>\n<li>Proficiency in Java Collections.</li>\n<li>Hands-on experience with Selenium WebDriver.</li>\n<li>Proficiency in REST API testing using Rest Assured.</li>\n<li>Experience with Jenkins or similar CI/CD tools.</li>\n<li>Familiarity with load and performance testing tools.</li>\n<li>Strong attention to detail and problem-solving skills.</li>\n</ul>\n<p><strong>Why Work at Way.com?</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Job Details</strong></p>\n<ul>\n<li><strong>Job Title:</strong> Senior QA Automation Engineer</li>\n<li><strong>Experience Required:</strong> 5–8 years</li>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n<li><strong>Closing Date:</strong> 21, Aug 2025</li>\n<li><strong>Date Published:</strong> 18, Aug 2025</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-qa-engineer</li>\n</ul>\n<p><strong>Company Address</strong></p>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Way.com is hiring a Senior QA Automation Engineer to design and maintain automation frameworks. This role involves ensuring quality throughout the software development lifecycle."
    },
    {
        "job_title": "Tech Lead - iOS",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22870",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>iOS Technical Lead</h2>\n<p><strong>About Way.com</strong>\nWay.com is America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. </p>\n<p><strong>Job Title:</strong> iOS Technical Lead</p>\n<p><strong>Experience Required:</strong> 10–15 years</p>\n<p><strong>Work Arrangement:</strong> On-site</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview</strong>\nWe are seeking a seasoned iOS Technical Lead with proven expertise in Swift to lead the full iOS application development lifecycle. You will be responsible for architecting scalable, high-performance mobile solutions, mentoring the development team, and ensuring our products deliver exceptional user experiences.</p>\n<p><strong>Key Responsibilities</strong>\n- <strong>iOS Development Leadership:</strong> Lead end-to-end app development with Swift, delivering scalable, efficient, and high-quality solutions.\n- <strong>Cross-Functional Collaboration:</strong> Partner with Product Managers and Designers to transform requirements into seamless, user-friendly mobile experiences.\n- <strong>Performance Optimization:</strong> Improve app responsiveness, stability, and performance across multiple iOS devices and OS versions.\n- <strong>Mentorship &amp; Code Quality:</strong> Conduct code reviews, enforce best coding standards, and mentor junior developers to elevate overall team output.\n- <strong>Testing &amp; Documentation:</strong> Ensure app reliability through thorough unit testing, clear documentation, and adherence to clean architecture practices.\n- <strong>Backend &amp; API Integration:</strong> Work with backend teams to enable secure, efficient, and smooth API integrations.\n- <strong>Innovation &amp; Improvement:</strong> Drive adoption of new tools, processes, and best practices to accelerate development and improve quality.\n- <strong>Feature Ownership:</strong> Take complete ownership of features from design to deployment, including post-release monitoring and optimization.\n- <strong>Continuous Learning:</strong> Keep pace with evolving iOS technologies to deliver modern, future-ready solutions.</p>\n<p><strong>Preferred Skills</strong>\n- 10+ years of mobile app development experience, including 6+ years in iOS development.\n- Deep expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.\n- Strong understanding of RESTful APIs, JSON parsing, and third-party library integration.\n- Skilled in architecting complex mobile apps using modular design patterns such as MVVM, MVI, or MVP.\n- Proficient in CI/CD workflows, automated testing, code review processes, and App Store deployments.\n- Demonstrated leadership in team management and mentoring iOS developers.\n- Experience with tools like Firebase, Mixpanel, or equivalent analytics/crash reporting platforms.\n- Solid understanding of web application ecosystems and cross-platform compatibility challenges.</p>\n<p><strong>Nice to Have:</strong>\n- Hands-on experience with Core Bluetooth, Core Location, or real-time service integrations (e.g., EV charging or roadside assistance).\n- Background in mobility, transportation, or automotive technology platforms.\n- Familiarity with Kotlin Multiplatform or other cross-platform development frameworks.</p>\n<p><strong>Why you will love working with us?</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Opportunity to make a meaningful impact across 10+ million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth in a rapidly scaling technology company.\n- Competitive compensation.</p>\n<p><strong>Contact Information</strong>\ncareers@way.com</p>\n<p><strong>Apply Now:</strong>\nhttps://waydot.greythr.com/hire/jobs/ios-technical-lead</p>",
        "tags": [
            "10+ Years",
            "Swift",
            "iOS Development",
            "RESTful APIs"
        ],
        "summary": "Way.com is seeking a seasoned iOS Technical Lead to lead the full iOS application development lifecycle. The role involves architecting scalable mobile solutions and mentoring the development team."
    },
    {
        "job_title": "Accountant (Exp: Tally ERP)",
        "company": "Minerva Special Purpose Vehicle (P) Ltd",
        "url": "https://technopark.org/job-details/22868",
        "location": "Technopark",
        "closing_date": "14 Sep 2025",
        "job_description": "<h2>Accountant</h2>\n<p><strong>MINERVA SPECIAL PURPOSE VEHICLE (P) Ltd</strong>\n5TH FLOOR, DHANASHRI, SOFTWARE TECHNOLOGY PARKS OF INDIA, TECHNOPARK, THIRUVANANTHAPURAM, 695581\n<a href=\"https://www.mspv.in\">https://www.mspv.in</a></p>\n<p><strong>Closing Date:</strong> 14, Sept 2025\n<strong>Job Published:</strong> 18, Aug 2025\n<strong>Contact Email:</strong> <a href=\"mailto:jeny@tattvatvm.com\">jeny@tattvatvm.com</a></p>\n<p><strong>Brief Description:</strong></p>\n<p>The candidate should be a graduate in BCom/MCom with a minimum of 3 years of experience in Accounting using Tally ERP. A minimum of 3 years of experience in Tally is mandatory. He/She should be proficient in:</p>\n<ul>\n<li>MS Excel</li>\n<li>Tax Management</li>\n<li>Payroll Management</li>\n<li>Accounts Reconciliation</li>\n<li>GST Filing</li>\n<li>Book Keeping</li>\n<li>Preparation of Financial Statements etc.</li>\n</ul>\n<p>complying with the relevant rules and regulations.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Tally ERP (Mandatory)</li>\n<li>MS Excel</li>\n<li>MS Word</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Tally ERP",
            "MS Excel",
            "GST Filing"
        ],
        "summary": "Looking for an Accountant with 3+ years of experience and proficiency in Tally ERP. Responsibilities include tax, payroll management, and financial statement preparation."
    },
    {
        "job_title": "Senior DotNet Lead",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22867",
        "location": "Technopark",
        "closing_date": "22 Aug 2025",
        "job_description": "<h2>Senior .Net Lead</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a Senior .Net Lead with 12+ years of experience.</p>\n<p><strong>Contact:</strong>\nCareers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 22, Aug 2025\n<strong>Job Published:</strong> 17, Aug 2025</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, enhance, document, and maintain application features in .Net Core 5/6+, C#, /REST API/T-SQL and AngularJS/React JS</li>\n<li>Application Support &amp; API Integrations with third party solutions/services</li>\n<li>Extensive experience in building Webservice (SOAP ) RESTful APIs</li>\n<li>Understand technical project priorities, implementation dependencies, risks, and issues</li>\n<li>Participate and develop code as part of a unified development group, working the whole technological stack</li>\n<li>Identify, prioritize, and execute tasks in the software development life cycle</li>\n<li>Work with the team to define, design, and deliver on new features</li>\n<li>Broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum model, Jira models.</li>\n<li>Effective communication skill, technical documentation, leadership, and ownership quality</li>\n<li>Production Support (L2,L3)</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>10+ years of development experience in C#, .Net technologies, SQL server - Stored procedures</li>\n<li>Expertise in C#, .Net, Entity framework, EF core, Microservices, SOA, ASP.NET Web Forms (Classic), SOAP-based Web Services, Multithreading &amp; Asynchronous Programming, Windows Services</li>\n<li>Ability to lead, inspire, and motivate teams through effective communication and established credibility</li>\n<li>Guide team to write reusable, testable, performant, and efficient code</li>\n<li>Proficient in writing Unit Test Cases using X-Unit, MS-Test</li>\n<li>Build standards-based frameworks and libraries to support a large-scale application</li>\n<li>Expertise in RDBMS including MS SQL Server with thorough knowledge in writing SQL queries, Stored Procedures, Views, Functions, Packages, Cursors &amp; tables and objects types.</li>\n<li>Experience in large-scale software development.</li>\n<li>Prior experience in Application Support &amp; API Integrations</li>\n<li>Knowledge of architectural styles and design patterns, experience in designing solutions</li>\n<li>Strong debugging and problem-solving skills</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Good knowledge of JavaScript, React JS, jQuery, Angular, and other front-end technologies</li>\n<li>API Management - APIM</li>\n<li>Expertise in Microsoft Azure Cloud Services, Azure DevOps, Application Insights, Azure Monitoring, KeyVault, and SQL Azure.</li>\n<li>Azure DevOps - CI/CD pipelines (classic / YAML)</li>\n<li>Hands-on experience in building and deploying applications by adopting Azure DevOps practices such as Continuous Integration (CI) and Continuous Deployment (CD) in runtime with Git, Docker, Kubernetes and managing Azure Cloud Services.</li>\n<li>Azure Container Apps/Docker /Azure Container Registry</li>\n<li>Azure Messaging services - Service Bus or Event Grid, Event hub</li>\n<li>Azure Storage Account - Blobs, Tables, Queue etc</li>\n<li>Azure Function / Durable Functions</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please Note:</strong> Reflections Info Systems does not ask for fees for job applications. Be cautious of fraudulent job offers. Contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "12+ Years",
            ".Net Core",
            "SQL Server",
            "Azure DevOps"
        ],
        "summary": "Reflections Info Systems is looking for a Senior .Net Lead to develop and maintain application features using .Net technologies. The role involves application support, API integrations, and leading a development team."
    },
    {
        "job_title": "Front End Developer (Angular)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22866",
        "location": "Technopark",
        "closing_date": "22 Aug 2025",
        "job_description": "<h2>Front End Developer (Angular)</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 22, Aug 2025\n<strong>Job Published:</strong> 17, Aug 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are looking for 5+ years experienced candidates for this role.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop, test, and maintain high-quality web applications using Angular (version 16+).</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Ensure the technical feasibility of UI/UX designs.</li>\n<li>Participate in code reviews, providing constructive feedback to peers.</li>\n<li>Troubleshoot and debug applications, ensuring optimal performance.</li>\n<li>Stay up-to-date with emerging trends and technologies in front-end development.</li>\n<li>Mentor and guide junior developers, fostering a collaborative and productive work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Minimum of 5 years of professional experience in front-end development.</li>\n<li>Strong proficiency in Angular (version 16+) and related technologies.</li>\n<li>Experience with state management libraries like NgRx.</li>\n<li>Proficient in HTML5, CSS3, and JavaScript/TypeScript.</li>\n<li>Familiarity with build tools and task runners (e.g., Angular CLI, Webpack).</li>\n<li>Experience with responsive and adaptive design principles.</li>\n<li>Knowledge of RESTful APIs and integration with front-end applications.</li>\n<li>Familiarity with testing frameworks and tools (e.g., Jasmine, Karma).</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Excellent communication and teamwork abilities.</li>\n<li>Experience with UI frameworks such as Clarity Design and Bootstrap.</li>\n<li>Familiarity with Redux DevTools Extension and development tools.</li>\n<li>Knowledge of additional libraries and tools (e.g., NgBootstrap, NgSelect, ngx-toastr).</li>\n<li>Experience with build and CI/CD tools (e.g., Jenkins, Git).</li>\n<li>Understanding of Agile/Scrum development methodologies.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Knowledge in Laravel</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers and contact careers@reflectionsinfos.com for any clarifications.</p>",
        "tags": [
            "5+ Years",
            "Angular",
            "JavaScript/TypeScript",
            "HTML5/CSS3"
        ],
        "summary": "Reflections Info Systems is seeking a Front End Developer with 5+ years of experience to develop web applications using Angular. The role involves collaborating with cross-functional teams and mentoring junior developers."
    },
    {
        "job_title": "SAP BW Consultant",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22865",
        "location": "Technopark",
        "closing_date": "22 Aug 2025",
        "job_description": "<h2>SAP BW Consultant</h2>\n<p>Reflections Info Systems (P) Ltd is seeking an experienced SAP BW Consultant to join our team.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Understand existing design and implementation BW data models (InfoProviders, DSO/ADSOs, CompositeProviders, MultiProviders, InfoCubes)</li>\n<li>Document BW transformation rules, BEX formulas and maintain documentation</li>\n<li>Work with standard and custom ECC extractors (e.g., extractors 2LIS<em>, 0FI</em>, 0CO*).</li>\n<li>Debug and troubleshoot data extraction and load issues.</li>\n<li>Document ABAP routines in BW transformations</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>7+ years of hands-on SAP BW development and support experience.</li>\n<li>Proficiency in SAP ABAP skills</li>\n<li>Proven experience with ECC extractors (standard &amp; custom) across SD, MM, FI, CO modules.</li>\n<li>Strong understanding of SAP data dictionary objects, modules, and integration with other SAP modules.</li>\n<li>Strong knowledge of data extraction, transformation, and loading (ETL) processes.</li>\n<li>Experience with Process Chain, scheduling and monitoring</li>\n<li>Good analytical and problem-solving skills, with attention to detail.</li>\n<li>Effective communication and interpersonal skills to collaborate with cross-functional teams.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n<li>SAP certification or relevant SAP certifications are desirable but not mandatory.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Fraud Alert:</strong></p>\n<p>Please note that Reflections Info Systems never seeks payment for jobs. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. Contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>\n<p><strong>Company Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p>Closing Date: 22, Aug 2025\nJob Published: 17, Aug 2025</p>",
        "tags": [
            "7+ Years",
            "SAP BW",
            "ABAP",
            "ECC Extractors"
        ],
        "summary": "Seeking an SAP BW Consultant with 7+ years of experience in SAP BW development, ABAP, and ECC extractors. Responsibilities include designing, developing, and implementing SAP BW solutions and BI reporting."
    },
    {
        "job_title": "Customer Relationship Executive",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22864",
        "location": "Technopark",
        "closing_date": "16 Sep 2025",
        "job_description": "<h2>Customer Relationship Executive</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA , 695581\nhttps://www.kenland.in</p>\n<p><strong>Closing Date:</strong> 16, Sept 2025\n<strong>Job Published:</strong> 16, Aug 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p>We're seeking an experienced Customer Relationship Executive with a minimum of 1 year of expertise to join our team. As a Customer Relationship Executive, you'll be instrumental in ensuring customer satisfaction and handling inquiries with finesse.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Respond promptly and professionally to customer queries via phone, email, and live chat.</li>\n<li>Provide accurate information about our products or services, guiding customers through our platforms.</li>\n<li>Resolve customer issues efficiently, ensuring a positive resolution.</li>\n<li>Collaborate with internal teams to escalate and address complex problems, prioritizing customer satisfaction.</li>\n<li>Stay updated on product knowledge to effectively assist customers.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Minimum of 1 year of experience in customer support roles.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong problem-solving skills with a customer-centric approach.</li>\n<li>Ability to collaborate within a team and coordinate with other departments.</li>\n<li>Familiarity with Google Business tools.</li>\n<li>Proficiency in English and Malayalam; Tamil language skills are a plus.</li>\n<li>Proactive attitude and adaptability in a fast-paced environment.</li>\n</ul>\n<p>If you possess these qualifications and are passionate about delivering outstanding customer service, we invite you to apply for this position.</p>\n<p><strong>Preferred Skills:</strong>\nCommunication skills</p>\n<p><strong>Languages:</strong> English, Malayalam, Tamil</p>",
        "tags": [
            "1+ Years",
            "Customer Support",
            "Communication Skills",
            "Google Business Tools"
        ],
        "summary": "Kenland IT Solutions is seeking a Customer Relationship Executive. This role involves ensuring customer satisfaction through prompt support and effective problem-solving."
    },
    {
        "job_title": "Senior Dot Net Developer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22863",
        "location": "Technopark",
        "closing_date": "16 Sep 2025",
        "job_description": "<h2>Senior .Net Developer</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA , 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 16, Sept 2025\n<strong>Job Published:</strong> 16, Aug 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p>We are seeking a skilled and experienced Project Lead with expertise in .NET Core to lead and manage the development of complex software projects. The ideal candidate will have strong technical knowledge, leadership skills, and experience in delivering high-quality solutions while managing a team effectively.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the design, development, and deployment of applications using .NET Core and related technologies.</li>\n<li>Collaborate with stakeholders to gather and analyze requirements, ensuring alignment with project goals.</li>\n<li>Provide technical leadership and mentorship to the development team.</li>\n<li>Oversee project planning, scheduling, and execution to ensure timely delivery of milestones.</li>\n<li>Review code to ensure adherence to coding standards and best practices.</li>\n<li>Troubleshoot and resolve technical issues during the development lifecycle.</li>\n<li>Coordinate with cross-functional teams, including QA, DevOps, and Product Management.</li>\n<li>Monitor project risks and implement mitigation strategies.</li>\n<li>Prepare and present progress reports to senior management and stakeholders.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science, Engineering, or a related field.</li>\n<li>5+ years of experience in software development, with at least 3+ years in .NET Core.</li>\n<li>Strong proficiency in C#, ASP.NET Core, Entity Framework, and RESTful APIs.</li>\n<li>Hands-on experience with cloud platforms like Azure or AWS.</li>\n<li>Familiarity with front-end technologies like Angular, React, or Vue.js is a plus.</li>\n<li>Experience in microservices architecture and containerization (e.g., Docker, Kubernetes).</li>\n<li>Proven ability to manage a team and deliver projects on time.</li>\n</ul>",
        "tags": [
            "5+ Years",
            ".NET Core",
            "C#",
            "RESTful APIs"
        ],
        "summary": "Seeking a Senior .Net Developer to lead the development of complex projects. Requires expertise in .NET Core and related technologies, along with strong leadership skills."
    },
    {
        "job_title": "Junior Dot Net Developer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22862",
        "location": "Technopark",
        "closing_date": "16 Sep 2025",
        "job_description": "<h2>Junior .Net Developer</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 16, Sept 2025\n<strong>Job Published:</strong> 16, Aug 2025\n<strong>Contact Email:</strong> <a href=\"mailto:recruiter@kenland.in\">recruiter@kenland.in</a></p>\n<p><strong>Brief Description:</strong>\nWe are seeking a junior ASP.NET Developer with 1-2 years of experience to join our development team. The ideal candidate will be responsible for designing, developing, and maintaining web applications using ASP.NET MVC and .Net Core.</p>\n<p><strong>Responsibilities:</strong>\n- Develop, test, and deploy ASP.NET MVC applications.\n- Collaborate with cross-functional teams to define and implement new features.\n- Debug and resolve software issues to ensure optimal performance.\n- Participate in code reviews and follow best coding practices.\n- Maintain and improve existing applications, identifying areas for optimization.\n- Stay updated with the latest technologies and ASP.NET best practices.\n- Document code and technical designs for future reference.\n- Provide basic technical support and troubleshooting for applications in production.</p>\n<p><strong>Preferred Skills:</strong>\n- Bachelor’s degree in Computer Science, Information Technology, or a related field.\n- Strong knowledge of C# programming language.\n- Experience in software development, with .NET Core.\n- Familiarity with HTML, CSS, JavaScript, and jQuery.\n- Basic experience with front-end frameworks like Bootstrap.\n- Understanding of relational databases, Entity Framework, and ORM tools (Dapper).\n- Knowledge of version control systems like Git.\n- Good problem-solving skills and attention to detail.\n- Ability to work effectively in a collaborative team environment.\n- A positive attitude, willingness to learn, and adaptability to project requirements.\n- Basic understanding of object-oriented programming (OOP) principles.\n- Experience in writing SQL queries and working with relational databases.\n- Exposure to RESTful APIs and Web Services.\n- Understanding of Agile methodologies.\n- Knowledge of cloud platforms like Azure.</p>",
        "tags": [
            "1-2 Years",
            ".NET Core",
            "C#",
            "ASP.NET MVC"
        ],
        "summary": "Kenland IT Solutions is seeking a Junior ASP.NET Developer to design, develop, and maintain web applications. The role requires experience with .NET Core, C#, and ASP.NET MVC."
    },
    {
        "job_title": "Flutter Developer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22861",
        "location": "Technopark",
        "closing_date": "16 Sep 2025",
        "job_description": "<h2>Flutter Developer</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA, 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 16, Sept 2025\n<strong>Job Published:</strong> 16, Aug 2025\n<strong>Contact Email:</strong> <a href=\"mailto:recruiter@kenland.in\">recruiter@kenland.in</a></p>\n<p><strong>Role Overview:</strong></p>\n<p>We are seeking a skilled Flutter Developer with a strong background in mobile application development to join our dynamic team. The ideal candidate will be passionate about building seamless and high-performance apps for both Android and iOS platforms, using Flutter and Dart.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, test, and deploy high-quality mobile applications using Flutter.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Maintain and improve the codebase for scalability, reliability, and performance.</li>\n<li>Implement third-party APIs and ensure smooth integration with back-end services.</li>\n<li>Debug and resolve application issues, ensuring optimal performance.</li>\n<li>Stay updated with emerging technologies and industry trends.</li>\n<li>Participate in code reviews to maintain quality and consistency.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li><strong>Experience:</strong> 2 years in Flutter and Dart.</li>\n<li>Proficiency in building cross-platform apps with robust UI/UX.</li>\n<li>Solid understanding of the mobile development lifecycle.</li>\n<li>Familiarity with RESTful APIs and third-party libraries.</li>\n<li>Strong knowledge of Git or other version control tools.</li>\n<li>Experience with native mobile development (Android/iOS) is a plus.</li>\n<li>Problem-solving skills with attention to detail.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Flutter",
            "Dart",
            "RESTful APIs"
        ],
        "summary": "We are looking for a skilled Flutter Developer to build high-performance mobile applications. The candidate will collaborate with cross-functional teams and implement third-party APIs."
    },
    {
        "job_title": "Operations Executive",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22860",
        "location": "Technopark",
        "closing_date": "16 Sep 2025",
        "job_description": "<h2>Operations Executive</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA, 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 16, Sept 2025\n<strong>Job Published:</strong> 16, Aug 2025\n<strong>Contact Email:</strong> <a href=\"mailto:recruiter@kenland.in\">recruiter@kenland.in</a></p>\n<p>We are seeking a proactive and technically skilled Operations Executive with a strong background in Techno Commercial operations. The ideal candidate will play a key role in managing operations, client coordination, and external meetings. This role requires someone who can bridge technical knowledge and ensure smooth execution of project activities.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Coordinate and manage external meetings, techno commercial operations.</li>\n<li>Represent the company in discussions related to ongoing and upcoming projects.</li>\n<li>Prepare and maintain project documentation, client reports, and presentations.</li>\n<li>Ensure smooth communication flow between clients and internal departments.</li>\n<li>Attend site visits, client meetings, and official events as needed.</li>\n<li>Maintain strong professional relationships with clients and stakeholders.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 3+ years of experience in IT operations or client-handling roles.</li>\n<li>Bachelor’s degree in Engineering (B.Tech preferred)/ PG in Engineering.</li>\n<li>Strong interpersonal, coordination, and communication skills.</li>\n<li>Good understanding of IT services, technical concepts, and project workflows.</li>\n<li>Need to have knowledge in required tools.</li>\n<li>Ability to manage multiple responsibilities and meet deadlines.</li>\n<li>Willingness to travel for meetings and client visits.</li>\n</ul>\n<p><strong>Preferred Attributes:</strong></p>\n<ul>\n<li>Experience in handling business coordination in an IT or tech-based organization.</li>\n<li>Ability to handle both technical and operational tasks efficiently.</li>\n<li>Confident in representing the organization in professional settings.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "IT Operations",
            "Client Coordination",
            "Project Management"
        ],
        "summary": "Kenland IT Solutions is seeking an Operations Executive to manage operations and client coordination. The role involves techno-commercial operations, project documentation, and maintaining client relationships."
    },
    {
        "job_title": "Junior Company Secretary",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22859",
        "location": "Technopark",
        "closing_date": "16 Sep 2025",
        "job_description": "<h2>Junior Company Secretary</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA , 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 16, Sept 2025\n<strong>Job Published:</strong> 16, Aug 2025\n<strong>Contact Email:</strong> <a href=\"mailto:recruiter@kenland.in\">recruiter@kenland.in</a></p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a qualified and motivated Junior Company Secretary to join our team. The ideal candidate must be a member of ICSI with at least 1 year of experience in handling company secretarial and compliance functions.</p>\n<p><strong>Experience:</strong> Minimum 1 Year\n<strong>Qualification:</strong> Qualified Company Secretary (CS) with valid ICSI Membership\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Assist in ensuring compliance with the Companies Act, SEBI regulations, and other applicable laws.</li>\n<li>Support in drafting notices, agendas, and minutes for Board and General Meetings.</li>\n<li>Help maintain statutory registers and filing of forms with MCA/ROC.</li>\n<li>Coordinate with auditors, legal advisors, and regulatory authorities.</li>\n<li>Support senior management in corporate governance and compliance matters.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Qualified Company Secretary with valid ICSI membership.</li>\n<li>Minimum 1 year of experience in a company secretarial/compliance role.</li>\n<li>Basic understanding of corporate laws, secretarial standards, and statutory filings.</li>\n<li>Good communication and documentation skills.</li>\n<li>Ability to handle compliance tasks with attention to detail.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Companies Act",
            "SEBI Regulations",
            "ICSI Membership"
        ],
        "summary": "Kenland IT Solutions is looking for a Junior Company Secretary. The role involves ensuring compliance and supporting corporate governance with at least one year of experience."
    },
    {
        "job_title": "Graphic Designer",
        "company": "Richinnovations Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22857",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Graphic Designer</h2>\n<p>Richinnovations Technologies is seeking Graphic Design freshers to assist our existing team.</p>\n<p><strong>Contact Information:</strong> hr@richinnovationsplc.com</p>\n<p><strong>Location:</strong>\nRichinnovations Technologies (P) Ltd\nKSUM, Ground floor, Tejaswini Building, Technopark,\nKazhakuttom, Trivandrum, Kerala, India, 695581\nhttps://www.richinnovationsplc.com</p>\n<p><strong>Job Details:</strong></p>\n<ul>\n<li><strong>Role:</strong> Graphic Designer</li>\n<li><strong>Number of Openings:</strong> 2</li>\n<li><strong>Work Location:</strong> Trivandrum Technopark</li>\n<li><strong>Job Mode:</strong> Hybrid</li>\n</ul>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Graphic Designing (posters and motion graphics)</li>\n<li>Info-graphic video designing</li>\n<li>Video editing</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Color sense</li>\n<li>Thinking capacity</li>\n<li>Fair in language (English &amp; Malayalam)</li>\n<li>Knowledge in multimedia tools and reel editing apps.</li>\n</ul>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 16, Aug 2025</p>",
        "tags": [
            "Fresher",
            "Graphic Designing",
            "Video Editing",
            "Multimedia Tools"
        ],
        "summary": "Richinnovations Technologies is hiring Graphic Design freshers to support team activities. Key skills include graphic and video design, plus familiarity with multimedia tools."
    },
    {
        "job_title": "Experienced Presentation Designers and Brand Designers",
        "company": "Techband Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22856",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Presentation &amp; Brand Designers</h2>\n<p><strong>Techband Technologies (P) Ltd</strong> is seeking experienced Presentation Designers and Brand Designers to join their team.</p>\n<p><strong>Location:</strong> SBC-19, Floor (-2), Thejeswini, Technopark, Trivandrum, Kerala, India 695581\n<strong>Websites:</strong> www.corpozone.com, www.techband.net</p>\n<p><strong>Contact Email:</strong> ancil.nixon@visualspiders.com</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 16, Aug 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking dynamic and skilled Graphic Designers &amp; Presentation Designers to join our team, specializing in crafting compelling presentations and diverse multimedia assets across various platforms. Even freshers who believe they can handle the responsibilities with enthusiasm are encouraged to apply.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop visually stunning and impactful presentations using Advanced PowerPoint skills and Google Slides.</li>\n<li>Create engaging booklets, marketing collaterals, web designs, UI/UX mockups, social media posts, and short promotional videos.</li>\n<li>Collaborate closely with teams to understand project requirements and deliver high-quality design solutions.</li>\n<li>Communicate effectively with clients to comprehensively understand their design requirements and provide expert design consultations based on a deep understanding of their needs.</li>\n<li>Review projects and offer clear, constructive direction to junior designers, ensuring their work aligns with project objectives and maintains high-quality standards.</li>\n<li>Collaborate closely with internal teams and stakeholders to gather feedback, iterate designs, and ensure the final deliverables exceed expectations.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Advanced proficiency in PowerPoint, Google Slides, Photoshop, Illustrator, InDesign</li>\n<li>Expertise in Figma, Canva, Premier/After Effects, or any Video editing software will be considered as a bonus</li>\n<li>Strong portfolio demonstrating expertise in presentation design and multimedia content creation.</li>\n<li>Ability to multitask, prioritize projects, and meet deadlines in a fast-paced environment.</li>\n<li>Excellent communication skills and a collaborative mindset.</li>\n</ul>",
        "tags": [
            "Entry Level",
            "PowerPoint",
            "Photoshop",
            "Google Slides"
        ],
        "summary": "Techband Technologies is hiring Presentation Designers to create presentations and multimedia assets. The role involves collaborating with teams, communicating with clients, and offering design direction."
    }
]