[
    {
        "job_title": "Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21779/312",
        "location": "Infopark",
        "closing_date": "26 Jan 2026",
        "job_description": "<p><strong>Business Analyst</strong></p>\n<p>The Business Analyst plays a key role in ensuring requirements are clearly understood, accurately documented, and traceable throughout the software development lifecycle. This role focuses on translating business and functional inputs into structured, standardized documentation that supports effective development, testing, and delivery. Working closely with business analysts, design teams, and technical stakeholders, the role ensures consistency, clarity, and alignment across all requirement artifacts.</p>\n<p><strong>Key Responsibilities</strong>\n- Create Software Requirement Specifications (SRS) based on inputs from Core Business Analysts, stakeholder discussions, and requirement walkthroughs\n- Prepare Business Requirement Documents (BRD) using approved templates while ensuring business intent and system behavior are clearly documented\n- Participate in requirement discussions to understand business objectives, functional flows, dependencies, and assumptions before documentation\n- Analyze requirements to identify gaps, ambiguities, and inconsistencies, and work with Core BAs to resolve them\n- Document functional flows, business rules, and acceptance criteria where applicable to support development and QA teams\n- Document wireframes, UI flows, validations, and UI specifications in collaboration with design and product teams\n- Maintain change logs, version history, and document updates throughout the project lifecycle\n- Create and manage traceability matrices linking business, functional, and technical requirements\n- Maintain cross-references across BRD, SRS, UI, API, and related documentation\n- Ensure documentation consistency, completeness, and alignment with approved scope and delivery timelines\n- Ensure accurate and timely PMS updates with structured documentation details\n- Support development, QA, UAT, and audit processes through clear, traceable, and up-to-date documentation\n- Assist in requirement reviews, walkthroughs, and validation sessions with internal and client stakeholders</p>\n<p><strong>Requirements</strong>\n<strong>Required Skills and Experience</strong>\n- 1 to 4 years of experience in Business Analysis documentation or related roles\n- Strong experience in BRD and SRS creation\n- Hands-on experience with documentation templates, standards, and version control\n- Ability to document UI wireframes and functional flows clearly\n- Working knowledge of APIs and system integrations for documentation purposes\n- Experience with project management systems and documentation tools\n- Strong attention to detail and ability to manage multiple documents in parallel\n- Excellent written communication and stakeholder coordination skills</p>\n<p><strong>Minimum Qualifications</strong>\n- Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field\n- 1 to 4 years of experience as a Business Analyst or Product Analyst</p>\n<p><strong>Benefits</strong>\n- A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "1-4 Years",
            "BRD/SRS Documentation",
            "API Documentation",
            "Project Management Tools"
        ],
        "summary": "Translates business needs into structured documentation for software development. Ensures clarity, traceability, and alignment across requirements for development, QA, and stakeholder validation."
    },
    {
        "job_title": "Business Development Executive (BDE)",
        "company": "Merabt Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21776/396",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Business Development Executive (BDE)</strong></p>\n<p>We are seeking an enthusiastic and goal-oriented <strong>Business Development Executive (BDE)</strong> to join our IT sales team. The ideal candidate should have a basic to good understanding of IT services and a strong interest in sales, client interaction, and business growth. This role is ideal for <strong>freshers or early professionals</strong> aiming to build a career in IT sales and business development.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and generate new business opportunities through calls, emails, social media, and meetings</li>\n<li>Understand client requirements and propose suitable IT solutions</li>\n<li>Promote and sell services including:</li>\n<li>Website Development</li>\n<li>Mobile App Development</li>\n<li>Digital Marketing Services (SEO, SMM, PPC, etc.)</li>\n<li>ERP &amp; CRM Solutions</li>\n<li>Messaging &amp; Automation Services</li>\n<li>Build and maintain strong relationships with clients</li>\n<li>Prepare proposals, quotations, and presentations</li>\n<li>Follow up with leads and convert them into customers</li>\n<li>Coordinate with technical and marketing teams for project execution</li>\n<li>Achieve assigned sales targets and KPIs</li>\n</ul>\n<h3>Required Skills &amp; Knowledge</h3>\n<ul>\n<li>Basic knowledge of IT services such as:</li>\n<li>Web &amp; Mobile App Development</li>\n<li>Digital Marketing</li>\n<li>ERP / CRM Solutions</li>\n<li>Good communication and negotiation skills</li>\n<li>Ability to understand customer needs and explain technical solutions in a simple manner</li>\n<li>Strong convincing and follow-up skills</li>\n<li>Self-motivated with a positive attitude</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Any graduate (MBA / BBA / B.Com / B.Tech or related fields preferred)</li>\n<li><strong>0–2 years of experience</strong> in IT sales, digital marketing sales, or software sales (experience is an added advantage)</li>\n<li>Freshers with a strong interest in IT sales are welcome to apply</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Attractive salary + performance-based incentives</li>\n<li>Sales training and career growth opportunities</li>\n<li>Friendly and professional work environment</li>\n<li>Exposure to multiple IT domains and enterprise clients</li>\n</ul>\n<h3>Location</h3>\n<p>Trivandrum / Kochi</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@merabt.com</strong>.</p>",
        "tags": [
            "0-2 Years",
            "IT Sales",
            "Digital Marketing",
            "ERP/CRM Solutions"
        ],
        "summary": "Seeking a BDE to drive IT sales, build client relationships, and promote digital solutions. Ideal for freshers or early professionals with 0-2 years of sales experience."
    },
    {
        "job_title": "Cloud Engineer",
        "company": "Nymbl",
        "url": "https://infopark.in/company-jobs/details/21777/323",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Experience:</strong> 2-4 years</p>\n<p>We are seeking a highly skilled <strong>Cloud Engineer</strong> with strong experience in CI/CD automation and hands-on expertise in <strong>Jenkins</strong>. The role involves managing cloud infrastructure, automating deployments, supporting DevOps workflows, and ensuring reliability, security, and scalability across environments. The ideal candidate will have experience working with development and operations teams, implementing pipelines, and supporting cloud-hosted applications.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, implement, and maintain CI/CD pipelines using <strong>Jenkins</strong></li>\n<li>Manage and support cloud infrastructure across <strong>Dev/Test/Prod</strong> environments</li>\n<li>Automate build, deployment, and release processes</li>\n<li>Integrate CI/CD workflows with <strong>Git/Repositories/Artifact Management</strong></li>\n<li>Troubleshoot pipeline failures and deployment issues</li>\n<li>Support containerized or VM-based deployments (as applicable to environment)</li>\n<li>Monitor system performance, availability, and capacity</li>\n<li>Work closely with development, QA, and operations teams</li>\n</ul>\n<h3>Mandatory Skills</h3>\n<ul>\n<li>Strong hands-on experience with <strong>Jenkins</strong> (Pipeline, Jobs, Plugins, Agents)</li>\n<li>Practical understanding of CI/CD concepts and deployment automation</li>\n<li>Experience working on cloud platforms (<strong>OCI/Azure</strong>)</li>\n<li>Good knowledge of <strong>Linux &amp; shell scripting</strong></li>\n<li>Experience with <strong>Git/Git-based version control</strong></li>\n<li>Understanding of application deployment lifecycles</li>\n<li><strong>Docker/Containers</strong> (if applicable to your stack)</li>\n<li><strong>Monitoring tools</strong> (Prometheus/Grafana/Cloud native tools)</li>\n<li>Basic networking &amp; security concepts</li>\n<li>Knowledge of <strong>DevOps best practices</strong> and <strong>SDLC processes</strong></li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in <strong>Computer Science, IT, Engineering</strong>, or related field</li>\n<li><strong>2+ years</strong> of experience as <strong>Cloud/DevOps/Infrastructure Engineer</strong></li>\n<li>Proven <strong>CI/CD implementation</strong> experience</li>\n<li><strong>Jenkins</strong> demonstrable expertise (preferred)</li>\n</ul>\n<h3>Candidate Attributes</h3>\n<ul>\n<li>Strong problem-solving and troubleshooting skills</li>\n<li>Ability to work collaboratively across teams</li>\n<li>Ownership mindset and accountability</li>\n<li>Good communication and documentation skills</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@benymbl.co</strong>.</p>",
        "tags": [
            "2-4 Years",
            "Jenkins",
            "Git",
            "Cloud Platforms (OCI/Azure)"
        ],
        "summary": "Cloud Engineer with 2-4 years of experience in CI/CD automation, Jenkins, and cloud infrastructure management. Requires collaboration with DevOps teams and expertise in deployment pipelines."
    },
    {
        "job_title": "Structural Engineer/Checker",
        "company": "Grid Engineering Services",
        "url": "https://technopark.org/job-details/27087",
        "location": "Technopark",
        "closing_date": "25 Feb 2026",
        "job_description": "<p><strong>Grid Engineering Services</strong>\n<em>Nila, Technopark Phase I, Technopark Rd, Technopark Campus, 695581</em>\n<a href=\"https://gridengineeringservices.com\">Company Website</a></p>\n<p><strong>Job Title:</strong> Structural Engineer/Checker\n<strong>Closing Date:</strong> 25, Feb 2026\n<strong>Job Published:</strong> 24, Jan 2026\n<strong>Contact Email:</strong> careers@grdeng.com</p>\n<h3>Role Overview</h3>\n<p>The Structural Engineer/Checker will lead and oversee the rebar detailing team, ensuring accurate, efficient, and timely production of rebar shop drawings and schedules. This role requires a deep understanding of rebar detailing practices, industry standards, and project requirements, coupled with the ability to check the drawings, optimize workflows, manage the team, and deliver high-quality drawings.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Possess a strong understanding of rebar detailing standards and procedures to meet quality requirements.</li>\n<li>Review and approve shop drawings and schedules for accuracy, completeness, and compliance with project specifications.</li>\n<li>Assign tasks, set performance expectations, and supervise the rebar detailing team.</li>\n<li>Stay updated on the latest industry standards and technologies related to rebar detailing.</li>\n<li>Monitor project progress and ensure timely delivery of shop drawings and schedules.</li>\n<li>Communicate effectively with clients to understand their requirements and address their concerns.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> BE/BTech in Civil Engineering.</li>\n<li><strong>Experience:</strong> Minimum of 3-5 years of experience as a structural engineer expertized in shop drawing checking.</li>\n<li><strong>Technical Skills:</strong> Strong understanding of rebar detailing codes and standards; proficiency in rebar detailing software (e.g., AutoCAD, CADS RC, ZW CAD, Rebar CAD, etc.).</li>\n<li><strong>Soft Skills:</strong> Excellent communication in English and interpersonal skills.</li>\n</ul>\n<h3>Location &amp; Compensation</h3>\n<ul>\n<li><strong>Location:</strong> Technopark, Trivandrum</li>\n<li><strong>Salary:</strong> Between ₹25,000 to ₹60,000 (Based on skills and experience)</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "Rebar Detailing Software",
            "Structural Engineering",
            "Rebar Detailing Codes"
        ],
        "summary": "The Structural Engineer/Checker leads a rebar detailing team, ensuring accurate shop drawings and schedules. Requires 3-5 years of experience in structural engineering and rebar detailing software proficiency."
    },
    {
        "job_title": "Rebar Detailer",
        "company": "Grid Engineering Services",
        "url": "https://technopark.org/job-details/27086",
        "location": "Technopark",
        "closing_date": "25 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Grid Engineering Services\n<strong>Location:</strong> Nila, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"https://gridengineeringservices.com\">https://gridengineeringservices.com</a>\n<strong>Job Title:</strong> Rebar Detailer\n<strong>Closing Date:</strong> 25, Feb 2026\n<strong>Job Published:</strong> 24, Jan 2026\n<strong>Contact Email:</strong> careers@grdeng.com</p>\n<h3><strong>Brief Description</strong></h3>\n<p>Rebar detailers create reinforcement shop drawings using CADS RC or other CAD programs. These drawings specify rebar or steel construction materials for projects like buildings or prefabricated components, detailing types, shapes, and usage instructions.</p>\n<h3><strong>Roles and Responsibilities</strong></h3>\n<ul>\n<li>Prepare shop drawings and bar bending schedules for reinforced concrete elements.</li>\n<li>Detail structures such as bridges, culverts, buildings, and components like foundations, columns, beams, walls, slabs, and stairs.</li>\n<li>Demonstrate strong understanding of rebar detailing codes and standards.</li>\n<li>Proficiency in rebar detailing software (e.g., CADS RC, Rebar CAD, RGS, Rebar Plus).</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Degree in Civil Diploma/B. Tech with <strong>4+ years</strong> of experience in the building services industry as a draftsman.</li>\n<li>Experience with BS codes and standards.</li>\n<li>Familiarity with international client/project work.</li>\n<li>Knowledge of BIM (Building Information Modeling).</li>\n</ul>\n<h3><strong>Location</strong></h3>\n<p>Technopark, Trivandrum</p>\n<h3><strong>Salary</strong></h3>\n<p>₹25,000 to ₹60,000 (based on skills and experience)</p>",
        "tags": [
            "4+ Years",
            "Rebar Detailing Software",
            "BIM (Building Information Modeling)",
            "Civil Engineering"
        ],
        "summary": "Rebar Detailer creates reinforcement shop drawings using CAD software for construction projects. Requires 4+ years of experience and proficiency in rebar detailing tools."
    }
]