[
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22653",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>Trainonex Solutions (P) Ltd</strong>\n1st Floor, M Squared Building, Annex 1, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\nwww.trainonexsolutions.in</p>\n<p><strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing with sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li>Experience: 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>\n<p><strong>Closing Date:</strong> 11, Aug 2025\n<strong>Job Published:</strong> 09, Aug 2025</p>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Communication",
            "Customer interaction"
        ],
        "summary": "Seeking a Telesales Executive to handle sales over the phone and cultivate customer relationships. The role involves identifying clients, qualifying leads, and closing deals to boost company growth."
    },
    {
        "job_title": "Motion Graphics Designer (Animation / Effects)",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22652",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Motion Graphics Designer</h2>\n<p><strong>Globcom Solutions (P) Ltd</strong>\nModule 2502, 5th floor, Yamuna Building\nTechnopark Phase -3, Thiruvananthapuram, 695583\nhttp://www.globcomsolution.com</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 09, Aug 2025</p>\n<p><strong>Role Overview:</strong>\nWe are looking for a creative and skilled Motion Graphics Designer with 2 to 5 years of experience, who is passionate about creating visually stunning animations and effects for digital content. The ideal candidate should have strong expertise in motion graphics, 2D/3D animation, and visual effects, with proficiency in industry-standard tools.</p>\n<p>The role requires someone who can transform concepts into engaging visuals, work collaboratively with creative teams, and deliver high-quality output within deadlines. Experience in creating promotional videos, social media creatives, and explainer animations will be highly valued.</p>\n<p><strong>Responsibilities:</strong>\n- Design and produce high-quality motion graphics, animations, and visual effects for videos, social media, and digital campaigns.\n- Collaborate with the creative, marketing, and development teams to conceptualize and execute visual ideas.\n- Work on storyboards, style frames, and animatics to plan animation sequences.\n- Create 2D/3D animations, kinetic typography, and compositing using After Effects, Cinema 4D, Blender, or similar tools.\n- Edit and enhance videos with transitions, effects, and sound design to achieve a polished final output.\n- Ensure brand consistency across all visual assets.\n- Stay updated on design trends, animation techniques, and emerging tools in motion graphics.\n- Optimize animation files for different platforms and formats.\n- Manage multiple projects simultaneously while meeting quality and timeline requirements.</p>\n<p><strong>Requirements:</strong>\n- 2 to 5 years of professional experience in motion graphics, animation, or visual effects.\n- Proficiency in Adobe After Effects, Premiere Pro, Photoshop, Illustrator, and at least one 3D software (Cinema 4D, Blender, Maya, etc.).\n- Strong understanding of animation principles, timing, and visual storytelling.\n- Experience in compositing, rotoscoping, and visual effects integration.\n- Knowledge of color grading, typography, and layout design.\n- Ability to work collaboratively in a team and communicate creative ideas effectively.\n- Strong attention to detail and time management skills.</p>\n<p><strong>Bonus:</strong>\n- Experience with AI-assisted design tools, VR/AR animation, or interactive media.</p>\n<p><strong>How to Apply:</strong>\nSend your resume, portfolio/reel link, and a brief cover letter to rajesh@globcomsolution.com</p>",
        "tags": [
            "2-5 Years",
            "After Effects",
            "Cinema 4D",
            "Motion Graphics"
        ],
        "summary": "Globcom Solutions is looking for a Motion Graphics Designer to create stunning animations and visual effects. The candidate will collaborate with creative teams to deliver high-quality content."
    },
    {
        "job_title": "Senior DotNet Lead",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22651",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Senior DotNet Lead</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Senior DotNet Lead with 12+ years of experience.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 14, Aug 2025\n<strong>Published Date:</strong> 08, Aug 2025</p>\n<h3>Introduction</h3>\n<p>We are looking for experienced candidates with a strong background in .Net, .Net Core, SQL Server development, TSQL, ASP.NET Web Services, HTML 5, and Azure DevOps.</p>\n<p><strong>Working Hours:</strong> 8 hours, with overlap during EST Time zone (mandatory for meetings).</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, enhance, document, and maintain application features in .Net Core 5/6+, C#, /REST API/T-SQL and AngularJS/React JS</li>\n<li>Application Support &amp; API Integrations with third-party solutions/services</li>\n<li>Extensive experience in building Webservice (SOAP) RESTful APIs</li>\n<li>Understand technical project priorities, implementation dependencies, risks, and issues</li>\n<li>Participate and develop code as part of a unified development group, working the whole technological stack</li>\n<li>Identify, prioritize, and execute tasks in the software development life cycle</li>\n<li>Work with the team to define, design, and deliver on new features</li>\n<li>Broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum model, Jira models.</li>\n<li>Effective communication skill, technical documentation, leadership, and ownership quality</li>\n<li>Production Support (L2, L3)</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>10+ years of development experience in C#, .Net technologies, SQL server - Stored procedures</li>\n<li>Expertise in C#, .Net, Entity framework, EF core, Microservices, SOA, ASP.NET Web Forms (Classic), SOAP-based Web Services, Multithreading &amp; Asynchronous Programming, Windows Services</li>\n<li>Ability to lead, inspire, and motivate teams through effective communication and established credibility</li>\n<li>Guide team to write reusable, testable, performant, and efficient code</li>\n<li>Proficient in writing Unit Test Cases using X-Unit, MS-Test</li>\n<li>Build standards-based frameworks and libraries to support a large-scale application</li>\n<li>Expertise in RDBMS including MS SQL Server with thorough knowledge in writing SQL queries, Stored Procedures, Views, Functions, Packages, Cursors &amp; tables and objects types.</li>\n<li>Experience in large scale software development.</li>\n<li>Prior experience in Application Support &amp; API Integrations</li>\n<li>Knowledge of architectural styles and design patterns, experience in designing solutions</li>\n<li>Strong debugging and problem-solving skills</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Good knowledge of JavaScript, React JS, jQuery, Angular, and other front-end technologies</li>\n<li>API Management - APIM</li>\n<li>Expertise in Microsoft Azure Cloud Services, Azure DevOps, Application Insights, Azure Monitoring, KeyVault, and SQL Azure.</li>\n<li>Azure DevOps - CI/CD pipelines (classic / YAML)</li>\n<li>Hands-on experience in building and deploying applications by adopting Azure DevOps practices such as Continuous Integration (CI) and Continuous Deployment (CD) in runtime with Git, Docker, Kubernetes and managing Azure Cloud Services.</li>\n<li>Azure Container Apps/Docker /Azure Container Registry</li>\n<li>Azure Messaging services - Service Bus or Event Grid, Event hub</li>\n<li>Azure Storage Account - Blobs, Tables, Queue etc</li>\n<li>Azure Function / Durable Functions</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Note:</strong> Reflections Info Systems does not ask for fees for job applications. Contact careers@reflectionsinfos.com for clarifications.</p>",
        "tags": [
            "12+ Years",
            ".NET",
            "SQL Server",
            "Azure DevOps"
        ],
        "summary": "Reflections Info Systems is seeking a Senior .Net Lead to develop and maintain application features, and provide application support. The candidate should be proficient in .Net technologies, SQL Server, and Azure DevOps."
    },
    {
        "job_title": "Cloud Infrastructure Engineer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22650",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Cloud Infrastructure Engineer</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a skilled Cloud Infrastructure Engineer to play a pivotal role in building and evolving our infrastructure platform. The ideal candidate will focus on designing and automating scalable, secure, and resilient cloud infrastructure with a strong emphasis on Kubernetes, Infrastructure as Code (Terraform), and GitOps workflows.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Architect and build infrastructure using Terraform and Git-based workflows, with a focus on repeatability, compliance, and automation.</li>\n<li>Design, deploy, and manage robust Kubernetes clusters, enforcing multi-tenant configurations, network policies, and security standards.</li>\n<li>Develop and maintain modular Terraform codebases and reusable templates to support various infrastructure use cases.</li>\n<li>Build automation and self-service patterns that streamline developer access to infrastructure while maintaining guardrails.</li>\n<li>Leverage both IaaS and PaaS cloud services to deliver scalable solutions that align with business needs—compute, storage, networking, databases, messaging, identity, and more.</li>\n<li>Drive adoption of platform engineering patterns including GitOps, policy-as-code, and developer enablement tooling.</li>\n<li>Collaborate closely with application, security, and cloud architecture teams to integrate infrastructure into broader platform strategy.</li>\n</ul>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>5+ years of experience in cloud engineering, infrastructure architecture, or platform engineering roles.</li>\n<li>Experience with Kubernetes operations and architecture in production environments.</li>\n<li>Strong knowledge of cloud IaaS and PaaS services, and how to design reliable solutions leveraging them (e.g., VMs, load balancers, managed databases, identity platforms, messaging queues, etc.).</li>\n<li>Advanced proficiency in Terraform and Git-based infrastructure workflows.</li>\n<li>Experience building and maintaining CI/CD pipelines.</li>\n<li>Solid scripting abilities in Python, Bash, or PowerShell.</li>\n<li>A strong understanding of infrastructure security, governance, and identity best practices.</li>\n<li>Ability to work collaboratively across engineering.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Familiarity with GitOps tooling.</li>\n<li>Experience with policy-as-code and container security best practices.</li>\n<li>Experience with Microsoft Power Platform (Dynamics 365)</li>\n<li>Google Cloud Knowledge</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>Candidate needs to work in EST timings: 7am-3pm EST &amp; 10am-6pm EST.</li>\n<li>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</li>\n</ul>\n<p><strong>Fraud Alert:</strong></p>\n<p>Reflections Info Systems does not charge any fees for job applications. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "5+ Years",
            "Terraform",
            "Kubernetes",
            "Cloud Engineering"
        ],
        "summary": "Reflections Info Systems is hiring a Cloud Infrastructure Engineer. You will build and automate secure cloud infrastructure using Kubernetes and Terraform."
    },
    {
        "job_title": "Tele caller",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/22649",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>Walk-In Telecaller</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong>\nSBC 22, -2, Thejaswini Building, Technopark,\nThiruvananthapuram, 695581\n<a href=\"https://www.upcommune.net\">https://www.upcommune.net</a></p>\n<p><strong>Walk-In Details:</strong></p>\n<ul>\n<li><strong>Date:</strong> August 11, 2025</li>\n<li><strong>Time:</strong> 10:00 AM to 1:00 PM</li>\n<li><strong>Job Published:</strong> August 08, 2025</li>\n<li><strong>Contact Email:</strong> <a href=\"mailto:mail@upcommune.net\">mail@upcommune.net</a></li>\n<li><strong>Contact for gate pass:</strong> +91 9074882688</li>\n</ul>\n<p><strong>Walk-In Venue:</strong></p>\n<p>Upcommune Business Network Pvt Ltd\nForth Floor, Gayatri Building, Technopark,\nThiruvananthapuram, 695581</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Make outbound calls to customers.</li>\n<li>Promote products and services using a prepared script.</li>\n<li>Answer customer inquiries and address concerns.</li>\n<li>Achieve sales targets and report on call activities.</li>\n<li>Maintain accurate records of customer interactions.</li>\n<li><strong>Only for Female candidates.</strong></li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Plus two or equivalent.</li>\n<li>Excellent verbal communication skills.</li>\n<li>Strong customer service and sales skills.</li>\n<li>Ability to handle rejection and stay positive.</li>\n<li>Experience in telecalling or sales is a plus.</li>\n</ul>\n<p><strong>Walk-In Entry Pass:</strong></p>\n<p>Candidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong></p>\n<ul>\n<li><a href=\"link\">Click here to download the Mobile App for Android</a></li>\n<li><a href=\"link\">Click here to download the Mobile App for iOS</a></li>\n</ul>\n<p><strong>Website URL:</strong></p>\n<p><a href=\"vms.technopark.org\">vms.technopark.org</a>\n<a href=\"link\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "Entry Level",
            "Telecalling",
            "Sales",
            "Customer Service"
        ],
        "summary": "Upcommune Business Network is hiring female Telecallers for a walk-in interview. The role involves outbound calls, promoting products, and achieving sales targets."
    },
    {
        "job_title": "Junior Designer  ( Experience 1 - 2yrs)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22648",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Junior Designer</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor,\nThejaswini Building and Ground Floor, Chandragiri Building\nTechnopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<p><strong>Brief Description</strong></p>\n<p>We are seeking a Junior Designer with 1–2 years of experience to join our product and development team. You will contribute to designing user interfaces and experiences for web and mobile healthcare applications, including AI-powered tools. Talented freshers with strong portfolios may also be considered.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Create UI designs and interactive prototypes using Figma</li>\n<li>Collaborate with product and engineering teams to transform concepts into working designs</li>\n<li>Design user-centric workflows for AI-based applications</li>\n<li>Use basic HTML/CSS knowledge for quick design reviews or mockups</li>\n<li>Contribute to branding, marketing creatives, and internal documentation design</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong proficiency in Figma and understanding of UI/UX principles</li>\n<li>Basic working knowledge of HTML/CSS</li>\n<li>Exposure to or interest in designing for AI-driven applications</li>\n<li>High attention to detail and ability to adapt designs based on feedback</li>\n<li>Good communication skills and a collaborative mindset</li>\n</ul>\n<p><strong>Preferred Experience:</strong></p>\n<ul>\n<li>1–2 years of design experience (Preferred)</li>\n<li>Exceptional freshers with a strong design portfolio may also be considered.</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Figma",
            "UI/UX",
            "HTML/CSS"
        ],
        "summary": "Seeking a Junior Designer to create UI/UX designs for web and mobile healthcare applications. Requires proficiency in Figma, HTML/CSS, and an interest in AI-driven applications."
    },
    {
        "job_title": "Service Executive",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/22647",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>Walk-In Service Executive</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong>\nSBC 22, -2 , Thejaswini Building, Technopark, Thiruvananthapuram , 695581\n<a href=\"https://www.upcommune.net\">https://www.upcommune.net</a></p>\n<p><strong>Walk-In Details:</strong>\n- <strong>Date:</strong> August 11, 2025\n- <strong>Time:</strong> 10:00 AM - 1:00 PM\n- <strong>Contact Email:</strong> mail@upcommune.net</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a skilled and dedicated Biomedical Equipment Service Executive to install, maintain, troubleshoot, and repair a wide range of medical equipment. The ideal candidate should have strong technical expertise, problem-solving skills, and the ability to provide prompt service support to healthcare facilities, ensuring minimal downtime of critical medical devices.</p>\n<p><strong>Key Responsibilities:</strong>\n- Install and configure biomedical equipment at hospitals, clinics, and diagnostic centers.\n- Perform preventive and corrective maintenance of medical equipment as per schedule.\n- Diagnose technical faults and carry out repairs efficiently.\n- Calibrate and test devices to ensure compliance with manufacturer and safety standards.\n- Maintain service records, repair reports, and equipment history logs.\n- Provide technical training to end-users on proper equipment operation and care.\n- Coordinate with the sales and technical team for after-sales support.\n- Ensure adherence to safety protocols and regulatory standards.\n- Respond promptly to service calls and emergencies.</p>\n<p><strong>Preferred Skills:</strong>\n- Diploma/Degree in Biomedical Engineering, Electronics, or related field.\n- 0–1 years of experience in biomedical equipment servicing (freshers with strong technical knowledge can also apply).\n- Knowledge of medical device troubleshooting, calibration, and maintenance procedures.\n- Familiarity with different brands and models of medical equipment.\n- Strong technical and mechanical aptitude.\n- Good understanding of hospital and clinical environments.\n- Excellent problem-solving and analytical skills.\n- Ability to work independently and under pressure.\n- Good communication and customer service skills.\n- Basic computer literacy for service reporting and documentation.\n- Willingness to travel for on-site service support.</p>\n<p><strong>Walk-In Venue:</strong>\nUpcommune Business Net work Pvt Ltd\nForth Floor\nGayatri Building\nTechnopark - 695582\nTVM</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus. Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\n- <a href=\"link\">Click here to download the Mobile App for Android</a>\n- <a href=\"link\">Click here to download the Mobile App for iOS</a></p>\n<p><strong>Website URL:</strong>\n<a href=\"vms.technopark.org\">vms.technopark.org</a>\n<a href=\"link\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "0-1 Years",
            "Biomedical Equipment",
            "Troubleshooting",
            "Calibration"
        ],
        "summary": "Upcommune is hiring a Biomedical Equipment Service Executive to install, maintain, and repair medical equipment. The role requires strong technical skills and the ability to provide prompt service support."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/22646",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>Upcommune Business Network - Walk-In Interview: Business Development Executive</h2>\n<p><strong>Date:</strong> 11 August 2025\n<strong>Time:</strong> 10:00 AM - 1:00 PM</p>\n<p><strong>Location:</strong>\nUpcommune Business Network Pvt Ltd\nForth Floor, Gayatri Building\nTechnopark - 695582\nThiruvananthapuram</p>\n<h3>About Upcommune Business Network</h3>\n<p>Upcommune Business Network (P) Ltd is located at SBC 22, -2, Thejaswini Building, Technopark, Thiruvananthapuram, 695581. For more information, visit <a href=\"https://www.upcommune.net\">https://www.upcommune.net</a>.</p>\n<h3>Job Description</h3>\n<p>We are seeking a talented Business Development Executive to join our dynamic Sales and Marketing team. This role is pivotal in identifying new business opportunities, converting leads into clients, and devising effective marketing strategies to foster business growth.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Identify and pursue new business opportunities through networking, cold calling, and other lead generation techniques.</li>\n<li>Develop and maintain strong relationships with prospective clients and key stakeholders.</li>\n<li>Collaborate with the marketing team to create compelling campaigns that align with client needs and drive revenue.</li>\n<li>Analyze market trends and competitor activities to ensure the company remains competitive in the marketplace.</li>\n<li>Prepare and deliver pitches and presentations to potential clients, showcasing the company's products/services and value proposition.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proven experience in sales and business development, preferably in a related industry.</li>\n<li>Ability to work independently and as part of a team, with a proactive approach to problem-solving.</li>\n<li>Degree/ Diploma in Marketing or a related field is preferred.</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Opportunity to work in a dynamic and innovative environment.</li>\n<li>Competitive salary and performance-based incentives.</li>\n<li>Career growth opportunities within the company.</li>\n</ul>\n<h3>Walk-In Entry Pass Information:</h3>\n<p>Candidates are requested to apply for the entry pass to Technopark Campus to attend the Walk-In interview through the mobile app/web browser. The softcopy of the entry pass can be shown on their gadgets at the Technopark Entrance Gate. Candidates without a smartphone can print a hardcopy from the self-operating Kiosks at the Reception Building near the TECHNOPARK Main Gate using the OTP received via SMS/email.</p>\n<p><strong>Mobile App:</strong>\n- <a href=\"Click here to download the Mobile App for Android\">Android App</a>\n- <a href=\"Click here to download the Mobile App for iOS\">iOS App</a></p>\n<p><strong>Website URL:</strong>\n- <a href=\"vms.technopark.org\">vms.technopark.org</a>\n- <a href=\"Click here for the User Manual\">User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<h3>Contact Information</h3>\n<ul>\n<li><strong>Email:</strong> <a href=\"mailto:mail@upcommune.net\">mail@upcommune.net</a></li>\n<li><strong>Phone:</strong> +91 9074882688</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Business Development",
            "Sales",
            "Digital Marketing"
        ],
        "summary": "Upcommune Business Network is hiring a Business Development Executive to identify opportunities, convert leads, and develop marketing strategies. The role requires sales experience and the ability to build client relationships."
    },
    {
        "job_title": "AI Developer- Trainee",
        "company": "Apps Team Technologies Pvt Ltd",
        "url": "https://technopark.org/job-details/22644",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>AI Developer- Trainee</h2>\n<p><strong>Apps Team Technologies Pvt Ltd</strong>\nSBC 10, Kabani Building, Technocity Technopark phase IV, Trivandrum, 695317\n<a href=\"https://appsteamtechnologies.com\">https://appsteamtechnologies.com</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> careers@appsteamtechnologies.com</p>\n<p><strong>Brief Description:</strong>\nExciting Opportunity for Freshers! We are looking for an AI Developer to join our dynamic team. If you're a recent graduate passionate about AI and ready to start your career journey, this is your chance!</p>\n<p><strong>Position:</strong> AI Developer- Trainee\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Notice Period:</strong> Immediate joiners</p>\n<p><strong>Technical Skills:</strong>\nPython, OOPS knowledge</p>\n<p><strong>How to Apply:</strong>\nIf you are excited about the potential of AI to transform industries and want to be part of a forward-thinking team, we’d love to hear from you! Please send your resume to careers@appsteamtechnologies.com with the subject line \"AI Developer Application\".</p>\n<p><strong>Preferred Skills:</strong>\n- Python\n- OOPS knowledge\n- Familiarity with data preprocessing and analysis using libraries like Pandas and NumPy\n- Experience with AI/ML frameworks such as TensorFlow or PyTorch\n- Understanding of neural networks, supervised and unsupervised learning\n- Natural Language Processing (NLP) and Computer Vision.</p>",
        "tags": [
            "0 Years",
            "Python",
            "TensorFlow",
            "PyTorch",
            "OOP"
        ],
        "summary": "Apps Team Technologies is seeking a motivated AI Developer-Trainee. This role is perfect for fresh graduates passionate about AI, offering an excellent start to their career."
    },
    {
        "job_title": "Technical Executive",
        "company": "Embright Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/22643",
        "location": "Technopark",
        "closing_date": "12 Aug 2025",
        "job_description": "<h2>Technical Executive</h2>\n<p><strong>Embright Infotech (P) Ltd</strong></p>\n<p>KSUM, Thejaswini Building, Technopark Campus, Thiruvananthapuram, 695581</p>\n<p>http://www.embrightinfotech.com</p>\n<p><strong>Contact Email:</strong> hr@embrightinfotech.com</p>\n<p><strong>Responsibilities and Requirements:</strong></p>\n<ul>\n<li>Bachelor's degree in Mechanical Engineering, Electrical &amp; Electronics, Computer Science, or a related field.</li>\n<li>Strong understanding of technical systems and troubleshooting.</li>\n<li>Good communication and problem-solving skills.</li>\n<li>Ability to work independently and in a team.</li>\n<li>Travel and Driving are mandatory.</li>\n<li>Immediate joining is required.</li>\n<li>Male candidates only.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong understanding of technical systems and troubleshooting</li>\n<li>Good communication and problem-solving skills</li>\n<li>Ability to work independently and in a team</li>\n<li>Willingness to Travel and Driving.</li>\n</ul>",
        "tags": [
            "0 Years",
            "Troubleshooting",
            "Communication Skills",
            "Technical Systems"
        ],
        "summary": "Embright Infotech is seeking a Technical Executive with a bachelor's degree in a relevant field. The role requires strong technical skills, communication abilities, and willingness to travel."
    },
    {
        "job_title": "Business Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22642",
        "location": "Technopark",
        "closing_date": "12 Aug 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p><strong>Polus Solutions (P) Ltd</strong> is looking for experienced, passionate, and self-driven candidates to join our team with full dedication and cooperation.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Determine and write requirements for projects, through collaboration with Product Owners.</li>\n<li>Act as requirements owner, directing and coordinating requirements leading to sign off by all stakeholders.</li>\n<li>Gather, create mock-ups, and document requirements, translating functional requirements to technical requirements, and identify options for stakeholders.</li>\n<li>Ability to convey ideas concisely to audiences of varying levels of experience and knowledge.</li>\n<li>Review and verify test cases/test scenarios and coordinate with the QA/Testing team and ensure successful UAT.</li>\n<li>Create wireframes, mock-ups, or prototypes to explain requirements and ideas.</li>\n<li>Gather and document requirements, translating functional requirements to technical requirements, and draw flow diagrams.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>2-3 years’ experience in the Business Analyst role.</li>\n<li>Certification in Business Analysis e.g. CCBA, CBAP, or related topics will be an added advantage.</li>\n<li>Experience in working with tools like MS Office products like Word, PowerPoint, Excel, etc., JIRA, Wireframe tools like MS Visio, Balsamiq, etc.</li>\n<li>Good understanding of Agile Scrum practices.</li>\n<li>Experience working with stakeholders, and software development team.</li>\n<li>Communication - written, verbal, and interpersonal communication skills including technical writing skills.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@polussolutions.com</li>\n<li>Please include “Business Analyst- [Your Name]” in the subject line.</li>\n<li>Polus Solutions (P) Ltd, 12B, Carnival Technopark, Technopark, Kazhakuttam, Trivandrum Kerala, India, 695581</li>\n<li><a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a></li>\n</ul>\n<p><strong>Closing Date:</strong> 12, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>",
        "tags": [
            "2-3 Years",
            "JIRA",
            "Agile Scrum",
            "MS Office"
        ],
        "summary": "Polus Solutions is seeking a Business Analyst to determine project requirements, create mock-ups, and ensure successful UAT. The ideal candidate will have 2-3 years of experience."
    },
    {
        "job_title": "Senior Front-End Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22640",
        "location": "Technopark",
        "closing_date": "12 Aug 2025",
        "job_description": "<h2>Senior Front-End Developer</h2>\n<p><strong>Polus Solutions (P) Ltd</strong> is seeking a Senior Front-End Developer to build modern, scalable, and high-performance web applications.</p>\n<p><strong>Location:</strong> Trivandrum, Kerala, India</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop efficient, reusable, and scalable front-end components.</li>\n<li>Translate functional requirements into high-quality, interactive, and responsive web applications.</li>\n<li>Collaborate with backend teams to integrate RESTful and GraphQL APIs.</li>\n<li>Optimize front-end applications for performance, scalability, and cross-browser compatibility.</li>\n<li>Ensure code quality through unit testing and peer reviews.</li>\n<li>Work with DevOps teams on CI/CD pipelines and cloud deployments (AWS, Azure, or GCP).</li>\n<li>Maintain documentation and follow best practices in code versioning and deployment.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>4+ years of experience in front-end development.</li>\n<li>Good understanding and hands-on experience with <strong>React.js</strong>.</li>\n<li>Proficiency in <strong>JavaScript</strong>, <strong>HTML5</strong>, and <strong>CSS3</strong>.</li>\n<li>Familiarity with frameworks like Next.js or Vue.js is a plus.</li>\n<li>Knowledge of performance optimization techniques (lazy loading, SSR, caching).</li>\n<li>Experience in working with state management tools (NgRx, Redux).</li>\n<li>Familiarity with RESTful APIs and GraphQL integration.</li>\n<li>Exposure to automated testing frameworks (Jest, Cypress).</li>\n<li>Experience working in Agile &amp; Scrum teams.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, IT, or a related field.</li>\n<li>Experience with cloud-based deployment environments (AWS, Azure, GCP).</li>\n<li>Basic understanding of backend technologies like Node.js and databases (SQL/NoSQL).</li>\n<li>Experience building Progressive Web Apps (PWAs).</li>\n<li>Contributions to GitHub or a portfolio of projects showcasing your front-end development work.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your resume to careers@polussolutions.com. Please include “Senior Front-End Developer (Angular) - [Your Name]” in the subject line.</p>\n<p><strong>Contact Information:</strong></p>\n<p>careers@polussolutions.com</p>\n<p><strong>Closing Date:</strong> 12, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>",
        "tags": [
            "4+ Years",
            "Angular",
            "React.js",
            "JavaScript"
        ],
        "summary": "Polus Solutions is hiring a Senior Front-End Developer to construct web applications. Proficiency in Angular and React.js is essential for integrating APIs and optimizing performance."
    },
    {
        "job_title": "Data Science Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22639",
        "location": "Technopark",
        "closing_date": "12 Aug 2025",
        "job_description": "<h2>Data Science Analyst</h2>\n<p>Polus Solutions (P) Ltd is seeking a talented Data Science Analyst to join our dynamic team. In this role, you will work closely with our senior data scientist to support the development and validation of machine learning solutions for fraud detection. Your quantitative expertise will be instrumental in demonstrating the value of Kevari's data solutions through rigorous analysis, testing, and research.</p>\n<p>As a key contributor to our fast-growing team, you will conduct ad hoc analyses, integrate and evaluate third-party data sources, and perform statistical studies that directly influence product strategy and client outcomes.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>Analysis &amp; Research</strong></p>\n<ul>\n<li>Conduct ad hoc exploratory data analysis to identify fraud patterns and trends, with focus on new account fraud and account takeovers</li>\n<li>Integrate and evaluate third-party data sources to test and enhance the efficacy of existing fraud detection solutions</li>\n<li>Perform retrospective analyses and back-testing to demonstrate solution value to prospective clients</li>\n<li>Execute statistical studies to support product development and optimization decisions</li>\n</ul>\n<p><strong>Model Support &amp; Validation</strong></p>\n<ul>\n<li>Collaborate with senior data scientist to support predictive model development and implementation</li>\n<li>Conduct quality assurance testing of machine learning algorithms and key data attributes</li>\n<li>Validate model performance and stability across different data scenarios</li>\n<li>Stay current on emerging data science techniques, particularly in AI/ML for fraud detection</li>\n</ul>\n<p><strong>Communication &amp; Reporting</strong></p>\n<ul>\n<li>Define and deliver analytical reports that translate complex findings into actionable business insights</li>\n<li>Present results to both technical and non-technical stakeholders</li>\n<li>Support client demonstrations and proof-of-concept initiatives</li>\n<li>Document analytical methodologies and findings</li>\n</ul>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li><strong>Education:</strong> Bachelor's or advanced degree in Statistics, Mathematics, Computer Science, Data Science, or related quantitative field</li>\n<li><strong>Experience:</strong> 2-3 years in data science, analytics, or related analytical role</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li>Proficiency in Python</li>\n<li>Experience with Jupyter Notebook and statistical analysis</li>\n<li>Strong SQL skills for data extraction and manipulation</li>\n<li>Proficiency in Microsoft Excel and PowerPoint</li>\n</ul>\n<p><strong>Analytical Skills:</strong></p>\n<ul>\n<li>Solid understanding of statistical modeling and machine learning concepts</li>\n<li>Experience with data exploration and pattern recognition</li>\n<li>Strong problem-solving and critical thinking abilities</li>\n</ul>\n<p><strong>Communication:</strong> Ability to explain complex analytical concepts to non-technical audiences</p>\n<p><strong>Personal Attributes:</strong></p>\n<ul>\n<li>Self-directed with strong project management skills</li>\n<li>Collaborative team player with eagerness to learn</li>\n<li>Detail-oriented with commitment to data quality and accuracy</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Send your resume to careers@polussolutions.com\nPlease include “Data Science Analyst - [Your Name]” in the subject line.</p>\n<p>Polus Solutions (P) Ltd\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\nhttps://www.polussolutions.com</p>",
        "tags": [
            "2-3 Years",
            "Python",
            "SQL",
            "Machine Learning"
        ],
        "summary": "Polus Solutions is looking for a Data Science Analyst to support machine learning solutions for fraud detection. The role involves data analysis, model validation, and reporting to improve product strategy."
    },
    {
        "job_title": "Presales Specialist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22638",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Presales Specialist</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a Presales Specialist with 5 to 8 years of experience in IT Presales to join our team at Carnival Technopark, Kariyavattom, Thiruvananthapuram.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage the complete Bid Management Process, collaborating with the team.</li>\n<li>Write Proposals/Capability decks end to end.</li>\n<li>Deliver presentations and demonstrations to prospective and current clients.</li>\n<li>Liaise with product/service development teams to gain in-depth knowledge and relay user behavior and client feedback.</li>\n<li>Help the sales team to reach targets.</li>\n<li>Conduct industry, competitor, and market research.</li>\n<li>Consider new markets or clients based on product/service and user knowledge.</li>\n<li>Hold kick-off and debrief meetings.</li>\n<li>Act as a point of contact for prospects.</li>\n<li>Provide Marketing Support by creating Case Studies, White Papers, etc.</li>\n<li>Prepare estimations based on previous examples.</li>\n<li>Utilize basic Business Analysis experience to prepare documents like BRD.</li>\n<li>Use basic Technical knowledge to understand the RFP/Requirements and suggest the best technology choice.</li>\n<li>Partner connect and collaboration</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Ability to write quality proposals.</li>\n<li>Leadership and communication skills.</li>\n<li>Presentation skills.</li>\n<li>Interest in and understanding of the technology industry.</li>\n<li>Ability to research and keep on top of industry developments.</li>\n<li>Influencing and negotiation skills.</li>\n<li>Aptitude for time management and organization.</li>\n<li>Problem-solving ability.</li>\n<li>Basic Technical Knowledge and awareness of new trends.</li>\n<li>Experience working in standard CRM.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Note:</strong> Reflections Info Systems does not seek payment for jobs. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "5-8 Years",
            "Proposals",
            "Presentations",
            "Bid Management"
        ],
        "summary": "Reflections Info Systems is hiring a Presales Specialist to manage bids, create proposals, and deliver presentations. The ideal candidate should have strong communication, technical understanding and proposal writing skills."
    },
    {
        "job_title": "Senior SQA",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22637",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Senior SQA</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong></p>\n<p>9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 14, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a 5+ years experienced Senior Software Quality Assurance (SQA) person with a proven track record in software quality assurance, process improvement, and compliance audits.</p>\n<p>This role demands strong analytical and communication skills, as well as hands-on experience in quality frameworks, SDLC governance, and root cause analysis. The successful candidate will be responsible for ensuring adherence to organizational quality and information security standards and methodologies through audits, reviews, and proactive process enhancement and will work cross-functionally with development, and support teams to enforce and evolve best practices across projects.</p>\n<h3>Responsibilities include:</h3>\n<ul>\n<li>Guide and support project and support teams in adhering to organizational quality and infosec processes, policies, and best practices.</li>\n<li>Conduct periodic audits and reviews, including Internal Audits, SDLC work product reviews, and Configuration Audits to ensure compliance with defined processes.</li>\n<li>Track and follow up on non-conformities identified during audits and reviews, ensuring timely closure and corrective action.</li>\n<li>Facilitate root cause analysis for process gaps, defects, or audit findings, and collaborate with teams to identify and implement preventive and corrective measures.</li>\n<li>Collect, validate, and analyze quality and process metrics across projects and departments, and initiate process improvements.</li>\n<li>Drive quality initiatives and organization-wide process improvement programs.</li>\n<li>Assist teams in identifying, documenting, and tracking project-level risks and issues, ensuring they are reviewed and managed appropriately.</li>\n<li>Actively participate in key project meetings, including initiation, retrospectives, risk/issue reviews, and closure meetings.</li>\n<li>Support awareness and training initiatives, including sessions on quality management systems, information security, and compliance standards to build organizational capability and compliance culture.</li>\n</ul>\n<h3>Certifications:</h3>\n<ul>\n<li>Prefer Internal auditor certified (QMS/ISMS)</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Hands-on experience in conducting Internal Quality Audits (IQA), SDLC Work Product Reviews, and Configuration Management (CM) Audits</li>\n<li>Knowledge of Quality and Security standards such as ISO 9001, ISO 27001</li>\n<li>Skilled in quality analysis techniques like Fishbone (Ishikawa) Diagrams, and Pareto Analysis</li>\n<li>Good understanding of Agile, Waterfall, and Hybrid SDLC methodologies</li>\n<li>Proficient in collecting, validating, analyzing, and reporting quality and performance metrics</li>\n<li>Experience in conducting Root Cause Analysis (RCA) and driving Corrective and Preventive Actions (CAPA)</li>\n<li>Ability to define, standardize, and continuously improve organizational processes, templates, and guidelines</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Good Team player, Interpersonal and Problem-solving skills</li>\n<li>Attention to detail and presentation skills</li>\n<li>Working knowledge in tools - GitHub, JIRA, Redmine, Trello, Basecamp etc.</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn, and all employment-related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "5+ Years",
            "Quality Assurance",
            "ISO 9001",
            "ISO 27001"
        ],
        "summary": "Reflections Info Systems is seeking a Senior SQA with 5+ years of experience. The role involves ensuring quality and security standards through audits and process improvements."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22636",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Delivery Manager to oversee the planning, execution, and delivery of multiple technical projects. The ideal candidate will possess 18+ years of experience in technology delivery roles, a strong understanding of modern software development practices, and excellent leadership and communication skills.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Project Delivery Management:</strong></li>\n<li>Oversee the planning, execution, and delivery of multiple technical projects.</li>\n<li>Manage project scope, timelines, budgets, risks, and quality.</li>\n<li>Ensure adherence to Agile/Waterfall methodologies as per project requirements.</li>\n<li><strong>Team Leadership:</strong></li>\n<li>Lead and mentor cross-functional technical teams, fostering collaboration and innovation.</li>\n<li>Conduct regular performance reviews and provide growth opportunities for team members.</li>\n<li><strong>Stakeholder Engagement:</strong></li>\n<li>Act as a bridge between technical teams, business stakeholders, and clients.</li>\n<li>Communicate project status, risks, and solutions effectively to all stakeholders.</li>\n<li><strong>Technical Expertise:</strong></li>\n<li>Collaborate with architects and engineers to define technical solutions.</li>\n<li>Provide input on architecture, design, and implementation strategies.</li>\n<li><strong>Process Improvement:</strong></li>\n<li>Identify opportunities to improve project delivery processes and tools.</li>\n<li>Implement best practices in software development and delivery.</li>\n<li><strong>Risk and Issue Management:</strong></li>\n<li>Proactively identify project risks and develop mitigation strategies.</li>\n<li>Resolve technical and operational challenges in a timely manner.</li>\n<li><strong>Customer Focus:</strong></li>\n<li>Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li><strong>Experience:</strong></li>\n<li>18 years of experience in technology delivery roles, including hands-on development and leadership responsibilities.</li>\n<li>Proven experience in delivering large-scale, complex projects with diverse teams.</li>\n<li><strong>Technical Expertise:</strong></li>\n<li>Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.</li>\n<li>Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</li>\n<li><strong>Project Management:</strong></li>\n<li>Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.</li>\n<li>Certification such as PMP, CSM, or equivalent is an advantage.</li>\n<li><strong>Leadership and Communication:</strong></li>\n<li>Excellent team leadership, people management, and conflict resolution skills.</li>\n<li>Strong communication, presentation, and negotiation abilities.</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Company Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not ask for fees for job opportunities. Be cautious of fraudulent job offers.\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "18+ Years",
            "Project Delivery",
            "Agile",
            "Cloud Technologies"
        ],
        "summary": "Reflections Info Systems is hiring a Delivery Manager with 18+ years of experience to oversee technical projects. This role involves team leadership, stakeholder engagement, and ensuring customer satisfaction."
    },
    {
        "job_title": "Senior .Net Lead",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22635",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Senior .Net Lead</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a Senior .Net Lead to join our team. We are looking for candidates with 8+ years of experience in the IT industry and strong skills in .Net/.Net Core, Azure Cloud Services, and Azure DevOps. This role requires strong communication skills as it is client-facing, and the candidate should be hands-on with coding and Azure.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Working Hours:</strong> 8 hours (12 PM - 9 PM)</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, enhance, document, and maintain application features in .Net Core 5/6+, C#, REST API, T-SQL, and AngularJS/React JS.</li>\n<li>Provide Application Support &amp; API Integrations with third-party solutions/services.</li>\n<li>Understand technical project priorities, implementation dependencies, risks, and issues.</li>\n<li>Participate and develop code as part of a unified development group, working across the whole technological stack.</li>\n<li>Identify, prioritize, and execute tasks in the software development life cycle.</li>\n<li>Work with the team to define, design, and deliver new features.</li>\n<li>Apply broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum, and Jira.</li>\n<li>Demonstrate effective communication skills, technical documentation skills, leadership, and ownership quality.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>.NET Core 6/8+</li>\n<li>C#</li>\n<li>Azure Functions/Durable</li>\n<li>Azure Messaging service (Service Bus, Event Grid, Storage Queues)</li>\n<li>Azure Storage account - Blob</li>\n<li>DDD / Clean Architecture</li>\n<li>REST API</li>\n<li>Entity Framework / EF Core</li>\n<li>MS SQL Server</li>\n<li>CQRS - Framework</li>\n<li>Microservices &amp; SOA Architecture</li>\n<li>API Integration</li>\n<li>Azure Monitoring (App Insights, Azure Monitor)</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Front-End Frameworks: Angular/React JS</li>\n<li>Azure DevOps (CI/CD Pipelines)</li>\n<li>Azure API Management (APIM)</li>\n<li>Azure Containerization &amp; Orchestration</li>\n<li>Azure Data Factory (ADF)</li>\n<li>Azure Logic Apps</li>\n<li>Application Support &amp; Monitoring</li>\n<li>Unit Testing Frameworks</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Note:</strong> Reflections Info Systems does not charge any fees for job opportunities. Contact careers@reflectionsinfos.com for any clarifications.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Azure",
            "C#",
            "REST API"
        ],
        "summary": "Reflections Info Systems is hiring a Senior .Net Lead with strong skills in .Net, Azure, and related technologies. The role involves development, API integrations, and working with Agile methodologies."
    },
    {
        "job_title": "Senior Technology Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22634",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Senior Technology Architect</h2>\n<p>Reflections Info Systems is seeking a versatile and hands-on Senior Technology Architect to join our dynamic engineering teams.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the architecture and hands-on design of scalable, secure, and resilient enterprise applications, prioritizing practical and effective solutions.</li>\n<li>Act as a senior player-coach, mentoring and guiding development teams through complex technical challenges. Foster a culture of technical excellence by leading from the front with hands-on prototyping and coding.</li>\n<li>Work directly with customers to lead technical assessments, understand their business challenges, and act as a trusted advisor. Drive relationships with key client stakeholders to ensure success and identify new opportunities.</li>\n<li>Actively contribute to growing key accounts by identifying new opportunities, assisting with pre-sales activities, and ensuring the technical solutions proposed are aligned with client needs and budgets.</li>\n<li>Partner closely with delivery and DevOps teams to ensure the architectural vision is translated into a practical, working solution that can be deployed and maintained efficiently.</li>\n<li>Proactively explore new technologies and methods. Develop new service offerings, formulate business cases for strategic investments, and build reusable assets for the organization.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Architectural Expertise:</li>\n<li>Proven ability to apply architectural principles and patterns (Microservices, Domain-Driven Design, Clean Architecture, Event-Driven Architecture, SOLID, OOAD).</li>\n<li>Deep expertise in API design (e.g., REST, GraphQL) and ability to design and implement complex hybrid integration solutions connecting cloud and on-premises systems.</li>\n<li>Demonstrated experience in performing technical assessments and creating strategic technology roadmaps for clients.</li>\n<li>Technical Skills:</li>\n<li>Microsoft Stack:<ul>\n<li>Extensive hands-on development experience with .NET and .NET Core.</li>\n<li>Proven ability to design and deploy solutions on Microsoft Azure, leveraging IaaS, PaaS, and serverless architectures (e.g., Azure Functions, App Services, AKS).</li>\n</ul>\n</li>\n<li>Frontend Technologies:<ul>\n<li>Hands-on expertise in Angular, React, or Node.js.</li>\n</ul>\n</li>\n<li>SharePoint:<ul>\n<li>In-depth, hands-on experience with SharePoint Online/On-Premises, including custom solution design.</li>\n<li>Proficiency in the SharePoint Framework (SPFx), custom web parts, and other SharePoint customizations.</li>\n</ul>\n</li>\n<li>DevOps:<ul>\n<li>Hands-on experience with DevOps practices and tools for building and managing CI/CD pipelines.</li>\n<li>Proficiency with containerization technologies (Docker, Kubernetes) and infrastructure as code (IaC).</li>\n</ul>\n</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>10+ years of progressive, hands-on experience in software development and solution architecture.</li>\n<li>4+ years in a senior role where you were responsible for technical leadership and architectural decisions on complex projects.</li>\n<li>A strong portfolio showcasing successfully designed and delivered enterprise-scale solutions.</li>\n</ul>\n<p><strong>What We're Looking For:</strong></p>\n<ul>\n<li>A Pragmatic Problem-Solver who is versatile, flexible, and prefers hands-on solutions over rigid theoretical models.</li>\n<li>An Excellent Communicator with a natural ability to build relationships and explain complex technical ideas to both technical teams and business stakeholders.</li>\n<li>A Business-Minded Technologist who understands how technology drives business outcomes and is always looking for opportunities to add value.</li>\n<li>A Proactive and Self-Driven Leader who takes complete ownership, from a project's initial concept to its final delivery and beyond.</li>\n<li>A Collaborative Mentor who enjoys working with teams, sharing knowledge, and helping others grow.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com\nClosing Date: 14, Aug 2025\nJob Published: 08, Aug 2025</p>",
        "tags": [
            "10+ Years",
            ".NET/Core",
            "Azure",
            "SharePoint"
        ],
        "summary": "Seeking a Senior Technology Architect to drive technical vision, lead development teams, and design enterprise solutions. Requires expertise in .NET/Core, Azure, JavaScript, and DevOps to contribute to business growth."
    },
    {
        "job_title": "Data Engineering - Project Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22633",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Data Engineering - Project Manager</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a highly experienced Data Engineering Project Manager to lead the end-to-end delivery of data platform, AI, BI, and analytics projects. The ideal candidate will have a strong background in data engineering, analytics, and AI/ML, with a proven track record of managing cross-functional teams and delivering high-quality, scalable solutions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Own the end-to-end delivery of data platform, AI, BI, and analytics projects, ensuring alignment with business objectives and stakeholder expectations.</li>\n<li>Develop and maintain comprehensive project plans, roadmaps, and timelines for data ingestion, transformation, governance, AI/ML models, and analytics deliverables.</li>\n<li>Lead cross-functional teams including data engineers, data scientists, BI analysts, architects, and business stakeholders to deliver high-quality, scalable solutions on time and within budget.</li>\n<li>Define, prioritize, and manage product and project backlogs covering data pipelines, data quality, governance, AI services, and BI dashboards or reporting tools.</li>\n<li>Collaborate closely with business units to capture and translate requirements into actionable user stories and acceptance criteria for data and analytics solutions.</li>\n<li>Oversee BI and analytics area including dashboard development, embedded analytics, self-service BI enablement, and ad hoc reporting capabilities.</li>\n<li>Ensure data quality, lineage, security, and compliance requirements are integrated throughout the project lifecycle, in collaboration with governance and security teams.</li>\n<li>Coordinate UAT, performance testing, and user training to ensure adoption and successful rollout of data and analytics products.</li>\n<li>Act as the primary point of contact for all project stakeholders, providing regular status updates, managing risks and issues, and escalating as necessary.</li>\n<li>Facilitate agile ceremonies such as sprint planning, backlog grooming, demos, and retrospectives, fostering a culture of continuous improvement.</li>\n<li>Drive post-deployment monitoring and optimization of data and BI solutions to meet evolving business needs and performance standards.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Overall 13+ Years of Experience in IT with 6+ years of experience as a Technical Product Manager, Technical Program Manager, or Delivery Lead.</li>\n<li>Hands-on development experience in data engineering, including data pipelines, ETL processes, and data integration workflows</li>\n<li>Proven track record managing data engineering, analytics, or AI/ML projects end to end</li>\n<li>Solid understanding of modern data architecture: data lakes, warehouses, pipelines, ETL/ELT, governance, and AI tooling</li>\n<li>Hands-on familiarity with cloud platforms (e.g., Azure, AWS, GCP) and DataOps/MLOps practices</li>\n<li>Strong knowledge of Agile methodologies, sprint planning, and backlog grooming</li>\n<li>Excellent communication and stakeholder management skills, including working with senior execs and technical leads</li>\n<li>Background in computer science, engineering, data science, or analytics</li>\n<li>Experience or Solid Understanding with data engineering tools and services in AWS, Azure &amp; GCP</li>\n<li>Exposure or Solid Understanding of BI, Analytics, LLMs, RAG, prompt engineering, or agent-based AI systems</li>\n<li>Experience leading cross-functional teams in matrixed environments</li>\n<li>Certifications: PMP, CSM, SAFe, or equivalent are a plus</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please Note:</strong> Reflections Info Systems never seeks payment for jobs. Contact careers@reflectionsinfos.com for any clarification/alerts.</p>",
        "tags": [
            "13+ Years",
            "Data Engineering",
            "Agile Methodologies",
            "Cloud Platforms"
        ],
        "summary": "Seeking a Data Engineering Project Manager to lead data platform, AI, and BI projects. Requires 13+ years of experience and expertise in data architecture and cloud platforms."
    },
    {
        "job_title": "Technical Project Manager (Application Development)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22632",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Technical Project Manager (Application Development)</h2>\n<p>Reflections Info Systems is seeking a highly experienced Technical Project Manager (Tech PM) to lead the end-to-end execution of custom application development and integration projects. These projects are primarily built on .NET stacks with modern client frameworks and integration platforms. The ideal candidate will possess a strong technical foundation and project delivery expertise, with the ability to drive complex, cross-functional initiatives from discovery through production rollout.</p>\n<p>This role demands hands-on experience across the full software/product development lifecycle, including planning, estimation, design, development, testing, and release. The candidate will work closely with engineering, product, and client stakeholders.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage end-to-end delivery of custom software development and integration projects using Java, .NET, and related technologies.</li>\n<li>Create and maintain project plans, define timelines, identify dependencies, and track progress.</li>\n<li>Coordinate with cross-functional teams including developers, QA, UI/UX, and DevOps to ensure smooth execution.</li>\n<li>Oversee all stages of the SDLC: requirements finalization, development, integration, testing (unit, system, UAT, NFR), and deployment.</li>\n<li>Work closely with architects and leads to ensure alignment with technical direction and design.</li>\n<li>Identify and manage risks, scope changes, and schedule adjustments proactively.</li>\n<li>Serve as the primary point of contact for clients and stakeholders, providing regular updates and resolving issues.</li>\n<li>Ensure quality and timely delivery through effective team coordination and clear communication.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Technical &amp; Delivery Expertise</strong></p>\n<ul>\n<li>13+ years of overall IT experience, with 4–6 years of Technical Project Management experience.</li>\n<li>Strong understanding of custom application development on Java/.NET stacks.</li>\n<li>Experience managing:<ul>\n<li>Backend/API development</li>\n<li>Integration using tools like Apache Camel, IBM Integration Stack</li>\n<li>Database interactions (Oracle, SQL Server)</li>\n<li>Client-side development using React/Angular</li>\n<li>Deployment on cloud platforms (AWS, Azure)</li>\n</ul>\n</li>\n<li>Familiarity with Microservices architecture, CI/CD pipelines, and DevOps practices.</li>\n</ul>\n<p><strong>Project Management</strong></p>\n<ul>\n<li>Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li>Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.</li>\n<li>Tools: Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</li>\n</ul>\n<p><strong>Secondary Skills</strong></p>\n<ul>\n<li>Experience managing globally distributed teams.</li>\n<li>Strong understanding of enterprise-level integrations and technology ecosystems.</li>\n</ul>\n<p><strong>Soft Skills</strong></p>\n<ul>\n<li>Excellent communication and stakeholder engagement capabilities.</li>\n<li>Strong leadership, problem-solving, and organizational skills.</li>\n<li>Ability to articulate technical topics to both technical and non-technical audiences.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Note:</strong> Reflections Info Systems never seeks payment for jobs. They contact candidates only through their official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Java",
            "Project Management"
        ],
        "summary": "Seeking a Technical Project Manager to lead custom application development and integration projects using .NET and Java. Requires 13+ years of IT experience and expertise in SDLC and project management."
    },
    {
        "job_title": "Mid Data Scientist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22631",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Mid Data Scientist</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly motivated and experienced Mid Data Scientist to join our team. </p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the development and deployment of machine learning/deep learning models to address key business challenges.</li>\n<li>Apply statistical modeling, data preprocessing, feature engineering, machine learning, and deep learning techniques to build and improve models.</li>\n<li>Have expertise in at least two of the following areas: computer vision, predictive analytics, natural language processing, time series analysis, recommendation systems.</li>\n<li>Expertise in GenAI models is a must.</li>\n<li>Design, implement, and optimize data pipelines for model training and deployment.</li>\n<li>Experience with any one of the model serving frameworks (e.g.,TensorFlow Serving, TorchServe, KServe, or similar).</li>\n<li>Design and implement APIs for model serving and integration with other systems.</li>\n<li>Collaborate with cross-functional teams to define project requirements, develop solutions, and communicate results.</li>\n<li>Mentor junior data scientists, providing guidance on technical skills and project execution.</li>\n<li>Stay up-to-date with the latest advancements in data science and machine learning, particularly in generative AI, and evaluate their potential applications.</li>\n<li>Communicate complex technical concepts and analytical findings to both technical and non-technical audiences.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>5+ years of experience.</li>\n<li>Strong knowledge of statistical modeling, machine learning, deep learning and GenAI.</li>\n<li>Proficiency in Python and experience optimizing code for performance.</li>\n<li>Experience with data preprocessing, feature engineering, data visualization and hyperparameter tuning.</li>\n<li>Solid understanding of database concepts and experience working with large datasets.</li>\n<li>Experience deploying and scaling machine learning models in a production environment.</li>\n<li>Familiarity with machine learning operations (MLOps) and related tools.</li>\n<li>Good understanding of Generative AI concepts and LLM finetuning.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Bachelor's or Master's degree in a quantitative field such as statistics, mathematics, computer science, or a related area.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Python</li>\n<li>Data Science concepts</li>\n<li>Generative AI</li>\n<li>Pandas, NumPy, Matplotlib</li>\n<li>Artificial Intelligence</li>\n<li>Statistical Modeling</li>\n<li>Machine Learning, Natural Language Processing (NLP), Deep Learning</li>\n<li>Model Serving Frameworks (e.g., TensorFlow Serving, TorchServe)</li>\n<li>MLOps(e.g; MLflow, Tensorboard, Kubeflow etc)</li>\n<li>Computer Vision</li>\n<li>Predictive Analytics</li>\n<li>Time Series Analysis</li>\n<li>Anomaly Detection</li>\n<li>Recommendation Systems</li>\n<li>SQL</li>\n<li>Proficent in any of Cloud Computing Platforms (e.g., AWS, Azure, GCP)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Fraud Alert:</strong>\nPlease note that Reflections Info Systems never asks for fees for job applications. Contact careers@reflectionsinfos.com for any clarification.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "5+ Years",
            "Python",
            "Generative AI",
            "Machine Learning"
        ],
        "summary": "Reflections Info Systems seeks a Mid Data Scientist to develop and deploy ML models. The role involves statistical modeling, GenAI expertise, and collaboration to address business challenges."
    },
    {
        "job_title": "Data Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22630",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Data Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Data Architect to join our team. We are looking for a candidate with 10+ years of experience to design and architect large data platforms, analytics, and AI solutions.</p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work as part of a team to design and architect large data platforms, analytics, and AI solutions.</li>\n<li>Participate in the development of cloud data warehouses, data as a service, and business intelligence solutions.</li>\n<li>Provide forward-thinking solutions in data integration.</li>\n<li>Programming experience in Scala or Python, SQL.</li>\n<li>Working experience in Apache Spark is highly preferred.</li>\n<li>Familiarity with AWS and Azure Services like S3, ADLS Gen2, AWS, Redshift, AWS Glue, Azure Data Factory, Azure Synapse</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor's or Master's degree in Computer Science or a related field.</li>\n<li>7+ years of hands-on experience in Data Engineering, Building Data Pipelines, Warehouses, Architecting Data platforms, Data Models, Data Science, AI use cases etc.</li>\n<li>Proven experience as a Data Architect or in a similar role.</li>\n<li>Proficiency in developing and maintaining data architecture, ensuring its scalability, security, and alignment with business objectives.</li>\n<li>Good experience in MDM/PIM Solution Implementation.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Excellent communication and interpersonal skills, with the ability to articulate ideas and discuss technical concepts with both technical and non-technical team members.</li>\n<li>Clear and effective documentation, code comments, and the ability to write technical reports or emails are essential.</li>\n<li>Collaboration is often an integral part of Data Projects. Being able to work well with others, share knowledge, and contribute positively to a team is crucial.</li>\n<li>Strong problem-solving and analytical skills, with the ability to make sound decisions under pressure.</li>\n<li>Efficiently managing one's time and meeting deadlines is critical in a fast-paced development environment.</li>\n<li>Understanding the needs and expectations of end-users or clients and developing solutions that meet or exceed those expectations.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>AWS/ other Cloud Services Architect Certifications</li>\n<li>SnowPro Core Certification</li>\n<li>Databricks Professional level Certification</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>Please note that no payment is ever sought for jobs in Reflections Info Systems. We contact our candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>\n<p><strong>Closing Date:</strong> 14, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>",
        "tags": [
            "10+ Years",
            "Data Architecture",
            "Cloud Data Warehouse",
            "Data Engineering",
            "AWS/Azure"
        ],
        "summary": "Reflections Info Systems is hiring a Data Architect with 10+ years of experience. Responsibilities include designing data platforms, analytics, and AI solutions."
    },
    {
        "job_title": "Enterprise Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22629",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Enterprise Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking an experienced Enterprise Architect to design, develop, and manage the organization’s overall technology infrastructure. The ideal candidate will align IT strategies with business goals, ensure effective system integration, and create a robust, scalable IT landscape. This role requires deep expertise in business processes, technology trends, and architecture frameworks to drive innovation and optimize efficiency.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Strategic Planning</strong></li>\n<li>Collaborate with senior management to understand business objectives and formulate a comprehensive IT strategy.</li>\n<li>Define and articulate the enterprise architecture vision, roadmap, and standards.</li>\n<li>Assess the current IT landscape, identifying gaps, risks, and opportunities.</li>\n<li>\n<p>Conduct feasibility studies and evaluate the risks and benefits of new technology initiatives.</p>\n</li>\n<li>\n<p><strong>Architecture Design</strong></p>\n</li>\n<li>Design and document enterprise architecture blueprints.</li>\n<li>Develop and oversee solution architectures for new projects.</li>\n<li>Define technology standards, guidelines, and best practices.</li>\n<li>\n<p>Ensure the adoption of architectural principles across all IT projects.</p>\n</li>\n<li>\n<p><strong>Technical Leadership</strong></p>\n</li>\n<li>Provide technical expertise and guidance to project teams.</li>\n<li>Lead architecture review boards.</li>\n<li>Stay updated on emerging technologies and industry trends.</li>\n<li>\n<p>Evaluate and recommend new technologies.</p>\n</li>\n<li>\n<p><strong>Communication and Collaboration</strong></p>\n</li>\n<li>Act as a bridge between business stakeholders, IT teams, and vendors.</li>\n<li>Present complex technical concepts to non-technical audiences.</li>\n<li>Collaborate with architects across data, security, and cloud disciplines.</li>\n<li>\n<p>Advise senior management on the business impact of technology decisions.</p>\n</li>\n<li>\n<p><strong>Governance and Compliance</strong></p>\n</li>\n<li>Ensure the enterprise architecture complies with regulations, security standards, and compliance requirements.</li>\n<li>Monitor the implementation of architectural standards and enforce governance policies.</li>\n<li>Conduct regular architecture reviews to identify risks and recommend mitigation strategies.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Technical Expertise</strong></li>\n<li>Proficiency in enterprise architecture frameworks (e.g., TOGAF, Zachman) and modelling tools.</li>\n<li>In-depth knowledge of cloud computing, distributed systems, data management, application development, and network architecture.</li>\n<li>\n<p>Familiarity with programming languages and development methodologies.</p>\n</li>\n<li>\n<p><strong>Business Acumen</strong></p>\n</li>\n<li>Strong analytical skills to translate business needs into technical solutions.</li>\n<li>Comprehensive understanding of business processes and technology optimization opportunities.</li>\n<li>\n<p>Excellent communication and presentation skills.</p>\n</li>\n<li>\n<p><strong>Leadership and Collaboration</strong></p>\n</li>\n<li>Demonstrated ability to lead cross-functional teams.</li>\n<li>Strong collaboration skills.</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>Proven experience as an Enterprise Architect, preferably within IT services.</li>\n<li>A successful track record in designing and implementing enterprise-wide IT solutions.</li>\n<li>Experience managing large-scale technology transformations and migration projects.</li>\n</ul>\n<p><strong>Domain Expertise:</strong></p>\n<ul>\n<li>Proven exposure to the BFSI (Banking, Financial Services, and Insurance) domain. Experience in Retail and Healthcare domains is also preferred.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Certification in enterprise architecture frameworks such as TOGAF or Zachman.</li>\n<li>Knowledge of DevOps practices and tools.</li>\n<li>Experience with modern technology stacks and microservices-based architectures.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not charge any fees for job opportunities. Be cautious of fraudulent job offers.</p>",
        "tags": [
            "10+ Years",
            "TOGAF",
            "BFSI Domain",
            "Cloud Computing"
        ],
        "summary": "Reflections Info Systems is looking for an experienced Enterprise Architect to align IT strategies with business goals. The candidate should have a strong background in BFSI and enterprise architecture frameworks."
    },
    {
        "job_title": "Data Engineer- MDM/PIM/Atacama/Informatica",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22628",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Data Engineer - MDM/PIM/Atacama/Informatica</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Data Engineer with 6+ years of experience to join our team. You will participate in the development of cloud data warehouses, data as a service, and business intelligence solutions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work as part of a team to develop Data and Analytics solutions.</li>\n<li>Participate in the development of cloud data warehouses, data as a service, business intelligence solutions</li>\n<li>Ability to provide solutions that are forward-thinking in data integration.</li>\n<li>Deliver a quality product.</li>\n<li>Developing Modern Data Warehouse solutions using Azure or AWS Stack</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>6+ years of experience as a Data Engineer, who played a key/lead role in implementing one or two large data solutions</li>\n<li>Programming experience in Scala or Python, SQL</li>\n<li>Min 1+ years experience in MDM/PIM Solution Implementation with tools like Ataccama, Syndigo, Informatica</li>\n<li>Min 2+ years experience in Data Engineering Pipelines, Solutions implementation in Snowflake</li>\n<li>Min 2+ years experience in Data Engineering Pipelines, Solutions implementation in Databricks</li>\n<li>Working knowledge of with some of these AWS and Azure Services like S3, ADLS Gen2, AWS Redshift, AWS Glue, Azure Data Factory, Azure Synapse</li>\n<li>Demonstrated analytical and problem-solving skills</li>\n<li>Excellent written and verbal skills (English)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Familiar with Agile Practices</li>\n<li>Familiar with Version control platforms GIT, CodeCommit etc.</li>\n<li>Problem Solving – Think of various options to solve the problem. Focus on completion, and not on duration spent.</li>\n<li>Ownership</li>\n<li>Proactive rather than reactive</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science &amp; engineering or equivalent demonstrable experience</li>\n<li>Desirable to have Cloud Certifications in Data, Analytics, or Ops/Architect space.</li>\n</ul>\n<p><strong>Contact:</strong>\nInterested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Company Information:</strong>\nReflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "6+ Years",
            "Data Engineering",
            "MDM/PIM",
            "Snowflake"
        ],
        "summary": "Reflections Info Systems is hiring a Data Engineer to develop data solutions. The ideal candidate has experience with MDM/PIM, Snowflake, Databricks and cloud technologies."
    },
    {
        "job_title": "Cloud Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22627",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Cloud Infrastructure Architect</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a highly experienced Cloud Infrastructure Architect to join our team.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable cloud infrastructure solutions.</li>\n<li>Lead cloud adoption strategies, migration roadmaps, and workload assessments.</li>\n<li>Provide infrastructure expertise to design cloud-native and on-premise solution architectures.</li>\n<li>Architect infrastructure solutions for AI/ML platforms, including training, inference, pipelines, and GPU/TPU setups.</li>\n<li>Ensure infrastructure security, compliance, and adherence to industry best practices.</li>\n<li>Design and implement new capabilities that address gaps and provide an integrated, end-to-end, scalable service.</li>\n<li>Collaborate with external vendors, partners, and stakeholders to ensure successful integration and implementation of infrastructure solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 8 years of experience in the design, implementation, and maintenance of infrastructure solutions.</li>\n<li>Experience in at least 5 projects involving enterprise-level cloud architecture and implementation.</li>\n<li>Proven expertise in designing and implementing large-scale microservices architectures, distributed systems, and integration architectures.</li>\n<li>Hands-on experience in large-scale cloud migration projects.</li>\n<li>Experience in setting up infrastructure for ML workloads, including training, inference, and GPU/TPU provisioning.</li>\n<li>Solid experience in data center operations, including the implementation and support of private and hybrid cloud environments.</li>\n<li>Strong experience with VMware technologies such as vSphere, ESXi, and vCenter.</li>\n<li>Hands-on expertise in infrastructure domains including networking, authentication, compute, and storage.</li>\n<li>Experience in responding to RFPs, preparing solution designs, and performing estimations and costing.</li>\n<li>Strong knowledge of Docker and Kubernetes, with hands-on experience deploying ML workloads.</li>\n<li>Proficient in Infrastructure as Code (IaC) using tools such as Ansible, Terraform, ARM Templates, and CloudFormation.</li>\n<li>Good understanding of SQL and NoSQL databases.</li>\n<li>Deep expertise in DevOps practices, containerization, and CI/CD pipelines.</li>\n<li>Experience with monitoring tools such as Nagios, Splunk, New Relic, or Prometheus.</li>\n<li>Experience working on projects with compliance requirements such as GDPR, PCI DSS, and HIPAA.</li>\n<li>Strong technical knowledge of cloud technologies and virtualization platforms (e.g., VMware, Hyper-V, Cisco, Microsoft, EMC, AWS).</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience with infrastructure services such as LDAP, DNS, DHCP, and Active Directory.</li>\n<li>Excellent communication, documentation, and presentation skills.</li>\n<li>Proficiency in scripting languages such as Python, Bash, or PowerShell for automation tasks.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>AWS/Azure/GCP Architect Certifications</li>\n<li>Kubernetes Certifications (CKA/CKAD)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>Please note that Reflections Info Systems does not charge any fees for job applications. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. For any clarification or alerts, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "8+ Years",
            "Cloud Architecture",
            "Kubernetes",
            "VMware"
        ],
        "summary": "Reflections Info Systems is looking for a Cloud Infrastructure Architect to design and maintain scalable cloud solutions. The role involves leading cloud adoption and ensuring infrastructure security and compliance."
    },
    {
        "job_title": "Lead Data Scientist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22626",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Lead Data Scientist</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 14, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with <strong>8+ years of experience</strong> for the Lead Data Scientist role.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Lead a high-performance team, guiding and mentoring them on the latest technology landscape, patterns, and design standards to prepare them for new roles and responsibilities.</li>\n<li>Provide strategic direction and technical leadership for AI initiatives, guiding the team in designing and implementing state-of-the-art AI solutions.</li>\n<li>Lead the design and architecture of complex AI systems, ensuring scalability, reliability, and performance.</li>\n<li>Lead the development and deployment of machine learning/deep learning models to address key business challenges.</li>\n<li>Apply statistical modeling, data preprocessing, feature engineering, machine learning, and deep learning techniques to build and improve models.</li>\n<li>Utilize expertise in at least two of the following areas: computer vision, predictive analytics, natural language processing, time series analysis, recommendation systems.</li>\n<li>Design, implement, and optimize data pipelines for model training and deployment.</li>\n<li>Experience with model serving frameworks (e.g., TensorFlow Serving, TorchServe, KServe, or similar).</li>\n<li>Design and implement APIs for model serving and integration with other systems.</li>\n<li>Collaborate with cross-functional teams to define project requirements, develop solutions, and communicate results.</li>\n<li>Mentor junior data scientists, providing guidance on technical skills and project execution.</li>\n<li>Stay up-to-date with the latest advancements in data science and machine learning, particularly in generative AI, and evaluate their potential applications.</li>\n<li>Communicate complex technical concepts and analytical findings to both technical and non-technical audiences.</li>\n<li>Serve as a primary point of contact for client managers and liaise frequently with internal stakeholders to gather data or inputs needed for project work</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>A minimum of 8 years of professional experience, with at least 6 years in a data science role.</li>\n<li>Strong knowledge of statistical modeling, machine learning, deep learning, and GenAI.</li>\n<li>Proficiency in Python and hands-on experience optimizing code for performance.</li>\n<li>Experience with data preprocessing, feature engineering, data visualization, and hyperparameter tuning.</li>\n<li>Solid understanding of database concepts and experience working with large datasets.</li>\n<li>Experience deploying and scaling machine learning models in a production environment.</li>\n<li>Familiarity with machine learning operations (MLOps) and related tools.</li>\n<li>Good understanding of Generative AI concepts and LLM finetuning.</li>\n<li>Excellent communication and collaboration skills.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills</strong></p>\n<ul>\n<li>Python</li>\n<li>Data Science concepts</li>\n<li>Pandas, NumPy, Matplotlib</li>\n<li>Artificial Intelligence</li>\n<li>Statistical Modeling</li>\n<li>Machine Learning, Natural Language Processing (NLP), Deep Learning</li>\n<li>Model Serving Frameworks (e.g., TensorFlow Serving, TorchServe)</li>\n<li>MLOps(e.g; MLflow, Tensorboard, Kubeflow etc)</li>\n<li>Computer Vision, Predictive Analytics, Time Series Analysis, Anomaly Detection, Recommendation Systems (At least 2)</li>\n<li>Generative AI, RAG, Finetuning(LoRa, QLoRa)</li>\n<li>Proficient in any of Cloud Computing Platforms (e.g., AWS, Azure, GCP)</li>\n</ul>\n<p><strong>Secondary Skills</strong></p>\n<ul>\n<li>Expertise in designing scalable and efficient model architectures is crucial for developing robust AI solutions.</li>\n<li>Ability to assess and forecast the financial requirements of data science projects ensures alignment with budgetary constraints and organizational goals.</li>\n<li>Strong communication skills are vital for conveying complex technical concepts to both technical and non-technical stakeholders.</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details. This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn, and all employment-related mails are sent through the official HR email id. Please contact <a href=\"mailto:careers@reflectionsinfos.com\">careers@reflectionsinfos.com</a> for any clarification/ alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            "Python",
            "Machine Learning",
            "Generative AI"
        ],
        "summary": "Reflections Info Systems is seeking a Lead Data Scientist to guide AI initiatives and lead a high-performance team. The role involves designing AI systems, deploying ML models, and mentoring junior data scientists."
    },
    {
        "job_title": "Experienced Java Developer",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/22625",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>iBoson Innovations - Experienced Java Developer</h2>\n<p><strong>About iBoson Innovations:</strong>\niBoson is an AI-first product company specializing in cutting-edge technologies. They are building new product lines and seeking passionate team members to join their dynamic team.</p>\n<p><strong>Job Description:</strong>\nAs a Senior Java Developer, you will be responsible for designing, developing, and deploying scalable backend solutions and services using Java, Spring Boot, and Microservices architecture. You will collaborate closely with cross-functional teams to deliver high-quality software solutions while ensuring best practices in coding, testing, and deployment.</p>\n<p><strong>Key Responsibilities:</strong>\n- Design, develop, and maintain Java-based applications\n- Write clean, maintainable, and efficient code\n- Participate in code reviews and mentor junior developers\n- Collaborate with cross-functional teams to define and implement new features\n- Troubleshoot and resolve complex technical issues\n- Contribute to architectural decisions and technical documentation\n- Ensure application performance, quality, and responsiveness</p>\n<p><strong>Preferred Skills:</strong>\n- 5+ years of professional Java development experience\n- Strong knowledge of Spring Framework (Spring Boot, Spring MVC, Spring Data)\n- Experience with RESTful API design and implementation\n- Proficiency in database technologies (SQL, NoSQL)\n- Experience with build tools like Maven or Gradle\n- Understanding of microservices architecture\n- Knowledge of containerization (Docker, Kubernetes)\n- Experience with version control systems (Git)\n- Experience with reactive programming (Project Reactor, RxJava)\n- Knowledge of cloud platforms (AWS, Azure, GCP)\n- Experience with messaging systems (Kafka, RabbitMQ)\n- Familiarity with CI/CD pipelines\n- Understanding of security best practices\n- Experience with testing frameworks (JUnit, Mockito)\n- Bachelor's degree in Computer Science, Engineering, or related field (or equivalent practical experience)</p>\n<p><strong>Contact Information:</strong>\n- Email: career@ibosoninnov.com\n- Website: http://www.iboson.io\n- Address: ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581</p>\n<p><strong>Closing Date:</strong> 14, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>\n<p>If you are someone who takes full ownership of responsibilities, embraces challenges, and delivers results in a fast-paced, time-oriented environment without pressure, we’d love to hear from you!</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Microservices"
        ],
        "summary": "iBoson Innovations is seeking a Senior Java Developer to design, develop, and deploy scalable backend solutions using Java, Spring Boot, and Microservices architecture. The role involves collaborating with cross-functional teams to deliver high-quality software."
    },
    {
        "job_title": "Full Stack Developer (Python + React)_Remote",
        "company": "Saasvaap Techies (P) Ltd",
        "url": "https://technopark.org/job-details/22624",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Full Stack Developer (Python + React) - Remote</h2>\n<p>Saasvaap Techies (P) Ltd is looking for a Full Stack Developer to build and maintain scalable web applications.</p>\n<p><strong>Location:</strong> Remote</p>\n<p><strong>Closing Date:</strong> 29, Aug 2025</p>\n<p><strong>Contact Email:</strong> careers@saasvaap.com</p>\n<p><strong>Responsibilities:</strong>\n- Build and maintain scalable web applications.</p>\n<p><strong>Must-Have Skills:</strong>\n- React.js, JavaScript, HTML/CSS\n- Python (Django or Flask)\n- REST APIs, Git, SQL/NoSQL databases</p>\n<p><strong>Nice to Have:</strong>\n- Docker, AWS, CI/CD, GraphQL</p>\n<p><strong>Preferred Skills:</strong>\n- Python &amp; React</p>\n<p><strong>Experience:</strong>\n- 3+ years of experience</p>\n<p><strong>Company Information:</strong>\nSaasvaap Techies (P) Ltd\nModule No.B-11, B-12, 3rd Floor, Gayatri Building, Phase-I Campus, Technopark, Thiruvananthapuram, 695581\nwww.saasvaap.com</p>",
        "tags": [
            "3+ Years",
            "React.js",
            "Python",
            "REST APIs"
        ],
        "summary": "Saasvaap Techies is seeking a remote Full Stack Developer with Python and React experience. The role involves building and maintaining scalable web applications."
    },
    {
        "job_title": "Educator & Podcast Presenter",
        "company": "Richinnovations Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22623",
        "location": "Technopark",
        "closing_date": "14 Sep 2025",
        "job_description": "<h2>Educator &amp; Podcast Presenter</h2>\n<p><strong>Richinnovations Technologies (P) Ltd</strong> is seeking a passionate and motivated individual to join our team as an Educator &amp; Podcast Presenter. This full-time, contract-based role offers a unique opportunity to earn while you learn, supporting your own studies for competitive exams while gaining valuable experience.</p>\n<p><strong>Contact Information:</strong>\n*   <strong>Address:</strong> KSUM, Ground floor, Tejaswini Building, Technopark, Kazhakuttom, Trivandrum, Kerala, India, 695581\n*   <strong>Website:</strong> <a href=\"https://www.richinnovationsplc.com\">https://www.richinnovationsplc.com</a>\n*   <strong>Email:</strong> hr@richinnovations.in</p>\n<p><strong>Closing Date:</strong> 14, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>\n<h3>Brief Description</h3>\n<p>This role is ideal for female candidates preparing for competitive exams such as UPSC Civil Services, SSC, and Kerala PSC. You will contribute to a new platform for competitive exam aspirants by creating content and hosting podcasts. Fluency in English and Malayalam, along with strong communication skills, are essential.</p>\n<h3>What You’ll Do:</h3>\n<ul>\n<li>Host podcasts related to exam preparation, providing valuable insights and guidance to aspirants.</li>\n<li>Create engaging study material to help learners understand key concepts effectively.</li>\n<li>Contribute ideas to enhance content delivery and make learning more interactive and impactful.</li>\n<li>Collaborate with the team to shape the platform in its early stages and improve the overall learning experience.</li>\n</ul>\n<h3>What We’re Looking For:</h3>\n<ul>\n<li>Strong knowledge of competitive exams (UPSC Civil Services, SSC, Kerala PSC, and other similar exams).</li>\n<li>Experience in clearing preliminary rounds or reaching the interview stage is a plus.</li>\n<li>Awareness of other competitive exams (conducted by the Union and State Governments) is beneficial.</li>\n<li>Bachelor’s degree in any field.</li>\n<li>Good command of English and Malayalam.</li>\n<li>A good, energetic voice with strong presentation skills for audio podcasts—no prior experience required.</li>\n<li>Active on social media and familiar with content trends (preferred but not required).</li>\n<li>Self-motivated, proactive, and full of ideas.</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>Full-time position with a flexible work environment – work from anywhere at your convenience.</li>\n<li>A platform to showcase your expertise and help aspirants succeed.</li>\n<li>A creative and supportive environment where your ideas matter.</li>\n<li>No prior work experience required – just passion and knowledge.</li>\n<li>Collaborate with a talented and creative team in a supportive culture.</li>\n<li>Continuous learning and professional development opportunities.</li>\n<li>Contract-based role with the potential to convert into a permanent position based on performance.</li>\n</ul>",
        "tags": [
            "No Experience",
            "English",
            "Malayalam",
            "Podcast"
        ],
        "summary": "Join Richinnovations as an Educator & Podcast Presenter, creating content for competitive exam aspirants. Ideal for those preparing for exams like UPSC, this role requires fluency in English and Malayalam."
    },
    {
        "job_title": "Business Development Associate (Fresher)",
        "company": "Richinnovations Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22622",
        "location": "Technopark",
        "closing_date": "14 Sep 2025",
        "job_description": "<h2>Business Development Associate (Fresher)</h2>\n<p><strong>Richinnovations Technologies (P) Ltd</strong>\nKSUM, Ground floor, Tejaswini Building, Technopark, Kazhakuttom, Trivandrum, Kerala, India, 695581\n<a href=\"https://www.richinnovationsplc.com\">https://www.richinnovationsplc.com</a></p>\n<p><strong>Closing Date:</strong> 14, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> hr@richinnovations.in</p>\n<p><strong>Brief Description:</strong></p>\n<p>Motivated and dynamic female candidates are invited to join our client’s marketing team as Business Development Associate. This role is well-suited for recent graduates or those awaiting their final results, offering an excellent opportunity for freshers with a strong interest in marketing and business development.</p>\n<p>In this remote position, you will be responsible for identifying new business opportunities, managing relationships with internal and external stakeholders, and contributing to the success of creative animation and edutainment projects. Working closely with senior management and cross-functional teams, you will help develop and execute business strategies aimed at driving revenue growth and expanding market presence.</p>\n<p>Proficiency in social media platforms and digital marketing tools is highly valued, as it will support outreach initiatives and strengthen the overall impact of the team. This position provides significant potential for professional growth and skill development within a collaborative and dynamic environment.</p>\n<p>More details and a direct application option for faster processing are available on our client’s Careers page at animations.media. If you are ready to contribute to the company’s success and advance your career in business development, we encourage you to apply.</p>\n<p><strong>Preferred Skills &amp; Qualifications:</strong></p>\n<ul>\n<li><strong>Qualification:</strong></li>\n<li>B.Tech/MBA in any stream or a degree in technology-related subjects.</li>\n<li>\n<p>Candidates with backlogs are also eligible to apply for this position.</p>\n</li>\n<li>\n<p><strong>Communication:</strong></p>\n</li>\n<li>Excellent written and verbal communication skills in English.</li>\n<li>\n<p>Strong client-facing skills and the ability to effectively engage with diverse stakeholders.</p>\n</li>\n<li>\n<p><strong>Digital Marketing:</strong></p>\n</li>\n<li>Passion for staying updated on the latest digital marketing trends and technologies.</li>\n<li>\n<p>Experience with digital marketing tools and platforms is a plus.</p>\n</li>\n<li>\n<p><strong>Analytical Skills:</strong></p>\n</li>\n<li>Strong analytical skills and a data-driven approach to decision-making.</li>\n<li>\n<p>Proficiency in marketing research and analysis.</p>\n</li>\n<li>\n<p><strong>Organizational Skills:</strong></p>\n</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Proactive attitude with a willingness to learn, take initiative, and adapt to changing priorities.</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>A flexible work environment with a completely remote working facility.</li>\n<li>Competitive salary and an excellent opportunity to start your career.</li>\n<li>Dynamic and collaborative company culture with a focus on innovation and continuous learning.</li>\n</ul>",
        "tags": [
            "0 Years",
            "Business Development",
            "Digital Marketing",
            "Communication Skills"
        ],
        "summary": "Seeking a motivated Business Development Associate to identify opportunities and manage relationships within a dynamic marketing team. This remote role offers growth potential and a collaborative culture."
    },
    {
        "job_title": "TECHNICAL ARCHITECT (7 + Years Exp)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22621",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Technical Architect</h2>\n<p><strong>REIZEND (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>\n<p><strong>Contact Email:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>\n<h3>Brief Description</h3>\n<ol>\n<li>\n<p><strong>Designing Technology Systems:</strong></p>\n<ul>\n<li>Plan and design the structure of technology solutions.</li>\n<li>Work with design and development teams to assist with the process.</li>\n</ul>\n</li>\n<li>\n<p><strong>Communicating:</strong></p>\n<ul>\n<li>Communicate system requirements to software development teams.</li>\n<li>Explain plans to developers and designers.</li>\n<li>Communicate the value of a solution to stakeholders and clients.</li>\n</ul>\n</li>\n<li>\n<p><strong>Managing Stakeholders:</strong></p>\n<ul>\n<li>Work with clients and stakeholders to understand their vision for the systems.</li>\n<li>Manage stakeholder expectations.</li>\n</ul>\n</li>\n<li>\n<p><strong>Architectural Oversight:</strong></p>\n<ul>\n<li>Develop and implement robust architectures for AI/ML and data science solutions, ensuring scalability, security, and performance.</li>\n<li>Oversee architecture for data-driven web applications and data science projects, providing guidance on best practices in data processing, model deployment, and end-to-end workflows.</li>\n</ul>\n</li>\n<li>\n<p><strong>Problem Solving:</strong></p>\n<ul>\n<li>Identify and troubleshoot technical problems in existing or new systems.</li>\n<li>Assist with solving technical problems when they arise.</li>\n</ul>\n</li>\n<li>\n<p><strong>Ensuring Quality:</strong></p>\n<ul>\n<li>Ensure systems meet security and quality standards.</li>\n<li>Monitor systems to ensure they meet both user needs and business goals.</li>\n</ul>\n</li>\n<li>\n<p><strong>Project Management:</strong></p>\n<ul>\n<li>Break down project requirements into manageable pieces of work.</li>\n<li>Organise the workloads of technical teams.</li>\n</ul>\n</li>\n<li>\n<p><strong>Tool &amp; Framework Expertise:</strong></p>\n<ul>\n<li>Utilise relevant tools and technologies, including but not limited to LLMs, TensorFlow, PyTorch, Apache Spark, cloud platforms (AWS, Azure, GCP), Web App development frameworks and DevOps practices.</li>\n</ul>\n</li>\n<li>\n<p><strong>Continuous Improvement:</strong></p>\n<ul>\n<li>Stay current on emerging technologies and methods in AI, ML, data science, and web applications, bringing insights back to the team to foster continuous improvement.</li>\n</ul>\n</li>\n</ol>\n<h3>Preferred Skills</h3>\n<ol>\n<li>Proficiency in AI/ML frameworks such as TensorFlow, PyTorch, Keras, and scikit-learn for developing machine learning and deep learning models.</li>\n<li>Knowledge or experience working with self-hosted or managed LLMs.</li>\n<li>Knowledge or experience with NLP tools and libraries (e.g., SpaCy, NLTK, Hugging Face Transformers) and familiarity with Computer Vision frameworks like OpenCV and related libraries for image processing and object recognition.</li>\n<li>Experience or knowledge in back-end frameworks (e.g., Django, Spring Boot, Node.js, Express etc.) and building RESTful and GraphQL APIs.</li>\n<li>Familiarity with microservices, serverless, and event-driven architectures. Strong understanding of design patterns (e.g., Factory, Singleton, Observer) to ensure code scalability and reusability.</li>\n<li>Proficiency in modern front-end frameworks such as React, Angular, or Vue.js, with an understanding of responsive design, UX/UI principles, and state management (e.g., Redux)</li>\n<li>In-depth knowledge of SQL and NoSQL databases (e.g., PostgreSQL, MongoDB, Cassandra), as well as caching solutions (e.g., Redis, Memcached).</li>\n<li>Expertise in tools such as Apache Spark, Hadoop, Pandas, and Dask for large-scale data processing.</li>\n<li>Understanding of data warehouses and ETL tools (e.g., Snowflake, BigQuery, Redshift, Airflow) to manage large datasets.</li>\n<li>Familiarity with visualisation tools (e.g., Tableau, Power BI, Plotly) for building dashboards and conveying insights.</li>\n<li>Knowledge of deploying models with TensorFlow Serving, Flask, FastAPI, or cloud-native services (e.g., AWS SageMaker, Google AI Platform).</li>\n<li>Familiarity with MLOps tools and practices for versioning, monitoring, and scaling models (e.g., MLflow, Kubeflow, TFX).</li>\n<li>Knowledge or experience in CI/CD, IaC and Cloud Native toolchains.</li>\n<li>Understanding of security principles, including firewalls, VPC, IAM, and TLS/SSL for secure communication.</li>\n<li>Knowledge of API Gateway, service mesh (e.g., Istio), and NGINX for API security, rate limiting, and traffic management.</li>\n</ol>\n<p><strong>Experience Required:</strong> 7 - 12 years of experience</p>\n<p><strong>Salary:</strong> 22-25 LPA</p>",
        "tags": [
            "7+ Years",
            "TensorFlow",
            "PyTorch",
            "Apache Spark"
        ],
        "summary": "Seeking a Technical Architect with 7+ years of experience to design technology systems, oversee AI/ML architectures, and manage stakeholders. The role requires expertise in cloud platforms, various frameworks, and ensuring system quality."
    },
    {
        "job_title": "Senior Full-Stack Developer (3-6 yrs exp)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22620",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Senior Full-Stack Developer</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd</p>\n<p><strong>Location:</strong> Trivandrum, India (Work from office)</p>\n<p><strong>Contact:</strong> careers@reizend.ai</p>\n<p><strong>Job Published:</strong> August 8, 2025</p>\n<p><strong>Closing Date:</strong> September 22, 2025</p>\n<p><strong>Salary:</strong> ₹600,000.00 - ₹1,200,000.00 per year (6-12 LPA)</p>\n<p><strong>Experience Required:</strong> 3–6 years</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced and highly skilled Senior Full Stack Developer with expertise in React.js and Node.js to take a leading role in building complex, scalable, and secure web applications. You will contribute to the architecture and development of both frontend and backend systems, mentor junior developers, and collaborate closely with product and design teams.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead the design, development, and deployment of full-stack applications using React.js (front-end) and Node.js (back-end).</li>\n<li>Architect robust, secure, and scalable backend systems using Express.js and modern API design principles.</li>\n<li>Experience working with microservices architecture, serverless frameworks, and distributed systems.</li>\n<li>Translate business and product requirements into high-quality technical solutions.</li>\n<li>Write high-performance, reusable, and modular code following industry best practices and coding standards.</li>\n<li>Oversee database design, manage complex queries, and optimize performance in MySQL and PostgreSQL.</li>\n<li>Familiarity with build tools like Webpack, Babel, etc., and package managers such as npm or Yarn.</li>\n<li>Develop and maintain comprehensive test coverage through unit and integration tests.</li>\n<li>Conduct code reviews, provide mentorship, and enforce clean code practices across the team.</li>\n<li>Lead troubleshooting and debugging efforts across full-stack environments.</li>\n<li>Contribute to and maintain CI/CD pipelines to ensure reliable deployment processes.</li>\n<li>Collaborate cross-functionally with Product Managers, Designers, QA, and DevOps.</li>\n<li>Ensure applications meet security, accessibility, and performance benchmarks.</li>\n<li>Advocate for and help adopt emerging technologies and AI developer tools like Cursor AI or Cline.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>3–6 years of hands-on experience in full-stack development with a primary focus on React.js and Node.js or Next JS.</li>\n<li>Deep understanding of JavaScript (ES6+), HTML5, CSS3, and modern front-end development practices.</li>\n<li>Strong architectural understanding of web applications, MVC patterns, and modular design.</li>\n<li>Proficient in MySQL and PostgreSQL, including schema design, indexing, joins, and query optimization.</li>\n<li>Demonstrated experience with unit testing frameworks (Jest, Mocha, etc.) and test-driven development (TDD).</li>\n<li>Proficient in version control systems like Git and workflows such as GitFlow.</li>\n<li>Strong understanding of asynchronous programming, authentication, and authorization protocols (JWT, OAuth).</li>\n<li>Proven experience in setting up and managing CI/CD pipelines and deployment automation.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Experience with TypeScript in both front-end and back-end environments.</li>\n<li>Exposure to containerization tools like Docker and experience deploying to cloud platforms (AWS, GCP, Firebase).</li>\n<li>Familiarity with GraphQL, WebSockets, or event-driven systems.</li>\n<li>Hands-on experience with AI-powered dev tools (e.g., Cursor AI, Cline, GitHub Copilot).</li>\n<li>Experience mentoring junior developers and leading sprint-based teams in an Agile environment.</li>\n<li>Familiarity with monitoring, alerting, and observability tools (e.g., Sentry, New Relic, Prometheus).</li>\n<li>Exposure to performance profiling and browser-based debugging.</li>\n</ul>\n<p><strong>Job Types:</strong> Full-time, Permanent</p>\n<p><strong>Work Location:</strong> In person</p>\n<p><strong>Address:</strong> REIZEND (P) Ltd, SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.reizendretail.in</p>",
        "tags": [
            "3-6 Years",
            "React.js",
            "Node.js",
            "MySQL",
            "PostgreSQL"
        ],
        "summary": "Reizend is hiring a Senior Full-Stack Developer to lead the development of scalable web applications. Proficiency in React.js and Node.js is essential for this role."
    },
    {
        "job_title": "Senior Python Developer (3-5 Yrs exp)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22619",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Senior Python Developer</h2>\n<p><strong>Reizend (P) Ltd</strong></p>\n<p>SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581</p>\n<p>http://www.reizendretail.in</p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025</p>\n<p><strong>Job Published:</strong> 08, Aug 2025</p>\n<p><strong>Brief Description:</strong>\nExperience Required: 3-5 years of hands-on experience in full-stack development, system design, and supporting AI/ML data-driven solutions in a production environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Implementing Technical Designs: Collaborate with architects and senior stakeholders to understand high-level designs and break them down into detailed engineering tasks. Implement system modules and ensure alignment with architectural direction.</li>\n<li>Cross-Functional Collaboration: Work closely with software developers, data scientists, and UI/UX teams to translate system requirements into working code. Clearly communicate technical concepts and implementation plans to internal teams.</li>\n<li>Stakeholder Support: Participate in discussions with product and client teams to gather requirements. Provide regular updates on development progress and raise flags early to manage expectations.</li>\n<li>System Development &amp; Integration: Develop, integrate, and maintain components of AI/ML platforms and data-driven applications. Contribute to scalable, secure, and efficient system components based on guidance from architectural leads.</li>\n<li>Issue Resolution: Identify and debug system-level issues, including deployment and performance challenges. Proactively collaborate with DevOps and QA to ensure resolution.</li>\n<li>Quality Assurance &amp; Security Compliance: Ensure that implementations meet coding standards, performance benchmarks, and security requirements. Perform unit and integration testing to uphold quality standards.</li>\n<li>Agile Execution: Break features into technical tasks, estimate efforts, and deliver components in sprints. Participate in sprint planning, reviews, and retrospectives with a focus on delivering value.</li>\n<li>Tool &amp; Framework Proficiency: Use modern tools and frameworks in your daily workflow, including AI/ML libraries, backend APIs, front-end frameworks, databases, and cloud services, contributing to robust, maintainable, and scalable systems.</li>\n<li>Continuous Learning &amp; Contribution: Keep up with evolving tech stacks and suggest optimizations or refactoring opportunities. Bring learnings from the industry into internal knowledge-sharing sessions.</li>\n<li>Proficiency in using AI-copilots for Coding: Adaptation to emerging tools and knowledge of prompt engineering to effectively use AI for day-to-day coding needs.</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li>Hands-on experience with Python-based AI/ML development using libraries such as TensorFlow, PyTorch, scikit-learn, or Keras.</li>\n<li>Hands-on exposure to self-hosted or managed LLMs, supporting integration and fine-tuning workflows as per system needs while following architectural blueprints.</li>\n<li>Practical implementation of NLP/CV modules using tools like SpaCy, NLTK, Hugging Face Transformers, and OpenCV, contributing to feature extraction, preprocessing, and inference pipelines.</li>\n<li>Strong backend experience using Django, Flask, or Node.js, and API development (REST or GraphQL).</li>\n<li>Front-end development experience with React, Angular, or Vue.js, with a working understanding of responsive design and state management.</li>\n<li>Development and optimization of data storage solutions, using SQL (PostgreSQL, MySQL) and NoSQL (MongoDB, Cassandra), with hands-on experience configuring indexes, optimizing queries, and using caching tools like Redis and Memcached.</li>\n<li>Working knowledge of microservices and serverless patterns, participating in building modular services, integrating event-driven systems, and following best practices shared by architectural leads.</li>\n<li>Application of design patterns (e.g., Factory, Singleton, Observer) during implementation to ensure code reusability, scalability, and alignment with architectural standards.</li>\n<li>Exposure to big data tools like Apache Spark, and Kafka for processing datasets.</li>\n<li>Familiarity with ETL workflows and cloud data warehouse, using tools such as Airflow, dbt, BigQuery, or Snowflake.</li>\n<li>Understanding of CI/CD, containerization (Docker), IaC (Terraform), and cloud platforms (AWS, GCP, or Azure).</li>\n<li>Implementation of cloud security guidelines, including setting up IAM roles, configuring TLS/SSL, and working within secure VPC setups, with support from cloud architects.</li>\n<li>Exposure to MLOps practices, model versioning, and deployment pipelines using MLflow, FastAPI, or AWS SageMaker.</li>\n<li>Configuration and management of cloud services such as AWS EC2, RDS, S3, Load Balancers, and WAF, supporting scalable infrastructure deployment and reliability engineering efforts.</li>\n</ul>\n<p><strong>Personal Attributes:</strong></p>\n<ul>\n<li>Proactive Execution and Communication: Able to take architectural direction and implement it independently with minimal rework with regular communication with stakeholders</li>\n<li>Collaboration: Comfortable working across disciplines with designers, data engineers, and QA teams.</li>\n<li>Responsibility: Owns code quality and reliability, especially in production systems.</li>\n<li>Problem Solver: Demonstrated ability to debug complex systems and contribute to solutioning.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p>Key: Python, Django, Django ORM, HTML, CSS, Bootstrap, JavaScript, jQuery, Multi-threading, Multi-processing, Database Design, Database Administration, Cloud Infrastructure, Data Science, self-hosted LLMs</p>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, Data Science, or a related field.</li>\n<li>Relevant certifications in cloud or machine learning are a plus.</li>\n</ul>\n<p><strong>Package:</strong> 6-11 LPA</p>",
        "tags": [
            "3-5 Years",
            "Python",
            "AI/ML",
            "Django"
        ],
        "summary": "Reizend (P) Ltd is seeking a Senior Python Developer with 3-5 years of experience. The role involves full-stack development, AI/ML solutions, and system design in a production environment."
    },
    {
        "job_title": "Technical Support - DevOps  (0.5 - 2 Yrs Exp)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22618",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Technical Support - DevOps</h2>\n<p><strong>REIZEND (P) Ltd</strong> is seeking a proactive and highly skilled Technical Support Engineer to provide exceptional technical support to overseas projects. This role requires working in rotational shifts to ensure 24/7 availability.</p>\n<p><strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Provide technical support and troubleshoot issues related to cloud platforms and services such as Fargate, ECS, DynamoDB, BigQuery, SNS, etc.</li>\n<li>Understand problems by consuming logs and metrics from various sources using services such as CloudWatch, Prometheus, Grafana, Loki, Alert Managers, and Splunk, etc.</li>\n<li>Analyze and resolve networking challenges, including load balancers, API gateways, reverse proxies, ingress controllers, and service-to-service communications.</li>\n<li>Work on issues related to client-server communications, firewalls, and virtual machines.</li>\n<li>Collaborate with DevOps teams to manage and troubleshoot toolchains like Docker, Kubernetes, Jenkins, Ingress Controllers, etc.</li>\n<li>Act as the first point of contact for technical queries and escalate issues when necessary.</li>\n<li>Liaise with development and operations teams to identify root causes and resolve incidents effectively.</li>\n<li>Document troubleshooting steps, solutions, and maintain a knowledge base for recurring issues.</li>\n<li>Collaborate with cross-functional teams to implement best practices for monitoring and incident response.</li>\n<li>Participate in shift handovers and provide timely updates on ongoing issues.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Technical Skills</strong></p>\n<p><strong>Cloud Platforms and Services</strong></p>\n<ul>\n<li>Hands-on knowledge working with Fargate and ECS for managing and troubleshooting containerized workloads.</li>\n<li>Proficiency with DynamoDB and BigQuery for analyzing data and making decisions based on the analysis.</li>\n<li>Hands-on knowledge of SNS for debugging message delivery issues and integration workflows.</li>\n</ul>\n<p><strong>Monitoring and Logging Tools</strong></p>\n<ul>\n<li>Proficiency in CloudWatch Logs, Loki, and Splunk for consuming and analyzing logs to identify and resolve issues.</li>\n<li>Hands-on knowledge with Prometheus and Grafana for analyzing metrics using dashboards and monitoring system health.</li>\n<li>Knowledge of Alert Manager for configuring and managing alert escalation.</li>\n<li>Ability to interpret metrics from various sources and create actionable insights.</li>\n</ul>\n<p><strong>Networking and Security</strong></p>\n<ul>\n<li>Understanding of load balancers (e.g., ALB, NLB) for distributing traffic and troubleshooting connectivity issues.</li>\n<li>Knowledge in API Gateways like AWS API Gateway or NGINX for managing API traffic.</li>\n<li>Knowledge of reverse proxies and ingress controllers (e.g., NGINX Ingress, Traefik) for managing internal/external traffic.</li>\n<li>Understanding of service-to-service communications, including DNS, HTTP/HTTPS, and gRPC protocols.</li>\n<li>Hands-on knowledge with firewalls, security groups, and IAM roles for secure communications.</li>\n<li>Troubleshooting skills for VM-related issues in platforms like AWS EC2 or equivalent.</li>\n</ul>\n<p><strong>DevOps Toolchains</strong></p>\n<ul>\n<li>Proficiency with Docker for managing container images and runtime debugging.</li>\n<li>Understanding of Kubernetes concepts of managing deployments, ingress setups, pod-related issues, and related troubleshooting commands and mechanisms.</li>\n<li>Knowledge of CI/CD pipeline building tools such as Jenkins, GitHub Actions, ArgoCD for building, deploying, and managing automated pipelines.</li>\n<li>Understanding of Ingress controllers (e.g., NGINX, Traefik) and SSL termination for secure routing.</li>\n</ul>\n<p><strong>Troubleshooting and Incident Management</strong></p>\n<ul>\n<li>Strong problem-solving skills to identify root causes using logs, metrics, and system-level debugging.</li>\n<li>Ability to document detailed troubleshooting steps and solutions for recurring issues.</li>\n</ul>\n<p><strong>Collaboration and Communication</strong></p>\n<ul>\n<li>Ability to work with cross-functional teams (DevOps, development, and operations) to resolve incidents.</li>\n<li>Skills in effective and proactive communication to escalate issues and provide updates during shift handovers.</li>\n<li>Proficiency with tools like Slack, JIRA, Confluence, or Google Workspace for collaboration and issue tracking.</li>\n</ul>\n<p><strong>Experience Required:</strong> Technical Support Engineer with 0.5 - 2 years of experience.</p>\n<p><strong>Salary Package:</strong> 4-6 LPA</p>",
        "tags": [
            "0.5-2 Years",
            "Kubernetes",
            "Docker",
            "AWS"
        ],
        "summary": "Seeking a Technical Support Engineer with DevOps skills to provide 24/7 support for overseas projects. The role involves troubleshooting cloud platforms, networking, and DevOps toolchains."
    },
    {
        "job_title": "DevOps Technical Support  (0.5 - 2 Yrs Exp)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22617",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>DevOps Technical Support Engineer</h2>\n<p><strong>Reizend (P) Ltd</strong> is seeking a proactive and highly skilled Technical Support Engineer to provide exceptional technical support to overseas projects. This role requires working in rotational shifts to ensure 24/7 availability. The ideal candidate will be self-motivated, collaborative, agile, and a continuous learner.</p>\n<p><strong>Contact:</strong> careers@reizend.ai</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Provide technical support and troubleshoot issues related to cloud platforms and services such as Fargate, ECS, DynamoDB, BigQuery, SNS, etc.</li>\n<li>Understand problems by consuming logs and metrics from various sources using services such as CloudWatch, Prometheus, Grafana, Loki, Alert Managers, and Splunk.</li>\n<li>Analyze and resolve networking challenges, including load balancers, API gateways, reverse proxies, ingress controllers, and service-to-service communications.</li>\n<li>Work on issues related to client-server communications, firewalls, and virtual machines.</li>\n<li>Collaborate with DevOps teams to manage and troubleshoot toolchains like Docker, Kubernetes, Jenkins, Ingress Controllers etc.</li>\n<li>Act as the first point of contact for technical queries and escalate issues when necessary.</li>\n<li>Liaise with development and operations teams to identify root causes and resolve incidents effectively.</li>\n<li>Document troubleshooting steps, solutions, and maintain a knowledge base for recurring issues.</li>\n<li>Collaborate with cross-functional teams to implement best practices for monitoring and incident response.</li>\n<li>Participate in shift handovers and provide timely updates on ongoing issues.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Technical Skills</strong></p>\n<p><em>Cloud Platforms and Services</em></p>\n<ul>\n<li>Hands-on knowledge working with Fargate and ECS for managing and troubleshooting containerized workloads.</li>\n<li>Proficiency with DynamoDB and BigQuery for analyzing data and making decisions based on the analysis.</li>\n<li>Hands-on knowledge of SNS for debugging message delivery issues and integration workflows.</li>\n</ul>\n<p><em>Monitoring and Logging Tools</em></p>\n<ul>\n<li>Proficiency in CloudWatch Logs, Loki, and Splunk for consuming and analyzing logs to identify and resolve issues.</li>\n<li>Hands-on knowledge with Prometheus and Grafana for analyzing metrics using dashboards and monitoring system health.</li>\n<li>Knowledge of Alert Manager for configuring and managing alert escalation.</li>\n<li>Ability to interpret metrics from various sources and create actionable insights.</li>\n</ul>\n<p><em>Networking and Security</em></p>\n<ul>\n<li>Understanding of load balancers (e.g., ALB, NLB) for distributing traffic and troubleshooting connectivity issues.</li>\n<li>Knowledge in API Gateways like AWS API Gateway or NGINX for managing API traffic.</li>\n<li>Knowledge of reverse proxies and ingress controllers (e.g., NGINX Ingress, Traefik) for managing internal/external traffic.</li>\n<li>Understanding of service-to-service communications, including DNS, HTTP/HTTPS, and gRPC protocols.</li>\n<li>Hands-on knowledge with firewalls, security groups, and IAM roles for secure communications.</li>\n<li>Troubleshooting skills for VM-related issues in platforms like AWS EC2 or equivalent.</li>\n</ul>\n<p><em>DevOps Toolchains</em></p>\n<ul>\n<li>Proficiency with Docker for managing container images and runtime debugging.</li>\n<li>Understanding of Kubernetes concepts of managing deployments, ingress setups, and pod-related issues and related troubleshooting commands and mechanisms.</li>\n<li>Knowledge of CI/CD pipeline building tools such as Jenkins, GitHub Actions, ArgoCD for building, deploying, and managing automated pipelines.</li>\n<li>Understanding of Ingress controllers (e.g., NGINX, Traefik) and SSL termination for secure routing.</li>\n</ul>\n<p><em>Troubleshooting and Incident Management</em></p>\n<ul>\n<li>Strong problem-solving skills to identify root causes using logs, metrics, and system-level debugging.</li>\n<li>Ability to document detailed troubleshooting steps and solutions for recurring issues.</li>\n</ul>\n<p><em>Collaboration and Communication</em></p>\n<ul>\n<li>Ability working with cross-functional teams (DevOps, development, and operations) to resolve incidents.</li>\n<li>Skills in effective and proactive communication to escalate issues and provide updates during shift handovers.</li>\n<li>Proficiency with tools like Slack, JIRA, Confluence, or Google Workspace for collaboration and issue tracking.</li>\n</ul>\n<p><strong>Salary Package:</strong> 4-6 LPA</p>\n<p><strong>Experience Required:</strong> Technical Support Engineer with 0.5 - 2 years of experience.</p>",
        "tags": [
            "0.5-2 Years",
            "Kubernetes",
            "Docker",
            "AWS"
        ],
        "summary": "Seeking a Technical Support Engineer to provide support to overseas projects, ensuring 24/7 availability. Responsibilities include troubleshooting cloud platforms, networking, and DevOps toolchains."
    },
    {
        "job_title": "Java Developer/ Senior Java Developer",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22616",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Java Developer/ Senior Java Developer</h2>\n<p><strong>ECS BUSINESS SOLUTIONS (P) Ltd</strong>\nModule No. 422, 423 and 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, 695581\nhttps://www.ecsfin.com</p>\n<p><strong>About ECS Fin:</strong>\nECS Fin is an engineering enterprise that specializes in process optimization. Our software solutions include an enterprise messaging management system, a SWIFT certified transaction processing system, a post-trade processing application, and a treasury management system. These solutions are used by various Financial Institutions and Corporates worldwide.</p>\n<p><strong>Job Location:</strong> Trivandrum</p>\n<p><strong>Experience:</strong> 1-3 Years</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Must have one year or more of experience in Java.</li>\n<li>Good understanding of jQuery / HTML / CSS / Javascript.</li>\n<li>Knowledge of design patterns, Spring / Spring Boot is a plus.</li>\n<li>Knowledge of ReactJS is a plus.</li>\n<li>Must be a good learner, capable of grasping new technologies.</li>\n<li>Awareness of emerging technologies.</li>\n<li>Good to have experience in Web Service (SOAP, REST).</li>\n<li>Good to have knowledge of Oracle PL/SQL and understanding of relational databases.</li>\n<li>Good communication skills are a plus.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@ecsfin.com</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>",
        "tags": [
            "1-3 Years",
            "Java",
            "Spring Boot",
            "ReactJS"
        ],
        "summary": "ECS Fin is seeking a Java Developer/Senior Java Developer in Trivandrum. The role involves developing and maintaining software solutions for financial institutions, requiring experience in Java and related technologies."
    },
    {
        "job_title": "Python Experienced Developer",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22615",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Python Experienced Developer</h2>\n<p><strong>Reizend (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>\n<p><strong>Brief Description:</strong>\n3-5 years of hands-on experience in full-stack development, system design, and supporting AI/ML data-driven solutions in a production environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Implementing Technical Designs:</strong> Collaborate with architects and senior stakeholders to understand high-level designs and break them down into detailed engineering tasks. Implement system modules and ensure alignment with architectural direction.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with software developers, data scientists, and UI/UX teams to translate system requirements into working code. Clearly communicate technical concepts and implementation plans to internal teams.</li>\n<li><strong>Stakeholder Support:</strong> Participate in discussions with product and client teams to gather requirements. Provide regular updates on development progress and raise flags early to manage expectations.</li>\n<li><strong>System Development &amp; Integration:</strong> Develop, integrate, and maintain components of AI/ML platforms and data-driven applications. Contribute to scalable, secure, and efficient system components based on guidance from architectural leads.</li>\n<li><strong>Issue Resolution:</strong> Identify and debug system-level issues, including deployment and performance challenges. Proactively collaborate with DevOps and QA to ensure resolution.</li>\n<li><strong>Quality Assurance &amp; Security Compliance:</strong> Ensure that implementations meet coding standards, performance benchmarks, and security requirements. Perform unit and integration testing to uphold quality standards.</li>\n<li><strong>Agile Execution:</strong> Break features into technical tasks, estimate efforts, and deliver components in sprints. Participate in sprint planning, reviews, and retrospectives with a focus on delivering value.</li>\n<li><strong>Tool &amp; Framework Proficiency:</strong> Use modern tools and frameworks in your daily workflow, including AI/ML libraries, backend APIs, front-end frameworks, databases, and cloud services, contributing to robust, maintainable, and scalable systems.</li>\n<li><strong>Continuous Learning &amp; Contribution:</strong> Keep up with evolving tech stacks and suggest optimizations or refactoring opportunities. Bring learnings from the industry into internal knowledge-sharing sessions.</li>\n<li><strong>Proficiency in using AI-copilots for Coding:</strong> Adaptation to emerging tools and knowledge of prompt engineering to effectively use AI for day-to-day coding needs.</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li>Hands-on experience with Python-based AI/ML development using libraries such as TensorFlow, PyTorch, scikit-learn, or Keras.</li>\n<li>Hands-on exposure to self-hosted or managed LLMs, supporting integration and fine-tuning workflows as per system needs while following architectural blueprints.</li>\n<li>Practical implementation of NLP/CV modules using tools like SpaCy, NLTK, Hugging Face Transformers, and OpenCV, contributing to feature extraction, preprocessing, and inference pipelines.</li>\n<li>Strong backend experience using Django, Flask, or Node.js, and API development (REST or GraphQL).</li>\n<li>Front-end development experience with React, Angular, or Vue.js, with a working understanding of responsive design and state management.</li>\n<li>Development and optimization of data storage solutions, using SQL (PostgreSQL, MySQL) and NoSQL (MongoDB, Cassandra), with hands-on experience configuring indexes, optimizing queries, and using caching tools like Redis and Memcached.</li>\n<li>Working knowledge of microservices and serverless patterns, participating in building modular services, integrating event-driven systems, and following best practices shared by architectural leads.</li>\n<li>Application of design patterns (e.g., Factory, Singleton, Observer) during implementation to ensure code reusability, scalability, and alignment with architectural standards.</li>\n<li>Exposure to big data tools like Apache Spark, and Kafka for processing datasets.</li>\n<li>Familiarity with ETL workflows and cloud data warehouse, using tools such as Airflow, dbt, BigQuery, or Snowflake.</li>\n<li>Understanding of CI/CD, containerization (Docker), IaC (Terraform), and cloud platforms (AWS, GCP, or Azure).</li>\n<li>Implementation of cloud security guidelines, including setting up IAM roles, configuring TLS/SSL, and working within secure VPC setups, with support from cloud architects.</li>\n<li>Exposure to MLOps practices, model versioning, and deployment pipelines using MLflow, FastAPI, or AWS SageMaker.</li>\n<li>Configuration and management of cloud services such as AWS EC2, RDS, S3, Load Balancers, and WAF, supporting scalable infrastructure deployment and reliability engineering efforts.</li>\n</ul>\n<p><strong>Personal Attributes:</strong></p>\n<ul>\n<li><strong>Proactive Execution and Communication:</strong> Able to take architectural direction and implement it independently with minimal rework with regular communication with stakeholders</li>\n<li><strong>Collaboration:</strong> Comfortable working across disciplines with designers, data engineers, and QA teams.</li>\n<li><strong>Responsibility:</strong> Owns code quality and reliability, especially in production systems.</li>\n<li><strong>Problem Solver:</strong> Demonstrated ability to debug complex systems and contribute to solutioning.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p>Key: Python, Django, Django ORM, HTML, CSS, Bootstrap, JavaScript, jQuery, Multi-threading, Multi-processing, Database Design, Database Administration, Cloud Infrastructure, Data Science, self-hosted LLMs</p>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, Data Science, or a related field.</li>\n<li>Relevant certifications in cloud or machine learning are a plus.</li>\n</ul>\n<p><strong>Package:</strong> 6-11 LPA</p>",
        "tags": [
            "3-5 Years",
            "Python",
            "AI/ML",
            "Django"
        ],
        "summary": "Reizend is seeking a Python Developer with 3-5 years experience. You will develop and maintain AI/ML applications and contribute to scalable, secure system components."
    },
    {
        "job_title": "Experienced Full Stack Developer -React & Node.js",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22614",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Experienced Full Stack Developer - React &amp; Node.js</h2>\n<p><strong>Reizend (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\nhttp://www.reizendretail.in</p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>\n<p><strong>Job Summary:</strong>\nWe are seeking an experienced and highly skilled Senior Full Stack Developer with a strong command of React.js and Node.js to take a leading role in building complex, scalable, and secure web applications. You’ll be expected to contribute to the architecture and development of both frontend and backend systems, mentor junior developers, and collaborate closely with product and design teams.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the design, development, and deployment of full-stack applications using React.js (front-end) and Node.js (back-end).</li>\n<li>Architect robust, secure, and scalable backend systems using Express.js and modern API design principles.</li>\n<li>Experience working with microservices architecture, serverless frameworks, and distributed systems.</li>\n<li>Translate business and product requirements into high-quality technical solutions.</li>\n<li>Write high-performance, reusable, and modular code following industry best practices and coding standards.</li>\n<li>Oversee database design, manage complex queries, and optimize performance in MySQL and PostgreSQL.</li>\n<li>Familiarity with build tools like Webpack, Babel, etc., and package managers such as npm or Yarn.</li>\n<li>Develop and maintain comprehensive test coverage through unit and integration tests.</li>\n<li>Conduct code reviews, provide mentorship, and enforce clean code practices across the team.</li>\n<li>Lead troubleshooting and debugging efforts across full-stack environments.</li>\n<li>Contribute to and maintain CI/CD pipelines to ensure reliable deployment processes.</li>\n<li>Collaborate cross-functionally with Product Managers, Designers, QA, and DevOps.</li>\n<li>Ensure applications meet security, accessibility, and performance benchmarks.</li>\n<li>Advocate for and help adopt emerging technologies and AI developer tools like Cursor AI or Cline.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>3–6 years of hands-on experience in full-stack development with a primary focus on React.js and Node.js or Next JS.</li>\n<li>Deep understanding of JavaScript (ES6+), HTML5, CSS3, and modern front-end development practices.</li>\n<li>Strong architectural understanding of web applications, MVC patterns, and modular design.</li>\n<li>Proficient in MySQL and PostgreSQL, including schema design, indexing, joins, and query optimization.</li>\n<li>Demonstrated experience with unit testing frameworks (Jest, Mocha, etc.) and test-driven development (TDD).</li>\n<li>Proficient in version control systems like Git and workflows such as GitFlow.</li>\n<li>Strong understanding of asynchronous programming, authentication, and authorization protocols (JWT, OAuth).</li>\n<li>Proven experience in setting up and managing CI/CD pipelines and deployment automation.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience with TypeScript in both front-end and back-end environments.</li>\n<li>Exposure to containerization tools like Docker and experience deploying to cloud platforms (AWS, GCP, Firebase).</li>\n<li>Familiarity with GraphQL, WebSockets, or event-driven systems.</li>\n<li>Hands-on experience with AI-powered dev tools (e.g., Cursor AI, Cline, GitHub Copilot).</li>\n<li>Experience mentoring junior developers and leading sprint-based teams in an Agile environment.</li>\n<li>Familiarity with monitoring, alerting, and observability tools (e.g., Sentry, New Relic, Prometheus).</li>\n<li>Exposure to performance profiling and browser-based debugging.</li>\n</ul>\n<p><strong>Location:</strong> Trivandrum\n<strong>Work Environment:</strong> Work from office\n<strong>Salary:</strong> 6- 12 LPA</p>\n<p><strong>Job Types:</strong> Full-time, Permanent\n<strong>Pay:</strong> ₹600,000.00 - ₹1,200,000.00 per year\n<strong>Work Location:</strong> In person</p>",
        "tags": [
            "3-6 Years",
            "React.js",
            "Node.js",
            "MySQL",
            "PostgreSQL"
        ],
        "summary": "Seeking a skilled Full Stack Developer to lead in building web applications using React.js and Node.js. Responsibilities include architecture, development, and mentorship within product and design teams."
    },
    {
        "job_title": "Technical Sales Specialist  :0-5 Years Exp",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22613",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Technical Sales Specialist</h2>\n<p><strong>Reizend (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<p><strong>Brief Description</strong>\nWe are hiring a Technical Sales Specialist to lead the marketing initiatives for our AI products and services and drive business growth. This strategic role requires strong leadership, the ability to set and achieve sales targets, and expertise in developing effective marketing campaigns. The ideal candidate will have excellent communication and negotiation skills and a results-oriented mind-set.</p>\n<p><strong>Responsibilities:</strong>\n- Develop and implement a strategic sales plan to achieve company sales targets and objectives.\n- Lead team and achieve sales goals.\n- Identify new opportunities and potential clients, actively prospecting and generating leads.\n- Build and maintain strong relationships with key clients, understanding their needs and providing tailored solutions to meet their requirements.\n- Develop, execute, and monitor marketing programs for our AI products and services across a variety of channels in line with the GTM strategy derived.\n- Research the market, analyze trends, and provide advice on defining the organization's marketing strategy to effectively reach the target market.\n- Collaborate with internal teams, including product and sales, to develop and monitor strategic marketing initiatives.\n- Analyze and report on the performance and efficiency of marketing campaigns.\n- Create marketing materials, such as sales and product collateral, while ensuring brand guidelines are met.\n- Work with external agencies and vendors to execute marketing programs.\n- Write, proofread, and edit creative and technical content across different mediums to support marketing initiatives.\n- Provide expert advice on branding, positioning, communications, and other marketing issues.\n- Give direction to marketing efforts, utilizing the most effective methods and tools.\n- Stay updated on emerging trends and share best practices, fostering knowledge and insights.</p>\n<p><strong>Qualifications:</strong>\n- Bachelor's degree\n- Experience Required: 0-5 yrs</p>\n<p><strong>Preferred Skills</strong>\n- Strong leadership and Team Management skills.\n- Strong analytical and problem-solving abilities.\n- Excellent communication, negotiation, and interpersonal skills.\n- Ability to build and maintain relationships with stakeholders.</p>\n<p><strong>Package:</strong> 5-18 LPA</p>\n<p><strong>Contact:</strong>\nSubmit your resume to careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>",
        "tags": [
            "0-5 Years",
            "Sales",
            "Marketing",
            "AI"
        ],
        "summary": "Reizend is seeking a Technical Sales Specialist to spearhead marketing of AI products, drive sales, and achieve targets. The role involves strategic sales planning, client relationship management, and market analysis."
    },
    {
        "job_title": "Full Stack Developer (Angular + NestJS + PostgreSQL)",
        "company": "Awdar Software Solutions Llp",
        "url": "https://technopark.org/job-details/22612",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Full Stack Developer (Angular + NestJS + PostgreSQL)</h2>\n<p><strong>AWDAR SOFTWARE SOLUTIONS LLP</strong>\nModule No 2301, 3rd Floor, Yamuna Building, Technopark Phase 3, Trivandrum, 695583\n<a href=\"https://ainexit.com\">https://ainexit.com</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> hr@awdar-solutions.com</p>\n<p><strong>Job Title:</strong> Full Stack Developer (Angular + NestJS + PostgreSQL)\n<strong>Minimum Experience:</strong> 2.5 years in full stack development\n<strong>Employment Type:</strong> Full Time\n<strong>Immediate Joiners Preferred</strong></p>\n<p><strong>Tech Stack:</strong> Angular | Node.js (NestJS) | PostgreSQL</p>\n<h3>Job Summary</h3>\n<p>We are seeking a Full Stack Developer with a strong command of Angular, NestJS, and PostgreSQL to join our dynamic team. The ideal candidate will have at least 2.5 years of hands-on experience in full stack development, with a proven track record of delivering scalable and high-performance web applications. You will be responsible for building and maintaining both the frontend and backend of our applications, optimizing databases, and collaborating with cross-functional teams to implement robust solutions.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop and maintain scalable web applications using Angular and NestJS.</li>\n<li>Design, implement, and optimize database schemas in PostgreSQL.</li>\n<li>Collaborate with cross-functional teams to define and deliver features.</li>\n<li>Ensure application performance, security, and code quality.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Minimum Experience: 2.5 years in full stack development</li>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field:(e.g., B.Tech CS, M.Sc. CS, MCA, BCA, B.Sc. CS, Poly Diploma)</li>\n<li><strong>Strong Proficiency in:</strong></li>\n<li>Frontend: Angular (components, services, routing, RxJS)</li>\n<li>Backend: Node.js with NestJS framework</li>\n<li>Database: PostgreSQL (schema design, queries, performance tuning)</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong proficiency in Angular for building dynamic front-end applications.</li>\n<li>Hands-on experience with Node.js (NestJS) for backend development.</li>\n<li>Expertise in PostgreSQL database design, queries, and optimization.</li>\n<li>Good understanding of RESTful APIs and application architecture.</li>\n<li>Familiarity with Git, CI/CD pipelines, and deployment best practices.</li>\n</ul>\n<p><strong>APPLY NOW</strong> <a href=\"https://ainexit.com/careers\">https://ainexit.com/careers</a></p>",
        "tags": [
            "2.5+ Years",
            "Angular",
            "NestJS",
            "PostgreSQL"
        ],
        "summary": "AWDAR is looking for a Full Stack Developer with 2.5+ years of experience to build and maintain scalable web applications using Angular, NestJS, and PostgreSQL. The role involves collaborating with cross-functional teams to deliver high-quality features."
    },
    {
        "job_title": "Remote Internship: Research & Documentation (For Management/Academic Students)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22611",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Reizend (P) Ltd - Remote Internship: Research &amp; Documentation</h2>\n<p><strong>About Reizend Private Limited:</strong></p>\n<p>Reizend (P) Ltd is looking for interns currently pursuing management or relevant academic courses who are interested in gaining real-world exposure through online research and documentation tasks.</p>\n<p><strong>Details:</strong></p>\n<ul>\n<li><strong>Company:</strong> REIZEND PRIVATE LIMITED</li>\n<li><strong>Role:</strong> Research &amp; Documentation Intern</li>\n<li><strong>Mode:</strong> Remote</li>\n<li><strong>Duration:</strong> 3 Months</li>\n<li><strong>Stipend:</strong> ₹10000 per month</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Conduct structured online research based on given topics.</li>\n<li>Create and maintain documentation, reports, and summaries.</li>\n<li>Assist in organizing relevant data for internal analysis or presentations.</li>\n</ul>\n<p><strong>What you’ll Gain:</strong></p>\n<ul>\n<li>Internship Certificate</li>\n<li>Hands-on exposure to real-time research and documentation</li>\n<li>Opportunity to work with a collaborative and professional team</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Pursuing MBA, BBA, or similar management (open to other relevant academic streams as well).</li>\n<li>Good Academics.</li>\n<li>Strong internet research skills and attention to detail.</li>\n<li>Good command over written English and basic documentation tools (Google Docs/Sheets, MS Word, etc.)</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates can share their CV to careers@reizend.ai. Please mention \"Internship – Research &amp; Documentation\" in the subject line.</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Address:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581</li>\n<li><strong>Website:</strong> http://www.reizendretail.in</li>\n<li><strong>Contact Email:</strong> careers@reizend.ai</li>\n</ul>\n<p><strong>Important Dates:</strong></p>\n<ul>\n<li><strong>Closing Date:</strong> 22, Sept 2025</li>\n<li><strong>Job Published:</strong> 08, Aug 2025</li>\n</ul>",
        "tags": [
            "No Experience Required",
            "Research",
            "Documentation",
            "Written English"
        ],
        "summary": "Reizend Private Limited is seeking a remote Research & Documentation Intern. This role involves online research, documentation, and data organization, offering hands-on experience and a monthly stipend."
    },
    {
        "job_title": "Photo & Video Editor",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22609",
        "location": "Technopark",
        "closing_date": "16 Aug 2025",
        "job_description": "<h2>Photo &amp; Video Editor</h2>\n<p><strong>HONEYKODE TECHNOLOGIES (P) Ltd</strong>\nD-2 Module, 6th floor,\nBhavani Building, Technopark Campus, 695581\n<a href=\"http://www.honeykode.com\">http://www.honeykode.com</a></p>\n<p><strong>Closing Date:</strong> 16, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> nandu@honeykode.com</p>\n<p><strong>Brief Description</strong></p>\n<ul>\n<li>Edit and retouch photos for social media, website, marketing materials, and campaigns.</li>\n<li>Edit, color-grade, and enhance videos for various platforms (YouTube, Instagram, Fb etc.).</li>\n<li>Create short-form reels, highlight videos, and promotional content.</li>\n<li>Collaborate with the creative team to maintain brand consistency and storytelling style.</li>\n<li>Organize and manage media assets for easy retrieval and future use.</li>\n<li>Stay up to date with the latest editing trends, styles, and tools.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements</strong></p>\n<ul>\n<li>Proven experience as a photo and video editor (portfolio required).</li>\n<li>Proficiency in industry-standard software: Adobe Premiere Pro, After Effects, Photoshop, Lightroom (DaVinci Resolve/FCPX is a plus).</li>\n<li>Strong understanding of color correction, composition, and pacing.</li>\n<li>Ability to work under tight deadlines while maintaining quality.</li>\n<li>Creative mindset with attention to detail.</li>\n<li>Knowledge of social media content trends and best practices.</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Motion graphics and animation skills.</li>\n<li>Experience with drones or 360° video editing.</li>\n<li>Basic sound design and audio mixing skills.</li>\n</ul>\n<p><strong>Benefits (if applicable)</strong></p>\n<ul>\n<li>Competitive pay and performance incentives.</li>\n<li>Flexible working hours.</li>\n<li>Opportunities for skill development and training.</li>\n<li>Creative freedom in content execution.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Adobe Premiere Pro",
            "Adobe Photoshop",
            "Video Editing"
        ],
        "summary": "Seeking a Photo & Video Editor to create content for social media and marketing. Requires proficiency in Adobe Creative Suite and knowledge of social media trends."
    },
    {
        "job_title": "IT Support Engineer",
        "company": "Kameda Infologics (P) Ltd",
        "url": "https://technopark.org/job-details/22608",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>IT Support Engineer</h2>\n<p><strong>Kameda Infologics (P) Ltd</strong>\n2nd Floor, Amstor House, Technopark Campus\nTrivandrum, Kerala. , 695581\n<a href=\"http://www.kamedainfologics.com\">http://www.kamedainfologics.com</a></p>\n<p><strong>Contact Email:</strong> preeyanka@kamedainfologics.com</p>\n<p><strong>Job Published:</strong> 08, Aug 2025\n<strong>Closing Date:</strong> 30, Aug 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a skilled and proactive <strong>IT Support Engineer</strong> with 2–3 years of experience in IT infrastructure, hardware troubleshooting, and network support. The ideal candidate will be responsible for maintaining and improving the day-to-day IT operations, providing technical support to end users, and ensuring the stability of our IT systems.</p>\n<p><strong>Job Title:</strong> IT Support Engineer\n<strong>Experience:</strong> 2–3 Years\n<strong>Location:</strong> Trivandrum\n<strong>Job Type:</strong> Full-Time\n<strong>Department:</strong> IT / Technical Support</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Provide technical support for desktop systems, laptops, printers, and other hardware devices.</li>\n<li>Install, configure, and troubleshoot network devices (routers, switches, firewalls, access points).</li>\n<li>Monitor and maintain LAN/WAN connectivity, ensuring stable and secure network performance.</li>\n<li>Perform routine system backups, software updates, and patches.</li>\n<li>Maintain inventory of IT assets, hardware, and software licenses.</li>\n<li>Assist in server and storage administration under senior team supervision.</li>\n<li>Respond to support requests via ticketing system, email, or in-person, ensuring timely resolution.</li>\n<li>Document technical procedures, FAQs, and solutions for future reference.</li>\n<li>Support video conferencing, VPN, and remote desktop setups.</li>\n<li>Coordinate with vendors and service providers for hardware maintenance or network issues.</li>\n</ul>\n<p><strong>Required Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>2–3 years of relevant IT support experience.</li>\n<li>Strong knowledge of computer hardware, peripherals, and troubleshooting.</li>\n<li>Hands-on experience with networking concepts: IP addressing, DHCP, DNS, switching, and routing.</li>\n<li>Basic understanding of Windows Server, Active Directory, and remote desktop tools.</li>\n<li>Familiarity with antivirus software, endpoint protection, and backup solutions.</li>\n<li>Good communication and problem-solving skills.</li>\n<li>Ability to work independently and in a team environment.</li>\n</ul>\n<p><strong>Preferred Qualifications (Optional):</strong></p>\n<ul>\n<li>Certifications like CCNA, CompTIA A+/N+, or MCSA are a plus.</li>\n<li>Experience with Office 365, ITSM tools, or helpdesk software.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "Networking",
            "Hardware Troubleshooting",
            "Active Directory"
        ],
        "summary": "Seeking an IT Support Engineer to maintain IT operations and provide technical support. Responsibilities include troubleshooting hardware, managing networks, and ensuring system stability with 2-3 years experience."
    },
    {
        "job_title": "Social Media - Marketing Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22606",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Social Media Marketing Manager</h2>\n<p>Way.com is looking for a Social Media Marketing Manager to lead the brand's digital presence. You will be responsible for strategy and execution of social media initiatives, driving brand awareness, fostering community engagement, and inspiring user interaction across all major platforms. You'll partner with cross-functional teams to deliver a cohesive, data-backed social media strategy that amplifies the brand voice and supports business growth.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ol>\n<li>\n<p><strong>Strategic Leadership</strong></p>\n<ul>\n<li>Develop and implement platform-specific strategies.</li>\n<li>Maintain consistency and innovation across all channels.</li>\n<li>\n<p><strong>Content Direction</strong></p>\n</li>\n<li>\n<p>Lead planning, creation, and publishing of engaging content for Instagram, Facebook, LinkedIn, X/Twitter, TikTok, and other platforms.</p>\n</li>\n<li>Adapt content to maximize reach, engagement, and platform performance.</li>\n<li>\n<p><strong>Community Engagement</strong></p>\n</li>\n<li>\n<p>Manage daily interactions—responding to comments, DMs, and user-generated content.</p>\n</li>\n<li>Build and maintain a positive, active online community.</li>\n<li>\n<p><strong>Brand Growth &amp; Advocacy</strong></p>\n</li>\n<li>\n<p>Launch interactive campaigns to strengthen emotional connections and inspire loyalty.</p>\n</li>\n<li>\n<p><strong>Data-Driven Optimization</strong></p>\n</li>\n<li>\n<p>Monitor KPIs, analyze performance metrics, and refine strategies to increase engagement and ROI.</p>\n</li>\n<li>\n<p><strong>Influencer &amp; Partnership Management</strong></p>\n</li>\n<li>\n<p>Identify, engage, and manage influencers, creators, and brand partners.</p>\n</li>\n<li>\n<p><strong>Trendspotting &amp; Innovation</strong></p>\n</li>\n<li>\n<p>Stay ahead of industry trends, platform updates, and emerging tools.</p>\n</li>\n<li>\n<p><strong>Cross-Department Collaboration</strong></p>\n</li>\n<li>\n<p>Align with content, design, product, and customer support teams.</p>\n</li>\n<li>\n<p><strong>Budget &amp; Resource Management</strong></p>\n</li>\n<li>\n<p>Oversee social media budgets, allocating resources for maximum impact and efficiency.</p>\n</li>\n<li>\n<p><strong>Brand Reputation Management</strong></p>\n</li>\n<li>\n<p>Track brand sentiment, respond promptly to feedback, and safeguard Way.com’s image.</p>\n</li>\n</ul>\n</li>\n</ol>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, or a related field (Master’s degree is a plus).</li>\n<li>A minimum of 9 years of experience in social media marketing.</li>\n<li>Deep understanding of all major social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.).</li>\n<li>Proficiency in social media management tools (e.g., Hootsuite, Sprout Social, Buffer) and analytics tools (e.g., Google Analytics, Socialbakers).</li>\n<li>Exceptional communication and leadership skills.</li>\n<li>Strong creative acumen combined with strategic thinking capabilities.</li>\n<li>Expertise in paid social media strategies and advertising techniques.</li>\n<li>Ability to manage multiple projects efficiently under tight deadlines.</li>\n<li>A passion for digital innovation.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@way.com</li>\n<li>Apply here: https://waydot.greythr.com/hire/jobs/manager-social-media-marketing</li>\n</ul>",
        "tags": [
            "9+ Years",
            "Social Media Marketing",
            "Community Engagement",
            "Data-Driven Optimization"
        ],
        "summary": "Way.com is hiring a Social Media Marketing Manager to drive brand awareness and engagement across all major platforms. Responsibilities include strategic leadership, content direction, and data-driven optimization to support business growth."
    },
    {
        "job_title": "Digital Campaigns Manager - SEM",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22605",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Digital Campaigns Manager - SEM</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>\n<p><strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a></p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/digital-marketing-manager\">https://waydot.greythr.com/hire/jobs/digital-marketing-manager</a></p>\n<p>We are seeking a results-driven, analytics-focused SEM Manager to lead our paid search strategy and execution. In this pivotal role, you’ll be responsible for attracting high-quality traffic, enhancing online visibility, and accelerating revenue growth through impactful search engine marketing initiatives. You’ll oversee campaigns on platforms such as Google Ads and Bing Ads, collaborating closely with cross-functional teams to deliver cohesive, conversion-focused digital experiences that align with our brand vision and business objectives.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Strategic Leadership: Develop and implement end-to-end SEM strategies that maximize visibility, engage high-intent audiences, and improve conversion rates throughout the customer journey.</li>\n<li>Keyword &amp; Audience Insights: Conduct in-depth keyword and audience research to identify high-value opportunities aligned with user search behavior and campaign objectives.</li>\n<li>Campaign Management &amp; Optimization: Oversee and fine-tune paid search campaigns across platforms like Google Ads and Bing Ads to drive performance, scalability, and strong ROI.</li>\n<li>Data-Driven Performance Analysis: Leverage analytics tools such as Google Analytics to measure effectiveness, uncover actionable insights, and implement data-backed improvements.</li>\n<li>Reporting &amp; Recommendations: Prepare clear, insightful performance reports with key metrics, trend analysis, and strategic recommendations for continual growth.</li>\n<li>Collaborative Execution: Work closely with content, design, and development teams to ensure ad copy, creatives, and landing pages are fully optimized for conversions.</li>\n<li>Trend &amp; Innovation Monitoring: Stay up to date on industry trends, platform updates, and emerging SEM tools or features to maintain a competitive edge.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, or a related field.</li>\n<li>Minimum of 6 years of experience in search engine marketing, preferably within an e-commerce or online booking environment.</li>\n<li>Demonstrated track record of success in planning, executing, and optimizing SEM campaigns across multiple platforms.</li>\n<li>Strong analytical skills with the ability to interpret complex data and translate insights into actionable strategies.</li>\n<li>Prior experience working in the US market, with proven success managing monthly SEM budgets of $100,000 or more.</li>\n<li>Excellent communication and interpersonal skills, with the ability to clearly present campaign performance and insights to internal stakeholders.</li>\n<li>Proficiency in Google Ads and Bing Ads platforms.</li>\n<li>Google Ads Certification is preferred.</li>\n</ul>",
        "tags": [
            "6+ Years",
            "SEM",
            "Google Ads",
            "Bing Ads"
        ],
        "summary": "Seeking an SEM Manager to drive paid search strategy, enhance online visibility, and grow revenue. The role involves campaign management, data analysis, and collaboration across teams."
    },
    {
        "job_title": "Senior Director in HR Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22604",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Senior Director - HR Operations</h2>\n<p>Way.Com India Pvt Ltd is seeking an experienced, data-driven HR operations leader to oversee and scale our end-to-end HR function. As Senior Director – HR Operations, you will drive operational excellence across all core HR domains, including talent acquisition, onboarding, payroll, compliance, benefits, and performance management.</p>\n<p>This role is suited for a strategic thinker with a proven record of measurable impact, deep expertise in HR technology and automation, and a passion for building scalable solutions in a high-growth, tech-first environment.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>Operational Leadership</strong></p>\n<ul>\n<li>Oversee the complete employee lifecycle—from recruitment and onboarding to payroll, benefits, compliance, offboarding, and records management.</li>\n<li>Design and implement scalable, technology-enabled processes to improve speed, accuracy, and compliance.</li>\n<li>Champion automation and AI tools to enhance workflows in hiring, employee engagement, and HR analytics.</li>\n</ul>\n<p><strong>Data-Driven HR Strategy</strong></p>\n<ul>\n<li>Build a robust HR analytics function to deliver real-time dashboards and insights for strategic decision-making.</li>\n<li>Monitor and report on key HR metrics, including hiring velocity, payroll accuracy, retention, engagement, and performance.</li>\n<li>Utilize predictive and prescriptive analytics for workforce planning, attrition reduction, and productivity improvement.</li>\n</ul>\n<p><strong>Performance &amp; Talent Management</strong></p>\n<ul>\n<li>Collaborate with business and HR leaders to strengthen performance management systems (OKRs, feedback, appraisals, and talent reviews).</li>\n<li>Ensure all performance-related programs are executed consistently, fairly, and on time.</li>\n</ul>\n<p><strong>Compliance, Risk &amp; Governance</strong></p>\n<ul>\n<li>Maintain compliance with labor laws, internal policies, and regulatory standards across all HR operations.</li>\n<li>Lead audits, conduct risk assessments, and perform policy reviews to minimize legal and operational risks.</li>\n</ul>\n<p><strong>Team &amp; Stakeholder Leadership</strong></p>\n<ul>\n<li>Build and manage a high-performing HR operations team, fostering a culture of excellence and continuous improvement.</li>\n<li>Partner closely with Finance, Legal, and IT teams to deliver seamless cross-functional services and a unified employee experience.</li>\n<li>Act as a strategic advisor to executive leadership, offering data-backed insights and recommendations to enhance HR impact and organizational success.</li>\n</ul>\n<p><strong>Qualifications &amp; Experience:</strong></p>\n<ul>\n<li>15+ years of progressive HR experience, with at least 5+ years in a leadership role overseeing HR operations</li>\n<li>Prior experience in product or technology companies with fast-paced, high-growth environments</li>\n<li>Strong hands-on expertise in HR technology platforms (HRIS, ATS, payroll systems) and AI-enabled tools for recruitment, employee service, or performance management</li>\n<li>Proven experience in delivering data-driven results across HR functions</li>\n<li>Demonstrated ability to scale HR operations, build shared services models, and drive automation and process excellence</li>\n<li>Strong understanding of compliance and labor laws across regions (India/US/global preferred)</li>\n<li>Excellent leadership, project management, and communication skills</li>\n</ul>\n<p><strong>Preferred Attributes:</strong></p>\n<ul>\n<li>Experience working in global or distributed teams</li>\n<li>Certification in HR Analytics, AI in HR, Six Sigma, or SHRM/SPHR preferred</li>\n<li>Proficiency in tools like Power BI, Tableau, Workday, Darwinbox, SAP SuccessFactors, or other HRMS tools</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Opportunity to shape and scale the HR backbone of a rapidly growing product company</li>\n<li>A culture that values innovation, transparency, impact, and data-driven decision-making</li>\n<li>Competitive compensation, equity options, and leadership influence at a strategic level</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@way.com</li>\n<li>Apply Here: <a href=\"https://waydot.greythr.com/hire/jobs/senior-director-hr-operations\">https://waydot.greythr.com/hire/jobs/senior-director-hr-operations</a></li>\n</ul>",
        "tags": [
            "5+ Years",
            "HR Technology Platforms",
            "HR Analytics",
            "Compliance"
        ],
        "summary": "Seeking a Senior Director of HR Operations to lead and scale HR functions, driving operational excellence in a high-growth tech environment. This role requires expertise in HR tech, analytics, and compliance."
    },
    {
        "job_title": "Spanish Customer Success - EXECUTIVE",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22603",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p>We are seeking a fluent Spanish-speaking Customer Success Executive to deliver outstanding service and support to our customers. As the frontline representative of Way.com, you will provide empathetic, efficient, and solution-oriented assistance across both inbound and outbound interactions—ensuring every customer enjoys a seamless and positive experience.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Customer Communication</strong> – Manage inbound and outbound calls, chats, and emails with professionalism, addressing customer queries, concerns, and feedback promptly.</li>\n<li><strong>Customer-Centric Support</strong> – Deliver empathetic, customer-first assistance to ensure a smooth and satisfying experience at every touchpoint.</li>\n<li><strong>Issue Escalation</strong> – Identify and escalate complex or unresolved cases to the appropriate teams, ensuring timely resolution and follow-up.</li>\n<li><strong>Accurate Documentation</strong> – Maintain detailed and organized customer records by accurately logging all interactions in internal systems.</li>\n<li><strong>Performance Excellence</strong> – Consistently meet or exceed goals related to customer satisfaction, first-contact resolution, and productivity.</li>\n<li><strong>Product Knowledge</strong> – Stay up to date on product features, services, and policies to provide accurate and relevant guidance.</li>\n<li><strong>Team Collaboration</strong> – Work closely with colleagues to foster a positive, high-performance team culture focused on customer success and continuous improvement.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Fluent in both <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong <strong>interpersonal and communication skills</strong>, with a patient and empathetic approach.</li>\n<li>Ability to <strong>multitask</strong> and <strong>manage time efficiently</strong> in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\">https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</a></li>\n</ul>\n<p><strong>Location:</strong> Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>",
        "tags": [
            "1+ Years",
            "Spanish Language",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "Way.com is hiring a Spanish Customer Success Executive to provide excellent support to customers. This role involves managing communications, escalating issues, and maintaining product knowledge to ensure customer satisfaction."
    },
    {
        "job_title": "Product E-mail Marketing Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22601",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Senior Product Email Marketing Specialist (B2C)</h2>\n<p><strong>Location:</strong> Trivandrum, India\n<strong>Company:</strong> Way.com</p>\n<h3>Role Overview</h3>\n<p>Way.com is seeking a data-driven Senior B2C Email Marketing Specialist to spearhead product-focused email marketing initiatives. This role demands hands-on expertise with Mailchimp, a strategic approach to customer engagement, and a strong history of driving product growth and user retention via impactful, optimized email campaigns.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Email Strategy &amp; Execution:</strong> Develop and execute robust email marketing strategies to increase customer engagement, retention, and conversions.</li>\n<li><strong>Campaign Management:</strong> Design, manage, and optimize workflows, automation, and campaigns using Mailchimp and other relevant platforms.</li>\n<li><strong>Audience Segmentation:</strong> Strategically segment customer lists to deliver targeted, personalized, and data-backed email content.</li>\n<li><strong>Performance Optimization:</strong> Conduct A/B tests on subject lines, copy, and CTAs to maximize campaign results.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with product, design, and content teams to create engaging and high-impact email communications.</li>\n<li><strong>Data &amp; Analytics:</strong> Track and analyze key performance metrics, providing actionable insights to enhance ROI.</li>\n<li><strong>Compliance:</strong> Ensure all email activities meet legal and regulatory requirements (CCPA, CAN-SPAM, etc.).</li>\n<li><strong>Industry Awareness:</strong> Stay updated on emerging email marketing trends, tools, and best practices to maintain a competitive advantage.</li>\n</ul>\n<h3>Key Requirements / Preferred Skills:</h3>\n<ul>\n<li><strong>Experience:</strong> 4–6 years of hands-on experience in B2C email marketing, ideally within digital product or SaaS environments.</li>\n<li><strong>Mailchimp Expertise:</strong> Proven expertise in Mailchimp, including automation setup, audience segmentation, and performance reporting.</li>\n<li><strong>Customer Journey &amp; Lifecycle Marketing:</strong> Solid understanding of customer journey mapping and lifecycle marketing strategies.</li>\n<li><strong>HTML/CSS (Optional):</strong> Working knowledge of HTML/CSS for email design is a plus, though not mandatory.</li>\n<li><strong>Data-Driven Approach:</strong> Strong data-driven approach, with experience using tools such as Google Analytics, UTM tracking, and campaign reporting dashboards.</li>\n<li><strong>Compelling Copy:</strong> Ability to craft engaging, action-oriented email copy that drives conversions.</li>\n<li><strong>Analytical Skills:</strong> Excellent analytical skills with a focus on tracking, measuring, and optimizing campaign performance.</li>\n<li><strong>A/B Testing:</strong> Proficient in A/B testing and iterative experimentation to improve results.</li>\n<li><strong>Communication &amp; Collaboration:</strong> Exceptional communication and cross-functional collaboration skills.</li>\n</ul>\n<p><strong>Contact Information:</strong>\n- <strong>Email:</strong> careers@way.com\n- <strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/senior-product-email-marketing-specialist-b2c\">https://waydot.greythr.com/hire/jobs/senior-product-email-marketing-specialist-b2c</a></p>",
        "tags": [
            "4-6 Years",
            "Mailchimp",
            "A/B Testing",
            "Email Marketing"
        ],
        "summary": "Way.com is hiring a Senior Product Email Marketing Specialist to develop and execute B2C email strategies. The role focuses on customer engagement, retention, and driving conversions through optimized campaigns."
    },
    {
        "job_title": "Architect/Manager role - DATA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22600",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Data Architect / Manager</h2>\n<p><strong>Way.com</strong> is seeking a strategic and hands-on Data Architect/Manager to lead the design, development, and implementation of scalable, high-performance data systems that enable smarter decision-making and drive enterprise growth. This role is ideal for a technically adept leader who can balance big-picture architectural vision with practical execution, thrives in fast-paced environments, and champions innovation at every stage.</p>\n<p><strong>About Way</strong></p>\n<p>Way is redefining car ownership in the U.S. As the leading Auto Super App, we help millions of drivers save on insurance, parking, maintenance, and roadside assistance—while delivering enterprise-grade solutions for cities, fleets, and large organizations nationwide.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and implement robust data models, infrastructure, and pipelines to meet evolving business requirements while ensuring performance and scalability.</li>\n<li>Lead, mentor, and inspire data engineers and analysts to cultivate a collaborative, high-performing team environment.</li>\n<li>Partner with product, engineering, business, and design teams to align data initiatives with organizational goals.</li>\n<li>Evaluate, select, and manage modern data platforms and tools to meet current needs and support long-term vision.</li>\n<li>Oversee the entire data lifecycle—from ingestion and transformation to storage and retirement—ensuring efficiency, security, and reliability.</li>\n<li>Establish and enforce policies to maintain data quality, integrity, and compliance with privacy regulations and internal standards.</li>\n<li>Provide architectural guidance and actionable insights to support executive decision-making and strategic planning.</li>\n<li>Promote best practices, consistency, and data literacy across teams to foster a culture of excellence.</li>\n<li>Proactively share progress updates, highlight potential risks, and remove obstacles to keep stakeholders aligned.</li>\n</ul>\n<p><strong>Preferred Skills and Qualifications</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, Data Science, or a related field.</li>\n<li>8+ years of professional experience in database development, data modeling, and architectural design.</li>\n<li>Demonstrated success in managing teams or leading complex technical projects.</li>\n<li>Relevant certifications such as CDMP, TOGAF, or equivalent are highly desirable.</li>\n<li>Strong foundation in RDBMS principles, with hands-on experience in both relational and NoSQL database technologies.</li>\n<li>Experience in the Networking or Security domain is a plus.</li>\n<li>Practical expertise in API consumption and multi-tenant database design.</li>\n<li>Proficiency in tools and technologies such as Oracle, MySQL, Cassandra, Talend, ETL tools, Hadoop, and more.</li>\n<li>In-depth knowledge of database security, compliance practices, and regulatory frameworks.</li>\n</ul>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li>Proven leadership and team management capabilities with a focus on mentoring, motivation, and team growth.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication skills with the ability to convey complex technical concepts to both technical and non-technical stakeholders.</li>\n<li>Exceptional attention to detail to maintain high standards in performance, accuracy, and security within system architecture.</li>\n<li>Ability to balance leadership duties with technical execution while managing competing priorities.</li>\n<li>Effective project and stakeholder management skills, focused on achieving measurable business outcomes.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Company:</strong> Way Dot Com (P) Ltd</li>\n<li><strong>Address:</strong> Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583</li>\n<li><strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a></li>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/data-architectmanager\">https://waydot.greythr.com/hire/jobs/data-architectmanager</a></li>\n</ul>",
        "tags": [
            "8+ Years",
            "Data Architecture",
            "MySQL",
            "Team Management"
        ],
        "summary": "Way.com is hiring a Data Architect/Manager to lead data system design and implementation. The role involves team leadership, cross-functional collaboration, and ensuring data quality and compliance."
    },
    {
        "job_title": "Sales and Business Development - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22599",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p>We are seeking a results-driven Business Development Executive to join our dynamic sales team and help expand our market presence. If you excel at spotting opportunities, building strong client relationships, and closing impactful deals, this role is for you.</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li><strong>Drive Innovation</strong> – Be part of a forward-thinking team redefining mobility with smart, tech-enabled solutions.</li>\n<li><strong>Collaborative Culture</strong> – Work in an environment that encourages bold ideas, teamwork, and continuous improvement.</li>\n<li><strong>Rewarding Environment</strong> – Enjoy a competitive, performance-based compensation structure.</li>\n<li><strong>Career Advancement</strong> – Access structured learning programs, mentorship, and clear career progression opportunities.</li>\n<li><strong>Make an Impact</strong> – Deliver customer-first solutions that are transforming everyday mobility.</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Lead Generation</strong> – Identify and connect with prospective clients through cold calls, targeted email outreach, and digital networking.</li>\n<li><strong>Sales Presentations</strong> – Develop and deliver persuasive pitches and proposals that effectively communicate our offerings and value proposition.</li>\n<li><strong>CRM Management</strong> – Maintain up-to-date prospect data, track pipelines, and ensure timely follow-ups and reporting.</li>\n<li><strong>Target Achievement</strong> – Consistently meet or exceed sales targets and KPIs, driving the company’s revenue growth.</li>\n<li><strong>Relationship Building</strong> – Cultivate long-term client partnerships to encourage loyalty, repeat business, and referrals.</li>\n<li><strong>Reporting &amp; Insights</strong> – Prepare detailed sales reports with actionable insights to guide strategies and improve outcomes.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Proven experience in B2B sales with a strong track record of meeting or exceeding targets.</li>\n<li>5–8 years of sales experience, with prior exposure to the e-commerce sector being a significant plus.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong negotiation and relationship management capabilities.</li>\n<li>Self-motivated, goal-driven, and able to work independently with minimal supervision.</li>\n<li>Proficiency in CRM software (e.g., Zoho) and Microsoft Office Suite.</li>\n<li>Resilient and positive in the face of rejection, with a strong ability to bounce back.</li>\n<li>Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Website:</strong> http://www.way.com</li>\n<li><strong>Apply here:</strong> https://waydot.greythr.com/hire/jobs/business-development-manager</li>\n</ul>\n<p><strong>Address:</strong>\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583</p>",
        "tags": [
            "5-8 Years",
            "B2B Sales",
            "CRM Software",
            "E-commerce"
        ],
        "summary": "Way.Com India is looking for a Business Development Executive to drive market expansion. The role involves lead generation, relationship building, and achieving sales targets."
    },
    {
        "job_title": "Content Quality Assurance - Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22597",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Content Quality Assurance - Specialist</h2>\n<p>Way.Com India Pvt Ltd is seeking a meticulous and quality-obsessed Content QA Specialist to serve as the final gatekeeper before content goes live. This role is not just about proofreading—it’s about ensuring every piece of content meets the highest standards for accuracy, SEO, originality, and brand alignment. You will play a critical role in identifying low-quality or AI-generated content, ensuring compliance with Google’s EEAT (Experience, Expertise, Authoritativeness, Trustworthiness) principles, and helping elevate the overall quality of our content assets.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Content Review &amp; Editorial Excellence</strong></li>\n<li>Manually review blogs, articles, and landing pages for grammar, tone, clarity, and alignment with brand voice and editorial guidelines.</li>\n<li>\n<p>Flag and fix factual inaccuracies, awkward language, and formatting inconsistencies to maintain top editorial quality.</p>\n</li>\n<li>\n<p><strong>SEO &amp; Content Evaluation</strong></p>\n</li>\n<li>Check on-page SEO elements like meta tags, headers, internal links, and keyword usage to ensure effectiveness and compliance.</li>\n<li>\n<p>Evaluate content depth and user value—flagging anything lacking relevance or actionable insights.</p>\n</li>\n<li>\n<p><strong>AI Content &amp; Plagiarism Detection</strong></p>\n</li>\n<li>Identify AI-generated or low-quality content through manual checks and automated tools.</li>\n<li>\n<p>Run plagiarism checks to ensure originality and protect brand integrity.</p>\n</li>\n<li>\n<p><strong>EEAT Compliance &amp; Credibility Assurance</strong></p>\n</li>\n<li>Verify author credentials and assess the trustworthiness of sources, especially for YMYL (Your Money Your Life) topics.</li>\n<li>\n<p>Ensure all content aligns with EEAT standards to build authority and trust.</p>\n</li>\n<li>\n<p><strong>QA Process Development &amp; Feedback</strong></p>\n</li>\n<li>Maintain and improve QA checklists and editorial review workflows in line with industry best practices.</li>\n<li>Provide clear, constructive feedback to writers and editors to drive continuous improvement.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Minimum of <strong>2 years of experience</strong> in content quality assurance, editing, or SEO.</li>\n<li>Exceptional <strong>manual editing skills</strong> with <strong>strong attention to detail</strong>.</li>\n<li>Solid understanding of <strong>SEO fundamentals and Google’s content quality guidelines</strong>.</li>\n<li>Proven ability to <strong>identify AI-generated content</strong> and assess it for human readability.</li>\n<li>Proficient in using tools such as <strong>Grammarly, Copyscape, Copyleaks, Originality.ai</strong>, or similar alternatives.</li>\n<li>Skilled at identifying <strong>low-value or thin content</strong> and providing actionable improvement recommendations.</li>\n<li>Comfortable operating <strong>in a high-volume, fast-paced content production environment</strong>.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Educational or professional background in <strong>journalism, digital marketing, or technical writing</strong>.</li>\n<li>Experience working with content management systems like <strong>WordPress</strong>.</li>\n<li>Familiarity with <strong>structured data, Yoast SEO plugin, and content scoring tools</strong>.</li>\n<li>Understanding of <strong>content compliance processes and fact-checking workflows</strong>.</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@way.com</p>\n<p><strong>Apply here:</strong> https://waydot.greythr.com/hire/jobs/content-qa-specialist</p>",
        "tags": [
            "2+ Years",
            "SEO",
            "Content Quality Assurance",
            "AI Content Detection"
        ],
        "summary": "Way.Com is looking for a Content QA Specialist to ensure content accuracy, SEO compliance, and brand alignment. The role involves reviewing content, identifying AI-generated content, and maintaining EEAT standards."
    },
    {
        "job_title": "iOS - Technical Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22596",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>iOS Technical Lead</h2>\n<p>Way.Com India Pvt Ltd is seeking an experienced iOS Technical Lead to drive the full lifecycle of iOS application development using Swift. In this role, you will architect scalable solutions, deliver high-performing apps, mentor developers, and ensure top-notch user experiences.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Leadership in iOS Development</strong> – Oversee end-to-end app development with Swift, delivering scalable, efficient, and high-quality mobile applications.</li>\n<li><strong>Cross-Functional Collaboration</strong> – Work closely with Product Managers and Designers to translate business needs into intuitive, engaging user experiences.</li>\n<li><strong>Performance Optimization</strong> – Ensure optimal performance, stability, and responsiveness across multiple iOS devices and OS versions.</li>\n<li><strong>Mentorship &amp; Code Quality</strong> – Guide junior and mid-level developers, conduct code reviews, and enforce best practices and quality standards.</li>\n<li><strong>Testing &amp; Documentation</strong> – Uphold code integrity through unit testing, comprehensive documentation, and adherence to clean code principles.</li>\n<li><strong>Backend Integration</strong> – Collaborate with backend and API teams to deliver robust, seamless integrations for enhanced app functionality.</li>\n<li><strong>Innovation &amp; Process Improvement</strong> – Drive continuous improvement initiatives, refine workflows, and contribute to evolving engineering standards.</li>\n<li><strong>Feature Ownership</strong> – Take full responsibility for features from concept to deployment, including monitoring and post-release optimization.</li>\n<li><strong>Continuous Learning</strong> – Stay updated on the latest iOS tools, frameworks, and trends to ensure modern, future-ready solutions.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>10+ years of experience in mobile app development, including 6+ years focused on iOS development.</li>\n<li>Deep expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.</li>\n<li>Strong understanding of RESTful APIs, JSON parsing, and integration of third-party libraries.</li>\n<li>Skilled in architecting complex mobile apps using modular design patterns such as MVVM, MVI, or MVP.</li>\n<li>Proficient in CI/CD workflows, automated testing, code review processes, and App Store deployments.</li>\n<li>Demonstrated leadership in team management and mentoring iOS developers.</li>\n<li>Experienced with tools like Firebase, Mixpanel, or equivalent analytics and crash reporting platforms.</li>\n<li>Solid understanding of web application ecosystems and cross-platform compatibility challenges.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Hands-on experience with Core Bluetooth, Core Location, or real-time service integrations (e.g., EV or roadside assistance).</li>\n<li>Background in mobility, transportation, or automotive tech platforms.</li>\n<li>Familiarity with Kotlin Multiplatform or other cross-platform development frameworks.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply here:</strong> https://waydot.greythr.com/hire/jobs/ios-technical-lead</li>\n<li>Way Dot Com (P) LtdWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583</li>\n<li>http://www.way.com</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Swift",
            "iOS Development",
            "RESTful APIs"
        ],
        "summary": "Way.Com is looking for an iOS Technical Lead to oversee the development of high-quality mobile applications using Swift. The role involves leadership, collaboration, and continuous improvement of iOS development processes."
    },
    {
        "job_title": "Senior Developer - Java",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22595",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p>Way.Com India Pvt Ltd is seeking a highly skilled Senior Java Developer with expertise in Java, Spring Boot, MySQL, and RESTful API development. In this role, you will design, build, and optimize scalable, high-performance applications while guiding best practices and mentoring junior team members.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Application Development</strong> – Design and implement scalable, high-performance applications using Java and Spring Boot.</li>\n<li><strong>Collaboration</strong> – Work closely with Product Owners and Solution Architects to translate business requirements into reliable technical solutions.</li>\n<li><strong>API Development</strong> – Develop, integrate, and optimize RESTful APIs for smooth system communication and functionality.</li>\n<li><strong>System Optimization</strong> – Refactor and improve legacy systems to enhance performance, scalability, and maintainability.</li>\n<li><strong>Code Quality</strong> – Lead code reviews, uphold best practices, and mentor junior developers to foster technical excellence.</li>\n<li><strong>Innovation</strong> – Stay updated with emerging Java technologies and frameworks to drive continuous improvement.</li>\n<li><strong>Problem Solving</strong> – Troubleshoot and resolve complex technical challenges to ensure stability and outstanding user experience.</li>\n<li><strong>Best Practices</strong> – Follow secure coding standards and maintain high-quality, maintainable code.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent professional experience).</li>\n<li>Minimum of <strong>5+ years</strong> of professional experience in Java development, with strong hands-on expertise in Spring Boot and MySQL.</li>\n<li>In-depth understanding of Java SE and Java EE concepts, including multithreading, design patterns, and JVM internals.</li>\n<li>Proven experience in RESTful API design, development, and integration.</li>\n<li>Proficient in working with MySQL or other relational databases, with the ability to write and optimize complex SQL queries.</li>\n<li>Hands-on experience with version control systems, particularly Git.</li>\n<li>Familiarity with Agile methodologies (e.g., Scrum, Kanban) and experience working in Agile development environments.</li>\n<li>Strong problem-solving, debugging, and analytical skills, capable of addressing complex technical challenges.</li>\n<li>Excellent written and verbal communication skills with the ability to thrive in a collaborative, team-oriented environment.</li>\n<li>Demonstrated ability to mentor junior developers and contribute technical leadership to development teams.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience working with microservices architecture and Docker containerization.</li>\n<li>Working knowledge of cloud platforms, such as AWS or Microsoft Azure.</li>\n<li>Familiarity with CI/CD pipelines and automation tools (e.g., Jenkins, GitLab CI).</li>\n<li>Experience with unit testing frameworks, such as JUnit or TestNG.</li>\n<li>Proven track record of building scalable, high-performance applications in production-grade environments.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply here:</strong> https://waydot.greythr.com/hire/jobs/senior-java-developer</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Seeking a Senior Java Developer to design and optimize high-performance applications. Requires expertise in Java, Spring Boot, and MySQL with 5+ years experience."
    },
    {
        "job_title": "Senior Engineer - Quality Assurance",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22594",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p>Way.Com India Pvt Ltd is seeking a Senior QA Automation Engineer with a keen eye for detail, strong problem-solving skills, and proven expertise in Java-based test automation. The ideal candidate will have over 5 years of experience and will be responsible for designing and maintaining scalable automation frameworks and ensuring product excellence through rigorous testing practices.</p>\n<p>In this role, you will transform complex business requirements into reliable test strategies and work closely with cross-functional teams to embed quality at every stage of the development lifecycle.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Design &amp; Strategy:</strong> Develop comprehensive test strategies from complex business requirements, translating them into detailed, actionable test plans.</li>\n<li><strong>Automation Frameworks:</strong> Build, maintain, and enhance scalable automation frameworks using Core Java and related technologies.</li>\n<li><strong>Collaboration:</strong> Partner with developers, product managers, and QA peers to ensure quality is integrated across the Software Development Life Cycle (SDLC).</li>\n<li><strong>Functional Testing:</strong> Perform thorough end-to-end testing to validate product accuracy and feature performance.</li>\n<li><strong>Automation Execution:</strong> Create and execute automation scripts for web and API testing using tools like Selenium WebDriver and Rest Assured.</li>\n<li><strong>CI/CD Integration:</strong> Incorporate automated test suites into CI/CD pipelines (e.g., Jenkins) to enable continuous testing and smooth deployments.</li>\n<li><strong>Monitoring &amp; Troubleshooting:</strong> Track and resolve automation execution issues, ensuring timely and reliable feedback.</li>\n<li><strong>Documentation &amp; Standards:</strong> Maintain high standards in test case design, automation scripting, and documentation for long-term scalability.</li>\n<li><strong>Defect Management:</strong> Analyze results, identify defects, and collaborate with development teams for prompt resolution.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5+ years of experience in test automation using Java.</li>\n<li>Strong knowledge of Core Java, including object-oriented principles, exception handling, multi-threading, and file handling.</li>\n<li>Proficiency in Java Collections (Lists, Sets, Maps, Queues) and solid understanding of data structures and algorithms.</li>\n<li>Hands-on experience with Selenium WebDriver, including dynamic element handling, custom wait strategies, and cross-browser compatibility.</li>\n<li>Proficient in REST API testing using Rest Assured, covering request modeling, authentication, and API validation.</li>\n<li>Experience with Jenkins or similar CI/CD tools for test suite integration and automation pipeline maintenance.</li>\n<li>Familiarity with load and performance testing tools such as JMeter, K6, or Locust, with the ability to identify performance bottlenecks and suggest improvements.</li>\n<li>Strong attention to detail, excellent problem-solving skills, and the ability to work independently or collaboratively in a fast-paced environment.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@way.com</li>\n<li>Apply here: https://waydot.greythr.com/hire/jobs/senior-qa-engineer</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Seeking a Senior QA Automation Engineer to design and maintain automation frameworks using Java. The role involves ensuring product excellence through testing and collaboration with cross-functional teams."
    },
    {
        "job_title": "HOSPITAL MANAGEMENT SOFTWARE - SALES SPECIALIST",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22593",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Hospital Management Software - Sales Specialist</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong> is seeking a dedicated Sales Specialist to promote our Hospital Management Software (HMS) solutions. This role involves strategic sales planning, client engagement, and marketing initiatives to expand our presence in the healthcare sector. The ideal candidate will possess excellent communication skills, the ability to drive revenue, and fluency in Hindi.</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 08, Aug 2025</p>\n<p><strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and execute a strategic sales plan to meet company targets and accelerate business growth in the healthcare software sector.</li>\n<li>Identify and engage with new prospects including hospitals, clinics, diagnostic centers, and healthcare networks.</li>\n<li>Maintain and deepen relationships with key clients by understanding their operational needs and offering tailored HMS solutions.</li>\n<li>Design and manage integrated marketing campaigns in line with the company’s GTM strategy.</li>\n<li>Conduct regular market research and competitor analysis to ensure strategic positioning and adapt to healthcare market needs.</li>\n<li>Create compelling marketing content including brochures, case studies, and presentations, maintaining brand consistency.</li>\n<li>Collaborate with internal teams (product, sales, and support) to align messaging and improve customer engagement.</li>\n<li>Analyze campaign performance, ROI, and make data-driven decisions to improve effectiveness.</li>\n<li>Stay updated on healthcare trends, software innovations, and regulatory guidelines affecting hospital IT systems.</li>\n<li>Represent the company at industry events, conferences, and webinars to strengthen brand visibility.</li>\n</ul>\n<h3>Required Qualifications &amp; Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Healthcare IT, or related field (MBA preferred).</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li>Fluent in Hindi and English – must be able to communicate confidently with clients in Hindi-speaking regions.</li>\n<li>Familiarity with Hospital Management Systems (HMS), EMR/EHR solutions, or healthcare IT workflows is a strong advantage.</li>\n<li>Ability to create effective marketing materials and sales presentations.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Self-driven, target-oriented</li>\n<li>Capable of working independently.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Experience in handling client demos and product presentations.</li>\n<li>Ability to travel as needed for client meetings, demos, and events.</li>\n</ul>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1 , 695581\n<strong>Website:</strong> https://shmsolutions.in</p>",
        "tags": [
            "0-5 Years",
            "Hospital Management Systems (HMS)",
            "Sales",
            "Marketing"
        ],
        "summary": "Seeking a Sales Specialist to promote Hospital Management Software (HMS) solutions, drive revenue, and engage clients. Requires fluency in Hindi and experience in healthcare IT."
    },
    {
        "job_title": "Videographer",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22592",
        "location": "Technopark",
        "closing_date": "16 Aug 2025",
        "job_description": "<h2>Videographer</h2>\n<p><strong>HONEYKODE TECHNOLOGIES (P) Ltd</strong>\nD-2 Module, 6th floor,\nBhavani Building,\nTechnopark Campus, 695581\n<a href=\"http://www.honeykode.com\">http://www.honeykode.com</a></p>\n<p><strong>Closing Date:</strong> 16, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> nandu@honeykode.com</p>\n<p><strong>Brief Description</strong></p>\n<ul>\n<li>Plan, shoot, and edit high-quality video content for marketing, events, social media, and internal use.</li>\n<li>Operate and maintain cameras, lighting, and audio equipment.</li>\n<li>Collaborate with the creative/marketing team to understand project goals and deliver desired results.</li>\n<li>Manage all phases of video production — pre-production, filming, and post-production.</li>\n<li>Ensure all content aligns with brand guidelines and is delivered on schedule.</li>\n<li>Stay updated on video trends, editing techniques, and equipment upgrades.</li>\n<li>Organize and maintain video files and project archives.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Proven experience as a videographer or similar role.</li>\n<li>Proficiency in video editing software (e.g., Adobe Premiere Pro, Final Cut Pro, DaVinci Resolve).</li>\n<li>Strong understanding of camera operation, lighting setups, and audio recording.</li>\n<li>Creativity and a good eye for visual storytelling.</li>\n<li>Ability to work under tight deadlines and manage multiple projects.</li>\n<li>Knowledge of color grading, motion graphics, and visual effects is a plus.</li>\n<li>Excellent communication and teamwork skills.</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul>\n<li>Experience in drone videography.</li>\n<li>Photography skills.</li>\n<li>Familiarity with social media content formats (Reels, Shorts, etc.).</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Adobe Premiere Pro",
            "Camera Operation",
            "Video Editing"
        ],
        "summary": "Honeykode Technologies is seeking a skilled Videographer to plan, shoot, and edit high-quality video content. Proficiency in video editing software and strong camera operation skills are essential."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22591",
        "location": "Technopark",
        "closing_date": "16 Aug 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>HONEYKODE TECHNOLOGIES (P) Ltd</strong>\nD-2 Module, 6th floor,\nBhavani Building,\nTechnopark Campus, 695581\nhttp://www.honeykode.com</p>\n<p><strong>Closing Date:</strong> 16, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> nandu@honeykode.com</p>\n<p><strong>Brief Description</strong></p>\n<p>We are seeking a highly motivated and results-driven Business Development Executive to identify new business opportunities, build relationships with clients, and drive revenue growth. The successful candidate will have a strong understanding of our products/services and be able to effectively communicate their value to potential customers.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Identify and pursue new business opportunities through research, networking, and outreach</li>\n<li>Build and maintain strong relationships with existing and potential clients</li>\n<li>Develop and execute sales strategies to meet or exceed revenue targets</li>\n<li>Conduct market research and analyze industry trends to stay ahead of competitors</li>\n<li>Collaborate with internal teams (e.g., sales, marketing, product) to align business development efforts</li>\n<li>Negotiate and close deals with clients</li>\n<li>Provide regular sales performance updates and forecasts</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor's degree</li>\n<li>Proven experience in business development, sales, or a related field</li>\n<li>Excellent communication, negotiation, and interpersonal skills</li>\n<li>Strong analytical and problem-solving skills</li>\n<li>Ability to work in a fast-paced environment and meet deadlines</li>\n<li>telecalling skills</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Industry knowledge and experience</li>\n<li>CRM software experience (e.g., Salesforce)</li>\n<li>Strong networking and relationship-building skills</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Competitive salary</li>\n<li>Opportunities for professional growth and development</li>\n<li>Collaborative and dynamic work environment</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Business Development",
            "Sales",
            "CRM Software"
        ],
        "summary": "Seeking a motivated Business Development Executive to drive revenue growth by identifying opportunities and building client relationships. The role involves sales strategy, market research, and collaboration to exceed targets."
    },
    {
        "job_title": "E-commerce Executive.",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22590",
        "location": "Technopark",
        "closing_date": "16 Aug 2025",
        "job_description": "<h2>E-commerce Executive</h2>\n<p><strong>Honeykode Technologies (P) Ltd</strong> is seeking an experienced and talented E-commerce Executive to join our dynamic team.</p>\n<p><strong>Location:</strong> D-2 Module, 6th floor, Bhavani Building, Technopark Campus, 695581\n<strong>Website:</strong> http://www.honeykode.com</p>\n<p><strong>Closing Date:</strong> 16, Aug 2025\n<strong>Job Published:</strong> 08, Aug 2025\n<strong>Contact Email:</strong> nandu@honeykode.com</p>\n<h3>Brief Description</h3>\n<p>You will play a pivotal role in optimising our online business operations and delivering exceptional customer service. As an E-commerce Executive, you’ll maintain all our sales touchpoints — website, online marketplaces, and aggregators — and oversee online sales, manage stock inventories, and optimise the overall customer experience.</p>\n<p>If you have a knack for sales, love the online world and have a passion for customer service, we welcome you to join our company. We offer competitive remunerations, comprehensive benefits and growth opportunities within the company.</p>\n<h3>Objectives of this role:</h3>\n<ul>\n<li>Develop and implement effective e-commerce growth strategies to identify and capture new customer base and business opportunities.</li>\n<li>Optimise end-to-end e-commerce journey for our customers, from lead generation to conversion and post-purchase follow-up.</li>\n<li>Manage and maintain e-commerce platforms, including product listings, pricing and inventory management.</li>\n<li>Enhance customer experience by working closely with other departments, such as marketing, content and customer service.</li>\n</ul>\n<h3>Your tasks</h3>\n<ul>\n<li>Conduct market research and analysis to identify potential prospects, conduct outreach, and build customer relationships to drive sales.</li>\n<li>Analyse data and generate reports to track e-commerce performance, identify trends and make data-driven recommendations for improvement.</li>\n<li>Collaborate with cross-functional teams, including development, marketing and customer service, to execute online campaigns and promotions to attract leads.</li>\n<li>Monitor customer feedback, reviews and ratings to identify areas of improvement and implement strategies for enhancing customer satisfaction and retention.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>1+ years of experience in the e-commerce industry with a proven track record of driving online sales and achieving revenue targets.</li>\n<li>Strong expertise in managing product listings, inventory management, pricing strategies, and other e-commerce operations to optimise product visibility, customer engagement, and sales conversion.</li>\n<li>Solid understanding of e-commerce platforms, tools, and technologies, including online marketplaces, payment gateways, order management systems, and customer relationship management (CRM) software.</li>\n<li>Excellent analytical skills in analysing data, conducting market research, and understanding customer behaviour to identify trends and opportunities for growth.</li>\n<li>Great analytical mindset with communication skills, both written and verbal, with fluency in English. Additional language proficiency in regional languages would be an advantage.</li>\n<li>Experience managing e-commerce platforms such as Shopify, Magento, and/or WooCommerce.</li>\n</ul>\n<h3>Preferred skills and qualifications</h3>\n<ul>\n<li>A bachelor’s degree in e-commerce, digital marketing, business administration, or a related field.</li>\n<li>Experience with CRM and marketing automation platforms such as Salesforce, Mailchimp, or HubSpot for customer segmentation, targeting, and personalised marketing campaigns.</li>\n<li>Proficiency in using analytics tools such as Google Analytics, Google Tag Manager, or similar to track and analyse e-commerce performance metrics.</li>\n<li>Familiarity with online marketing tools, including social media advertising, email marketing, SEO and SEM.</li>\n<li>Ability to work collaboratively and take charge as a leader when required.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "E-commerce Platforms",
            "CRM Software",
            "Google Analytics"
        ],
        "summary": "Honeykode Technologies is seeking an E-commerce Executive to optimize online business operations and deliver excellent customer service. The role involves managing sales touchpoints, inventories, and enhancing customer experience."
    }
]