[
    {
        "job_title": "Business Development Executive",
        "company": "ALTOS Technologies",
        "url": "https://infopark.in/company-jobs/details/21276/368",
        "location": "Infopark",
        "closing_date": "09 Dec 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p>We are looking for a highly motivated and skilled Business Development Executive to become a part of our rapidly expanding team. The primary responsibilities for this role include lead generation, driving revenue growth, and identifying new opportunities to foster business expansion.</p>\n<p><strong>Required Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, Sales, or a related field.</li>\n<li>Possess effective communication, interpersonal, and negotiating skills.</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>0 to 6 months</li>\n</ul>\n<p><strong>Salary:</strong></p>\n<ul>\n<li>As per industry standards.</li>\n</ul>\n<p>If this opportunity resonates with your career aspirations, please forward your updated resume to aiswarya.a@altostechnologies.in.</p>",
        "tags": [
            "0-6 Months Experience",
            "Business Development",
            "Lead Generation",
            "Sales"
        ],
        "summary": "Seeking a motivated Business Development Executive for lead generation and revenue growth. Requires a Bachelor's degree and strong communication skills."
    },
    {
        "job_title": "NextJs Developer (7 Months - 1+ Years)",
        "company": "Woxro",
        "url": "https://infopark.in/company-jobs/details/21268/399",
        "location": "Infopark",
        "closing_date": "10 Dec 2025",
        "job_description": "<h2>Next.js Developer (7 Months - 1+ Years)</h2>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li>Freshers with any 7 months Internship experience can apply.</li>\n<li>Strong proficiency in JavaScript, including ES6+ features such as async/await, destructuring, and arrow functions.</li>\n<li>Extensive experience with Next.js and React, including a deep understanding of routing, rendering methods, and state management.</li>\n<li>Proficiency in GSAP and Framer Motion for animating UI components, enhancing interactivity, and optimizing performance.</li>\n<li>Experience with Three.js for integrating 3D content and interactive graphics into websites.</li>\n<li>Familiarity with CSS preprocessors like SCSS or LESS for writing maintainable and scalable stylesheets.</li>\n<li>Hands-on experience with Git for version control, ensuring efficient collaboration within the development team.</li>\n<li>Understanding of RESTful APIs and experience integrating them into frontend applications to communicate with backend services.</li>\n<li>Knowledge of web performance optimization techniques, including lazy loading, code splitting, and caching, to ensure fast and efficient web performance.</li>\n<li>Strong problem-solving skills, attention to detail, and a passion for creating high quality, maintainable code.</li>\n<li>Knowledge of deployment is a plus.</li>\n<li>Experience deploying applications to AWS or cloud environments.</li>\n</ul>\n<p><strong>Performance &amp; Optimization:</strong></p>\n<ul>\n<li>Optimize application performance, SEO, and page load time (Lighthouse, Core Web Vitals).</li>\n<li>Manage images and assets with Next/Image, and lazy loading strategies.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@woxro.com</p>",
        "tags": [
            "7 Months - 1+ Years",
            "Next.js",
            "React",
            "JavaScript"
        ],
        "summary": "Seeking a Next.js Developer with 7 months to 1+ years of experience. Responsibilities include optimizing application performance and integrating 3D content using various animation and JavaScript libraries."
    },
    {
        "job_title": "Jr. Marketing Manager",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/21271/4",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Jr. Marketing Manager</h2>\n<p><strong>Location:</strong> Kochi\n<strong>Job Type:</strong> Full-time\n<strong>Mode:</strong> Remote</p>\n<h3>Job Summary:</h3>\n<p>We are seeking a hands-on and experienced Jr. Marketing Manager with 1-3 years of experience to drive our marketing efforts. This role will involve executing campaigns, content creation, managing relationships with marketing freelancers, and setting up infrastructure to bring in inbound leads. The ideal candidate is someone who is into execution and has had exposure to managing field marketing initiatives such as trade shows, and collaborating closely with top management, sales, delivery heads, and project heads to align marketing strategies with business objectives.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in developing and implementing marketing plans and campaigns across digital channels.</li>\n<li>Support day-to-day execution of activities such as email campaigns, social media posts, and website updates.</li>\n<li>Write engaging content for blogs, social media, websites, and marketing collateral.</li>\n<li>Research industry topics and help maintain consistent messaging across channels.</li>\n<li>Coordinate with design, content, and marketing freelancers.</li>\n<li>Ensure timely delivery and quality of outsourced work.</li>\n<li>Support planning and execution of trade shows, conferences, and promotional events.</li>\n<li>Help with booth coordination, logistics, and on-ground marketing activities.</li>\n<li>Assist in setting up landing pages, forms, and basic CRM workflows for lead capture.</li>\n<li>Work with the senior team to improve conversion paths and track incoming leads.</li>\n<li>Monitor campaign performance and maintain weekly/monthly marketing dashboards</li>\n<li>Use analytics tools to track traffic, engagement, and lead generation</li>\n<li>Work with sales and delivery heads to support ongoing marketing initiatives.</li>\n<li>Ensure alignment between marketing activities and business priorities.</li>\n<li>Help maintain brand guidelines across all marketing outputs.</li>\n<li>Support content reviews and quality checks to ensure brand consistency.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelors degree in Engineering, Marketing, Business Administration, or related field</li>\n<li>1-3 years of experience in marketing Execution roles</li>\n<li>Basic understanding of SEO/SEM, social media marketing, and email marketing.</li>\n<li>Exposure of working with AI tools for building landing pages, design activities, content curation and marketing automation campaigns</li>\n<li>Good writing skills and ability to create clear, engaging content.</li>\n<li>Good communication skills and willingness to work closely with cross-functional teams.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lavanya.a@arttechgroup.com</p>",
        "tags": [
            "1-3 Years",
            "Marketing Campaigns",
            "Content Creation",
            "AI Tools"
        ],
        "summary": "Jr. Marketing Manager to execute campaigns, create content, and manage freelancers. Role involves field marketing, lead generation setup, and collaboration with senior management."
    },
    {
        "job_title": "Marketing Intern",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/21272/4",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Marketing Intern</h2>\n<p><strong>Location:</strong> Kochi\n<strong>Job Type:</strong> Full-time / Internship\n<strong>Mode:</strong> Work from Office</p>\n<h3>Job Summary:</h3>\n<p>We are looking for a proactive and enthusiastic Marketing Intern who is eager to learn and support our marketing initiatives. This role will involve assisting in campaign execution, content creation, coordinating with freelancers, and helping set up basic inbound lead infrastructure. The ideal candidate is someone who enjoys hands-on work, is willing to learn, and is comfortable supporting field marketing tasks such as trade shows, while collaborating with senior team members across sales, delivery, and management.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Write engaging content for blogs, social media, websites, and marketing collateral.</li>\n<li>Conduct research on industry topics to support content creation.</li>\n<li>Assist in planning and execution of trade shows, events, and promotional activities.</li>\n<li>Assist in creating landing pages, lead forms, and basic CRM entries as guided by the team.</li>\n<li>Assist in executing marketing plans and digital campaigns across channels.</li>\n<li>Support day-to-day marketing activities such as social media posts, email campaigns, and website updates.</li>\n<li>Help monitor campaign performance and gather data using basic analytics tools.</li>\n<li>Work with sales and delivery teams to support ongoing marketing needs.</li>\n<li>Help with proofreading and quality checks for marketing content.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Marketing, Business Administration</li>\n<li>Interest in digital marketing, social media, SEO and content creation.</li>\n<li>Would have been exploring AI-based tools to use for Marketing activities like curating content, building landing page designs and content creation.</li>\n<li>Good writing skills and ability to create simple, clear communication.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lavanya.a@arttechgroup.com</p>",
        "tags": [
            "0-2 Years",
            "Content Creation",
            "Digital Marketing",
            "Social Media"
        ],
        "summary": "Marketing Intern needed in Kochi to support marketing initiatives. Responsibilities include content creation, campaign execution, and event assistance."
    },
    {
        "job_title": "Kubernetes Engineer",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21269/95",
        "location": "Infopark",
        "closing_date": "25 Dec 2025",
        "job_description": "<h2>Kubernetes Engineer</h2>\n<p><strong>Responsibilities:</strong>\n- Deploy, manage, and troubleshoot Kubernetes clusters (on-prem and cloud).\n- Build and optimize Docker images and manage container registries.\n- Implement CI/CD pipelines using tools like Jenkins, GitLab CI, GitHub Actions, ArgoCD.\n- Automate infrastructure using Terraform, Ansible, Helm, Kustomize.\n- Manage cloud services: compute, storage, networking, IAM across AWS/Azure/GCP.\n- Configure Kubernetes networking, ingress controllers, RBAC, secrets, and security policies.\n- Implement monitoring/logging using Prometheus, Grafana, EFK/Loki.\n- Manage persistent storage and CSI integrations.</p>\n<p><strong>Requirements:</strong>\n- Strong hands-on experience with Kubernetes and Docker.\n- CKA/CKAD/CKS certifications.\n- Good knowledge of AWS/Azure/GCP.\n- Solid understanding of Linux, networking, and cloud security.\n- Experience with IaC, CI/CD, and scripting (Bash/Python).</p>\n<p><strong>Years of Experience:</strong>\n- 6 to 9 years total (3+ years in Kubernetes)</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com</p>",
        "tags": [
            "3+ Years",
            "Kubernetes",
            "CI/CD",
            "AWS/Azure/GCP"
        ],
        "summary": "Kubernetes Engineer needed with 3+ years of experience in Kubernetes. Responsibilities include cluster management, CI/CD, and cloud services."
    },
    {
        "job_title": "Lead Generation Specialist",
        "company": "Urolime Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21270/118",
        "location": "Infopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>Lead Generation Specialist</h2>\n<p><strong>Experience:</strong> 1+ Years</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Identify and research potential companies across various industries.</li>\n<li>Generate new leads through online platforms, databases, and direct outreach.</li>\n<li>Make cold calls to decision-makers to explore opportunities.</li>\n<li>Qualify leads and gather relevant business information.</li>\n<li>Schedule meetings and coordinate with the Business Development team.</li>\n<li>Ensure timely follow-ups and maintain accurate records in the CRM.</li>\n<li>Meet weekly/monthly lead generation and call targets.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Minimum 1 year of experience in lead generation, telemarketing, sales, or customer-facing roles.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong cold calling and persuasion skills.</li>\n<li>Ability to confidently approach decision-makers across industries.</li>\n<li>Self-driven, target-oriented, and able to work independently.</li>\n<li>Experience in IT lead generation is a plus, but not mandatory.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@urolime.com</p>",
        "tags": [
            "1+ Years",
            "Lead Generation",
            "Cold Calling",
            "CRM"
        ],
        "summary": "Seeking a Lead Generation Specialist with 1+ years of experience to identify, engage, and qualify potential clients. Responsibilities include cold calling, CRM management, and meeting targets."
    },
    {
        "job_title": "Senior .Net Developer",
        "company": "Focaloid Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21273/366",
        "location": "Infopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>Senior .Net Developer</h2>\n<p>We are looking for an experienced .NET Developer with a strong background in ASP.NET and .NET Core development. The ideal candidate will be responsible for designing, developing, testing, and maintaining high-performance enterprise applications. You should be passionate about clean code, scalable architecture, API development, and working with modern cloud-based technologies.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and implement enterprise-grade applications using ASP.NET MVC, ASP.NET Web API, and .NET Core.</li>\n<li>Build RESTful APIs, microservices, and backend services with optimized performance.</li>\n<li>Participate in requirement analysis, solution design, technical documentation, and code reviews.</li>\n<li>Write clean, efficient, testable, and reusable code following best practices and coding standards.</li>\n<li>Integrate third-party services, databases, and cloud resources using secure patterns.</li>\n<li>Work collaboratively with cross-functional teams including QA, DevOps, and UI/UX.</li>\n<li>Troubleshoot production issues, perform RCA, and apply performance optimizations.</li>\n<li>Implement automated unit testing, integration testing, and CI/CD best practices.</li>\n<li>Participate in Agile/Scrum ceremonies including sprint planning, story estimation, and demos.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>5+ years of hands-on development experience with ASP.NET and .NET Core frameworks.</li>\n<li>Strong knowledge of C#, OOPS concepts, design patterns, and SOLID principles.</li>\n<li>Experience in developing REST APIs, Web Services, Microservices architecture.</li>\n<li>Strong experience with Entity Framework / EF Core and SQL databases (SQL Server, PostgreSQL, or MySQL).</li>\n<li>Hands-on experience with JavaScript/TypeScript and front-end technologies (React/Angular is a plus but not mandatory).</li>\n<li>Good understanding of authentication &amp; authorization mechanisms (JWT, OAuth, Identity Server, etc.).</li>\n<li>Familiarity with cloud platforms like AWS, Azure, or GCP (Azure preferred).</li>\n<li>Experience with Git, DevOps pipelines, CI/CD tools (Azure DevOps, GitHub Actions, or Jenkins).</li>\n<li>Solid understanding of application security, performance tuning, and debugging.</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Experience with Microservices, Docker, Kubernetes, or serverless functions.</li>\n<li>Knowledge of Message brokers (RabbitMQ, Kafka, SQS, or Azure Service Bus).</li>\n<li>Exposure to Domain Driven Design (DDD) and Clean Architecture.</li>\n<li>Familiarity with unit testing frameworks (xUnit, NUnit, MSTest).</li>\n<li>Experience working with ORM optimization and query performance tuning.</li>\n<li>Knowledge of logging and monitoring tools (Serilog, ELK/Grafana, App Insights).</li>\n</ul>\n<h3>Education</h3>\n<ul>\n<li>Bachelor’s/Master’s degree in Computer Science, Engineering, or related field (or equivalent professional experience)</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Excellent analytical and problem-solving skills</li>\n<li>Strong communication and collaboration abilities</li>\n<li>Ability to own features end-to-end and work independently</li>\n<li>Willingness to learn modern patterns and new technologies</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at ajish.prabhakaran@focaloid.com</p>",
        "tags": [
            "5+ Years",
            ".NET Core",
            "ASP.NET",
            "API Development"
        ],
        "summary": "Seeking a Senior .NET Developer experienced in ASP.NET and .NET Core for enterprise application development. Responsibilities include designing, building APIs, and working with cloud technologies."
    },
    {
        "job_title": "Backend Developer ( Java)",
        "company": "TECFORZ INNOVATIONS",
        "url": "https://infopark.in/company-jobs/details/21274/426",
        "location": "Infopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>Backend Developer (Java)</h2>\n<p><strong>Job Summary:</strong>\nWe are seeking a motivated and talented Java/Back End Developer with 5-6 years of hands-on development experience to join our dynamic team. The ideal candidate will have a strong foundation in Java development and be eager to learn and grow in a fast-paced, innovative environment. You will be responsible for designing, implementing, and maintaining robust and scalable applications, working closely with cross-functional teams to deliver high-quality software solutions.</p>\n<p><strong>Key Responsibilities:</strong>\n- Design, develop, and maintain high-quality Java-based applications.\n- Collaborate with cross-functional teams to define, design, and ship new features.\n- Ensure the performance, quality, and responsiveness of applications.\n- Identify and correct bottlenecks and fix bugs.\n- Help maintain code quality, organization, and automation.\n- Develop and integrate RESTful APIs.\n- Implement and manage CI/CD pipelines to streamline development and deployment processes.\n- Participate in code reviews and provide constructive feedback.\n- Stay up-to-date with industry trends and technologies to ensure our applications are current and competitive.</p>\n<p><strong>Required Qualifications:</strong>\n- 5-6 years of hands-on development experience in Java.\n- Experience in application development using Spring and Spring Boot frameworks.\n- Proficient in SQL programming.\n- Experience with REST API development and integration.\n- Familiarity with integration patterns and best practices.\n- Basic understanding of CI/CD pipelines and DevOps practices.\n- Excellent problem-solving skills and the ability to work independently or as part of a team.\n- Strong communication and interpersonal skills.</p>\n<p><strong>Preferred Qualifications:</strong>\n- Knowledge of cloud platforms such as AWS, Azure, or Google Cloud.\n- Familiarity with containerization tools like Docker and Kubernetes.\n- Basic experience with front-end technologies like Next.js, React, and Node.js.\n- Knowledge of Agile/Scrum methodologies.</p>\n<p><strong>Education:</strong>\n- Bachelor’s degree in Computer Science, Information Technology, or a related field.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tecforz.com</p>",
        "tags": [
            "5-6 Years",
            "Java",
            "Spring Boot",
            "REST API"
        ],
        "summary": "Seeking a Java Back-End Developer with 5-6 years of experience to design and maintain scalable applications. Responsibilities include API development, CI/CD, and collaboration."
    },
    {
        "job_title": "Pre-Sales Analyst",
        "company": "Fingent Global Solutions",
        "url": "https://infopark.in/company-jobs/details/21275/83",
        "location": "Infopark",
        "closing_date": "09 Jan 2026",
        "job_description": "<h2>Pre-Sales Analyst at Fingent</h2>\n<p>At Fingent, we believe that technology can make a meaningful difference to the lives around us. We create and provide software that is beautiful, usable, and compelling to solve complex business challenges. We nurture smart people who bring out the best in themselves, their peers, and their clients.</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Contribute to the sales team in driving revenue by qualifying leads.</li>\n<li>Answer requests for information (RFIs) and requests for proposals (RFPs) in a detailed and professional level.</li>\n<li>Prepare and deliver solution-based presentations and demonstrations to customers.</li>\n<li>Execute on customer proof of concepts (POCs).</li>\n<li>Work closely with the internal development team for solution and architecture recommendations.</li>\n<li>Working with Sales to drive the pre-sales phase by introducing the Profile product/services offering and provide demonstrations, functionality, system architecture by interfacing with prospective and current customers and partners (both at business and technical level).</li>\n<li>Understand the business and operational goals the prospect has and recommend a solution that ensures the optimum usage and utilization of Profile products and services; this can include a full pre-sales lifecycle from RFI response/requirement analysis, to running a scoping exercise or engage in a prototype/proof of concept for agreed requirements.</li>\n<li>Having a detailed knowledge of the functionality and technology of the applications developed.</li>\n<li>Ensuring that all materials such as presentations and demonstrations are maintained up to date.</li>\n<li>Build on industry knowledge to support and deliver excellent presentations to clients and prospects.</li>\n</ul>\n<h3>Skills:</h3>\n<ul>\n<li>Keen interest in understanding and acquiring business knowledge.</li>\n<li>Capability to comprehend client requirements and translate them into workflows and application features.</li>\n<li>Ability to deliver presentations and demos to prospective clients effectively.</li>\n<li>Proficient in documentation and note-taking abilities during client calls.</li>\n<li>Proficiency in MS Office tools, including PowerPoint, Word, and Excel.</li>\n<li>Strong analytical thinking, interpersonal skills, and excellent logical reasoning abilities.</li>\n<li>Excellent business communication skills, both verbal and written.</li>\n<li>Ability to work well under pressure and prioritize tasks effectively.</li>\n</ul>\n<h3>More Information:</h3>\n<p><strong>Experience:</strong> 4+ Years</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@fingent.com</p>",
        "tags": [
            "4+ Years",
            "Pre-Sales",
            "RFP",
            "Presentations"
        ],
        "summary": "Drive revenue by qualifying leads and responding to RFIs/RFPs. Deliver solution-based presentations and demos, understanding client needs for optimal product utilization."
    },
    {
        "job_title": "BUSINESS DEVELOPMENT EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25796",
        "location": "Technopark",
        "closing_date": "11 Dec 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd\n<strong>Location:</strong> Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> www.trainonexsolutions.in</p>\n<p><strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Job Published:</strong> 08, Dec 2025\n<strong>Closing Date:</strong> 11, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a motivated and dynamic Business Development Executive to join our team. The candidate will be responsible for identifying new business opportunities, building strong client relationships, and contributing to the overall growth of the company.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Identify and approach potential vendors for business opportunities.</li>\n<li>Contact vendors through calls to explain company services.</li>\n<li>Build and maintain strong relationships with clients and vendors.</li>\n<li>Understand client requirements and offer suitable business solutions.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Any degree (freshers can apply).</li>\n<li>Female candidates preferred.</li>\n<li>Basic computer knowledge and proficiency in MS Office.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong communication and negotiation skills.</li>\n<li>Ability to build rapport and maintain long-term relationships.</li>\n<li>Goal-oriented, confident, and self-motivated.</li>\n<li>Basic understanding of sales and vendor management.</li>\n</ul>\n<p><strong>To Apply:</strong> Mention subject line as \"Application for Business Development Executive.\"</p>",
        "tags": [
            "Freshers",
            "Business Development",
            "Sales",
            "Vendor Management"
        ],
        "summary": "Seeking a Business Development Executive to identify opportunities and build client relationships. Freshers with any degree are welcome to apply for this growth-focused role."
    },
    {
        "job_title": "QA Engineer - Automation",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/25795",
        "location": "Technopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>QA Engineer - Automation</h2>\n<p><strong>Company:</strong> Revyrie Global\n<strong>Location:</strong> Technopark Campus\n<strong>Website:</strong> http://www.revyrieglobal.com\n<strong>Published:</strong> 08, Dec 2025\n<strong>Closing Date:</strong> 15, Dec 2025\n<strong>Contact Email:</strong> careers@revyrieglobal.com</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain automated test scripts for web/mobile applications.</li>\n<li>Execute automation, manual, and performance tests based on project requirements.</li>\n<li>Build and enhance automation frameworks (Selenium / Cypress / Playwright or relevant tools).</li>\n<li>Perform functional, regression, integration, and API testing.</li>\n<li>Identify, analyze, and track defects using tools like Jira, Bugzilla, or Azure DevOps.</li>\n<li>Collaborate with developers, product owners, and QA teams to ensure timely issue resolution.</li>\n<li>Participate in Agile/Scrum ceremonies and provide accurate test estimates.</li>\n<li>Execute performance tests using tools such as JMeter; analyze results and bottlenecks.</li>\n<li>Contribute to CI/CD pipeline integration for automated testing.</li>\n<li>Prepare detailed test plans, test cases, and test reports.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong experience in Selenium / Cypress / Playwright (mention your preferred stack).</li>\n<li><strong>3+ years of experience in related field.</strong></li>\n<li>Programming knowledge in Java / Python / JavaScript.</li>\n<li>Solid understanding of manual testing, testing life cycle, and defect tracking.</li>\n<li>Hands-on experience with API testing (Postman / RestAssured).</li>\n<li>Knowledge of performance testing tools (JMeter).</li>\n<li>Experience with Git, Jenkins, and CI/CD processes.</li>\n<li>Good understanding of Agile methodologies.</li>\n<li>Excellent communication and analytical skills.</li>\n</ul>\n<p><strong>Include Subject Code: QA/25</strong></p>",
        "tags": [
            "3+ Years",
            "Selenium",
            "API Testing",
            "JMeter"
        ],
        "summary": "Seeking a QA Engineer to design and execute automated tests for web/mobile apps. Must have 3+ years experience with automation frameworks and API testing tools."
    },
    {
        "job_title": "DevOps Sales Executive",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/25794",
        "location": "Technopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>DevOps Sales Executive</h2>\n<p><strong>Company:</strong> HONEYKODE TECHNOLOGIES (P) Ltd\n<strong>Location:</strong> D-2 Module, 6th floor, Bhavani Building, Technopark Campus, 695581\n<strong>Website:</strong> http://www.honeykode.com\n<strong>Contact Email:</strong> hr@honeykode.com\n<strong>Application Closing Date:</strong> December 15, 2025\n<strong>Job Published Date:</strong> December 08, 2025</p>\n<h3>Job Summary</h3>\n<p>We are seeking a driven DevOps Sales Executive to hunt for new business opportunities, manage the full sales cycle, and meet revenue targets. You will engage clients, understand their pain points, and position our comprehensive DevOps offerings.</p>\n<h3>Business Development</h3>\n<ul>\n<li>Hunt for new business opportunities across startups, SMBs, and enterprises.</li>\n<li>Own the complete sales cycle — from prospecting to proposal to signed contract.</li>\n<li>Build and manage a healthy pipeline of qualified leads.</li>\n<li>Develop outreach strategies via LinkedIn, email campaigns, events, and referrals.</li>\n</ul>\n<h3>Client Engagement</h3>\n<ul>\n<li>Understand client pain points around deployment, infrastructure, and scalability.</li>\n<li>Present and position our DevOps offerings: CI/CD implementation, cloud migration, infrastructure automation, Kubernetes, monitoring, and managed DevOps services.</li>\n<li>Conduct discovery calls, demos, and solution walkthroughs.</li>\n<li>Collaborate with our engineering team to craft tailored proposals.</li>\n</ul>\n<h3>Revenue Ownership</h3>\n<ul>\n<li>Meet and exceed monthly/quarterly revenue targets.</li>\n<li>Negotiate contracts and close deals independently.</li>\n<li>Nurture long-term client relationships for repeat business and referrals.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Must-Haves:</strong></p>\n<ul>\n<li>2–4 years in B2B sales, preferably in IT services, cloud, or DevOps/SaaS.</li>\n<li>Good understanding of DevOps concepts: CI/CD, Docker, Kubernetes, Terraform, cloud platforms (AWS/Azure/GCP), monitoring tools.</li>\n<li>Proven track record of meeting or exceeding sales targets.</li>\n<li>Exceptional communication and presentation skills.</li>\n<li>Self-starter who thrives in a fast-paced, entrepreneurial environment.</li>\n</ul>\n<p><strong>Good to Have:</strong></p>\n<ul>\n<li>Existing network in the tech/startup ecosystem.</li>\n<li>Experience selling to CTOs, Engineering Managers, or IT decision-makers.</li>\n<li>Familiarity with CRM tools (HubSpot, Salesforce, etc.).</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "DevOps",
            "B2B Sales",
            "Cloud"
        ],
        "summary": "Seeking a DevOps Sales Executive to drive business development and client engagement. Must have 2-4 years of B2B sales experience in IT services or cloud/DevOps."
    },
    {
        "job_title": "Odoo Developer (1-Year Contract)",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/25793",
        "location": "Technopark",
        "closing_date": "17 Dec 2025",
        "job_description": "<h2>Odoo Developer (1-Year Contract)</h2>\n<p><strong>Company:</strong> Lean Transitions Solutions\n<strong>Location:</strong> Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum , 695581\n<strong>Website:</strong> http://www.LeanTransitionSolutions.com\n<strong>Closing Date:</strong> 17, Dec 2025\n<strong>Job Published:</strong> 08, Dec 2025\n<strong>Contact Email:</strong> careers@ltslean.com</p>\n<h3>About Lean Transitions Solutions (LTS)</h3>\n<p>Founded over a decade ago with headquarters in the United Kingdom, Lean Transition Solutions Ltd (LTS) is an ISO 9001:2015 certified company advocating Industry 4.0. LTS delivers Lean Industry 4.0 and Leadership 4.0 software solutions to world-class organizations globally, including Fortune 500 companies. With global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico, our dedicated team ensures bespoke software solutions address industrial and manufacturing challenges. We uphold core values: Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<h3>Job Overview</h3>\n<p>LTS is seeking an experienced Odoo Developer for a 1-year contract position. The ideal candidate will possess approximately 5 years of hands-on experience in Odoo development and customization, with strong expertise in Python, PostgreSQL, and the Odoo framework. This role involves developing, customizing, deploying, and maintaining Odoo modules to support business processes throughout the contract period.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop, customize, deploy, and maintain Odoo modules to meet client-specific requirements.</li>\n<li>Modify and extend core Odoo functionalities to support complex business processes.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Identify, troubleshoot, and resolve issues in existing applications.</li>\n<li>Collaborate with project managers, designers, and QA teams to deliver high-quality solutions.</li>\n<li>Support data migration, cleansing, and validation activities.</li>\n<li>Ensure solutions adhere to security, performance, and scalability standards.</li>\n<li>Contribute to DevOps pipelines and infrastructure automation where applicable.</li>\n<li>Document technical designs, configurations, and customizations.</li>\n<li>Provide guidance and mentorship on best practices for the Odoo development lifecycle.</li>\n<li>Enhance system performance and ensure scalability of Odoo implementations.</li>\n<li>Participate in code reviews and contribute to team knowledge-sharing efforts.</li>\n<li>Stay current with advancements in Odoo development and emerging industry practices.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>5+ years of hands-on experience with Odoo ERP (Enterprise preferred).</li>\n<li>Strong knowledge of Odoo ORM, module architecture, and security framework.</li>\n<li>Proficiency in Python and PostgreSQL.</li>\n<li>Proven experience in Odoo deployment on cloud or on-premise environments.</li>\n<li>Familiarity with Docker, Kubernetes, and cloud platforms such as AWS or Azure.</li>\n<li>Comfortable working in Agile development environments.</li>\n<li>Excellent problem-solving skills and the ability to communicate technical ideas clearly.</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Exposure to agentic AI, RPA, or AI-driven process automation.</li>\n<li>Experience with CI/CD pipelines.</li>\n</ul>\n<h3>Contract Details</h3>\n<ul>\n<li><strong>Contract Duration:</strong> 1 Year</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates should forward their detailed resume to careers@ltslean.com with the subject line “Odoo Developer – Contract”. Please include the following information in the email content:</p>\n<ul>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li>Current Location</li>\n<li>Total Relevant Experience</li>\n<li>Willingness to work at the office</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Seeking an Odoo Developer with 5 years of experience for a 1-year contract. Responsibilities include module development, customization, deployment, and maintenance using Python and PostgreSQL."
    },
    {
        "job_title": "Brand & Marketing Manager – FMCG (Spices)",
        "company": "Shellsquare Softwares (P) Ltd",
        "url": "https://technopark.org/job-details/25791",
        "location": "Technopark",
        "closing_date": "22 Jan 2026",
        "job_description": "<h2>Brand &amp; Marketing Manager – FMCG (Spices)</h2>\n<p><strong>Company:</strong> ShellSquare Softwares (P) Ltd\n<strong>Location:</strong> 1st floor, Periyar Building, Technopark Phase I, Kerala, 695581\n<strong>Website:</strong> http://www.shellsquare.com\n<strong>Contact Email:</strong> careers@Shellsquare.com\n<strong>Job Published:</strong> 08, Dec 2025\n<strong>Closing Date:</strong> 22, Jan 2026</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced Brand &amp; Marketing Manager to lead the strategic branding and go-to-market initiatives for our spices portfolio. This role will be responsible for strengthening brand equity across packaging, consumer communication, digital platforms, and market activation.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Drive end-to-end brand strategy and positioning</li>\n<li>Develop branding guidelines for packaging, brochures, and website</li>\n<li>Lead go-to-market planning &amp; execution for product launches</li>\n<li>Manage social media and digital marketing campaigns</li>\n<li>Strengthen online brand presence &amp; performance marketing initiatives</li>\n</ul>\n<h3>Candidate Profile:</h3>\n<ul>\n<li>5–10 years of experience in Brand Management / FMCG Marketing</li>\n<li>Prior exposure to Food/Spices category preferred.</li>\n<li>Strong understanding of brand building, packaging, and digital marketing</li>\n<li>Proven stakeholder &amp; agency management skills</li>\n<li>Immediate to 15 days joiners preferred</li>\n</ul>\n<p><strong>Location:</strong> Technopark, Trivandrum, Kerala\n<strong>Industry:</strong> FMCG / Food / Spices\n<strong>Compensation:</strong> Competitive &amp; commensurate with experience</p>\n<p><strong>To apply:</strong> Share your profile at careers@Shellsquare.com with subject: Brand &amp; Marketing Manager – Spices</p>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Branding</li>\n<li>Social media marketing</li>\n<li>Spices</li>\n<li>FMCG</li>\n</ul>",
        "tags": [
            "5-10 Years",
            "FMCG",
            "Branding",
            "Digital Marketing"
        ],
        "summary": "Seeking an experienced Brand & Marketing Manager for our spices portfolio. Responsibilities include driving brand strategy, go-to-market initiatives, and digital marketing campaigns."
    },
    {
        "job_title": "Videographer/Photographer/Editor",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/25790",
        "location": "Technopark",
        "closing_date": "10 Dec 2025",
        "job_description": "<h2>Walk-In Videographer/Photographer/Editor</h2>\n<p><strong>Company:</strong> HONEYKODE TECHNOLOGIES (P) Ltd\n<strong>Website:</strong> http://www.honeykode.com</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> December 10, 2025\n*   <strong>Time:</strong> 10:00 AM - 12:00 PM</p>\n<p><strong>Contact Email:</strong> hr@honeykode.com</p>\n<h3>Job Description:</h3>\n<p><strong>Videography:</strong>\n- Plan, shoot, and edit video content for various platforms (YouTube, social media, websites, advertising, etc.).\n- Operate cameras, audio equipment, lighting, and stabilizers to ensure high-quality footage.\n- Collaborate on storyboarding and scripting as needed.\n- Ensure consistency with brand identity and visual style.</p>\n<p><strong>Photography:</strong>\n- Capture high-quality photographs including portraits, products, events, behind-the-scenes, and lifestyle imagery.\n- Set up lighting, composition, and environments to achieve desired visual effects.\n- Retouch and edit photos for publication.</p>\n<p><strong>Editing:</strong>\n- Edit video content using software such as Adobe Premiere Pro, Final Cut Pro, or DaVinci Resolve.\n- Color grade footage and enhance audio for professional quality.\n- Organize and manage media assets, backups, and archives.\n- Export and optimize content for different platforms and formats.</p>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Minimum 1-2 years of experience in video production, photography, and editing.</li>\n<li>Proficiency in Adobe Creative Suite (Premiere Pro, After Effects, Photoshop, Lightroom).</li>\n<li>Strong eye for visual composition, storytelling, and detail.</li>\n<li>Ability to work independently and under tight deadlines.</li>\n<li>Familiarity with social media trends and content formats (Instagram Reels, YouTube Shorts).</li>\n<li>Knowledge of lighting and audio setups for both indoor and outdoor shoots.</li>\n<li>Excellent time management and organizational skills.</li>\n</ul>\n<h3>Walk-In Venue:</h3>\n<ul>\n<li><strong>Company:</strong> Honeykode Technologies Pvt. Ltd,</li>\n<li><strong>Address:</strong> Technopark Campus, Phase 1, 6th Floor, Bhavani Building, Trivandrum.</li>\n<li><strong>Work Location:</strong> Santinni Bridal Boutique, Pattom, Thiruvananthapuram.</li>\n<li><strong>Salary:</strong> 10,000 - 15,000 INR</li>\n</ul>\n<h3>Important Notes:</h3>\n<ul>\n<li><strong>Technopark Entry:</strong> Candidates must apply for a Technopark Campus entry pass via the mobile app or web browser (vms.technopark.org). The pass will be sent via SMS/email and must be shown at the gate. For those without smartphones, print hardcopies from kiosks using an OTP.</li>\n<li><strong>Original Certificates:</strong> Original certificates will be verified at the Entry Gate for interview entry.</li>\n</ul>\n<p><strong>Mobile App Links:</strong>\n- <a href=\"Click here to download the Mobile App for Android\">Android</a>\n- <a href=\"Click here to download the Mobile App for iOS\">iOS</a></p>\n<p><strong>User Manual:</strong> [Click here for the User Manual]</p>",
        "tags": [
            "1-2 Years",
            "Adobe Premiere Pro",
            "Photography",
            "Videography"
        ],
        "summary": "Seeking a Videographer/Photographer/Editor with 1-2 years of experience. Responsibilities include shooting, editing video and photos, and managing media assets. Proficiency in Adobe Creative Suite is required."
    },
    {
        "job_title": "Full Stack Developer (React.js and Node.js)",
        "company": "Ferns It Solutions  (P) Ltd",
        "url": "https://technopark.org/job-details/25789",
        "location": "Technopark",
        "closing_date": "25 Dec 2025",
        "job_description": "<h2>Full Stack Developer (React.js and Node.js)</h2>\n<p><strong>Company:</strong> Ferns IT Solutions (P) Ltd\n<strong>Location:</strong> Module No.03, 2nd floor, Thejaswini Building, Phase I, Technopark, Thiruvananthapuram, Kerala (Onsite Role)\n<strong>Contact:</strong> jobs@ferns-it.com\n<strong>Published:</strong> 08, Dec 2025\n<strong>Closing Date:</strong> 25, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a skilled Full Stack Developer with 2–3 years of experience in React.js, Next.js, and Node.js. The role requires working knowledge of DevOps and AI-based tools, with the ability to manage full project lifecycles from development to deployment, ensuring performance, security, and scalability.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop modern, high-quality web applications using React.js, Next.js, and Node.js.</li>\n<li>Implement server-side logic using Node.js (Express.js) and integrate APIs efficiently.</li>\n<li>Utilize Next.js features such as SSR, SSG, routing, and API routes.</li>\n<li>Build reusable and scalable UI components with React.js.</li>\n<li>Translate UI/UX wireframes into responsive and pixel-perfect front-end layouts.</li>\n<li>Implement CI/CD pipelines, manage deployments, and support DevOps tasks (environment setup, server monitoring, version control).</li>\n<li>Manage application hosting on VPS/Cloud servers, including deployments, backups, and performance monitoring.</li>\n<li>Integrate AI tools, automation, or AI APIs to enhance functionality.</li>\n<li>Optimize applications for speed, efficiency, and scalability across devices and browsers.</li>\n<li>Troubleshoot issues, debug applications, and maintain code quality and security standards.</li>\n<li>Collaborate with cross-functional teams for timely project delivery.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 2–3 years of hands-on experience with React.js, Next.js, and Node.js.</li>\n<li><strong>Frontend:</strong> Strong proficiency in JavaScript (ES6+), HTML5, CSS3, responsive UI development.</li>\n<li><strong>Backend:</strong> Experience with Express.js, RESTful APIs, third-party integrations.</li>\n<li><strong>Next.js:</strong> Strong understanding of Routing, SSR, SSG, API Routes.</li>\n<li><strong>Databases:</strong> Knowledge of MongoDB or MySQL.</li>\n<li><strong>DevOps:</strong> Good understanding of CI/CD pipelines (GitHub Actions/GitLab CI/Jenkins), VPS/Cloud deployment, server monitoring, basic Docker/containerization.</li>\n<li><strong>Cloud:</strong> Familiarity with AWS, Google Cloud, or DigitalOcean.</li>\n<li><strong>Real-time:</strong> Experience in real-time applications (Socket.io preferred).</li>\n<li><strong>Optimization:</strong> Knowledge of security best practices, performance optimization, code splitting.</li>\n<li><strong>AI:</strong> Familiarity with AI tools, automation tools, or AI integrations (e.g., OpenAI).</li>\n<li><strong>Soft Skills:</strong> Strong debugging, problem-solving, analytical, communication, and teamwork abilities.</li>\n<li><strong>Version Control:</strong> Proficiency with Git.</li>\n</ul>\n<h3>Candidate Preference</h3>\n<ul>\n<li>Preferred Candidate Location: Thiruvananthapuram, Kerala</li>\n<li>Candidates who can work from the office will be preferred for this onsite role.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your updated resume with the subject line: “Resume for Full Stack Developer Vacancy – Dec 2025” to jobs@ferns-it.com.</p>\n<p>Shortlisted candidates will be contacted for the interview process.</p>",
        "tags": [
            "2-3 Years",
            "React.js",
            "Node.js",
            "DevOps"
        ],
        "summary": "Seeking a Full Stack Developer with 2-3 years of experience in React.js, Next.js, and Node.js. Role involves full project lifecycle management, including DevOps and AI integration, for an onsite position."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/25788",
        "location": "Technopark",
        "closing_date": "17 Dec 2025",
        "job_description": "<h2>Odoo Developer</h2>\n<p><strong>Company:</strong> Lean Transitions Solutions\n<strong>Location:</strong> Technopark Phase -1, Trivandrum, India\n<strong>Website:</strong> http://www.LeanTransitionSolutions.com\n<strong>Contact Email:</strong> careers@ltslean.com</p>\n<h3>About Lean Transitions Solutions (LTS)</h3>\n<p>Founded over a decade ago and headquartered in the United Kingdom, Lean Transition Solutions Ltd (LTS) is an ISO 9001:2015 certified company advocating for Industry 4.0. LTS delivers Lean Industry 4.0 software and Leadership 4.0 solutions to world-class organizations globally, including Fortune 500 companies. With global presence in India, Germany, Poland, the United States, UAE, Jordan, and Mexico, LTS is dedicated to meeting client requirements with bespoke software solutions that address industrial and manufacturing challenges. Our culture nurtures core values: Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<p><strong>Address:</strong> Lean transition Solutions, Periyar Building, Technopark Phase 1, Trivandrum.</p>\n<h3>About the Role</h3>\n<p>LTS is seeking an experienced Odoo Developer with approximately 3 years of hands-on experience in Odoo development and customization. The ideal candidate will possess strong expertise in Python, PostgreSQL, and the Odoo framework, with the ability to develop, customize, and maintain Odoo modules to support business processes.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop, customize, and maintain Odoo modules to suit client-specific needs.</li>\n<li>Modify and extend core Odoo functionalities to support unique business processes.</li>\n<li>Produce clean, maintainable, and well-documented code.</li>\n<li>Identify and resolve issues within existing applications.</li>\n<li>Collaborate with project managers, designers, and QA teams to deliver high-quality solutions.</li>\n<li>Support data migration, cleansing, and validation activities.</li>\n<li>Ensure solutions adhere to security standards.</li>\n<li>Contribute to DevOps pipelines and infrastructure automation where applicable.</li>\n<li>Document technical designs, configurations, and customizations.</li>\n<li>Provide guidance on best practices for Odoo lifecycle management.</li>\n<li>Enhance system performance and ensure scalability of Odoo implementations.</li>\n<li>Participate in code reviews and contribute to team knowledge-sharing efforts.</li>\n<li>Stay current with advancements in Odoo development and emerging industry practices.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>3+ years of hands-on experience with Odoo ERP (Enterprise preferred).</li>\n<li>Strong knowledge of Odoo ORM, module architecture, and security framework.</li>\n<li>Proficiency in Python and PostgreSQL.</li>\n<li>Experience in Odoo deployment on cloud or on-premise environments.</li>\n<li>Familiarity with Docker, Kubernetes, and cloud platforms such as AWS or Azure.</li>\n<li>Comfortable working in Agile development environments.</li>\n<li>Excellent problem-solving skills and the ability to communicate technical ideas clearly.</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Exposure to agentic AI, RPA, or AI-driven process automation.</li>\n<li>Experience with CI/CD pipelines.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates are invited to forward their detailed resume to careers@ltslean.com with the subject line “Odoo Developer”. Please include the following information in the email content:</p>\n<ul>\n<li>Current CTC:</li>\n<li>Expected CTC:</li>\n<li>Notice Period:</li>\n<li>Current Location:</li>\n<li>Total Relevant Experience:</li>\n<li>Willingness to work at office:</li>\n</ul>\n<p><strong>Closing Date:</strong> December 17, 2025\n<strong>Job Published:</strong> December 08, 2025</p>",
        "tags": [
            "3+ Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Experienced Odoo Developer sought for module customization and maintenance. Requires Python, PostgreSQL, and Odoo framework expertise to support global business processes."
    },
    {
        "job_title": "MERN STACK DEVELOPER - Trainees",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/25787",
        "location": "Technopark",
        "closing_date": "23 Dec 2025",
        "job_description": "<h2>MERN STACK DEVELOPER - Trainees</h2>\n<p><strong>Company:</strong> Softnotions Technologies (P) Ltd</p>\n<p><strong>Location:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</p>\n<p><strong>Website:</strong> https://softnotions.com</p>\n<p><strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<p><strong>Closing Date:</strong> 23, Dec 2025</p>\n<p><strong>Job Published:</strong> 08, Dec 2025</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Write reusable, testable, and efficient code.</li>\n<li>Bind UI elements to JavaScript object models.</li>\n<li>Create RESTful services.</li>\n<li>Work in a cross-functional team to deliver a complete user experience.</li>\n<li>Create Unit and Integration tests to ensure the quality of code.</li>\n<li>Be responsive to change requests and feature requests.</li>\n<li>Write code that is cross-platform and cross-device compatible.</li>\n</ul>\n<h3>Technical Requirements:</h3>\n<ul>\n<li>Exceptional coding skills in Javascript / Jquery, MySQL, MongoDB, Node JS, React JS, Hooks, Redux, Context APIs.</li>\n<li>Understanding of Asynchronous request handling techniques.</li>\n<li>Implementation of security and data protection.</li>\n<li>Understanding of performance testing and optimization techniques.</li>\n<li>Ability to translate Wireframes.</li>\n<li>Good at HTML5, CSS3, jQuery, Mobile Responsiveness.</li>\n<li>Proven experience in front &amp; back-end development.</li>\n<li>Good Knowledge of Node Debugging, Understanding &amp; proficiency in REST APIs.</li>\n<li>Familiarity with Git Repository and Jira.</li>\n<li>Integration of data storage solutions [NoSQL].</li>\n<li>Experience with modern frameworks and design patterns.</li>\n<li>Experience in Version control systems like GIT.</li>\n<li>Knowledge in Agile development methodologies and workflows.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Ability to thrive in a dynamic, client-facing role where delivering solid work products in a timely manner to exceed high expectations is a measure of success.</li>\n<li>Ability to understand business outcomes and apply them to solutions that improve overall service &amp; delivery.</li>\n<li>Excellent Leadership, communication, and interpersonal skills.</li>\n<li>Eager to contribute in a team-oriented environment.</li>\n<li>Ability to manage ambiguity and solve undefined problems.</li>\n</ul>\n<h3>Experience:</h3>\n<ul>\n<li>0 - 6 months of Experience</li>\n</ul>",
        "tags": [
            "0-6 Months Experience",
            "MERN Stack",
            "React JS",
            "Node JS"
        ],
        "summary": "Seeking a MERN Stack Developer Trainee with 0-6 months experience. Must have strong skills in JavaScript, React, Node, and MongoDB for front-end and back-end development."
    },
    {
        "job_title": "WALK-IN DRIVE - TELESALES",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25786",
        "location": "Technopark",
        "closing_date": "10 Dec 2025",
        "job_description": "<h2>Telesales Executive Walk-In Drive at TRAINONEX SOLUTIONS (P) Ltd</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd\n<strong>Website:</strong> www.trainonexsolutions.in\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Walk-In Details:</strong>\n- <strong>Date:</strong> December 10, 2025\n- <strong>Time:</strong> 10:30 AM - 12:30 PM\n- <strong>Job Published:</strong> December 08, 2025</p>\n<p><strong>Walk-In Venue:</strong>\nTECHNOPARK PHASE 1, CARNIVAL BUILDING, GROUND FLOOR, KAZHAKUTTAM, TRIVANDRUM, 695581</p>\n<p><strong>Brief Description:</strong>\nTRAINONEX SOLUTIONS is seeking a motivated and dynamic Telesales Executive to join their team. The role involves handling sales over the phone, maintaining customer relationships, and contributing to business growth by acquiring new customers. You will promote products/services, explain features and benefits, identify potential clients, qualify leads, and close deals.</p>\n<p><strong>Responsibilities:</strong>\n- Contact potential customers via phone calls to promote company products/services.\n- Explain product features, pricing, and benefits clearly to customers.\n- Handle customer inquiries and provide accurate information.\n- Follow up on leads and maintain a database of customer contacts.\n- Build and maintain positive relationships with customers.</p>\n<p><strong>Requirements:</strong>\n- <strong>Experience:</strong> 0-1 years (Freshers are welcome to apply)\n- <strong>Joining:</strong> Immediate joiners preferred.\n- <strong>Work Mode:</strong> Work from office.\n- <strong>Candidates:</strong> Male and female candidates preferred.\n- <strong>Language:</strong> Fluency in Malayalam is required.\n- <strong>Basic Pay:</strong> ₹14,000 - ₹20,000\n- <strong>Application Subject:</strong> Please mention \"Telesales Executive\" in the subject line.</p>\n<p><strong>Preferred Skills:</strong>\n- Confident and friendly telephone manner.\n- Ability to handle rejections and remain motivated.\n- Customer interaction skills.\n- Strong communication skills.\n- Time management skills.</p>\n<p><strong>Technopark Entry Pass:</strong>\nCandidates need to apply for an entry pass to Technopark Campus via the mobile app or web browser (vms.technopark.org). An entry pass will be sent to your registered mobile number/email ID. Show the softcopy on your gadget at the Technopark Entrance Gate. For those without smartphones, print your hardcopy entry pass from self-operating Kiosks at the Reception Building using the provided OTP.</p>\n<p><strong>Mobile App Downloads:</strong>\n- Android: [Click here to download the Mobile App for Android]\n- iOS: [Click here to download the Mobile App for iOS]</p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for interview entry.</p>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Malayalam"
        ],
        "summary": "Seeking a Telesales Executive for phone sales and customer relations. Responsibilities include promoting products, handling inquiries, and closing deals. Freshers welcome."
    },
    {
        "job_title": "QA Lead 6+Yrs Exp",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25785",
        "location": "Technopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>QA Lead - GNX Digital Solutions (P) Ltd</h2>\n<p><strong>Location:</strong> TECHNOPARK, Trivandrum, India\n<strong>Contact:</strong> hr@gnxsolutions.in\n<strong>Closing Date:</strong> December 15, 2025\n<strong>Published:</strong> December 08, 2025</p>\n<h3>Job Summary</h3>\n<p>We are seeking an experienced QA Lead to guide our Quality Assurance team in both manual and automation testing. The ideal candidate possesses strong technical skills, leadership capabilities, and practical experience in creating test strategies, maintaining product quality, and enhancing QA processes.</p>\n<h3>Key Responsibilities:</h3>\n<p><strong>Leadership &amp; Team Management</strong>\n- Lead, mentor, and guide the QA team (manual &amp; automation testers).\n- Assign tasks, manage workloads, and ensure timely delivery of testing activities.\n- Conduct regular review meetings, performance evaluations, and skill development planning.</p>\n<p><strong>Test Planning &amp; Strategy</strong>\n- Develop and maintain comprehensive test strategies, plans, and processes.\n- Coordinate testing efforts across multiple projects/releases.\n- Identify risks, create mitigation plans, and ensure high-quality standards.</p>\n<p><strong>Manual Testing</strong>\n- Oversee and participate in functional, regression, integration, system, and UAT testing.\n- Review test scenarios, test cases, and ensure proper coverage.\n- Validate product functionality and ensure adherence to requirements.</p>\n<p><strong>Automation Testing</strong>\n- Design, develop, and maintain test automation frameworks (UI/API).\n- Identify test cases for automation and drive automation coverage.\n- Work with the development team for CI/CD integration and test optimization.</p>\n<p><strong>Quality Governance</strong>\n- Ensure bug reporting, tracking, and closure through appropriate tools.\n- Define QA metrics and generate quality reports for stakeholders.\n- Drive process improvements, best practices, and standardization across QA.</p>\n<p><strong>Collaboration</strong>\n- Work closely with developers, product managers, business analysts, and DevOps teams.\n- Participate in requirement reviews, design discussions, and sprint planning.\n- Act as the QA point-of-contact for project stakeholders.</p>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>6+ years of experience in software testing, with at least 2–3 years in a lead role.</li>\n<li>Strong experience in both manual and automation testing.</li>\n<li>Hands-on experience with automation tools such as Selenium, Cypress, Playwright, Appium, or similar.</li>\n<li>Experience in API testing with tools like Postman, RestAssured, etc.</li>\n<li>Good understanding of CI/CD tools (Jenkins, GitLab, Azure DevOps).</li>\n<li>Strong knowledge of SDLC, STLC, Agile/Scrum methodologies.</li>\n<li>Expertise in test case design, defect tracking, and test planning.</li>\n<li>Excellent leadership, communication, and stakeholder management skills.</li>\n</ul>\n<h3>Good to Have:</h3>\n<ul>\n<li>Experience in performance testing (JMeter, LoadRunner).</li>\n<li>Exposure to cloud environments (AWS, Azure, GCP).</li>\n<li>Experience in web, mobile, and API test automation.</li>\n<li>ISTQB or other testing certifications.</li>\n</ul>\n<p><strong>Company:</strong> GNX Digital Solutions (P) Ltd\n<strong>Website:</strong> https://gnxsolutions.in</p>",
        "tags": [
            "6+ Years",
            "Selenium",
            "API Testing",
            "Agile"
        ],
        "summary": "Lead QA team for manual and automation testing. Develop test strategies, ensure quality, and mentor testers. Requires 6+ years of experience."
    }
]