[
    {
        "job_title": "Data Science Freshers",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19658/157",
        "location": "Infopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>Data Science Fresher</h2>\n<ul>\n<li>Explain the predictive models to various business users and make recommendations to drive business strategy.</li>\n<li>Make recommendations to resolve application performance problems.</li>\n<li>Implement data processing methods and tools.</li>\n<li>Collaborate with product leaders, subject matter experts, and decision-makers to develop success criteria and optimize new products, features, policies, and models.</li>\n<li>Leverage your experience in analytics tools and scientific rigor to produce actionable insights.</li>\n<li>Distill and communicate key insights to senior management in verbal, visual, and written media.</li>\n<li>Together with the Co-op department lead, determine an appropriate data science problem statement and toolset to apply during the co-op term.</li>\n<li>Determine strengths and weaknesses of data science toolsets and procedures.</li>\n</ul>\n<p><strong>Qualification</strong></p>\n<ul>\n<li>Knowledge of Machine Learning concepts (cross-validation, regularization, boosting, bootstrapping) is a plus.</li>\n<li>Working on a degree in Computer Science, or a related field, with project experience in data analysis.</li>\n<li>Experience with big data technologies (Hadoop, Hive, MongoDB, Spark).</li>\n<li>Experience with statistical analysis and data mining using tools such as R, SAS, Matlab, Stata, or SPSS.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0 Years",
            "Machine Learning",
            "Data Analysis",
            "Big Data"
        ],
        "summary": "Looking for a Data Science fresher to explain predictive models, implement data processing methods, and collaborate with product leaders. Requires knowledge of machine learning, data analysis, and big data technologies."
    },
    {
        "job_title": "Project Manager (Data & Analytics)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19659/157",
        "location": "Infopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>Project Manager (Data &amp; Analytics)</h2>\n<p>We are looking for an experienced Project Manager – Data &amp; Analytics to lead and manage data-driven projects across various business domains. The ideal candidate will have strong experience in managing data engineering, business intelligence, and analytics projects, with a proven ability to collaborate with technical and business stakeholders to deliver high-impact solutions on time and within budget.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead end-to-end project management for data and analytics initiatives.</li>\n<li>Define project scope, goals, deliverables, timelines, and resource plans.</li>\n<li>Work closely with data engineers, data scientists, analysts, and business stakeholders.</li>\n<li>Manage project risks, issues, and dependencies proactively.</li>\n<li>Ensure quality assurance, timely reporting, and documentation throughout the project lifecycle.</li>\n<li>Communicate project status, updates, and escalations to leadership and stakeholders.</li>\n<li>Drive Agile/Scrum ceremonies and ensure timely sprint deliverables.</li>\n<li>Coordinate across cross-functional teams to ensure alignment with business objectives.</li>\n<li>Track KPIs, ROI, and business impact of analytics solutions.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Engineering, or a related field.</li>\n<li>PMP/PRINCE2 certification is a plus.</li>\n<li>7+ years of total experience with at least 3+ years in managing data analytics or data engineering projects.</li>\n<li>Strong understanding of data warehousing, ETL pipelines, data visualization, and analytics platforms.</li>\n<li>Hands-on experience working with tools/technologies like SQL, Power BI/Tableau, Python/R /R (preferred), and cloud data platforms (AWS/GCP/Azure).</li>\n<li>Strong project management skills including planning, budgeting, and stakeholder management.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "7+ Years",
            "Data Analytics",
            "SQL",
            "Data Engineering",
            "Project Management"
        ],
        "summary": "Seeking a Project Manager to lead data and analytics projects, ensuring timely delivery and stakeholder collaboration. Requires 7+ years of experience in data-driven initiatives."
    },
    {
        "job_title": "HR & Admin (7-10 years)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19660/157",
        "location": "Infopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>HR &amp; Admin</h2>\n<p>As an HR and Admin, you will play a pivotal role in the organization's human resources functions, contributing to the development and implementation of HR strategies and policies. Your primary responsibilities will include collaborating with departmental managers to understand staffing needs, conducting recruitment processes, and managing employee onboarding. You will actively participate in fostering a positive workplace culture through employee engagement initiatives, performance management, and resolving HR-related issues.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design and implement company policies that promote a healthy work environment.</li>\n<li>Ensure a fair recruitment plan and oversee new hiring, interviews, and orientations.</li>\n<li>Facilitating the Onboarding process for new hires.</li>\n<li>Conducting induction programs to provide information about the company, its policies, and procedures.</li>\n<li>Maintaining accurate and up-to-date HR records.</li>\n<li>Handling employee queries and promoting a positive and productive workplace culture.</li>\n<li>Negotiating salary and other compensation terms and extending an offer of employment</li>\n<li>Ensure HR procedures comply with labor laws and regulations.</li>\n<li>Handling Administration activities.</li>\n<li>Process monthly payroll</li>\n<li>Actively involved in the employee performance review</li>\n<li>Participates in the evaluation and monitoring of training programs to ensure success.</li>\n<li>Organize learning and development programs</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Experience in IT Recruitment is a must.</li>\n<li>Minimum 7-10 years of relevant work experience in the IT industry.</li>\n<li>Minimum 5 years of recent experience in an IT company.</li>\n<li>Knowledge and familiarity with labor laws.</li>\n<li>Outstanding communication skills in English.</li>\n<li>Excellent organizational skills and attention to detail</li>\n<li>Ability to acquire a thorough understanding of the organization’s hierarchy, jobs, qualifications, and compensation practices.</li>\n</ul>\n<p><strong>How to apply:</strong></p>\n<p>Send your resume to hr@tranzmeo.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "7-10 Years",
            "IT Recruitment",
            "HR strategies",
            "Labor Laws"
        ],
        "summary": "Seeking an HR & Admin professional to contribute to HR strategies and policies. Responsibilities include recruitment, onboarding, employee engagement, and ensuring compliance with labor laws in the IT industry."
    },
    {
        "job_title": "Junior Geophysicist- Fiber-optic Sensing & AI (Fresher)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19662/157",
        "location": "Infopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>Junior Geophysicist - Fiber-optic Sensing &amp; AI (Fresher)</h2>\n<p>We are seeking a motivated Junior Geophysicist (recent graduate) to dive into projects involving Distributed Acoustic Sensing (DAS), fiber‑optic sensor data, and Python‑driven AI analysis. You’ll work closely with geophysicists, data scientists, and engineers to drive data‑centric insights and support field deployments.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Support data acquisition, preprocessing, and interpretation from fiber‑optic sensing systems (DAS/DTS).</li>\n<li>Analyze large time‑series datasets using Python (NumPy, Pandas, SciPy, Matplotlib).</li>\n<li>Collaborate with AI/ML experts to build models for signal classification, event detection, or anomaly identification.</li>\n<li>Participate in field activities, including deploying sensors, monitoring systems, and validating datasets.</li>\n<li>Document workflows, results, and technical insights clearly in reports or code comments.</li>\n</ul>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li>Bachelor's or Master's degree in Geophysics, Geoscience, Physics, Engineering, or related discipline.</li>\n<li>Fundamental understanding of seismic wave behavior and fiber‑optic sensing principles.</li>\n<li>Basic proficiency in Python and experience with data‑analysis libraries.</li>\n<li>Interest in machine learning—any exposure to scikit‑learn, TensorFlow, or PyTorch is a plus.</li>\n<li>Excellent analytical thinking, communication skills, and collaborative mindset.</li>\n</ul>\n<p><strong>Preferred (Nice-to-Have)</strong></p>\n<ul>\n<li>Experience with signal processing, time‑series analysis, or seismic inversion methods.</li>\n<li>Familiarity with version control systems (e.g., Git) and Jupyter notebooks.</li>\n<li>Willingness and physical ability to participate in occasional fieldwork and travel.</li>\n</ul>\n<p><strong>What You’ll Gain</strong></p>\n<ul>\n<li>Hands‑on experience at the intersection of geophysics, fiber‑optic sensing, and AI.</li>\n<li>Mentorship from industry professionals and cross‑disciplinary collaboration.</li>\n<li>Exposure to real‑world problems in energy, infrastructure, and environmental monitoring.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0 Years",
            "Python",
            "Fiber-Optic Sensing",
            "Geophysics"
        ],
        "summary": "Seeking a Junior Geophysicist to work with fiber-optic sensing, data, and AI. Responsibilities include data analysis, model building, and field activities."
    },
    {
        "job_title": "Internship Opportunity – React.js & Node.js",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/19656/296",
        "location": "Infopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Internship Opportunity – React.js &amp; Node.js</h2>\n<p>Are you a passionate techie? We're looking for interns!</p>\n<p>If you've undergone training in React.js and Node.js, and are a 2023 / 2024 / 2025 graduate, this internship is for you!</p>\n<p><strong>Duration:</strong> 4-5 months</p>\n<p><strong>Bonus:</strong> Top performers may get absorbed into permanent roles!</p>\n<p><strong>Stipend:</strong> Internship stipend provided</p>\n<p><strong>Location:</strong> Infopark, Kakkanad</p>\n<p>If interested, please send your resume to careers@grapelime.in</p>\n<p>Feel free to forward this opportunity to anyone who might be interested!</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@grapelime.in</p>",
        "tags": [
            "0 Years",
            "React.js",
            "Node.js",
            "Internship"
        ],
        "summary": "Seeking interns with React.js and Node.js training. This 4-5 month internship in Infopark, Kakkanad, offers a stipend and potential for permanent roles."
    },
    {
        "job_title": "Fraud Monitoring Analyst / Site Reliability Engineer (SRE)",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/19657/4",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Fraud Monitoring Analyst / Site Reliability Engineer (SRE)</h2>\n<p><strong>Company:</strong> Panasa Technology\n<strong>Job Type:</strong> Full-Time\n<strong>Team Size:</strong> 10 Members</p>\n<p>We are seeking experienced Fraud Monitoring Analysts/Site Reliability Engineers (SREs) to join our dynamic Fraud Risk &amp; Monitoring team. The ideal candidates will bring robust experience in transaction monitoring, financial fraud detection, and a solid understanding of real-time payment systems and anti-fraud technologies.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Monitor fraud transactions and respond in real time.</li>\n<li>Analyse Mastercard/Visa transaction flows and identify suspicious activity.</li>\n<li>Execute BIN-level fraud detection and alerting.</li>\n<li>Work with anti-fraud platforms and dashboards.</li>\n<li>Use SQL for querying fraud-related transaction data.</li>\n<li>Develop and maintain fraud dashboards and reports.</li>\n<li>Collaborate with internal teams to improve system reliability and fraud controls.</li>\n<li>Leverage Excel (Pivot tables, VLOOKUPs) for quick data analysis and insights.</li>\n</ul>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li>Overall experience: 4+ years</li>\n<li>Fraud monitoring experience: Minimum 1–2 years</li>\n<li>Hands-on experience with anti-fraud platforms and technologies</li>\n<li>Familiarity with Mastercard/Visa transaction flows</li>\n<li>Knowledge of ISO 8583 messaging standard</li>\n<li>Strong command of Excel (Pivots, Lookups, etc.)</li>\n<li>SQL skills for data analysis</li>\n<li>Background in payments (cards/wallets/transactions)</li>\n</ul>\n<p><strong>Preferred Background:</strong></p>\n<ul>\n<li>Experience in real-time fraud alerting systems</li>\n<li>Exposure to card networks, wallets, or PSPs</li>\n<li>SRE mindset with attention to platform reliability in fraud environments</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at merin.c@panasatech.com</p>",
        "tags": [
            "4+ Years",
            "Fraud Monitoring",
            "SQL",
            "Excel"
        ],
        "summary": "Panasa Technology is looking for a Fraud Monitoring Analyst/SRE to monitor transactions and improve system reliability. The role requires experience with fraud detection, SQL, and Excel."
    },
    {
        "job_title": "Python Full Stack Developer – Fresher",
        "company": "ALTOS Technologies",
        "url": "https://infopark.in/company-jobs/details/19661/368",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Python Full Stack Developer – Fresher</h2>\n<p>Altos Technologies, a leading IT company based in Infopark, Kochi and TIDEL Park, Chennai, is seeking enthusiastic <strong>Fresher Python Full Stack Developers</strong> to join our team and build their careers in the IT industry.</p>\n<p><strong>Key Skills Required:</strong></p>\n<ul>\n<li>Basic knowledge of Python programming</li>\n<li>Familiarity with web technologies (HTML, CSS, JavaScript)</li>\n<li>Understanding of frameworks like Django or Flask is a plus</li>\n<li>Eagerness to learn and grow in a professional environment</li>\n</ul>\n<p><strong>Eligibility:</strong></p>\n<ul>\n<li>Any graduate (BCA, BSc CS/IT, B.Tech, B.Voc, etc.)</li>\n<li>2022, 2023, and 2024 pass-outs can apply</li>\n<li>Career breakers with a tech background are also welcome</li>\n</ul>\n<p>🌐 Visit us: www.altostechnologies.in</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at altos.tech.ads@altostechnologies.in</p>",
        "tags": [
            "0 Years",
            "Python",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "summary": "Altos Technologies is hiring a Fresher Python Full Stack Developer. Recent graduates and career changers are welcome to apply and grow in the IT industry."
    },
    {
        "job_title": "Front-End Developer – React.js",
        "company": "Tech Aventure",
        "url": "https://infopark.in/company-jobs/details/19663/385",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Front-End Developer – React.js</h2>\n<p><strong>Job Type:</strong> Full-Time\n<strong>Experience:</strong> 1–3 Years\n<strong>Salary:</strong> As per industry standards</p>\n<h3>About Tech Aventure</h3>\n<p>Tech Aventure Infosolution LLP is a fast-growing IT solutions company located in the Special Economic Zone, Infopark, Cherthala. We specialize in web and mobile application development with a focus on quality, innovation, and client satisfaction. Join us to work on exciting projects and be a part of our mission to build 1000 startups with modern technology solutions.</p>\n<h3>Job Summary</h3>\n<p>We are looking for a talented and passionate React.js Front-End Developer who is experienced in building dynamic, high-performance web applications. The ideal candidate will work closely with our backend developers and UI/UX designers to deliver exceptional user interfaces and smooth user experiences.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop new user-facing features using React.js</li>\n<li>Build reusable components and front-end libraries</li>\n<li>Integrate front-end components with backend services using RESTful APIs</li>\n<li>Optimize components for maximum performance across browsers and devices</li>\n<li>Translate designs and wireframes into high-quality code</li>\n<li>Collaborate with UI/UX designers, backend developers, and project managers</li>\n<li>Maintain code integrity, organization, and documentation</li>\n</ul>\n<h3>Required Skills and Qualifications</h3>\n<ul>\n<li>Strong proficiency in JavaScript (ES6+) and React.js</li>\n<li>Experience with HTML5, CSS3, Bootstrap, and Tailwind CSS</li>\n<li>Familiarity with Redux, React Router, and component-based architecture</li>\n<li>Understanding of responsive design and cross-browser compatibility</li>\n<li>Knowledge of version control tools like Git</li>\n<li>Experience with RESTful APIs integration</li>\n<li>Basic understanding of Node.js is a plus</li>\n<li>Ability to write clean, well-documented, and scalable code</li>\n<li>Good communication and team collaboration skills</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field</li>\n<li>Experience working with agile methodologies</li>\n<li>Knowledge of Figma or Adobe XD for design reference</li>\n</ul>\n<h3>Why Join Tech Aventure?</h3>\n<ul>\n<li>Work in a professional and supportive environment</li>\n<li>Opportunity to work on innovative and diverse projects</li>\n<li>Learning &amp; career growth opportunities</li>\n<li>Flexible working culture</li>\n<li>Exposure to global clients</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume and portfolio to jobs@techaventure.com with the subject line: Application for Front-End Developer – React.js</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@techaventure.com</p>",
        "tags": [
            "1-3 Years",
            "React.js",
            "JavaScript",
            "RESTful APIs"
        ],
        "summary": "Tech Aventure is seeking a Front-End Developer to build high-performance web applications using React.js. The role involves collaborating with UI/UX designers and backend developers."
    },
    {
        "job_title": "Back-End Developer – Node.js",
        "company": "Tech Aventure",
        "url": "https://infopark.in/company-jobs/details/19664/385",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Back-End Developer – Node.js</h2>\n<p><strong>About Tech Aventure</strong></p>\n<p>Tech Aventure Infosolution LLP is a rapidly growing IT company based in Infopark, Cherthala, focused on delivering scalable web and mobile solutions. We specialize in building eCommerce platforms, business applications, and subscription-based software products. Join us to be a part of innovative digital transformation projects and work with passionate professionals.</p>\n<p><strong>Job Summary</strong></p>\n<p>We are looking for an experienced and motivated Node.js Back-End Developer to join our development team. You will be responsible for developing robust server-side logic, managing databases, and integrating APIs to power our applications and web platforms.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Develop and maintain server-side logic using Node.js</li>\n<li>Build scalable and secure RESTful APIs</li>\n<li>Integrate with front-end components and third-party services</li>\n<li>Work with databases like MongoDB, MySQL, or PostgreSQL</li>\n<li>Ensure code quality, security, and performance</li>\n<li>Collaborate with front-end developers and UI/UX designers</li>\n<li>Participate in code reviews and follow best development practices</li>\n<li>Write clear documentation for internal and external use</li>\n</ul>\n<p><strong>Required Skills and Qualifications</strong></p>\n<ul>\n<li>Strong proficiency in Node.js, JavaScript (ES6+)</li>\n<li>Experience with Express.js or similar Node.js frameworks</li>\n<li>Hands-on experience with MongoDB, MySQL, or any NoSQL/SQL database</li>\n<li>Familiarity with REST APIs, JWT authentication, and OAuth</li>\n<li>Understanding of MVC architecture and asynchronous programming</li>\n<li>Experience with Git and version control</li>\n<li>Knowledge of deployment tools and cloud platforms (AWS, DigitalOcean, etc.) is a plus</li>\n<li>Basic understanding of containerization (Docker) is an advantage</li>\n<li>Good problem-solving and debugging skills</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field</li>\n<li>Knowledge of microservices architecture</li>\n<li>Experience with GraphQL is a bonus</li>\n<li>Exposure to Agile development methodologies</li>\n</ul>\n<p><strong>Why Join Tech Aventure?</strong></p>\n<ul>\n<li>Work in a collaborative and fast-paced environment</li>\n<li>Opportunities for skill development and career growth</li>\n<li>Competitive salary and performance-based bonuses</li>\n<li>Work on impactful projects for startups and global clients</li>\n<li>Professional and friendly team culture</li>\n</ul>\n<p><strong>How to Apply</strong></p>\n<p>Send your resume and portfolio (if available) to jobs@techaventure.com with the subject line: Application for Back-End Developer – Node.js</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@techaventure.com</p>",
        "tags": [
            "1-3 Years",
            "Node.js",
            "REST APIs",
            "MongoDB"
        ],
        "summary": "Tech Aventure is seeking a Node.js Back-End Developer to build server-side logic and integrate APIs. Responsibilities include database management, code quality, and collaboration with front-end developers."
    },
    {
        "job_title": "Junior Linux Administrator",
        "company": "Veeble SoftTech (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/19653/220",
        "location": "Infopark",
        "closing_date": "04 Aug 2025",
        "job_description": "<h2>Junior Linux Administrator</h2>\n<p>We are seeking a Junior Linux &amp; cPanel server administrator with 0-1 years of experience in Linux server administration, cPanel/WHM, and virtualization (KVM/OpenVZ).</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ol>\n<li>\n<p><strong>Server, cPanel &amp; Virtualization Management:</strong></p>\n<ul>\n<li>Administer Linux servers (CentOS, Ubuntu, AlmaLinux) and cPanel/WHM (account setups, migrations, security etc).</li>\n<li>Manage KVM and OpenVZ virtualization – including provisioning, troubleshooting, and performance tuning.</li>\n<li>Troubleshoot LAMP/LEMP stack (Apache/Nginx, MySQL, PHP), DNS, Email (Exim/Dovecot), and FTP issues.</li>\n<li>Implement server security (firewalls, ModSecurity, malware scans, kernel updates).</li>\n<li>Automate tasks using Bash/Python scripting.</li>\n</ul>\n</li>\n<li>\n<p><strong>Knowledge Base (KB) Documentation:</strong></p>\n<ul>\n<li>Create and maintain technical guides for cPanel, Linux servers, and virtualization (KVM/OpenVZ).</li>\n<li>Document troubleshooting steps, best practices, and FAQs for internal teams and customers.</li>\n<li>Update KB articles regularly to reflect new technologies and fixes.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>0-1 years of hands-on experience with:<ul>\n<li>Linux server administration.</li>\n<li>cPanel/WHM (including migrations and security).</li>\n<li>Virtualization (KVM &amp; OpenVZ) – setup, management, and troubleshooting.</li>\n</ul>\n</li>\n<li>Experience with LAMP/LEMP stack, DNS, SSL, and server security.</li>\n<li>Ability to write clear KB documentation for technical and non-technical users.</li>\n<li>Strong problem-solving and communication skills.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Knowledge of WHMCS, Solusvm.</li>\n<li>Experience in any cloud platform (AWS/Azure)</li>\n<li>Certifications like RHCSA, cPanel</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Health Insurance</li>\n<li>Provident Fund</li>\n</ul>\n<p><strong>Schedule:</strong></p>\n<ul>\n<li>8-hour shifts, between 07:00 am and 11:00 pm (On-site)</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>To apply, please send your updated resume to careers@veeble.com. We look forward to reviewing your application!</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@veeble.com</p>",
        "tags": [
            "0-1 Years",
            "Linux Server Administration",
            "cPanel/WHM",
            "Virtualization"
        ],
        "summary": "Seeking a Junior Linux Administrator to manage hosting environments and troubleshoot issues. Requires experience with Linux, cPanel, and virtualization, plus strong documentation skills."
    },
    {
        "job_title": "Android Developer",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/19650/68",
        "location": "Infopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Android Developer</h2>\n<p>We are seeking a skilled and passionate Android Developer with 4+ years of hands-on experience to join our dynamic team in Kochi. The ideal candidate should possess strong expertise in Java and Android development, with a solid understanding of mobile architectures and modern development practices.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Develop, test, and maintain Android applications with high performance and scalability.</li>\n<li>Adhere to design and coding standards, and contribute to continuous improvement in code quality.</li>\n<li>Collaborate closely with UI/UX designers, backend developers, and QA teams.</li>\n<li>Analyze and translate requirements into functional and technical specifications.</li>\n<li>Optimize applications for maximum speed and performance.</li>\n<li>Debug and resolve production issues, memory leaks, and performance bottlenecks.</li>\n<li>Continuously explore, evaluate, and implement new technologies to maximize development efficiency.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience</strong></p>\n<ul>\n<li>Strong hands-on programming experience in Kotlin with Room DB.</li>\n<li>Proficiency in Java and familiarity with Android Architecture Components.</li>\n<li>Solid understanding of Android SDK, Android Studio, and the Android app lifecycle.</li>\n<li>Solid Experience with Room Database, SQLite, and local data storage mechanisms.</li>\n<li>Sound knowledge of XML, JSON, and web services (SOAP/REST).</li>\n<li>Familiarity with ADB commands, device rooting, and OS-level operations.</li>\n<li>Strong debugging skills and experience optimizing application performance and stability.</li>\n<li>Exposure to software architectural patterns (MVVM, MVP, etc.) and code testability.</li>\n<li>Ability to integrate mobile apps with web services and APIs.</li>\n<li>Good understanding of data structures and algorithms (preferred).</li>\n<li>Experience working with version control systems and source code management.</li>\n</ul>\n<p><strong>Desired Attributes</strong></p>\n<ul>\n<li>Self-starter with the ability to work independently and in teams.</li>\n<li>Quick learner with a passion for new technologies and innovation.</li>\n<li>Strong communication and documentation skills.</li>\n<li>Ability to analyze, design, and implement complex mobile solutions effectively.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@cubettech.com</p>",
        "tags": [
            "4+ Years",
            "Android SDK",
            "Kotlin",
            "Room DB"
        ],
        "summary": "Seeking an Android Developer with 4+ years experience for developing and maintaining high-performance Android applications. Proficiency in Java, Kotlin, Room DB and Android SDK required."
    },
    {
        "job_title": "Power BI Developer",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/19651/68",
        "location": "Infopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Power BI Developer</h2>\n<p><strong>Job Title:</strong> Power BI Developer</p>\n<p><strong>Experience:</strong> 4 to 5 Years</p>\n<p><strong>Location:</strong> Cochin (Hybrid)</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Job Summary:</strong>\nWe are looking for an experienced and detail-oriented Power BI Developer with 4–5 years of industry experience to join our analytics and reporting team. The ideal candidate will have a strong background in business intelligence, data visualization, and analytics, along with excellent communication skills and the ability to adapt quickly to dynamic business requirements.</p>\n<p><strong>Key Responsibilities:</strong>\n- Design, develop, and maintain interactive Power BI dashboards and reports.\n- Translate business needs into technical specifications and deliver actionable insights.\n- Connect to various data sources (SQL Server, Excel, cloud services, etc.) and perform data transformations using Power Query and DAX.\n- Collaborate with business stakeholders, analysts, and data engineers to gather requirements and understand key performance metrics.\n- Optimize data models and reports for performance and scalability.\n- Ensure data accuracy, consistency, and security across all reporting solutions.\n- Support ad hoc data analysis and create visual storytelling using data.\n- Stay updated with the latest Power BI features, tools, and best practices.</p>\n<p><strong>Required Skills:</strong>\n- 4–5 years of hands-on experience with Power BI (Power BI Desktop, Power BI Service).\n- Strong proficiency in DAX and Power Query (M language).\n- Solid experience with data modeling, ETL processes, and building enterprise-level dashboards.\n- Strong SQL skills and experience working with relational databases (e.g., SQL Server, Azure SQL, etc.).\n- Understanding of data warehousing concepts and star/snowflake schema design.\n- Familiarity with Power Platform (Power Apps, Power Automate) is a plus.\n- Basic knowledge of Azure Data Services (e.g., Azure Data Factory, Azure Synapse) is advantageous.</p>\n<p><strong>Soft Skills:</strong>\n- Excellent communication skills – able to clearly explain technical concepts to non-technical stakeholders.\n- Strong analytical thinking and problem-solving abilities.\n- Ability to adapt quickly to changing priorities and business needs.\n- Self-motivated with a proactive attitude and strong ownership mindset.\n- Effective time management and organizational skills.</p>\n<p><strong>Preferred Qualifications:</strong>\n- Bachelor’s degree in Computer Science, Information Technology, Data Science, or a related field.\n- Microsoft Certification in Power BI or related technologies (optional but a plus).\n- Experience working in Agile environments.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@cubettech.com</p>",
        "tags": [
            "4-5 Years",
            "Power BI",
            "DAX",
            "SQL"
        ],
        "summary": "We are seeking a Power BI Developer to design and maintain interactive dashboards, transform data, and collaborate with stakeholders. The ideal candidate should have 4-5 years of experience."
    },
    {
        "job_title": "Senior Digital Marketing Specialist",
        "company": "Jachoos Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/19652/363",
        "location": "Infopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Senior Digital Marketing Specialist</h2>\n<p><strong>Location:</strong> Kochi, Kerala</p>\n<p><strong>Job Type:</strong> Full-Time, Permanent</p>\n<p><strong>Experience Required:</strong> Minimum 5 years</p>\n<p><strong>Pay:</strong> ₹55,000.00 - ₹65,000.00 per month</p>\n<p><strong>About the Role:</strong></p>\n<p>We are seeking a talented and driven Digital Marketing Specialist to join our team. The ideal candidate will have hands-on experience in SEO, SMO, and Google Ads, with a passion for developing and executing impactful digital campaigns.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and implement effective digital marketing strategies aligned with company objectives.</li>\n<li>Optimize website content and performance through on-page and off-page SEO practices.</li>\n<li>Plan, execute, and monitor paid advertising campaigns on Google Ads and other digital platforms.</li>\n<li>Manage and grow our presence on social media platforms (Facebook, Instagram, LinkedIn, X/Twitter).</li>\n<li>Track and report campaign performance using tools like Google Analytics and Search Console.</li>\n<li>Work collaboratively with content, design, and development teams to ensure cohesive campaign delivery.</li>\n<li>Stay up-to-date with industry trends, tools, and best practices.</li>\n<li>Prepare detailed reports and insights to improve campaign effectiveness.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Digital Media, or a related field.</li>\n<li>Candidates with minimum 5 years of digital marketing experience need to apply.</li>\n<li>Proficiency in SEO strategies and tools.</li>\n<li>Experience managing Google Ads and SMO campaigns.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Excellent communication and interpersonal abilities.</li>\n<li>Ability to work in a fast-paced and collaborative environment.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Google Ads or Google Analytics certification.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at susan@jachoos.com</p>",
        "tags": [
            "5+ Years",
            "SEO",
            "Google Ads",
            "SMO"
        ],
        "summary": "Seeking a Digital Marketing Specialist in Kochi to develop and execute digital campaigns. Must have experience in SEO, SMO, and Google Ads."
    },
    {
        "job_title": "Fraud Analyst",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/19655/4",
        "location": "Infopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Fraud Analyst</h2>\n<p><strong>Company:</strong> ART TECHNOLOGY\n<strong>Location:</strong> Cochin\n<strong>Mode of work:</strong> Remote\n<strong>No. of Openings:</strong> 1</p>\n<p>Art Technology and Software provides offshore Software Development, Web based Enterprise Solutions, Web Application Development, Multimedia and Networking Services. Leveraging our experience and expertise in Microsoft Technologies, we are committed to deliver sustainable IT solutions and support that will help you to advance your business and keep ahead of the competition. Our dedicated team of professionals, with superior technology skills, streamlined delivery infrastructure, successful and adaptable Project Development Methodologies offers you cost effective and customized solutions to meet business requirements.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Assist in the implementation and configuration of fraud detection solutions for new and existing clients.</li>\n<li>Provide consultancy and guidance on fraud rule building tailored to client-specific requirements.</li>\n<li>Ensure that deployed fraud solutions are functioning as expected and fine-tuned to adapt to evolving fraud patterns.</li>\n<li>Understand, document, and manage clients’ card transaction fraud minimization requirements.</li>\n<li>Conduct periodic audits and analysis of fraud prevention rules to identify and suggest improvements.</li>\n<li>Participate in new client onboarding projects and fraud solution rollouts.</li>\n<li>Generate and deliver insightful fraud-related analysis and reports to clients.</li>\n<li>Provide training sessions to clients on application usage and best practices in fraud prevention.</li>\n<li>Communicate regularly with project stakeholders and provide consistent follow-up on the status of issues.</li>\n<li>Track and report overall project progress, ensuring stakeholders are kept informed.</li>\n<li>Adhere to departmental and company procedures and policies, including change control, information security, auditing, release promotion, configuration management, and incident management.</li>\n<li>Support other value-added services such as chargebacks and related fraud operations processes, leveraging your expertise to assist clients as needed.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jamshiya@arttechgroup.com</p>",
        "tags": [
            "1+ Years",
            "Fraud Detection",
            "Fraud Prevention",
            "Risk Management"
        ],
        "summary": "ART TECHNOLOGY is seeking a remote Fraud Analyst to implement and configure fraud detection solutions for clients. The role involves fraud rule building, analysis, and client training."
    },
    {
        "job_title": "Sr. Oracle Forms and Reports Developer",
        "company": "CSEIDC TECHNOLOGIES PVT LTD",
        "url": "https://infopark.in/company-jobs/details/19665/481",
        "location": "Infopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Sr. Oracle Forms and Reports Developer</h2>\n<p><strong>Company:</strong> CSEIDC Technologies Private Limited, Kochi</p>\n<p><strong>Location:</strong> Kochi, Kerala (Onsite)</p>\n<p><strong>Work Schedule:</strong> Sunday to Thursday (10 AM - 7 PM)</p>\n<p>CSE (Computer &amp; System Engineering) is seeking a Senior Oracle Forms and Reports Developer to design, develop, test, and deploy applications using Oracle Forms and Reports.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, test, and deploy complex applications using Oracle Forms and Reports.</li>\n<li>Develop stored procedures, functions, packages, and triggers to meet business requirements.</li>\n<li>Deploy applications in Oracle WebLogic Server.</li>\n<li>Optimize database performance by analyzing queries, rewriting code for efficiency, and implementing indexing strategies.</li>\n<li>Collaborate with cross-functional teams to identify project needs and deliver high-quality solutions on time.</li>\n<li>Troubleshoot issues related to database performance tuning, data integrity, and security.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field.</li>\n<li>10+ years of experience in Oracle Forms and Reports.</li>\n<li>Proven experience in PL/SQL programming.</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>Effective communication and interpersonal abilities.</li>\n<li>Ability to prioritize and manage multiple tasks in a fast-paced environment.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@cse.com.sa</p>",
        "tags": [
            "10+ Years",
            "Oracle Forms and Reports",
            "PL/SQL",
            "Oracle WebLogic Server"
        ],
        "summary": "We are seeking a Senior Oracle Forms and Reports Developer to design, develop, and deploy applications. The role requires expertise in PL/SQL and Oracle WebLogic Server."
    },
    {
        "job_title": "JUNIOR AWS & LINUX SYSTEM ADMINISTRATOR",
        "company": "Refined It Solutions And Marketing (P) Ltd",
        "url": "https://technopark.org/job-details/21995",
        "location": "Technopark",
        "closing_date": "20 Aug 2025",
        "job_description": "<h2>JUNIOR AWS &amp; LINUX SYSTEM ADMINISTRATOR</h2>\n<p>REFINED IT SOLUTIONS AND MARKETING (P) Ltd is looking for a Junior AWS &amp; Linux System Administrator to join our team. The ideal candidate should have at least 1 year of hands-on experience in managing Linux servers and working with AWS services. You will be responsible for supporting server infrastructure, ensuring system stability, and assisting in basic cloud operations.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage and monitor Linux servers (CentOS/Ubuntu)</li>\n<li>Perform routine server maintenance and updates</li>\n<li>Support AWS services such as EC2, S3, IAM, and basic networking</li>\n<li>Monitor system performance and troubleshoot issues</li>\n<li>Write basic shell scripts for automation tasks</li>\n<li>Apply security patches and ensure system security</li>\n<li>Assist in backup and disaster recovery processes</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Minimum 1 year of experience in Linux server administration</li>\n<li>Basic knowledge of AWS (EC2, S3, IAM, VPC)</li>\n<li>Familiarity with Apache, MySQL, and networking concepts</li>\n<li>Ability to write and understand shell scripts</li>\n<li>Good communication and problem-solving skills</li>\n<li>Red Hat Certification (RHCSA) is a plus</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul>\n<li>Experience with monitoring tools and basic cloud automation</li>\n<li>Knowledge of SMS platforms, SMPP, or messaging infrastructure is a bonus</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: hr@refined.co.in</li>\n<li>Website: http://www.refined.co.in</li>\n</ul>\n<p>Closing Date: 20, Aug 2025\nJob Published: 20, July 2025</p>",
        "tags": [
            "1+ Years",
            "AWS",
            "Linux",
            "Shell Scripting"
        ],
        "summary": "We seek a Junior AWS & Linux System Administrator to manage Linux servers, support AWS services, and ensure system stability. The role involves server maintenance, scripting, and basic cloud operations."
    },
    {
        "job_title": "Field Officer",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/21994",
        "location": "Technopark",
        "closing_date": "22 Jul 2025",
        "job_description": "<h2>Field Officer - Walk-In Interview</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong> is conducting a walk-in interview for the position of Field Officer.</p>\n<p><strong>Walk-In Details:</strong></p>\n<ul>\n<li><strong>Date:</strong> July 21, 2025 - July 22, 2025</li>\n<li><strong>Time:</strong> 13:00:00 to 16:00:00</li>\n<li><strong>Location:</strong> Upcommune Business Network (P) Ltd, Forth Floor, Gayatri Building, Technopark, Thiruvananthapuram, 695581</li>\n</ul>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Conduct regular field visits to monitor progress and ensure adherence to project or operational guidelines.</li>\n<li>Liaise with local authorities, vendors, clients, and community members to support smooth execution.</li>\n<li>Collect and analyze field data, document outcomes, and report findings.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Plus two or equivalent.</li>\n<li>Must possess a valid Two-Wheeler and Four-Wheeler Driving License.</li>\n<li>Willingness to travel extensively within assigned areas.</li>\n<li>Excellent verbal communication skills.</li>\n<li>Strong customer service and sales skills.</li>\n<li>Ability to handle rejection and stay positive.</li>\n<li>Experience in telecalling or sales is a plus.</li>\n</ul>\n<p><strong>Walk-In Entry Pass:</strong></p>\n<p>Candidates are required to apply for the entry pass to Technopark Campus to attend the Walk-In interview through the mobile app/web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/e-mail id. The softcopy of the entry pass can be shown on their gadgets at the Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<ul>\n<li><strong>Mobile App:</strong><ul>\n<li><a href=\"Click here to download the Mobile App for Android\">Click here to download the Mobile App for Android</a></li>\n<li><a href=\"Click here to download the Mobile App for iOS\">Click here to download the Mobile App for iOS</a></li>\n</ul>\n</li>\n<li><strong>Website URL:</strong><ul>\n<li><a href=\"vms.technopark.org\">vms.technopark.org</a></li>\n<li><a href=\"Click here for the User Manual\">Click here for the User Manual</a></li>\n</ul>\n</li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> mail@upcommune.net</li>\n<li><strong>Gate Pass Contact:</strong> +91 9074882688</li>\n</ul>\n<p><strong>Address:</strong>\nSBC 22, -2 , Thejaswini Building, Technopark, Thiruvananthapuram , 695581\nhttps://www.upcommune.net</p>",
        "tags": [
            "Entry Level",
            "Field Work",
            "Communication Skills",
            "Customer Service"
        ],
        "summary": "Upcommune Business Network is hiring a Field Officer to conduct field visits, collect data, and liaise with stakeholders. Candidates should have good communication and customer service skills."
    },
    {
        "job_title": "Tele caller",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/21993",
        "location": "Technopark",
        "closing_date": "22 Jul 2025",
        "job_description": "<h2>Upcommune Business Network - Telecaller Walk-In</h2>\n<p><strong>Date:</strong> 22 July 2025\n<strong>Time:</strong> 11:00 AM to 4:00 PM</p>\n<p><strong>Location:</strong>\nUpcommune Business Network Pvt Ltd\nForth Floor, Gayatri Building, Technopark, Thiruvananthapuram, 695581</p>\n<p><strong>Contact:</strong>\nEmail: mail@upcommune.net\nGate Pass: +91 9074882688</p>\n<p><strong>Job Description:</strong>\nWe are seeking a Telecaller to join our team. This role involves making outbound calls to customers, promoting products and services, and addressing customer inquiries. This position is <strong>only for female candidates</strong>.</p>\n<p><strong>Responsibilities:</strong>\n- Make outbound calls to customers.\n- Promote products and services using a prepared script.\n- Answer customer inquiries and address concerns.\n- Achieve sales targets and report on call activities.\n- Maintain accurate records of customer interactions.</p>\n<p><strong>Preferred Skills:</strong>\n- Plus two or equivalent.\n- Excellent verbal communication skills.\n- Strong customer service and sales skills.\n- Ability to handle rejection and stay positive.\n- Experience in telecalling or sales is a plus.</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates must apply for an entry pass to Technopark Campus via the mobile app or web browser. The entry pass will be sent to the registered mobile number/email ID. A soft copy of the entry pass can be shown at the Technopark Entrance Gate. Candidates without a smartphone can print a hard copy from the kiosks at the Reception Building near the TECHNOPARK Main Gate using the OTP received via SMS/email.</p>\n<p><strong>Mobile App:</strong>\n- <a href=\"https://www.upcommune.net\">Android App</a>\n- <a href=\"https://www.upcommune.net\">iOS App</a></p>\n<p><strong>Website URL:</strong>\nvms.technopark.org</p>\n<p><strong>User Manual:</strong>\n<a href=\"https://www.upcommune.net\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "0 Years",
            "Telecalling",
            "Communication Skills",
            "Sales"
        ],
        "summary": "Upcommune Business Network is hiring a female Telecaller to promote products, answer inquiries, and achieve sales targets. Candidates must have excellent communication and customer service skills."
    },
    {
        "job_title": "Technical Support Engineer",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/21992",
        "location": "Technopark",
        "closing_date": "23 Jul 2025",
        "job_description": "<h2>Technical Support Engineer</h2>\n<p><strong>Picky Assist Pvt Ltd (Kerala Startup Mission)</strong>\nT-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<p><strong>Closing Date:</strong> 23, July 2025\n<strong>Job Published:</strong> 19, July 2025\n<strong>Contact Email:</strong> careers@pickyassist.com</p>\n<h3>Job Summary:</h3>\n<p>We are seeking passionate engineers who are eager to learn and build a future-proof career in the no-code/low-code revolution. This role involves working closely with customers worldwide to help them implement CRM and business automation using our no-code software platform while ensuring a high level of customer satisfaction.</p>\n<p>Responsibilities include building no-code CRM modules, workflows, chatbots, automations, and connectors, as well as integrating our platform with third-party software through APIs using our visual builders. This job does not require extensive programming, as most tasks involve software development using our no/low-code module platform.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Identifying customers' requirements and onboarding customers with our no-code software.</li>\n<li>Integration with 3rd party software using our no code API &amp; Webhook builders.</li>\n<li>Troubleshooting the logical issues in the software products and educating the customers on proper usage of different features.</li>\n<li>Develop and sustain strong customer relationships to enhance satisfaction.</li>\n<li>Increase the product usage ratio by educating the customers about different possibilities and values the product can add to their business</li>\n<li>Provided technical support and guidance on software features and functionalities.</li>\n<li>Collaborate with internal teams, including sales, marketing, product development, and customer support to ensure a seamless customer experience.</li>\n<li>Minimise the Churn ratio by providing high-quality customer support and experience</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in IT, Computer Science.</li>\n<li>Strong logical reasoning skills with the attitude to get this done</li>\n<li>Basic understanding of any programming language</li>\n<li>Strong background in software project management.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to manage multiple SaaS product lines and customer segments.</li>\n<li>Should be a proactive communicator</li>\n</ul>\n<h3>Experience Required:</h3>\n<ul>\n<li>Minimum of 1 to 3 years of experience as a Customer Support preferably in Saas or Software product related organization with a thorough understanding of working with software.</li>\n</ul>\n<h3>How To Apply:</h3>\n<p>Share your resume to careers@pickyassist.com and apply through our Whatsapp chatbot by sending a message \"Careers\" to +18302680508</p>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to manage multiple SaaS product lines and customer segments.</li>\n<li>Should be a proactive communicator</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Customer Support",
            "SaaS",
            "CRM"
        ],
        "summary": "Picky Assist is looking for a Technical Support Engineer to help customers implement CRM and business automation using a no-code platform. Responsibilities include customer onboarding, troubleshooting, and collaborating with internal teams."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21991",
        "location": "Technopark",
        "closing_date": "22 Jul 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA , 695581\n<a href=\"www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<p><strong>Closing Date:</strong> 22, July 2025\n<strong>Job Published:</strong> 19, July 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing with sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<p><strong>Requirements:</strong>\n- Need Immediate Joiners\n- Work from office opportunity\n- Experience: 0-1 years required\n- Freshers can also apply\n- Male and Female Candidates preferred\n- Have fluency with Malayalam Language</p>\n<p><strong>Preferred Skills:</strong>\n- Customer interaction\n- Communication\n- Time management</p>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Communication",
            "Customer Interaction"
        ],
        "summary": "Trainonex Solutions is looking for a Telesales Executive to drive sales and build customer relationships. Immediate joiners with strong communication skills are encouraged to apply."
    },
    {
        "job_title": "Marketing Lead Generation_Internship",
        "company": "Enfin Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/21990",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Marketing Lead Generation Internship</h2>\n<p><strong>Enfin Technologies India (P) Ltd</strong>\nC 24, -2 Floor, Thejaswini, Technopark Campus, Trivandrum, Kerala. , 695581\n<a href=\"http://www.enfintechnologies.com\">http://www.enfintechnologies.com</a></p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 19, July 2025\n<strong>Contact Email:</strong> hr@enfintechnologies.com</p>\n<p><strong>Brief Description:</strong>\nThis is an internship opportunity to gain hands-on experience and develop critical customer data collection, mining, and research skills. You should be able to perform internet searches using Google search and leverage the internet to research and discover information from the web.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>You should have hands-on skills in using Microsoft Office apps such as Excel and Word.</li>\n<li>Research and collect customer accounts and contact information through Google, LinkedIn, and other resources from the web.</li>\n<li>Input, update, and maintain accurate data records in the company database/MS Excel</li>\n<li>Follow data entry procedures and protocols to ensure consistency.</li>\n<li>Verify data accuracy, quality checks, and ensure compliance with company standards.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>Any degree or diploma with good communication skills in English.</li>\n<li>Proficiency in using MS Office - Excel, Word, and LinkedIn.</li>\n</ul>\n<p><strong>Internship Details:</strong></p>\n<ul>\n<li><strong>Duration:</strong> 6 months</li>\n<li><strong>Schedule:</strong> Full-time, 9.30 AM to 6.30 PM, Monday to Saturday.</li>\n<li><strong>Stipend:</strong> Starts from Rs. 8000 / Month.</li>\n<li><strong>Work mode:</strong> Remote</li>\n<li>Immediate Joinee</li>\n</ul>\n<p>Interested candidates should submit their resume and a cover letter detailing their interest to hr@enfintechnologies.com with the Subject: Marketing Lead Generation Intern</p>",
        "tags": [
            "0 Years",
            "MS Excel",
            "LinkedIn",
            "Data Collection"
        ],
        "summary": "Enfin Technologies is offering a remote internship in marketing lead generation. The role involves customer data collection, utilizing tools like MS Office and LinkedIn, with a monthly stipend of Rs. 8000."
    },
    {
        "job_title": "Senior Front-End / UI Developer",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/21989",
        "location": "Technopark",
        "closing_date": "02 Sep 2025",
        "job_description": "<h2>Senior Front-End / UI Developer</h2>\n<p>We are seeking an experienced <strong>Senior Front-End Engineer</strong> with expertise in <strong>React.js</strong>, <strong>Next.js</strong>, and modern front-end ecosystems to design and implement scalable, secure, and high-performing UI architectures for our digital products. The ideal candidate is passionate about performance engineering, accessibility, and maintainable code, and is capable of guiding architecture decisions and mentoring cross-functional teams.</p>\n<p>You will work closely with designers, backend engineers, and product managers to create seamless and intuitive user experiences across platforms and browsers, contributing to both technical excellence and business impact.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Architect and build modular, high-performance UIs using React.js (Hooks, Context API, Suspense) and Next.js (App Router, SSR, SSG).</li>\n<li>Lead front-end application architecture with micro-frontend patterns, Web Components, and Module Federation.</li>\n<li>Implement scalable state management using tools like Redux Toolkit, Zustand, or Recoil.</li>\n<li>Integrate RESTful and GraphQL APIs using Axios, Fetch, Apollo Client, or URQL.</li>\n<li>Ensure optimal build and bundling using tools like Webpack, Vite, or Rollup.</li>\n<li>Optimize application performance using code splitting, lazy loading, tree shaking, WebP, asset optimization, and HTTP/2.</li>\n<li>Maintain security best practices: mitigate OWASP Top 10 issues (XSS, CSRF), enforce CSP, use secure cookies, validate input, and implement secure authentication flows (OAuth2, JWT, Firebase Auth).</li>\n<li>Deliver pixel-perfect, accessible, and responsive UI using WCAG 2.1 guidelines, semantic HTML, ARIA, Tailwind UI, Material UI, or ShadCn.</li>\n<li>Conduct performance audits using Lighthouse, React Profiler, and browser DevTools.</li>\n<li>Own the visual and functional QA process: build tests using Jest, React Testing Library, Cypress, Playwright, and Storybook + Chromatic for visual regression.</li>\n<li>Collaborate with DevOps to maintain CI/CD pipelines with GitHub Actions, GitLab CI, or CircleCI.</li>\n<li>Participate in and lead design reviews, documentation efforts, and sprint planning in Agile teams.</li>\n<li>Utilize AI-powered development tools like GitHub Copilot, Cursor, Cline, or custom LLM-based agents to improve development velocity and test quality.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Bachelor’s/Master’s in Computer Science, Information Technology, or equivalent.</li>\n<li>5–12 years of hands-on experience in front-end development, building production-grade React applications with Next.js.</li>\n<li>Proficient in JavaScript (ES6+), TypeScript, HTML5, CSS3/SCSS.</li>\n<li>Strong architectural understanding of component design, modularization, micro frontends, and code reuse strategies.</li>\n<li>Experience with state management tools like Redux Toolkit, Zustand, or Recoil.</li>\n<li>In-depth understanding of accessibility, cross-browser compatibility, and responsive design.</li>\n<li>Proficient in Git workflows, npm/yarn/pnpm, and modern IDEs like VSCode.</li>\n<li>Solid testing practices using unit, integration, and visual regression testing tools.</li>\n<li>Experience working in monorepos, Module Federation, or multi-team frontend architectures.</li>\n<li>Familiarity with server-side rendering, static site generation, and edge rendering with Next.js.</li>\n<li>Experience with containerized environments (Docker) for front-end dev environments.</li>\n<li>Exposure to RAG, Langchain, or other LLM-based integrations in front-end workflows.</li>\n<li>Skilled in cross-functional collaboration tools: Figma, Zeplin, Adobe XD, Jira, Confluence.</li>\n<li>Strong advocacy for performance, UX, accessibility, and clean code practices.</li>\n</ul>\n<p><strong>Professional Attributes:</strong></p>\n<ul>\n<li>A passion for clean code and scalable architecture.</li>\n<li>Strong communication and mentorship skills, with experience onboarding and upskilling developers.</li>\n<li>Ability to lead through influence and evangelize best practices in front-end engineering.</li>\n<li>Proactive in problem-solving, with a mindset of ownership and continuous improvement.</li>\n</ul>\n<p>Work Timings: 3pm - 12 am (including 1 hr break)</p>\n<p>Contact Email: careers@reizend.ai</p>",
        "tags": [
            "5+ Years",
            "React.js",
            "Next.js",
            "TypeScript"
        ],
        "summary": "Seeking a Senior Front-End Engineer to design and implement scalable UI architectures using React.js and Next.js. The role requires expertise in performance engineering and mentoring cross-functional teams."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Good Methods Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21988",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p><strong>Good Methods Software Solutions (P) Ltd - CareStack</strong></p>\n<p><strong>Location:</strong> Trivandrum (Onsite)</p>\n<p><strong>Experience:</strong> 2-8 Years</p>\n<p><strong>Contact:</strong> visakhgoommen@carestack.com</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025</p>\n<p><strong>About CareStack:</strong></p>\n<p>CareStack is building cloud platforms that modernize U.S. dental practices. They are forming a startup-mode team to enhance Revenue Cycle Management (RCM) using AI, automation, and data-driven workflows. This team will act as a tech-agnostic innovation unit focused on transforming manual RCM processes into scalable, tech-enabled solutions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design full-stack solutions for untapped RCM opportunities, deploy to production, and iterate based on feedback.</li>\n<li>Select and justify the best tools/frameworks per project; implement PoCs when needed.</li>\n<li>Build and maintain secure, scalable APIs, UIs, automations, and data pipelines.</li>\n<li>Integrate third-party systems (EHR, CRM, payment gateways, RPA bots).</li>\n<li>Uphold code quality with reviews, automated tests, CI/CD, and cloud-native best practices.</li>\n<li>Mentor junior engineers in problem-solving and tech-agnostic thinking.</li>\n<li>Collaborate with the RCM operations team to understand pain points and identify high-impact automation opportunities.</li>\n<li>Focus on measurable business outcomes with emphasis on RCM performance metrics improvement.</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Own green-field products that directly cut costs and boost revenue.</li>\n<li>Work in a lean, cross-functional squad with minimal bureaucracy.</li>\n<li>Have your voice matter; ideas and feedback directly influence product direction.</li>\n<li>Be part of transforming RCM operations into a tech-enabled, highly scalable offering.</li>\n</ul>\n<p><strong>Must-Have Skills &amp; Mindset:</strong></p>\n<ul>\n<li>2 – 8 years designing, coding, testing, and running production software end‑to‑end.</li>\n<li>Proven ability to learn new stacks fast and pick “best‑fit” tech per use case.</li>\n<li>Deep grasp of computer‑science fundamentals, distributed systems, and REST/gRPC/GraphQL API design.</li>\n<li>Solid understanding of front‑end ↔ back‑end integration patterns and real‑time communication.</li>\n<li>Hands‑on cloud (AWS / GCP / Azure) with container orchestration and observability.</li>\n<li>Strong unit/integration testing discipline; Git &amp; trunk‑based workflows.</li>\n<li>Bias for metrics‑driven decisions and rapid experimentation.</li>\n<li>Outcome-focused approach that prioritizes solving real business problems.</li>\n<li>Excellent written &amp; verbal communication with non‑technical stakeholders.</li>\n</ul>",
        "tags": [
            "2-8 Years",
            "REST/gRPC/GraphQL API",
            "AWS/GCP/Azure",
            "Full-Stack Development"
        ],
        "summary": "CareStack is seeking a Full Stack Developer to modernize dental practices using AI and automation. The role involves designing solutions, building scalable systems, and collaborating with the RCM operations team."
    },
    {
        "job_title": "NodeJS Developer",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/21987",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>NodeJS Developer</h2>\n<p><strong>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</strong>\n4th Floor, Amstor Building, Technopark, Kazhakoottam, Trivandrum, 695581</p>\n<p><strong>Contact:</strong> recruitment@ateamsoftsolutions.com, 7907410058</p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 18, July 2025</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li><strong>Job Title:</strong> Node.js Developer</li>\n<li><strong>Experience:</strong> 4–5 Years</li>\n<li><strong>Location:</strong> Technopark, Trivandrum, Kerala</li>\n<li><strong>Work Mode:</strong> Onsite</li>\n<li><strong>Joining:</strong> Within 30 Days (Immediate joiners preferred)</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable server-side applications using Node.js.</li>\n<li>Collaborate with cross-functional teams to define and implement new features.</li>\n<li>Write clean, modular, and reusable code following best practices.</li>\n<li>Ensure optimal performance and scalability of applications.</li>\n<li>Integrate APIs and third-party services.</li>\n<li>Participate in code reviews, testing, and deployment processes.</li>\n<li>Troubleshoot and resolve application issues and bugs in a timely manner.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong proficiency in JavaScript and Node.js.</li>\n<li>Experience with Express.js or similar Node.js frameworks.</li>\n<li>Good understanding of RESTful APIs, asynchronous programming, and event-driven architecture.</li>\n<li>Proficiency in working with databases such as MongoDB, MySQL, or PostgreSQL.</li>\n<li>Experience with version control tools like Git.</li>\n<li>Knowledge of authentication and authorization mechanisms (OAuth, JWT).</li>\n<li>Familiarity with CI/CD pipelines and cloud platforms is a plus.</li>\n<li>Strong debugging, problem-solving, and analytical skills.</li>\n<li>Understanding of microservices architecture and its application in designing scalable AI-driven systems.</li>\n</ul>\n<p><strong>To Apply:</strong> Send your resume to recruitment@ateamsoftsolutions.com</p>",
        "tags": [
            "4-5 Years",
            "Node.js",
            "JavaScript",
            "RESTful APIs"
        ],
        "summary": "We are seeking a skilled Node.js Developer to design and maintain scalable server-side applications. The role involves collaborating with cross-functional teams and ensuring optimal application performance."
    },
    {
        "job_title": "DevOps Engineer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/21986",
        "location": "Technopark",
        "closing_date": "23 Jul 2025",
        "job_description": "<h2>DevOps Engineer</h2>\n<p><strong>Lean Transitions Solutions (LTS)</strong> is seeking a proactive and skilled DevOps Engineer to join our IT and infrastructure team. LTS is an ISO 9001:2015 certified company, advocating Industry 4.0 with global locations including India, Germany, Poland, the United States, UAE, Jordan, and Mexico.</p>\n<p><strong>Location:</strong> Basement Floor, Periyar Building, Technopark Phase-1, Trivandrum, 695581</p>\n<p><strong>Contact:</strong> careers@ltslean.com</p>\n<p><strong>Closing Date:</strong> July 23, 2025</p>\n<h3>About the Role</h3>\n<p>As a DevOps Engineer, you will be responsible for maintaining and optimising software systems, managing CI/CD pipelines, enhancing infrastructure security, and ensuring high system availability across cloud and on-prem environments. You’ll also play a key role in automation, system monitoring, and supporting development teams.</p>\n<h3>Key Responsibilities:</h3>\n<h4>Infrastructure &amp; System Management</h4>\n<ul>\n<li>Install, configure, and maintain software, hardware, and network systems.</li>\n<li>Manage Linux, Windows, and macOS environments.</li>\n<li>Set up and maintain development environments and supporting infrastructure for web applications.</li>\n<li>Configure and manage web servers (Apache, Nginx).</li>\n<li>Configure and maintain MySQL and MongoDB databases.</li>\n</ul>\n<h4>DevOps &amp; CI/CD</h4>\n<ul>\n<li>Implement and manage CI/CD pipelines using tools like Jenkins.</li>\n<li>Maintain and optimise AWS-based and hybrid/multi-cloud infrastructure.</li>\n<li>Deploy applications using automated and standardised deployment techniques.</li>\n<li>Assist in Git repository management and version control processes.</li>\n</ul>\n<h4>Monitoring &amp; Performance</h4>\n<ul>\n<li>Monitor system performance and service uptime using tools like Uptime Kuma.</li>\n<li>Identify and troubleshoot technical issues across environments.</li>\n<li>Improve system reliability and reduce downtime.</li>\n</ul>\n<h4>Security &amp; Compliance</h4>\n<ul>\n<li>Ensure security and stability of IT infrastructure.</li>\n<li>Assist with backups, disaster recovery, and system recovery planning.</li>\n<li>Collaborate on initiatives like endpoint protection, and password management.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>3–4 years of hands-on experience in DevOps, Systems Administration, or related roles.</li>\n<li>Experience with Linux-based systems and cloud platforms (AWS preferred).</li>\n<li>Proficiency in web server management (Apache, Nginx) and backend environments (PHP, Node.js).</li>\n<li>Familiarity with database management (MySQL, MariaDB, MongoDB).</li>\n<li>Experience with Jenkins and Git-based CI/CD pipelines.</li>\n<li>Knowledge in containerisation (Docker) and infrastructure as code.</li>\n<li>Understanding of system monitoring and incident alerting.</li>\n<li>Strong problem-solving and troubleshooting skills.</li>\n<li>Excellent teamwork skills.</li>\n<li>Stay updated with industry trends and emerging tools, proactively recommending solutions that align with organisational goals.</li>\n</ul>\n<h3>Application Information</h3>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line \"DevOps Engineer\".</p>\n<p><strong>Please include the following information in the email content:</strong></p>\n<ul>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li>Current Location</li>\n<li>Willingness to work at the office</li>\n</ul>",
        "tags": [
            "3-4 Years",
            "AWS",
            "Jenkins",
            "MySQL"
        ],
        "summary": "Lean Transition Solutions is looking for a DevOps Engineer to maintain systems, manage CI/CD pipelines, and enhance security. The ideal candidate will have experience with cloud platforms and automation."
    },
    {
        "job_title": "Sales Support Executive (Female Only)",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/21985",
        "location": "Technopark",
        "closing_date": "26 Jul 2025",
        "job_description": "<h2>Sales Support Executive (Female Only)</h2>\n<p><strong>IGNOSI ENTERPRISES</strong>\nGround Floor, Tejaswini Building, Technopark, Trivandrum, 695581\nhttp://www.ignosi.in</p>\n<p><strong>Contact Information:</strong>\n*   Email: hr@ignosi.co.in\n*   Phone: 9778196774</p>\n<p><strong>Location:</strong> Trivandrum, Kazhakuttom\n<strong>Work Type:</strong> Office-Based | No Field Visits</p>\n<p>We're looking for a smart, friendly, and responsible lady staff to support our sales team. If you love talking to people, organizing things, and helping things move smoothly — we’d love to have you onboard!</p>\n<p><strong>Your Main Responsibilities:</strong></p>\n<ul>\n<li>Sales Lead Follow-Up – Calling and filter potential clients and updating follow-up status.</li>\n<li>Sales Demo Scheduling – Coordinate and support with demo planning.</li>\n<li>Meta Sales Follow-Up – Tracking and reporting demo progress and conversion.</li>\n<li>Daily Field Sale Report Follow-Up – Make sure sales data from the field team is received and updated regularly.</li>\n<li>Target: 40 demos per month / 10 sales closing (support-focused, including fresh calling)</li>\n<li>Focus Area: Jewellery Clients &amp; Offline Software Marketing</li>\n</ul>\n<p>If you’ve worked with sales targets or customer follow-ups before, that’s a big plus!</p>\n<p><strong>Preferred Skills:</strong>\n*   Prior sales-related experience</p>\n<p><strong>Salary:</strong> ₹13,000/month</p>\n<p><strong>Requirements:</strong>\n*   Only Female Candidates\n*   No field work – full-time office role</p>\n<p><strong>We Offer:</strong></p>\n<ul>\n<li>Friendly office environment</li>\n<li>Supportive team</li>\n<li>Stability &amp; growth in the software industry</li>\n<li>Clear goals, but no pressure!</li>\n</ul>\n<p><strong>How to Apply:</strong>\nSend your resume or just say hi: hr@ignosi.co.in</p>\n<p>Let’s grow together in a stress-free and positive workplace!</p>\n<p><strong>Closing Date:</strong> 26, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>",
        "tags": [
            "1+ Years",
            "Sales Support",
            "Lead Follow-Up",
            "Demo Scheduling",
            "Customer Follow-Up"
        ],
        "summary": "Ignosi Enterprises is hiring a Sales Support Executive (Female Only) to support the sales team with lead follow-up and demo scheduling. The role is office-based in Trivandrum."
    },
    {
        "job_title": "Test Engineer- Odoo",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/21984",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Odoo Test Engineer</h2>\n<p>QWY Software (P) Ltd is seeking an Odoo Test Engineer to ensure the quality and functionality of our Odoo ERP modules. The ideal candidate will be responsible for creating and executing test cases, identifying bugs, and working closely with developers and functional consultants to ensure a seamless user experience.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Test Odoo modules (Sales, CRM, Inventory, Accounting)</li>\n<li>Create and maintain test plans and test cases</li>\n<li>Perform manual and automated testing</li>\n<li>Identify, document, and track bugs</li>\n<li>Collaborate with developers and consultants for issue resolution</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 1-3 Years of hands on experience</li>\n<li>Experience with Odoo (functional or technical)</li>\n<li>Knowledge of software testing methodologies</li>\n<li>Familiarity with test tools (e.g., Selenium, Postman) is a plus</li>\n<li>Strong analytical and communication skills</li>\n</ul>\n<p>Interested candidates please share your CV at careers@qwysoft.com with the Subject Line \"Odoo Test Engineer\".</p>\n<p><strong>Contact Information:</strong></p>\n<p>QWY Software (P) Ltd\nSecond Floor, Amstor Building,\nTechnopark Phase1, Kazhakuttam,\nTrivandrum, 695581\nContact Email: careers@qwysoft.com</p>\n<p>Closing Date: 31, July 2025\nJob Published: 18, July 2025</p>",
        "tags": [
            "1-3 Years",
            "Odoo",
            "Selenium",
            "Test Cases"
        ],
        "summary": "QWY Software is looking for an Odoo Test Engineer. Responsibilities include testing Odoo modules, creating test cases, and identifying bugs to ensure quality."
    },
    {
        "job_title": "Marketing  Executives (IT)",
        "company": "Foxdale (P) Ltd",
        "url": "https://technopark.org/job-details/21983",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Marketing Executive (IT)</h2>\n<p><strong>Foxdale (P) Ltd</strong>\nModule C, 6th Floor, Bhavani, 695581\n<a href=\"http://www.foxdale.in\">http://www.foxdale.in</a></p>\n<p><strong>Contact Email:</strong> hr@foxdale.in</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a dynamic Marketing Executive (Outdoor) to promote our IT products and services, generate quality leads, and drive business growth. The ideal candidate should have strong communication skills, a good understanding of the IT industry, and the ability to plan and execute marketing strategies that deliver measurable results.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and implement marketing plans to promote IT solutions and services.</li>\n<li>Identify and generate new business leads through online/offline channels.</li>\n<li>Build and maintain relationships with potential clients, partners, and stakeholders.</li>\n<li>Coordinate with the Sales team to convert leads into opportunities.</li>\n<li>Conduct market research to identify trends and customer needs.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Marketing Plans",
            "Lead Generation",
            "IT Solutions"
        ],
        "summary": "Seeking a Marketing Executive to promote IT products, generate leads, and boost business growth. Requires strong communication and IT industry knowledge for effective marketing strategies."
    },
    {
        "job_title": "Full Stack Developer – Java | Spring Boot | React",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/21981",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Full Stack Developer – Java | Spring Boot | React</h2>\n<p>Valoriz Digital (P) Ltd is seeking a Full Stack Developer to design and build Web-based software solutions. The ideal candidate will be capable of learning and adapting to new technologies and mentoring others.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work with architects/product owners to develop technology solutions.</li>\n<li>Develop software applications leveraging state-of-the-art web technologies and frameworks.</li>\n<li>Work with a high-performing agile team using the latest tools for rapid development, continuous integration, and deployment.</li>\n<li>Ensure user experience, availability, scalability, responsiveness, and security software quality standards are achieved.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong in Web technologies (SpringBoot, ReactJS, HTML, CSS, MongoDB) with full stack development experience.</li>\n<li>Must have 2+ years of experience in software development. [2 Yrs in Springboot and React - Mandatory]</li>\n<li>Experience in software design and engineering of REST-based web services.</li>\n<li>Experience in Agile development methodologies.</li>\n<li>Experience working with source control like GIT and build tools like maven, gradle etc.</li>\n<li>Experience in the e-commerce/retail domain is an added advantage.</li>\n</ul>\n<p><strong>Contact Information:</strong>\narcha.r@valoriz.com</p>\n<p><strong>Address:</strong>\nT5, 7th Floor, Thejaswini Building, Technopark, Trivandrum, 695581</p>\n<p><strong>Website:</strong>\nhttp://www.valoriz.com</p>\n<p><strong>Closing Date:</strong> 21, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>",
        "tags": [
            "2+ Years",
            "SpringBoot",
            "ReactJS",
            "Agile"
        ],
        "summary": "Seeking a Full Stack Developer to design and build web solutions. Proficiency in SpringBoot, React, and Agile methodologies is required to succeed in this role."
    },
    {
        "job_title": "Sales Development Representative",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/21980",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Sales Development Representative</h2>\n<p><strong>Valoriz Digital (P) Ltd</strong>\nT5, 7th Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.valoriz.com\">http://www.valoriz.com</a></p>\n<p><strong>Closing Date:</strong> 21, July 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> careers@valoriz.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Understand our service offerings, eCommerce solutions, and accelerator portfolio.</li>\n<li>Generate leads through inbound and outbound efforts—LinkedIn, emails, calls—and engage decision-makers (including C-level) across target organizations.</li>\n<li>Maintain active follow-up with leads to nurture relationships and build interest.</li>\n<li>Collaborate with senior leadership to refine sales strategies, build partnerships, and drive pipeline growth.</li>\n<li>Track performance via sales reports/dashboards and work toward achieving monthly/quarterly targets.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proven track record of success as an SDR, in a B2B technology firm.</li>\n<li>2 - 3 years of experience in selling enterprise solutions to CxOs/ Heads of Department.</li>\n<li>Prior experience in lead generation through cold/ warm calling in developed markets.</li>\n<li>Should have strong interpersonal and communication skills.</li>\n<li>A bonus would be previous tech industry experience or experience in sales development in digital commerce/ eCommerce space.</li>\n<li>Experience in identifying and nurturing partnership opportunities to support business growth.</li>\n<li>Strong track record in acquiring new clients and expanding business through strategic collaborations.</li>\n<li>Female candidates preferred.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "Lead Generation",
            "B2B Technology Sales",
            "eCommerce"
        ],
        "summary": "Valoriz Digital is seeking a Sales Development Representative to generate leads and nurture client relationships. This role involves collaboration with leadership to drive pipeline growth."
    },
    {
        "job_title": "Sales Executive – Software Solutions (CALICUT, KANNUR, KAZARGOD)",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/21979",
        "location": "Technopark",
        "closing_date": "26 Jul 2025",
        "job_description": "<h2>Sales Executive – Software Solutions</h2>\n<p><strong>IGNOSI ENTERPRISES</strong>\nGround Floor, Tejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.ignosi.in\">http://www.ignosi.in</a></p>\n<p><strong>Locations:</strong> CALICUT, KANNUR, KAZARGOD (Travel involved)</p>\n<p><strong>Contact Email:</strong> hr@ignosi.co.in</p>\n<p><strong>Role:</strong> Sales Executive</p>\n<p>We're Hiring! Join Our Friendly Sales Team!</p>\n<p>Hey there! If you love talking to people, enjoy technology, and are curious to learn something new, we’d love to meet you.\nWe’re a super-friendly team looking for someone who’s:</p>\n<ul>\n<li>Good at communicating – Just be yourself and explain things clearly.</li>\n<li>Okay with a bit of travel – We visit clients and make real connections.</li>\n<li>Excited to learn – We’ll train you on everything!</li>\n<li><strong>Bonus:</strong> If you’ve done B2B sales in banking, finance, or jewelry – even better!</li>\n</ul>\n<p><strong>What You Get:</strong></p>\n<ul>\n<li><strong>Monthly Salary:</strong> ₹18,000 - 23,000 + Extra Incentives (earn more if you enjoy selling!)</li>\n<li><strong>Growth Path:</strong> You can become a Sales Manager within a year and make ₹30,000+</li>\n<li><strong>Training &amp; Support:</strong> We’ll guide you at every step – no pressure.</li>\n<li><strong>Friendly Culture:</strong> No bossy vibes here – just a good team with good goals.</li>\n</ul>\n<p>Not sure if you fit? Let’s just talk\nSend a message or your resume to: hr@ignosi.co.in\nOr call: 9778196774</p>\n<p>We believe in people, not just profiles.</p>",
        "tags": [
            "1+ Years",
            "Sales",
            "B2B Sales",
            "Communication Skills"
        ],
        "summary": "Ignosi Enterprises is hiring a Sales Executive to join their friendly team. The role involves communicating with clients and requires travel within CALICUT, KANNUR, and KAZARGOD."
    },
    {
        "job_title": "Sales Executive – Software Solutions (SOUTH TAMILNADU)",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/21977",
        "location": "Technopark",
        "closing_date": "26 Jul 2025",
        "job_description": "<h2>Sales Executive – Software Solutions (SOUTH TAMILNADU)</h2>\n<p><strong>IGNOSI ENTERPRISES</strong>\nGround Floor, Tejaswini Building, Technopark, Trivandrum , 695581\nhttp://www.ignosi.in</p>\n<p><strong>Closing Date:</strong> 26, July 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> hr@ignosi.co.in</p>\n<h3>Brief Description</h3>\n<p>We're Hiring! Join Our Friendly Sales Team!</p>\n<p><strong>Role:</strong> Sales Executive (No Experience? That’s okay!)\n<strong>Location:</strong> Tamil Nadu and Kerala (Travel involved)</p>\n<p>Hey there!\nIf you love talking to people, enjoy technology, and are curious to learn something new, we’d love to meet you.\nWe’re a super-friendly team looking for someone who’s:</p>\n<ul>\n<li>Good at communicating – Just be yourself and explain things clearly.</li>\n<li>Okay with a bit of travel – We visit clients and make real connections.</li>\n<li>Excited to learn – We’ll train you on everything!</li>\n<li>Bonus: If you’ve done B2B sales in banking, finance, or jewelry – even better!</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h3>What You Get:</h3>\n<ul>\n<li>Monthly Salary: ₹15,000 + Extra Incentives (earn more if you enjoy selling!)</li>\n<li>Growth Path: You can become a Sales Manager within a year and make ₹25,000+</li>\n<li>Training &amp; Support: We’ll guide you at every step – no pressure.</li>\n<li>Friendly Culture: No bossy vibes here – just a good team with good goals.</li>\n</ul>\n<p>Not sure if you fit? Let’s just talk</p>\n<p>Send a message or your resume to: hr@ignosi.co.in\nOr call: 9778196774</p>\n<p>We believe in people, not just profiles.</p>",
        "tags": [
            "Entry Level",
            "Sales",
            "B2B Sales",
            "Communication Skills"
        ],
        "summary": "Ignosi Enterprises is hiring a Sales Executive for software solutions, with no prior experience required. The role involves travel in Tamil Nadu and Kerala and offers training and growth."
    },
    {
        "job_title": "Underwriter - Insurance",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/21976",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Underwriter - Insurance</h2>\n<p><strong>PromptTech Global (P) Ltd</strong>\nModule No 315, Nila Building, Technopark Campus, 695581\n<a href=\"https://prompttechsolutions.com\">https://prompttechsolutions.com</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> hr@prompttechglobal.com</p>\n<p><strong>Brief Description</strong>\nWe are looking for a knowledgeable and detail-oriented General Insurance Underwriter to assess risks and determine appropriate insurance coverage, terms, and premiums. The ideal candidate will have a good understanding of general insurance products (motor, property, health, liability, etc.) and underwriting principles.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Evaluate and assess risks for general insurance proposals.</li>\n<li>Analyze application forms, supporting documents, previous claims history, and creditworthiness of clients.</li>\n<li>Determine coverage terms, premium amounts, policy conditions, and exclusions.</li>\n<li>Communicate with agents, brokers, or direct clients to obtain additional information if required.</li>\n<li>Ensure adherence to underwriting guidelines, company policies, and regulatory compliance.</li>\n<li>Collaborate with other departments such as claims and sales to provide appropriate insurance solutions.</li>\n<li>Maintain up-to-date knowledge of insurance products, market trends, and competitor offerings.</li>\n<li>Monitor portfolio performance, analyze risk exposure, and recommend pricing or product adjustments.</li>\n<li>Assist in developing and improving underwriting processes and systems.</li>\n<li>Handle renewal underwriting and portfolio analysis.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Bachelor’s degree in Insurance, Business, Finance, or a related field.</li>\n<li>1-2 years of experience in general insurance underwriting.</li>\n<li>Sound knowledge of underwriting principles, insurance products, and risk assessment.</li>\n<li>Strong analytical and decision-making skills.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Attention to detail and high level of accuracy.</li>\n<li>Proficiency in MS Office and insurance-related software platforms</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Underwriting",
            "Risk Assessment",
            "Insurance Products"
        ],
        "summary": "PromptTech Global is seeking a General Insurance Underwriter to evaluate risks and determine coverage. The role involves analyzing applications, setting terms, and ensuring compliance."
    },
    {
        "job_title": "Content Writer",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/21975",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Content Writer</h2>\n<p><strong>PromptTech Global (P) Ltd</strong>\nModule No 315,\nNila Building,\nTechnopark Campus, 695581\n<a href=\"https://prompttechsolutions.com\">https://prompttechsolutions.com</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> hr@prompttechglobal.com</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a creative and detail-oriented Content Writer to produce high-quality, engaging, and SEO-friendly content across various digital platforms. The ideal candidate will have strong research skills, excellent writing abilities, and the capacity to adapt their tone and style to different audiences and formats.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Write and edit blog posts, articles, website content, product descriptions, newsletters, case studies, and social media content.</li>\n<li>Research industry-related topics and stay up to date on trends.</li>\n<li>Collaborate with SEO specialists to optimize content for search engines.</li>\n<li>Ensure content aligns with brand voice, style, and tone guidelines.</li>\n<li>Work closely with the marketing and design teams to develop content strategies.</li>\n<li>Proofread and edit content before publication.</li>\n<li>Meet deadlines and manage multiple writing projects simultaneously.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in English, Journalism, Communications, Marketing, or a related field.</li>\n<li>Proven experience as a content writer, copywriter, or similar role.</li>\n<li>Excellent writing, editing, and proofreading skills.</li>\n<li>Familiarity with SEO best practices and keyword research tools.</li>\n<li>Proficiency with content management systems.</li>\n<li>Ability to write in different tones and for varied target audiences.</li>\n<li>Strong organizational and time-management skills.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "SEO",
            "Content Management Systems",
            "Content Writing"
        ],
        "summary": "Seeking a Content Writer to create engaging, SEO-friendly content across digital platforms. The role involves research, collaboration, and adapting to various styles and audiences."
    },
    {
        "job_title": "Content Creator",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/21973",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Content Creator</h2>\n<p><strong>PromptTech Global (P) Ltd</strong>\nModule No 315, Nila Building,\nTechnopark Campus , 695581\n<a href=\"https://prompttechsolutions.com\">https://prompttechsolutions.com</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> hr@prompttechglobal.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are looking for a creative and detail-oriented Content Creator to develop engaging and high-quality content across digital platforms. You will be responsible for crafting compelling blog posts, social media content, videos, graphics, and other forms of media that align with our brand voice and goals.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Generating engaging and relevant content across various digital platforms.</li>\n<li>Creating written, visual, and multimedia content to attract and retain a target audience.</li>\n<li>Researching industry-related topics.</li>\n<li>Generating ideas for new content.</li>\n<li>Producing and editing content.</li>\n<li>Collaborating with other team members.</li>\n<li>Optimizing content for search engines and user experience.</li>\n<li>Staying updated on industry trends and best practices.</li>\n<li>Analyzing content performance to make data-driven decisions.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Bachelor's degree in Marketing, Communications, Journalism, or related field (preferred)</li>\n<li>Proven experience as a content creator, copywriter, or similar role</li>\n<li>Proficiency in content creation tools (e.g., Canva, Adobe Creative Suite, CapCut, etc.)</li>\n<li>Strong writing, editing, and storytelling skills.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Content Creation",
            "Adobe Creative Suite",
            "Copywriting"
        ],
        "summary": "PromptTech Global is seeking a Content Creator to develop engaging content across digital platforms. Responsibilities include creating multimedia content, researching topics, and optimizing content for search engines."
    },
    {
        "job_title": "Technical Project Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21972",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Technical Project Manager</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Technical Project Manager to lead the end-to-end execution of custom application development and integration projects, primarily built on .NET stacks with modern client frameworks and integration platforms.</p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>\n<h3>Brief Description</h3>\n<p>The ideal candidate will have a strong technical foundation, combined with project delivery expertise, capable of driving complex, cross-functional initiatives from discovery through production rollout. This role requires hands-on experience across the full software/product development lifecycle, including planning, estimation, design, development, testing, and release, while working closely with engineering, product, and client stakeholders.</p>\n<h3>Job Description</h3>\n<ul>\n<li>Manage end-to-end delivery of custom software development and integration projects using Java, .NET, and related technologies.</li>\n<li>Create and maintain project plans, define timelines, identify dependencies, and track progress.</li>\n<li>Coordinate with cross-functional teams including developers, QA, UI/UX, and DevOps to ensure smooth execution.</li>\n<li>Oversee all stages of the SDLC: requirements finalization, development, integration, testing (unit, system, UAT, NFR), and deployment.</li>\n<li>Work closely with architects and leads to ensure alignment with technical direction and design.</li>\n<li>Identify and manage risks, scope changes, and schedule adjustments proactively.</li>\n<li>Serve as the primary point of contact for clients and stakeholders, providing regular updates and resolving issues.</li>\n<li>Ensure quality and timely delivery through effective team coordination and clear communication.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Technical &amp; Delivery Expertise</strong>\n- 13+ years of overall IT experience, with 4–6 years of Technical Project Management experience.\n- Strong understanding of custom application development on Java/.NET stacks.\n- Experience managing:\n    - Backend/API development\n    - Integration using tools like Apache Camel, IBM Integration Stack\n    - Database interactions (Oracle, SQL Server)\n    - Client-side development using React/Angular\n    - Deployment on cloud platforms (AWS, Azure)\n- Familiarity with Microservices architecture, CI/CD pipelines, and DevOps practices.</p>\n<p><strong>Project Management</strong>\n- Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.\n- Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.\n- Tools: Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</p>\n<p><strong>Secondary Skills</strong>\n- Experience managing globally distributed teams.\n- Strong understanding of enterprise-level integrations and technology ecosystems.</p>\n<p><strong>Soft Skills</strong>\n- Excellent communication and stakeholder engagement capabilities.\n- Strong leadership, problem-solving, and organizational skills.\n- Ability to articulate technical topics to both technical and non-technical audiences.</p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not ask for fees for job opportunities. Contact careers@reflectionsinfos.com for clarifications.</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Project Management",
            "Stakeholder Engagement"
        ],
        "summary": "Reflections Info Systems is hiring a Technical Project Manager with 13+ years of experience. Role involves managing custom software development and leading cross-functional teams."
    },
    {
        "job_title": "Senior Database Administrator",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21971",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Senior Database Administrator</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Senior Database Administrator to oversee the management, maintenance, and optimization of our databases. The ideal candidate will work on strategic initiatives to align our database infrastructure with long-term business goals and ensure adherence to best practices in database management.</p>\n<p><strong>Location:</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581</p>\n<p><strong>Website:</strong>\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>\n<h3>Main Duties/Responsibilities:</h3>\n<ul>\n<li>Optimize database queries for fast and efficient data retrieval.</li>\n<li>Design and implement effective indexing strategies.</li>\n<li>Monitor and profile slow queries, recommending best practices for rewriting.</li>\n<li>Continuously analyze execution plans for SQL queries.</li>\n<li>Schedule and execute regular database maintenance tasks (backups, consistency checks, index rebuilding).</li>\n<li>Implement automated monitoring systems to track database performance and availability.</li>\n<li>Diagnose and resolve database issues proactively.</li>\n<li>Implement and manage database clustering, replication, and failover strategies for high availability.</li>\n<li>Monitor resource consumption and plan for growth to ensure effective scaling.</li>\n<li>Analyze and optimize resource usage to reduce operational costs.</li>\n<li>Ensure adherence to database licensing models and identify cost-reduction opportunities.</li>\n<li>Use cost analysis tools to monitor and optimize cloud database spend.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>5-7 years of experience in Microsoft SQL Server administration</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience in MySQL, PostgreSQL, and Oracle database administration.</li>\n<li>Exposure to Data Lake, Hadoop, and Azure technologies</li>\n<li>Exposure to DevOps or ITIL</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in computer science, software engineering, or a related field.</li>\n<li>Microsoft SQL certifications (MTA Database, MCSA: SQL Server, MCSE: Data Management and Analytics) are an advantage.</li>\n</ul>\n<h3>Behavioral Competencies:</h3>\n<ul>\n<li>Communication</li>\n<li>Teamwork</li>\n<li>Digital Mindset</li>\n<li>Operational Excellence</li>\n<li>Analytical Ability</li>\n<li>Customer Centricity</li>\n<li>Business and Market Acumen</li>\n<li>Empathy</li>\n<li>Growth Mindset</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers. Contact careers@reflectionsinfos.com for any clarification/alerts.</p>",
        "tags": [
            "5+ Years",
            "SQL Server",
            "Database Administration",
            "Database Management"
        ],
        "summary": "Reflections Info Systems is hiring a Senior Database Administrator to manage and optimize databases. Responsibilities include performance tuning, maintenance, and ensuring high availability."
    },
    {
        "job_title": "Mid Data Scientist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21970",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Mid Data Scientist</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Mid Data Scientist with 5+ years of experience to join our team. You will lead the development and deployment of machine learning models to address key business challenges. The ideal candidate will have a strong background in statistical modeling, machine learning, deep learning, and generative AI.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the development and deployment of machine learning/deep learning models to address key business challenges.</li>\n<li>Apply statistical modeling, data preprocessing, feature engineering, machine learning, and deep learning techniques to build and improve models.</li>\n<li>Have expertise in at least two of the following areas: computer vision, predictive analytics, natural language processing, time series analysis, recommendation systems.</li>\n<li>Expertise in GenAI models is a must.</li>\n<li>Design, implement, and optimize data pipelines for model training and deployment.</li>\n<li>Experience with any one of the model serving frameworks (e.g., TensorFlow Serving, TorchServe, KServe, or similar).</li>\n<li>Design and implement APIs for model serving and integration with other systems.</li>\n<li>Collaborate with cross-functional teams to define project requirements, develop solutions, and communicate results.</li>\n<li>Mentor junior data scientists, providing guidance on technical skills and project execution.</li>\n<li>Stay up-to-date with the latest advancements in data science and machine learning, particularly in generative AI, and evaluate their potential applications.</li>\n<li>Communicate complex technical concepts and analytical findings to both technical and non-technical audiences.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Strong knowledge of statistical modeling, machine learning, deep learning and GenAI.</li>\n<li>Proficiency in Python and experience optimizing code for performance.</li>\n<li>Experience with data preprocessing, feature engineering, data visualization and hyperparameter tuning.</li>\n<li>Solid understanding of database concepts and experience working with large datasets.</li>\n<li>Experience deploying and scaling machine learning models in a production environment.</li>\n<li>Familiarity with machine learning operations (MLOps) and related tools.</li>\n<li>Good understanding of Generative AI concepts and LLM finetuning.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Bachelor's or Master's degree in a quantitative field such as statistics, mathematics, computer science, or a related area.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Python</li>\n<li>Data Science concepts</li>\n<li>Generative AI</li>\n<li>Pandas, NumPy, Matplotlib</li>\n<li>Artificial Intelligence</li>\n<li>Statistical Modeling</li>\n<li>Machine Learning, Natural Language Processing (NLP), Deep Learning</li>\n<li>Model Serving Frameworks (e.g., TensorFlow Serving, TorchServe)</li>\n<li>MLOps(e.g; MLflow, Tensorboard, Kubeflow etc)</li>\n<li>Computer Vision</li>\n<li>Predictive Analytics</li>\n<li>Time Series Analysis</li>\n<li>Anomaly Detection</li>\n<li>Recommendation Systems</li>\n<li>SQL</li>\n<li>Proficent in any of Cloud Computing Platforms (e.g., AWS, Azure, GCP)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>\n<p><strong>Company Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Note:</strong> Reflections Info Systems never seeks payment for jobs. Contact careers@reflectionsinfos.com for any clarification.</p>",
        "tags": [
            "5+ Years",
            "Generative AI",
            "Python",
            "Machine Learning"
        ],
        "summary": "Reflections Info Systems is hiring a Mid Data Scientist to lead ML model development. The role requires expertise in machine learning, deep learning, and generative AI."
    },
    {
        "job_title": "Software Engineer – Full Stack (Geospatial)",
        "company": "Ecesis Care (P) Ltd",
        "url": "https://technopark.org/job-details/21969",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Software Engineer – Full Stack (Geospatial)</h2>\n<p><strong>ECESIS CARE (P) Ltd</strong>\n4th FLOOR, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA , 695581\n<a href=\"https://www.ecesistech.com\">https://www.ecesistech.com</a></p>\n<p><strong>Contact Email:</strong> Amrithas@ecesistech.com</p>\n<p><strong>Closing Date:</strong> 30, Aug 2025</p>\n<p><strong>Job Published:</strong> 18, July 2025</p>\n<h3>About Us:</h3>\n<p>At ECESIS, we have built a strong reputation over the years as a trusted partner in management consulting and talent acquisition, with a specialized focus on the advanced manufacturing sector. Our success is driven by our ability to consistently deliver world-class, high-quality talent, particularly in the areas of precision engineering, assembly line operations, and other skilled manpower across diverse industrial domains. Among our esteemed clients is a listed Japanese company that is set to begin its operations in Technopark, Thiruvananthapuram, further reinforcing our standing as a premier recruitment partner in the region.</p>\n<h3>Summary:</h3>\n<p>We are seeking a highly skilled and motivated Full Stack Software Engineer to join our dynamic multinational team, specializing in the Geospatial domain (Location-Based Services - LBS, Geographic Information Systems - GIS). This role focuses on the development and enhancement of sophisticated geospatial platforms and applications. The ideal candidate will possess strong expertise in a range of technologies including Java, Springboot, Python, Vue.js, and AWS cloud services, coupled with a passion for building high-quality, scalable, and impactful software solutions that leverage geographic data and spatial analysis.</p>\n<p><strong>Location:</strong> Trivandrum, Kerala, India</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Experience:</strong> 1-5 Years</p>\n<p><strong>Educational Qualification:</strong> Bachelor's degree in Computer Science/Electronics/Electrical Engineering</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, test, deploy, and maintain robust and scalable web applications and services for geospatial data processing, visualization, and analysis, utilizing Vue.js for front-end and Java (with Springboot), Python for back-end development.</li>\n<li>Collaborate effectively with cross-functional, multinational teams including product managers, GIS analysts, data scientists, and other engineers to deliver high-quality geospatial software solutions.</li>\n<li>Develop and integrate user-facing mapping interfaces and geospatial tools with server- side logic, ensuring seamless performance and intuitive user experience.</li>\n<li>Build reusable components and front-end libraries for geospatial applications (Vue.js).</li>\n<li>Develop and maintain efficient, reusable, and reliable code in Java, Python for geospatial algorithms, data processing pipelines, and API development.</li>\n<li>Ensure the technical feasibility of UI/UX designs for geospatial applications, providing constructive feedback on map interactions and data display.</li>\n<li>Optimize applications for maximum speed, scalability, and responsiveness, particularly when handling large geospatial datasets.</li>\n<li>Implement robust security and data protection measures, considering the sensitivity of location data.</li>\n<li>Design, manage, and optimize AWS cloud infrastructure for hosting and scaling geospatial applications and services (e.g., using EC2, S3 for raster/vector tiles, RDS with PostGIS, Lambda for geoprocessing tasks).</li>\n<li>Work with various geospatial data formats (e.g., GeoJSON, Shapefile, KML, GeoTIFF) and database systems (e.g., PostgreSQL/PostGIS).</li>\n<li>Participate actively in code reviews to maintain code quality, share knowledge, and foster a collaborative development environment.</li>\n<li>Troubleshoot, debug, and upgrade existing geospatial software, ensuring platform stability and performance.</li>\n<li>Contribute to all phases of the software development lifecycle, from concept and design through testing and deployment on cloud platforms like AWS.</li>\n<li>Stay updated with emerging technologies in GIS, LBS, new AWS services relevant to geospatial data, and industry best practices to drive innovation.</li>\n</ul>\n<h3>Preferred Skills &amp; Mandatory Skills:</h3>\n<ul>\n<li>Proven experience as a Software Engineer with a focus on geospatial applications.</li>\n<li>Experience with front-end frameworks like Vue.js and its core principles.</li>\n<li>Strong proficiency in Java and experience with the Springboot framework.</li>\n<li>Strong skills in Python, particularly with libraries used in geospatial analysis and data manipulation (e.g., GeoPandas, Shapely, Rasterio).</li>\n<li>Solid understanding of object-oriented programming principles.</li>\n<li>Experience with front-end technologies such as HTML5, CSS3, and responsive design.</li>\n<li>Familiarity with RESTful APIs and web services, including OGC standards (WMS, WFS, WPS).</li>\n<li>Experience with database technologies, especially PostgreSQL with PostGIS extension.</li>\n<li>Proficient understanding of code versioning tools, such as Git.</li>\n<li>Solid experience with cloud platforms, particularly AWS (including services like EC2, S3, RDS, Lambda, API Gateway, Location Service).</li>\n<li>Experience with GIS tools and libraries (e.g., QGIS, ArcGIS APIs, GeoServer, MapServer, Leaflet, OpenLayers, Mapbox GL JS).</li>\n<li>Understanding of core GIS concepts, map projections, coordinate systems, and spatial analysis techniques.</li>\n</ul>\n<h3>Additional Skills:</h3>\n<ul>\n<li>Experience with other front-end frameworks like React.js.</li>\n<li>Familiarity with other cloud platforms (e.g., Azure, Google Cloud) and their geospatial offerings.</li>\n<li>Experience with Big Data technologies for geospatial data (e.g., Spark, Hadoop).</li>\n<li>Knowledge of mobile development (iOS/Android) for LBS applications.</li>\n<li>Experience with containerization technologies like Docker and orchestration tools like Kubernetes.</li>\n<li>Understanding of CI/CD pipelines and associated tools (e.g., Jenkins, GitLab CI).</li>\n<li>Experience with 3D GIS and visualization.</li>\n</ul>\n<h3>Behavioral Skills:</h3>\n<ul>\n<li>Leadership Potential</li>\n<li>Communication Excellence</li>\n<li>Client Relationship Management</li>\n<li>Problem-Solving and Analytical Thinking</li>\n<li>Adaptability and Flexibility</li>\n<li>Collaboration and Teamwork</li>\n<li>Ownership and Accountability</li>\n<li>Proactiveness and Initiative</li>\n<li>Professionalism and Integrity</li>\n<li>Time Management and Organization</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates can send their updated resume to Amrithas@ecesistech.com with the subject line: \"Application for Software Engineer – Full Stack (Geospatial)\".</p>",
        "tags": [
            "1-5 Years",
            "Geospatial",
            "Java",
            "Vue.js"
        ],
        "summary": "Seeking a Full Stack Software Engineer specializing in Geospatial technologies. The role involves developing geospatial platforms using Java, Springboot, Python, Vue.js, and AWS."
    },
    {
        "job_title": "Senior Embedded Software Engineer - Camera (Android)",
        "company": "Ecesis Care (P) Ltd",
        "url": "https://technopark.org/job-details/21968",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Senior Embedded Software Engineer - Camera (Android)</h2>\n<p><strong>ECESIS CARE (P) Ltd</strong>\n4th FLOOR, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS,\nKARIYAVATTOM, TRIVANDRUM, KERALA , 695581\nhttps://www.ecesistech.com</p>\n<p><strong>Closing Date:</strong> 30, Aug 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> Amrithas@ecesistech.com</p>\n<h3>About Us:</h3>\n<p>ECESIS has a strong reputation as a trusted partner in management consulting and talent acquisition, with a focus on the advanced manufacturing sector. They deliver world-class talent in precision engineering, assembly line operations, and other skilled manpower across diverse industrial domains. One of their esteemed clients is a listed Japanese company starting operations in Technopark, Thiruvananthapuram.</p>\n<h3>Summary:</h3>\n<p>Seeking a skilled Embedded Software Engineer to focus on developing and optimizing camera functionality for embedded devices running on Android. The role involves working with Quectel smart modules, developing and integrating camera drivers, implementing image processing pipelines, and ensuring high-quality camera performance.</p>\n<p><strong>Location:</strong> Bangalore, Karanataka, India/ Trivandrum, Kerala, India\n<strong>Employment Type:</strong> Full-time\n<strong>Experience:</strong> 1-5 Years\n<strong>Educational Qualification:</strong> Bachelor's or Master's degree in Computer Science/Electronics/Electrical Engineering or a related Engineering field.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and integrate kernel and user space camera drivers for components like image sensors, autofocus (AF) actuators, EEPROMs, and LED flashes.</li>\n<li>Configure camera-related hardware interfaces, manage GPIOs for control, and set up power supplies and power-on/off sequences within the kernel device tree.</li>\n<li>Implement and configure user space driver parameters, defining sensor output formats (like RAW or YUV), connection modes (such as MIPI CSI), resolutions, frame rates, and MIPI CSI lane configurations.</li>\n<li>Integrate and configure camera tuning data, including chromatix code for Bayer sensors or handle specific configurations required for YUV sensors.</li>\n<li>Troubleshoot and debug camera bring-up failures, image quality issues, and performance bottlenecks by analyzing kernel logs and system behavior.</li>\n<li>Work on the Android Board Support Package (BSP), focusing on the Camera Hardware Abstraction Layer (HAL) to provide a consistent programming interface for applications.</li>\n<li>Utilize standard Android SDK Camera APIs for developing camera-based applications.</li>\n<li>Collaborate with hardware engineers during the component selection phase (image sensors, lenses, processors, etc.) and contribute to the overall embedded camera system design.</li>\n<li>Perform camera tuning processes to fine-tune hardware and software parameters, achieving optimal performance and image quality by adjusting settings like Autofocus (AF), Auto Exposure (AE), and Auto White Balance (AWB).</li>\n<li>Explore and integrate AI/ML algorithms for advanced vision functionalities such as object detection, facial recognition, or predictive analytics.</li>\n<li>Ensure thermal management considerations are adequately addressed in software design to maintain system efficiency and reliability.</li>\n<li>Implement and execute effective testing procedures under various lighting conditions and scenarios to ensure product reliability and consistent performance.</li>\n<li>Leverage Hardware Abstraction Layers (HALs) to enhance the flexibility, scalability, and future-proofing of camera designs.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Mandatory Skills:</strong></p>\n<ul>\n<li>Proven experience in embedded software development, with a strong focus on camera systems and Android platforms.</li>\n<li>Proficiency in C/C++ programming.</li>\n<li>Experience with Android BSP and HAL development, specifically the camera HAL.</li>\n<li>Familiarity with camera driver development models in both the kernel and user space on Linux/Android systems.</li>\n<li>Hands-on experience working with camera interfaces such as MIPI CSI.</li>\n<li>Practical experience in bringing up and configuring camera sensors, including understanding I2C communication, power sequencing, and timing.</li>\n<li>Experience in debugging complex embedded camera systems, including log analysis.</li>\n</ul>\n<p><strong>Additional Skills:</strong></p>\n<ul>\n<li>Experience working with Qualcomm multimedia and camera frameworks is highly desirable.</li>\n<li>Knowledge of image processing concepts and algorithms, including 3A algorithms (AF, AE, AWB), noise reduction, and color correction.</li>\n<li>Experience with specific Quectel smart module series (e.g., SC600Y/T, SC200E/V, SA800U, SG865W).</li>\n<li>Experience working with Quectel smart modules and Qualcomm processors is a significant advantage.</li>\n<li>Understanding of performance optimization techniques for real-time image processing and video streaming.</li>\n<li>Experience integrating and optimizing AI/ML algorithms within embedded vision systems.</li>\n<li>Knowledge of relevant communication protocols for camera systems.</li>\n<li>Experience with camera tuning tools, labs, and methodologies.</li>\n<li>Contribution to open-source projects like LineageOS or Google AOSP.</li>\n</ul>\n<h3>Behavioral Skills:</h3>\n<ul>\n<li>Leadership Potential</li>\n<li>Communication Excellence</li>\n<li>Client Relationship Management</li>\n<li>Problem-Solving and Analytical Thinking</li>\n<li>Adaptability and Flexibility</li>\n<li>Collaboration and Teamwork</li>\n<li>Ownership and Accountability</li>\n<li>Proactiveness and Initiative</li>\n<li>Professionalism and Integrity</li>\n<li>Time Management and Organization</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates can send their updated resume to Amrithas@ecesistech.com with the subject line: \"Application for Senior Embedded Software Engineer\".</p>",
        "tags": [
            "1-5 Years",
            "Android",
            "C/C++",
            "MIPI CSI"
        ],
        "summary": "Seeking a Senior Embedded Software Engineer to develop camera functionality on Android using Quectel modules. The role involves camera driver development, image processing, and optimization."
    },
    {
        "job_title": "Software Engineer - Java & C#/.NET",
        "company": "Ecesis Care (P) Ltd",
        "url": "https://technopark.org/job-details/21967",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Software Engineer - Java &amp; C#/.NET</h2>\n<p><strong>ECESIS CARE (P) Ltd</strong>\n4th FLOOR, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS,\nKARIYAVATTOM, TRIVANDRUM, KERALA , 695581\nhttps://www.ecesistech.com</p>\n<p><strong>About Us:</strong>\nAt ECESIS, we have built a strong reputation over the years as a trusted partner in management consulting and talent acquisition, with a specialized focus on the advanced manufacturing sector. Our success is driven by our ability to consistently deliver world-class, high-quality talent, particularly in the areas of precision engineering, assembly line operations, and other skilled manpower across diverse industrial domains. Among our esteemed clients is a listed Japanese company that is set to begin its operations in Technopark, Thiruvananthapuram.</p>\n<p><strong>Summary:</strong>\nWe are seeking a versatile and skilled Software Engineer to join our dynamic multinational team. This role requires a developer with a strong foundation in both backend and desktop application development.</p>\n<p><strong>Location:</strong> Kerala</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Experience:</strong> 1-3 Years</p>\n<p><strong>Educational Qualification:</strong> Bachelor's or Master's degree in Computer Science, Engineering, or a related field.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, test, deploy, and maintain high-quality, scalable backend services and APIs using Java and Spring Boot.</li>\n<li>Develop, enhance, and maintain Windows desktop applications using C# .NET and WPF.</li>\n<li>Collaborate effectively with cross-functional, multinational teams including product managers, designers, and other engineers to deliver comprehensive software solutions.</li>\n<li>Create and maintain user interfaces for web and desktop applications using JavaScript, HTML, and CSS.</li>\n<li>Write clean, efficient, reusable, and reliable code in both Java and C#.</li>\n<li>Participate in the entire application lifecycle, focusing on coding, debugging, and performance tuning.</li>\n<li>Integrate data storage solutions, including relational and NoSQL databases.</li>\n<li>Ensure the technical feasibility of UI/UX designs and provide constructive feedback.</li>\n<li>Implement robust security and data protection measures across backend and desktop applications.</li>\n<li>Participate actively in code reviews to maintain code quality, share knowledge, and foster a collaborative development environment.</li>\n<li>Troubleshoot, debug, and upgrade existing software, ensuring platform stability and performance.</li>\n<li>Contribute to all phases of the software development lifecycle, from concept and design through to testing and deployment.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<p><strong>Mandatory Technical Skills, Experience:</strong></p>\n<ul>\n<li>Approximately 3 years of professional experience in backend development using Java and the Spring framework (Spring Boot, Spring MVC).</li>\n<li>Approximately 2 years of hands-on experience in desktop application development using C# .NET, with a strong focus on Windows Presentation Foundation (WPF).</li>\n<li>Solid proficiency in front-end technologies: JavaScript, CSS3, and HTML5.</li>\n<li>Strong understanding of object-oriented programming (OOP) principles.</li>\n<li>Experience building and consuming RESTful APIs.</li>\n<li>Experience with database technologies, including SQL (e.g., PostgreSQL, MySQL, SQL Server) and an understanding of ORM frameworks (e.g., Hibernate, Entity Framework).</li>\n<li>Proficient understanding of code versioning tools, such as Git.</li>\n<li>Strong analytical and problem-solving skills with the ability to work independently and in a team.</li>\n<li>Understanding of agile development methodologies.</li>\n</ul>\n<p><strong>Additional (Nice to have) Skills:</strong></p>\n<ul>\n<li>Experience with modern JavaScript frameworks (e.g., Vue.js, React, Angular).</li>\n<li>Experience with cloud platforms (e.g., AWS, Azure, Google Cloud).</li>\n<li>Knowledge of other .NET frameworks like ASP.NET for web development.</li>\n<li>Experience with containerization technologies like Docker and orchestration tools like Kubernetes.</li>\n<li>Familiarity with CI/CD pipelines and associated tools (e.g., Jenkins, GitLab CI, Azure DevOps).</li>\n<li>Experience with message queuing systems (e.g., RabbitMQ, Kafka).</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li><strong>Leadership Potential:</strong> Demonstrated ability or strong potential to guide and support a small team.</li>\n<li><strong>Communication Excellence:</strong> Exceptional verbal and written communication skills.</li>\n<li><strong>Client Relationship Management:</strong> Ability to build and maintain positive relationships with clients.</li>\n<li><strong>Problem-Solving and Analytical Thinking:</strong> Strong analytical and problem-solving skills.</li>\n<li><strong>Adaptability and Flexibility:</strong> Ability to adapt to changing project requirements.</li>\n<li><strong>Collaboration and Teamwork:</strong> Proven ability to work effectively within a multinational team.</li>\n<li><strong>Ownership and Accountability:</strong> Takes ownership of assigned tasks and responsibilities.</li>\n<li><strong>Proactiveness and Initiative:</strong> Demonstrates a proactive approach to work.</li>\n<li><strong>Professionalism and Integrity:</strong> Maintains a high level of professionalism.</li>\n<li><strong>Time Management and Organization:</strong> Excellent time management and organizational skills.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Comprehensive Employee Benefits</li>\n<li>Health &amp; Wellness (Life and health insurance)</li>\n<li>Enrollment Option for National Pension Scheme</li>\n<li>Flexible Work Arrangements when in need</li>\n<li>Generous Leave Policy</li>\n<li>Team Off-sites &amp; Social Events</li>\n<li>Performance Bonuses</li>\n</ul>\n<p>In addition to a competitive and attractive pay &amp; benefits packages, we provide career development that aligns with the strategic objectives and the employee needs.</p>\n<p><strong>How to Apply:</strong> Interested candidates can send their updated resume to Amrithas@ecesistech.com with the subject line: \"Application for Software Engineer - Java &amp; C#/.NET\".</p>\n<p><strong>Closing Date:</strong> 30, Aug 2025</p>\n<p><strong>Job Published:</strong> 18, July 2025</p>",
        "tags": [
            "1-3 Years",
            "Java",
            "C# .NET",
            "Spring Framework"
        ],
        "summary": "Seeking a Software Engineer proficient in Java and C#/.NET for backend and desktop applications. Role involves collaboration, full lifecycle participation and problem-solving in a multinational team."
    },
    {
        "job_title": "SAP BW Technical Consultant (with Data migration Experience)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21966",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>SAP BW Technical Consultant (with Data Migration Experience)</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Senior SAP BW Technical Consultant to lead and execute a complex data migration project from SAP BW to Snowflake for a global headwear and retail business.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> July 25, 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead and execute a complex data migration project from SAP BW to Snowflake.</li>\n<li>Evaluate the current SAP BW HANA system capabilities to identify changes and determine the impact to business.</li>\n<li>Develop technical specifications/detailed design for BW HANA Technical Development of Data Modeling, HANA Calculation Views in Control Reports.</li>\n<li>Develop backend Bex Queries, Composite Providers in SAP BW HANA.</li>\n<li>Design &amp; develop frontend visualization tools and dashboards using Business Objects WEBI, SAP Lumira/SAP Analytics on Cloud.</li>\n<li>Develop SAP HANA data model using ADSO, Attribute View, Analytic View, and Calculation View.</li>\n<li>Develop and enhance BW objects such as InfoObjects, InfoCubes, Insources/Data Sources, Master Data, Transformations, Update Rules, DSO, Extractors, Infosets, Aggregates, Process Chains, DTPs, User Exits, BADI and HANA objects like Schemas, Calculated, Analytical or Scripted Views using HANA Modeller.</li>\n<li>Lead the solution design, development, and implementation of SAP BW HANA &amp; Cloud solutions.</li>\n<li>Lead SAP HANA data modeling efforts and provide hands-on technical expertise on overall architecture, technical design, configuration, development and implementation of the SAP BI/BW and NATIVE HANA solutions.</li>\n<li>Responsible for performance tuning of BW systems utilizing best practices.</li>\n<li>Provide guidance on BW HANA security setup and enforces data governance standards and processes.</li>\n<li>Responsible for root cause analysis and providing solutions for SAP BW Reporting production and development issues.</li>\n<li>Determine the BW architectural standards and right data ingestion approach from disparate source applications using different real-time and batch enabling technologies into Native HANA.</li>\n<li>Mentor a team of junior HANA BW resources in the team, participate in sharing expertise on HANA, and be willing to drive HANA growth initiatives internally within Tate &amp; Lyle IS/IT function.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Deep understanding of SAP HANA Data Modeling techniques and HANA Studio using Attribute View, Analytic View, and Calculation Views. Modeling experience along with HANA related development languages (SQL Script, HTML5, Javascript, Java).</li>\n<li>Experience in Visualization &amp; Reporting tools such as BO Webi, Analysis for Office, SAP Lumira/SAP Analytics.</li>\n<li>Experience in design and development of MultiProviders, InfoCubes, InfoSources, Transfer Structures, DataStore Objects (DSO), Transformations and Data Transfer Process (DTPs), InfoPackages, Transfer Rules and Update Rules.</li>\n<li>General understanding and technical expertise of enterprise-class ETL/BI tools (Oracle BIEE, IBM Cognos, SAS, Informatica, Tableau).</li>\n<li>Exposure to BODS / ETL / SQL Script Tool HANA.</li>\n<li>Understanding of BW HANA Security Model.</li>\n<li>Experience in SAP BPC/BPS project implementations is preferred. Knowledge of BPC Excel, and BPC Web UI is a plus.</li>\n<li>Experience in a multi-cultural, global organization; fluent in English with other spoken languages a plus.</li>\n<li>Strong functional knowledge of ECC Extraction in the areas of Finance, Supply Chain, SD/MM/PP -Logistics.</li>\n<li>Experience with SAP Analytics Cloud (SAC), Power BI, or Tableau integrated with Snowflake.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Understanding of Agile delivery and DevOps principles in BI projects.</li>\n<li>Knowledge of data governance, data security, and compliance in cloud and hybrid environments.</li>\n<li>Good analytical and problem-solving skills, with attention to detail.</li>\n<li>Effective communication and interpersonal skills to collaborate with cross-functional teams.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n</ul>\n<p><strong>Working Hours:</strong> 12 PM - 9 PM with overlap during EST Time zone.</p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems never seeks payment for jobs. Contact via official website or LinkedIn only.</p>",
        "tags": [
            "10+ Years",
            "SAP BW",
            "SAP HANA",
            "Data Migration"
        ],
        "summary": "Senior SAP BW Technical Consultant needed to lead data migration to Snowflake. Requires extensive SAP BW/HANA experience and expertise in data modeling and visualization tools."
    },
    {
        "job_title": "Enterprise Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21964",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Enterprise Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking an experienced Enterprise Architect to design, develop, and manage the organization’s overall technology infrastructure. The ideal candidate will align IT strategies with business goals, ensure effective system integration, and create a robust, scalable IT landscape.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 25, July 2025</p>\n<p><strong>Job Published:</strong> 18, July 2025</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li><strong>Strategic Planning:</strong><ul>\n<li>Collaborate with senior management to understand business objectives and formulate a comprehensive IT strategy.</li>\n<li>Define and articulate the enterprise architecture vision, roadmap, and standards.</li>\n<li>Assess the current IT landscape, identifying gaps, risks, and opportunities.</li>\n<li>Conduct feasibility studies and evaluate risks and benefits of new technology initiatives.</li>\n</ul>\n</li>\n<li><strong>Architecture Design:</strong><ul>\n<li>Design and document enterprise architecture blueprints.</li>\n<li>Develop and oversee solution architectures for new projects.</li>\n<li>Define technology standards, guidelines, and best practices.</li>\n<li>Ensure the adoption of architectural principles across all IT projects.</li>\n</ul>\n</li>\n<li><strong>Technical Leadership:</strong><ul>\n<li>Provide technical expertise and guidance to project teams.</li>\n<li>Lead architecture review boards.</li>\n<li>Stay updated on emerging technologies and industry trends.</li>\n<li>Evaluate and recommend new technologies.</li>\n</ul>\n</li>\n<li><strong>Communication and Collaboration:</strong><ul>\n<li>Act as a bridge between business stakeholders, IT teams, and vendors.</li>\n<li>Present complex technical concepts to non-technical audiences.</li>\n<li>Collaborate with architects across data, security, and cloud disciplines.</li>\n<li>Advise senior management on the business impact of technology decisions.</li>\n</ul>\n</li>\n<li><strong>Governance and Compliance:</strong><ul>\n<li>Ensure the enterprise architecture complies with industry regulations and security standards.</li>\n<li>Monitor the implementation of architectural standards and enforce governance policies.</li>\n<li>Conduct regular architecture reviews to identify risks and recommend mitigation strategies.</li>\n</ul>\n</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Technical Expertise:</strong><ul>\n<li>Proficiency in enterprise architecture frameworks (e.g., TOGAF, Zachman).</li>\n<li>In-depth knowledge of cloud computing, distributed systems, data management, application development, and network architecture.</li>\n<li>Familiarity with programming languages and development methodologies.</li>\n</ul>\n</li>\n<li><strong>Business Acumen:</strong><ul>\n<li>Strong analytical skills to translate business needs into technical solutions.</li>\n<li>Comprehensive understanding of business processes.</li>\n<li>Excellent communication and presentation skills.</li>\n</ul>\n</li>\n<li><strong>Leadership and Collaboration:</strong><ul>\n<li>Demonstrated ability to lead cross-functional teams.</li>\n<li>Strong collaboration skills.</li>\n</ul>\n</li>\n</ul>\n<h3>Experience:</h3>\n<ul>\n<li>Proven experience as an Enterprise Architect, preferably within IT services.</li>\n<li>A successful track record in designing and implementing enterprise-wide IT solutions.</li>\n<li>Experience managing large-scale technology transformations and migration projects.</li>\n</ul>\n<h3>Domain Expertise:</h3>\n<ul>\n<li>Exposure to the BFSI (Banking, Financial Services, and Insurance) domain. Experience in Retail and Healthcare domains is also preferred.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Certification in enterprise architecture frameworks such as TOGAF or Zachman.</li>\n<li>Knowledge of DevOps practices and tools.</li>\n<li>Experience with modern technology stacks and microservices-based architectures.</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details. Reflections Info Systems does not seek payment for jobs. Contact careers@reflectionsinfos.com for any clarification/ alerts.</p>",
        "tags": [
            "10+ Years",
            "Enterprise Architecture",
            "TOGAF",
            "BFSI"
        ],
        "summary": "Seeking an Enterprise Architect with 10+ years of experience to design and manage the organization's technology infrastructure. Must have expertise in aligning IT strategies with business goals."
    },
    {
        "job_title": "Senior UI Technology Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21963",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Senior UI Technology Architect</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark\nKariyavattom P.O\nThiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a Senior UI Technology Architect with 12+ years of experience.</p>\n<p><strong>Preferred Skills:</strong>\n- Preferably a holistic architect specializing in UI Architecture.\n- Specialist in Angular, React etc.\n- Mandatory to be hands-on as this role might require coding.\n- Good thinking and communication skills – would have to manage customer interactions, do assessments, suggest roadmaps, define architecture.\n- Good to have at least some functional domain knowledge (banking or manufacturing/retail).</p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong>\nReflections Info Systems does not charge any fees for job opportunities. Be cautious of fraudulent job offers. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through our official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "12+ Years",
            "UI Architecture",
            "Angular",
            "React"
        ],
        "summary": "Reflections Info Systems is seeking a Senior UI Technology Architect with 12+ years of experience. The role involves managing customer interactions, defining architecture, and hands-on coding as needed."
    },
    {
        "job_title": "Apps & Integration Architect (.Net)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21962",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Apps &amp; Integration Architect (.Net)</h2>\n<p>Reflections Info Systems (P) Ltd is seeking an experienced Apps &amp; Integration Architect (.Net) to join our team. This role requires a candidate with a strong technical background and excellent communication skills for a client-facing position.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Designing and overseeing the architecture of software solutions.</li>\n<li>Providing technical leadership and mentoring to development teams.</li>\n<li>Designing scalable, secure, and robust .NET applications using Azure Cloud services.</li>\n<li>Leading cloud infrastructure design using Azure IaaS, PaaS, and other Azure services.</li>\n<li>Developing and implementing Azure DevOps CI/CD pipelines for continuous integration and delivery.</li>\n<li>Identifying, prioritizing, and executing tasks in the software development life cycle.</li>\n<li>Guiding the team to write reusable, testable, performant, and efficient code.</li>\n<li>Collaborating with stakeholders to align the architectural vision with business goals.</li>\n<li>Leading by example by designing and implementing clean, maintainable code.</li>\n<li>Troubleshooting and resolving architectural and infrastructure issues, ensuring high availability and disaster recovery setups.</li>\n<li>Managing stakeholders in client-facing roles.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>12+ years of experience in the IT industry.</li>\n<li>Strong expertise in .NET Framework &amp; .NET Core (C#, Entity Framework, EF Core, Microservices).</li>\n<li>Proficiency in RDBMS, including MS SQL Server (SQL queries, Stored Procedures).</li>\n<li>Familiarity with design patterns (Singleton, Factory, Repository, etc.) and architectural patterns (MVC, MVVM, Clean Architecture, DDD).</li>\n<li>Understanding of microservices principles and event-driven architecture.</li>\n<li>Proficiency in cloud services (Azure) and cloud-native application design (serverless architectures, Docker, Kubernetes).</li>\n<li>Minimum 2 years of experience in an architectural role or as a lead developer with architectural responsibilities.</li>\n<li>Experience in designing and implementing cloud architectures using Azure App Services, Azure Key Vault, Azure Functions, Durable Functions, Docker, Azure Logic Apps, Service Bus, Event Grid, Azure SQL Database, Cosmos DB, and Blob Storage.</li>\n<li>Experience setting up and managing CI/CD pipelines using Azure DevOps (Azure Repos, Azure Pipelines, Azure Artifacts).</li>\n<li>Knowledge of architectural styles and design patterns.</li>\n<li>Broad knowledge of the software development life cycle (SDLC) with Agile, Scrum, and Jira models.</li>\n<li>Experience with RESTful APIs.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience with PowerShell or Bash scripting for automation.</li>\n<li>Knowledge of Event Hub.</li>\n<li>Experience with GraphQL.</li>\n<li>Experience with front-end JavaScript frameworks (React/Angular/Vue.js).</li>\n<li>Experience in Azure Active Directory (AAD), Managed Identities, Role-Based Access Control (RBAC), and API security.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Note:</strong> Reflections Info Systems does not charge any fees for job opportunities. Contact careers@reflectionsinfos.com for any clarification.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "12+ Years",
            ".NET Core",
            "Azure DevOps",
            "SQL Server"
        ],
        "summary": "Reflections Info Systems is hiring an Apps & Integration Architect to design and oversee software solutions using .NET and Azure cloud services. The ideal candidate should have 12+ years of experience."
    },
    {
        "job_title": "Data Engineer- MDM/PIM/Atacama/Informatica",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21961",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Data Engineer - MDM/PIM/Atacama/Informatica</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Data Engineer with 6+ years of experience to join our team.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work as part of a team to develop Data and Analytics solutions.</li>\n<li>Participate in the development of cloud data warehouses, data as a service, and business intelligence solutions.</li>\n<li>Provide forward-thinking solutions in data integration.</li>\n<li>Deliver high-quality products.</li>\n<li>Develop Modern Data Warehouse solutions using Azure or AWS Stack.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Primary Skills</strong></p>\n<ul>\n<li>6+ years of experience as a Data Engineer, with a key/lead role in implementing large data solutions.</li>\n<li>Programming experience in Scala or Python, SQL.</li>\n<li>Minimum 1+ years of experience in MDM/PIM Solution Implementation with tools like Ataccama, Syndigo, Informatica.</li>\n<li>Minimum 2+ years of experience in Data Engineering Pipelines and Solutions implementation in Snowflake.</li>\n<li>Minimum 2+ years of experience in Data Engineering Pipelines and Solutions implementation in Databricks.</li>\n<li>Working knowledge of AWS and Azure Services like S3, ADLS Gen2, AWS Redshift, AWS Glue, Azure Data Factory, Azure Synapse.</li>\n<li>Demonstrated analytical and problem-solving skills.</li>\n<li>Excellent written and verbal skills (English).</li>\n</ul>\n<p><strong>Secondary Skills</strong></p>\n<ul>\n<li>Familiar with Agile Practices.</li>\n<li>Familiar with Version control platforms GIT, CodeCommit etc.</li>\n<li>Strong Problem-Solving skills.</li>\n<li>Ownership.</li>\n<li>Proactive rather than reactive.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science &amp; engineering or equivalent experience.</li>\n<li>Desirable to have Cloud Certifications in Data, Analytics, or Ops/Architect space.</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "6+ Years",
            "MDM/PIM",
            "Data Engineering",
            "Cloud Services"
        ],
        "summary": "Reflections Info Systems is hiring a Data Engineer to develop data solutions. The ideal candidate should have strong experience in MDM/PIM and cloud technologies."
    },
    {
        "job_title": "Cloud Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21960",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Cloud Infrastructure Architect</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a highly experienced Cloud Infrastructure Architect to design, develop, and maintain scalable cloud infrastructure solutions. The ideal candidate will have a minimum of 8 years of experience and a proven track record in enterprise-level cloud architecture and implementation.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable cloud infrastructure solutions.</li>\n<li>Lead cloud adoption strategies, migration roadmaps, and workload assessments.</li>\n<li>Provide infrastructure expertise to design cloud-native and on-premise solution architectures.</li>\n<li>Architect infrastructure solutions for AI/ML platforms, including training, inference, pipelines, and GPU/TPU setups.</li>\n<li>Ensure infrastructure security, compliance, and adherence to industry best practices.</li>\n<li>Design and implement new capabilities that address gaps and provide an integrated, end-to-end, scalable service.</li>\n<li>Collaborate with external vendors, partners, and stakeholders to ensure successful integration and implementation of infrastructure solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 8 years of experience in the design, implementation, and maintenance of infrastructure solutions.</li>\n<li>Experience in at least 5 projects involving enterprise-level cloud architecture and implementation.</li>\n<li>Proven expertise in designing and implementing large-scale microservices architectures, distributed systems, and integration architectures.</li>\n<li>Hands-on experience in large-scale cloud migration projects.</li>\n<li>Experience in setting up infrastructure for ML workloads, including training, inference, and GPU/TPU provisioning.</li>\n<li>Solid experience in data center operations, including the implementation and support of private and hybrid cloud environments.</li>\n<li>Strong experience with VMware technologies such as vSphere, ESXi, and vCenter.</li>\n<li>Hands-on expertise in infrastructure domains including networking, authentication, compute, and storage.</li>\n<li>Experience in responding to RFPs, preparing solution designs, and performing estimations and costing.</li>\n<li>Strong knowledge of Docker and Kubernetes, with hands-on experience deploying ML workloads.</li>\n<li>Proficient in Infrastructure as Code (IaC) using tools such as Ansible, Terraform, ARM Templates, and CloudFormation.</li>\n<li>Good understanding of SQL and NoSQL databases.</li>\n<li>Deep expertise in DevOps practices, containerization, and CI/CD pipelines.</li>\n<li>Experience with monitoring tools such as Nagios, Splunk, New Relic, or Prometheus.</li>\n<li>Experience working on projects with compliance requirements such as GDPR, PCI DSS, and HIPAA.</li>\n<li>Strong technical knowledge of cloud technologies and virtualization platforms (e.g., VMware, Hyper-V, Cisco, Microsoft, EMC, AWS).</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience with infrastructure services such as LDAP, DNS, DHCP, and Active Directory.</li>\n<li>Excellent communication, documentation, and presentation skills.</li>\n<li>Proficiency in scripting languages such as Python, Bash, or PowerShell for automation tasks.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>AWS/Azure/GCP Architect Certifications</li>\n<li>Kubernetes Certifications (CKA/CKAD)</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers and contact careers@reflectionsinfos.com for any clarification.</p>",
        "tags": [
            "8+ Years",
            "Cloud Architecture",
            "Kubernetes",
            "DevOps"
        ],
        "summary": "Reflections Info Systems is hiring a Cloud Infrastructure Architect. The role involves designing cloud solutions and leading cloud adoption strategies, requiring 8+ years of experience."
    },
    {
        "job_title": "Technical Project Manager(Data)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21959",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Technical Project Manager (Data)</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Technical Project Manager to lead the delivery of data platform, AI, BI, and analytics projects. The ideal candidate will have 13+ years of overall IT experience with at least 6+ years in a Technical Product Manager, Technical Program Manager, or Delivery Lead role.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Own the end-to-end delivery of data platform, AI, BI, and analytics projects, ensuring alignment with business objectives and stakeholder expectations.</li>\n<li>Develop and maintain comprehensive project plans, roadmaps, and timelines for data ingestion, transformation, governance, AI/ML models, and analytics deliverables.</li>\n<li>Lead cross-functional teams including data engineers, data scientists, BI analysts, architects, and business stakeholders to deliver high-quality, scalable solutions on time and within budget.</li>\n<li>Define, prioritize, and manage product and project backlogs covering data pipelines, data quality, governance, AI services, and BI dashboards or reporting tools.</li>\n<li>Collaborate closely with business units to capture and translate requirements into actionable user stories and acceptance criteria for data and analytics solutions.</li>\n<li>Oversee BI and analytics area including dashboard development, embedded analytics, self-service BI enablement, and ad hoc reporting capabilities.</li>\n<li>Ensure data quality, lineage, security, and compliance requirements are integrated throughout the project lifecycle, in collaboration with governance and security teams.</li>\n<li>Coordinate UAT, performance testing, and user training to ensure adoption and successful rollout of data and analytics products.</li>\n<li>Act as the primary point of contact for all project stakeholders, providing regular status updates, managing risks and issues, and escalating as necessary.</li>\n<li>Facilitate agile ceremonies such as sprint planning, backlog grooming, demos, and retrospectives, fostering a culture of continuous improvement.</li>\n<li>Drive post-deployment monitoring and optimization of data and BI solutions to meet evolving business needs and performance standards.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Overall 13+ Years of Experience in IT with 6+ years of experience as a Technical Product Manager, Technical Program Manager, or Delivery Lead.</li>\n<li>Hands-on development experience in data engineering, including data pipelines, ETL processes, and data integration workflows</li>\n<li>Proven track record managing data engineering, analytics, or AI/ML projects end to end</li>\n<li>Solid understanding of modern data architecture: data lakes, warehouses, pipelines, ETL/ELT, governance, and AI tooling</li>\n<li>Hands-on familiarity with cloud platforms (e.g., Azure, AWS, GCP) and DataOps/MLOps practices</li>\n<li>Strong knowledge of Agile methodologies, sprint planning, and backlog grooming</li>\n<li>Excellent communication and stakeholder management skills, including working with senior execs and technical leads</li>\n<li>Background in computer science, engineering, data science, or analytics</li>\n<li>Experience or Solid Understanding with data engineering tools and services in AWS, Azure &amp; GCP</li>\n<li>Exposure or Solid Understanding of BI, Analytics, LLMs, RAG, prompt engineering, or agent-based AI systems</li>\n<li>Experience leading cross-functional teams in matrixed environments</li>\n<li>Certifications: PMP, CSM, SAFe, or equivalent are a plus</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please note:</strong> Reflections Info Systems does not charge any fees for job applications. Contact careers@reflectionsinfos.com for any clarification.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark,\nKariyavattom P.O, Thiruvananthapuram,\nKerala, India, 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "13+ Years",
            "Data Engineering",
            "Agile",
            "Cloud Platforms"
        ],
        "summary": "Reflections Info Systems is hiring a Technical Project Manager. This role involves leading data platform, AI, and BI projects, requiring 13+ years of IT experience."
    },
    {
        "job_title": "Senior DotNet Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21958",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Senior .NET Developer</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a Senior .NET Developer with 8+ years of experience in the IT industry and strong skills in .NET/.NET Core/Azure Cloud Services/Azure DevOps. This is a client-facing role requiring excellent communication skills. The candidate should be hands-on with coding and Azure Cloud.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> July 25, 2025</p>\n<p><strong>Working Hours:</strong>\n- 8 hours per day\n- Mandatory 4-hour overlap during EST Time zone (12 PM - 9 PM)</p>\n<p><strong>Responsibilities:</strong>\n- Design, develop, enhance, document, and maintain robust applications using .NET Core 6/8+, C#, REST APIs, T-SQL, and modern JavaScript/jQuery.\n- Integrate and support third-party APIs and external services.\n- Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack.\n- Identify, prioritize, and execute tasks throughout the Software Development Life Cycle (SDLC).\n- Participate in Agile/Scrum ceremonies and manage tasks using Jira.\n- Understand technical priorities, architectural dependencies, risks, and implementation challenges.\n- Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability.</p>\n<p><strong>Preferred Skills:</strong>\n- 8+ years of hands-on development experience with:\n  - C#, .NET Core 6/8+, Entity Framework / EF Core\n  - JavaScript, jQuery, REST APIs\n- Expertise in MS SQL Server, including:\n  - Complex SQL queries, Stored Procedures, Views, Functions, Packages, Cursors, Tables, and Object Types\n- Skilled in unit testing with XUnit, MSTest\n- Strong in software design patterns, system architecture, and scalable solution design\n- Ability to lead and inspire teams through clear communication, technical mentorship, and ownership\n- Strong problem-solving and debugging capabilities\n- Ability to write reusable, testable, and efficient code\n- Develop and maintain frameworks and shared libraries to support large-scale applications\n- Excellent technical documentation, communication, and leadership skills\n- Microservices and Service-Oriented Architecture (SOA)\n- Experience in API Integrations\n- 2+ years of hands with Azure Cloud Services, including:\n  - Azure Functions\n  - Azure Durable Functions\n  - Azure Service Bus, Event Grid, Storage Queues\n  - Blob Storage, Azure Key Vault, SQL Azure\n  - Application Insights, Azure Monitoring</p>\n<p><strong>Secondary Skills:</strong>\n- Familiarity with AngularJS, ReactJS, and other front-end frameworks\n- Experience with Azure API Management (APIM)\n- Knowledge of Azure Containerization and Orchestration (e.g., AKS/Kubernetes)\n- Experience with Azure Data Factory (ADF) and Logic Apps\n- Exposure to Application Support and operational monitoring\n- Azure DevOps - CI/CD pipelines (Classic / YAML)</p>\n<p><strong>Certifications:</strong>\n- Microsoft Certified: Azure Fundamentals\n- Microsoft Certified: Azure Developer Associate\n- Other relevant certifications in Azure, .NET, or Cloud technologies</p>\n<p><strong>How to Apply:</strong>\nInterested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current, and expected CTC details.</p>\n<p><strong>Fraud Alert:</strong>\nReflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers. Official communications will come through our website or LinkedIn, and emails will be sent from the official HR email id. Contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>\n<p><strong>Company Information:</strong>\nReflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Azure Cloud",
            "C#"
        ],
        "summary": "Reflections Info Systems is looking for a Senior .NET Developer. The role involves development using .NET Core and Azure, requiring strong communication skills for client interaction."
    },
    {
        "job_title": "Senior Technology Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21957",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Senior Technology Architect</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a versatile and hands-on Senior Technology Architect to join our dynamic engineering teams. The ideal candidate will bridge the gap between high-level strategy and practical implementation, driving technical vision and building robust solutions that contribute to business growth.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Pragmatic Solution Design:</strong> Lead the architecture and hands-on design of scalable, secure, and resilient enterprise applications.</li>\n<li><strong>Hands-On Technical Leadership:</strong> Mentor and guide development teams through complex technical challenges. Lead with hands-on prototyping and coding.</li>\n<li><strong>Client Engagement &amp; Trusted Advisory:</strong> Work directly with customers to lead technical assessments, understand business challenges, and act as a trusted advisor.</li>\n<li><strong>Business &amp; Account Growth:</strong> Contribute to growing key accounts by identifying new opportunities and assisting with pre-sales activities.</li>\n<li><strong>Delivery Assurance &amp; Support:</strong> Partner with delivery and DevOps teams to ensure the architectural vision is translated into a practical, working solution.</li>\n<li><strong>Service Offering &amp; Capability Development:</strong> Proactively explore new technologies and methods. Develop new service offerings and build reusable assets.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Architectural Expertise:</strong> Proven ability to apply architectural principles and patterns (Microservices, Domain-Driven Design, Clean Architecture, Event-Driven Architecture, SOLID, OOAD).</li>\n<li>Deep expertise in API design (e.g., REST, GraphQL) and hybrid integration solutions.</li>\n<li>Demonstrated experience in performing technical assessments and creating strategic technology roadmaps.</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li><strong>Microsoft Stack:</strong></li>\n<li>Extensive hands-on development experience with .NET and .NET Core.</li>\n<li>Proven ability to design and deploy solutions on Microsoft Azure (IaaS, PaaS, serverless architectures).</li>\n<li><strong>Frontend Technologies:</strong></li>\n<li>Hands-on expertise in Angular, React, or Node.js.</li>\n<li><strong>SharePoint:</strong></li>\n<li>In-depth, hands-on experience with SharePoint Online/On-Premises, including custom solution design.</li>\n<li>Proficiency in the SharePoint Framework (SPFx), custom web parts, and other SharePoint customizations.</li>\n<li><strong>DevOps:</strong></li>\n<li>Hands-on experience with DevOps practices and tools for building and managing CI/CD pipelines.</li>\n<li>Proficiency with containerization technologies (Docker, Kubernetes) and infrastructure as code (IaC).</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>10+ years of progressive, hands-on experience in software development and solution architecture.</li>\n<li>4+ years in a senior role responsible for technical leadership and architectural decisions.</li>\n<li>A strong portfolio showcasing successfully designed and delivered enterprise-scale solutions.</li>\n</ul>\n<p><strong>What We're Looking For:</strong></p>\n<ul>\n<li>A Pragmatic Problem-Solver</li>\n<li>An Excellent Communicator</li>\n<li>A Business-Minded Technologist</li>\n<li>A Proactive and Self-Driven Leader</li>\n<li>A Collaborative Mentor</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Closing Date:</strong> 25, July 2025</p>\n<p><strong>Job Published:</strong> 18, July 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Address:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581</p>",
        "tags": [
            "10+ Years",
            ".NET Core",
            "Azure",
            "SharePoint"
        ],
        "summary": "Seeking a Senior Technology Architect to drive technical vision, build solutions, and provide technical leadership. Requires expertise in .NET, Azure, JavaScript, and DevOps with 10+ years experience."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21956",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Delivery Manager to oversee the planning, execution, and delivery of multiple technical projects. The ideal candidate will have a minimum of 18 years of experience in technology delivery roles and a strong understanding of modern software development practices.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Project Delivery Management:</strong> Oversee the planning, execution, and delivery of multiple technical projects. Manage project scope, timelines, budgets, risks, and quality. Ensure adherence to Agile/Waterfall methodologies as per project requirements.</li>\n<li><strong>Team Leadership:</strong> Lead and mentor cross-functional technical teams, fostering collaboration and innovation. Conduct regular performance reviews and provide growth opportunities for team members.</li>\n<li><strong>Stakeholder Engagement:</strong> Act as a bridge between technical teams, business stakeholders, and clients. Communicate project status, risks, and solutions effectively to all stakeholders.</li>\n<li><strong>Technical Expertise:</strong> Collaborate with architects and engineers to define technical solutions. Provide input on architecture, design, and implementation strategies.</li>\n<li><strong>Process Improvement:</strong> Identify opportunities to improve project delivery processes and tools. Implement best practices in software development and delivery.</li>\n<li><strong>Risk and Issue Management:</strong> Proactively identify project risks and develop mitigation strategies. Resolve technical and operational challenges in a timely manner.</li>\n<li><strong>Customer Focus:</strong> Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li><strong>Experience:</strong> 18 years of experience in technology delivery roles, including hands-on development and leadership responsibilities. Proven experience in delivering large-scale, complex projects with diverse teams.</li>\n<li><strong>Technical Expertise:</strong> Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps. Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</li>\n<li><strong>Project Management:</strong> Expertise in Agile, Scrum, Kanban, and traditional project management methodologies. Certification such as PMP, CSM, or equivalent is an advantage.</li>\n<li><strong>Leadership and Communication:</strong> Excellent team leadership, people management, and conflict resolution skills. Strong communication, presentation, and negotiation abilities.</li>\n<li><strong>Education:</strong> Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please Note:</strong> Reflections Info Systems never seeks payment for jobs. Be cautious of fraudulent job offers. Contact careers@reflectionsinfos.com for any clarification.</p>\n<p><strong>Company Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p>Closing Date: 25, July 2025\nJob Published: 18, July 2025</p>",
        "tags": [
            "18+ Years",
            "Agile/Waterfall",
            "Cloud Technologies",
            "Team Leadership"
        ],
        "summary": "Reflections Info Systems is hiring a Delivery Manager with 18+ years of experience. This role involves overseeing technical projects, leading teams, and ensuring stakeholder satisfaction."
    },
    {
        "job_title": "Senior SQA",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21955",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Senior SQA</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Senior Software Quality Assurance (SQA) professional with a minimum of 5 years of experience. The ideal candidate will possess a strong background in software quality assurance, process improvement, and compliance audits. This role requires excellent analytical and communication skills, as well as hands-on experience with quality frameworks, SDLC governance, and root cause analysis.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Guide and support project and support teams in adhering to organizational quality and infosec processes, policies, and best practices.</li>\n<li>Conduct periodic audits and reviews, including Internal Audits, SDLC work product reviews, and Configuration Audits to ensure compliance with defined processes.</li>\n<li>Track and follow up on non-conformities identified during audits and reviews, ensuring timely closure and corrective action.</li>\n<li>Facilitate root cause analysis for process gaps, defects, or audit findings, and collaborate with teams to identify and implement preventive and corrective measures.</li>\n<li>Collect, validate, and analyze quality and process metrics across projects and departments, and initiate process improvements.</li>\n<li>Drive quality initiatives and organization-wide process improvement programs.</li>\n<li>Assist teams in identifying, documenting, and tracking project-level risks and issues, ensuring they are reviewed and managed appropriately.</li>\n<li>Actively participate in key project meetings, including initiation, retrospectives, risk/issue reviews, and closure meetings.</li>\n<li>Support awareness and training initiatives, including sessions on quality management systems, information security, and compliance standards to build organizational capability and compliance culture.</li>\n</ul>\n<p><strong>Certifications (Preferred):</strong></p>\n<ul>\n<li>Internal auditor certified (QMS/ISMS)</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul>\n<li><strong>Primary Skills:</strong></li>\n<li>Hands-on experience in conducting Internal Quality Audits (IQA), SDLC Work Product Reviews, and Configuration Management (CM) Audits</li>\n<li>Knowledge of Quality and Security standards such as ISO 9001, ISO 27001</li>\n<li>Skilled in quality analysis techniques like Fishbone (Ishikawa) Diagrams, and Pareto Analysis</li>\n<li>Good understanding of Agile, Waterfall, and Hybrid SDLC methodologies</li>\n<li>Proficient in collecting, validating, analyzing, and reporting quality and performance metrics</li>\n<li>Experience in conducting Root Cause Analysis (RCA) and driving Corrective and Preventive Actions (CAPA)</li>\n<li>\n<p>Ability to define, standardize, and continuously improve organizational processes, templates, and guidelines</p>\n</li>\n<li>\n<p><strong>Secondary Skills:</strong></p>\n</li>\n<li>Good Team player, Interpersonal and Problem-solving skills</li>\n<li>Attention to detail and presentation skills</li>\n<li>Working knowledge in tools - GitHub, JIRA, Redmine, Trello, Basecamp etc.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates should send their resumes to Careers@reflectionsinfos.com, including details on notice period, current, and expected CTC.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Note:</strong> Reflections Info Systems does not ask for fees for job opportunities. Be cautious of fraudulent job offers. Contact careers@reflectionsinfos.com for clarifications.</p>",
        "tags": [
            "5+ Years",
            "ISO 9001",
            "ISO 27001",
            "Internal Audits"
        ],
        "summary": "Seeking a Senior SQA to ensure quality through audits, process improvement, and compliance. Requires 5+ years' experience in quality frameworks and SDLC governance."
    },
    {
        "job_title": "Test Engineer – Automation",
        "company": "Xpetize Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21954",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Test Engineer – Automation</h2>\n<p><strong>Xpetize Technology Solutions (P) Ltd</strong>\nA-10, TBIC, 4th Floor, Nila, Technopark, Kerala, Trivandrum, 695581\n<a href=\"http://www.xpetize.com\">http://www.xpetize.com</a></p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> careers@xpetize.com</p>\n<p><strong>Skill Set Required:</strong></p>\n<p><strong>Must Have:</strong></p>\n<ul>\n<li>Manual testing experience</li>\n<li>C# based POM framework expertise</li>\n<li>C# development expertise for Test automation</li>\n<li>Selenium expertise</li>\n<li>Test result documentation</li>\n<li>Azure DevOps</li>\n<li>Database Testing and SQL queries</li>\n<li>API Testing</li>\n</ul>\n<p><strong>Good to Have:</strong></p>\n<ul>\n<li>Playwright expertise</li>\n<li>Javascript</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience Level: 3-8 years’ experience.</li>\n<li>No. of Positions: 05</li>\n<li>Notice Period: immediate joiners</li>\n<li>Mode Of Work: Work From Home</li>\n</ul>",
        "tags": [
            "3-8 Years",
            "C#",
            "Selenium",
            "Azure DevOps"
        ],
        "summary": "Xpetize Technology Solutions is seeking a Test Automation Engineer with 3-8 years of experience. The ideal candidate will possess skills in C#, Selenium, and Azure DevOps."
    },
    {
        "job_title": "Senior Node.js Developer",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/21953",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Senior Node.js Developer</h2>\n<p>Spericorn Technology is seeking a highly skilled Senior Node.js Developer to join our team for a blockchain-based project.</p>\n<p><strong>Contact:</strong> careers@spericorn.com</p>\n<p><strong>Closing Date:</strong> July 31, 2025</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable backend services using Node.js.</li>\n<li>Integrate with blockchain platforms (Ethereum, Polygon, Solana, etc.) via APIs and SDKs.</li>\n<li>Develop secure RESTful and GraphQL APIs for decentralized applications.</li>\n<li>Collaborate with smart contract developers to interface backend with on-chain logic.</li>\n<li>Handle cryptographic operations such as wallet management, key storage, and digital signatures.</li>\n<li>Implement security best practices for data handling, API access, and user authentication.</li>\n<li>Optimize system performance and scalability for high-volume transaction flows.</li>\n<li>Participate in code reviews, architecture discussions, and technical decision-making.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5+ years of professional experience in backend development.</li>\n<li>Strong proficiency in Node.js, TypeScript/JavaScript.</li>\n<li>Solid understanding of RESTful APIs, GraphQL, WebSockets.</li>\n<li>Experience with blockchain integration using Web3.js, Ethers.js, or similar libraries.</li>\n<li>Familiarity with smart contracts and blockchain fundamentals (tokens, gas, consensus).</li>\n<li>Strong database skills with MongoDB, PostgreSQL, or similar databases.</li>\n<li>Experience with OAuth2, JWT, and other authentication mechanisms.</li>\n<li>Proficient with Git, Docker, SQS, and basic cloud services (AWS/GCP/Azure).</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your resume and portfolio (if any) to careers@spericorn.com with the subject: “Senior Node.js Developer”.</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "Blockchain",
            "RESTful APIs"
        ],
        "summary": "We are seeking a Senior Node.js Developer to build backend systems for blockchain projects. The role involves blockchain integration, API development, and ensuring secure transactions."
    },
    {
        "job_title": "Lead Data Scientist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21952",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Lead Data Scientist</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a highly experienced and skilled Lead Data Scientist to provide technical leadership and strategic direction for our AI initiatives. This role requires a minimum of 8 years of professional experience, with at least 6 years in a data science role.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead and mentor a high-performance team, guiding them on the latest technology landscape, patterns, and design standards.</li>\n<li>Provide strategic direction and technical leadership for AI initiatives.</li>\n<li>Lead the design and architecture of complex AI systems, ensuring scalability, reliability, and performance.</li>\n<li>Lead the development and deployment of machine learning/deep learning models to address key business challenges.</li>\n<li>Apply statistical modeling, data preprocessing, feature engineering, machine learning, and deep learning techniques to build and improve models.</li>\n<li>Utilize expertise in at least two of the following areas: computer vision, predictive analytics, natural language processing, time series analysis, recommendation systems.</li>\n<li>Design, implement, and optimize data pipelines for model training and deployment.</li>\n<li>Experience with model serving frameworks (e.g., TensorFlow Serving, TorchServe, KServe, or similar).</li>\n<li>Design and implement APIs for model serving and integration with other systems.</li>\n<li>Collaborate with cross-functional teams to define project requirements, develop solutions, and communicate results.</li>\n<li>Mentor junior data scientists, providing guidance on technical skills and project execution.</li>\n<li>Stay up-to-date with the latest advancements in data science and machine learning, particularly in generative AI, and evaluate their potential applications.</li>\n<li>Communicate complex technical concepts and analytical findings to both technical and non-technical audiences.</li>\n<li>Serve as a primary point of contact for client managers and liaise frequently with internal stakeholders to gather data or inputs needed for project work.</li>\n</ul>\n<p><strong>Required Skills and Experience:</strong></p>\n<ul>\n<li>A minimum of 8 years of professional experience, with at least 6 years in a data science role.</li>\n<li>Strong knowledge of statistical modeling, machine learning, deep learning and GenAI.</li>\n<li>Proficiency in Python and hands-on experience optimizing code for performance.</li>\n<li>Experience with data preprocessing, feature engineering, data visualization, and hyperparameter tuning.</li>\n<li>Solid understanding of database concepts and experience working with large datasets.</li>\n<li>Experience deploying and scaling machine learning models in a production environment.</li>\n<li>Familiarity with machine learning operations (MLOps) and related tools.</li>\n<li>Good understanding of Generative AI concepts and LLM finetuning.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Proficiency in any of Cloud Computing Platforms (e.g., AWS, Azure, GCP)</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Expertise in designing scalable and efficient model architectures.</li>\n<li>Ability to assess and forecast the financial requirements of data science projects.</li>\n<li>Strong communication skills for conveying complex technical concepts.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Job Details:</strong>\n- Closing Date: July 25, 2025\n- Published Date: July 18, 2025</p>\n<p><strong>Company Information:</strong>\n- Reflections Info Systems (P) Ltd\n- 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n- http://www.reflectionsglobal.com</p>\n<p><strong>Note:</strong> Reflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers and contact careers@reflectionsinfos.com for any clarification.</p>",
        "tags": [
            "8+ Years",
            "Machine Learning",
            "Deep Learning",
            "Python"
        ],
        "summary": "Reflections Info Systems is hiring a Lead Data Scientist to lead AI initiatives and mentor a high-performance team. The role involves designing AI systems and deploying machine learning models."
    },
    {
        "job_title": "Network Consulting Engineer – VXLAN & AI Data Center Networking",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21951",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Network Consulting Engineer – VXLAN &amp; AI Data Center Networking</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly skilled Network Consulting Engineer (NCE) to design and implement next-generation VXLAN EVPN-based data center networks that support hypercomputing and AI infrastructure. This role is central to enabling the high performance, low-latency environments required for multi-GPU clusters, distributed training pipelines, and scalable AI workloads.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, deploy, and manage VXLAN EVPN-based fabric networks supporting AI and high-performance computing workloads.</li>\n<li>Build scalable spine-leaf architectures using Cisco Nexus 9000 or Arista switches, ensuring efficient Layer 2/Layer 3 segmentation and workload mobility.</li>\n<li>Optimize network performance for RoCEv2, GPUDirect, and low-latency traffic flows, ensuring maximum throughput and minimal jitter for GPU-accelerated clusters.</li>\n<li>Configure underlay and overlay protocols including BGP, OSPF, IS-IS, and troubleshoot connectivity and control-plane issues.</li>\n<li>Integrate data center fabric with virtualization platforms such as VMware NSX, KVM, and Hyper-V, as well as Kubernetes-based AI infrastructure.</li>\n<li>Collaborate with compute, storage, and DevOps teams to ensure end-to-end performance across AI training, fine-tuning, inference, and ETL pipelines.</li>\n<li>Drive network automation efforts using tools such as Python, Ansible, and Terraform, enabling Infrastructure-as-Code (IaC) for repeatable, scalable deployments.</li>\n<li>Participate in performance tuning, benchmarking, and capacity planning for evolving AI workloads and future-proof infrastructure designs.</li>\n<li>Evaluate and enhance existing systems, identifying opportunities for innovation and efficiency.</li>\n<li>Utilize monitoring tools like Dynatrace to ensure system reliability and proactively address potential issues.</li>\n<li>Mentor and guide junior architects and developers to foster a culture of excellence.</li>\n<li>Lead cross-functional technical discussions and provide direction to teams to achieve project goals.</li>\n</ul>\n<p><strong>Must Have:</strong></p>\n<ul>\n<li>Proven experience designing and operating VXLAN EVPN-based data center networks.</li>\n<li>Strong knowledge of Cisco ACI, Nexus 9000, or Arista EOS platforms.</li>\n<li>Expertise in data center routing and switching, including BGP, OSPF, IS-IS, multicast, and fabric path.</li>\n<li>Deep understanding of AI-specific networking needs, including RoCEv2, DCB, PFC, and RDMA optimization.</li>\n<li>Familiarity with GPU-accelerated workloads and distributed systems in AI/ML and HPC environments.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Minimum Experience: 10+ years in IT, with at least 8+ years experience in VXLAN EVPN-based data center networks that support hypercomputing and AI infrastructure.</li>\n<li>CCNP or CCIE Data Center (highly preferred).</li>\n<li>Bachelor's in Computer Science/Applications/BTech Computer Science/MCA</li>\n</ul>\n<p><strong>Nice to Haves:</strong></p>\n<ul>\n<li>Certified Specialist – Enterprise Core or Data Center Core.</li>\n<li>Additional certifications in NVIDIA Networking (Cumulus/Spectrum) or Arista ACE are a plus.</li>\n<li>Experience with hybrid and multi-cloud networking for AI clusters is desirable</li>\n<li>Strong analytical and problem-solving skills, with the ability to make data-driven decisions.</li>\n<li>Exceptional communication and interpersonal skills, with a proven track record of working with diverse teams.</li>\n<li>Up-to-date knowledge of industry standards, security protocols, and compliance regulations in the banking sector.</li>\n<li>Demonstrated ability to adapt to emerging trends and technologies.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>",
        "tags": [
            "8+ Years",
            "VXLAN EVPN",
            "Cisco Nexus 9000",
            "RoCEv2"
        ],
        "summary": "Seeking a Network Consulting Engineer for designing and implementing VXLAN EVPN-based data center networks supporting AI infrastructure. Requires expertise in VXLAN, BGP, EVPN, and RoCEv2."
    },
    {
        "job_title": "AI Computing Infrastructure Engineer – GPU & High-Performance Computing",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21950",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>AI Computing Infrastructure Engineer – GPU &amp; High-Performance Computing</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly capable AI Infrastructure Engineer to design, implement, and optimize GPU-accelerated compute environments that power advanced AI and machine learning workloads. This role is critical in building and supporting scalable, high-performance infrastructure across data centers and hybrid cloud platforms, enabling training, fine-tuning, and inference of modern AI models.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>AI Infrastructure Design &amp; Deployment with multi-GPU clusters using NVIDIA or AMD platforms.</li>\n<li>Configure GPU environments using CUDA, DGX Systems, and NVIDIA Kubernetes Device Plugin.</li>\n<li>Deploy and manage containerized environments with Docker, Kubernetes, and Slurm.</li>\n<li>AI Model Support &amp; Optimization for training, fine-tuning, and inference pipelines for LLMs and deep learning models.</li>\n<li>Enable distributed training using DDP, FSDP, and ZeRO, with support for mixed precision.</li>\n<li>Tune infrastructure to optimize model performance, throughput, and GPU utilization.</li>\n<li>Design and operate high-bandwidth, low-latency networks using InfiniBand and RoCE v2.</li>\n<li>Integrate GPUDirect Storage and optimize data flow across Lustre, BeeGFS, and Ceph/S3.</li>\n<li>Support fast data ingestion, ETL pipelines, and large-scale data staging.</li>\n<li>Leverage NVIDIA’s AI stack including cuDNN, NCCL, TensorRT, and Triton Inference Server.</li>\n<li>Conduct performance benchmarking with MLPerf and custom test suites</li>\n</ul>\n<p><strong>Must Have:</strong></p>\n<ul>\n<li>3–6 years of experience in AI/ML infrastructure engineering or high-performance computing (HPC).</li>\n<li>Solid experience with GPU-based systems, container orchestration, and AI/ML frameworks.</li>\n<li>Familiarity with distributed systems, performance tuning, and large-scale deployments.</li>\n<li>Expertise in modern GPU architectures (e.g., NVIDIA A100/H100, AMD MI300), multi-GPU configurations (NVLink, PCIe, HBM), and accelerator scheduling for AI training and inference workloads.</li>\n<li>Good understanding of modern AI model architectures, including LLMs (e.g., GPT, LLaMA), diffusion models, and multimodal encoder-decoder frameworks, with awareness of their compute and scaling requirements.</li>\n<li>Knowledge of leading AI/ML frameworks (e.g., TensorFlow, PyTorch), NVIDIA’s AI stack (CUDA, cuDNN, TensorRT), and open-source tools like Hugging Face, ONNX, and MLPerf for model development and benchmarking.</li>\n<li>Familiarity with AI pipelines for supervised/unsupervised training, fine-tuning (PEFT/LoRA/QLoRA), and batch or real-time inference, with expertise in distributed training, checkpointing, gradient strategies, and mixed precision optimization</li>\n</ul>\n<p><strong>Certifications (Preferred):</strong></p>\n<ul>\n<li>NVIDIA Certified Professional – Data Center AI</li>\n<li>Kubernetes Administrator (CKA)</li>\n<li>CCNP or CCIE Data Center</li>\n<li>Cloud Certification (AWS, Azure, or GCP)</li>\n</ul>\n<p><strong>Educational Qualifications:</strong></p>\n<ul>\n<li>Bachelors in Computer Science/Applications/BTech Computer Science/MCA</li>\n</ul>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>GPU Infrastructure Design &amp; Optimization (NVIDIA A100/H100, AMD MI300)</li>\n<li>CUDA Programming &amp; NVIDIA DGX Systems Setup</li>\n<li>Containerization with Docker, Kubernetes, and NVIDIA Device Plugin</li>\n<li>Distributed AI Training (DDP, FSDP, ZeRO, Mixed Precision)</li>\n<li>PyTorch, TensorFlow, and Model Optimization using TensorRT</li>\n<li>High-Performance Networking (InfiniBand, RoCEv2, GPUDirect Storage)</li>\n<li>AI Model Deployment using Triton Inference Server</li>\n<li>Data Management for AI Pipelines (Lustre, BeeGFS, Ceph, S3)</li>\n<li>Infrastructure Performance Benchmarking (MLPerf, NCCL Tests)</li>\n<li>Experience with LLMs and AI Model Scaling Requirements</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Slurm Workload Manager for Scheduling AI Jobs</li>\n<li>PEFT/LoRA/QLoRA-based Fine-tuning Strategies</li>\n<li>Open-Source AI Tools – Hugging Face, ONNX, FastAPI for Model Serving</li>\n<li>Integration with ETL/Data Ingestion Pipelines (Kafka, Spark, Airflow)</li>\n<li>GPU Memory Optimization – HBM Utilization, GPU Resource Scheduling</li>\n<li>AI Pipeline Automation using Python, Bash, or Terraform</li>\n<li>Basic Cloud Infrastructure Knowledge (AWS EC2 GPU Instances, Azure ML, GCP Vertex AI)</li>\n<li>Monitoring &amp; Logging (Prometheus, Grafana, NVIDIA DCGM, ELK Stack)</li>\n<li>Hybrid Cloud Setup for AI Workloads</li>\n<li>CI/CD Pipelines for ML Ops (GitHub Actions, MLflow, Kubeflow Pipelines)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "3-6 Years",
            "GPU",
            "Kubernetes",
            "PyTorch"
        ],
        "summary": "Seeking an AI Infrastructure Engineer to design and optimize GPU-accelerated compute environments. The role involves supporting scalable, high-performance infrastructure for training and inference of AI models."
    },
    {
        "job_title": "Kubernetes Orchestration Engineer – GPU Hypercomputing & AI Workloads",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21949",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Kubernetes Orchestration Engineer – GPU Hypercomputing &amp; AI Workloads</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly skilled Kubernetes Orchestration Engineer to lead the deployment and management of GPU-optimized Kubernetes environments that power AI/ML and hypercomputing workloads. This role is critical to ensuring scalable, reliable, and high-performance infrastructure across on-premises and hybrid cloud environments. As a core member of our infrastructure engineering team, you will work at the intersection of container orchestration, GPU resource management, and AI application scaling, enabling large scale distributed training and inference across GPU clusters.</p>\n<p><strong>Responsibilities include:</strong></p>\n<ul>\n<li>AI Infrastructure Design &amp; Deployment with multi-GPU clusters using NVIDIA or AMD platforms.</li>\n<li>Configure GPU environments using CUDA, DGX Systems, and NVIDIA Kubernetes Device Plugin.</li>\n<li>Deploy and manage containerized environments with Docker, Kubernetes, and Slurm.</li>\n<li>AI Model Support &amp; Optimization for training, fine-tuning, and inference pipelines for LLMs and deep learning models.</li>\n<li>Enable distributed training using DDP, FSDP, and ZeRO, with support for mixed precision.</li>\n<li>Tune infrastructure to optimize model performance, throughput, and GPU utilization.</li>\n<li>Design and operate high-bandwidth, low-latency networks using InfiniBand and RoCE v2.</li>\n<li>Integrate GPUDirect Storage and optimize data flow across Lustre, BeeGFS, and Ceph/S3.</li>\n<li>Support fast data ingestion, ETL pipelines, and large-scale data staging.</li>\n<li>Leverage NVIDIA’s AI stack including cuDNN, NCCL, TensorRT, and Triton Inference Server.</li>\n<li>Conduct performance benchmarking with MLPerf and custom test suites</li>\n</ul>\n<p><strong>Must Have:</strong></p>\n<ul>\n<li>Strong experience with Kubernetes (K8s) and container orchestration in production environments.</li>\n<li>Expertise in managing GPU workloads in Kubernetes using NVIDIA GPU Operator, vGPU, and device plugin configurations.</li>\n<li>Proficiency with container runtimes such as Docker and CRI-O, and orchestration tools like Helm and Kubernetes Operators.</li>\n<li>Solid understanding of networking within Kubernetes and service mesh integration (e.g., Istio, Linkerd).</li>\n<li>Familiarity with hybrid/multi-cloud Kubernetes platforms (e.g., GKE, EKS, AKS).</li>\n<li>Strong scripting and automation skills (e.g., YAML, Helm templating, Bash, Python).</li>\n</ul>\n<p><strong>Certifications (Must Have):</strong></p>\n<ul>\n<li>Certified Kubernetes Administrator (CKA)</li>\n</ul>\n<p><strong>Certifications (Good to Have):</strong></p>\n<ul>\n<li>Certified Kubernetes Application Developer (CKAD)</li>\n<li>NVIDIA Certified Kubernetes Specialist</li>\n</ul>\n<p><strong>Educational Qualifications:</strong></p>\n<ul>\n<li>Bachelor's in Computer Science/Applications/BTech Computer Science/MCA</li>\n</ul>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Kubernetes Cluster Management for AI/ML Workloads</li>\n<li>NVIDIA GPU Operator &amp; Device Plugin Configuration in K8s</li>\n<li>Container Orchestration using Docker, CRI-O, and Helm</li>\n<li>Kubernetes Operators for Lifecycle Automation &amp; Scaling</li>\n<li>Pod Networking with CNI Plugins – Calico, Flannel, Cilium</li>\n<li>Monitoring &amp; Observability with Prometheus, Grafana, Kibana</li>\n<li>GPU Workload Scheduling &amp; Optimization in Kubernetes</li>\n<li>Deployment of Distributed AI Frameworks (PyTorch, TensorFlow, Hugging Face)</li>\n<li>Service Mesh Integration – Istio or Linkerd</li>\n<li>Hybrid/Multi-Cloud Kubernetes Deployments (EKS, GKE, AKS)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Helm Templating &amp; YAML Scripting for Deployment Automation</li>\n<li>Infrastructure Scripting using Bash, Python, or Ansible</li>\n<li>Kubernetes Custom Resource Definitions (CRDs) &amp; API Extensions</li>\n<li>GPU Virtualization (vGPU) and Multi-Tenant GPU Allocation</li>\n<li>Kubeflow or MLflow Integration for MLOps Pipelines</li>\n<li>K8s Security (RBAC, Network Policies, Pod Security Standards)</li>\n<li>CI/CD Integration with GitOps Tools (ArgoCD, Flux)</li>\n<li>GPU Monitoring via NVIDIA DCGM or NVIDIA Cloud Native Stack</li>\n<li>Advanced Troubleshooting in Kubernetes (control plane, etcd, kubelet)</li>\n<li>Cloud-Native Storage for AI – CSI Drivers, NFS, Ceph</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "3+ Years",
            "Kubernetes",
            "GPU",
            "Docker"
        ],
        "summary": "Seeking a Kubernetes Orchestration Engineer to manage GPU-optimized Kubernetes environments. The role involves AI/ML workload deployment, ensuring infrastructure scalability and high-performance across hybrid cloud environments."
    },
    {
        "job_title": "Infrastructure as Code (IaC) Engineer – AI Data Center Automation",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21948",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Infrastructure as Code (IaC) Engineer – AI Data Center Automation</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are seeking a highly capable Infrastructure as Code (IaC) Engineer to lead the design, implementation, and management of automated infrastructure provisioning for high-performance AI data centers. This role is central to orchestrating compute, network, storage, and virtualization layers using modern IaC tools across on-premise and hybrid cloud environments.</p>\n<p>The ideal candidate will play a strategic role in enabling scalable and repeatable deployment pipelines that support GPU clusters, AI model training environments, and containerized platforms such as Kubernetes and OpenShift.</p>\n<h3>Job Description</h3>\n<p><strong>Must have:</strong></p>\n<ul>\n<li>5+ years of experience in infrastructure automation or SRE roles with hands-on IaC deployment.</li>\n<li>Proficiency in Terraform, Ansible, and scripting languages such as Python, Bash, and YAML.</li>\n<li>Experience automating infrastructure in GPU-intensive environments supporting AI/ML workloads.</li>\n<li>Strong understanding of networking (VXLAN, EVPN, BGP, RoCE) and virtualization platforms (OpenShift, VMware, KVM).</li>\n<li>Familiarity with Kubernetes, Helm, Operators, and container orchestration frameworks.</li>\n<li>Exposure to storage automation for AI data lakes (e.g., Ceph, BeeGFS, Lustre, or S3-compatible storage).</li>\n<li>Experience with CI/CD tools (GitLab CI/CD, Jenkins, ArgoCD, Flux) in IaC pipelines</li>\n</ul>\n<p><strong>Responsibilities include:</strong></p>\n<ul>\n<li>Design and implement IaC frameworks to automate the provisioning and configuration of data center infrastructure for AI workloads.</li>\n<li>Orchestrate and manage multi-layer automation across compute (GPU/CPU), networking (VXLAN, EVPN, BGP), storage (NVMe, object, parallel file systems), and virtualization platforms (KVM, VMware, OpenShift).</li>\n<li>Develop reusable Terraform modules, Ansible playbooks, and YAML templates to define infrastructure in version-controlled environments.</li>\n<li>Automate deployment of Kubernetes clusters and integrate with GPU operators for training and inference pipelines.</li>\n<li>Build and maintain CI/CD pipelines to deploy, test, and manage infrastructure changes using tools like GitLab CI/CD, Jenkins, or ArgoCD.</li>\n<li>Integrate with monitoring and observability stacks (Prometheus, Grafana, DCGM) for automated infrastructure validation and health monitoring.</li>\n<li>Work closely with AI/ML platform teams to align infrastructure deployment with model training, data pipelines, and security policies.</li>\n<li>Ensure compliance with security and operational standards through policy-as-code and drift detection mechanisms.</li>\n</ul>\n<h3>Certifications:</h3>\n<ul>\n<li>Certified Kubernetes Administrator (CKA) –Must</li>\n<li>Certified Kubernetes Application Developer (CKAD)</li>\n<li>NVIDIA Certified Kubernetes Specialist</li>\n</ul>\n<h3>Educational Qualifications</h3>\n<ul>\n<li>Bachelors in Computer Science/Applications/BTech Computer Science/MCA</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Terraform Scripting &amp; Module Development</li>\n<li>Ansible Automation for OS, Network, and Storage Provisioning</li>\n<li>Infrastructure Automation for GPU-Centric AI Workloads</li>\n<li>IaC for Virtualization Platforms – OpenShift, KVM, VMware</li>\n<li>Kubernetes Deployment Automation &amp; GPU Operator Integration</li>\n<li>Scripting Languages – Python, Bash, and YAML</li>\n<li>CI/CD for Infrastructure – GitLab CI/CD, Jenkins, ArgoCD</li>\n<li>Network Configuration Automation – VXLAN, EVPN, BGP, RoCE</li>\n<li>Storage Provisioning for AI – Ceph, Lustre, BeeGFS, or S3-compatible</li>\n<li>Monitoring Stack Integration – Prometheus, Grafana, DCGM</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Policy-as-Code &amp; Security Automation (OPA/Gatekeeper, Sentinel)</li>\n<li>Drift Detection &amp; Compliance Enforcement in IaC Environments</li>\n<li>Helm Charts &amp; Kubernetes Operators Automation</li>\n<li>Version Control Practices with Git for Infra Code</li>\n<li>Integration with AI/ML Pipelines and Data Ingestion Frameworks</li>\n<li>Hybrid/Multicloud Orchestration Knowledge (AWS, Azure, GCP)</li>\n<li>OpenShift GitOps or Flux for Continuous Delivery of Infra</li>\n<li>Template Reusability and Modular Code Design in IaC</li>\n<li>GPU Resource Pooling and Node Provisioning with Ansible + Terraform</li>\n<li>Observability Automation (DCGM Exporter, Node Exporter, Custom Metrics)</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details. This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "5+ Years",
            "Terraform",
            "Ansible",
            "Kubernetes"
        ],
        "summary": "We're hiring an Infrastructure as Code (IaC) Engineer to automate infrastructure for AI data centers. The role involves designing, implementing, and managing automated provisioning using tools like Terraform and Kubernetes."
    },
    {
        "job_title": "Sales Executive - SaaS Products (Sports Tech)",
        "company": "Icore Pioneer Business Solution (P) Ltd",
        "url": "https://technopark.org/job-details/21947",
        "location": "Technopark",
        "closing_date": "24 Jul 2025",
        "job_description": "<h2>Sales Executive - SaaS Products (Sports Tech)</h2>\n<p><strong>iCore Pioneer Business Solution (P) Ltd</strong>\nModule A-18 and A-19, 1st Floor, Gayatri Building, Phase I, Technopark Campus, 695581\n<a href=\"https://icorepioneer.com\">https://icorepioneer.com</a></p>\n<p><strong>Contact Email:</strong> careers@icorepioneer.com / gobika@icorepioneer.com\n<strong>Contact Number:</strong> +91-8157933777, +91-8156933777</p>\n<p><strong>Closing Date:</strong> 24, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>\n<p><strong>Job Summary:</strong>\nWe are seeking a proactive and customer-focused Sales Executive to join our growing sports tech company. The role involves promoting our SaaS-based software to potential clients across the sports ecosystem.</p>\n<p><strong>Roles &amp; Responsibilities:</strong>\n- Understand and clearly communicate the value proposition of our SaaS product to potential clients\n- Identify and connect with potential customers such as sports academies, training centers, and clubs\n- Conduct personalized product demos and virtual/in-person meetings\n- Maintain strong customer relationships and act as a point of contact for inquiries\n- Collaborate with the marketing and product teams to refine messaging based on customer feedback\n- Maintain and update sales activities using CRM tools\n- Participate in industry events, virtual sessions, and networking opportunities to promote the product</p>\n<p><strong>Preferred Skills:</strong>\n- 2 - 3 years of experience in software/SaaS product sales\n- Excellent communication and interpersonal skills\n- Comfortable with product demos and client interactions\n- Experience with CRM software (e.g., HubSpot)\n- Strong organizational and follow-up skills\n- Basic understanding of the sports ecosystem or personal interest in sports is a plus\n- Ability to work independently in a fast-paced, team-driven environment</p>\n<p>Interested candidates are invited to submit their resume to careers@icorepioneer.com / gobika@icorepioneer.com. Kindly share your CV with the subject line 'Sales Executive - SaaS Products'.</p>",
        "tags": [
            "2-3 Years",
            "SaaS",
            "CRM",
            "Sales"
        ],
        "summary": "iCore Pioneer seeks a Sales Executive to promote their SaaS product within the sports tech industry. The role involves client communication, demos, and CRM management."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "Ferns It Solutions  (P) Ltd",
        "url": "https://technopark.org/job-details/21946",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Digital Marketing Executive</h2>\n<p><strong>Ferns IT Solutions (P) Ltd</strong> is seeking a proactive and creative Digital Marketing Executive to join our growing team. This role is ideal for candidates with up to one year of experience who are passionate about digital marketing and eager to take ownership of campaigns and strategies. You’ll get to work in a supportive, fast-paced environment alongside industry professionals.</p>\n<p>If you're excited about contributing to impactful campaigns and growing with a company that values innovation and collaboration, we’d love to hear from you!</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Plan and execute digital marketing campaigns across multiple platforms</li>\n<li>Manage and grow our social media presence (Instagram, LinkedIn, Facebook, etc.)</li>\n<li>Develop and publish engaging content tailored for each platform</li>\n<li>Contribute to SEO strategies and optimize website performance</li>\n<li>Run basic paid ad campaigns (Google Ads, Meta Ads) under guidance</li>\n<li>Design visuals and assist in video creation using tools like Canva</li>\n<li>Track key performance metrics and create performance reports</li>\n<li>Stay updated with digital trends and best practices</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>0–1 year of experience in digital marketing</li>\n<li>Digital Marketing Certificate is mandatory</li>\n<li>Strong interest in content creation, social media, and SEO</li>\n<li>Knowledge of Google Analytics, Ads Manager, or any marketing tools is a plus</li>\n<li>Familiarity with design or editing tools (e.g., Canva) is an added advantage</li>\n<li>Good communication skills and team collaboration mindset</li>\n<li>Self-motivated, creative, and eager to learn new things</li>\n</ul>\n<p><strong>Candidate Preferred Location:</strong> Trivandrum only</p>\n<p><strong>Application Instructions:</strong> While sending the resume, use the subject line - DM/07/2025 – Digital Marketing Executive Position.\nKindly apply only if you meet the requirements mentioned above, including the location preference and digital marketing certification.</p>\n<p><strong>Contact Information:</strong> jobs@ferns-it.com</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>",
        "tags": [
            "0-1 Year",
            "Digital Marketing",
            "Social Media",
            "SEO"
        ],
        "summary": "Ferns IT Solutions is looking for a Digital Marketing Executive to execute campaigns and manage social media. The ideal candidate will have 0-1 years of experience."
    },
    {
        "job_title": "L2 Technical Support Associate (1 yr - 2 Yrs max)",
        "company": "Gemini Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21944",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>L2 Technical Support Associate</h2>\n<p><strong>GEMINI SOFTWARE SOLUTIONS (P) Ltd</strong>\n414 - 415, NILA, TECHNOPARK, TRIVANDRUM , 685581\n<a href=\"http://www.GeminiSoftware.com\">http://www.GeminiSoftware.com</a></p>\n<p><strong>Contact Email:</strong> careers@geminisoftware.com</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>\n<p>We are seeking 2 enthusiastic Technical Support personnel with basic .NET &amp; MS SQL development exposure within 1 to 1.5 years of experience to join our dynamic team. The successful candidate will be responsible for technically supporting client queries as well as assisting development team in maintaining high-quality software applications using the .NET framework.</p>\n<p>The ideal candidate should have good communication skills, a solid understanding of software development principles, excellent problem-solving skills, and the ability to work both independently and collaboratively in a fast-paced environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Provide technical support and assistance to end-users.</li>\n<li>Troubleshoot, debug, and resolve issues in existing software applications.</li>\n<li>Support, develop, test, and maintain software applications using the .NET Core framework.</li>\n<li>Document software designs, processes, and procedures.</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Write clean, scalable, and maintainable code following best practices.</li>\n<li>Participate in code reviews to ensure code quality and adherence to coding standards.</li>\n</ul>\n<p><strong>Qualifications and Experience:</strong></p>\n<ul>\n<li><strong>Education:</strong> Bachelor’s degree in computer science, engineering, or a related field.</li>\n<li><strong>Experience:</strong> 1 Year in software development or technical support.</li>\n<li>Added advantage for candidates who have experience in Banking Domain.</li>\n</ul>\n<p><strong>Preferred Skills/Key Skills:</strong></p>\n<ul>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Good communication and interpersonal skills.</li>\n<li>Working knowledge in C#, ASP.NET Core, and REST API.</li>\n<li>Working knowledge in SQL Server programming.</li>\n<li>Working knowledge of front-end technologies such as HTML, CSS, and JavaScript.</li>\n<li>Familiarity with microservices architecture.</li>\n<li>Experience with unit testing frameworks.</li>\n<li>Understanding of DevOps principles and practices.</li>\n<li>Understanding of object-oriented programming principles.</li>\n</ul>\n<p>Please note that we are looking for skilled candidates who have from 1.0 to 1.5 years of experience only.</p>",
        "tags": [
            "1-2 Years",
            ".NET Core",
            "SQL Server",
            "C#"
        ],
        "summary": "Seeking a Technical Support Associate to provide support and maintain .NET applications. Requires 1-2 years experience with .NET, SQL Server, and strong problem-solving skills."
    },
    {
        "job_title": "Customer Support executive",
        "company": "Acharya Panchakarma And Traditional Kerala Ayurveda Private Limited",
        "url": "https://technopark.org/job-details/21943",
        "location": "Technopark",
        "closing_date": "22 Jul 2025",
        "job_description": "<h2>Customer Support Executive</h2>\n<p><strong>Acharya Panchakarma and Traditional Kerala Ayurveda Private Limited</strong>\nPhase 4, Kabani Building Second Floor, Technocity, Trivandrum, 695316\n<a href=\"https://socialwings.in\">https://socialwings.in</a></p>\n<p><strong>Closing Date:</strong> 22, July 2025\n<strong>Job Published:</strong> 18, July 2025\n<strong>Contact Email:</strong> hrsocialwings@gmail.com</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a dedicated and customer-focused Customer Support Executive to join our team. The ideal candidate will be responsible for managing customer queries and complaints, providing product and service information, and resolving issues through chat, phone, and email support. You will play a key role in ensuring customer satisfaction and maintaining strong relationships with clients.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Excellent verbal and written communication skills in English and Hindi.</li>\n<li>Strong problem-solving abilities and conflict resolution skills.</li>\n<li>Good typing speed with attention to detail for handling chat-based inquiries.</li>\n<li>Ability to work well under pressure and manage multiple tasks efficiently.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Customer Support",
            "Communication Skills",
            "Problem-solving"
        ],
        "summary": "Seeking a Customer Support Executive to manage queries and provide product information via chat, phone, and email. Must ensure customer satisfaction and maintain client relationships."
    },
    {
        "job_title": "Software Tester",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/21942",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Quality Engineer</h2>\n<p><strong>Company:</strong> ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</p>\n<p><strong>Location:</strong> Technopark, Kazhakoottam, Trivandrum (On-site)</p>\n<p><strong>Contact:</strong> recruitment@ateamsoftsolutions.com</p>\n<p><strong>About Us:</strong></p>\n<p>ATEam Soft Solutions delivers innovative software solutions to global clients. We are hiring a passionate Software Tester to ensure top-notch product quality.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Test web and mobile applications.</li>\n<li>Perform API testing using POSTMAN.</li>\n<li>Write and execute test cases from test plans.</li>\n<li>Identify, document, and track bugs.</li>\n<li>Conduct regression, smoke, functional, and system testing.</li>\n<li>Collaborate with developers and transition to automation testing.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>2+ years in software testing.</li>\n<li>Expertise in POSTMAN and STLC.</li>\n<li>Experience in GUI automation (Selenium/Cypress).</li>\n<li>SQL for database testing.</li>\n<li>Knowledge of performance and security testing.</li>\n</ul>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Immediate Candidates</strong></p>\n<p><strong>Closing Date:</strong> 31, July 2025</p>\n<p><strong>Job Published:</strong> 18, July 2025</p>",
        "tags": [
            "2+ Years",
            "POSTMAN",
            "SQL",
            "Selenium/Cypress"
        ],
        "summary": "ATEam Soft Solutions is seeking a Quality Engineer with 2+ years of experience. The role involves testing web/mobile applications and collaborating with developers."
    },
    {
        "job_title": "Data Manger/Data Architect",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21936",
        "location": "Technopark",
        "closing_date": "24 Jul 2025",
        "job_description": "<h2>Data Manager/Data Architect</h2>\n<p><strong>Way.com</strong> is seeking a Data Manager/Data Architect to transform the car ownership experience. As the leading Auto Super App in the U.S., Way.com empowers millions of drivers to save on everything from insurance and parking to vehicle maintenance and roadside assistance. Their enterprise solutions also deliver impactful results for cities, fleet operators, and major organizations nationwide.</p>\n<p><strong>Role Overview:</strong></p>\n<p>In this role, you will:</p>\n<ul>\n<li>Design, build, and maintain scalable, secure, and high-performance data models, schemas, and infrastructure.</li>\n<li>Lead and mentor a skilled team of data engineers, analysts, and cross-functional collaborators, fostering a culture of innovation and excellence.</li>\n<li>Translate business and technical requirements into scalable, efficient data solutions in collaboration with product, engineering, and business teams.</li>\n<li>Evaluate and manage data platforms, tools, and technologies in alignment with the company’s long-term data strategy.</li>\n<li>Monitor data systems to ensure performance, availability, and efficiency throughout the entire data lifecycle.</li>\n<li>Implement and enforce data governance policies while ensuring compliance with relevant data privacy laws and regulations.</li>\n<li>Provide strategic direction and thought leadership for data-driven initiatives that support executive-level decision-making.</li>\n<li>Advocate for data best practices and drive cross-departmental alignment on data initiatives.</li>\n<li>Regularly report to leadership on project status, risks, and blockers, ensuring timely issue resolution and project delivery.</li>\n</ul>\n<p><strong>Preferred Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, Data Science, or a related field.</li>\n<li>8+ years of professional experience in database development, data modeling, and architectural design.</li>\n<li>Demonstrated success in managing teams or leading complex technical projects.</li>\n<li>Relevant certifications such as CDMP, TOGAF, or equivalent are highly desirable.</li>\n<li>Strong foundation in RDBMS principles, with hands-on experience in both relational and NoSQL database technologies.</li>\n<li>Experience in the Networking or Security domain is a plus.</li>\n<li>Practical expertise in API consumption and multi-tenant database design.</li>\n<li>Proficiency in tools and technologies such as Oracle, MySQL, Cassandra, Talend, ETL tools, Hadoop, and more.</li>\n<li>In-depth knowledge of database security, compliance practices, and regulatory frameworks.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Proven leadership and team management capabilities with a focus on mentoring, motivation, and team growth.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication skills with the ability to convey complex technical concepts to both technical and non-technical stakeholders.</li>\n<li>Exceptional attention to detail to maintain high standards in performance, accuracy, and security within system architecture.</li>\n<li>Ability to balance leadership duties with technical execution while managing competing priorities.</li>\n<li>Effective project and stakeholder management skills, focused on achieving measurable business outcomes.</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 24, July 2025\n<strong>Job Published:</strong> 18, July 2025</p>",
        "tags": [
            "8+ Years",
            "Database Development",
            "Data Modeling",
            "Team Management"
        ],
        "summary": "Way.com is seeking a Data Manager/Data Architect to design and maintain data infrastructure. The role involves leadership, data governance, and strategic decision-making for data-driven initiatives."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21935",
        "location": "Technopark",
        "closing_date": "24 Jul 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p>Way.Com India Pvt Ltd is seeking a dynamic Business Development Manager to join our ambitious sales team. If you are passionate about building strong client relationships and driving growth through strategic outreach, this is the perfect opportunity for you.</p>\n<p><strong>Why Work With Us?</strong></p>\n<ul>\n<li>Innovate &amp; Inspire – Contribute to revolutionizing mobility with forward-thinking, tech-driven solutions.</li>\n<li>Collaborate &amp; Create – Be part of a vibrant team that values innovation, collaboration, and bold ideas.</li>\n<li>Rewarding Compensation – Enjoy a competitive salary and perks package that recognizes your performance and impact.</li>\n<li>Grow With Us – Access continuous learning and development to fuel your career growth.</li>\n<li>Make a Difference – Be a key player in shaping solutions that transform the mobility landscape and everyday experiences.</li>\n</ul>\n<p><strong>Your Role &amp; Responsibilities</strong></p>\n<p>As our Business Development Manager, your key responsibilities will include:</p>\n<ul>\n<li>Proactively identifying and engaging potential clients through outbound calls, emails, and social media to qualify new leads.</li>\n<li>Delivering impactful product demonstrations that highlight our value proposition to prospective customers.</li>\n<li>Maintaining accurate and up-to-date CRM records to ensure seamless follow-up and effective pipeline management.</li>\n<li>Achieving and exceeding sales goals and KPIs, playing a pivotal role in driving company revenue.</li>\n<li>Nurturing relationships with existing clients to foster loyalty, repeat business, and valuable referrals.</li>\n<li>Compiling and presenting detailed sales reports and forecasts to inform leadership and guide strategic planning.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Proven experience in B2B sales with a strong track record of meeting or exceeding targets.</li>\n<li><strong>5–8 years of sales experience</strong>, with prior exposure to the e-commerce sector being a significant plus.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong negotiation and relationship management capabilities.</li>\n<li>Self-motivated, goal-driven, and able to work independently with minimal supervision.</li>\n<li>Proficiency in CRM software (e.g., Zoho) and Microsoft Office Suite.</li>\n<li>Resilient and positive in the face of rejection, with a strong ability to bounce back.</li>\n<li>Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Way Dot Com (P) Ltd\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com\nContact Email: careers@way.com</p>",
        "tags": [
            "5-8 Years",
            "B2B Sales",
            "CRM Software",
            "E-commerce"
        ],
        "summary": "Seeking a Business Development Manager to drive growth through client engagement and strategic outreach. The role involves achieving sales goals, nurturing client relationships, and providing insightful sales reports."
    },
    {
        "job_title": "Lead Python AWS Developer (SQL, AWS)",
        "company": "Experion Technologies (I) (P) Ltd",
        "url": "https://technopark.org/job-details/21934",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Lead Python AWS Developer</h2>\n<p><strong>Experion Technologies</strong> is seeking a Lead Python Developer with strong knowledge in PostgreSQL to join our dynamic team. The ideal candidate will have a strong background in Python programming and web application development, with a focus on utilizing AWS services for building scalable and efficient solutions. Responsible for delivering senior-level innovative, compelling, coherent software solutions for our consumer, internal operations, and value chain constituents across a wide variety of enterprise applications through the creation of discrete business services and their supporting components.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and deliver solutions that meet business line and enterprise requirements.</li>\n<li>Lead a team of Python developers, providing technical guidance, mentorship, and support in project execution.</li>\n<li>Participate in rapid prototyping and POC development efforts.</li>\n<li>Advance overall enterprise technical architecture and implementation best practices.</li>\n<li>Assist in efforts to develop and refine functional and non-functional requirements.</li>\n<li>Participate in iteration and release planning.</li>\n<li>Perform functional and non-functional testing.</li>\n<li>Inform efforts to develop and refine functional and non-functional requirements.</li>\n<li>Demonstrate knowledge of, adherence to, monitoring and responsibility for compliance with state and federal regulations and laws as they pertain to this position.</li>\n<li>Produce high-quality, properly functioning deliverables the first time.</li>\n<li>Deliver work product according to established deadlines.</li>\n<li>Estimate tasks with a level of granularity and accuracy commensurate with the information provided.</li>\n<li>Work collaboratively in a small team.</li>\n<li>Excel in a rapid iteration environment with short turnaround times.</li>\n<li>Deal positively with high levels of uncertainty, ambiguity, and shifting priorities.</li>\n<li>Accept a wide variety of tasks and pitches in wherever needed.</li>\n<li>Constructively present, discuss and debate alternatives. Takes shared ownership of the product.</li>\n<li>Communicate effectively both verbally and in writing.</li>\n<li>Take direction from team leads and upper management.</li>\n<li>Ability to work with little to no supervision while performing duties.</li>\n</ul>\n<p><strong>Skills and Competencies:</strong></p>\n<ul>\n<li>Architect, design, and implement high-performance and scalable Python back-end applications.</li>\n<li>Proficient in Python programming language to develop backend services and APIs.</li>\n<li>Experience with any web frameworks such as FastAPI/Flask/Django for building RESTful APIs.</li>\n<li>Exposure in Utility domain is an advantage (Metering Services).</li>\n<li>Experience in AWS services such as API Gateway, Lambda, Step functions and S3.</li>\n<li>Knowledge in Implementing authentication and authorization mechanisms using AWS Cognito and other relevant services.</li>\n<li>Good understanding of databases Including PostgreSQL, MongoDB, AWS Aurora, DynamoDB.</li>\n<li>Experience in automated CI/CD implementation using Terraform is required.</li>\n<li>Deep understanding of one or more source/version control systems (GIT/Bitbucket).</li>\n<li>Develop branching and merging strategies.</li>\n<li>Working understanding of Web API, REST, JSON etc.</li>\n<li>Good understanding of unit test creation.</li>\n<li>In-depth knowledge of Oracle/PostgreSQL Database architecture and components.</li>\n<li>Strong SQL and PL/SQL or PL/pgSQL programming skills for querying, data manipulation, and stored procedure development.</li>\n<li>Proficiency in writing and maintaining PL/SQL or PL/pgSQL code, including procedures, functions, packages, and triggers.</li>\n<li>Strong understanding of PL/SQL or PL/pgSQL syntax, data types, and control structures.</li>\n<li>Mastery of SQL for querying and manipulating data in Oracle databases.</li>\n<li>Knowledge of complex SQL queries, joins, and subqueries.</li>\n<li>Familiarity with database design principles and data modeling.</li>\n<li>Expertise in optimizing PL/SQL or PL/pgSQL code and SQL queries for performance.</li>\n<li>Knowledge of query optimization techniques, indexing, and execution plan analysis.</li>\n<li>Ability to work with database designers to implement efficient schema structures.</li>\n<li>Bachelor's Degree is required, and/or a minimum of four (4) + related work experience.</li>\n<li>To adhere to the Information Security Management policies and procedures.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Contact Email: durga.parthasarathy@experionglobal.com</p>\n<p><strong>Closing Date:</strong> 18, Aug 2025</p>",
        "tags": [
            "6-9 Years",
            "Python",
            "SQL",
            "AWS"
        ],
        "summary": "Experion Technologies is hiring a Lead Python AWS Developer with expertise in Python, SQL, and AWS. This role involves leading a team and developing scalable solutions."
    }
]