[
    {
        "job_title": "INTERNSHIP- WALK-IN INTERVIEW RHCE Certified Linux System Engineer (Fresher) @10 Nov 2025",
        "company": "Armia Systems Pvt. Ltd",
        "url": "https://infopark.in/company-jobs/details/20996/3",
        "location": "Infopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>Internship: RHCE Certified Linux System Engineer (Fresher) - Walk-In Interview</h2>\n<p><strong>Join Armia Systems for an exciting internship opportunity!</strong></p>\n<p><strong>Walk-in Interview Details:</strong>\n*   <strong>Date:</strong> November 10, 2025 (Monday)\n*   <strong>Time:</strong> 10:00 AM – 5:00 PM\n*   <strong>Venue:</strong> Armia Systems, 3rd Floor, Jyothirmaya Building, Infopark Phase 2, Kochi</p>\n<p><strong>Job Specification:</strong>\n*   Candidates must be RHCE certified or currently pursuing RHCE certification.\n*   Possess a strong understanding of Linux systems.\n*   Basic networking and shell scripting knowledge is required.\n*   Familiarity with installation, troubleshooting, and server management.\n*   A passion for learning and exploring Linux technologies.</p>\n<p><strong>Internship Benefits:</strong>\n*   Guidance from senior Linux engineers.\n*   Internship certificate upon completion.\n*   Pre-placement offer for top performers.</p>\n<p><strong>Documents to Bring:</strong>\n*   Updated Resume\n*   ID Proof</p>\n<p><strong>Internship Details:</strong>\n*   <strong>Type:</strong> Work-from-office internship\n*   <strong>Stipend:</strong> Unpaid during the internship period\n*   <strong>Opportunity:</strong> Full-time salaried job offer for shortlisted candidates after successful completion.</p>\n<p><strong>Eligibility:</strong>\n*   Linux Engineer – Fresher (RHCE Certified / currently pursuing the same course)</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at athira.m@armiasystems.com</p>",
        "tags": [
            "Fresher",
            "RHCE",
            "Linux",
            "Shell Scripting"
        ],
        "summary": "Internship for RHCE-certified or pursuing Linux System Engineers. Offers hands-on experience, guidance, and a potential full-time job offer after successful completion."
    },
    {
        "job_title": ".Net Core Developer",
        "company": "Emsyne Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/20982/76",
        "location": "Infopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>.Net Core Developer</h2>\n<p>We are seeking a .NET Core Developer with 2-4 years of hands-on experience to join our team. The ideal candidate will be responsible for developing and maintaining applications using modern .NET technologies.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain applications using .NET Core, C#, and ASP.NET Core.</li>\n<li>Design, develop, and consume RESTful APIs and web services.</li>\n<li>Implement data access layers using Entity Framework Core or similar ORM frameworks.</li>\n<li>Utilize version control systems like Git for code management.</li>\n<li>Collaborate with cross-functional teams in an Agile development environment.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>2-4 years of hands-on experience in developing applications using .NET Core, C#, and ASP.NET Core.</li>\n<li>Strong experience in developing and consuming RESTful APIs and web services.</li>\n<li>Experience with Entity Framework Core or other ORM frameworks.</li>\n<li>Familiarity with version control systems such as Git.</li>\n<li>Good understanding of software development life cycle (SDLC), Agile methodologies, and CI/CD practices.</li>\n<li>Strong problem-solving, debugging, and troubleshooting skills.</li>\n</ul>\n<p><strong>Nice to have:</strong></p>\n<ul>\n<li>Hands-on experience with JavaScript, HTML5, CSS3, and Angular.</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@emsyne.com</p>",
        "tags": [
            "2-4 Years",
            ".NET Core",
            "C#",
            "ASP.NET Core"
        ],
        "summary": ".NET Core Developer with 2-4 years experience in C#, ASP.NET Core, and RESTful APIs. Familiarity with ORM, Git, and Agile methodologies is required. Apply at jobs@emsyne.com."
    },
    {
        "job_title": "Software Test Engineer – Fresher",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20979/85",
        "location": "Infopark",
        "closing_date": "11 Nov 2025",
        "job_description": "<h2>Software Test Engineer – Fresher</h2>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a global technology services and solutions company with over 17 years of experience providing high-quality end-to-end IT solutions and services worldwide. They focus on Digital Transformation, understanding evolving industrial scenarios, investment priorities, and technology disruption.</p>\n<p>Techversant offers expertise and consultation in various technology domains including:\n- ColdFusion\n- Python\n- Java\n- .NET\n- Node JS\n- Ruby on Rails\n- Golang\n- PHP\n- Artificial Intelligence\n- Blockchain\n- iOS\n- Android\n- Flutter\n- React Native\n- Angular\n- React\n- Vue</p>\n<p>They cater to diverse industry verticals globally.</p>\n<p><strong>What’s Important to Us:</strong></p>\n<p>We are seeking passionate and motivated Software Test Engineers (Freshers) who have recently graduated in IT or Computer Science and have completed software testing training. The ideal candidate will possess a strong interest in quality assurance, excellent analytical and problem-solving skills, and strong communication abilities. A positive attitude and a desire to learn are crucial for success.</p>\n<p>Candidates with ISTQB Foundation Level Certification will be given preference.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Understand software requirements and prepare detailed test scenarios and test cases.</li>\n<li>Perform manual testing to identify and document defects.</li>\n<li>Assist in test execution, regression testing, and defect verification.</li>\n<li>Collaborate with developers and other QA team members to ensure software quality.</li>\n<li>Learn and adapt to testing tools, automation frameworks, and best practices.</li>\n<li>Ensure testing activities align with project timelines and quality standards.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Educational Qualification:</strong>\n- Bachelor’s degree (B.Tech / B.E / B.Sc / BCA / M.Sc / MCA) in Computer Science, Information Technology, or a related field.</p>\n<p><strong>Technical Skills &amp; Knowledge:</strong>\n- Good understanding of Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC).\n- Basic knowledge of testing concepts, test case design, and defect management.\n- Exposure to manual testing (automation basics are preferred).\n- Strong analytical, logical, and problem-solving skills.\n- Good verbal and written communication skills.\n- Positive attitude, eagerness to learn, and ability to work effectively in a team.</p>\n<p><strong>Added Advantage:</strong></p>\n<ul>\n<li>ISTQB Foundation Level Certification (preferred).</li>\n<li>Exposure to any testing tools (e.g., JIRA, Postman, Selenium) during training or academic projects.</li>\n<li>Basic programming knowledge (in Java, Python, or JavaScript).</li>\n<li>Internship or project experience in software testing.</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<p>0–1 year (2022 pass-out and above)</p>\n<p><strong>Location:</strong></p>\n<p>Trivandrum, Kerala (Onsite)</p>\n<p><strong>How to Apply:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "0-1 Year",
            "Manual Testing",
            "Software Testing",
            "ISTQB"
        ],
        "summary": "Seeking passionate Software Test Engineers (Freshers) with IT/CS degrees and testing training. Responsibilities include manual testing, defect identification, and collaboration. ISTQB certification is a plus."
    },
    {
        "job_title": "Video Production & Social Media Specialist",
        "company": "Toobler Technologies Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/20997/57",
        "location": "Infopark",
        "closing_date": "13 Nov 2025",
        "job_description": "<h2>Video Production &amp; Social Media Specialist</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Conceptualize, plan, and execute content strategies across Instagram, YouTube, and other platforms.</li>\n<li>Edit short-form and long-form videos that maintain attention and drive engagement.</li>\n<li>Identify and leverage social media trends and viral formats to enhance visibility.</li>\n<li>Manage social media pages, posting schedules, captions, and audience interaction.</li>\n<li>Collaborate with the marketing team to produce impactful ad creatives and campaign visuals.</li>\n<li>(Optional) Capture original content with available equipment when needed.</li>\n</ul>\n<p><strong>Must Have:</strong></p>\n<ul>\n<li>Strong video editing skills (Premiere Pro, After Effects, DaVinci Resolve, or CapCut).</li>\n<li>Understanding of social media algorithms and performance metrics.</li>\n<li>Creative and strategic thinking with a passion for visual storytelling.</li>\n<li>Deep awareness of internet culture, humor, and trends.</li>\n<li>Excellent communication and time management skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at athira.s@toobler.com</p>",
        "tags": [
            "0-1 Years",
            "Video Editing",
            "Social Media Marketing",
            "Content Strategy"
        ],
        "summary": "Seeking a Video Production & Social Media Specialist to create engaging content for platforms like Instagram and YouTube. Must have strong editing skills and social media trend awareness."
    },
    {
        "job_title": "SOC Lead / Senior Consultant Specialist",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20975/4",
        "location": "Infopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>SOC Lead / Senior Consultant Specialist</h2>\n<p><strong>Role Overview</strong>\nThe SOC Lead serves as a senior member of the Monitoring and Threat Detection function. This role focuses on high-quality incident triage, technical escalation management, continuous improvement of detection capabilities, and leading incident analysis across enterprise-wide environments. The SOC Lead mentors L1/L2 analysts, ensures SLA compliance, and drives process innovation within the SOC.</p>\n<p><strong>Key Responsibilities</strong>\n- Lead deeper security investigations (L2/L3) and advanced triage of escalated alerts across SIEM, EDR, and email security platforms.\n- Collaborate with Threat Detection, Incident Response, and Threat Hunting teams to validate and escalate potential threats.\n- Oversee quality assurance of security tickets and ensure accurate root cause and kill chain identification.\n- Manage the design and optimization of detection rules, threat correlation logic, and playbooks within SIEM/SOAR tools.\n- Provide subject matter expertise in high-severity incident response and containment, ensuring coordinated communication with clients and internal stakeholders.\n- Conduct and support Purple Team simulations and threat validation exercises to assess detection efficacy.\n- Mentor and guide SOC analysts, fostering technical growth and enforcing operational discipline.\n- Coordinate with enterprise teams on email and cloud security incidents, leading Proofpoint and Microsoft 365 Defender investigations.\n- Define and maintain documentation including incident response procedures, triage guides, and detection playbooks.\n- Contribute to automation initiatives to reduce repetitive manual work and improve response efficiency.</p>\n<p><strong>Core Skills and Experience</strong>\n- 5–9 years of cybersecurity operations experience, with at least 3–4 years in SOC L2/L3 or senior incident response roles.\n- Hands-on expertise with multiple SIEM platforms (e.g., AWS, Azure Wazuh, Splunk, Log360, Elastic).\n- Proficient with leading EDR tools such as CrowdStrike, Microsoft Defender, SentinelOne, Fortinet.\n- Strong working knowledge of Email Security (TAP, DLP, Threat Response, SPF/DKIM/DMARC) tools such as FortiMail, Microsoft Purview, Proofpoint.\n- Expertise in attack vectors, MITRE ATT&amp;CK mapping, threat analysis, and incident containment strategies.\n- Solid understanding of enterprise infrastructure — networks, firewalls, endpoint platforms, OS (Windows/Linux), and web applications.\n- Excellent knowledge of cloud security operations across Azure, AWS, and Google Cloud.\n- Awareness of major security frameworks: ISO 27001, NIST, CIS, OWASP, and PCI DSS.\n- Functional knowledge of SOAR automation and orchestration workflows.</p>\n<p><strong>Leadership and Delivery</strong>\n- Lead service operations ensuring incident SLAs are consistently met.\n- Conduct regular performance reviews and provide knowledge-sharing sessions to elevate SOC maturity.\n- Liaise with customers to discuss incident outcomes, mitigations, and improvement recommendations.\n- Manage process documentation and enforce consistent global SOC methodologies.</p>\n<p><strong>Desired Certifications</strong>\n- CEH, GCIA, GCIH, CISSP, or equivalent cybersecurity certifications.\n- Vendor-specific credentials (Microsoft, Proofpoint, or SIEM/EDR certifications) preferred.</p>\n<p><strong>Additional Attributes</strong>\n- Strong analytical, investigative, and documentation skills.\n- Excellent communication and presentation abilities.\n- Self-driven with ability to manage multiple escalations under pressure.\n- Flexible to work in a 24x7 rotational environment if required.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at merin.cb@arttechgroup.com</p>",
        "tags": [
            "5+ Years",
            "SIEM",
            "EDR",
            "Incident Response"
        ],
        "summary": "Senior SOC Lead for Monitoring and Threat Detection. Drives incident triage, detection, and mentoring. Requires 5-9 years of cybersecurity experience."
    },
    {
        "job_title": "Digital Marketing Executive ( Fresher)",
        "company": "Mantra IT Solutions",
        "url": "https://infopark.in/company-jobs/details/20976/383",
        "location": "Infopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Digital Marketing Executive</h2>\n<p><strong>Company:</strong> Mantra IT Solutions</p>\n<p><strong>Job Summary:</strong>\nWe are looking for a Digital Marketing Executive to join our dynamic team. This role is suitable for freshers and experienced candidates. The executive will assist in planning and executing digital marketing campaigns across platforms like Google Ads, Meta (Facebook/Instagram), and others. Collaboration with design and content teams for creative materials and ad copies, performance monitoring via analytics tools, and reporting are key aspects of the role. Additionally, the executive will conduct market research and support email and WhatsApp marketing campaigns.</p>\n<p><strong>Key Responsibilities:</strong>\n- Assist in planning and executing digital marketing campaigns across Google Ads, Meta (Facebook/Instagram), and other platforms.\n- Coordinate with the design and content teams to develop creatives and ad copies.\n- Track and analyze campaign performance using tools such as Google Analytics and prepare performance reports.\n- Conduct competitor research and market analysis to refine strategies.\n- Support email and WhatsApp marketing initiatives when required.</p>\n<p><strong>Key Requirements:</strong>\n- Freshers with a basic understanding of digital marketing concepts are encouraged to apply.\n- Experienced candidates (up to 2 years) in digital marketing will be given preference.\n- Basic knowledge of Google Ads, Meta Ads Manager, and SEO principles.\n- Familiarity with Google Analytics, Google Tag Manager (GTM), and Meta Business Suite is an advantage.\n- Strong communication and coordination skills.\n- Ability to multitask and meet project timelines effectively.</p>\n<p><strong>Qualifications:</strong>\n- A degree or certification in Digital Marketing, Marketing, or related fields is preferred.\n- Google, HubSpot, or Meta certifications are an added advantage.\n- Passion for digital trends, creativity, and continuous learning.</p>\n<p><strong>How to Apply:</strong>\nInterested candidates are requested to send their updated resume along with a portfolio (if available) to hr@mantraitsolutions.in.</p>\n<p>Alternatively, you can apply directly through the Careers section on our website: 🌐 https://mantraitsolutions.in</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@mantraitsolutions.in.</p>",
        "tags": [
            "0-2 Years",
            "Digital Marketing",
            "Google Ads",
            "Meta Ads"
        ],
        "summary": "Seeking a Digital Marketing Executive to execute campaigns on Google and Meta. Responsibilities include analytics, reporting, and market research. Ideal for freshers or those with up to 2 years of experience."
    },
    {
        "job_title": "Mern Stack Intern",
        "company": "Vortexen Dynamics",
        "url": "https://infopark.in/company-jobs/details/21003/411",
        "location": "Infopark",
        "closing_date": "15 Nov 2025",
        "job_description": "<h2>MERN Stack Intern</h2>\n<p><strong>Job Opening:</strong> Software Engineer Trainee &amp; QA Trainee (On-site Internship, Infopark)</p>\n<p><strong>Positions Available:</strong>\n*   4 Software Engineer Trainees\n*   1 QA Trainee</p>\n<p><strong>Internship Details:</strong>\n*   <strong>Duration:</strong> 6-month on-site internship\n*   <strong>Location:</strong> Infopark office\n*   <strong>Stipend:</strong> Travel allowance only</p>\n<p><strong>Required Skills:</strong>\n*   React\n*   Next.js\n*   Node.js\n*   Version control (Git)\n*   Strong problem-solving abilities</p>\n<p><strong>Requirements:</strong>\n*   Must bring own system (laptop)</p>\n<p><strong>What We Provide:</strong>\n*   GitHub Codespaces access\n*   Dedicated cabin and technical setup</p>\n<p><strong>Opportunities:</strong>\n*   Top performers may receive a permanent job offer.\n*   Internship completion certificate for all interns.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at developer@vortexen.com</p>",
        "tags": [
            "0-1 Years",
            "React",
            "Node.js",
            "Next.js"
        ],
        "summary": "Seeking MERN Stack Interns for a 6-month on-site program at Infopark. Opportunity for high performers to secure a permanent role."
    },
    {
        "job_title": "Q and A Intern",
        "company": "Vortexen Dynamics",
        "url": "https://infopark.in/company-jobs/details/21004/411",
        "location": "Infopark",
        "closing_date": "15 Nov 2025",
        "job_description": "<h1>Job Opening: Software Engineer Trainees &amp; QA Trainee (On-site Internship, Infopark)</h1>\n<p><strong>Positions Available:</strong>\n*   4 Software Engineer Trainees\n*   1 QA Trainee</p>\n<p><strong>Internship Details:</strong>\n*   <strong>Duration:</strong> 6-month on-site internship\n*   <strong>Location:</strong> Infopark office\n*   <strong>Stipend:</strong> Travel allowance only</p>\n<h2>Required Skills:</h2>\n<ul>\n<li>React</li>\n<li>Next.js</li>\n<li>Node.js</li>\n<li>Version control (Git)</li>\n<li>Strong problem-solving abilities</li>\n</ul>\n<h2>Requirements:</h2>\n<ul>\n<li>Must bring your own system (laptop)</li>\n</ul>\n<h2>What We Provide:</h2>\n<ul>\n<li>GitHub Codespaces access</li>\n<li>Dedicated cabin and technical setup</li>\n</ul>\n<h2>Opportunities:</h2>\n<ul>\n<li>Top performers may receive a permanent job offer.</li>\n<li>Internship completion certificate for all interns.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at developer@vortexen.com.</p>",
        "tags": [
            "Internship",
            "QA",
            "React",
            "Node.js"
        ],
        "summary": "Seeking a QA Trainee for a 6-month on-site internship. Requires React, Next.js, Node.js, Git, and own laptop. Top performers may get a job offer."
    },
    {
        "job_title": "FMCG Product Marketing & Operations.",
        "company": "Bramma IT Solutions",
        "url": "https://infopark.in/company-jobs/details/20990/443",
        "location": "Infopark",
        "closing_date": "15 Nov 2025",
        "job_description": "<h2>FMCG Product Marketing &amp; Operations</h2>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in planning and executing marketing strategies for FMCG products.</li>\n<li>Support daily operations and coordination within the marketing team.</li>\n<li>Contribute to product promotions, market research, and sales initiatives.</li>\n</ul>\n<h3>Eligibility Criteria:</h3>\n<ul>\n<li>MBA graduate (Freshers are encouraged to apply).</li>\n<li>Strong interest in marketing and operations.</li>\n<li>Excellent communication and teamwork skills.</li>\n<li>Eagerness to learn and grow in a dynamic environment.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at bramma2.ppc@gmail.com</p>",
        "tags": [
            "0-1 Years",
            "Marketing",
            "Operations",
            "FMCG"
        ],
        "summary": "Seeking an MBA graduate for an FMCG Product Marketing & Operations role. Responsibilities include marketing strategy execution, daily operations support, and sales initiatives. Freshers welcome."
    },
    {
        "job_title": "AI/ML Engineer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20977/85",
        "location": "Infopark",
        "closing_date": "18 Nov 2025",
        "job_description": "<h2>AI/ML Engineer</h2>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a global technology services and solution’s company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 17 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, Node JS, Ruby on Rails, Golang, PHP, Artificial Intelligence, Blockchain, IOS, Android, Flutter, React Native, Angular, React Vue, etc., catering to various industry verticals globally.</p>\n<p><strong>What’s important to us:</strong></p>\n<p>We are seeking experienced AI/ML Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.</li>\n<li>Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs) and diffusion models for a range of use cases involving text, code, and multi-modal data.</li>\n<li>Build Scalable Recommendation Engines: Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.</li>\n<li>Cloud-Native ML Engineering: Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.</li>\n<li>End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.</li>\n<li>Collaborate Across Functions: Work with cross-functional teams including product managers, engineers, and data scientists to translate business goals into AI-powered solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 3 years of experience in building and deploying production-level ML/DL systems.</li>\n<li>Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders.</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Strong understanding of transformer architectures and deep learning model design.</li>\n<li>Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution.</li>\n<li>Expertise in Python programming with a focus on:</li>\n<li>Code optimization and profiling</li>\n<li>Multi-threading and multiprocessing</li>\n<li>Object-oriented programming and design principles</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices.</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Technical Stack:</strong></p>\n<ul>\n<li><strong>Languages:</strong> Excellent understanding of object-oriented concepts and Python.</li>\n<li><strong>ML/DL Frameworks:</strong></li>\n<li>Machine Learning: Scikit-learn, XGBoost, LightGBM</li>\n<li>Deep Learning: PyTorch, TensorFlow, Keras</li>\n<li>GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework</li>\n<li><strong>Cloud &amp; MLOps:</strong> AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes</li>\n<li><strong>Data &amp; Compute:</strong> Apache Spark, BigQuery, RabbitMQ, S3, EC2</li>\n<li><strong>Embedding Stores &amp; Vector Search:</strong> FAISS, Pinecone, ChromaDB</li>\n<li><strong>Orchestration &amp; APIs:</strong> Apache Airflow, Docker Deployment, and FastAPI are a must.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with multi-modal models combining text, vision, or audio.</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct).</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems.</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure).</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field.</li>\n<li>Equivalent practical experience in developing scalable AI solutions will also be considered.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com.</p>",
        "tags": [
            "3+ Years",
            "Python",
            "Generative AI",
            "Cloud-Native ML"
        ],
        "summary": "Seeking an AI/ML Engineer to develop and deploy production-level ML/DL and Generative AI solutions globally. Responsibilities include end-to-end lifecycle ownership and cloud-native deployment."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20978/85",
        "location": "Infopark",
        "closing_date": "18 Nov 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a global technology services and solution's company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 17 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption. We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, Node JS, Ruby on Rails, Golang, PHP, Artificial Intelligence, Blockchain, IOS, Android, Flutter, React Native, Angular, React Vue, etc., catering to various industry verticals globally.</p>\n<p><strong>What’s important to us:</strong>\nWe are seeking experienced AI/ML Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Develop ML and Deep Learning Solutions:</strong> Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.</li>\n<li><strong>Design and Implement Generative AI Systems:</strong> Build and fine-tune Large Language Models (LLMs) and diffusion models for a range of use cases involving text, code, and multi-modal data.</li>\n<li><strong>Build Scalable Recommendation Engines:</strong> Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.</li>\n<li><strong>Cloud-Native ML Engineering:</strong> Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.</li>\n<li><strong>End-to-End ML Lifecycle Ownership:</strong> Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.</li>\n<li><strong>Collaborate Across Functions:</strong> Work with cross-functional teams including product managers, engineers, and data scientists to translate business goals into AI-powered solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 4 years of experience in building and deploying production-level ML/DL systems.</li>\n<li>Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders.</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Strong understanding of transformer architectures and deep learning model design.</li>\n<li>Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution.</li>\n<li>Expertise in Python programming with a focus on:<ul>\n<li>Code optimization and profiling</li>\n<li>Multi-threading and multiprocessing</li>\n<li>Object-oriented programming and design principles</li>\n</ul>\n</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices.</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Technical Stack:</strong></p>\n<ul>\n<li><strong>Languages:</strong> Excellent understanding of object-oriented concepts and Python.</li>\n<li><strong>ML/DL Frameworks:</strong><ul>\n<li>Machine Learning: Scikit-learn, XGBoost, LightGBM</li>\n<li>Deep Learning: PyTorch, TensorFlow, Keras</li>\n<li>GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework</li>\n</ul>\n</li>\n<li><strong>Cloud &amp; MLOps:</strong> AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes</li>\n<li><strong>Data &amp; Compute:</strong> Apache Spark, BigQuery, RabbitMQ, S3, EC2</li>\n<li><strong>Embedding Stores &amp; Vector Search:</strong> FAISS, Pinecone, ChromaDB</li>\n<li><strong>Orchestration &amp; APIs:</strong> Apache Airflow, Docker Deployment, and FastAPI are a must.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with multi-modal models combining text, vision, or audio.</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct).</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems.</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure).</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field. Equivalent practical experience in developing scalable AI solutions will also be considered.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "4+ Years",
            "Python",
            "Generative AI",
            "Cloud-Native ML"
        ],
        "summary": "Seeking an experienced AI/ML Engineer to drive international business opportunities and develop cutting-edge ML/DL and Generative AI solutions. Responsible for end-to-end model lifecycle ownership and cloud deployment."
    },
    {
        "job_title": "Senior Business Development Manager",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20980/85",
        "location": "Infopark",
        "closing_date": "18 Nov 2025",
        "job_description": "<h2>Senior Business Development Manager</h2>\n<p><strong>About Techversant</strong></p>\n<p>Techversant is a global technology services and solution’s company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 17 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, Node JS, Ruby on Rails, Golang, PHP, Artificial intelligence, Blockchain, IOS, Android, Flutter, React Native, Angular, React Vue, etc., catering to various industry verticals globally.</p>\n<p><strong>What’s important to us:</strong></p>\n<p>Techversant is seeking a Senior Business Development Manager with a successful track record in IT services and solution sales. The ideal candidate will be responsible for driving new client acquisition, exploring untapped markets, forging strategic partnerships, and leading business growth initiatives—both independently and through a team.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Lead New Client Acquisition:</strong> Identify and close new business opportunities in target geographies such as North America, Europe, the Middle East, and APAC.</li>\n<li><strong>Strategic Market Development:</strong> Research and explore emerging markets and industries to expand our service footprint.</li>\n<li><strong>Build Partner Ecosystem:</strong> Identify, engage, and manage alliances/partners to extend our market reach.</li>\n<li><strong>Sales Ownership:</strong> Own the complete sales cycle from lead generation, qualification, proposal creation, negotiation, to closure.</li>\n<li><strong>Consultative Selling:</strong> Understand client challenges and propose tailored solutions using our full stack of services—from custom app development to AI &amp; cloud migration.</li>\n<li><strong>Revenue &amp; Target Management:</strong> Drive consistent pipeline growth and achieve quarterly/annual revenue targets.</li>\n<li><strong>Team Leadership:</strong> Mentor, collaborate with, and coordinate business development executives and pre-sales teams.</li>\n<li><strong>Client Engagement:</strong> Represent the company in client discussions, industry events, and networking opportunities to promote brand and build strong relationships.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>12+ years of experience in IT services/solutions sales with a strong record in new business acquisition.</li>\n<li>Demonstrated ability to independently open new logos and enter new geographies or verticals.</li>\n<li>Deep understanding of IT offerings such as application development, modernization, mobility, cloud, AI, and support services.</li>\n<li>Proven experience in building and managing partner networks.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Responsible for achieving on-boarding targets, sales targets of team as well as individual.</li>\n<li>Ability to work independently with strong lead generation skills.</li>\n<li>In-depth knowledge of social media marketing, content marketing and brand marketing.</li>\n<li>Self-driven, target-oriented, and entrepreneurial mindset.</li>\n<li>Deep understanding of the technology industry, technology trends, and emerging technologies.</li>\n<li>Team building and management skills.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Exposure to global delivery models and offshore/onsite engagement structures.</li>\n<li>Experience using CRM tools like Salesforce or HubSpot.</li>\n<li>Knowledge of RFP processes, bid management, and proposal writing.</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Work with a fast-growing global tech company</li>\n<li>Leadership opportunity with autonomy to drive strategy and execution</li>\n<li>Competitive salary + attractive incentives</li>\n<li>Collaborative and growth-focused work culture</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "12+ Years",
            "IT Services Sales",
            "Business Development",
            "Client Acquisition"
        ],
        "summary": "Senior Business Development Manager to drive client acquisition and market growth in IT services. Responsibilities include sales cycle ownership, partnership building, and team leadership."
    },
    {
        "job_title": "Digital Marketing Intern",
        "company": "Mantra IT Solutions",
        "url": "https://infopark.in/company-jobs/details/20983/383",
        "location": "Infopark",
        "closing_date": "19 Nov 2025",
        "job_description": "<h2>Digital Marketing Intern</h2>\n<p>Mantra IT Solutions is seeking a passionate and creative Digital Marketing Intern to join our team. This internship offers a fantastic chance to learn and gain practical experience in digital marketing.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in planning and executing digital marketing campaigns across platforms like Google Ads, Meta (Facebook/Instagram), and others.</li>\n<li>Collaborate with design and content teams to create compelling creatives and ad copies.</li>\n<li>Monitor campaign performance and contribute to basic reporting.</li>\n<li>Conduct competitor research and market analysis to identify trends.</li>\n<li>Support email and WhatsApp marketing initiatives.</li>\n</ul>\n<h3>Key Requirements:</h3>\n<ul>\n<li>Freshers or recent graduates with a strong interest in digital marketing.</li>\n<li>Basic understanding of Google Ads, Meta Ads Manager, and SEO concepts.</li>\n<li>Familiarity with tools such as Google Analytics, Google Tag Manager (GTM), or Meta Business Suite is a plus.</li>\n<li>Excellent communication and coordination skills.</li>\n<li>Eagerness to learn, attention to detail, and a positive attitude.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor's degree or diploma in Marketing, Digital Marketing, Mass Communication, or a related field.</li>\n<li>A Digital Marketing certification (e.g., Google, HubSpot) is advantageous.</li>\n<li>A genuine passion for digital media, creativity, and innovation.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates should send their updated resume and portfolio (if available) to <strong>hr@mantraitsolutions.in</strong>. </p>\n<p>Alternatively, apply via the Careers section on our website: 🌐 https://mantraitsolutions.in</p>\n<p>If this opportunity fits your career aspirations, please forward your resume to <strong>hr@mantraitsolutions.in</strong>.</p>",
        "tags": [
            "0-1 Years",
            "Google Ads",
            "Meta Ads",
            "Digital Marketing"
        ],
        "summary": "Seeking a Digital Marketing Intern to assist with campaign execution, content creation, and performance monitoring. Opportunity for freshers to gain hands-on experience in digital marketing."
    },
    {
        "job_title": "Trainee - Quality Analyst",
        "company": "NDimensionZ Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/20992/209",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Trainee - Quality Analyst</h2>\n<p><strong>Hiring Freshers !!</strong></p>\n<p><strong>Employment type:</strong> Full time\n<strong>Location:</strong> Kochi</p>\n<h3>WHAT WE ARE LOOKING FOR</h3>\n<p>DimensionZ, a fast-growing, global leader aspirant firm in technology and digital services, is looking for a Quality Analyst to join our team. As a Quality Analyst, you should work diligently to detect and report any issues with our software programs, apps, and websites. As part of your duties, you will perform quality assurance (QA) tests throughout the life cycle of a project, reviewing our products as an end-user would do and reporting any bugs to the development team.</p>\n<h3>RESPONSIBILITIES</h3>\n<ul>\n<li>Conduct post-release/ post-implementation testing QA testing for software programs, apps, and websites.</li>\n<li>Interact with clients analyze their requirements for validity and feasibility, assess the functionality and overall user experience of our products and prepare test scenarios.</li>\n<li>Detects and tracks software defects, bugs, inconsistencies and usability issues.</li>\n<li>Document any issues and prepare reports on all aspects of the software tests performed, and report back to the design team.</li>\n<li>Participate in design reviews and provide input on requirements, product design, and potential problems.</li>\n<li>Collaborate with cross-functional teams to ensure quality throughout the software development lifecycle.</li>\n</ul>\n<h3>Contact Information</h3>\n<p>For any query, please contact: <strong>0484-6689999</strong></p>\n<p><strong>Note:</strong> Candidates who have completed a course or certification in software testing will be given preference.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>dona.mariam@ndimensionz.com</strong></p>",
        "tags": [
            "Freshers",
            "Quality Assurance",
            "Software Testing",
            "Bug Tracking"
        ],
        "summary": "Seeking a Trainee Quality Analyst to test software, apps, and websites. Responsibilities include detecting bugs, reporting issues, and collaborating with teams."
    },
    {
        "job_title": "Accounting Associate/ Sr. Accounting Associate (US GAAP)",
        "company": "Redux (Network Redux)",
        "url": "https://infopark.in/company-jobs/details/20994/216",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Accounting Associate/Sr. Accounting Associate (US GAAP)</h2>\n<p>This role involves the preparation and maintenance of financial statements in conformity with the Generally Accepted Accounting Principles of the United States (U.S. GAAP). The primary responsibilities include overseeing the day-to-day accounting processes and reviewing the accuracy of the monthly, quarterly, and annual financial statements. Additionally, the position will also be responsible for managing the site POCs or vendors (for accounting purposes) and preparing budgets to control costs and enhance support processes.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Maintain accounting records and ledgers for client entities in accordance with US GAAP.</li>\n<li>Prepare and verify financial statements and ledgers for accuracy and regulatory compliance.</li>\n<li>Handle revenue postings, inventory tracking, receivables, and payables management.</li>\n<li>Apply and uphold internal accounting policies and control procedures.</li>\n<li>Perform reconciliations of bank statements, credit card accounts, and intercompany balances.</li>\n<li>Serve as the primary contact for internal accounting-related inquiries.</li>\n<li>Support monthly and annual closing activities, including journal entry preparation.</li>\n<li>Assist in audit processes by compiling and submitting necessary documentation.</li>\n<li>Ensure adherence to financial compliance standards and support tax-related filings.</li>\n<li>Ensure calculation and compliance of management and bookkeeping fees.</li>\n</ul>\n<h3>Additional Responsibilities</h3>\n<ul>\n<li>Assist with interviewing, hiring, training, and supervising accountants, while ensuring compliance with client policies and relevant laws.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>A bachelor's degree in the accounting domain is necessary. CA, CPA, CMA, ACCA or similar professional qualification from a recognised body within the country or abroad is a bonus but not mandate. Partially qualified candidates with expertise in the necessary domain will also be considered if found apt for the role.</li>\n<li>Candidates should ideally showcase experience/knowledge with the U.S. GAAP (General accounting and taxation).</li>\n<li>2-4 years of progressive accounting experience is preferred (experience in hospitality or food &amp; beverage clients will be helpful but not mandatory).</li>\n<li>Exceptional analytical skills and detail orientation along with excellent written and verbal communication skills to interact with internal associates and external partners.</li>\n<li>Ability to apply advanced problem-solving skills to resolve complex issues and the capability to work with time-bound environments.</li>\n<li>Advanced skills in Microsoft Excel and general ledger applications. Oracle NetSuite experience might be helpful but not mandate; if yes, please state in the application.</li>\n<li>An ideal candidate should be a team leader and a team player at the same time.</li>\n</ul>\n<h3>Application Information</h3>\n<ul>\n<li>Apply at: https://zrec.in/ME4Pj?source=CareerSite</li>\n<li>Share your updated resume with us at: india.hr@redux.co</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "US GAAP",
            "Financial Statements",
            "Microsoft Excel"
        ],
        "summary": "Prepare and maintain financial statements following US GAAP. Oversee daily accounting, review financial reports, manage vendors, and prepare budgets. Requires 2-4 years of experience and strong analytical skills."
    },
    {
        "job_title": "Accounts Payable Associate/Specialist (US GAAP)",
        "company": "Redux (Network Redux)",
        "url": "https://infopark.in/company-jobs/details/20995/216",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Accounts Payable Associate/Specialist (US GAAP)</h2>\n<p>This role manages the full accounts payable cycle across multiple U.S. locations, ensuring accurate invoice processing, timely payments, and vendor communication. The position requires strong attention to detail, the ability to handle high volumes, and compliance with internal policies and financial regulations.</p>\n<h3>Duties &amp; Responsibilities</h3>\n<ul>\n<li>Verify and accurately process invoices for multiple locations across the country.</li>\n<li>Communicate effectively with vendors, property managers, accounting teams, and procurement staff to ensure timely invoice approvals and payments.</li>\n<li>Identify opportunities to enhance efficiency and optimize the accounts payable process through automation, software improvements, or procedural refinements.</li>\n<li>Investigate and resolve discrepancies in invoices, payments, and vendor accounts by working closely with internal teams and vendors.</li>\n<li>Maintain accurate records of invoices, receipts, and payment transactions for auditing and reference purposes.</li>\n<li>Assist in preparing expense reports and support departments with inquiries related to expenses.</li>\n<li>Ensure compliance with financial regulations and internal policies governing accounts payable processes, generating reports as needed for management and auditors.</li>\n<li>Prior experience in Ramp and NetSuite is preferred but not mandatory, but the ability to learn new tools quickly is essential.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor's degree in Accounting, Finance, or a related field is mandatory.</li>\n<li>2-5 years of experience in an Accounts Payable role.</li>\n<li>Ability to manage high invoice volumes and adapt to peak workload periods.</li>\n<li>Strong analytical skills and attention to detail.</li>\n<li>Familiarity with U.S. GAAP (General Accounting).</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Ability to prioritize tasks effectively and collaborate in a team environment.</li>\n</ul>\n<h3>Application Information</h3>\n<ul>\n<li>Apply at: https://zrec.in/IoIH7?source=CareerSite</li>\n<li>Share your updated resume with us at: india.hr@redux.co</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "Accounts Payable",
            "US GAAP",
            "NetSuite"
        ],
        "summary": "Manage accounts payable cycle for multiple US locations, ensuring accurate processing and timely payments. Requires AP experience, US GAAP familiarity, and strong attention to detail."
    },
    {
        "job_title": "Business Development Executive",
        "company": "QC Verify Private Limited",
        "url": "https://infopark.in/company-jobs/details/21005/257",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Business Development Executive (Fresher)</h2>\n<p><strong>Employment Type:</strong> Full-time\n<strong>Internship Period:</strong> 3 Months</p>\n<h3>About the Role:</h3>\n<p>We are seeking a dynamic and enthusiastic Business Development Executive to join our team. This role offers an excellent opportunity for freshers to gain hands-on experience in business growth, client relations, and digital marketing support. You will contribute to lead generation, client management, and marketing initiatives to drive overall organizational growth.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Identify and generate new business leads through research, networking, and online platforms.</li>\n<li>Assist in client acquisition, relationship management, and follow-ups.</li>\n<li>Maintain and update CRM and client databases.</li>\n<li>Support creation of business proposals, presentations, and sales materials.</li>\n<li>Conduct market research, competitor analysis, and prepare trend reports.</li>\n<li>Manage and update company website and social media platforms.</li>\n<li>Support basic on-page and off-page SEO activities.</li>\n<li>Create and manage LinkedIn content – posts, newsletters, and engagement tracking.</li>\n<li>Coordinate with writers or manage blog content (BlogRider experience is a plus).</li>\n<li>Monitor analytics and performance data to support campaign and sales optimization.</li>\n<li>Collaborate with marketing, design, and technical teams for smooth execution of client and marketing projects.</li>\n</ul>\n<h3>Preferred Candidate Profile:</h3>\n<p><strong>Education:</strong> MBA / BBA / Postgraduate in Marketing, Business, or related field.\n<strong>Experience:</strong> Fresher (0–1 year) – internship or academic project experience preferred.</p>\n<p><strong>Skills:</strong></p>\n<ul>\n<li>Basic understanding of sales, marketing, and SEO concepts</li>\n<li>Excellent communication and interpersonal skills</li>\n<li>Good research and analytical abilities</li>\n<li>Organized, detail-oriented, and proactive</li>\n<li>Familiarity with LinkedIn and digital marketing tools</li>\n<li>Ability to maintain and grow client relationships</li>\n<li>Passionate about business development and marketing</li>\n</ul>\n<p><em>(Female candidates preferred)</em></p>\n<h3>How to Apply:</h3>\n<p>Interested candidates should send their resumes to hr@qcverify.com. If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@qcverify.com.</p>",
        "tags": [
            "0-1 Years",
            "Business Development",
            "Digital Marketing",
            "SEO"
        ],
        "summary": "Seeking an enthusiastic Business Development Executive fresher for a full-time role. Gain experience in lead generation, client relations, and digital marketing support."
    },
    {
        "job_title": "Sr.HR Manager",
        "company": "EXACORE IT SOLUTIONS PRIVATE LIMITED",
        "url": "https://infopark.in/company-jobs/details/20991/169",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Sr. HR Manager - Walk-In Interview</h2>\n<p><strong>Date:</strong> 22nd November 2025\n<strong>Time:</strong> 10:00 AM to 2:00 PM\n<strong>Reporting Time:</strong> 9:45 AM</p>\n<p><strong>Venue:</strong>\nExacore IT Solutions\n1st Floor, Indeevaram, INFOPARK Smart Space,\nKoratty, Thrissur – 680 308, Kerala, India</p>\n<p><strong>Contact Number:</strong> 8138916160</p>\n<h3>Position:</h3>\n<p>Sr. HR Manager</p>\n<h3>Qualification:</h3>\n<p>Master’s degree in Human Resources/ Business Administration (MBA-HR preferred)</p>\n<h3>Job Location:</h3>\n<p>Infopark, Koratty</p>\n<h3>Experience:</h3>\n<p>5 to 7+ Years</p>\n<h3>Job Requirements:</h3>\n<ul>\n<li>A Bachelor’s or Master’s degree in Human Resources/Business Administration (MBA-HR preferred).</li>\n<li>5 to 7+ years of HR experience, with at least 5+ years in senior HR roles managing full spectrum HR functions.</li>\n<li>Proven track record in talent acquisition, performance management, employee engagement, HR operations &amp; compliance.</li>\n<li>Strong knowledge of Indian labour laws, ability to lead change, good use of HR metrics/analytics.</li>\n<li>Excellent communication, leadership skills, and interpersonal skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@exacoreitsolutions.com.</p>",
        "tags": [
            "5-7+ Years",
            "Talent Acquisition",
            "Performance Management",
            "Indian Labour Laws"
        ],
        "summary": "Seeking a Sr. HR Manager with 5-7+ years of experience for Infopark, Koratty. Requires full-spectrum HR functions, talent acquisition, and compliance knowledge."
    },
    {
        "job_title": "Database Administrator",
        "company": "Dooth Internet Service Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/20993/438",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>MySQL Server Database Administrator (DBA)</h2>\n<p><strong>Company:</strong> Dooth\n<strong>Location:</strong> Infopark Kochi</p>\n<p><strong>About Us:</strong>\nDooth is a Private Internet Platform built on the principle that privacy is essential to creation and should not be traded online for profit. We protect consumer and business privacy against prying eyes, preventing data from being used against individuals in the Age of Internet of Things.</p>\n<p><strong>Job Overview:</strong>\nWe are seeking a skilled MySQL Server Database Administrator (DBA) with over 5 years of experience to manage and support our Microsoft SQL Server environments. The ideal candidate will be responsible for ensuring the performance, availability, and security of our databases. You will collaborate closely with development and DevOps teams to implement scalable, high-performing solutions. Experience with PostgreSQL administration is a significant advantage.</p>\n<p><strong>Key Responsibilities:</strong>\n- Install, configure, and maintain MySQL database servers across development, testing, and production environments.\n- Monitor database performance, implement tuning strategies, and optimize queries and indexes.\n- Design and manage database backup, recovery, and replication strategies (Master-Slave, Group Replication, or Cluster).\n- Ensure database security, integrity, and availability by implementing access controls, data encryption, and regular audits.\n- Perform database upgrades, patches, and migrations with minimal downtime.\n- Collaborate with developers to design efficient database schemas, stored procedures, and queries.\n- Troubleshoot performance issues, deadlocks, replication delays, and other database-related incidents.\n- Develop and maintain documentation for database architecture, configurations, and processes.\n- Automate routine database tasks using scripting (Bash, Python, or similar).\n- Work closely with DevOps teams for continuous integration and deployment of database changes.</p>\n<p><strong>Required Skills and Qualifications:</strong>\n- Bachelor’s degree in Computer Science, Information Technology, or a related field.\n- 5+ years of experience as a MySQL DBA in a production environment.\n- Strong knowledge of MySQL 5.7/8.0 architecture, configuration, and administration.\n- Proficiency in query optimization and performance tuning.\n- Experience with replication, clustering, and high-availability setups.\n- Hands-on experience with backup/recovery tools (mysqldump, Percona XtraBackup, etc.).\n- Familiarity with Linux environments and shell scripting.\n- Understanding of database security practices and user management.\n- Exposure to cloud platforms (AWS RDS, Google Cloud SQL, Azure Database for MySQL) is a plus.\n- Experience with monitoring tools (Percona Monitoring, Prometheus, Grafana, or Nagios).\n- Strong analytical, problem-solving, and communication skills.</p>\n<p><strong>Preferred Skills:</strong>\n- Experience with PostgreSQL database administration including performance tuning, backup, and replication.\n- Knowledge of NoSQL databases (MongoDB, Redis) is an advantage.\n- Familiarity with automation tools such as Ansible or Terraform.\n- Understanding of CI/CD pipelines and database version control.\n- Experience working in Agile or DevOps environments.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at hrindia@dooth.com.</p>",
        "tags": [
            "5+ Years",
            "MySQL",
            "Database Administration",
            "SQL Server"
        ],
        "summary": "Seeking a MySQL DBA with 5+ years of experience for database management and support. Responsibilities include ensuring performance, availability, and security in SQL Server environments."
    },
    {
        "job_title": "Event Onboarding & Promotion Intern (Freshers -  6months Internship)",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21001/95",
        "location": "Infopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<h2>Event Onboarding &amp; Promotion Intern (6 Months Internship)</h2>\n<p>We are seeking a creative and organized intern to support event onboarding, branding, and promotional activities on our platform. This role offers hands-on experience in event operations and digital engagement.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Research and onboard new events.</li>\n<li>Coordinate with event organizers for necessary details and branding materials.</li>\n<li>Assist in creating and updating event listings on the website.</li>\n<li>Support marketing and promotional activities across various digital platforms.</li>\n<li>Help maintain reports and relevant event documentation.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Currently pursuing a degree in Marketing, Business, Event Management, or a related field.</li>\n<li>Strong communication and coordination skills.</li>\n<li>Demonstrated interest in branding, marketing, and digital engagement.</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Gain practical experience in event operations and branding.</li>\n<li>Receive an internship certificate upon completion.</li>\n<li>Potential opportunity for a full-time position.</li>\n</ul>\n<p><strong>To apply:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com.</p>",
        "tags": [
            "0-1 Years",
            "Event Management",
            "Marketing",
            "Digital Promotion"
        ],
        "summary": "Seeking a creative intern for event onboarding, branding, and promotion. Responsibilities include organizer coordination, listing management, and digital marketing support."
    },
    {
        "job_title": "Event Onboarding & Promotion Executive",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21002/95",
        "location": "Infopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<h2>Event Onboarding &amp; Promotion Executive</h2>\n<p>The Event Onboarding &amp; Promotion Executive will be responsible for identifying, onboarding, managing events and ticketing on the company’s platform. This role involves coordinating with event organizers, ensuring accurate and appealing listings, maintaining brand consistency, and executing promotional activities to maximize event visibility and engagement. The ideal candidate will be proactive, detail-oriented, and passionate about creating impactful brand and event experiences.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Event Sourcing &amp; Onboarding</strong><ul>\n<li>Research, identify, and onboard potential events suitable for listing on the platform.</li>\n<li>Coordinate with event organizers to gather relevant details, creatives, and brand assets.</li>\n<li>Ensure accurate and attractive event listings are created and maintained on the website.</li>\n</ul>\n</li>\n<li><strong>Branding &amp; Content Coordination</strong><ul>\n<li>Work with the design and marketing teams to ensure consistent branding across all event promotions.</li>\n<li>Review event visuals, banners, and promotional content for quality and brand alignment.</li>\n<li>Suggest creative improvements for event presentation and visibility.</li>\n</ul>\n</li>\n<li><strong>Platform &amp; Listing Management</strong><ul>\n<li>Regularly update event listings with new information, images, and schedules.</li>\n<li>Monitor event performance on the platform and provide recommendations to improve visibility.</li>\n</ul>\n</li>\n<li><strong>Promotion &amp; Marketing Support</strong><ul>\n<li>Coordinate digital and social media promotions for listed events.</li>\n<li>Support campaign planning and assist in executing marketing initiatives that enhance event reach.</li>\n</ul>\n</li>\n<li><strong>Communication &amp; Coordination</strong><ul>\n<li>Act as the single point of contact between event organizers and internal teams.</li>\n<li>Maintain strong professional relationships with event partners and ensure smooth operational coordination.</li>\n<li>Participate in organizer meetings, review sessions, and branding discussions.</li>\n</ul>\n</li>\n<li><strong>Reporting &amp; Analysis</strong><ul>\n<li>Track event performance metrics and generate regular reports on engagement, reach, and conversions.</li>\n<li>Suggest data-driven improvements to strengthen event listings and promotional outcomes.</li>\n</ul>\n</li>\n</ul>\n<h3>Key Skills &amp; Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Business Administration, Event Management, or related field.</li>\n<li>0– 1 years of experience in event coordination, marketing, or platform operations.</li>\n<li>Strong communication and relationship management skills.</li>\n<li>Proficiency in digital platforms, online listing tools, and content management systems.</li>\n<li>Eye for detail and aesthetics in branding and promotions.</li>\n<li>Ability to multitask, prioritize, and meet deadlines in a fast-paced environment.</li>\n</ul>\n<h3>Preferred Attributes:</h3>\n<ul>\n<li>A collaborative mindset with strong organizational skills.</li>\n<li>Creative thinking and an understanding of brand tone and visibility.</li>\n<li>Passion for events, marketing, and digital engagement.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com</p>",
        "tags": [
            "0-1 Years",
            "Event Management",
            "Marketing",
            "Platform Operations"
        ],
        "summary": "Seeking an Event Onboarding & Promotion Executive to manage event listings and promotions. Responsibilities include coordinating with organizers and driving event visibility."
    },
    {
        "job_title": "DIGITAL MARKETING/GRAPHIC DESIGNER (MALE CANDIDATES ONLY)",
        "company": "Hyz Ventures Intl (P) Ltd",
        "url": "https://technopark.org/job-details/24931",
        "location": "Technopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>Digital Marketing/Graphic Designer (Male Candidates Only)</h2>\n<p><strong>Company:</strong> HYZ VENTURES INTL (P) Ltd\n<strong>Address:</strong> GE, Ground Floor, Padmanabham, Technopark, Karyavattom P O, TVPM, 695581\n<strong>Website:</strong> http://www.hyzventures.com\n<strong>Closing Date:</strong> 25, Nov 2025\n<strong>Job Published:</strong> 08, Nov 2025\n<strong>Contact Email:</strong> hr@hyzventures.com</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Responsible for the overall layout and product design for a wide range of applications such as advertisements, brochures, websites, and magazines.</li>\n<li>Work with specialized software like Adobe Illustrator and Photoshop to create designs.</li>\n<li>Select fonts, color schemes, and other design elements to create compelling and effective visuals.</li>\n<li>Responsible for Video editing and designing logos.</li>\n<li>SEO for Websites.</li>\n<li>Rectifying errors on Ads Campaigns.</li>\n<li>Posting content on YouTube.</li>\n<li>Work with other professionals like copywriters, editors, and videographers to create a cohesive final product.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Organic posting (Facebook, Instagram, LinkedIn, Twitter/X)</li>\n<li>Paid social media ads (targeted campaigns)</li>\n<li>Social media contests &amp; campaigns</li>\n<li>Paid Advertising (PPC)</li>\n<li>Social media ads (Meta Ads, LinkedIn Ads, etc.)</li>\n<li>Solid knowledge of Google tools, SEO practices, and basic HTML/CSS</li>\n<li>Strong writing and editing skills with a focus on SEO optimization</li>\n<li>Excellent communication skills and ability to meet deadlines</li>\n<li>Basic knowledge in content creation using tools like Canva or AI platforms</li>\n</ul>\n<h3>Experience &amp; Qualifications:</h3>\n<ul>\n<li><strong>Years of Experience:</strong> 1 to 3 years</li>\n<li><strong>Preferred Technical Qualification:</strong> Professionally trained candidates</li>\n<li><strong>Preferred Academic Qualification:</strong> Plus Two / Graduation preferred</li>\n</ul>\n<p>Interested candidates are requested to send their resumes to hr@hyzventures.com with the subject \"Digital Marketing/Graphic Designer\".</p>",
        "tags": [
            "1-3 Years",
            "Graphic Design",
            "SEO",
            "Social Media Marketing"
        ],
        "summary": "Seeking a male Graphic Designer with 1-3 years of experience in digital marketing, SEO, and social media. Responsibilities include creating visuals, editing videos, and managing ad campaigns."
    },
    {
        "job_title": "Female Customer Support Executive (Tamil and Malayalam Speaking)",
        "company": "Integrated Order Automated Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24930",
        "location": "Technopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Female Customer Support Executive (Tamil and Malayalam Speaking)</h2>\n<p><strong>Organization:</strong> Integrated Order Automated Solutions Pvt Ltd\n<strong>Company Location:</strong> Technopark, Thiruvananthapuram\n<strong>Website:</strong> www.ioas.in\n<strong>Contact Email:</strong> ioascareers@gmail.com</p>\n<h3>Job Details:</h3>\n<ul>\n<li><strong>Position:</strong> Female Customer Support Executive (Pharma Based IT / Software)</li>\n<li><strong>Experience:</strong> Fresher / Experienced (Females Only)</li>\n<li><strong>Qualification:</strong> Degree</li>\n<li><strong>Languages:</strong> Candidate Must Speak in Tamil and Malayalam</li>\n<li><strong>Salary:</strong> ₹8,000 to ₹12,000 (Exceptional candidates with proven skills and experience can expect a higher salary package, which will be discussed and finalized during the interview process).</li>\n<li><strong>Working Hours:</strong> 9 AM - 6 PM (Monday to Saturday)</li>\n<li><strong>Probation Period:</strong> 6 Months</li>\n<li><strong>Increment:</strong> Performance-based increment after probation.</li>\n</ul>\n<h3>Job Description:</h3>\n<ul>\n<li>Oversee the sales process to attract new clients.</li>\n<li>Research and identify new market opportunities.</li>\n<li>Generate new business through Phone, Whatsapp, etc.</li>\n<li>Prepare and deliver pitches to potential clients.</li>\n<li>Regular communication with the management to successfully execute the business strategy.</li>\n<li>Excellent PR skills to build long-term relationships with clients.</li>\n<li>Should be able to manage the sales process independently.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates please send your resume to ioascareers@gmail.com. \n<strong>Mail Subject Line:</strong> Customer Support Executive With Tamil</p>\n<p><strong>Closing Date:</strong> 30th November 2025\n<strong>Job Published:</strong> 8th November 2025</p>",
        "tags": [
            "Fresher/Experienced",
            "Tamil",
            "Malayalam",
            "Customer Support"
        ],
        "summary": "Seeking a Female Customer Support Executive fluent in Tamil and Malayalam. Responsibilities include sales, client relations, and business development for a pharma-based IT company."
    },
    {
        "job_title": "Female Customer Support Executive (with accountancy background preferred)",
        "company": "Integrated Order Automated Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24929",
        "location": "Technopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Female Customer Support Executive (Pharma Based IT / Software)</h2>\n<p><strong>Organization:</strong> Integrated Order Automated Solutions Pvt Ltd\n<strong>Company Location:</strong> Technopark Trivandrum\n<strong>Website:</strong> www.ioas.in\n<strong>Contact Email:</strong> ioascareers@gmail.com</p>\n<p><strong>Closing Date:</strong> 30, Nov 2025\n<strong>Job Published:</strong> 08, Nov 2025</p>\n<h3>About the Role:</h3>\n<p>Integrated Order Automated Solutions (P) Ltd is seeking a Female Customer Support Executive with a preference for an accountancy background. This role is crucial for overseeing the sales process, managing client relationships, and contributing to business growth within the pharmaceutical IT/Software sector.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Oversee the sales process to attract new clients.</li>\n<li>Monitor online payments and manage subscription entries.</li>\n<li>Perform basic accounting tasks.</li>\n<li>Research and identify new market opportunities.</li>\n<li>Generate new business through Phone, Whatsapp, etc.</li>\n<li>Prepare and deliver pitches to potential clients.</li>\n<li>Maintain regular communication with management to execute business strategy effectively.</li>\n<li>Utilize excellent PR skills to build long-term client relationships.</li>\n<li>Independently manage the sales process.</li>\n</ul>\n<h3>Qualifications &amp; Skills:</h3>\n<ul>\n<li><strong>Qualification:</strong> Degree</li>\n<li><strong>Preferred Background:</strong> Accountancy background is preferred.</li>\n<li><strong>Languages:</strong> Malayalam, English, and Tamil speaking skills are preferred.</li>\n<li><strong>Experience:</strong> Fresher / Experienced (Females)</li>\n</ul>\n<h3>Compensation &amp; Benefits:</h3>\n<ul>\n<li><strong>Salary:</strong> 10,000 to 14,000 per month. Exceptional candidates with proven skills and experience may receive a higher package, to be discussed during the interview.</li>\n<li><strong>Time:</strong> 9 AM - 6 PM (Monday to Saturday)</li>\n<li><strong>Probation Period:</strong> 6 Months</li>\n<li><strong>Performance:</strong> Performance-based increment after probation.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates are requested to send their resume to <strong>ioascareers@gmail.com</strong>. Please use the subject line: 'Customer Support Executive With Accountancy'.</p>\n<p><strong>Company Address:</strong>\nIntegrated Order Automated Solutions (P) Ltd\nKerala Startup Mission, G3B, Thejaswini, Technopark Rd,\nTechnopark Campus, Karyavattom, Thiruvananthapuram, 695581</p>",
        "tags": [
            "Fresher/Experienced",
            "Customer Support",
            "Sales",
            "Basic Accounting"
        ],
        "summary": "Seeking a Female Customer Support Executive for a Pharma IT/Software company. Responsibilities include sales, payment monitoring, basic accounting, and client relationship management. Requires a degree and preferred accountancy background."
    },
    {
        "job_title": "Process Associate Trainee(Freshers)",
        "company": "Ecesis Care (P) Ltd",
        "url": "https://technopark.org/job-details/24928",
        "location": "Technopark",
        "closing_date": "11 Nov 2025",
        "job_description": "<h2>Process Associate Trainee (Freshers)</h2>\n<p><strong>Company:</strong> ECESIS CARE (P) Ltd</p>\n<p><strong>Location:</strong> 4th FLOOR, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581</p>\n<p><strong>Website:</strong> https://www.ecesistech.com</p>\n<p><strong>Contact Email:</strong> amrithas@ecesistech.com</p>\n<p><strong>Closing Date:</strong> 11, Nov 2025</p>\n<p><strong>Job Published:</strong> 08, Nov 2025</p>\n<h3>About Ecesis:</h3>\n<p>At Ecesis, we specialize in Broker Price Opinion (BPO) services that empower real estate professionals across the United States. We are a trusted leader in the real estate valuation industry, recognized for our precision, reliability, and innovative solutions. Ecesis is the only IT firm in Kerala to have received Government funding under the India BPO Promotion Scheme (IBPS) for employment generation in 2018 and is a NASSCOM-affiliated organization.</p>\n<h3>What We Do:</h3>\n<p>For over a decade, Ecesis has partnered with realtors, brokers, and real estate companies, providing accurate property valuations and Comparative Market Analysis (CMA) reports. Our team utilizes data-driven insights and advanced technology to deliver results that help clients stay competitive in the real estate market.</p>\n<p><strong>Work Location:</strong> 5CCJ+GJ7, Saraloor Rd, Chenthooran Nagar, Nagercoil, Tamil Nadu 629002</p>\n<p><strong>Google Map:</strong> https://maps.app.goo.gl/c4aYgkukM6EiyHiT6?g_st=iw</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Support daily operations and documentation.</li>\n<li>Coordinate with teams to ensure smooth workflow.</li>\n<li>Maintain accuracy and efficiency in all assigned tasks.</li>\n<li>Contribute to process improvement initiatives.</li>\n</ul>\n<h3>Eligibility Criteria:</h3>\n<ul>\n<li>Willing to work in night shifts (allowances provided).</li>\n<li>Freshers preferred from in and around Marthandam.</li>\n<li>Eligible Courses: Graduates / Postgraduates in Engineering (Civil, ECE, EEE, ME) or Arts &amp; Science.</li>\n<li>Batch: 2024–2025 only.</li>\n<li>Immediate joiners required.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong attention to detail and ability to handle large volumes of data accurately.</li>\n<li>Good understanding of documentation and report preparation.</li>\n<li>Ability to multitask and meet tight deadlines.</li>\n<li>Eagerness to learn business processes and adapt quickly to new tools or systems.</li>\n<li>Basic knowledge of the real estate domain or BPO process (added advantage).</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "BPO",
            "Real Estate",
            "Documentation"
        ],
        "summary": "Ecesis seeks freshers for Process Associate Trainee roles in Nagercoil. Responsibilities include supporting daily operations and documentation. Immediate joiners with 2024-2025 batches are preferred."
    },
    {
        "job_title": "SAP AMS Technical PM",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24927",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>SAP AMS Technical Project Manager</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> November 14, 2025\n<strong>Job Published:</strong> November 07, 2025</p>\n<h3>Introduction</h3>\n<p>We are looking for candidates with 12+ years of experience for this role.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Manage delivery for multi-module AMS projects across functional and technical streams.</li>\n<li>Ensure incident, problem, and change management process compliance.</li>\n<li>Review performance metrics and drive continuous improvement.</li>\n<li>Mentor team members and coordinate with client leadership.</li>\n<li>Support escalations, audits, and transition management.</li>\n<li>Drive SLA Adherence, digital transformation, and innovation initiatives across SAP landscapes.</li>\n<li>Ensure proactive risk identification and mitigation planning.</li>\n<li>Champion continuous improvement, automation, and DevOps practices in SAP AMS.</li>\n<li>Experience managing global delivery models and multi-vendor ecosystems is preferred.</li>\n<li>Lead automation, DevOps, and innovation initiatives.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong>\n- 12+ years of SAP delivery experience.\n- Proven leadership in managing cross-functional SAP AMS teams.\n- Expertise in team onboarding, transition, and stabilization of AMS services with established SLAs and metrics.\n- Expertise in ECC, BW AMS services with knowledge in MM/WM, SD, S/4 HANA, and integration landscapes.\n- Experience managing multi-vendor, multi-location support models.\n- Excellent communication, analytical, stakeholder management, conflict resolution, and governance skills.\n- Proven decision-making and risk management skills under pressure.\n- Good communication skills to handle negotiations with customers, partners, and vendors.</p>\n<p><strong>Secondary Skills:</strong>\n- Cloud migration, analytics (Snowflake, Power BI).</p>\n<p><strong>Certifications:</strong>\n- PMP, ITIL Expert, SAP Solution Manager, or SAP Activate.</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn, and all employment-related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "12+ Years",
            "SAP AMS",
            "Project Management",
            "S/4 HANA"
        ],
        "summary": "Seeking an experienced SAP AMS Technical PM with 12+ years of experience to manage multi-module projects. Responsibilities include leading teams, ensuring process compliance, and driving innovation."
    },
    {
        "job_title": "Infor Functional Consultant",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24926",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Infor Functional Consultant</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, Kerala, India\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Application Deadline:</strong> 14, November 2025\n<strong>Date Published:</strong> 07, November 2025</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems (P) Ltd is seeking experienced Infor Functional Consultants to join our team.</p>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Experience:</strong> 4+ years of experience as an Infor Functional Consultant (M3 / LN / CloudSuite).</li>\n<li><strong>Module Expertise:</strong> Strong knowledge of at least one or more non-finance modules, including:<ul>\n<li>Procurement / Purchase Management</li>\n<li>Inventory / Warehouse Management</li>\n<li>Manufacturing / Production Planning</li>\n<li>Order Management / Sales</li>\n<li>Supply Chain / Distribution</li>\n</ul>\n</li>\n<li><strong>Infor Knowledge:</strong> Good understanding of Infor business flows and configuration options.</li>\n<li><strong>Implementation Experience:</strong> Experience in full lifecycle ERP implementations or major enhancements.</li>\n</ul>\n<h3>Application Process</h3>\n<p>Interested candidates are requested to forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong>. Please include your notice period, current CTC, and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers</h3>\n<p>Beware of fraudsters impersonating Reflections Info Systems and demanding payment for job offers. Reflections Info Systems <strong>never</strong> requests payment for job opportunities. We communicate with candidates exclusively through our official website or LinkedIn. All official employment-related correspondence will come from our official HR email address. For any clarification or alerts regarding this matter, please contact <strong>careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "Infor M3",
            "Infor LN",
            "ERP Implementation"
        ],
        "summary": "Seeking 4+ years experienced Infor Functional Consultant (M3/LN/CloudSuite) with non-finance module expertise for ERP implementations. Apply with resume and CTC details."
    },
    {
        "job_title": "QA Engineer (PowerShell / Azure Automation)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24925",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>QA Engineer (PowerShell / Azure Automation)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 14, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly skilled QA Engineer with 8+ years of automation testing experience and hands-on expertise in PowerShell automation, the Pester framework, and the Azure ecosystem (Logic Apps, DevOps, and Portal).</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Candidate must possess 8-10 years of automation testing experience, including automation framework development, functional, and regression testing.</li>\n<li>Design, develop, and maintain PowerShell-based automation scripts for Azure Logic App validation and integration testing.</li>\n<li>Implement and manage Pester test frameworks for end-to-end functional, regression, and workflow testing.</li>\n<li>Perform manual testing of Azure Logic Apps, APIs, and integration flows in the Azure Portal.</li>\n<li>Collaborate closely with developers, DevOps, and product teams to ensure seamless CI/CD integration and quality assurance in deployments.</li>\n<li>Serve as a single point of contact for QA-related discussions and deliverables across multiple environments.</li>\n<li>Own and drive the complete QA lifecycle — from test planning and execution to reporting and sign-off.</li>\n<li>Maintain detailed test documentation, including test cases, data, and defect reports.</li>\n<li>Validate logs, API responses, and event flows through Azure Storage Tables, Log Analytics, and Azure Monitor.</li>\n<li>Use Git for version control and Azure DevOps pipelines for automated test execution and reporting.</li>\n<li>Act as a client-facing QA representative, proactively communicating updates, risks, and improvement suggestions.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>PowerShell Scripting</li>\n<li>Pester Framework</li>\n<li>Azure Logic Apps</li>\n<li>Azure Portal</li>\n<li>Azure DevOps (CI/CD)</li>\n<li>Git / Azure Repos</li>\n<li>Service Principal Authentication</li>\n<li>API Testing (REST APIs)</li>\n<li>Azure Storage Tables</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Cypress / Postman / REST tools for API automation</li>\n<li>Kusto Query Language (KQL) or Azure Log Analytics</li>\n<li>Docker / Kubernetes environments</li>\n<li>Python scripting or exposure to AI-driven testing concepts</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment-related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            "PowerShell",
            "Azure",
            "Automation Testing"
        ],
        "summary": "Seeking a QA Engineer with 8+ years of automation experience in PowerShell and Azure. Responsibilities include script development, testing Logic Apps, and CI/CD integration."
    },
    {
        "job_title": "IT Infrastructure Engineer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24924",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>IT Infrastructure Engineer</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are looking for candidates with 4+ years of experience for the role of IT Infrastructure Engineer.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Manage and maintain Linux servers and related infrastructure.</li>\n<li>Apply patches, updates, and security fixes regularly.</li>\n<li>Monitor system performance and implement preventive maintenance.</li>\n<li>Handle user access requests, system backup, and data restoration.</li>\n<li>Support internal/external audits.</li>\n<li>Participate in IT change and incident management processes.</li>\n<li>Maintain documentation of configurations, SOPs, and change logs.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Strong knowledge of Linux distributions (Debian, RHEL, CentOS).</li>\n<li>Experienced in server administration, including user management, permissions, and system hardening.</li>\n<li>Familiar with patching and update management.</li>\n<li>Hands-on experience with VMware / Hypervisor management and troubleshooting.</li>\n<li>Exposure to monitoring tools such as Zabbix, Nagios, and SolarWinds.</li>\n<li>Experience in backup and restore procedures using Veeam, rsync, or cron jobs.</li>\n<li>Sound understanding of networking fundamentals (IP, DNS, DHCP, routing, and firewall basics).</li>\n<li>Good understanding of firewall and VPN concepts.</li>\n<li>Proficient in shell scripting and automation using Bash, Python, and Ansible.</li>\n<li>Knowledge of version control and DevOps tools such as Git, GitLab, Jenkins, and CI/CD pipelines.</li>\n<li>Understanding of containerization and orchestration tools like Docker and Kubernetes (K8s) for application hosting and management.</li>\n<li>Familiarity with cloud environments such as Azure and AWS for basic VM and storage management.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>RHCSA / RHCE is an advantage.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "4+ Years",
            "Linux",
            "Shell Scripting",
            "VMware"
        ],
        "summary": "Seeking an IT Infrastructure Engineer with 4+ years of experience. Responsibilities include managing Linux servers, patching, monitoring, and supporting IT processes."
    },
    {
        "job_title": "Java Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24923",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Java Developer at Reflections Info Systems (P) Ltd</h2>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581</p>\n<p><strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 07, Nov 2025</p>\n<p><strong>Closing Date:</strong> 14, Nov 2025</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems is seeking experienced Java Developers with 4+ years of experience to join our team.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable Java-based applications and services.</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Write clean, maintainable, and testable code.</li>\n<li>Develop and maintain RESTful APIs and integration points with internal and external systems.</li>\n<li>Perform unit and integration testing to ensure high code quality.</li>\n<li>Participate in Agile ceremonies and contribute to continuous improvement initiatives.</li>\n<li>Troubleshoot and resolve application issues in a timely manner.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Core Java (JDK 8 or above), Spring Boot, J2EE, and JPA/Hibernate</li>\n<li>Unit and Integration Testing using Junit, RESTful API development using JSON</li>\n<li>Build &amp; Version Control Tools: Maven, Git, Jenkins</li>\n<li>Database Technologies: JDBC, RDBMS (e.g., MySQL, PostgreSQL), Cassandra</li>\n<li>Messaging Systems: Apache Kafka, ActiveMQ, or IBM MQ</li>\n<li>Cloud Development Experience, preferably in Microsoft Azure</li>\n<li>Strong understanding of object-oriented programming, core Java concepts, and design patterns.</li>\n</ul>\n<h3>Application Process:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice:</h3>\n<p>Be aware of fraudsters posing as Reflections Info Systems employees and requesting payment for job offers. Reflections Info Systems never asks for payment for employment. We communicate only through our official website or LinkedIn, and all official HR emails originate from our official HR email ID. For any clarifications or alerts regarding this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "4+ Years",
            "Java",
            "Spring Boot",
            "Cloud Development"
        ],
        "summary": "Seeking 4+ years experienced Java Developers to design, develop, and maintain scalable Java applications. Must have strong Core Java, Spring Boot, and API development skills."
    },
    {
        "job_title": "QA Engineer (PowerShell / Azure Automation)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24922",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>QA Engineer (PowerShell / Azure Automation)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025</p>\n<h3>Introduction</h3>\n<p>We are seeking a highly skilled QA Engineer with 8+ years of automation testing experience and hands-on experience in PowerShell automation, Pester framework, and the Azure ecosystem (Logic Apps, DevOps, and Portal).</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Candidate must possess 8-10 years of automation testing experience including automation framework development, functional and regression testing.</li>\n<li>Design, develop, and maintain PowerShell-based automation scripts for Azure Logic App validation and integration testing.</li>\n<li>Implement and manage Pester test frameworks for end-to-end functional, regression, and workflow testing.</li>\n<li>Perform manual testing of Azure Logic Apps, APIs, and integration flows in the Azure Portal.</li>\n<li>Collaborate closely with developers, DevOps, and product teams to ensure seamless CI/CD integration and quality assurance in deployments.</li>\n<li>Serve as a single point of contact for QA-related discussions and deliverables across multiple environments.</li>\n<li>Own and drive the complete QA lifecycle — from test planning and execution to reporting and sign-off.</li>\n<li>Maintain detailed test documentation, including test cases, data, and defect reports.</li>\n<li>Validate logs, API responses, and event flows through Azure Storage Tables, Log Analytics, and Azure Monitor.</li>\n<li>Use Git for version control and Azure DevOps pipelines for automated test execution and reporting.</li>\n<li>Act as a client-facing QA representative, proactively communicating updates, risks, and improvement suggestions.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>PowerShell Scripting</li>\n<li>Pester Framework</li>\n<li>Azure Logic Apps</li>\n<li>Azure Portal</li>\n<li>Azure DevOps (CI/CD)</li>\n<li>Git / Azure Repos</li>\n<li>Service Principal Authentication</li>\n<li>API Testing (REST APIs)</li>\n<li>Azure Storage Tables</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Cypress / Postman / REST tools for API automation</li>\n<li>Kusto Query Language (KQL) or Azure Log Analytics</li>\n<li>Docker / Kubernetes environments</li>\n<li>Python scripting or exposure to AI-driven testing concepts</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Job Offers:</strong></p>\n<p>Please be aware that some fraudsters may promise jobs with Reflections Info Systems for a fee. Reflections Info Systems never seeks payment for job opportunities. We contact candidates exclusively through our official website or LinkedIn, and all employment-related emails are sent from our official HR email address. For any clarifications or alerts regarding this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "8+ Years",
            "PowerShell",
            "Azure Automation",
            "Pester Framework"
        ],
        "summary": "Seeking a QA Engineer with 8+ years of experience in PowerShell and Azure Automation. Responsibilities include script development, testing Logic Apps, and CI/CD integration."
    },
    {
        "job_title": "Technical Project Manager (Optimizely)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24921",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Technical Project Manager (Optimizely)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 14, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>Introduction</h3>\n<p>We are seeking a highly experienced Technical Project Manager with over 12 years of experience, particularly in migration projects from SAP Commerce (Hybris) to Optimizely Commerce Cloud. The successful candidate will be responsible for the complete end-to-end delivery oversight of these projects. Key responsibilities include team onboarding, managing vendor knowledge transition, ensuring governance and SLA adherence, and maintaining high-quality standards.</p>\n<p>This role demands strong B2B domain knowledge, a solid hands-on technical understanding, and effective leadership skills to guarantee a successful migration and establish long-term ownership of the deployed solution.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Project Planning &amp; Delivery</strong>\n- Define and manage the migration roadmap, including timelines and critical milestones.\n- Oversee the end-to-end project delivery, ensuring strict adherence to SLAs, quality benchmarks, and governance frameworks.\n- Conduct thorough feasibility analyses and risk assessments for all migration phases.</p>\n<p><strong>Team &amp; Vendor Management</strong>\n- Lead the onboarding process for project teams and ensure a seamless transition of knowledge from external vendors.\n- Serve as the primary point of contact and liaison between internal teams, vendors, and all relevant stakeholders.\n- Drive the vendor handover strategy, ensuring clear ownership transfer for architecture and development.</p>\n<p><strong>Technical Oversight</strong>\n- Guarantee that all project activities align with the defined solution architecture and technical standards.\n- Collaborate closely with architects and developers to effectively resolve technical challenges.\n- Monitor and manage integration, data migration, and performance testing activities.</p>\n<p><strong>Governance &amp; Reporting</strong>\n- Maintain comprehensive project documentation, create dashboards, and generate regular progress reports.\n- Conduct regular status meetings and communicate project updates to leadership.\n- Ensure compliance with all security, quality, and enterprise standards.</p>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills</strong>\n- Proven experience in migration projects, with a preference for SAP Hybris to Optimizely migrations.\n- Strong B2B domain knowledge, including expertise in pricing, catalogs, workflows, and customer hierarchies.\n- Hands-on technical understanding of .NET Core, APIs, CMS/Commerce Cloud concepts.\n- Proficiency in Agile project management methodologies, including sprint planning and backlog management.\n- Excellent stakeholder communication and vendor management capabilities.\n- Substantial experience in governance and SLA management.</p>\n<p><strong>Secondary Skills</strong>\n- Direct experience with Optimizely Commerce Cloud and the Spire framework.\n- Experience with JavaScript frameworks (React/Angular/VueJS) and CMS proficiency.\n- Familiarity with SAP Commerce Cloud (Hybris) architecture.\n- Knowledge of Azure cloud services and CI/CD pipelines.\n- Exposure to data migration strategies and performance optimization techniques.\n- PMP or Agile/Scrum methodology certification.</p>\n<p><strong>Soft Skills</strong>\n- <strong>Leadership &amp; Team Management:</strong> Ability to inspire, guide, and manage cross-functional teams effectively.\n- <strong>Communication Skills:</strong> Ability to communicate clearly and concisely with both technical and non-technical stakeholders.\n- <strong>Problem-Solving &amp; Decision-Making:</strong> Aptitude for quickly resolving issues and making informed decisions.\n- <strong>Negotiation &amp; Influencing:</strong> Skilled in managing vendor relationships and stakeholder expectations.\n- <strong>Adaptability:</strong> Comfortable working with evolving priorities and dynamic project environments.\n- <strong>Conflict Resolution:</strong> Ability to handle disagreements constructively and maintain team harmony.\n- <strong>Time Management &amp; Prioritization:</strong> Ensures efficient management of deadlines and deliverables.</p>\n<h3>Important Notice:</h3>\n<p>Interested candidates are requested to forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong>, including their notice period, current CTC, and expected CTC.</p>\n<p>Please be aware of fraudulent activities: Some individuals may claim to offer jobs at Reflections Info Systems for a fee. Reflections Info Systems <em>never</em> charges any fee for job opportunities. We contact candidates exclusively through our official website or LinkedIn, and all official employment-related emails originate from our official HR email address. For any clarification or to report suspicious activity, please contact <strong>careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "12+ Years",
            "Optimizely",
            "SAP Commerce (Hybris)",
            "Project Management"
        ],
        "summary": "Technical Project Manager needed with 12+ years experience in SAP Hybris to Optimizely migrations. Role involves end-to-end delivery, team/vendor management, and technical oversight for successful solution ownership."
    },
    {
        "job_title": "SAP L1 Support",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24920",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>SAP L1 Support</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Address:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are seeking candidates with 2+ years of experience for the SAP L1 Support role. This position involves providing first-level support to SAP users by monitoring incidents, resolving known issues, and escalating complex cases to L2/L3 teams. A good understanding of SAP Master Data Management, ECC, BW modules, along with WM/MM, SD, Basis &amp; Security aspects is preferred.</p>\n<p><strong>Work Time:</strong> 10:00 AM - 6:00 PM / 6:00 PM - 2:00 AM</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Monitor SAP incident queues and categorize tickets.</li>\n<li>Take ownership and provide timely responses to users.</li>\n<li>Demonstrate proactive and quick response; self-exploration for basic fixes is desirable.</li>\n<li>Perform prioritization, severity alignment, and triaging of tickets to determine response times and necessary handovers to L2/L3 or Basis Infra teams.</li>\n<li>Resolve known errors using the knowledge base and runbooks.</li>\n<li>Escalate unresolved issues to L2/L3 support teams.</li>\n<li>Perform basic user administration tasks, such as password resets and unlocks.</li>\n<li>Document incident resolutions and maintain knowledge base articles.</li>\n<li>Proactively monitor system alerts and job failures.</li>\n<li>Coordinate with functional and technical teams to ensure timely resolution of issues.</li>\n<li>Collaborate effectively with users to capture and validate incident details.</li>\n<li>Exposure to ITIL process fundamentals is preferred.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>2–4 years of SAP support experience.</li>\n<li>Basic SAP functional exposure (ECC/BM/FICO/MM/SD).</li>\n<li>Strong communication, problem-solving, and documentation skills.</li>\n<li>Basic understanding of SAP modules and experience handling ticketing tools (e.g., JIRA, Zendesk).</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Basic SQL or Excel knowledge.</li>\n<li>Understanding of ITIL processes.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates are requested to forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong>, including their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers:</h3>\n<p>This is to inform jobseekers that some individuals may be falsely representing Reflections Info Systems and offering jobs for a fee. Please be aware that Reflections Info Systems <strong>never</strong> requests payment for job opportunities. We communicate with candidates exclusively through our official website or LinkedIn. All employment-related emails will originate from our official HR email ID. For any clarification or alerts regarding this matter, please contact <strong>careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "2+ Years",
            "SAP Support",
            "ECC",
            "ITIL"
        ],
        "summary": "Seeking an SAP L1 Support professional with 2+ years of experience. Responsibilities include incident resolution, user support, and basic administration, with ITIL process familiarity preferred."
    },
    {
        "job_title": "SDET (.NET)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24919",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>SDET (.NET) - Reflections Info Systems (P) Ltd</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025</p>\n<h3>Introduction</h3>\n<p>We are seeking experienced candidates with 3+ years of experience for the role of Software Development Engineer in Test (SDET). This position is crucial for ensuring the quality and reliability of our SAP B2B to Optimizely Commerce Cloud migration.</p>\n<h3>Job Description</h3>\n<p>The SDET role requires a blend of strong programming and QA expertise to design, develop, and execute both automated and manual tests. Key responsibilities include validating functional workflows, API integrations, and data accuracy. The role also involves building automation frameworks, integrating tests into CI/CD pipelines, and collaborating with development and business teams to deliver a robust and scalable solution.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop and maintain automated test suites using .NET Core/C#, Selenium, or Playwright.</li>\n<li>Perform API testing for ECC-Optimizely integrations using Postman or RestSharp.</li>\n<li>Validate migrated data using SQL queries and backend checks.</li>\n<li>Implement unit and integration tests with xUnit, NUnit, or MSTest.</li>\n<li>Set up and manage test pipelines in Azure DevOps or GitHub Actions.</li>\n<li>Conduct functional, regression, and end-to-end testing for ecommerce workflows.</li>\n<li>Perform performance testing using JMeter, k6, or similar tools.</li>\n<li>Ensure secure API practices and perform basic security testing (OWASP awareness).</li>\n<li>Collaborate in Agile teams, participate in sprint planning, and report defects in JIRA or Azure Boards.</li>\n<li>Generate test reports using ExtentReports, Allure, or custom dashboards.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong>\n- <strong>Technical Testing:</strong>\n    - .NET Core / C#: Strong programming skills for writing automated tests and test utilities.\n    - API Testing: Experience with tools like Postman, RestSharp, or Swagger for testing ECC-Optimizely integrations.\n    - Unit Testing Frameworks: Proficiency in xUnit, NUnit, or MSTest.\n    - Test Automation: Building and maintaining automation suites using Selenium WebDriver or Playwright (for UI testing).\n    - SQL &amp; Data Validation: Writing queries to validate migrated data between ECC and Optimizely.\n    - CI/CD Integration: Setting up test pipelines in Azure DevOps, GitHub Actions, or Jenkins.\n- <strong>Functional &amp; Integration Testing:</strong>\n    - End-to-End Test Scenarios: Covering product catalog, pricing, inventory, and order workflows.\n    - Regression Testing: Ensuring stability after each migration phase.\n    - Error Handling &amp; Logging: Implementing robust logging and exception tracking.\n- <strong>Quality Practices:</strong>\n    - Test Strategy &amp; Planning: Creating test plans aligned with migration phases.\n    - Defect Management: Using tools like JIRA, Azure Boards, or TestRail.\n    - Version Control: Git for managing test code and collaboration.</p>\n<p><strong>Secondary Skills:</strong>\n- <strong>Performance &amp; Security Testing:</strong>\n    - Load Testing Tools: JMeter, k6, or Locust for performance validation.\n    - Security Testing Basics: Awareness of OWASP Top 10 and secure API practices.\n- <strong>SAP ECC Awareness:</strong>\n    - Basic ABAP Understanding: To interpret ECC logic and validate data extraction.\n    - ECC Data Models: Familiarity with tables like MARA, KNA1, VBAK for test data setup.\n- <strong>Optimizely Platform Familiarity:</strong>\n    - Optimizely Commerce Workflows: Understanding how catalog and order flows work.\n    - CMS Testing: Validating content rendering and personalization logic.\n- <strong>Collaboration &amp; DevOps:</strong>\n    - Test Reporting Tools: Extent Reports, Allure, or custom dashboards.\n    - Agile Methodology: Working in sprints, attending stand-ups, and contributing to retrospectives.</p>\n<h3>Soft Skills:</h3>\n<ul>\n<li>Strong communication and documentation abilities.</li>\n<li>Analytical thinking to identify edge cases and potential data issues.</li>\n<li>Proactive collaboration with developers, business analysts, and stakeholders.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates are requested to forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Please be aware that some fraudsters may claim to offer jobs at Reflections Info Systems for a fee. Reflections Info Systems never asks for payment for job opportunities. We contact candidates exclusively through our official website or LinkedIn, and all employment-related emails are sent from our official HR email ID. For any clarification or alerts regarding this matter, please contact <strong>careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "3+ Years",
            ".NET Core/C#",
            "Selenium/Playwright",
            "API Testing"
        ],
        "summary": "Seeking an experienced SDET to ensure quality in a SAP B2B to Optimizely migration. Responsibilities include developing automated tests, API testing, data validation, and CI/CD integration."
    },
    {
        "job_title": "Lead (Full Stack - FE / BE / React)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24918",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Lead Full Stack Developer - Optimizely Migration</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly skilled Full Stack Developer with 8+ years of experience to lead the end-to-end migration of our B2B platform to Optimizely. This role demands deep technical expertise across front-end and back-end technologies, strong architectural understanding, and hands-on experience with e-commerce systems. The ideal candidate will drive the technical strategy, implementation, and integration efforts, ensuring a seamless transition from SAP ECC to Optimizely Commerce.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead the full lifecycle of the B2B to Optimizely migration project, from planning to deployment.</li>\n<li>Develop scalable, secure, and maintainable full-stack solutions.</li>\n<li>Collaborate with architects, business analysts, QA, and DevOps teams to ensure alignment and delivery.</li>\n<li>Design and implement RESTful APIs for seamless integration between SAP ECC and Optimizely.</li>\n<li>Ensure high performance and responsiveness of applications across browsers and devices.</li>\n<li>Integrate and optimize PIM (Product Information Management) and Spire systems within the e-commerce ecosystem.</li>\n<li>Implement CI/CD pipelines for automated testing and deployment using Azure DevOps or GitHub Actions.</li>\n<li>Maintain documentation and provide technical leadership and mentoring to junior developers.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li><strong>Front-End (React):</strong><ul>\n<li>React.js (Hooks, Context API): Building scalable, component-based UIs.</li>\n<li>JavaScript (ES6+) / TypeScript: Strong scripting and typing for maintainable code.</li>\n<li>HTML5 / CSS3 / SASS: Responsive design and layout skills.</li>\n<li>State Management: Redux or React Query for managing complex state.</li>\n<li>API Integration: Consuming RESTful APIs securely and efficiently.</li>\n<li>Cross-Browser Compatibility: Ensuring consistent UI behavior across platforms.</li>\n</ul>\n</li>\n<li><strong>Back-End (.NET):</strong><ul>\n<li>.NET Core / C#: Building scalable services and APIs for Optimizely.</li>\n<li>Entity Framework / LINQ: Data access and manipulation.</li>\n<li>RESTful API Design: Creating secure, performant endpoints for ECC-Optimizely integration.</li>\n<li>Authentication &amp; Authorization: OAuth2, JWT, role-based access control.</li>\n<li>Database Design: SQL Server or PostgreSQL schema modeling and optimization.</li>\n</ul>\n</li>\n<li><strong>Architecture &amp; Integration:</strong><ul>\n<li>Optimizely/EPIServer Platform Knowledge: Deep understanding of CMS and Commerce architecture.</li>\n<li>SAP ECC Data Models: Familiarity with MARA, KNA1, VBAK, etc., for integration planning.</li>\n<li>Middleware &amp; Integration Patterns: Experience with Azure Logic Apps, MuleSoft, or Boomi.</li>\n<li>Microservices Architecture: Designing loosely coupled services for scalability.</li>\n<li>CI/CD Pipelines: Azure DevOps, GitHub Actions, or Jenkins for automated deployments.</li>\n<li>Spire &amp; PIM Integration: Experience integrating product and pricing data into e-commerce platforms.</li>\n</ul>\n</li>\n<li><strong>Business &amp; Domain Knowledge:</strong><ul>\n<li>E-commerce Workflows: Product catalog, pricing, inventory, checkout.</li>\n<li>B2B Commerce: Understanding of business customer journeys, bulk ordering, and account-based pricing.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li><strong>Front-End:</strong><ul>\n<li>UI Frameworks: Material UI, Tailwind CSS, or Bootstrap.</li>\n<li>Performance Optimization: Lazy loading, code splitting, caching strategies.</li>\n<li>Accessibility (WCAG): Ensuring inclusive design.</li>\n</ul>\n</li>\n<li><strong>Back-End:</strong><ul>\n<li>GraphQL: For flexible data querying if used in Optimizely extensions.</li>\n<li>Message Queues: RabbitMQ, Azure Service Bus for async processing.</li>\n<li>Containerization: Docker, Kubernetes for deployment and scaling.</li>\n</ul>\n</li>\n<li><strong>Integration &amp; DevOps:</strong><ul>\n<li>Monitoring &amp; Logging: ELK stack, Application Insights, or Prometheus.</li>\n<li>Security Best Practices: Data encryption, secure API design, GDPR compliance.</li>\n<li>Test Automation Awareness: Understanding of unit, integration, and performance testing.</li>\n</ul>\n</li>\n<li><strong>Business &amp; Domain Knowledge:</strong><ul>\n<li>SAP ECC Migration Strategy: Understanding of data extraction, transformation, and validation.</li>\n<li>Stakeholder Communication: Translating technical decisions into business impact.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li><strong>Leadership &amp; Collaboration:</strong><ul>\n<li>Solution Design: Translating business requirements into technical architecture.</li>\n<li>Code Reviews &amp; Mentorship: Guiding developers and enforcing best practices.</li>\n<li>Agile Methodology: Working in sprints, managing backlog, and leading stand-ups.</li>\n</ul>\n</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers:</h3>\n<p>It is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment-related emails are sent through the official HR email ID. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            "React",
            ".NET Core",
            "Optimizely"
        ],
        "summary": "Lead Full Stack Developer sought for B2B platform migration to Optimizely. Requires 8+ years experience in React, .NET, and e-commerce systems. Responsibilities include migration leadership and API integration."
    },
    {
        "job_title": "Senior Solution Architect",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24917",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Senior Solution Architect – AI &amp; Generative AI (Leadership Role)</h2>\n<p><strong>Company:</strong> Softnotions Technologies (P) Ltd\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Contact Email:</strong> recruitment@softnotions.com\n<strong>Closing Date:</strong> November 14, 2025\n<strong>Job Published:</strong> November 07, 2025</p>\n<h3>About the Role</h3>\n<p>We are seeking an experienced AI Solution Architect to join our leadership team. This role will lead the design and deployment of enterprise-scale AI solutions, focusing on Machine Learning, Generative AI, Open-Source LLMs, RAG systems, and Knowledge Engineering. You will architect scalable AI platforms, build intelligent knowledge ecosystems, and recommend infrastructure for diverse domains including Construction, Healthcare, Retail, and Smart Infrastructure.</p>\n<h3>Key Responsibilities:</h3>\n<p><strong>AI Architecture &amp; Strategy</strong></p>\n<ul>\n<li>Architect secure, scalable end-to-end AI platforms (data, models, APIs, knowledge layers, infrastructure).</li>\n<li>Develop AI reference architectures and reusable solution accelerators for industries like Construction (BIM/document intelligence) and Healthcare (clinical AI assistants).</li>\n<li>Recommend and design cloud, hybrid, or on-prem hardware infrastructure (GPU clusters, CPU, networking, storage) with cost-optimized scaling strategies.</li>\n</ul>\n<p><strong>Open-Source LLM &amp; Generative AI Expertise</strong></p>\n<ul>\n<li>Work extensively with open-source LLMs (LLaMA, Mistral, Falcon, Mixtral, Gemma, etc.).</li>\n<li>Lead fine-tuning, quantization (LoRA, QLoRA), model distillation, performance optimization, and domain-specific adaptation.</li>\n<li>Design and deploy self-hosted LLM solutions on Kubernetes, Docker, Hugging Face, vLLM, TGI, or DeepSpeed Inference.</li>\n<li>Address model licensing, data governance, and security for open-source models.</li>\n</ul>\n<p><strong>Knowledge Base &amp; RAG Systems</strong></p>\n<ul>\n<li>Architect and manage enterprise knowledge bases (document ingestion, metadata, embeddings, vector DBs).</li>\n<li>Design RAG pipelines using vector databases (Pinecone, Weaviate, FAISS), embeddings, and metadata storage.</li>\n<li>Lead implementation of RAG, knowledge graphs, ontology-based data models, and semantic search systems.</li>\n<li>Define data governance, access control, knowledge lifecycle management, and multi-tenant knowledge systems.</li>\n</ul>\n<p><strong>Solution Design &amp; Deployment</strong></p>\n<ul>\n<li>Build scalable pipelines for data engineering, feature stores, vector databases, model training, fine-tuning, and inference APIs.</li>\n<li>Implement MLOps/LLMOps (CI/CD, experiment tracking, versioning, monitoring, governance, automated retraining).</li>\n<li>Ensure compliance with enterprise security, privacy, and regulatory standards (HIPAA, GDPR, HL7/FHIR).</li>\n</ul>\n<p><strong>Technology &amp; Infrastructure Ownership</strong></p>\n<ul>\n<li>Provide hardware architecture recommendations (Cloud vs On-Prem GPU, distributed hosting, autoscaling, storage/compute/network optimization).</li>\n<li>Standardize AI technology stack (OpenAI, Azure/AWS/GCP AI, LangChain, Hugging Face, MLFlow, Kubeflow, Kafka, Airflow, Kubernetes).</li>\n<li>Integrate AI systems with existing enterprise platforms (ERP/CRM, BIM, PACS/EHR, Retail POS).</li>\n<li>Establish CI/CD pipelines for AI (automated training, evaluation, deployment, monitoring).</li>\n<li>Implement MLFlow, Kubeflow, Airflow, LangSmith, DVC, Jenkins for model lifecycle management.</li>\n</ul>\n<h3>Qualifications &amp; Experience:</h3>\n<p><strong>Technical Expertise</strong></p>\n<ul>\n<li>Proven experience architecting and deploying LLMs, Generative AI, open-source AI models, and enterprise ML solutions.</li>\n<li>Expertise in RAG, Vector Databases, KB management, semantic search, and prompt orchestration frameworks (LangChain, LlamaIndex).</li>\n<li>Expert in cloud infrastructure, GPU orchestration, containerization (Docker/Kubernetes), distributed systems, and microservices.</li>\n<li>Proficient in Python, API frameworks (FastAPI, Flask), Docker, Kubernetes, and cloud platforms (AWS, Azure, GCP).</li>\n<li>Experience in GPU infrastructure, model parallelism, distributed inference, and performance optimization.</li>\n</ul>\n<p><strong>Domain Experience (Preferred)</strong></p>\n<ul>\n<li>Construction: BIM data layers, digital twins, project cost estimation AI, drawing analysis.</li>\n<li>Healthcare: PHI data processing, clinical AI workflows, compliance (HIPAA, HL7/FHIR, GDPR).</li>\n<li>Retail: Pricing intelligence, customer journey analytics, inventory demand forecasting.</li>\n</ul>\n<p><strong>Soft Skills &amp; Leadership</strong></p>\n<ul>\n<li>Ability to lead cross-functional AI teams.</li>\n<li>Strong ability to translate AI capabilities into business outcomes and client value.</li>\n<li>Excellent communication, documentation, and presentation skills for diverse stakeholders.</li>\n</ul>\n<p><strong>Contact:</strong> recruitment@softnotions.com</p>",
        "tags": [
            "10+ Years",
            "Generative AI",
            "LLM",
            "RAG"
        ],
        "summary": "Seeking a Senior AI Solution Architect with 10+ years experience to lead enterprise-scale AI and Generative AI solutions. Role involves architecting LLMs, RAG systems, and knowledge ecosystems."
    },
    {
        "job_title": "Solution Architect (Optimizely)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24916",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Solution Architect (Optimizely)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 12+ years of experience for this role.</p>\n<h3>Job Description</h3>\n<p>We are seeking an experienced <strong>Solution Architect</strong> to lead the design and implementation of a large-scale migration from <strong>SAP B2B</strong> to <strong>Optimizely Commerce Cloud</strong>. This role will serve as the <strong>technical leader</strong>, responsible for defining a scalable, secure, and future-ready architecture. The ideal candidate has deep expertise in <strong>enterprise commerce systems</strong>, cloud architecture, and system integrations. You will guide development teams, ensure best practices in solution design, and ultimately take full ownership of the architecture and development transition from the vendor.</p>\n<p><strong>Responsibilities include:</strong></p>\n<p><strong>Architecture &amp; Design</strong>\n- Define the end-to-end migration architecture from SAP B2B to Optimizely, including CMS, Commerce, and PIM integration.\n- Design scalable, secure, and high-performance frameworks aligned with business goals.\n- Establish data migration strategies for products, pricing, and customer hierarchies.\n- Ensure API integration between SAP, Optimizely, and other enterprise systems.</p>\n<p><strong>Technical Leadership</strong>\n- Lead and mentor development teams on best practices and coding standards.\n- Collaborate with Optimizely consultants and internal teams to validate feasibility and technical approach.\n- Drive DevOps strategy for CI/CD pipelines, containerization, and cloud deployment.</p>\n<p><strong>Project Ownership</strong>\n- Act as the technical owner of the migration project, taking over from vendor after initial phases.\n- Ensure alignment with enterprise security and compliance standards.\n- Provide technical guidance during feasibility analysis and pilot module migration.</p>\n<p><strong>Collaboration &amp; Communication</strong>\n- Work closely with Business Analysts to translate requirements into technical solutions.\n- Communicate architecture decisions to stakeholders and leadership in business-friendly terms.\n- Support QA teams with test strategy for performance, integration, and security.</p>\n<p><strong>Preferred Skills</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<p><strong>Technical Expertise</strong>\n- SAP B2B Architecture: Deep understanding of SAP Commerce Cloud, Back Office, and integration patterns.\n- B2B Platform: Hands-on experience with CMS and Commerce Cloud platforms, specifically Optimizely.\n- Optimizely PIM &amp; Spire: Strong knowledge of Optimizely Product Information Management (PIM) and Spire framework for modern commerce experiences.\n- .NET Development: Proficient in .NET Core and ASP.NET, essential for Optimizely development.\n- Cloud Architecture: Strong knowledge of Azure PaaS, commonly used for hosting Optimizely solutions.\n- Azure Active Directory: Experience with identity and access management using Azure AD.\n- API Design &amp; Integration: Skilled in RESTful services, SAP APIs, and Optimizely endpoints.\n- Frontend Development: Strong React expertise with CMS integration experience.</p>\n<p><strong>Architectural Leadership</strong>\n- Modern Architecture Concepts: Experience with monolithic and microservices-based systems.\n- Solution Architecture Design: Ability to design scalable, secure, and maintainable frameworks.\n- System Integration: Expertise in bridging SAP and Optimizely platforms, including middleware and data flow strategies.\n- Performance &amp; Scalability: Planning for optimized performance and future growth.\n- Security &amp; Compliance: Knowledge of enterprise-grade security, data protection, and regulatory standards.</p>\n<p><strong>Project Ownership</strong>\n- End-to-End Leadership: Proven ability to lead projects from blueprint to execution.\n- Vendor Transition: Skilled in taking over architecture and development from external consultants.\n- Stakeholder Communication: Capable of translating technical decisions into business value for diverse audiences.</p>\n<p><strong>Secondary Skills:</strong></p>\n<p><strong>Technical Enhancements</strong>\n- GraphQL &amp; Headless CMS Architecture: Beneficial for building modern, flexible commerce experiences.\n- DevOps &amp; CI/CD Pipelines: Experience with tools like Azure DevOps or GitHub Actions for automated deployments.\n- Containerization: Familiarity with Docker and Kubernetes for scalable and efficient deployments.</p>\n<p><strong>Soft Skills:</strong></p>\n<p><strong>Team Mentoring &amp; Coaching</strong>\n- Experienced in guiding developers through complex migration phases and technical transitions.\n<strong>Agile Methodology</strong>\n- Skilled in managing sprints, backlogs, and iterative delivery cycles to ensure timely and quality outcomes.\n<strong>Analytical Thinking &amp; Problem-Solving</strong>\n- Strong capability in feasibility analysis, module mapping, and resolving architectural challenges.\n<strong>Continuous Learning Mindset</strong>\n- Proactively stays updated with evolving trends in SAP BTP, Optimizely, and cloud technologies.</p>\n<hr />\n<p><strong>Application Instructions:</strong>\nInterested candidates may forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Fraudulent Job Offers:</strong>\nThis is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that <strong>no payment is ever sought for jobs in Reflections</strong>. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact <strong>careers@reflectionsinfos.com</strong> for any clarification/ alerts on this subject.</p>",
        "tags": [
            "12+ Years",
            "Optimizely",
            "SAP B2B",
            "Cloud Architecture"
        ],
        "summary": "Seeking an experienced Solution Architect for SAP B2B to Optimizely migration. Lead technical design, implementation, and team guidance for a large-scale commerce platform transition."
    },
    {
        "job_title": "Marketing Coordinator",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/24915",
        "location": "Technopark",
        "closing_date": "13 Nov 2025",
        "job_description": "<h2>Marketing Coordinator</h2>\n<p><strong>Company:</strong> Lean Transitions Solutions\n<strong>Location:</strong> Periyar Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Contact Email:</strong> careers@ltslean.com\n<strong>Closing Date:</strong> 13 November 2025\n<strong>Job Published:</strong> 07 November 2025</p>\n<h3>About Lean Transitions Solutions (LTS)</h3>\n<p>Founded over a decade ago and headquartered in the United Kingdom, Lean Transitions Solutions Ltd (LTS) is an ISO 9001:2015 certified company advocating Industry 4.0.</p>\n<p>LTS delivers Lean Industry 4.0 and Leadership 4.0 software solutions globally to world-class organizations, including Fortune 500 companies. With global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico, our dedicated team ensures client requirements are met with bespoke software solutions that address industrial and manufacturing challenges.</p>\n<h3>About the Role</h3>\n<p>We are seeking a proactive and detail-oriented Marketing Coordinator to support our global marketing and lead-generation activities. The ideal candidate will have strong experience with HubSpot CRM (including automation and AI features) and the ability to coordinate effectively between the UK and India teams. This role is responsible for managing day-to-day marketing operations, coordinating content and campaigns, using automation to increase efficiency, and tracking performance through CRM and analytics tools.</p>\n<h3>Key Responsibilities:</h3>\n<p><strong>1. Marketing Coordination</strong>\n- Support the execution of marketing plans and campaigns in collaboration with the global marketing team.\n- Manage and update marketing collaterals (case studies, one-pagers, capability decks, product sheets).\n- Coordinate social media posts, email campaigns, and digital content with internal teams.\n- Maintain and update marketing data, lead sources, and reports in HubSpot CRM.\n- Liaise with content writers, designers, and video creators to meet campaign deadlines.\n- Assist in tracking campaign results, lead engagement, and marketing analytics.</p>\n<p><strong>2. Marketing Plan Ownership &amp; Team Coordination</strong>\n- Maintain and coordinate the marketing activity plan (daily, weekly, and monthly tasks).\n- Assign and track deliverables across SEO, content creation, digital design, and social media teams.\n- Support campaign planning, execution, and follow-up to ensure consistent messaging and output.\n- Monitor content calendars, posting schedules, and marketing priorities across regions.\n- Provide weekly updates on progress, blockers, and completed deliverables.</p>\n<p><strong>3. Market &amp; Competitor Analysis</strong>\n- Conduct light market research to identify trends, audience shifts, and competitor positioning.\n- Support benchmarking activities to improve messaging, branding, or campaign direction.\n- Feed insights into campaign strategy, product positioning, and content relevance.\n- Track changes in digital engagement, industry events, or sector-specific opportunities.</p>\n<p><strong>4. Performance Tracking &amp; CRM Reporting</strong>\n- Measure and report marketing KPIs such as: Lead generation (Marketing Leads vs Sales Qualified Leads), Campaign engagement (clicks, impressions, downloads, form fills), Traffic sources (email, LinkedIn, website, referrals).\n- Track conversions and attribution using HubSpot CRM.\n- Share weekly or monthly dashboards with Sales and Leadership.\n- Optimize campaigns based on data insights and performance metrics.</p>\n<p><strong>5. AI &amp; Automation</strong>\n- Use HubSpot workflows, sequences, and AI tools to automate campaign tasks.\n- Leverage tools like ChatGPT, Canva AI, Grammarly, Jasper, etc. for content support.\n- Improve efficiency in reporting, document creation, and CRM updates.\n- Support email automation, segmentation, and follow-up sequences.</p>\n<h3>Preferred Skills:</h3>\n<p><strong>Required:</strong>\n- Proficiency with HubSpot CRM (marketing tools, automation, workflows).\n- Experience with digital content coordination and campaign execution.\n- Strong organizational and communication skills.\n- Ability to manage multiple stakeholders and deliverables.\n- Canva, Google Workspace, MS Office (Excel, PowerPoint, Docs).\n- Good Command in English (both verbal and written).\n- <strong>2–4 years</strong> in marketing coordination, campaign support, or CRM-based marketing.</p>\n<p><strong>Bonus / Preferred:</strong>\n- Knowledge of CMS, marketing automation tools, or social publishing tools.\n- Experience with AI content tools (ChatGPT, Jasper, Canva AI, Grammarly).\n- Prior experience supporting UK/Europe teams.\n- Bachelor's degree in marketing, Business, Communications, or equivalent.</p>\n<h3>How to Apply:</h3>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line “Marketing Coordinator” and include the following information in the email content:\n- Current CTC:\n- Expected CTC:\n- Notice Period:\n- Current Location:\n- Total Relevant Experience:\n- Willingness to work at office:</p>",
        "tags": [
            "2-4 Years",
            "HubSpot CRM",
            "Marketing Coordination",
            "Lead Generation"
        ],
        "summary": "Marketing Coordinator needed for global lead generation and campaign support. Requires HubSpot CRM proficiency and strong coordination skills for UK/India teams."
    },
    {
        "job_title": "Junior Business Analyst",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/24914",
        "location": "Technopark",
        "closing_date": "13 Nov 2025",
        "job_description": "<h2>Junior Business Analyst at Lean Transitions Solutions</h2>\n<p><strong>Company:</strong> Lean Transitions Solutions Ltd (LTS)\n<strong>Location:</strong> Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Website:</strong> http://www.LeanTransitionSolutions.com\n<strong>Contact Email:</strong> careers@ltslean.com</p>\n<h3>About Lean Transitions Solutions</h3>\n<p>Founded over a decade ago with headquarters in the United Kingdom, Lean Transitions Solutions Ltd (LTS) is an ISO 9001:2015 certified company advocating for Industry 4.0. LTS delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions to world-class organizations, including Fortune 500 companies, with global presence in India, Germany, Poland, the United States, UAE, Jordan, and Mexico. Our dedicated team ensures client requirements are met with bespoke software solutions addressing industrial and manufacturing challenges.</p>\n<p>At LTS, we uphold our company culture and nurture our core values: Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<h3>About the Role</h3>\n<p>We are seeking a proactive and detail-oriented Junior Business Analyst (Fresher) to join our growing team. This is an exciting opportunity for individuals passionate about analyzing business processes, working with cross-functional teams, and delivering technology-driven solutions. The successful candidate will assist in requirement gathering, documentation, and stakeholder communication, while also supporting customer success activities. This role provides hands-on exposure to real-world projects, enabling the candidate to develop a strong foundation in business analysis and enterprise software implementation.</p>\n<ul>\n<li><strong>Department:</strong> Product / Projects</li>\n<li><strong>Location:</strong> Periyar Building, Technopark, Trivandrum</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n<li><strong>Closing Date:</strong> 13, November 2025</li>\n<li><strong>Job Published:</strong> 07, November 2025</li>\n</ul>\n<h3>Key Learning Opportunities</h3>\n<ul>\n<li>Exposure to real-world business analysis in enterprise SaaS projects.</li>\n<li>Hands-on experience with requirement management and testing processes.</li>\n<li>Practical understanding of Agile methodologies and client communication.</li>\n<li>Opportunity to grow into Senior Business Analyst, Product Owner, or Project Manager roles with experience.</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ol>\n<li>\n<p><strong>Business Requirement Analysis</strong></p>\n<ul>\n<li>Work with Project Managers and clients to gather, analyse, and document business requirements.</li>\n<li>Assist in preparing Business Requirement Documents (BRD), Functional Specification Documents (FSD), and User Stories.</li>\n<li>Translate business needs into clear, actionable requirements for technical teams.</li>\n<li>Participate in requirement workshops, sprint planning, and review meetings.</li>\n<li>Support gap analysis between business processes and system capabilities.</li>\n<li>Assist in identifying, analysing, and documenting change requests and their impacts on existing systems.</li>\n</ul>\n</li>\n<li>\n<p><strong>Process Modelling &amp; Documentation</strong></p>\n<ul>\n<li>Map and document as-is and to-be processes using flowcharts, workflow diagrams, or tools like Visio, Lucidchart, or Draw.io.</li>\n<li>Support process improvement initiatives and identify optimisation opportunities.</li>\n<li>Maintain traceability matrices to ensure full coverage of business requirements through design and testing.</li>\n</ul>\n</li>\n<li>\n<p><strong>Project Coordination &amp; Testing</strong></p>\n<ul>\n<li>Collaborate with cross-functional teams including developers, QA testers, and business stakeholders.</li>\n<li>Assist in preparing User Acceptance Testing (UAT) scenarios, test cases, and documentation.</li>\n<li>Coordinate UAT sessions, gather feedback, and document results.</li>\n<li>Help ensure project deliverables meet business expectations and quality standards.</li>\n</ul>\n</li>\n<li>\n<p><strong>Customer &amp; Stakeholder Communication</strong></p>\n<ul>\n<li>Act as a bridge between customers and internal teams, ensuring smooth and professional communication.</li>\n<li>Respond to client queries and support issues via email, chat, or support systems.</li>\n<li>Maintain and update customer documentation, FAQs, and training materials.</li>\n<li>Track, escalate, and follow up on customer requests until resolution.</li>\n<li>Assist in creating training documents and user manuals for end-users.</li>\n</ul>\n</li>\n<li>\n<p><strong>Research &amp; Continuous Improvement</strong></p>\n<ul>\n<li>Conduct market research and competitor analysis to identify industry trends and product enhancement opportunities.</li>\n<li>Stay updated on business analysis methodologies, tools, and frameworks (Agile, Scrum, Lean, etc.).</li>\n<li>Contribute to the continuous improvement of internal processes and templates.</li>\n</ul>\n</li>\n</ol>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Degree in Business Administration, Information Technology, Computer Science, or related field (Recently Graduated).</li>\n<li>Strong analytical, problem-solving, and communication skills.</li>\n<li>Good command of English (verbal and written); ability to document clearly and concisely.</li>\n<li>Basic understanding of business processes, software development lifecycle (SDLC), and Agile methodologies.</li>\n<li>Proficiency in MS Office tools (Excel, Word, PowerPoint) and basic familiarity with Jira, Confluence, or similar tools.</li>\n<li>Ability to multitask and prioritise in a fast-paced environment.</li>\n<li>Proactive attitude with a strong willingness to learn and adapt.</li>\n<li>Strong passion and interest in the field.</li>\n</ul>\n<p><strong>To Apply:</strong> Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line \"Junior Business Analyst\".</p>",
        "tags": [
            "0-1 Years",
            "Business Analysis",
            "Agile Methodologies",
            "SaaS"
        ],
        "summary": "Seeking a Junior Business Analyst (Fresher) for requirement gathering, documentation, and stakeholder communication. Opportunity to gain experience in enterprise SaaS projects and Agile methodologies."
    },
    {
        "job_title": "Senior Software Engineer (PHP)",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/24913",
        "location": "Technopark",
        "closing_date": "13 Nov 2025",
        "job_description": "<h2>Senior Software Engineer (PHP)</h2>\n<p><strong>Company:</strong> Lean Transitions Solutions\n<strong>Location:</strong> Technopark Phase -1, Trivandrum , 695581\n<strong>Website:</strong> http://www.LeanTransitionSolutions.com\n<strong>Contact Email:</strong> careers@ltslean.com\n<strong>Published Date:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 13, Nov 2025</p>\n<h3>About Us:</h3>\n<p>Founded over a decade ago and headquartered in the United Kingdom, Lean Transition Solutions Ltd (LTS) is an ISO 9001:2015 certified company advocating Industry 4.0. LTS delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions for world-class organizations globally, including Fortune 500 companies. With global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico, our dedicated team ensures client requirements are met and our bespoke software solutions address industrial and manufacturing challenges. We foster a company culture built on core values: Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<h3>About the Role:</h3>\n<p>We are seeking a talented Senior Software Engineer to join our team. In this role, you will lead the design, development, and maintenance of software systems, collaborating closely with cross-functional teams to deliver innovative solutions that drive business growth.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and code web applications according to business requirements.</li>\n<li>Write well-designed, testable, and efficient code using best software development practices.</li>\n<li>Troubleshoot and resolve complex performance problems and architectural challenges.</li>\n<li>Improve the performance of existing applications.</li>\n<li>Integrate data from various back-end services and databases.</li>\n<li>Maintain, expand, and scale applications.</li>\n<li>Collaborate with cross-functional teams to deliver high-quality software solutions.</li>\n<li>Lead and mentor junior engineers, ensuring adherence to coding standards and technical skill growth.</li>\n<li>Participate in code reviews to maintain high-quality code standards.</li>\n<li>Work with DevOps teams to deploy and maintain applications in cloud environments (AWS, Azure, etc.).</li>\n<li>Stay up-to-date with PHP frameworks, new technologies, and industry trends.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li><strong>Experience:</strong> 5+ years of experience in web application programming.</li>\n<li><strong>Core Technologies:</strong> Strong proficiency in PHP and web-based application development.</li>\n<li><strong>Databases:</strong> In-depth knowledge of relational database systems (MySQL) and excellent relational database skills, particularly with MySQL.</li>\n<li><strong>Programming:</strong> Object-Oriented Programming (OOP).</li>\n<li><strong>Frameworks:</strong> Experience with PHP frameworks such as CodeIgniter, Laravel, or Symfony.</li>\n<li><strong>Front-end:</strong> Proficiency in front-end technologies (HTML5, CSS, JavaScript). Experience with front-end frameworks like Angular or React is a plus.</li>\n<li><strong>Methodologies:</strong> Solid understanding of Agile/Scrum development methodologies.</li>\n<li><strong>Problem Solving:</strong> Strong problem-solving, debugging skills, and strong logical thinking.</li>\n<li><strong>Quality:</strong> Attention to detail, ability to maintain a strong work ethic and produce high-quality, scalable code.</li>\n<li><strong>Teamwork:</strong> Ability to work independently and as part of a team.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line \"Senior Software Engineer-PHP\". Please include the following information in the email content:</p>\n<ul>\n<li>Current CTC:</li>\n<li>Expected CTC:</li>\n<li>Notice Period:</li>\n<li>Current Location:</li>\n<li>Total Relevant Experience:</li>\n<li>Willingness to work at office:</li>\n</ul>",
        "tags": [
            "5+ Years",
            "PHP",
            "MySQL",
            "Laravel"
        ],
        "summary": "Seeking a Senior Software Engineer with 5+ years of experience in PHP development. Responsibilities include design, development, and maintenance of web applications, mentoring junior engineers, and collaborating with cross-functional teams."
    },
    {
        "job_title": "Technical Lead – AI Transformation (Copilot Studio and Azure Open AI Service)",
        "company": "Altaire Insights Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24912",
        "location": "Technopark",
        "closing_date": "16 Nov 2025",
        "job_description": "<h2>Technical Lead – AI Transformation (Copilot Studio and Azure Open AI Service)</h2>\n<p><strong>Company:</strong> Altaire Insights Technologies (P) Ltd\n<strong>Location:</strong> Technopark Campus Phase 1, Trivandrum, 695581\n<strong>Website:</strong> https://www.altaire-insights.com\n<strong>Contact Email:</strong> hr@altaire-insights.com</p>\n<p><strong>Closing Date:</strong> 16, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>Altaire Insights Technologies is seeking a dynamic and innovative Technical Lead to spearhead the next generation of AI-powered enterprise transformation. This role offers a unique combination of hands-on technical development, AI exploration, and creative solution design, ideal for an individual aiming for future roles as a Solution Architect or Innovation Lead.</p>\n<h3>Key Responsibilities:</h3>\n<p><strong>AI Solution Development</strong>\n*   Develop and prototype solutions utilizing Microsoft Copilot Studio, Power Platform, and Azure OpenAI Service.\n*   Experiment with Large Language Model (LLM) integrations, advanced prompt engineering techniques, and intelligent workflow creation.</p>\n<p><strong>Technical Architecture &amp; Integration</strong>\n*   Integrate AI copilots with critical enterprise systems including Microsoft 365, Oracle ERP, HRMS, and CRM.\n*   Design and implement secure, scalable architectures leveraging Azure cloud services and REST APIs.</p>\n<p><strong>Collaboration &amp; Creativity</strong>\n*   Collaborate closely with designers, product owners, and business analysts to co-create intelligent user experiences.\n*   Translate complex business problems into practical, AI-augmented solutions.</p>\n<p><strong>R&amp;D and Innovation</strong>\n*   Continuously research and stay abreast of emerging AI technologies such as AI agents, Copilot extensions, and multi-agent frameworks.\n*   Lead innovation sprints and conduct internal demonstrations to rapidly test and validate new ideas.</p>\n<p><strong>Delivery &amp; Mentorship</strong>\n*   Ensure the technical quality and deployment readiness of client-facing AI projects.\n*   Provide guidance and mentorship to junior developers and freelancers in implementing AI solutions.</p>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Experience:</strong> 3–5 years in software development, AI/ML experimentation, or cloud-based solutions.</li>\n<li><strong>Core Skills:</strong> Proficiency with the Microsoft stack (Power Platform, Azure, M365), API integration, and programming languages like Python, JavaScript, or Node.js.</li>\n<li><strong>AI Curiosity:</strong> A strong passion for AI copilots, LLMs, and the development of intelligent digital agents.</li>\n<li><strong>Creative Mindset:</strong> Excellent UX awareness with the ability to envision AI-driven workflows beyond traditional coding.</li>\n<li><strong>Energy &amp; Ownership:</strong> Self-motivated, proactive, and capable of thriving in a fast-paced innovation environment.</li>\n<li><strong>Education:</strong> Bachelor’s degree in Computer Science, Engineering, or a related field. Specialization in AI or Cloud is preferred.</li>\n</ul>\n<p><strong>To Apply:</strong>\nIf you are interested in this exciting opportunity, please share your resume to hr@altaire-insights.com, including your current salary, expected salary, and notice period.</p>",
        "tags": [
            "3-5 Years",
            "Microsoft Copilot Studio",
            "Azure OpenAI Service",
            "Power Platform"
        ],
        "summary": "Seeking an energetic Technical Lead for AI transformation using Copilot Studio and Azure OpenAI. This role involves hands-on development, integration, and innovation in AI solutions."
    },
    {
        "job_title": "Senior Data Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24911",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Senior Data Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 14, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 10+ years of experience for this role.</p>\n<h3>Job Description</h3>\n<p>A minimum of 10 years of experience in data engineering, encompassing the development and scaling of data warehouse and data lake platforms.\nThe candidate should possess a strong background in Snowflake, demonstrating leadership in technical design, architecture, and implementation of complex data solutions.</p>\n<p><strong>Working Hours:</strong> 8 hours per day, with a few hours of overlap during the EST Time zone (mandatory for meetings). Working hours will be 12 PM - 9 PM.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead the design and architecture of data solutions leveraging Snowflake, ensuring scalability, performance, and reliability.</li>\n<li>Oversee the implementation of data pipelines, ETL processes, and data governance frameworks within Snowflake environments.</li>\n<li>Ensure efficient data extraction from SAP BW/ECC systems.</li>\n<li>Collaborate with stakeholders to understand business requirements and translate them into technical specifications and data models.</li>\n<li>Develop and maintain data architecture standards, guidelines, and best practices, including data governance principles and DataOps methodologies.</li>\n<li>Provide technical guidance and mentorship to data engineering teams, fostering skill development and knowledge sharing.</li>\n<li>Conduct performance tuning and optimization of Snowflake databases and queries.</li>\n<li>Stay updated on emerging trends and advancements in Snowflake, cloud data technologies, data governance, and DataOps practices.</li>\n</ul>\n<h3>Mandatory Skills:</h3>\n<ul>\n<li>Snowflake Experience</li>\n<li>Data Architecture Experience</li>\n<li>ETL Process Experience</li>\n<li>Large Data Migration Solutioning Experience</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Extensive experience in designing and implementing data solutions using Snowflake. DBT.</li>\n<li>Proficiency in data modeling, schema design, and optimization within Snowflake environments.</li>\n<li>Strong understanding of cloud data warehousing concepts and best practices, particularly with Snowflake.</li>\n<li>Expertise in Python/Java/Scala, SQL, ETL processes, and data integration techniques, with a focus on Snowflake.</li>\n<li>Familiarity with other cloud platforms and data technologies (e.g., AWS, Azure, GCP).</li>\n<li>Demonstrated experience in implementing data governance frameworks and DataOps practices.</li>\n<li>Familiarity with real-time streaming technologies and Change Data Capture (CDC) mechanisms.</li>\n<li>Knowledge of data governance principles and DataOps methodologies.</li>\n<li>Proven track record of architecting and delivering complex data solutions in cloud platforms/Snowflake.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Understanding of SAP BW/ECC systems, including data extraction, transformation, and loading (ETL/ELT) processes.</li>\n<li>Experience with data visualization tools (e.g., Tableau, Power BI) is a plus.</li>\n<li>Experience in designing, developing, and implementing SAP ABAP programs, reports, interfaces, and enhancements.</li>\n<li>Working experience in SAP environments.</li>\n<li>Knowledge of data security and compliance standards.</li>\n<li>Proficiency in SAP ABAP (Advanced Business Application Programming) development.</li>\n<li>Excellent communication and presentation skills, with the ability to convey complex technical concepts to juniors and non-technical stakeholders.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Ability to work effectively in a collaborative team environment and lead cross-functional initiatives.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment-related emails are sent through the official HR email ID. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "10+ Years",
            "Snowflake",
            "Data Architecture",
            "ETL"
        ],
        "summary": "Seeking a Senior Data Architect with 10+ years of experience in data engineering and Snowflake. Responsibilities include designing, implementing, and optimizing complex data solutions."
    },
    {
        "job_title": "SAP ABAP Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24909",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>SAP ABAP Developer at Reflections Info Systems (P) Ltd</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 4+ years of experience for this role.</p>\n<h3>Job Description</h3>\n<p>We are seeking candidates with strong proficiency in SAP ABAP (Advanced Business Application Programming) development. The role involves experience in designing, developing, and implementing SAP ABAP programs, reports, interfaces, and enhancements.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and enhance SAP applications using ABAP programming language based on functional specifications.</li>\n<li>Debug and fix ABAP programs for incident resolution.</li>\n<li>Work with functional teams to design technical solutions.</li>\n<li>Design and implement custom reports, interfaces, enhancements, and forms (RICEF objects) in SAP systems.</li>\n<li>Perform unit testing, debugging, and troubleshooting of ABAP programs to ensure quality and performance.</li>\n<li>Collaborate with functional consultants and business users to gather requirements and deliver solutions aligned with business needs.</li>\n<li>Provide technical support and expertise for SAP ABAP development activities.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>3-5 years of experience as an SAP ABAP Developer, with hands-on experience in ABAP development and customization.</li>\n<li>Proficiency in SAP ABAP (Advanced Business Application Programming) development.</li>\n<li>Experience in designing, developing, and implementing SAP ABAP programs, reports, interfaces, and enhancements.</li>\n<li>Strong understanding of SAP data dictionary objects, modules, and integration with other SAP modules.</li>\n<li>Knowledge of SAP development tools and methodologies.</li>\n<li>Develop OData services, CDS Views for integration with Fiori/UI5 and optimize HANA code.</li>\n<li>Experience with SAP ECC (ERP Central Component) or S/4HANA is preferred.</li>\n<li>Perform code reviews and enforce development standards (SAP Clean Core principles).</li>\n<li>Collaborate in migration projects (ECC to S/4 HANA conversions).</li>\n<li>Knowledge of ABAP on HANA optimization techniques preferred.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Good analytical and problem-solving skills, with attention to detail.</li>\n<li>Effective communication and interpersonal skills to collaborate with cross-functional teams.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n<li>ABAP on HANA and Fiori/UI5.</li>\n</ul>\n<h3>Certifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field.</li>\n<li>SAP Certified Development Associate – ABAP for SAP NetWeaver or S/4 HANA.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Recruitment</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "4+ Years",
            "SAP ABAP",
            "HANA",
            "Fiori/UI5"
        ],
        "summary": "Seeking an experienced SAP ABAP Developer to design, develop, and implement SAP applications. Responsibilities include coding, debugging, unit testing, and collaborating with functional teams."
    },
    {
        "job_title": "Full Stack Developer (Angular+Nodejs)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24908",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Full Stack Developer (Angular + Node.js) at Reflections Info Systems (P) Ltd</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>The full-stack software engineer’s primary job role will be to design and develop solutions using NodeJS, and related technologies. This includes developing backend services and corresponding client-side counterparts.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, test, and maintain high-quality web applications using Angular (version 16+).</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Ensure the technical feasibility of UI/UX designs.</li>\n<li>Participate in code reviews, providing constructive feedback to peers.</li>\n<li>Troubleshoot and debug applications, ensuring optimal performance.</li>\n<li>Stay up-to-date with emerging trends and technologies in front-end development.</li>\n<li>Mentor and guide junior developers, fostering a collaborative and productive work environment.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Minimum of 4 years of professional experience in front-end development.</li>\n<li>Strong proficiency in Angular (version 16+) and related technologies.</li>\n<li>Node JS, Nest JS, Kafka, Redis, Javascript, HTML, CSS</li>\n<li>RESTful API integration</li>\n<li>Experience working with Docker and containerized applications</li>\n<li>Experience working with Kubernetes or other container orchestration tools</li>\n<li>Hands-on knowledge and understanding of AWS environments</li>\n<li>Experience in full-stack development</li>\n<li>Knowledge of RDBMS and Document Database</li>\n<li>Experience with Agile and Scrum development methodologies</li>\n<li>Exposure to continuous integration (CI/CD)</li>\n<li>Knowledge of version control systems such as Git and TFS</li>\n<li>Good analytical and problem-solving skills</li>\n<li>Up-to-date knowledge of latest technologies, tools, and platforms</li>\n<li>Ability to complete tasks with minimum supervision</li>\n<li>Ability to play a leadership role</li>\n</ul>\n<p><strong>Technical Stack:</strong></p>\n<ul>\n<li>Node JS</li>\n<li>Nest JS framework</li>\n<li>Angular</li>\n<li>Kafka / Event architecture / RabbitMQ</li>\n<li>Redis / Caching</li>\n<li>Javascript</li>\n<li>HTML, CSS</li>\n<li>Microservices &amp; Cloud</li>\n<li>Knowledge / Understanding in continuous integration (CI/CD)</li>\n<li>RDBMS / NoSQL / MongoDB</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Knowledge in Laravel is an addon</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note on Fraudulent Recruitment:</strong></p>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "4+ Years",
            "Angular",
            "Node.js",
            "AWS"
        ],
        "summary": "Seeking a Full Stack Developer proficient in Angular and Node.js. Responsibilities include developing, testing, and optimizing web applications, with a focus on collaboration and mentorship."
    },
    {
        "job_title": "Senior DotNet Developer + Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24907",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Senior DotNet Developer + Azure</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025\n<strong>Working Hours:</strong> 12:00 PM - 9:00 PM</p>\n<h3>Brief Description</h3>\n<p>Reflections Info Systems (P) Ltd is seeking experienced Senior DotNet Developers with Azure expertise. The ideal candidate will have 8+ years of experience in designing, developing, and maintaining robust applications using modern technologies.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, enhance, document, and maintain robust applications using .NET Core 6/8+, C#, REST APIs, T-SQL, and modern JavaScript/jQuery.</li>\n<li>Integrate and support third-party APIs and external services.</li>\n<li>Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack.</li>\n<li>Identify, prioritize, and execute tasks throughout the Software Development Life Cycle (SDLC).</li>\n<li>Participate in Agile/Scrum ceremonies and manage tasks using Jira.</li>\n<li>Understand technical priorities, architectural dependencies, risks, and implementation challenges.</li>\n<li>Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>8+ years of hands-on development experience with:<ul>\n<li>C#, .NET Core 6/8+, Entity Framework / EF Core</li>\n<li>JavaScript, jQuery, REST APIs</li>\n</ul>\n</li>\n<li>Expertise in MS SQL Server, including:<ul>\n<li>Complex SQL queries, Stored Procedures, Views, Functions, Packages, Cursors, Tables, and Object Types</li>\n</ul>\n</li>\n<li>Skilled in unit testing with XUnit, MSTest.</li>\n<li>Strong in software design patterns, system architecture, and scalable solution design.</li>\n<li>Ability to lead and inspire teams through clear communication, technical mentorship, and ownership.</li>\n<li>Strong problem-solving and debugging capabilities.</li>\n<li>Ability to write reusable, testable, and efficient code.</li>\n<li>Develop and maintain frameworks and shared libraries to support large-scale applications.</li>\n<li>Excellent technical documentation, communication, and leadership skills.</li>\n<li>Microservices and Service-Oriented Architecture (SOA).</li>\n<li>\n<p>Experience in API Integrations.</p>\n</li>\n<li>\n<p>2+ years of hands with Azure Cloud Services, including:</p>\n<ul>\n<li>Azure Functions</li>\n<li>Azure Durable Functions</li>\n<li>Azure Service Bus, Event Grid, Storage Queues</li>\n<li>Blob Storage, Azure Key Vault, SQL Azure</li>\n<li>Application Insights, Azure Monitoring</li>\n</ul>\n</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Familiarity with AngularJS, ReactJS, and other front-end frameworks.</li>\n<li>Experience with Azure API Management (APIM).</li>\n<li>Knowledge of Azure Containerization and Orchestration (e.g., AKS/Kubernetes).</li>\n<li>Experience with Azure Data Factory (ADF) and Logic Apps.</li>\n<li>Exposure to Application Support and operational monitoring.</li>\n<li>Azure DevOps - CI/CD pipelines (Classic / YAML).</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates may forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact <strong>careers@reflectionsinfos.com</strong> for any clarification/ alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Azure",
            "C#"
        ],
        "summary": "Seeking an experienced Senior DotNet Developer with Azure skills. Responsibilities include application design, development, integration, and troubleshooting in an Agile environment."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24906",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Delivery Manager - Reflections Info Systems (P) Ltd</h2>\n<p><strong>Location:</strong> Thiruvananthapuram, Kerala, India\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Brief Description</strong></p>\n<p>Reflections Info Systems is seeking a seasoned Technical Delivery Manager with over 14 years of experience to lead the successful delivery of complex technical projects and solutions. The ideal candidate will possess a strong technology background, exceptional project management skills, and the ability to collaborate effectively with cross-functional teams. This role demands end-to-end ownership of project delivery, ensuring alignment with business objectives, managing stakeholder expectations, and driving technical excellence.</p>\n<p><strong>Responsibilities</strong></p>\n<p><strong>Project Delivery Management:</strong>\n- Oversee the planning, execution, and delivery of multiple technical projects.\n- Manage project scope, timelines, budgets, risks, and quality.\n- Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n<p><strong>Team Leadership:</strong>\n- Lead and mentor cross-functional technical teams, fostering collaboration and innovation.\n- Conduct regular performance reviews and provide growth opportunities for team members.</p>\n<p><strong>Stakeholder Engagement:</strong>\n- Act as a bridge between technical teams, business stakeholders, and clients.\n- Communicate project status, risks, and solutions effectively to all stakeholders.</p>\n<p><strong>Technical Expertise:</strong>\n- Collaborate with architects and engineers to define technical solutions.\n- Provide input on architecture, design, and implementation strategies.</p>\n<p><strong>Process Improvement:</strong>\n- Identify opportunities to improve project delivery processes and tools.\n- Implement best practices in software development and delivery.</p>\n<p><strong>Risk and Issue Management:</strong>\n- Proactively identify project risks and develop mitigation strategies.\n- Resolve technical and operational challenges in a timely manner.</p>\n<p><strong>Customer Focus:</strong>\n- Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</p>\n<p><strong>Preferred Skills &amp; Experience</strong></p>\n<p><strong>Experience:</strong>\n- 14 years of experience in technology delivery roles, including hands-on development and leadership responsibilities.\n- Proven experience in delivering large-scale, complex projects with diverse teams.\n- Manage P&amp;L for a portfolio of accounts, ensuring revenue growth and profitability.\n- Plan and manage team ramp-ups and ramp-downs using a mix of pyramid planning, external hiring, and internal sourcing.\n- Drive account management activities including financial tracking, invoice collection, margin improvements, and resource planning.\n- Build strong client relationships through regular interactions, QBRs, and on-site visits.\n- Support account mining by identifying new opportunities, preparing proposals, and influencing stakeholders to grow the business.</p>\n<p><strong>Technical Expertise:</strong>\n- Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.\n- Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</p>\n<p><strong>Project Management:</strong>\n- Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.\n- Certification such as PMP, CSM, or equivalent is an advantage.</p>\n<p><strong>Leadership and Communication:</strong>\n- Excellent team leadership, people management, and conflict resolution skills.\n- Strong communication, presentation, and negotiation abilities.</p>\n<p><strong>Education</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</li>\n</ul>\n<p><strong>Secondary Skills</strong></p>\n<ul>\n<li>Experience in managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices and frameworks.</li>\n<li>Strong business acumen with the ability to align technical goals with business strategy.</li>\n</ul>\n<p><strong>Application Instructions</strong></p>\n<p>Interested candidates are invited to forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Fraudulent Job Offers:</strong></p>\n<p>It has come to our attention that some individuals are fraudulently promising jobs at Reflections Info Systems for a fee. Please be aware that Reflections Info Systems never requests payment for job opportunities. We communicate with candidates exclusively through our official website or LinkedIn. All employment-related emails are sent from our official HR email address. For any clarifications or alerts regarding this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "14+ Years",
            "Agile",
            "Cloud Technologies",
            "Project Management"
        ],
        "summary": "Seeking a seasoned Technical Delivery Manager with 14+ years of experience. Oversee complex project delivery, lead cross-functional teams, and drive technical excellence."
    },
    {
        "job_title": "Technical Project Manager (Application Development)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24905",
        "location": "Technopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>Technical Project Manager (Application Development)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 14, Nov 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>Reflections Info Systems is seeking a highly experienced Technical Project Manager (Tech PM) with over 13 years of experience to lead the complete execution of custom application development and integration projects. This role primarily involves projects built on .NET stacks, utilizing modern client frameworks and integration platforms. The ideal candidate will possess a robust technical background and proven project delivery expertise, enabling them to manage complex, cross-functional initiatives from initial discovery through to production rollout. This position requires hands-on experience across the entire software/product development lifecycle, encompassing planning, estimation, design, development, testing, and release, with close collaboration with engineering, product, and client stakeholders.</p>\n<h3>Job Description</h3>\n<ul>\n<li>Manage the end-to-end delivery of custom software development and integration projects, with a focus on Java, .NET, and associated technologies.</li>\n<li>Develop and maintain comprehensive project plans, define project timelines, identify critical dependencies, and rigorously track project progress.</li>\n<li>Coordinate effectively with cross-functional teams, including developers, QA engineers, UI/UX designers, and DevOps specialists, to ensure seamless project execution.</li>\n<li>Oversee all phases of the Software Development Life Cycle (SDLC), including requirements finalization, development, integration, various testing stages (unit, system, UAT, NFR), and deployment.</li>\n<li>Collaborate closely with architects and technical leads to guarantee alignment with the established technical direction and design principles.</li>\n<li>Proactively identify and manage project risks, scope changes, and necessary schedule adjustments.</li>\n<li>Act as the primary point of contact for clients and stakeholders, providing regular, transparent updates and efficiently resolving any arising issues.</li>\n<li>Ensure high quality and timely project delivery through effective team coordination and clear, consistent communication.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Technical &amp; Delivery Expertise</strong></p>\n<ul>\n<li>Minimum 13 years of overall IT experience, with a dedicated 4–6 years in Technical Project Management.</li>\n<li>Strong technical understanding of custom application development, particularly on Java/.NET stacks.</li>\n<li>Proven experience managing:</li>\n<li>Backend and API development.</li>\n<li>Integrations using tools such as Apache Camel and the IBM Integration Stack.</li>\n<li>Database interactions with Oracle and SQL Server.</li>\n<li>Client-side development utilizing React/Angular.</li>\n<li>Deployments on cloud platforms like AWS and Azure.</li>\n<li>Familiarity with Microservices architecture, CI/CD pipelines, and DevOps best practices.</li>\n</ul>\n<p><strong>Project Management</strong></p>\n<ul>\n<li>Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li>Hands-on experience in managing scope and schedule changes, stakeholder communication, and issue escalation processes.</li>\n<li>Proficiency with project management tools such as Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</li>\n</ul>\n<p><strong>Secondary Skills</strong></p>\n<ul>\n<li>Experience managing globally distributed teams.</li>\n<li>Solid understanding of enterprise-level integrations and complex technology ecosystems.</li>\n</ul>\n<p><strong>Soft Skills</strong></p>\n<ul>\n<li>Exceptional communication and stakeholder engagement capabilities.</li>\n<li>Strong leadership, problem-solving, and organizational abilities.</li>\n<li>Demonstrated ability to articulate technical concepts clearly to both technical and non-technical audiences.</li>\n</ul>\n<h3>Important Notice</h3>\n<p>Interested candidates are invited to submit their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current and expected CTC details. </p>\n<p>Please be aware that Reflections Info Systems does not charge any fees for job applications. Be cautious of individuals falsely claiming to offer employment with our company for a fee. We communicate with candidates exclusively through our official website or LinkedIn. All official employment-related emails will originate from our official HR email address. For any clarifications or to report suspicious activity, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Java",
            "Project Management"
        ],
        "summary": "Seeking an experienced Technical Project Manager to lead custom application development and integration projects. Requires strong technical skills and expertise in full SDLC delivery."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Innure Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/24904",
        "location": "Technopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>Business Development Executive at Innure Infotech (P) Ltd</h2>\n<p><strong>Company:</strong> ScaleVel LLP (a fast-growing technology and digital services company based in Technopark, Trivandrum specializing in AI-powered SaaS products, digital marketing, and business automation solutions.)\n<strong>Website:</strong> http://www.innure.com\n<strong>Location:</strong> Module No-14, 4th Floor, Nila Building, Technopark Campus, Trivandrum, 695581</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> November 10, 2025\n*   <strong>Time:</strong> 10:30:00 AM - 12:30:00 PM</p>\n<p><strong>Job Published:</strong> November 7, 2025</p>\n<p><strong>Contact Email:</strong> info@scalevel.in\n<strong>Contact Phone:</strong> +91 85928 18553</p>\n<h3>Job Description:</h3>\n<p>ScaleVel LLP's mission is to help businesses grow through innovation, intelligent automation, and measurable results.</p>\n<p><strong>Responsibilities:</strong>\n- Identify, research, and approach potential clients through various channels (LinkedIn, calls, email, and networking).\n- Present and promote ScaleVel’s software solutions and digital services to target customers.\n- Manage leads from enquiry to closure with CRM-based tracking.\n- Collaborate with marketing and technical teams to create tailored proposals.\n- Achieve monthly and quarterly sales targets.\n- Maintain strong follow-ups and long-term client relationships.\n- Attend meetings, demos, and client discussions (online/offline).</p>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, or related field.</li>\n<li>Minimum 1 year of experience in sales, business development, or client acquisition (IT or SaaS preferred).</li>\n<li>Excellent communication and negotiation skills.</li>\n<li>Strong understanding of digital marketing, SaaS, or IT services (training will be provided).</li>\n<li>Ability to work independently with a result-oriented mindset.</li>\n</ul>\n<h3>Walk-In Venue &amp; Entry Process:</h3>\n<ul>\n<li><strong>CV Submission:</strong> Send your CV to info@scalevel.in</li>\n<li><strong>Technopark Entry Pass:</strong> Candidates must apply for an entry pass to Technopark Campus via the mobile app or web browser (vms.technopark.org). The pass will be sent to their registered mobile number/email ID. Show the softcopy at the Technopark Entrance Gate.</li>\n<li><strong>For Non-Smartphone Users:</strong> Print a hardcopy of the entry pass from self-operating Kiosks at the Reception Building near the Main Gate using the 5-digit OTP received via SMS/email.</li>\n<li><strong>Mobile Apps:</strong><ul>\n<li>Android: [Click here to download]</li>\n<li>iOS: [Click here to download]</li>\n</ul>\n</li>\n<li><strong>User Manual:</strong> [Click here for the User Manual]</li>\n<li><strong>Note:</strong> Original certificates will be verified at the Entry Gate for Walk-In interview entry.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Sales",
            "Business Development",
            "SaaS"
        ],
        "summary": "Business Development Executive sought for a technology company. Responsibilities include client acquisition, sales, and relationship management. Requires sales experience and strong communication skills."
    },
    {
        "job_title": "Sales Expert - Refinance",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24903",
        "location": "Technopark",
        "closing_date": "22 Nov 2025",
        "job_description": "<h2>Sales Expert - Refinance</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 22, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and recognized as the top Product in Insurance by UnitQ, Way.com is dedicated to making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Sales Expert</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking dynamic, customer-focused Sales Experts to join our Refinance Team. In this role, you will be the voice of our product, engaging directly with customers to understand their needs and help them choose the best refinance solutions. This is a B2C sales role where strong communication, persuasion, and a passion for sales are essential.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Engage with potential customers through inbound and outbound calls, emails, and chats.</li>\n<li>Clearly explain refinance products, features, and benefits to customers.</li>\n<li>Build trust and rapport with customers to convert inquiries into successful sales.</li>\n<li>Consistently achieve individual and team sales targets.</li>\n<li>Maintain accurate records of customer interactions and transactions in CRM systems.</li>\n<li>Collaborate with Customer Support, Product, and Marketing teams to ensure a smooth post-sale experience.</li>\n<li>Stay updated on product knowledge, process updates, and industry trends.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in any discipline (preferably Business or Engineering).</li>\n<li>2–5 years of experience in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and experience with CRM tools.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "B2C Sales",
            "CRM",
            "English Communication"
        ],
        "summary": "Way.com seeks B2C Sales Experts for its Refinance Team. Engage customers, explain products, and drive sales to achieve targets in this on-site, full-time role."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Innure Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/24902",
        "location": "Technopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Company:</strong> Innure Infotech (P) Ltd (ScaleVel LLP)\n<strong>Location:</strong> Module No-14, 4th Floor, Nila Building, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> http://www.innure.com</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> November 10, 2025\n*   <strong>Time:</strong> 10:30 AM - 12:30 PM</p>\n<p><strong>Job Published:</strong> November 07, 2025</p>\n<p><strong>Contact Email:</strong> info@scalevel.in\n<strong>Contact Phone:</strong> +91 85928 18553</p>\n<h3>Brief Description</h3>\n<p>ScaleVel LLP is a fast-growing technology and digital services company based in Technopark, Trivandrum. We specialize in AI-powered SaaS products, digital marketing, and business automation solutions. Our mission is to help businesses grow through innovation, intelligent automation, and measurable results.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Identify, research, and approach potential clients through various channels (LinkedIn, calls, email, and networking).</li>\n<li>Present and promote ScaleVel’s software solutions and digital services to target customers.</li>\n<li>Manage leads from enquiry to closure with CRM-based tracking.</li>\n<li>Collaborate with marketing and technical teams to create tailored proposals.</li>\n<li>Achieve monthly and quarterly sales targets.</li>\n<li>Maintain strong follow-ups and long-term client relationships.</li>\n<li>Attend meetings, demos, and client discussions (online/offline).</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, or related field.</li>\n<li>Minimum 1 year of experience in sales, business development, or client acquisition (IT or SaaS preferred).</li>\n<li>Excellent communication and negotiation skills.</li>\n<li>Strong understanding of digital marketing, SaaS, or IT services (training will be provided).</li>\n<li>Ability to work independently with a result-oriented mindset.</li>\n</ul>\n<h3>Walk-In Venue &amp; Instructions:</h3>\n<ul>\n<li><strong>Send CV to:</strong> info@scalevel.in</li>\n<li><strong>Visit:</strong> https://scalevel.in</li>\n</ul>\n<p><strong>Technopark Campus Entry Pass:</strong>\nCandidates are requested to apply for the entry pass to Technopark Campus via the mobile app or web browser. Once applied, the entry pass will be sent to their registered mobile number/email ID. Show the softcopy of the entry pass on your gadget at the Technopark Entrance Gate.</p>\n<p><strong>For candidates without smartphones:</strong> Print your hardcopy entry pass from self-operating kiosks at the Reception Building near the TECHNOPARK Main Gate using the 5-digit OTP received via SMS/email.</p>\n<ul>\n<li><strong>Mobile App (Android):</strong> [Click here to download]</li>\n<li><strong>Mobile App (iOS):</strong> [Click here to download]</li>\n<li><strong>Website URL for Pass:</strong> vms.technopark.org</li>\n<li><strong>User Manual:</strong> [Click here]</li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for Walk-In interview entry.</p>",
        "tags": [
            "1+ Years",
            "Sales",
            "SaaS",
            "Business Development"
        ],
        "summary": "Seeking a Business Development Executive for ScaleVel LLP to identify clients, promote SaaS solutions, and manage leads. Requires 1 year of sales experience and excellent communication skills."
    },
    {
        "job_title": "QUALITY CONTROL MANAGER",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24900",
        "location": "Technopark",
        "closing_date": "18 Nov 2025",
        "job_description": "<h2>Quality Control Manager</h2>\n<p><strong>Company:</strong> Yarab Technologies (P) Ltd\n<strong>Location:</strong> Module No: 2706, 7th Floor, Yamuna building, Phase-III Campus, Technopark, Kazhakootam, 695581\n<strong>Website:</strong> http://www.yrtechnologies.co.in\n<strong>Contact Email:</strong> jobs@yarabltd.co.uk</p>\n<p><strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 18, Nov 2025</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage an effective regulatory compliance program.</li>\n<li>Adhere to and maintain integrity of the Quality Control Department's operational policies.</li>\n<li>Report to Management on the compliance risks and issues through detailed reports, proactively.</li>\n<li>Create and manage effective action plans in response to audit discrepancies and compliance violations.</li>\n<li>Regularly audit operational areas, transactions, and communication.</li>\n<li>Assess company operations to determine compliance risk and suggest corrective action plans.</li>\n<li>Ensure all employees are educated on the latest regulations and processes.</li>\n<li>Resolve employee concerns about regulatory compliance.</li>\n<li>Serve as SPOC (Single Point of Contact) for U.K Counterparts.</li>\n<li>Manage and develop initial and ongoing training programs.</li>\n<li>Creation and submission of Weekly and Monthly Reports.</li>\n<li>Manage the end-to-end lifecycle of insurance schemes, ensuring market relevance and profitability.</li>\n<li>Develop and maintain strong relationships with brokers, insurers, and stakeholders.</li>\n<li>Monitor scheme performance, analyzing key metrics to drive continuous improvement.</li>\n<li>Ensure all schemes comply with UK regulatory standards and industry best practices.</li>\n<li>Identify opportunities to innovate and expand the portfolio of insurance schemes.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Multitasker</li>\n<li>Excellent communication skills (both written and verbal)</li>\n<li>Goal Oriented</li>\n<li>Strong Leadership qualities</li>\n<li>Excellent knowledge of MS Office</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Regulatory Compliance",
            "Quality Control",
            "Insurance Schemes"
        ],
        "summary": "Manage regulatory compliance and insurance schemes. Ensure operational integrity and profitability, maintaining relationships with stakeholders and driving continuous improvement."
    },
    {
        "job_title": "Product & UI/UX Designer (Exp:2+ Yrs )",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24899",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>Product &amp; UI/UX Designer</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai\n<strong>Closing Date:</strong> 22, Dec 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a talented Product &amp; UI/UX Designer who can transform our software into intuitive, user-friendly products that delight our clients.</p>\n<p><strong>Role Overview:</strong>\nAs a Product &amp; UI/UX Designer, you will own the end-to-end design process, from understanding user needs to crafting visually appealing interfaces and ensuring a seamless user experience. You will collaborate with product managers, engineers, and stakeholders to balance innovation with practical, effective solutions.</p>\n<p><strong>Responsibilities:</strong>\n- Conduct user research, interviews, and competitor analysis in collaboration with product managers and engineers.\n- Translate insights into wireframes, storyboards, user flows, sitemaps, and prototypes.\n- Design and develop graphic user interface elements, including menus, tabs, widgets, and interactive components.\n- Build UI mock-ups and prototypes to clearly illustrate product functionality and look.\n- Create original graphic designs and present drafts to internal teams and stakeholders.\n- Identify and troubleshoot UX issues, making adjustments based on user feedback and usability testing.\n- Ensure products are usable, accessible, and enjoyable for end users.\n- Collaborate with cross-functional teams to align design with product strategy and goals.\n- Maintain design consistency and adhere to brand guidelines across all digital products.</p>\n<p><strong>Preferred Skills:</strong>\n- Bachelor’s/Master’s/Diploma in Design or related field preferred.\n- Strong portfolio of design projects.\n- Proficiency in Photoshop and wire framing/prototyping tools (Figma, Sketch, etc.).\n- Knowledge of HTML, CSS, and Bootstrap is a plus.\n- Good understanding of colour, typography, layout, and interactive design.\n- Strong communication and teamwork skills.</p>\n<p><strong>Experience Required:</strong> 2 plus years.\n<strong>Work Arrangement:</strong> Work From Office\n<strong>Work Location:</strong> Trivandrum\n<strong>Salary Package:</strong> 5-7 LPA</p>",
        "tags": [
            "2+ Years",
            "UI/UX Design",
            "Figma",
            "Photoshop"
        ],
        "summary": "Seeking a Product & UI/UX Designer with 2+ years of experience to create intuitive and user-friendly software interfaces. Responsibilities include user research, prototyping, and collaborating with cross-functional teams."
    },
    {
        "job_title": "Senior Quality Control Analyst – Insurance Domain",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24898",
        "location": "Technopark",
        "closing_date": "18 Nov 2025",
        "job_description": "<h2>Senior Quality Control Analyst – Insurance Domain</h2>\n<p><strong>Company:</strong> Yarab Technologies (P) Ltd\n<strong>Location:</strong> Module No: 2706, 7th Floor, Yamuna building, Phase-III Campus, Technopark, Kazhakootam, 695581\n<strong>Website:</strong> http://www.yrtechnologies.co.in\n<strong>Contact Email:</strong> jobs@yarabltd.co.uk\n<strong>Published Date:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 18, Nov 2025</p>\n<h3>Job Summary</h3>\n<p>The Senior Quality Control Analyst is responsible for maintaining quality excellence and compliance integrity across insurance operations. The role involves performing quality audits, compliance checks, performance analysis, and implementing improvement measures to ensure accuracy, efficiency, and adherence to regulatory and organizational standards.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead and perform process and call quality audits across insurance functions including claims, sales, and servicing.</li>\n<li>Ensure adherence to company policies, operational frameworks, and compliance requirements.</li>\n<li>Identify process gaps, analyze root causes, and implement corrective and preventive actions.</li>\n<li>Oversee quality review of high-priority activities such as claim assessments, chargeback monitoring, and investigation reports.</li>\n<li>Evaluate team performance against KPIs, accuracy, and compliance metrics.</li>\n<li>Analyze quality trends and provide insights to management for decision-making and process optimization.</li>\n<li>Prepare weekly and monthly audit reports, compliance summaries, and performance dashboards.</li>\n<li>Maintain proper documentation and ensure audit readiness for internal and external reviews.</li>\n<li>Conduct refresher training and assessments to enhance process understanding and compliance awareness.</li>\n<li>Mentor quality team members and provide support for onboarding and development of new analysts.</li>\n<li>Participate in strategic audits, compliance reviews, and new product or scheme implementations.</li>\n<li>Act as subject matter expert (SME) in insurance quality standards and regulatory frameworks.</li>\n</ul>\n<h3>Skills and Competencies</h3>\n<ul>\n<li>Strong knowledge of insurance operations, claims handling and compliance standards.</li>\n<li>Excellent analytical and audit review skills with high attention to detail.</li>\n<li>Proficiency in ERP systems, MS Excel, Power BI and quality monitoring tools.</li>\n<li>Strong communication, documentation and report presentation abilities.</li>\n<li>Leadership skills with the ability to guide and mentor team members.</li>\n<li>Problem-solving mindset with a focus on process improvement and risk mitigation.</li>\n</ul>\n<h3>Qualifications and Experience</h3>\n<ul>\n<li>Bachelor’s degree in Insurance, Business Administration, Finance, or related field.</li>\n<li>Minimum 5 years of experience in quality control, audit or compliance within the insurance domain.</li>\n<li>Certification in Six Sigma, ISO Quality Management or related field preferred.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Insurance",
            "Quality Audits",
            "Compliance"
        ],
        "summary": "Senior Quality Control Analyst ensures insurance operations' quality and compliance. Responsibilities include audits, analysis, and implementing improvements for accuracy and efficiency."
    },
    {
        "job_title": "Junior Devops Technical Support Engineer",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24897",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>Junior DevOps Technical Support Engineer</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, 2nd Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 22, Dec 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<p><strong>Salary Package:</strong> 4 - 6 LPA\n<strong>Work Arrangement:</strong> Work From Office, Trivandrum</p>\n<h3>Brief Description</h3>\n<p>REIZEND (P) Ltd is seeking a proactive and highly skilled Technical Support Engineer with 0.5-2 years of experience to provide exceptional technical support to overseas projects. This role requires working in rotational shifts to ensure 24/7 availability. The position involves troubleshooting complex issues across cloud platforms, networking, application architectures, and DevOps toolchains. The ideal candidate should be self-motivated, a collaborator, agile, and a continuous learner.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Provide technical support and troubleshoot issues related to cloud platforms and services such as Fargate, ECS, DynamoDB, BigQuery, SNS, etc.</li>\n<li>Understand problems by consuming logs and metrics from various sources using services like CloudWatch, Prometheus, Grafana, Loki, Alert Managers, and Splunk.</li>\n<li>Analyze and resolve networking challenges, including load balancers, API gateways, reverse proxies, ingress controllers, and service-to-service communications.</li>\n<li>Work on issues related to client-server communications, firewalls, and virtual machines.</li>\n<li>Collaborate with DevOps teams to manage and troubleshoot toolchains like Docker, Kubernetes, Jenkins, Ingress Controllers, etc.</li>\n<li>Act as the first point of contact for technical queries and escalate issues when necessary.</li>\n<li>Liaise with development and operations teams to identify root causes and resolve incidents effectively.</li>\n<li>Document troubleshooting steps, solutions, and maintain a knowledge base for recurring issues.</li>\n<li>Collaborate with cross-functional teams to implement best practices for monitoring and incident response.</li>\n<li>Participate in shift handovers and provide timely updates on ongoing issues.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Cloud Platforms and Services</h3>\n<ul>\n<li>Hands-on knowledge working with Fargate and ECS for managing and troubleshooting containerized workloads.</li>\n<li>Proficiency with DynamoDB and BigQuery for analyzing data and making informed decisions.</li>\n<li>Hands-on knowledge of SNS for debugging message delivery issues and integration workflows.</li>\n</ul>\n<h3>Monitoring and Logging Tools</h3>\n<ul>\n<li>Proficiency in CloudWatch Logs, Loki, and Splunk for consuming and analyzing logs to identify and resolve issues.</li>\n<li>Hands-on knowledge with Prometheus and Grafana for analyzing metrics using dashboards and monitoring system health.</li>\n<li>Knowledge of Alert Manager for configuring and managing alert escalation.</li>\n<li>Ability to interpret metrics from various sources and create actionable insights.</li>\n</ul>\n<h3>Networking and Security</h3>\n<ul>\n<li>Understanding of load balancers (e.g., ALB, NLB) for distributing traffic and troubleshooting connectivity issues.</li>\n<li>Knowledge in API Gateways like AWS API Gateway or NGINX for managing API traffic.</li>\n<li>Knowledge of reverse proxies and ingress controllers (e.g., NGINX Ingress, Traefik) for managing internal/external traffic.</li>\n<li>Understanding service-to-service communications, including DNS, HTTP/HTTPS, and gRPC protocols.</li>\n<li>Hands-on knowledge with firewalls, security groups, and IAM roles for secure communications.</li>\n<li>Troubleshooting skills for VM-related issues in platforms like AWS EC2 or equivalent.</li>\n</ul>\n<h3>DevOps Toolchains</h3>\n<ul>\n<li>Proficiency with Docker for managing container images and runtime debugging.</li>\n<li>Understanding of Kubernetes concepts for managing deployments, ingress setups, and pod-related issues, including related troubleshooting commands and mechanisms.</li>\n<li>Knowledge of CI/CD pipeline building tools such as Jenkins, GitHub Actions, ArgoCD for building, deploying, and managing automated pipelines.</li>\n<li>Understanding of Ingress controllers (e.g., NGINX, Traefik) and SSL termination for secure routing.</li>\n</ul>\n<h3>Troubleshooting and Incident Management</h3>\n<ul>\n<li>Strong problem-solving skills to identify root causes using logs, metrics, and system-level debugging.</li>\n<li>Ability to document detailed troubleshooting steps and solutions for recurring issues.</li>\n</ul>\n<h3>Collaboration and Communication</h3>\n<ul>\n<li>Ability to work with cross-functional teams (DevOps, development, and operations) to resolve incidents.</li>\n<li>Skills in effective and proactive communication to escalate issues and provide updates during shift handovers.</li>\n<li>Proficiency with tools like Slack, JIRA, Confluence, or Google Workspace for collaboration and issue tracking.</li>\n</ul>",
        "tags": [
            "0.5-2 Years",
            "DevOps",
            "Cloud Platforms",
            "Technical Support"
        ],
        "summary": "Seeking a Technical Support Engineer with 0.5-2 years experience for a work-from-office role in Trivandrum. Responsibilities include troubleshooting cloud, networking, and DevOps issues in rotational shifts."
    },
    {
        "job_title": "DATA SCIENCE & AI/ML -Freshers Preferred",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/24896",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>Job Opportunity: Data Science &amp; AI/ML</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> Technopark phase 1, Trivandrum , 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 22, Dec 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>REIZEND (P) Ltd is seeking enthusiastic freshers for Data Science &amp; AI/ML roles. The ideal candidate will possess a strong foundation in Python and a keen interest in data-driven problem-solving.</p>\n<h3>Responsibilities and Qualifications:</h3>\n<ul>\n<li><strong>Programming Proficiency:</strong><ul>\n<li>Proficiency in Python programming with a strong grasp of core concepts.</li>\n<li>Familiarity with common data structures (lists, dictionaries, tuples) and basic algorithms (sorting, searching).</li>\n<li>Ability to analyze and solve programming problems using Python.</li>\n<li>Basic understanding of Object-Oriented Programming (OOP) principles like classes, objects, inheritance, and encapsulation.</li>\n<li>Knowledge of Python frameworks like Django.</li>\n</ul>\n</li>\n<li><strong>Data Science &amp; AI/ML Fundamentals:</strong><ul>\n<li>Basic knowledge in Data Science including but not limited to ETL, EDA, Data Processing, Visualization etc.</li>\n<li>Familiarity with machine learning and deep learning models (e.g., TensorFlow, Keras, PyTorch).</li>\n<li>Basic understanding of Natural Language Processing (NLP) concepts.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n</ul>\n</li>\n<li><strong>Data Handling &amp; Tools:</strong><ul>\n<li>Knowledge in data visualization tools (Tableau, Power BI, etc.) and SQL.</li>\n<li>Experience working with SQL DMBS like PostgreSQL is a plus.</li>\n</ul>\n</li>\n<li><strong>Methodologies &amp; Collaboration:</strong><ul>\n<li>Familiarity with Jira and Agile methodology will be an added advantage.</li>\n</ul>\n</li>\n<li><strong>Additional Advantages:</strong><ul>\n<li>Certification or experience in data analysis, data mining, and statistical modelling is an added advantage.</li>\n<li>Certification in Data Science is an added advantage.</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong><ul>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li><strong>Education:</strong> Bachelor's or Master's degree in Data Science, Statistics, Mathematics, Computer Science, or a related field.</li>\n<li><strong>Experience:</strong> 0 to 1 yr (Freshers - 2025 / 2026 Passouts Preferred)</li>\n<li><strong>Academics:</strong> 10th &amp; 12th: 85% and above, UG/PG: 7 CGPA and above preferred.</li>\n</ul>\n<h3>Work Environment:</h3>\n<ul>\n<li><strong>Type:</strong> Work From Office</li>\n<li><strong>Location:</strong> Trivandrum</li>\n<li><strong>Package:</strong> 4-6 LPA</li>\n</ul>\n<h3>Key Information:</h3>\n<ul>\n<li><strong>Freshers:</strong> 2025 / 2026 Passouts Preferred</li>\n<li><strong>Preferred Skills:</strong> Data Science, AI/ML, Python, SQL</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Python",
            "Data Science",
            "AI/ML"
        ],
        "summary": "Seeking freshers for Data Science & AI/ML roles. Requires Python proficiency and basic data science knowledge for a work-from-office position in Trivandrum."
    },
    {
        "job_title": "Junior Graphic Designer",
        "company": "Awdar Software Solutions Llp",
        "url": "https://technopark.org/job-details/24895",
        "location": "Technopark",
        "closing_date": "05 Dec 2025",
        "job_description": "<h2>Junior Graphic Designer</h2>\n<p><strong>Company:</strong> AWDAR SOFTWARE SOLUTIONS LLP\n<strong>Location:</strong> Module No 2301, 3rd Floor, Yamuna Building, Technopark Phase 3, Trivandrum, 695583\n<strong>Contact:</strong> hr@awdar-solutions.com\n<strong>Website:</strong> https://ainexit.com</p>\n<p><strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 05, Dec 2025</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a talented and creative Junior Graphic Designer to join our dynamic team. The ideal candidate will be responsible for developing visually compelling designs that align with our brand identity and marketing goals. You will work on a variety of projects, including digital content, print materials, branding, and more. Your creativity, design thinking, and attention to detail will play a key role in delivering high-quality visuals across multiple platforms.</p>\n<p><strong>Experience:</strong> Minimum 1 year is mandatory.\n<strong>Immediate Joiner preferred (Join within 10 days)</strong></p>\n<h2>Required Qualifications:</h2>\n<ul>\n<li>Bachelor’s degree in Graphic Design, Visual Arts, or a related field (or equivalent work experience).</li>\n<li>Proven experience as a Graphic Designer (Minimum 1 year mandatory).</li>\n<li>Proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign) and other design tools.</li>\n<li>Strong portfolio showcasing a range of creative design work across digital and print media.</li>\n<li>Knowledge of design principles, color theory, and typography.</li>\n<li>Attention to detail and a keen eye for visual aesthetics.</li>\n<li>Strong time-management skills and ability to meet deadlines.</li>\n<li>Excellent communication skills to collaborate with internal teams and clients.</li>\n<li>Ability to work independently and manage multiple projects simultaneously.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ul>\n<li>Experience with marketing automation tools.</li>\n<li>Familiarity with video content creation and platforms.</li>\n<li>Experience with e-commerce platforms (e.g., Shopify, WooCommerce) and product listing optimization.</li>\n<li>Proficiency in graphic design tools (e.g., Canva, Adobe Creative Suite) for creating visual content.</li>\n<li>Ability to analyze and interpret data from multiple sources and generate actionable insights.</li>\n<li>Experience with influencer partnerships and affiliate marketing strategies.</li>\n<li>Understanding of mobile marketing strategies and apps.</li>\n<li>Basic knowledge of UX/UI principles for improving website user experience.</li>\n</ul>\n<p><strong>Application:</strong>\nInterested candidates are requested to send their CV along with their portfolio to: 📩 hr@awdar-solutions.com</p>\n<p><strong>Note:</strong> IMMEDIATE JOINERS PREFERRED (Within 10 days)</p>",
        "tags": [
            "1+ Years",
            "Graphic Design",
            "Adobe Creative Suite",
            "Portfolio"
        ],
        "summary": "Seeking a creative Junior Graphic Designer with at least 1 year of experience. Responsibilities include creating compelling visuals for digital and print media. Immediate joiners preferred."
    },
    {
        "job_title": "Sales Specialist (Hospital Management Software) : 0-5 years | Hybrid | Hindi Speaking",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24893",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>Sales Specialist (Hospital Management Software)</h2>\n<p><strong>Company:</strong> SMARTHMS &amp; SOLUTIONS (P) Ltd\n<strong>Location:</strong> Technopark Phase 1, Trivandrum, Kerala, India\n<strong>Contact:</strong> https://shmsolutions.in | careers@shmsolutions.in\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 22, Dec 2025</p>\n<p><strong>Type:</strong> Full-Time\n<strong>Experience:</strong> 0-5 years\n<strong>Work Model:</strong> Hybrid\n<strong>Salary Package:</strong> 6-12 LPA</p>\n<p><strong>Language Requirement:</strong> Fluent in Hindi and English</p>\n<h3>Job Summary:</h3>\n<p>SMARTHMS &amp; SOLUTIONS (P) Ltd is seeking a Technical Sales &amp; Marketing Specialist to drive sales and marketing initiatives for their Hospital Management Software (HMS) solutions. This role is crucial for expanding reach within the healthcare sector. The ideal candidate will possess excellent presentation skills, a proven ability to increase revenue, and fluency in Hindi for effective client communication.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and execute strategic sales plans to achieve company targets and foster business growth in the healthcare software market.</li>\n<li>Identify and engage with potential clients, including hospitals, clinics, diagnostic centers, and healthcare networks.</li>\n<li>Cultivate and maintain strong relationships with key clients by understanding their operational needs and proposing suitable HMS solutions.</li>\n<li>Design and manage integrated marketing campaigns aligned with the company's Go-To-Market strategy.</li>\n<li>Conduct thorough market research and competitor analysis to ensure optimal strategic positioning and adapt to evolving healthcare market demands.</li>\n<li>Create persuasive marketing collateral such as brochures, case studies, and presentations, ensuring brand consistency.</li>\n<li>Collaborate with internal teams (product, sales, support) to harmonize messaging and enhance customer engagement.</li>\n<li>Analyze campaign performance and ROI, utilizing data-driven insights for continuous improvement.</li>\n<li>Stay abreast of healthcare industry trends, software advancements, and regulatory requirements impacting hospital IT systems.</li>\n<li>Represent the company at industry events, conferences, and webinars to enhance brand presence.</li>\n</ul>\n<h3>Qualifications &amp; Skills:</h3>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in Marketing, Business, Healthcare IT, or a related field (MBA is preferred).</li>\n<li>Excellent communication, presentation, and negotiation skills.</li>\n<li>Fluency in Hindi and English is mandatory for confident client interaction in Hindi-speaking regions.</li>\n<li>Familiarity with Hospital Management Systems (HMS), EMR/EHR solutions, or healthcare IT workflows is a significant advantage.</li>\n<li>Proficiency in creating effective marketing materials and sales presentations.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Self-motivated and target-driven.</li>\n<li>Ability to work autonomously.</li>\n<li>Strong analytical and problem-solving capabilities.</li>\n<li>Experience in conducting client demos and product presentations.</li>\n<li>Willingness to travel for client meetings, demonstrations, and industry events as required.</li>\n</ul>",
        "tags": [
            "0-5 Years",
            "Hospital Management Software",
            "Sales",
            "Marketing"
        ],
        "summary": "Seeking a Technical Sales & Marketing Specialist for Hospital Management Software. Role involves sales, marketing, client engagement, and driving revenue growth in the healthcare sector."
    },
    {
        "job_title": "Graphic designer",
        "company": "Fresh Mind Ideas (P) Ltd",
        "url": "https://technopark.org/job-details/24892",
        "location": "Technopark",
        "closing_date": "05 Dec 2025",
        "job_description": "<h2>Graphic Designer</h2>\n<p><strong>Company:</strong> FRESH MIND IDEAS (P) Ltd\n<strong>Location:</strong> G3B, Thejaswini, Technopark Campus, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> http://www.freshmindideas.com\n<strong>Contact Email:</strong> careers@freshmindideas.com</p>\n<p><strong>Closing Date:</strong> 05, Dec 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>About the Role</h3>\n<p>We are looking for a creative and detail-oriented Graphic Designer with over 2 years of professional experience in a digital marketing environment. The ideal candidate should have a strong sense of visual storytelling, brand consistency, and experience in designing for both digital and social media platforms.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Create engaging and high-quality visual assets for digital marketing campaigns (social media posts, ad creatives, banners, thumbnails, etc.).</li>\n<li>Develop layouts, illustrations, and motion graphics that align with brand identity and campaign goals.</li>\n<li>Collaborate with the marketing and content teams to conceptualize and execute design ideas.</li>\n<li>Adapt and resize creatives for different platforms (Meta, Google, LinkedIn, YouTube, etc.).</li>\n<li>Maintain consistency in visual style and branding across all communication materials.</li>\n<li>Stay updated on current design trends, tools, and best practices in digital marketing.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree or diploma in Graphic Design, Visual Communication, or a related field.</li>\n<li>Minimum 2 years of hands-on experience working in a digital marketing agency or similar setup.</li>\n<li>Proficiency in design software such as Adobe Photoshop, Illustrator, InDesign, and Canva (After Effects or Premiere Pro is a plus).</li>\n<li>Strong understanding of social media design standards and performance-driven creatives.</li>\n<li>Ability to handle multiple projects and meet tight deadlines.</li>\n<li>A keen eye for aesthetics, typography, and attention to detail.</li>\n<li>Knowledge of motion graphics, GIFs, and short-form video editing will be an added advantage.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume and portfolio/case studies to careers@freshmindideas.com with the subject line: Application – Graphic Designer</p>",
        "tags": [
            "2+ Years",
            "Graphic Design",
            "Adobe Photoshop",
            "Canva"
        ],
        "summary": "Seeking a creative Graphic Designer with 2+ years of digital marketing experience. Responsibilities include creating visual assets and collaborating with teams. Proficiency in Adobe Suite and Canva required."
    },
    {
        "job_title": "Chief Financial Officer (CFO)",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/24891",
        "location": "Technopark",
        "closing_date": "20 Nov 2025",
        "job_description": "<h2>Chief Financial Officer (CFO) - GENROBOTIC INNOVATIONS (P) Ltd</h2>\n<p><strong>Company:</strong> GENROBOTIC INNOVATIONS (P) Ltd\n<strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.genrobotics.org\n<strong>Contact Email:</strong> career@genrobotics.com</p>\n<p><strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 20, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>The Chief Financial Officer (CFO) will be a key member of the executive team, responsible for overseeing all accounting and financial functions. The CFO will ensure the accuracy and integrity of financial reporting and provide strategic financial guidance to support company growth and profitability.</p>\n<h2>Key Responsibilities:</h2>\n<ol>\n<li>\n<p><strong>Financial Leadership:</strong></p>\n<ul>\n<li>Develop and execute financial strategies aligning with business unit goals and supporting growth and sustainability.</li>\n<li>Provide financial guidance and insights to senior management and stakeholders.</li>\n</ul>\n</li>\n<li>\n<p><strong>Financial Operations Management:</strong></p>\n<ul>\n<li>Oversee day-to-day financial operations, including budgeting, financial reporting, and cash flow management.</li>\n<li>Ensure accurate and timely financial reporting for each entity.</li>\n<li>Establish and maintain robust internal controls to prevent fraud, errors, and financial mismanagement.</li>\n</ul>\n</li>\n<li>\n<p><strong>Financial Planning and Analysis:</strong></p>\n<ul>\n<li>Collaborate with business unit leaders to create and manage annual budgets.</li>\n<li>Perform financial analysis to identify trends, variances, and opportunities for improvement.</li>\n<li>Identify, assess, and mitigate financial risks impacting the organization's financial stability.</li>\n</ul>\n</li>\n<li>\n<p><strong>Ensure Compliance:</strong></p>\n<ul>\n<li>Ensure compliance with accounting standards, regulations, and tax requirements.</li>\n<li>Oversee the preparation and submission of financial reports and tax filings.</li>\n</ul>\n</li>\n<li>\n<p><strong>Audit and Risk Management:</strong></p>\n<ul>\n<li>Coordinate external audits and liaise with auditors for a smooth process.</li>\n<li>Lead and execute inventory audits to optimize operational efficiency.</li>\n<li>Develop and implement risk management strategies to safeguard the organization's financial interests.</li>\n</ul>\n</li>\n</ol>\n<h2>Preferred Qualifications &amp; Skills:</h2>\n<ul>\n<li><strong>Education:</strong> Bachelor’s Degree in Accounting, Finance, or a related field.</li>\n<li><strong>Experience:</strong> 10-20 years of experience with a proven track record in a similar role.</li>\n<li><strong>Industry Knowledge:</strong> Strong knowledge of the Manufacturing industry and relevant regulatory requirements.</li>\n<li><strong>Compliance:</strong> Experience in GST and other tax and statutory compliances.</li>\n<li><strong>Tech Savvy:</strong> Proficient in the latest accounting software.</li>\n<li><strong>Leadership Skills:</strong> Exceptional leadership and team management skills with the ability to inspire and develop a high-performing team.</li>\n<li><strong>Strategic Thinker:</strong> A strategic mindset with the ability to provide financial insights and contribute to the company's overall strategy.</li>\n<li><strong>Analytical Skills:</strong> Excellent analytical and problem-solving abilities.</li>\n<li><strong>Communication:</strong> Strong verbal and written communication skills, with the ability to convey complex financial information to non-financial stakeholders.</li>\n</ul>\n<p><strong>Click Here to Apply</strong></p>",
        "tags": [
            "10-20 Years",
            "Financial Strategy",
            "Manufacturing Industry",
            "GST Compliance"
        ],
        "summary": "Seeking a CFO to lead financial operations, reporting, and strategy. Requires extensive experience, strong leadership, and financial acumen to drive company growth and profitability."
    },
    {
        "job_title": "Senior - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24890",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Senior Marketing Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO\n<strong>Published:</strong> 07, Nov 2025\n<strong>Closes:</strong> 09, Nov 2025\n<strong>Contact:</strong> careers@way.com</p>\n<p><strong>About Way.com:</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. Using cutting-edge AI, machine learning, and data analytics, Way.com delivers innovative, personalized solutions to simplify car ownership. The company has been recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies, and received the top Product in Insurance award by UnitQ.</p>\n<p><strong>Role Overview:</strong>\nWe are seeking a Senior Marketing Designer to transform ideas into high-performing visuals. This role involves designing impactful campaigns, advertisements, and visuals across various platforms, including paid media, social media, and email, in collaboration with creative, growth, and product teams.</p>\n<h2>Roles and Responsibilities:</h2>\n<ul>\n<li>Create digital ad creatives, banners, and social media visuals for ongoing campaigns.</li>\n<li>Conceptualize visuals for product launches and seasonal campaigns.</li>\n<li>Design for performance, balancing creativity with clarity.</li>\n<li>Collaborate with copywriters, growth managers, and product designers.</li>\n<li>Execute designs that align with Way.com’s visual brand and tone.</li>\n<li>Explore motion graphics and storytelling techniques to enhance engagement.</li>\n</ul>\n<h2>Preferred Skills and Qualifications:</h2>\n<ul>\n<li>2–5 years of experience in marketing design or growth design.</li>\n<li>Proficiency in Figma, Photoshop, Illustrator, and After Effects.</li>\n<li>Strong understanding of layout, typography, and visual storytelling.</li>\n<li>Familiarity with digital marketing principles and ad metrics.</li>\n<li>A portfolio showcasing creativity and meticulous attention to detail.</li>\n<li>A proactive attitude towards learning, collaboration, and rapid growth within a creative environment.</li>\n</ul>\n<h2>Why work with Way.com?</h2>\n<ul>\n<li>Opportunity to be part of the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact on over 10 million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth paths within a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/senior-marketing-designer</p>",
        "tags": [
            "2-5 Years",
            "Figma",
            "Photoshop",
            "After Effects"
        ],
        "summary": "Seeking a Senior Marketing Designer to create high-impact visuals for campaigns across platforms. Requires 2-5 years of experience and proficiency in design software."
    },
    {
        "job_title": "Lead - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24889",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Lead - Marketing Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.com India Pvt Ltd)\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/lead-marketing-designer\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 09, Nov 2025</p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, Andreessen Horowitz, and UnitQ, Way.com is simplifying and enhancing the car ownership experience.</p>\n<h3>Role Overview</h3>\n<p>Way.com is seeking a <strong>Lead Marketing Designer</strong>. This is a hands-on creative leadership role responsible for translating strategy into compelling visuals and campaigns. The Lead Marketing Designer will oversee creative direction for digital marketing, brand campaigns, and performance advertising, managing a small design team while remaining involved in execution.</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Lead and manage a team of marketing designers.</li>\n<li>Develop and execute creative strategy across paid, owned, and social channels.</li>\n<li>Drive campaign concepts for product launches, seasonal pushes, and partnerships.</li>\n<li>Maintain a consistent visual identity across Way.com’s global marketing ecosystem.</li>\n<li>Partner with Growth, Product, and Content teams to create high-performing visuals.</li>\n<li>Inspire creative excellence and mentor designers to elevate craft quality.</li>\n<li>Balance creativity with marketing performance and data-driven decisions.</li>\n</ul>\n<h3>Preferred Skills and Qualifications:</h3>\n<ul>\n<li>6–10 years of experience in marketing design, art direction, or brand design.</li>\n<li>Proven experience leading creative or design teams.</li>\n<li>Strong portfolio showcasing campaign systems, digital storytelling, and ad design.</li>\n<li>Expertise in Figma, Photoshop, Illustrator, After Effects / Premiere Pro.</li>\n<li>Experience in performance design and knowledge of CTR, engagement metrics, and creative testing.</li>\n<li>Strong visual storytelling and typography skills.</li>\n<li>A passion for clean, modern, and conversion-friendly design.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "6-10 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Lead Marketing Designer needed for Way.com, America's #1 Auto Super App. Requires 6-10 years experience in marketing design and team leadership. Apply now for this exciting role!"
    },
    {
        "job_title": "E-mail Marketing Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24888",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Address:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Job Title:</strong> Senior B2C Email Marketing Specialist\n<strong>Closing Date:</strong> 09, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions that redefine car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies, and awarded top Product in Insurance by UnitQ, Way.com is dedicated to making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a results-driven, detail-oriented Senior B2C Email Marketing Specialist to lead our product-focused email marketing efforts. This role requires deep expertise in Mailchimp, a strategic approach to customer engagement, and the ability to drive product growth, retention, and conversions through data-backed, high-impact campaigns.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Email Strategy &amp; Execution:</strong> Design and implement impactful email marketing strategies that drive engagement, retention, and conversions.</li>\n<li><strong>Campaign Management:</strong> Plan, launch, and optimize campaigns, automations, and workflows using Mailchimp and other platforms.</li>\n<li><strong>Audience Segmentation:</strong> Utilize customer insights to build segmented lists and deliver personalized, targeted messaging.</li>\n<li><strong>Performance Optimization:</strong> Conduct A/B testing on subject lines, content, and CTAs to continuously enhance performance.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with product, design, and content teams to create visually compelling, high-impact email campaigns.</li>\n<li><strong>Analytics &amp; Reporting:</strong> Track key performance indicators, analyze campaign results, and provide actionable recommendations to improve ROI.</li>\n<li><strong>Compliance &amp; Best Practices:</strong> Ensure all campaigns align with regulations such as CCPA and CAN-SPAM while following industry standards.</li>\n<li><strong>Market Awareness:</strong> Stay informed on emerging email marketing trends, tools, and best practices to maintain a competitive edge.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>4–6 years of hands-on experience in B2C email marketing, ideally within digital product or SaaS environments.</li>\n<li>Proven expertise in Mailchimp, including automation setup, audience segmentation, and performance reporting.</li>\n<li>Solid understanding of customer journey mapping and lifecycle marketing strategies.</li>\n<li>Working knowledge of HTML/CSS for email design is a plus, though not mandatory.</li>\n<li>Strong data-driven approach, with experience using tools such as Google Analytics, UTM tracking, and campaign reporting dashboards.</li>\n<li>Ability to craft engaging, action-oriented email copy that drives conversions.</li>\n<li>Excellent analytical skills with a focus on tracking, measuring, and optimizing campaign performance.</li>\n<li>Proficient in A/B testing and iterative experimentation to improve results.</li>\n<li>Exceptional communication and cross-functional collaboration skills.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Apply Here:</h3>\n<p>https://waydot.greythr.com/hire/jobs/senior-product-email-marketing-specialist-b2c</p>",
        "tags": [
            "4-6 Years",
            "Mailchimp",
            "B2C Email Marketing",
            "Customer Segmentation"
        ],
        "summary": "Seeking a Senior B2C Email Marketing Specialist with Mailchimp expertise to drive product growth and retention. This role focuses on data-backed campaigns, segmentation, and optimization."
    },
    {
        "job_title": "Event Parking - Operations Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24887",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/operations-executive-event-parking</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We use AI, machine learning, and data analytics to provide innovative, personalized solutions. We've been recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and received the top Product in Insurance award from UnitQ.</p>\n<h2>Job Title: Operations Executive - Event Parking</h2>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for an experienced Operations Executive with a background in Operations management and process optimization for our Event Parking division.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Manage daily operations within the Event Parking vertical.</li>\n<li>Ensure operational efficiency and effectiveness.</li>\n<li>Oversee and improve various operational processes.</li>\n<li>Coordinate with different teams and stakeholders to achieve operational goals.</li>\n<li>Deliver excellent customer service to our clients.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>MBA in any discipline (Operations/Analytics preferred).</li>\n<li>Minimum 1 - 2 years of prior experience in a related field.</li>\n<li>Proficiency in Excel and handling data sets.</li>\n<li>Strong attention to detail with the ability to spot and correct inconsistencies.</li>\n<li>Process-driven with the capability to suggest improvements.</li>\n<li>Problem-solving mindset with ownership of outcomes.</li>\n<li>Strong communication skills for cross-team coordination.</li>\n<li>Flexibility to work evenings/weekends as per business requirements.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Closing Date:</strong> 09, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>",
        "tags": [
            "1-2 Years",
            "Operations Management",
            "Excel",
            "Process Optimization"
        ],
        "summary": "Operations Executive needed for Event Parking at Way.com. Requires 1-2 years of experience in operations management and process optimization, with strong Excel skills."
    },
    {
        "job_title": "Product Team Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24886",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Product Manager</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/product-manager\n<strong>Closing Date:</strong> November 9, 2025\n<strong>Job Published:</strong> November 7, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions that revolutionize car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, Way.com is committed to making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title:</h3>\n<p>Product Manager</p>\n<h3>Work Arrangement:</h3>\n<p>On-site</p>\n<h3>Employment Type:</h3>\n<p>Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Product Manager to lead the development and delivery of impactful product features that enhance user experience and drive business growth. You will collaborate closely with engineering, design, and data teams to rapidly transform innovative ideas into market-ready solutions.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>End-to-End Product Ownership:</strong> Drive product features from ideation to launch, ensuring alignment with business goals and delivery of high-quality outcomes.</li>\n<li><strong>Data-Driven Decision Making:</strong> Leverage analytics and user feedback to identify opportunities and implement impactful product enhancements.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with engineering, design, and data teams to deliver seamless, timely product releases.</li>\n<li><strong>Performance Management:</strong> Track product performance metrics and execute strategies to maximize growth, retention, and engagement.</li>\n<li><strong>Stakeholder Alignment:</strong> Communicate priorities, timelines, and progress clearly to stakeholders, ensuring transparency and alignment.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Experience:</strong> 3–7 years in product management.</li>\n<li><strong>Product Strategy &amp; Roadmapping:</strong> Defining product vision, goals, and long-term plans, translating them into a prioritized roadmap.</li>\n<li><strong>Data-Driven Decision Making:</strong> Using quantitative and qualitative data to inform choices, validate assumptions, and measure product performance.</li>\n<li><strong>User-Centric Design Thinking:</strong> Applying a creative, iterative problem-solving approach focused on user needs and enhancing their experience.</li>\n<li><strong>Stakeholder Management:</strong> Building and maintaining positive relationships with stakeholders, ensuring alignment and effective communication.</li>\n<li><strong>Agile Product Development:</strong> Using flexible, iterative methods for quick development and delivery, adapting to feedback and changing requirements.</li>\n<li><strong>Market &amp; Competitive Analysis:</strong> Researching industry trends, customer behavior, and competitor offerings.</li>\n<li><strong>A/B Testing &amp; Experimentation:</strong> Comparing product variations to determine optimal performance.</li>\n<li><strong>Go-To-Market Execution:</strong> Planning and carrying out successful product launch strategies.</li>\n<li><strong>Wireframing &amp; Prototyping:</strong> Creating visual blueprints and interactive mockups to test concepts and guide development.</li>\n<li><strong>User Research:</strong> Collecting and analyzing user feedback, observations, and data.</li>\n<li><strong>Education:</strong> Bachelor’s degree in Engineering or an MBA from a Tier 1 institute.</li>\n<li><strong>Proven Track Record:</strong> Successful launch of user-facing products.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "3-7 Years",
            "Product Management",
            "Data-Driven Decision Making",
            "Agile Product Development"
        ],
        "summary": "Seeking a Product Manager to own feature development and drive business growth. Collaborate with cross-functional teams to deliver impactful product solutions and enhance user experience."
    },
    {
        "job_title": "Senior UX/UI - Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24885",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Senior UX/UI Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 09, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, Andreessen Horowitz, and UnitQ, we are committed to making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Senior UX Designer</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Senior UX Designer with exceptional UX thinking and strong UI design skills to create world-class experiences for Way.com's car super-app, impacting millions of users. You will be instrumental in designing user flows that drive engagement and satisfaction.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead the end-to-end design of core product experiences.</li>\n<li>Solve complex user problems by creating simple, intuitive interfaces.</li>\n<li>Collaborate closely with Product, Engineering, and Marketing teams to align business goals with user needs.</li>\n<li>Enhance design quality by mentoring team members and establishing design standards.</li>\n<li>Build and validate design solutions through research, prototyping, and usability testing.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>6+ years of experience in UX design with strong UI design capabilities.</li>\n<li>Expertise in user-centered design principles and modern design tools (e.g., Figma).</li>\n<li>A strong portfolio showcasing impactful product design work.</li>\n<li>Ability to clearly communicate design rationale to stakeholders.</li>\n<li>Experience in leading design for large-scale web and mobile products is a plus.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact on over 10 million users.</li>\n<li>Work in a dynamic, fast-paced, and innovation-driven culture.</li>\n<li>Clear career growth pathways within a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-uxui-designer</p>",
        "tags": [
            "6+ Years",
            "UX/UI Design",
            "Figma",
            "Product Design"
        ],
        "summary": "Seeking a Senior UX Designer for Way.com's automotive super app. Responsibilities include end-to-end product design, user research, and collaboration with cross-functional teams."
    },
    {
        "job_title": "Team Lead - SEO",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24884",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead</p>\n<h3>Job Title: Team Lead - SEO</h3>\n<p><strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 09, Nov 2025</p>\n<hr />\n<h2>About Us</h2>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to offer innovative, personalized solutions for car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, Way.com is simplifying and enhancing the car ownership experience.</p>\n<hr />\n<h2>Role Overview</h2>\n<p>We are seeking a highly skilled Team Lead, SEO to lead our organic growth initiatives and enhance our search engine presence. This leadership role involves developing and executing comprehensive SEO strategies, managing a team of SEO specialists, and collaborating cross-functionally to optimize our digital footprint. Ideal candidates possess a deep understanding of search algorithms, technical SEO, content strategy, and a passion for driving results.</p>\n<hr />\n<h2>Key Responsibilities</h2>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies:</strong> Define and implement a robust SEO roadmap aligned with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team:</strong> Manage a team of SEO professionals, fostering a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO:</strong> Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management:</strong> Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making:</strong> Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration:</strong> Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization:</strong> Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis:</strong> Conduct SEO audits, monitor competitor strategies, and identify new opportunities.</li>\n<li><strong>SEO Performance Reporting:</strong> Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<hr />\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Experience:</strong> 9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li><strong>Core Expertise:</strong> Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li><strong>Algorithm Knowledge:</strong> Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li><strong>SEO Tools Proficiency:</strong> Proficient in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li><strong>Technical Understanding:</strong> Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li><strong>Optimization Experience:</strong> Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li><strong>Analytical Skills:</strong> Ability to analyze and interpret SEO data to make data-driven decisions.</li>\n<li><strong>Communication:</strong> Excellent communication and stakeholder management skills.</li>\n</ul>\n<hr />\n<h2>Preferred Qualifications</h2>\n<ul>\n<li><strong>Web Development Basics:</strong> Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li><strong>PPC Understanding:</strong> Understanding of PPC advertising and its relationship with organic search.</li>\n<li><strong>Environment Experience:</strong> Experience working in a high-growth startup or fast-paced environment.</li>\n<li><strong>Social Media Awareness:</strong> Familiarity with social media marketing and its impact on SEO.</li>\n<li><strong>Project Management:</strong> Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<hr />\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<hr />\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead</p>",
        "tags": [
            "9-11 Years",
            "SEO",
            "Technical SEO",
            "SEMrush"
        ],
        "summary": "Lead SEO strategy and team for Way.com, America's auto super app. Drive organic growth through technical optimization, content, and data analysis."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24883",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Job Title: Project Manager</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/project-manager</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Overview</h3>\n<p><strong>Position:</strong> Project Manager\n<strong>Experience Required:</strong> 8+ years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p>We are seeking an experienced Project Manager with over 8 years of experience to lead strategic projects from initiation to completion. The ideal candidate will possess strong leadership, domain knowledge, and execution skills to ensure successful project delivery within scope, timeline, and budget.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead the full project lifecycle for multiple medium to large-scale initiatives.</li>\n<li>Define and manage project scope, objectives, deliverables, and success criteria.</li>\n<li>Develop and execute detailed project plans, including resource allocation, timelines, and budgets.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate issues as needed.</li>\n<li>Manage stakeholder relationships, ensuring clear communication and alignment across all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams for smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes and policies.</li>\n<li>Mentor and guide junior team members to enhance project management capabilities.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Business Administration, or a related field (Master’s degree is a plus).</li>\n<li>Minimum 8 years of proven project management experience, preferably in a fintech platform.</li>\n<li>Strong expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in project management tools such as MS Project, JIRA, Asana, Trello, or similar.</li>\n<li>In-depth knowledge of Agile, Waterfall, or hybrid project management methodologies.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities.</li>\n<li>Certifications like PMP, PRINCE2, or Agile (Scrum Master/SAFe) are highly preferred.</li>\n<li>Experience with tools like MPP.</li>\n<li>Ability to work effectively with multiple teams, driving for execution and results.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a significant impact on over 10 million users.</li>\n<li>Join a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Receive competitive compensation.</li>\n</ul>\n<p><strong>Closing Date:</strong> 09 November 2025\n<strong>Job Published:</strong> 07 November 2025</p>",
        "tags": [
            "8+ Years",
            "Project Management",
            "Agile",
            "Fintech"
        ],
        "summary": "Seeking an experienced Project Manager to lead strategic initiatives. Requires 8+ years of experience, strong leadership, and proficiency in project management methodologies and tools."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24882",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Customer Success Executive - Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 09, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<hr />\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. We offer services including auto insurance, parking, and EV charging. Using cutting-edge AI, machine learning, and data analytics, we provide innovative, personalized solutions for car ownership. Featured by Bloomberg and ranked highly among fast-growing companies, we aim to make car ownership easier, more affordable, and more rewarding.</p>\n<hr />\n<h3>Job Title: Customer Success Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a Customer Success Executive for our voice process. This role is crucial for delivering excellent customer service, professionally and efficiently handling client inquiries via phone.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Address customer queries through phone, email, chat, and social media channels.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to products, orders, returns, and general support requests.</li>\n<li>Maintain accurate customer records and feedback in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking customer satisfaction metrics and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience (2-5 years) in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations professionally.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<hr />\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/customer-success-executive</p>",
        "tags": [
            "2-5 Years",
            "Customer Service",
            "Communication Skills",
            "Problem-Solving"
        ],
        "summary": "Seeking a Customer Success Executive for a voice process role at Way.com. Responsibilities include handling customer inquiries and resolving issues to ensure excellent service."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24881",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>About Way.com</h2>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title: Spanish Customer Success Executive</h2>\n<p><strong>Location:</strong> Thiruvananthapuram, India (On-site)\n<strong>Employment Type:</strong> Full-time\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\n<strong>Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 09, Nov 2025</p>\n<h2>Role Overview</h2>\n<p>Way.com is seeking a dynamic and customer-focused Spanish Customer Success Executive to join our voice process team. This role involves providing excellent customer service to our Spanish-speaking clients, professionally and efficiently handling inquiries over the phone.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li><strong>Customer Interaction:</strong> Manage inbound and outbound calls, providing prompt and effective resolutions to customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence:</strong> Deliver empathetic and professional support to ensure a positive customer experience in every interaction.</li>\n<li><strong>Issue Escalation:</strong> Identify, prioritize, and escalate complex cases to the appropriate departments for swift resolution.</li>\n<li><strong>Documentation:</strong> Maintain accurate records of customer interactions and keep databases up-to-date.</li>\n<li><strong>Performance Goals:</strong> Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge:</strong> Stay informed about company products and services to provide customers with accurate and up-to-date information.</li>\n<li><strong>Team Collaboration:</strong> Work closely with colleagues to foster a supportive, collaborative, and high-performing work environment.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Fluency in both <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong interpersonal and communication skills, with a patient and empathetic approach.</li>\n<li>Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Spanish",
            "Customer Service",
            "Voice Process"
        ],
        "summary": "Spanish Customer Success Executive sought for Way.com's auto super app. Role involves phone-based customer support for Spanish-speaking clients, requiring bilingual fluency and strong communication skills."
    },
    {
        "job_title": "Sales Head - Parking Vertical (India Office)",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24880",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Sales Head - Parking Vertical (India Office)</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Closing Date:</strong> 09, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/sales-head</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. We offer services including auto insurance, parking, and EV charging. Utilizing cutting-edge AI, machine learning, and advanced data analytics, Way.com provides innovative, personalized solutions that transform car ownership. Recognized by Bloomberg and Andreessen Horowitz, and ranked as the top Product in Insurance by UnitQ, we aim to make car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title</h3>\n<p>Head of Sales - Parking Vertical (India Office)</p>\n<h3>Work Arrangement &amp; Employment Type</h3>\n<ul>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n</ul>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced and results-oriented Head of Sales to lead our Parking Vertical in the India office. This senior leadership position will be responsible for overseeing a team of Business Development Managers, driving revenue growth, setting clear performance targets, and fostering a disciplined, high-performance culture. The ideal candidate will possess a proven track record in sales strategy, team leadership, and client relationship management.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Develop and implement effective sales strategies to achieve business growth objectives.</li>\n<li>Lead, mentor, and manage a team of Business Development Managers with a focus on accountability, productivity, and performance excellence.</li>\n<li>Build and maintain strong relationships with key clients, stakeholders, and strategic partners.</li>\n<li>Monitor market trends, competitor activities, and customer needs to refine sales approaches and maintain a competitive edge.</li>\n<li>Provide accurate forecasts, pipeline updates, and performance reports to senior leadership.</li>\n<li>Collaborate cross-functionally with marketing, operations, and product teams to ensure the delivery of seamless and customer-centric solutions.</li>\n</ul>\n<h3>Qualifications &amp; Experience</h3>\n<ul>\n<li>Minimum of 10 years of proven sales experience, including at least 5 years in a senior leadership role.</li>\n<li>Demonstrated success in meeting and exceeding revenue and growth targets.</li>\n<li>Experience managing and developing high-performing sales teams with multiple Business Development Managers.</li>\n<li>Exceptional leadership, negotiation, and communication skills.</li>\n<li>Industry experience in mobility, parking, real estate, or related sectors is preferred.</li>\n</ul>\n<h3>Key Attributes</h3>\n<ul>\n<li>Strategic thinker with a results-driven and growth-oriented mindset.</li>\n<li>Decisive leader who motivates teams and upholds accountability.</li>\n<li>Strong interpersonal skills with the ability to build and sustain long-term client and team relationships.</li>\n<li>Professional, adaptable, and driven to deliver measurable business success.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Sales Strategy",
            "Team Leadership",
            "Parking"
        ],
        "summary": "Lead sales for Way.com's Parking Vertical in India. Drive revenue growth and manage a team of Business Development Managers in a fast-paced, innovative environment."
    },
    {
        "job_title": "Senior Engineer - QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24879",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com\n<strong>Website:</strong> http://www.way.com</p>\n<p><strong>About Us:</strong>\nWay.com is America's leading automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide innovative solutions and make car ownership easier, more affordable, and rewarding. Recognized by Bloomberg and UnitQ, we are a fast-growing company transforming the automotive industry.</p>\n<p><strong>Job Title:</strong> Senior QA Automation Engineer\n<strong>Experience Required:</strong> 5–8 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Closing Date:</strong> November 9, 2025\n<strong>Job Published:</strong> November 7, 2025</p>\n<p><strong>Role Overview:</strong>\nWe are looking for a Senior QA Automation Engineer with extensive Java-based test automation experience. You will be responsible for designing and maintaining scalable automation frameworks, developing robust testing strategies, and collaborating with cross-functional teams to ensure quality throughout the software development lifecycle.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Test Strategy &amp; Design:</strong> Develop detailed test strategies and plans based on complex business requirements, ensuring comprehensive test coverage.</li>\n<li><strong>Automation Frameworks:</strong> Design, build, and enhance scalable automation frameworks using Core Java and modern testing tools.</li>\n<li><strong>Collaboration &amp; Quality Ownership:</strong> Work closely with developers, product managers, and QA teams to integrate quality practices into the SDLC.</li>\n<li><strong>Functional &amp; E2E Testing:</strong> Conduct thorough functional and end-to-end testing to verify accuracy, performance, and user experience.</li>\n<li><strong>Automation Execution:</strong> Create and execute automated test scripts for web and API testing using Selenium WebDriver, Rest Assured, and related technologies.</li>\n<li><strong>CI/CD Enablement:</strong> Integrate test automation into CI/CD pipelines (e.g., Jenkins) to facilitate continuous testing and faster releases.</li>\n<li><strong>Issue Resolution:</strong> Monitor, troubleshoot, and resolve automation failures to maintain the reliability of test suites.</li>\n<li><strong>Documentation &amp; Standards:</strong> Develop and maintain reusable test cases, structured scripts, and clear documentation for scalability.</li>\n<li><strong>Defect Tracking:</strong> Log, track, and collaborate with engineering teams on defect resolution to ensure timely and quality delivery.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5+ years of experience in test automation using Java.</li>\n<li>Strong knowledge of Core Java, including OOP, exception handling, multi-threading, and file handling.</li>\n<li>Proficiency in Java Collections (Lists, Sets, Maps, Queues) with a solid understanding of data structures and algorithms.</li>\n<li>Hands-on experience with Selenium WebDriver, including dynamic element handling, custom wait strategies, and cross-browser testing.</li>\n<li>Proficiency in REST API testing using Rest Assured, including request modeling, authentication, and API validation.</li>\n<li>Experience with Jenkins or similar CI/CD tools for integrating test suites and maintaining automation pipelines.</li>\n<li>Familiarity with load and performance testing tools (e.g., JMeter, K6, Locust) and identifying performance bottlenecks.</li>\n<li>Strong attention to detail, problem-solving abilities, and the capacity to work independently and collaboratively in a fast-paced environment.</li>\n</ul>\n<p><strong>Why work with us?</strong></p>\n<ul>\n<li>Opportunity to contribute to the #1 Auto Super app in the US.</li>\n<li>Make a significant impact on over 10 million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear career growth paths in a rapidly scaling tech company.</li>\n<li>Receive competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-qa-engineer</p>",
        "tags": [
            "5-8 Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Seeking a Senior QA Automation Engineer with 5-8 years of Java experience. Responsibilities include framework design, test strategy, and automation execution for web and API testing."
    },
    {
        "job_title": "Social Media - Marketing Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24878",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Social Media Marketing Manager - Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/manager-social-media-marketing\n<strong>Closing Date:</strong> 09, Nov 2025\n<strong>Job Published:</strong> 07, Nov 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide innovative solutions. Recognized by Bloomberg and Andreessen Horowitz, we are making car ownership easier, more affordable, and rewarding.</p>\n<h3>Job Title: Social Media Marketing Manager</h3>\n<p><strong>Experience:</strong> 9 to 12 Years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a creative, strategic, and results-oriented Social Media Marketing Manager to lead our brand's digital growth. You will be responsible for the strategy and execution of our social media presence, focusing on driving brand awareness, deepening community engagement, and fostering meaningful interactions across platforms. This role involves collaboration with cross-functional teams to deliver a unified, data-driven social strategy that amplifies our brand voice and achieves measurable business impact.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Strategic Leadership:</strong> Define and implement platform-specific strategies aligned with Way.com’s brand voice, identity, and growth objectives, ensuring consistency and innovation.</li>\n<li><strong>Content Strategy &amp; Execution:</strong> Lead the planning, creation, and scheduling of impactful content for platforms like Instagram, Facebook, LinkedIn, X/Twitter, and TikTok, optimizing for engagement, reach, and performance.</li>\n<li><strong>Community Management:</strong> Drive daily interactions by responding to comments and messages in a brand-consistent manner, cultivating an engaged online community.</li>\n<li><strong>Brand Growth &amp; Advocacy:</strong> Design and launch creative campaigns to deepen emotional connections, foster loyalty, and encourage user advocacy.</li>\n<li><strong>Analytics &amp; Optimization:</strong> Monitor KPIs, analyze performance data, and continuously refine strategies to maximize ROI, reach, and engagement.</li>\n<li><strong>Influencer &amp; Partnership Development:</strong> Identify, engage, and collaborate with influencers, creators, and partners to expand brand presence.</li>\n<li><strong>Trend &amp; Innovation Leadership:</strong> Stay updated on emerging trends, platform updates, and tools to maintain a competitive brand presence.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with design, content, product, and customer support teams for cohesive messaging and impactful campaigns.</li>\n<li><strong>Budget &amp; Resource Management:</strong> Oversee social media budgets and allocate resources strategically for maximum ROI.</li>\n<li><strong>Reputation Management:</strong> Monitor brand sentiment, address feedback proactively, and protect Way.com’s reputation across platforms.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, or a related field (Master’s degree is a plus).</li>\n<li>Minimum 9 years of experience in social media marketing with a proven track record of successful campaigns and brand growth.</li>\n<li>Deep understanding of major social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.) and their role in business development.</li>\n<li>Proficiency in social media management tools (e.g., Hootsuite, Sprout Social, Buffer) and analytics tools (e.g., Google Analytics, Socialbakers).</li>\n<li>Exceptional communication and leadership skills.</li>\n<li>Strong creative acumen combined with strategic thinking capabilities.</li>\n<li>Expertise in paid social media strategies and advertising techniques.</li>\n<li>Ability to manage multiple projects efficiently under tight deadlines.</li>\n<li>Passion for digital innovation and staying current with social media trends and technologies.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "9+ Years",
            "Social Media Marketing",
            "Content Strategy",
            "Community Management"
        ],
        "summary": "Lead social media strategy and execution for a leading auto super app. Drive brand awareness, engagement, and growth through innovative campaigns and data-driven insights."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24877",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/senior-java-developer\n<strong>Job Published:</strong> 07, Nov 2025\n<strong>Closing Date:</strong> 09, Nov 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America's dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and ranked among the fastest-growing companies worldwide, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Senior Java Engineer</h3>\n<ul>\n<li><strong>Experience Required:</strong> 5–12 years</li>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n</ul>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced Senior Java Developer with deep expertise in Java, Spring Boot, MySQL, and RESTful APIs. This role involves architecting, developing, and optimizing high-performance, scalable applications, establishing technical standards, and mentoring junior team members.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Build, enhance, and maintain Java applications leveraging the Spring Boot framework, ensuring robust, scalable, and high-quality solutions.</li>\n<li>Partner with Product Owners, Architects, and other stakeholders to convert business needs into effective technical designs.</li>\n<li>Develop and integrate RESTful APIs to support application features and streamline system interoperability.</li>\n<li>Continuously improve application performance through code optimization, refactoring, and scalability enhancements.</li>\n<li>Lead code reviews, guide and mentor junior developers, and help drive adoption of best engineering practices.</li>\n<li>Keep abreast of advancements in the Java ecosystem and proactively apply relevant technologies.</li>\n<li>Diagnose, troubleshoot, and resolve complex technical issues to maintain system stability and reliability.</li>\n<li>Uphold industry standards and organizational guidelines throughout the software development lifecycle.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent work experience).</li>\n<li>Minimum of 5+ years of professional Java development experience, with strong proficiency in Spring Boot and MySQL.</li>\n<li>In-depth knowledge of Java SE and Java EE concepts, including multi-threading, design patterns, and JVM internals.</li>\n<li>Solid experience in designing and implementing RESTful APIs.</li>\n<li>Proficiency in MySQL (or other relational databases) and writing efficient SQL queries.</li>\n<li>Familiarity with modern version control tools, particularly Git.</li>\n<li>Experience working within Agile methodologies (Scrum, Kanban, etc.).</li>\n<li>Strong problem-solving, debugging, and troubleshooting skills.</li>\n<li>Excellent communication skills and ability to collaborate in a team environment.</li>\n<li>Proven ability to mentor and guide junior developers.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Senior Java Developer needed for a top US automotive super app. Develop, optimize, and mentor on scalable applications using Java, Spring Boot, and MySQL."
    },
    {
        "job_title": ".Net Developer",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/24876",
        "location": "Technopark",
        "closing_date": "17 Nov 2025",
        "job_description": "<h2>.Net Developer at Cloud Nautical Solutions India Pvt Ltd</h2>\n<p><strong>Company:</strong> Cloud Nautical Solutions India Pvt Ltd\n<strong>Location:</strong> Module No.K12, 2nd Floor, Kabani Building, Technocity, Phase 4, Technopark, Trivandrum, Kerala, India, 695317\n<strong>Website:</strong> https://www.cloudnautical.com\n<strong>Closing Date:</strong> 17 November 2025\n<strong>Job Published:</strong> 07 November 2025\n<strong>Contact Email:</strong> careers@cloudnautical.com</p>\n<h3>Brief Description</h3>\n<p>Cloud Nautical Solutions is seeking .NET Developers with at least 2+ years of hands-on experience in delivering commercial solutions using the .NET technology stack. We are looking for individuals who thrive on shaping cutting-edge applications from the ground up and have the ability to engage in hands-on delivery of server-side solutions that meet quality and productivity standards.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and deliver server-side solutions using .NET technology.</li>\n<li>Build cutting-edge applications from the ground up.</li>\n<li>Engage in hands-on delivery of solutions meeting quality and productivity standards.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's Degree in Computer Science or a related field.</li>\n<li>Proven experience in developing RESTful API Services using C# and .NET Core.</li>\n<li>Strong experience in writing SQL queries and stored procedures.</li>\n<li>Solid understanding of object-oriented programming (OOP) and SOLID principles.</li>\n<li>Proficiency in front-end web technologies such as HTML, CSS, and JavaScript.</li>\n<li>Familiarity with version control systems (e.g., Git) and CI/CD Pipelines.</li>\n<li>Knowledge of Cloud Application Development in AWS or Azure.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Excellent communication and teamwork abilities.</li>\n<li>Agile (Scrum) experience.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in developing applications using Microservice Architecture.</li>\n<li>Experience in VB.Net</li>\n</ul>",
        "tags": [
            "2+ Years",
            ".NET Core",
            "C#",
            "SQL"
        ],
        "summary": "Seeking .NET Developers with 2+ years of experience in C# and .NET Core. Responsibilities include building RESTful APIs and server-side solutions. Must have strong SQL skills and understanding of OOP."
    }
]