[
    {
        "job_title": "Intern — React Front-End (with UI/UX Basics)",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/21307/296",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Intern — React Front-End (with UI/UX Basics)</h2>\n<p><strong>Location:</strong> Infopark, Kakkanad\n<strong>Mode:</strong> Full-time (Office)</p>\n<h3>About the Role:</h3>\n<p>We are seeking a React Front-End Intern with foundational knowledge in web development and UI/UX. In this role, you will gain practical experience by supporting the team and contributing to the development of responsive web pages and straightforward features.</p>\n<h3>Skills Required:</h3>\n<ul>\n<li>Basic understanding of React.js</li>\n<li>Knowledge of HTML, CSS, and JavaScript</li>\n<li>Good understanding of UI/UX principles and tools such as Figma/Adobe XD</li>\n<li>Strong willingness to learn and collaborate within a team environment</li>\n<li>Basic understanding of Git (added advantage)</li>\n<li>Knowledge of REST APIs (added advantage)</li>\n</ul>\n<h3>Who Can Apply:</h3>\n<ul>\n<li>Freshers are welcome, specifically 2025, 2024, and 2023 passouts.</li>\n</ul>\n<p>If this opportunity aligns with your career aspirations, please forward your updated resume to careers@grapelime.in.</p>",
        "tags": [
            "0-2 Years",
            "React.js",
            "UI/UX",
            "HTML/CSS/JavaScript"
        ],
        "summary": "Seeking a React Front-End Intern with basic web dev and UI/UX knowledge. Learn, support the team, and build web pages and features. For 2025, 2024, 2023 passouts."
    },
    {
        "job_title": "Data Scientist",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21323/95",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Data Scientist</h2>\n<p>Hands-on Data Scientist with strong Python and backend skills to maintain and improve production algorithms. The focus is on performance optimization, parallel processing, bug fixing, and building/maintaining REST APIs (Django/FastAPI).</p>\n<p>ML/DL is applied pragmatically; GCP is a plus.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Maintain and improve production algorithms; triage and fix bugs; add regression tests</li>\n<li>Profile and optimize code (CPU/memory/I/O); apply parallelism/concurrency where relevant</li>\n<li>Design and maintain REST APIs (Django/DRF or FastAPI) for model/algorithm services</li>\n<li>Test for efficiency and scalability; benchmark latency/throughput; right-size costs</li>\n<li>Ensure high code quality: unit/integration tests, type hints, CI/CD, documentation</li>\n<li>Collaborate with product/data/QA to prioritize improvements and meet SLAs</li>\n</ul>\n<p><strong>Must-Have Qualifications</strong></p>\n<ul>\n<li>6–8 years in data science/software roles with production-grade Python</li>\n<li>Strong Python expertise (pandas, NumPy), profiling tools (cProfile, line_profiler, memory_profiler, py-spy)</li>\n<li>Parallel/concurrent processing (multiprocessing, threading, asyncio) and performance tuning</li>\n<li>REST API development with Django/DRF or FastAPI (auth, error handling, pagination)</li>\n<li>ML fundamentals with scikit-learn; experience deploying models to services</li>\n<li>Testing/quality: pytest/unit test, CI/CD, Git workflows; clear communication and documentation</li>\n<li>Knowledge in scikit-learn, PyTorch or TensorFlow; experiment tracking (MLflow/W&amp;B)</li>\n<li>GCP (Cloud Run/GKE, BigQuery, GCS), Docker/Kubernetes, Cloud Build/GitHub Actions</li>\n<li>Observability: OpenTelemetry, GCP Monitoring/Logging; Sentry</li>\n<li>Security practices: OAuth2/JWT, secrets management, PII handling</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com</p>",
        "tags": [
            "6-8 Years",
            "Python",
            "REST APIs",
            "GCP"
        ],
        "summary": "Data Scientist needed for algorithm improvement and API development. Requires strong Python, backend, and ML skills with a focus on performance and scalability. Apply at career@aabasoft.com."
    },
    {
        "job_title": "HR Executive",
        "company": "Zapare Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21328/137",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>HR Executive</h2>\n<p>As an HR Executive, you will shape the first impression of every employee and help build a lively, disciplined, and growth-driven workplace. You are the heartbeat of daily HR operations and the face of employee support at Zapare.</p>\n<h3>Your Impact</h3>\n<ul>\n<li>Create seamless onboarding experiences that make new hires feel welcomed, valued, and confident.</li>\n<li>Maintain accurate documentation, HRMS updates, and employee records with precision.</li>\n<li>Support attendance management, leave processes, and monthly payroll inputs.</li>\n<li>Coordinate interviews and contribute actively to closing positions with the right talent.</li>\n<li>Assist in employee engagement programs, culture-building initiatives, and internal events.</li>\n<li>Provide timely, empathetic responses to employee queries and support their needs.</li>\n</ul>\n<h3>You Are Someone Who</h3>\n<ul>\n<li>Has 1–3 years of experience in HR or People Operations.</li>\n<li>Is enthusiastic, detail-oriented, and highly organized.</li>\n<li>Enjoys working with people and solving day-to-day challenges with positivity.</li>\n<li>Communicates clearly and handles confidential information responsibly.</li>\n<li>Is eager to grow into a future HR leader and take on expanded responsibilities over time.</li>\n</ul>\n<h3>Why This Role Matters</h3>\n<p>Your work ensures every employee feels supported, heard, and valued. You help keep the organization running smoothly, strengthen its culture, and uplift the employee experience every single day.</p>\n<p>For more details, please Visit: www.zaparetech.com/career</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@zaparetech.com</p>",
        "tags": [
            "1-3 Years",
            "HR Operations",
            "Onboarding",
            "Employee Engagement"
        ],
        "summary": "HR Executive to manage daily operations, onboarding, and employee support. Will ensure smooth HR processes and a positive employee experience."
    },
    {
        "job_title": "HR & Admin Executive",
        "company": "Zapare Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21329/137",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>HR &amp; Admin Executive</h2>\n<p>As an HR &amp; Admin Executive, you play a crucial role in ensuring that the company runs smoothly—across people operations, office administration, and workplace experience. Your work directly influences employee satisfaction, operational efficiency, and the overall culture of the organization.</p>\n<h3>What You’ll Be Trusted With</h3>\n<p><strong>Human Resources Responsibilities</strong></p>\n<ul>\n<li>Supporting end-to-end HR operations including onboarding, documentation, and HRMS updates</li>\n<li>Assisting with attendance, leave coordination, and payroll inputs</li>\n<li>Handling employee queries with clarity, empathy, and professionalism</li>\n</ul>\n<p><strong>Administration &amp; Facility Management</strong></p>\n<ul>\n<li>Overseeing housekeeping, vendor coordination, and office supplies</li>\n<li>Ensuring the workplace is safe, organized, and employee-friendly</li>\n<li>Managing visitor entries, access control, seating plans, and meeting room allocations</li>\n<li>Supporting office events, celebrations, training sessions, and internal meetings</li>\n<li>Maintaining audit-ready records for admin, facility, and compliance documentation</li>\n</ul>\n<h3>You’re a Great Fit If You</h3>\n<ul>\n<li>Have 1–3 years of experience in HR, Administration, or combined roles</li>\n<li>Are dependable, proactive, and resourceful</li>\n<li>Enjoy multitasking and solving day-to-day operational challenges</li>\n<li>Take pride in maintaining high standards of workplace upkeep and people support</li>\n<li>Create a work environment that feels organized, welcoming, and efficient — every single day</li>\n</ul>\n<p>For more details, please Visit: www.zaparetech.com/career</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@zaparetech.com</p>",
        "tags": [
            "1-3 Years",
            "HR Operations",
            "Administration",
            "Facility Management"
        ],
        "summary": "HR & Admin Executive role supporting HR operations and office administration. Responsibilities include onboarding, payroll, vendor coordination, and maintaining a positive workplace. Requires 1-3 years of experience."
    },
    {
        "job_title": "AR Caller",
        "company": "Zapare Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21330/137",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>AR Caller at Zapare Technologies</h2>\n<p>Zapare Technologies, a leading provider of Revenue Cycle Management solutions and services for the US Healthcare industry, is looking for an experienced AR Caller with hands-on exposure in Medical Billing and Claims, particularly in Behavioural Health and Laboratory Billing. The ideal candidate will have strong analytical skills, attention to detail, and excellent communication abilities.</p>\n<h3>Job Specification</h3>\n<ul>\n<li><strong>Job Title:</strong> AR Caller</li>\n<li><strong>Experience:</strong> 1 – 2 Years</li>\n<li><strong>Education Qualification:</strong> Graduate in any stream</li>\n</ul>\n<h3>Job Description:</h3>\n<ul>\n<li>Excellent verbal and written communication skills in English (Mandatory)</li>\n<li>Good Analytical and problem-solving skills</li>\n<li>Basic computer knowledge is essential</li>\n<li>Basic knowledge in MS Office application is essential</li>\n<li>Good keyboarding skills</li>\n<li>Ability to handle high call volumes and meet collection targets.</li>\n<li>Ability to learn and adapt to a fast-paced work culture.</li>\n<li><strong>Working days:</strong> 5 days (Off on Saturday &amp; Sunday)</li>\n<li><strong>Shift schedule:</strong> Night shift only</li>\n</ul>\n<h3>Required Experience:</h3>\n<p>We are seeking candidates with at least 1 - 2 years of hands-on experience in Medical Billing RCM denial management with a strong understanding of the following areas:</p>\n<ul>\n<li>Systematically follow up on aging, underpaid and denied claims with payers to ensure maximum reimbursement for healthcare providers.</li>\n<li>Verification of patient coverage and benefits for specific dates of service prior to or during claim follow-up.</li>\n<li>Initiate contact with insurance companies via phone, payer portals, and written correspondence to appeal denials and expedite claim processing.</li>\n<li>Maintain up-to-date knowledge of insurance policies, coverage, and billing procedures.</li>\n<li>Maintain and document all calls and its correspondence communications in patient accounting system.</li>\n<li>Efficiently maneuver through commercial payor portals (e.g., claims search, patient eligibility, documents upload, appeals dashboards).</li>\n<li>Prioritize claims based on dollar amount, aging status, and payer response timelines.</li>\n<li>Analyze Explanation of Benefits (EOB) and Electronic Remittance Advice (ERA) to identify reasons for non-payment or underpayment.</li>\n<li>Escalate unresolved claims to the appropriate department for further action.</li>\n<li>Identify and correct coding errors, billing discrepancies, or missing documentation that led to the claim issue.</li>\n<li>Compiling medical records from EHR.</li>\n<li>Systematic and regular follow up on appeals, to maintain TFL.</li>\n<li>Ensure compliance with HIPAA regulations and healthcare industry standards.</li>\n<li>Meet daily and monthly AR collection targets.</li>\n</ul>\n<p>For more details, please Visit: www.zaparetech.com/career</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@zaparetech.com</p>",
        "tags": [
            "1-2 Years",
            "Medical Billing",
            "AR Caller",
            "RCM"
        ],
        "summary": "Seeking an AR Caller with 1-2 years of experience in Medical Billing and RCM. Responsibilities include claim follow-up, denial appeals, and meeting collection targets."
    },
    {
        "job_title": "Search Engine Optimization Specialist",
        "company": "Global Surf IT Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21334/421",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Search Engine Optimization Specialist</h2>\n<p><strong>GS-IT</strong>, a leading IT company in Dubai, is committed to excellence, offering professional IT support for infrastructure, IT maintenance, AV, cloud services, cyber security, and strategic IT consulting to drive business success.</p>\n<h3>JOB DESCRIPTION - SEO Specialist</h3>\n<p><strong>Responsibilities:</strong></p>\n<ol>\n<li>\n<p><strong>Search Engine Optimization (SEO)</strong></p>\n<ul>\n<li>Plan and execute end-to-end SEO strategies aligned with business goals focused on the IT industry.</li>\n<li>Perform in-depth keyword research, competitive analysis, and search intent analysis.</li>\n<li>Implement advanced on-page optimization: semantic keywords, internal linking, content clustering, CTR optimization.</li>\n<li>Manage and enhance off-page SEO: high-quality link building, digital PR outreach, backlink audits.</li>\n<li>Conduct regular technical SEO audits and collaborate with developers to resolve issues related to:<ul>\n<li>Crawlability &amp; indexing</li>\n<li>Site architecture</li>\n<li>Page speed &amp; Core Web Vitals</li>\n<li>Schema markup &amp; structured data</li>\n</ul>\n</li>\n<li>Oversee local SEO efforts including Google Business Profile and local citations.</li>\n<li>Track and optimize rankings, organic traffic, and conversions using Google Analytics, Search Console, or similar tools.</li>\n<li>Identify new growth opportunities through algorithm trends, SERP behavior, and industry insights.</li>\n<li>Plan and execute emerging AI trends and integrate AI-driven insights into SEO strategies and adapting to algorithm changes.</li>\n</ul>\n</li>\n<li>\n<p><strong>Content Strategy &amp; Optimization</strong></p>\n<ul>\n<li>Support and guide the content team with SEO-driven content briefs, keyword mapping, and topical authority planning.</li>\n<li>Optimize content for user intent, featured snippets, voice search, and rich results.</li>\n<li>Review and update existing content to improve ranking potential and user engagement.</li>\n<li>Ensure all content meets SEO best practices, readability standards, and brand guidelines.</li>\n</ul>\n</li>\n<li>\n<p><strong>Performance Monitoring &amp; Reporting</strong></p>\n<ul>\n<li>Set up SEO dashboards and reporting frameworks for ongoing performance analysis.</li>\n<li>Prepare monthly SEO reports with insights, outcomes, and strategic recommendations.</li>\n<li>Analyze conversion paths, landing page performance, and behavioral metrics to improve UX and retention.</li>\n<li>Provide actionable suggestions to improve website visibility, structure, and search performance.</li>\n</ul>\n</li>\n<li>\n<p><strong>Collaboration &amp; Digital Marketing Support</strong></p>\n<ul>\n<li>Support in coordination with design, content, and development teams to ensure SEO integration across all digital assets.</li>\n<li>Support broader digital marketing activities, including campaign optimization and landing page improvements.</li>\n<li>Ensure alignment of SEO roadmap with overall digital marketing goals.</li>\n<li>Support digital marketing team in inquiry management via chats, calls, or email.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, IT, Computer Science, Business, or related fields.</li>\n<li>2–3 years proven experience in SEO with measurable results.</li>\n<li>Solid understanding of search engine algorithms, ranking factors, and on-page/off-page strategies.</li>\n<li>Good knowledge of HTML, CSS basics, CMS platforms, and website architecture.</li>\n<li>Experience using Google Search Console, Google Analytics, SEMrush, Ahrefs, Screaming Frog, etc.</li>\n<li>Familiarity with Core Web Vitals, schema markup, and other technical SEO enhancements.</li>\n<li>Understanding of AI trends and AI-driven insights in SEO.</li>\n<li>Strong analytical skills with the ability to interpret data and convert insights into strategy.</li>\n<li>Excellent communication, documentation, and project management skills.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Please send your updated CV to talenthunt@globalsurf.ae with the subject line: “Application for SEO Specialist – GS IT”.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at talenthunt@globalsurf.ae</p>",
        "tags": [
            "2-3 Years",
            "SEO",
            "Google Analytics",
            "SEMrush"
        ],
        "summary": "Seeking an SEO Specialist with 2-3 years of experience to plan and execute SEO strategies, optimize content, and analyze performance. Must have strong analytical and technical SEO skills."
    },
    {
        "job_title": "Technical Content Writer",
        "company": "Global Surf IT Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21335/421",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Technical Content Writer</h2>\n<p>We are looking for a talented Technical Writer with expertise in writing technical content. The ideal candidate will be responsible for crafting clear, detailed technical content such as web pages, product descriptions, technical blogs, and articles.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Write technical content including web pages, product descriptions, technical blogs, and articles, making complex topics easy to understand.</li>\n<li>Work with marketing and product teams to ensure content aligns with brand messaging and business goals.</li>\n<li>Ensure consistency in voice and style across all content, balancing technical accuracy with creative appeal.</li>\n<li>Edit and proofread content to maintain high-quality standards, ensuring clarity, engagement, and SEO optimization.</li>\n<li>Stay updated with industry trends to ensure content is relevant, fresh, and competitive.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Proven experience in writing technical content (web pages, product descriptions, blogs).</li>\n<li>Strong writing, editing, and proofreading skills with attention to detail.</li>\n<li>Familiarity with SEO best practices</li>\n<li>Ability to adapt writing style for different audiences and content types.</li>\n<li>Excellent organizational and time-management skills with the ability to meet deadlines.</li>\n<li>A degree in English, Journalism, Marketing, or a related field is preferred.</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Competitive salary</li>\n<li>Flexible working hours</li>\n<li>Opportunities for career growth and development</li>\n</ul>\n<p>If you are passionate about writing technical content and want to make a real impact, Send your updated CV and Portfolio/Work samples to talenthunt@gloablsurf.ae with the subject line \"Application for Technical Content Writer –GS IT\". If this opportunity aligns with your career goals, kindly share your updated resume with us at talenthunt@globalsurf.ae</p>",
        "tags": [
            "Proven Experience",
            "Technical Writing",
            "SEO",
            "Content Creation"
        ],
        "summary": "Seeking a Technical Content Writer to create clear, detailed technical content. Responsibilities include writing, editing, and ensuring SEO optimization for various platforms."
    },
    {
        "job_title": "Creative Content Writer",
        "company": "Global Surf IT Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21336/421",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Content Writer</h2>\n<p><strong>Company:</strong> Global Surf\n<strong>Experience:</strong> 3+ years</p>\n<p>Global Surf is seeking a skilled Content Writer with a dual expertise in technical and creative writing. This role is crucial for developing engaging and informative content across various platforms.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop clear and detailed technical content, including web pages, product descriptions, technical blogs, and articles, simplifying complex topics for a broad audience.</li>\n<li>Create compelling creative content for social media, marketing campaigns, landing pages, and website copy.</li>\n<li>Collaborate with marketing and product development teams to ensure all content aligns with the company's brand messaging and strategic business objectives.</li>\n<li>Maintain a consistent brand voice and style across all written materials, adeptly balancing technical accuracy with creative flair.</li>\n<li>Edit and proofread all content meticulously to uphold superior quality standards, focusing on clarity, reader engagement, and SEO optimization.</li>\n<li>Stay informed about current industry trends to guarantee content remains relevant, fresh, and competitive.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Demonstrated experience in crafting both technical (web pages, product descriptions, blogs) and creative (social media, marketing copy, web content) materials.</li>\n<li>Exceptional writing, editing, and proofreading abilities with a keen eye for detail.</li>\n<li>Proficiency in SEO best practices applicable to both technical and creative writing styles.</li>\n<li>The ability to adapt writing style effectively for diverse audiences and varied content formats.</li>\n<li>Strong organizational and time-management skills, ensuring timely delivery of projects.</li>\n<li>A degree in English, Journalism, Marketing, or a related field is preferred.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>If you are passionate about writing both technical and creative content and aspire to make a significant impact, please send your updated CV to talenthunt@gloablsurf.ae with the subject line \"Application for Content Writer – Global Surf.\"</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at talenthunt@globalsurf.ae.</p>",
        "tags": [
            "3+ Years",
            "Content Writing",
            "SEO",
            "Technical Writing"
        ],
        "summary": "Content Writer needed for Global Surf with 3+ years experience. Responsibilities include technical and creative content creation, editing, and SEO optimization."
    },
    {
        "job_title": "Marketing Strategy & Research Internship",
        "company": "KL Koncepts Lab Media and IT Park",
        "url": "https://infopark.in/company-jobs/details/21304/332",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Marketing Strategy &amp; Research Internship</h2>\n<p><strong>Duration:</strong> 3 Months\n<strong>Mode:</strong> Work from Home (Remote)\n<strong>Stipend:</strong> Unpaid (Certificate &amp; Experience Provided)</p>\n<h3>About the Role</h3>\n<p>We are offering a 3-month virtual internship in Marketing Strategy &amp; Research for enthusiastic students and fresh graduates. This is an excellent opportunity to gain hands-on experience in market research, strategy development, and data-driven marketing, while working directly with experienced professionals.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct secondary market research on industries, competitors, and customer segments.</li>\n<li>Assist in developing marketing strategy frameworks for different services.</li>\n<li>Work on customer persona creation, segmentation, and positioning exercises.</li>\n<li>Support in preparing case studies, proposals, and pitch decks.</li>\n<li>Track and analyze campaign results to prepare insightful reports.</li>\n<li>Participate in brainstorming sessions with the strategy and creative team.</li>\n</ul>\n<h3>Learning Outcomes</h3>\n<ul>\n<li>Exposure to real-world marketing strategy development.</li>\n<li>Practical experience in market research and competitor analysis.</li>\n<li>Skills in strategy formulation, reporting, and presentations.</li>\n<li>Direct mentorship and feedback from the leadership team.</li>\n<li>Certificate of Completion &amp; LinkedIn Endorsements (on successful completion).</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Currently pursuing or recently completed Bachelor’s/Master’s in Business, Marketing, or related field.</li>\n<li>Strong interest in marketing strategy, branding, and research.</li>\n<li>Good analytical skills with proficiency in MS Excel/Google Sheets &amp; PowerPoint/Google Slides.</li>\n<li>Self-motivated, detail-oriented, and disciplined to work in a remote environment.</li>\n</ul>\n<h3>Duration &amp; Commitment</h3>\n<ul>\n<li>3 Months (Work From Home)</li>\n<li>Flexible working hours (minimum weekly commitment expected: 15–20 hours).</li>\n</ul>\n<h3>Perks</h3>\n<ul>\n<li>Internship Certificate</li>\n<li>Work-from-home flexibility</li>\n<li>Exposure to live projects &amp; strategic assignments</li>\n<li>Opportunity to publish co-authored blogs/case studies with the team</li>\n<li>Recommendation/LinkedIn endorsement (based on performance)</li>\n</ul>\n<h3>Apply Now</h3>\n<p>Send your application with the subject line:“Marketing Strategy &amp; Research Internship”\nto hr@konceptslab.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@konceptslab.com</p>",
        "tags": [
            "0-1 Years",
            "Market Research",
            "Marketing Strategy",
            "Data Analysis"
        ],
        "summary": "Gain hands-on marketing strategy and research experience in this 3-month remote internship. Develop skills in market analysis, strategy formulation, and reporting."
    },
    {
        "job_title": ".NET Project Lead (Contract Based)",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21319/41",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>.NET Project Lead (Contract Based)</h2>\n<p>We are seeking an experienced <strong>.NET Project Lead</strong> for a contract-based role. This position involves overseeing project execution, guiding development teams, and managing client interactions. The ideal candidate will possess strong technical expertise, excellent communication skills, and proven end-to-end project management capabilities.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead and mentor a .NET development team, overseeing project workflows.</li>\n<li>Manage client interactions, including requirement gathering, clarifications, demos, and status updates.</li>\n<li>Translate client expectations into clear technical tasks for the development team.</li>\n<li>Design and develop applications utilizing <strong>.NET / .NET Core</strong>.</li>\n<li>Develop and optimize <strong>Web APIs</strong> and ensure seamless integration with front-end applications.</li>\n<li>Conduct code reviews, enforcing coding standards and best practices.</li>\n<li>Collaborate effectively with QA, UI/UX, and product teams throughout the Software Development Life Cycle (SDLC).</li>\n<li>Troubleshoot complex technical issues and ensure timely resolution.</li>\n<li>Work with <strong>MSSQL/MySQL</strong>, writing efficient and optimized queries.</li>\n<li>Prepare clear technical documentation and project reports.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li><strong>4+ years of experience</strong> working with C#, <strong>.NET Framework / .NET Core</strong>.</li>\n<li>Proven experience leading small teams or development modules.</li>\n<li>Strong knowledge of <strong>Web API</strong> development and Entity Framework.</li>\n<li>Excellent communication and client-handling skills.</li>\n<li>Strong understanding of Object-Oriented Programming (OOP), design patterns, and clean coding principles.</li>\n<li>Ability to manage timelines, priorities, and ensure delivery quality.</li>\n<li>Knowledge of Angular is considered an added advantage.</li>\n<li>Experience in contract-based or fast-paced project environments is a plus.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@lucidplus.com.</p>",
        "tags": [
            "4+ Years",
            ".NET Core",
            "Web API",
            "MSSQL"
        ],
        "summary": "Experienced .NET Project Lead needed for contract work. Responsible for team leadership, client management, and full project lifecycle execution using .NET technologies."
    },
    {
        "job_title": "IT Sales Consultant (Contract Based)",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21337/41",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>IT Sales Consultant (Contract Based)</h2>\n<p>We are looking for an experienced IT Sales Consultant to support sales activities across our services, products, and technology solutions. The ideal candidate should be skilled in lead generation, client engagement, and driving sales conversations independently.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Generate leads and build a strong sales pipeline</li>\n<li>Contact potential clients through calls, emails, and LinkedIn</li>\n<li>Understand client needs and propose suitable IT solutions</li>\n<li>Prepare and deliver sales presentations, demos, and proposals</li>\n<li>Coordinate with technical teams for estimates and solution details</li>\n<li>Handle RFP/RFQ responses and support deal negotiations</li>\n<li>Maintain CRM records and provide regular sales updates</li>\n<li>Meet monthly/quarterly sales targets</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>2–5+ years of experience in IT sales, software services sales, or tech consulting</li>\n<li>Proven track record of lead generation and closing deals in IT services</li>\n<li>Strong understanding of the software development life cycle (SDLC) and IT solutions</li>\n<li>Excellent communication, presentation, and negotiation skills</li>\n<li>Familiarity with CRM tools</li>\n<li>Ability to work independently and meet sales targets</li>\n<li>Experience working in fast-paced or contract-based environments is a plus</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@lucidplus.com</p>",
        "tags": [
            "2-5+ Years",
            "IT Sales",
            "Lead Generation",
            "CRM"
        ],
        "summary": "Experienced IT Sales Consultant needed for contract role. Responsibilities include lead generation, client engagement, and driving sales for IT solutions. Requires 2-5+ years of experience."
    },
    {
        "job_title": "MERN Stack Developer (1 year of experience)",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/21326/387",
        "location": "Infopark",
        "closing_date": "16 Dec 2025",
        "job_description": "<h2>MERN Stack Developer</h2>\n<p><strong>Experience:</strong> 1–2 Years\n<strong>Location:</strong> Kochi\n<strong>Notice:</strong> Immediate</p>\n<h3>About the Role</h3>\n<p>We are looking for a passionate and detail-oriented MERN Stack Developer with 1–2 years of hands-on experience to join our team. The ideal candidate should be strong in JavaScript, comfortable working across the full stack, and eager to learn and grow in a fast-paced environment.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and maintain web applications using MongoDB, Express.js, React.js, and Node.js.</li>\n<li>Build reusable, scalable, and efficient front-end and back-end components.</li>\n<li>Integrate APIs and third-party services into web applications.</li>\n<li>Write clean, well-structured, and maintainable code.</li>\n<li>Troubleshoot, debug, and optimize application performance.</li>\n<li>Collaborate with UI/UX designers to implement intuitive user interfaces.</li>\n<li>Work closely with the team to understand functional requirements and deliver high-quality solutions.</li>\n<li>Participate in code reviews and contribute to best practices.</li>\n</ul>\n<h3>Education</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience).</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at careers@alignminds.com</p>",
        "tags": [
            "1-2 Years",
            "MERN Stack",
            "JavaScript",
            "React.js"
        ],
        "summary": "MERN Stack Developer with 1-2 years of experience sought for full-stack development. Responsibilities include building, integrating, and optimizing web applications using MongoDB, Express.js, React.js, and Node.js."
    },
    {
        "job_title": "Senior DevOps Engineer / Platform Engineer",
        "company": "Pagematics India Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21312/467",
        "location": "Infopark",
        "closing_date": "20 Dec 2025",
        "job_description": "<h2>Senior DevOps Engineer / Platform Engineer</h2>\n<p><strong>Primary Role:</strong>\nBuild, automate, and maintain AWS cloud infrastructure as code (IaC); manage CI/CD pipelines.</p>\n<p><strong>Responsibilities:</strong>\n- Define and maintain IaC (Terraform, CloudFormation)\n- Build and manage CI/CD pipelines (e.g., GitHub Actions, CodePipeline)\n- Set up environments (DEV, QA, PREPROD, PROD) using ECS/EKS/EC2/Lambda\n- Manage IAM roles, VPCs, security groups, subnets\n- Ensure logging, monitoring agents (e.g., CloudWatch, Datadog) and audit capabilities are in place\n- Validate cost-efficiency and resource tagging\n- Implement security tools used to scan vulnerability and remediation processes.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at remya.ps@pagematics.in</p>",
        "tags": [
            "5+ Years",
            "AWS",
            "Terraform",
            "CI/CD"
        ],
        "summary": "Seeking a Senior DevOps/Platform Engineer to build and maintain AWS cloud infrastructure using IaC and manage CI/CD pipelines. Responsibilities include environment setup, security, and cost optimization."
    },
    {
        "job_title": "Frontend Developer (Angular)",
        "company": "Softspace Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21310/361",
        "location": "Infopark",
        "closing_date": "24 Dec 2025",
        "job_description": "<h2>Frontend Developer (Angular)</h2>\n<p><strong>Job Title:</strong> Frontend Developer (Angular)</p>\n<p><strong>Experience:</strong> 3+ Years (Angular 15+)</p>\n<p><strong>Location:</strong> Cochin</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<h3>Key Skills:</h3>\n<ul>\n<li>Angular (15+)</li>\n<li>TypeScript</li>\n<li>RxJS</li>\n<li>Angular Material / PrimeNG</li>\n<li>Deployment Experience</li>\n</ul>\n<h3>Role Summary:</h3>\n<p>We’re looking for an experienced Frontend Developer with strong expertise in Angular 15+ to build and enhance responsive, high-performance web applications.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at career@softspace.ae</p>",
        "tags": [
            "3+ Years",
            "Angular",
            "TypeScript",
            "RxJS"
        ],
        "summary": "Seeking an experienced Frontend Developer with 3+ years in Angular 15+ to build high-performance web applications. Apply with your resume to career@softspace.ae."
    },
    {
        "job_title": ".Net Core Developer",
        "company": "Softspace Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21311/361",
        "location": "Infopark",
        "closing_date": "24 Dec 2025",
        "job_description": "<h1>.NET Core Developer</h1>\n<p><strong>Job Title:</strong> .NET Core Developer\n<strong>Experience:</strong> 4+ Years\n<strong>Location:</strong> Cochin\n<strong>Employment Type:</strong> Full-time</p>\n<h2>Position Overview</h2>\n<p>We are seeking an experienced .NET Core Developer with a strong background in building scalable, secure, and high-performance web applications. The ideal candidate will have solid expertise in C#, .NET Core 8, ASP.NET Core Web API, SQL Server, and Entity Framework Core. Experience with Angular is an added advantage.</p>\n<h2>Key Requirements</h2>\n<ul>\n<li>Full-time role with 3–4+ years of hands-on experience in .NET Core development</li>\n<li>Strong proficiency in C#, .NET Core 8, and ASP.NET Core Web API</li>\n<li>Practical experience with SQL Server and Entity Framework Core</li>\n<li>Strong understanding of RESTful API design and best practices</li>\n<li>Ability to write clean, maintainable, and scalable code</li>\n<li>Angular experience is an added advantage</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at career@softspace.ae</p>",
        "tags": [
            "4+ Years",
            ".NET Core",
            "ASP.NET Core Web API",
            "SQL Server"
        ],
        "summary": "Seeking a .NET Core Developer with 4+ years experience in C# and ASP.NET Core. Must have SQL Server and Entity Framework Core expertise. Angular experience is a plus."
    },
    {
        "job_title": "Social Media Executive",
        "company": "Orestes Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21305/390",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Social Media Executive</h2>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for a creative and results-driven Social Media Executive with 2–3 years of experience to manage and enhance our online presence. The ideal candidate will be responsible for creating engaging content, executing social media strategies, and driving brand awareness across various digital platforms.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Handling Social media accounts and client coordination.</li>\n<li>Plan, create, and publish engaging content across social media platforms such as Facebook, Instagram, LinkedIn, X (Twitter), and YouTube.</li>\n<li>Monitor social media trends, insights, and competitor activities to enhance content strategy.</li>\n<li>Create monthly and quarterly content calendars and campaign roadmaps.</li>\n<li>Manage daily posting schedules using social media tools (e.g., Buffer, Hootsuite, Meta Business Suite).</li>\n<li>Collaborate with creative team and campaign team along with designers, writers, and video editors to produce engaging content. Ensure all content reflects brand tone, voice, and visual identity.</li>\n<li>Develop and run paid social media campaigns to increase reach and engagement.</li>\n<li>Track performance metrics, generate monthly reports, and suggest improvements.</li>\n<li>Respond to comments, queries, and messages across platforms promptly.</li>\n<li>Support influencer collaborations and social media partnerships.</li>\n<li>Maintain brand consistency in tone, style, and messaging.</li>\n<li>Contribute ideas for new content formats, contest and campaign strategies.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Communication, or a related field.</li>\n<li>2–3 years of hands-on experience in social media management.</li>\n<li>Strong understanding of social media algorithms, trends, and analytics.</li>\n<li>Proficiency in tools such as social media schedulers.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to create engaging content (captions, posts, reels concepts).</li>\n<li>Basic understanding of paid ads and targeting will be an added advantage.</li>\n<li>Creative thinker with strong attention to detail.</li>\n<li>Ability to work independently and in a team environment.</li>\n<li>Certification in digital marketing is an add on.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates please share the resume to aswathy@orestestech.com\nFor further contact: 8089671177\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at aswathy@orestestech.com</p>",
        "tags": [
            "2-3 Years",
            "Social Media Management",
            "Content Creation",
            "Digital Marketing"
        ],
        "summary": "Seeking a Social Media Executive with 2-3 years experience to manage online presence, create engaging content, and execute social media strategies. Responsibilities include content planning, campaign execution, and performance tracking."
    },
    {
        "job_title": "React Native Developer",
        "company": "Planet Media India ( PMIN Agency Pvt.Ltd.)",
        "url": "https://infopark.in/company-jobs/details/21306/266",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>React Native Developer</h2>\n<p><strong>Job Summary:</strong></p>\n<p>We are seeking an experienced React Native Developer with at least 2 years of hands-on mobile application development experience. The ideal candidate must have solid expertise in React Native and a working knowledge of Flutter to support cross-platform development initiatives. You will be responsible for building high-performance mobile apps, collaborating with cross-functional teams, and delivering robust, scalable solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, maintain, and enhance mobile applications using React Native.</li>\n<li>Collaborate with product managers, designers, and backend developers to build seamless app experiences.</li>\n<li>Write clean, maintainable, and reusable code following best practices.</li>\n<li>Integrate third-party APIs, libraries, and native modules.</li>\n<li>Optimize mobile applications for maximum performance, responsiveness, and scalability.</li>\n<li>Troubleshoot and debug issues, performing root cause analysis and fixing bugs efficiently.</li>\n<li>Participate in code reviews and contribute to improving development standards.</li>\n<li>Work with Flutter when needed for specific modules or cross-platform features.</li>\n<li>Stay updated with the latest trends in mobile development frameworks and technologies.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>2 years of experience in mobile application development.</li>\n<li>Strong proficiency in React Native and its core principles.</li>\n<li>Practical knowledge of Flutter (basic to intermediate) and willingness to work across frameworks.</li>\n<li>Experience with TypeScript, JavaScript ES6+, and mobile architecture patterns (MVVM, Redux, etc.).</li>\n<li>Solid understanding of mobile UI/UX principles and platform guidelines (Android/iOS).</li>\n<li>Experience with RESTful APIs, JSON, and third-party integrations.</li>\n<li>Familiarity with native build tools like Xcode, Android Studio, Gradle.</li>\n<li>Experience in managing &amp; publishing apps to the Google Play Store and Apple App Store.</li>\n<li>Proficient with Git and version control workflows.</li>\n<li>Strong problem-solving skills, debugging abilities, and attention to detail.</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@planetmedia.in</p>",
        "tags": [
            "2+ Years",
            "React Native",
            "Flutter",
            "TypeScript"
        ],
        "summary": "Seeking an experienced React Native Developer with 2+ years experience. Responsibilities include building high-performance mobile apps and collaborating with teams. Knowledge of Flutter is required."
    },
    {
        "job_title": "AI Developer",
        "company": "In-Tech Group India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21308/397",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>AI Developer</h2>\n<p><strong>About the Job</strong></p>\n<p>As a specialist in electronics and software for the past 20 years, in-tech is a dynamic, fast-growing engineering company headquartered in Munich, Germany, employing around 2350 employees globally across 20 project locations in 8 countries. in-tech develops innovative engineering solutions for the automotive, rail, aerospace, defence, and industrial sectors.</p>\n<p>We are committed to a flexible, modern work culture and work-life balance. Our colour orange stands for liveliness, warmth, and dynamism. We value a strong team spirit, fresh ideas, and a positive work culture. We call it the “Orange Spirit”!</p>\n<p>Since 2024, in-tech became a subsidiary of Infosys Ltd. This strategic partnership enables us to offer our customers even more comprehensive development and digitalization services and a greater offshore capability. We are looking for an experienced AI Developer to join our team based out of our Kochi location with hybrid work options, to lead the design, development, and deployment of cutting-edge AI, Generative AI, and Agentic-AI solutions for enterprise customers. If you’re passionate about joining a growing and dynamic team with a company with a positive culture and team spirit, we’d love to connect with you!</p>\n<p><strong>Responsibilities</strong></p>\n<ol>\n<li>Design, plan, and implement AI, Generative AI, and Agentic-AI architectures for customer projects.</li>\n<li>Develop custom end-to-end GenAI and LLM-based solutions, using frameworks such as LangChain, LangGraph, AutoGen, HuggingFace, and OpenAI APIs.</li>\n<li>Implement and operate machine learning systems using TensorFlow, PyTorch, and modern LLM/ML tooling.</li>\n<li>Build and manage cloud-based AI ecosystems on AWS, Azure, or GCP, including architecture design and platform operations.</li>\n<li>Apply DevOps/MLOps and LLMOps practices, including CI/CD pipelines, containerization (Docker, Kubernetes), and model deployment workflows.</li>\n<li>Collaborate closely with enterprise architects, engineering teams, and C-level stakeholders to align AI roadmaps and solution strategies.</li>\n<li>Evaluate and introduce new AI technologies, frameworks, and agentic tools to expand the organization’s (Gen)AI capabilities.</li>\n<li>Lead the technical execution of proof-of-concepts (PoCs) in an agile environment.</li>\n<li>Provide strategic consulting on cloud-native, scalable, and secure AI platform architectures.</li>\n</ol>\n<p><strong>Requirements</strong></p>\n<ol>\n<li>Degree in (Business) Computer Science, Engineering, or a comparable technical field.</li>\n<li>5+ years of experience as a Solutions Architect or Enterprise Architect in cloud/data environments.</li>\n<li>Proven experience developing and integrating LLM or Generative AI solutions into production systems.</li>\n<li>Hands-on project experience designing complex cloud architectures on AWS, Azure, or GCP.</li>\n<li>Strong knowledge of AI/ML development with Python and major ML frameworks (TensorFlow, PyTorch, HuggingFace).</li>\n<li>Practical experience with agentic AI frameworks (e.g., LangGraph, AutoGen) and LLM orchestration tools.</li>\n<li>Experience with MLOps, DevOps, and container technologies such as Docker and Kubernetes; familiarity with CI/CD for ML models.</li>\n<li>Understanding of architecture frameworks and agile methods (Scrum, Kanban).</li>\n<li>Excellent English communication skills.</li>\n<li>Willingness to travel, depending on project requirements.</li>\n</ol>\n<p><strong>Apply with us</strong></p>\n<p>If you have experience and team spirit and are looking for a great place to work, then start your job with us.</p>\n<p>As part of our dedication to the diversity of our workforce, in-tech is committed to equal employment opportunity without regard for age, race, colour, national origin, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity, or religion.</p>\n<p><strong>Contact:</strong></p>\n<ul>\n<li>Website: https://in-tech.com/en/carrers/jobs/ai-developer-1881</li>\n<li>Email: india.talent@in-tech.com</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Generative AI",
            "LLM",
            "Cloud"
        ],
        "summary": "Experienced AI Developer sought for designing and deploying AI, GenAI, and Agentic-AI solutions. Requires 5+ years in cloud/data architecture with strong Python and ML framework experience."
    },
    {
        "job_title": "Academic Associate (Operations) - (Preferring Freshers)",
        "company": "TutorComp Infotech (I) Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21309/44",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Academic Associate (Operations)</h2>\n<p>We are seeking a dynamic and enthusiastic individual with strong command of the English language and the ability to handle international clients to join our team as an Academic Associate.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Strong problem solving and client interaction skills, and ability to work in a result-oriented team environment.</li>\n<li>Maintains relationships with clients by providing support, information, and guidance, researching, and recommending new opportunities.</li>\n<li>Identifies business opportunities by identifying prospects. Researching and analyzing sales options.</li>\n<li>Prepares reports by collecting, analysing, and summarizing information.</li>\n<li>Maintains quality service by establishing and enforcing organization standards.</li>\n<li>Contributes to team effort by accomplishing related results as needed.</li>\n<li>Communicating with clients or employers about project, event or campaign expectations and goals.</li>\n<li>Answer telephones and respond to inquiries from clients and participants.</li>\n<li>Create, compile and export databases containing all information for each event.</li>\n<li>Deal with customer complaints or issues.</li>\n<li>Supporting other teams with various administrative tasks (redirecting calls, disseminating correspondence, scheduling meetings etc.).</li>\n<li>Being an active member in supporting the collective well-being of the organization and team, to provide quality educational service worldwide.</li>\n</ul>\n<h3>Requirements &amp; Other Details:</h3>\n<ul>\n<li>Graduate/Post Graduate.</li>\n<li>Experience: 0 to 1 year experience in customer handling.</li>\n<li>Strong written &amp; oral communication skills in English.</li>\n<li>Organized with the ability to prioritize and multi-task.</li>\n<li>Reliable with patience and professionalism.</li>\n<li>Willing to work in Shifts.</li>\n<li>Job location: Infopark Cochin Phase-I</li>\n</ul>\n<h3>About Us:</h3>\n<p>TutorComp is an online tutoring global leader providing personalized tutors all over the world. We enable students across the World to learn, excel and stay ahead of the knowledge and innovation curve. Our exceedingly qualified and expert tutors enable students to outperform and deliver outstanding grades. Our mission is to make learning easily accessible to students, and to leverage technology and global talent. Our global operations are supported through an extensive network at various worldwide markets of United States, United Kingdom, Hong Kong, Singapore, Australia, France, India, UAE (Abu Dhabi, Ajman, Dubai, and Sharjah), Kuwait, Bahrain, Qatar, Saudi Arabia and Malaysia.</p>\n<p><strong>Contact Information:</strong>\nInterested candidates can apply by sharing their resume to hr@tutorcomp.com</p>",
        "tags": [
            "0-1 Years",
            "Client Interaction",
            "Customer Handling",
            "English Communication"
        ],
        "summary": "Seeking an Academic Associate for operations. This role involves client interaction, administrative tasks, and problem-solving for a global online tutoring leader. Freshers with strong English skills preferred."
    },
    {
        "job_title": "Backend Engineer",
        "company": "Testing Mavens Software Pvt  Ltd",
        "url": "https://infopark.in/company-jobs/details/21314/200",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Backend Engineer</h2>\n<p><strong>About Us</strong></p>\n<p>Testing Mavens is a next-generation QA &amp; Software Testing Services provider headquartered in New Jersey, USA, with offshore facilities in India. We have deep expertise in various spheres like Finance and Advisory, EdTech, Fashion and Pharmacy, etc. We partner with massive global brands to deliver an excellent testing experience.</p>\n<p><strong>Job Title:</strong> Backend Engineer\n<strong>Location:</strong> Remote\n<strong>Type:</strong> Full-time\n<strong>Availability:</strong> Immediate Joiners Only</p>\n<p><strong>About the Role</strong></p>\n<p>We are looking for a skilled and motivated Backend Engineer to join our team. In this role, you’ll play a key part in designing, building, and maintaining scalable backend systems and APIs that power our applications. You should have strong experience with Python, Node.js, and cloud infrastructure on AWS. This is a backend-focused role — though exposure to full stack environments is welcome, we’re primarily looking for someone who thrives in building robust backend systems.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design, develop, and maintain backend services, APIs, and microservices.</li>\n<li>Write clean, scalable, and well-documented code in Python and Node.js.</li>\n<li>Integrate and manage cloud-based infrastructure using AWS services (e.g., EC2, Lambda, S3, RDS, API Gateway).</li>\n<li>Collaborate with frontend engineers, product managers, and QA to deliver high-quality features.</li>\n<li>Optimize applications for speed, scalability, and reliability.</li>\n<li>Implement and manage CI/CD pipelines.</li>\n<li>Monitor and troubleshoot production systems as needed.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>3+ years of backend development experience.</li>\n<li>Proficiency in Python and Node.js.</li>\n<li>Strong understanding of RESTful API design and microservices architecture.</li>\n<li>Hands-on experience with AWS services (e.g., Lambda, S3, EC2, RDS, CloudWatch).</li>\n<li>Experience with databases: SQL (PostgreSQL, MySQL) and NoSQL (DynamoDB, MongoDB).</li>\n<li>Familiarity with version control systems (e.g., Git).</li>\n<li>Understanding of security, authentication, and authorization in APIs.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Experience with Docker and container orchestration tools (e.g., ECS, Kubernetes).</li>\n<li>Exposure to serverless architecture.</li>\n<li>Familiarity with logging/monitoring tools (e.g., ELK, CloudWatch, Datadog).</li>\n<li>Basic understanding of frontend frameworks like React or Next.js.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hire@testingmavens.com</p>",
        "tags": [
            "3+ Years",
            "Python",
            "Node.js",
            "AWS"
        ],
        "summary": "Seeking a Backend Engineer to design and build scalable backend systems and APIs. Requires Python, Node.js, and AWS experience for a remote, full-time role."
    }
]