[
    {
        "job_title": "Animation Production Coordinator",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/23234",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Animation Production Coordinator</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong> is seeking an experienced Animation Production Coordinator to support the smooth execution of animated projects from pre-production through delivery.</p>\n<p><strong>Location:</strong>\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala\nIndia, 695 581\nhttp://www.prayananimation.com</p>\n<p><strong>Contact Email:</strong> jobs@prayananimation.com</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Coordinate daily production activities across multiple departments (illustration, storyboard, layout, design, animation, compositing, etc.).</li>\n<li>Plan and track project progress, update schedules, and flag risks to ensure deadlines are met.</li>\n<li>Attend client calls and understand the project inside out.</li>\n<li>Maintain clear communication between artists, supervisors, and production management.</li>\n<li>Prepare and distribute production reports, meeting notes, and task lists.</li>\n<li>Assist in resource planning—managing assignments, deadlines, and approvals.</li>\n<li>Support the Production Manager in organizing reviews, dailies, and deliveries.</li>\n<li>Ensure assets, files, and documentation are properly named, stored, and delivered.</li>\n<li>Anticipate potential workflow or pipeline issues and propose solutions.</li>\n<li>Serve as a point of contact for external vendors or freelance talent when required.</li>\n</ul>\n<p><strong>Qualifications &amp; Skills:</strong></p>\n<ul>\n<li><strong>Experience:</strong> Minimum 3–5 years in animation, 2D, 3D and Books illustration.</li>\n<li>Strong understanding of the animation/illustration pipeline.</li>\n<li>Proficient in production tracking tools (e.g., Frame.io, Discord, slack, Excel, Google sheets, or similar).</li>\n<li>Excellent communication skills (English and Hindi).</li>\n<li>Excellent organizational and time-management skills with attention to detail.</li>\n<li>Strong communication and interpersonal skills—able to work effectively with both creative and technical teams.</li>\n<li>Ability to multitask and prioritize in a fast-paced environment.</li>\n<li>Problem-solving mindset and proactive attitude.</li>\n</ul>\n<p><strong>Preferred (Nice-to-Have):</strong></p>\n<ul>\n<li>Experience in 2D animation series or educational animation pipelines.</li>\n<li>Experience in children’s book and comic book production.</li>\n<li>Familiarity with industry-standard software (Animate, Toon Boom Harmony, After Effects etc.).</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>To apply, please submit your resume to jobs@prayananimation.com. Please put \"Resume – Animation Production Coordinator\" in the mail subject line.</p>",
        "tags": [
            "3-5 Years",
            "Animation Pipeline",
            "Production Tracking Tools",
            "Interdepartmental Communication"
        ],
        "summary": "Prayan Animation Studio is hiring an Animation Production Coordinator. This role requires 3-5 years of experience and strong organizational and communication skills to manage animated projects."
    },
    {
        "job_title": "FRONT OFFICE EXECUTIVE/ HR- ADMIN",
        "company": "Doubtbox Edutainment (P) Ltd",
        "url": "https://technopark.org/job-details/23233",
        "location": "Technopark",
        "closing_date": "25 Sep 2025",
        "job_description": "<h2>Front Office Executive/ HR- ADMIN</h2>\n<p><strong>Doubtbox Edutainment (P) Ltd</strong>\n1st Floor, Nila Building, Technopark, Trivandrum, 695581\nhttp://www.doubtbox.com</p>\n<p><strong>Closing Date:</strong> 25, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025\n<strong>Contact Email:</strong> hr@doubtbox.com</p>\n<p>Doubtbox is a prominent Personalised LIVE Learning platform catering to students of classes 1-12 under CBSE/ICSE/State Boards. The platform transforms learning into an engaging and enjoyable experience with personalized LIVE Online Teaching.</p>\n<p><strong>About Doubtbox:</strong></p>\n<ul>\n<li>Decade of experience with self-learning content distributed by Malayala Manorama.</li>\n<li>Benefited over 1,00,000 students.</li>\n<li>Investment from Times of India group.</li>\n<li>Recognized as the best EdTech start-up of 2020 by Amazon Edstart.</li>\n<li>Contracted pool of approximately 1000 teachers.</li>\n<li>Expanding into the Middle East Region.</li>\n</ul>\n<p><strong>Job Summary:</strong></p>\n<p>We are seeking a highly organized and skilled HR cum Front Office Manager to oversee human resources functions, front office operations, and administrative tasks. The successful candidate will be responsible for managing employee relations, recruitment, training, and front office activities, ensuring a seamless and efficient work environment.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage HR functions, including recruitment, talent management, and employee relations</li>\n<li>Oversee front office operations, ensuring excellent customer service and smooth day-to-day activities</li>\n<li>Handle administrative tasks, such as data entry, record-keeping, and office management</li>\n<li>Develop and implement HR policies and procedures</li>\n<li>Ensure compliance with labor laws and regulations</li>\n<li>Time management and Document management</li>\n<li>Handling Day to day activities along with Office management</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor's degree in HR, Business Administration, or related field</li>\n<li>Experience in HR and/or front office administration</li>\n<li>Proven experience in HR and front office management</li>\n<li>Excellent communication and interpersonal skills</li>\n<li>Strong organizational and problem-solving skills</li>\n<li>Ability to multitask and prioritize tasks effectively</li>\n</ul>",
        "tags": [
            "1+ Years",
            "HR Management",
            "Front Office Operations",
            "Recruitment"
        ],
        "summary": "Seeking a skilled HR cum Front Office Manager to manage HR functions, front office operations, and administrative tasks. The role ensures an efficient work environment through excellent customer service and HR policy implementation."
    },
    {
        "job_title": "Accounts Manager",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23232",
        "location": "Technopark",
        "closing_date": "18 Oct 2025",
        "job_description": "<h2>Accounts Manager</h2>\n<p><strong>Location:</strong> Trivandrum (Work from office)\n<strong>Salary:</strong> 6 LPA\n<strong>Job Type:</strong> Full-time, Permanent</p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Roles &amp; Responsibilities:</strong></p>\n<ul>\n<li>Take the lead role in company share issue procedures, including company valuation, preparation of projections, and statutory documents for stakeholders and ROC.</li>\n<li>Communicate with valuers to explain projections and the logic behind them.</li>\n<li>Prepare share issue offer documents and ensure proper documentation for company statutory meetings, resolutions, and ROC intimations.</li>\n<li>Create realistic cash flow projections, considering statutory requirements, payment prioritization, and receivables.</li>\n<li>Prepare budgets and conduct periodic analysis comparing them with actual financial performance.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Qualification:</strong> Cleared at least one group of CA IPCC.</li>\n<li><strong>Experience:</strong> 3 years of quality Articleship experience in a Chartered Accountants firm (no post-CA Articleship experience required).</li>\n<li>Confident in using Excel to an intermediate level.</li>\n<li>Ability to work on own initiative.</li>\n<li>Outstanding team leader to guide the finance team.</li>\n<li>Strong attention to detail and good analytical skills.</li>\n<li>Good communication skills, both verbal and written.</li>\n</ul>\n<p><strong>Pay scale:</strong> 6 lakhs per annum</p>\n<p><strong>Company Information:</strong>\nREIZEND (P) Ltd\nSBC Module 15, -2 Floor, Thejaswini Building,\nTechnopark phase 1, Trivandrum, 695581\nhttp://www.reizendretail.in</p>",
        "tags": [
            "3+ Years",
            "Share Issuance",
            "Cash Flow Projections",
            "Financial Analysis",
            "CA IPCC"
        ],
        "summary": "Reizend is seeking an Accounts Manager in Trivandrum to lead share issue procedures and create financial projections. The role requires 3+ years of articleship experience and strong analytical skills."
    },
    {
        "job_title": "Investor Relations & Fundraising Manager ( Part Time)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23231",
        "location": "Technopark",
        "closing_date": "18 Oct 2025",
        "job_description": "<h2>Investor Relations &amp; Fundraising Manager (Part Time)</h2>\n<p><strong>REIZEND (P) Ltd</strong>\nSBC Module 15,\n-2 Floor, Thejaswini Building,\nTechnopark phase 1, Trivandrum , 695581\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Employment Type:</strong> Part-time\n<strong>Experience:</strong> 3+ years preferred in Banking / Wealth Management / Investment Advisory / Fundraising\n<strong>CTC:</strong> 9 LPA\n<strong>Work mode:</strong> Remote</p>\n<p><strong>Job Description:</strong>\nWe are seeking a professional with strong experience in banking, wealth management, or investment advisory to drive fundraising initiatives for our technology firm. The role involves connecting with investors, preparing investment pitches, and managing relationships to secure funding for business growth.</p>\n<p><strong>Key Responsibilities:</strong>\n- Identify and connect with potential investors (VCs, HNIs, Family Offices, PE firms).\n- Prepare and present investment pitches, business plans, and financial models.\n- Manage relationships with investors and provide timely updates.\n- Support negotiations and deal structuring for fundraising.\n- Work with leadership to align funding strategy with business goals.</p>\n<p><strong>Preferred Skills:</strong>\n- Graduate/Postgraduate in Finance, Business, or related field.\n- 3+ years’ experience in fundraising, banking, wealth management, or investment sales.\n- A strong network with investors and financial institutions is a plus.\n- Excellent communication, presentation, and relationship-building skills.\n- Knowledge of financial markets, investment products, and funding.</p>\n<p><strong>Closing Date:</strong> 18, Oct 2025\n<strong>Job Published:</strong> 03, Sept 2025</p>",
        "tags": [
            "3+ Years",
            "Fundraising",
            "Wealth Management",
            "Investment Advisory"
        ],
        "summary": "Seeking a part-time Investor Relations & Fundraising Manager to drive fundraising for a technology firm. Responsibilities include investor relations, pitch preparation, and deal structuring."
    },
    {
        "job_title": "Behavioural Scientist ( Part time)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23230",
        "location": "Technopark",
        "closing_date": "18 Oct 2025",
        "job_description": "<h2>Behavioral Scientist (Part-time)</h2>\n<p><strong>REIZEND (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\nhttp://www.reizendretail.in</p>\n<p><strong>Closing Date:</strong> 18, Oct 2025\n<strong>Job Published:</strong> 03, Sept 2025\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Employment Type:</strong> Part-time\n<strong>Experience:</strong> 3+ years preferred\n<strong>CTC:</strong> 4 LPA\n<strong>Work mode:</strong> Remote</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a passionate and analytical Behavioral Scientist to help us understand, predict, and influence human behavior through research-driven interventions. You will apply behavioral science principles to solve complex challenges across domains such as user experience, public health, financial decision-making, or organizational design.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and conduct qualitative and quantitative behavioral research (e.g., surveys, interviews, ethnographic studies, experiments).</li>\n<li>Identify behavioral biases and drivers that influence decision-making and user actions.</li>\n<li>Translate insights into actionable strategies, nudges, or interventions that drive measurable outcomes.</li>\n<li>Collaborate cross-functionally with product, design, marketing, and strategy teams to embed behavioral science into solutions.</li>\n<li>Analyze data using statistical tools and behavioral frameworks</li>\n<li>Design and evaluate behavior change interventions, pilots, or randomized control trials (RCTs).</li>\n<li>Communicate research findings through presentations, reports, and storytelling.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Masters or Ph.D. in Behavioral Science, Psychology, Behavioral Economics, Cognitive Science, Sociology, or a related field.</li>\n<li>Proven experience applying behavioral science in real-world projects (industry, academic, or consultancy settings).</li>\n<li>Strong understanding of behavioral theories, models, and experimental design.</li>\n<li>Proficiency in tools such as SPSS, R, Python, or qualitative research platforms.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n<li>Ability to think critically, empathize with users, and simplify complex behaviors.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Experience working in [industry, e.g., digital health, fintech, public policy, etc.].</li>\n<li>Familiarity with human-centered design, design thinking, or service design.</li>\n<li>Published work or case studies in applied behavioral science.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Behavioral Science",
            "SPSS",
            "Python"
        ],
        "summary": "We need a Behavioral Scientist for research-driven interventions, applying behavioral science to solve complex challenges. You will design research, translate insights, and collaborate to drive measurable outcomes."
    },
    {
        "job_title": "Claims Handlers / Customer Service Executives",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23229",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Claims Handlers / Customer Service Executives</h2>\n<p><strong>Yarab Technologies (P) Ltd</strong>\nModule No: 2706, 7th Floor, Yamuna building,\nPhase-III Campus, Technopark, Kazhakootam , 695581\nhttp://www.yrtechnologies.co.in</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025\n<strong>Contact Email:</strong> jobs@yarabltd.co.uk</p>\n<p><strong>Brief Description:</strong>\nWe are looking for Claims Handlers / Customer Service Executives to join our dynamic team. The ideal candidate will handle customer queries, process claims, and ensure timely resolution while maintaining the highest standards of service. UK experience is highly desirable, and prior insurance industry experience is a strong advantage—but not mandatory. We also welcome freshers with excellent communication skills and a willingness to learn.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Handle inbound and outbound calls related to claims and customer service.</li>\n<li>Assist customers in reporting First Notification of Loss (FNOL) and gathering relevant information.</li>\n<li>Validate and process claims in line with company guidelines and compliance standards (FCA regulations).</li>\n<li>Communicate clearly and professionally with customers, service partners, and underwriters.</li>\n<li>Manage claim updates via email and phone, ensuring timely follow-ups.</li>\n<li>Maintain accurate records of all interactions in the system.</li>\n<li>Handle queries, complaints, and escalations effectively, ensuring fair outcomes.</li>\n</ul>\n<p><strong>Key Skills &amp; Competencies:</strong></p>\n<ul>\n<li>Excellent communication skills (verbal and written).</li>\n<li>Strong problem-solving abilities and attention to detail.</li>\n<li>Ability to remain calm under pressure and handle challenging conversations.</li>\n<li>Basic computer literacy and ability to work with CRM or ticketing systems.</li>\n<li>Team player with a customer-first attitude.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Previous experience in UK customer service or claims handling (highly desirable).</li>\n<li>Insurance experience will be an added advantage.</li>\n<li>Fresh graduates or candidates with no prior experience are encouraged to apply (full training provided).</li>\n</ul>",
        "tags": [
            "0+ Years",
            "Customer Service",
            "Claims Handling",
            "Communication Skills"
        ],
        "summary": "Yarab Technologies is seeking Claims Handlers/Customer Service Executives to manage customer queries and process claims. UK experience is desirable, and freshers with excellent communication skills are welcome."
    },
    {
        "job_title": "Full Stack Developer – Java | Spring Boot | React",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/23228",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Full Stack Developer – Java | Spring Boot | React</h2>\n<p>Valoriz Digital (P) Ltd is seeking a Full Stack Developer to design and build web-based software solutions.</p>\n<p><strong>Contact:</strong> archa.r@valoriz.com</p>\n<p><strong>Location:</strong> T5, 7th Floor, Thejaswini Building, Technopark, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.valoriz.com</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025</p>\n<p><strong>Job Published:</strong> 03, Sept 2025</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Full stack engineer to design and build Web based software solutions.</li>\n<li>Capable to learn, adaptable and can mentor on new technologies.</li>\n<li>Work with architects/product owners to develop technology solutions.</li>\n<li>Develop software applications leveraging state of the art web technologies and frameworks.</li>\n<li>Work with a high performing agile team using the latest tools for rapid development, continuous integration, and deployment.</li>\n<li>Ensure user experience, availability, scalability, responsiveness, and security software quality standards are achieved.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong in Web technologies (SpringBoot, ReactJS, HTML, CSS, MongoDB) with full stack development experience.</li>\n<li>Must have 2 + years of experience in software development. [ 2 Yrs in Springboot and React - Mandatory]</li>\n<li>Experience in software design and engineering of REST-based web services.</li>\n<li>Experience in Agile development methodologies.</li>\n<li>Experience working with source control like GIT and build tools like maven, gradle etc.</li>\n<li>Experience in the e-commerce/retail domain is an added advantage.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "SpringBoot",
            "ReactJS",
            "Agile"
        ],
        "summary": "Valoriz Digital is looking for a Full Stack Developer to create web solutions. The role requires experience with SpringBoot, React, and Agile methodologies."
    },
    {
        "job_title": "Sales Development Representative",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/23227",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Sales Development Representative</h2>\n<p><strong>Valoriz Digital (P) Ltd</strong>\nT5, 7th Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.valoriz.com\">http://www.valoriz.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025\n<strong>Contact Email:</strong> careers@valoriz.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Understand our service offerings, eCommerce solutions, and accelerator portfolio.</li>\n<li>Generate leads through inbound and outbound efforts—LinkedIn, emails, calls—and engage decision-makers (including C-level) across target organizations.</li>\n<li>Maintain active follow-up with leads to nurture relationships and build interest.</li>\n<li>Collaborate with senior leadership to refine sales strategies, build partnerships, and drive pipeline growth.</li>\n<li>Track performance via sales reports/dashboards and work toward achieving monthly/quarterly targets.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proven track record of success as an SDR, in a B2B technology firm.</li>\n<li>2 - 3 years of experience in selling enterprise solutions to CxOs/ Heads of Department.</li>\n<li>Prior experience in lead generation through cold/ warm calling in developed markets.</li>\n<li>Should have strong interpersonal and communication skills.</li>\n<li>A bonus would be previous tech industry experience or experience in sales development in digital commerce/ eCommerce space.</li>\n<li>Experience in identifying and nurturing partnership opportunities to support business growth.</li>\n<li>Strong track record in acquiring new clients and expanding business through strategic collaborations.</li>\n<li>Female candidates preferred.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "Lead Generation",
            "B2B Sales",
            "eCommerce"
        ],
        "summary": "Valoriz Digital is seeking a Sales Development Representative to generate leads and nurture client relationships. This role involves collaboration with leadership to drive sales strategies and pipeline growth."
    },
    {
        "job_title": "Telesales Executive( immediate)",
        "company": "Azinova Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/23226",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Telesales Executive (Immediate)</h2>\n<p><strong>Azinova Technologies (P) Ltd</strong>\nC-14b, Basement Floor 2, Thejaswini, Technopark, Trivandrum, 695581\nhttp://www.azinovatechnologies.com</p>\n<p><strong>Contact Email:</strong> careers@azinova.info</p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are looking for smart, energetic, and confident individuals with excellent English communication skills to join our telesales team. If you are passionate about interacting with people, building relationships, and kickstarting your career in sales, this is the right opportunity for you!</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Make outbound calls to potential customers and introduce company products/services.</li>\n<li>Communicate effectively in English and build rapport with prospects.</li>\n<li>Understand customer needs and provide the right solutions.</li>\n<li>Maintain accurate records of calls and customer details.</li>\n<li>Work towards achieving daily and monthly sales targets.</li>\n<li>Collaborate with the team to improve sales performance.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Freshers and recent graduates are welcome.</li>\n<li>Must have good spoken English skills (fluency, clarity, and confidence).</li>\n<li>Smart, positive, and eager to learn.</li>\n<li>Goal-oriented with strong interpersonal skills.</li>\n<li>Basic computer knowledge (MS Office/Excel) preferred.</li>\n</ul>",
        "tags": [
            "Entry Level",
            "Telesales",
            "Communication Skills",
            "MS Office"
        ],
        "summary": "Azinova Technologies is seeking a Telesales Executive to make outbound calls, build relationships, and achieve sales targets. Freshers with excellent English communication are encouraged to apply."
    },
    {
        "job_title": "Senior Digital Marketing Executive",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23225",
        "location": "Technopark",
        "closing_date": "18 Oct 2025",
        "job_description": "<h2>Senior Digital Marketing Executive</h2>\n<p><strong>ECS BUSINESS SOLUTIONS (P) Ltd</strong> is looking for a creative, data-driven, and globally oriented Senior Digital Marketing Executive for our digital initiatives across global markets including the US, UK, Europe, Middle East, and APAC. As a core member of our growth strategy, you will work closely with product, sales, and design teams.</p>\n<p><strong>Location:</strong> Trivandrum</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute integrated digital marketing plans aligned with company goals.</li>\n<li>Identify target segments in corporate/fintech verticals and tailor campaigns for maximum impact.</li>\n<li>Strategize and manage B2B marketing campaigns across SEO, SEM, email, display ads, and paid social.</li>\n<li>Create and optimize lead generation funnels, marketing automation workflows, and nurture sequences.</li>\n<li>Run performance campaigns across Google Ads, LinkedIn, and programmatic platforms to maximize lead quality and ROI.</li>\n<li>Optimize website UX, conversion paths, and ensure SEO best practices across content.</li>\n<li>Monitor and improve key metrics (CTR, CPC, MQLs, bounce rate, etc.) using Google Analytics, Search Console, and campaign dashboards.</li>\n<li>Collaborate with cross-functional teams to create high-impact digital content (blogs, whitepapers, case studies, videos, etc.).</li>\n<li>Manage and grow ECS Fin’s online presence on LinkedIn, Twitter, and other relevant channels.</li>\n<li>Track digital trends, markets, tools, and recommend improvements to stay ahead of the curve.</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>3–7 years of proven experience in digital marketing, preferably in B2B software, fintech, or enterprise solutions.</li>\n<li>Strong exposure to international markets (especially US, UK, Europe, UAE, Malaysia) and global campaign execution.</li>\n<li>Experience in corporate-level lead generation, not limited to local SEO or small business promotion.</li>\n<li>Demonstrated ability to design and execute digital strategies that impact the enterprise sales pipeline.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Solid grasp of SEO (technical + content), SEM/PPC, social media (especially LinkedIn for B2B), and display ads.</li>\n<li>Hands-on experience with tools such as Google Ads, LinkedIn Campaign Manager, HubSpot, Mailchimp, WordPress, and Google Analytics.</li>\n<li>Familiarity with marketing automation and CRM integration (HubSpot, Marketo, or similar).</li>\n<li>Content marketing capabilities – ability to drive messaging for fintech audiences through thought leadership content.</li>\n<li>Strong analytical mindset with ability to translate data into strategy and action.</li>\n<li>Proactive, collaborative, and comfortable taking initiative in a fast-moving environment.</li>\n<li>Strong written and verbal communication skills with a flair for positioning technical solutions for business stakeholders.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@ecsfin.com</p>\n<p><strong>Closing Date:</strong> 18, Oct 2025</p>",
        "tags": [
            "3-7 Years",
            "Digital Marketing",
            "SEO/SEM",
            "B2B Marketing"
        ],
        "summary": "ECS Fin seeks a Senior Digital Marketing Executive to drive global digital initiatives. Responsibilities include developing strategies, managing campaigns, and optimizing lead generation across various channels."
    },
    {
        "job_title": "Dot Net (Team Lead)",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/23224",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>.Net Team Lead</h2>\n<p><strong>Klystron Technologies</strong>\nOffice Nbr:2210, Yamuna Building.\nTechnopark Phase-III, 695583</p>\n<p><strong>Contact Email:</strong> Jobs.in@klystronglobal.com</p>\n<p><strong>About Us:</strong>\nKlystron Global is a leading provider of cutting-edge Digital Transformation solutions tailored to meet the evolving needs of businesses across various industries. With a focus on innovation and client satisfaction, we are committed to delivering exceptional technology solutions that empower organizations to thrive in the digital era.</p>\n<p><strong>Position Overview:</strong>\nWe are seeking an experienced and visionary Tech Lead to guide our team of dynamic developers of Self-Service Station Development Team. The Tech Lead will be responsible for the technical direction and successful delivery of our web applications, from architectural design to final deployment. This role involves hands-on development, team mentorship, and strategic planning, covering everything from back-end to client-side code using optimal and efficient technologies, frameworks, and patterns.</p>\n<p><strong>Roles &amp; Responsibilities:</strong></p>\n<ul>\n<li>Lead a development team in creating integrated ASP.NET applications, providing technical guidance and mentorship.</li>\n<li>Drive the architectural design and hands-on development of robust, scalable web-based services and applications.</li>\n<li>Establish and enforce coding guidelines for the ASP.NET development team.</li>\n<li>Perform rigorous code reviews to ensure quality and provide necessary corrections and feedback.</li>\n<li>Oversee the development of databases, including queries, triggers, and stored procedures.</li>\n<li>Collaborate with the quality assurance team to ensure the delivery of high-quality and reliable web applications.</li>\n<li>Interact with customers and internal stakeholders like Business Analysts to define project features and technical requirements.</li>\n<li>Research and develop prototypes for complex design challenges.</li>\n<li>Work collaboratively with the Project Manager to ensure the timely delivery of projects.</li>\n<li>Monitor application performance post-deployment and implement necessary enhancements.</li>\n<li>Resolve application defects and issues in a timely manner.</li>\n<li>Prepare and maintain comprehensive technical documentation as per project standards.</li>\n</ul>\n<p><strong>Preferred Skills, Education &amp; Experience:</strong></p>\n<ul>\n<li>Bachelor’s Degree in Computer Science, Information Technology, Software Engineering, or a similar field.</li>\n<li>5-7+ years of experience in software development, with significant experience in a lead role.</li>\n<li>Extensive experience with C#, ASP.NET, MVC, WPF, and WCF.</li>\n<li>Proven prior experience as a Developer is required.</li>\n<li>In-depth working knowledge of coding using .NET languages.</li>\n<li>Strong familiarity with the ASP.NET framework and SQL servers.</li>\n<li>Experience with the design and implementation of controls or data acquisition systems.</li>\n</ul>\n<p><strong>Preferred Knowledge &amp; Skills:</strong></p>\n<ul>\n<li>Excellent interpersonal, presentation, and leadership skills with demonstrated initiative.</li>\n<li>A keen eye for detail, with a focus on completeness and accuracy.</li>\n<li>Strong communication skills.</li>\n<li>A self-starter who can effectively balance priorities between multiple projects simultaneously.</li>\n<li>Demonstrated ability to meet project budgets and schedules.</li>\n<li>Ability to work effectively both as an individual contributor and as a collaborative member of a multi-disciplinary team.</li>\n<li>Willingness to travel up to 50% internationally or domestically.</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Competitive salary with performance-based incentives.</li>\n<li>Ongoing professional development opportunities.</li>\n<li>A collaborative and innovative work environment.</li>\n</ul>",
        "tags": [
            "5-7+ Years",
            "ASP.NET",
            "C#",
            "SQL Server"
        ],
        "summary": "Seeking a .Net Team Lead to guide a dynamic development team. The role involves architectural design, hands-on development, team mentorship, and strategic planning."
    },
    {
        "job_title": "IT Sales Executive",
        "company": "Resfeber Infosolutions (P) Ltd",
        "url": "https://technopark.org/job-details/23223",
        "location": "Technopark",
        "closing_date": "11 Oct 2025",
        "job_description": "<h2>IT Sales Executive</h2>\n<p><strong>Resfeber Infosolutions (P) Ltd</strong> is seeking a results-driven IT Sales Executive to drive new business and close deals. This role requires a sales-focused individual with the ability to convert leads into clients and present IT solutions that address business needs.</p>\n<p><strong>Location:</strong> Kerala, India\n<strong>Work Type:</strong> Full-Time</p>\n<p><strong>Contact:</strong> archana.ka@onetikk.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Prospect &amp; Generate Leads: Identify, qualify, and pursue new business opportunities through networking, cold outreach, and market research.</li>\n<li>Build Pipeline: Create and manage a strong sales funnel to ensure consistent deal flow.</li>\n<li>Engage Decision Makers: Establish relationships with CXOs, IT heads, and business leaders to position our solutions effectively.</li>\n<li>Pitch &amp; Present: Deliver compelling sales presentations, demos, and proposals that highlight business value.</li>\n<li>Negotiate &amp; Close: Take ownership of the full sales cycle—from first contact to negotiation and successful deal closure.</li>\n<li>Achieve Targets: Consistently meet or exceed monthly and quarterly revenue targets.</li>\n<li>Collaborate Internally: Work closely with the technical team to ensure accurate solution mapping during client discussions.</li>\n<li>Market Intelligence: Stay ahead of industry trends, competitor moves, and emerging technologies to sharpen the sales pitch.</li>\n<li>Customer Success Handoff: Ensure smooth transition to delivery/support teams post-sale, reinforcing long-term relationships.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business, IT, or related field (preferred).</li>\n<li>2–4 years of proven IT sales experience with a strong record of meeting or exceeding sales targets.</li>\n<li>Excellent persuasion, negotiation, and closing skills.</li>\n<li>Strong presentation and interpersonal abilities with executive-level stakeholders.</li>\n<li>Self-motivated, proactive, and able to work independently with minimal supervision.</li>\n<li>Familiarity with CRM tools and structured sales processes.</li>\n<li>Willingness to travel to meet clients and close deals.</li>\n</ul>\n<p><strong>Company Information:</strong></p>\n<p>Resfeber Infosolutions (P) Ltd\nC-DAC Building, 4th Floor,\nTechnopark Campus,\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.travelspoc.com\nCompany Website: https://www.onetikk.org</p>",
        "tags": [
            "2-4 Years",
            "IT Sales",
            "CRM",
            "Negotiation"
        ],
        "summary": "Resfeber Infosolutions is hiring an IT Sales Executive to identify leads, present solutions, and close deals. The role involves achieving sales targets and building client relationships."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/23222",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Odoo Developer</h2>\n<p><strong>Klystron Technologies</strong>\nOffice Nbr:2210, Yamuna Building.\nTechnopark Phase-III , 695583</p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025\n<strong>Contact Email:</strong> jobs.in@klystronglobal.com</p>\n<h3>About Us:</h3>\n<p>Klystron Global is a leading provider of cutting-edge Digital Transformation solutions tailored to meet the evolving needs of businesses across various industries. With a focus on innovation and client satisfaction, we are committed to delivering exceptional technology solutions that empower organizations to thrive in the digital era.</p>\n<h3>Position Overview:</h3>\n<p>We are seeking a dynamic and results-driven Odoo developer who will be able to develop and support existing applications. The main scope of work will include everything from back-end to client-side code, using optimal and efficient technologies, frameworks, and patterns. Your primary responsibilities will be to design and develop these applications.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Designing, reviewing, and testing code within the Odoo ecosystem.</li>\n<li>Designing and developing integrated Odoo applications using proper conventions and design standards.</li>\n<li>Analyzing, diagnosing, and resolving errors related to the applications.</li>\n<li>Developing solutions for clients from many different industries, sectors, and company sizes.</li>\n<li>Providing support for clients.</li>\n<li>Development and customizations to Odoo ERP modules.</li>\n</ul>\n<p><strong>Programming Languages:</strong> Python &amp; JavaScript\n<strong>Database:</strong> PostgreSQL (with object-relational mapping)\n<strong>Collaboration platform:</strong> GitHub</p>\n<h3>Preferred Skills &amp; Experience:</h3>\n<ul>\n<li>Bachelor’s Degree in Computer Science, Information Technology, Software Engineering, or similar.</li>\n<li>2 to 5 years of experience.</li>\n<li>Prior experience as a Python Developer.</li>\n<li>PostGreSQL database or relational database skills.</li>\n<li>A keen eye for detail.</li>\n<li>Strong communication skills.</li>\n</ul>\n<h3>Preferred Knowledge / Skills:</h3>\n<ul>\n<li>Framework: Odoo 11 and 14 (ORM, Workflows, Report Engine, BI, AI)</li>\n<li>Minimum 3 years of experience as Odoo Developer</li>\n<li>Object-oriented programming, object modeling, and relational database.</li>\n<li>Excellent interpersonal presentation and leadership skills, demonstrated initiative and attention to completeness, accuracy, and details.</li>\n<li>Must be a self – starter, able to balance priorities between multiple projects simultaneously.</li>\n<li>Demonstrated ability to meet budgets and schedules.</li>\n<li>Ability to work effectively and productively as an individual contributor and collaborate as part of a multi-disciplinary team.</li>\n<li>50% international or domestic travel.</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Competitive salary with performance-based incentives.</li>\n<li>Ongoing professional development opportunities.</li>\n<li>A collaborative and innovative work environment.</li>\n</ul>\n<p>If you are a motivated and experienced Odoo Developer, looking for a challenging opportunity to contribute to the success of a leading technology company, we invite you to apply.</p>",
        "tags": [
            "2-5 Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Klystron Technologies is looking for an Odoo developer to develop and support existing applications. Key responsibilities include designing, reviewing, and testing code within the Odoo ecosystem."
    },
    {
        "job_title": "Java Lead Software Engineer",
        "company": "Ospyn Technologies Ltd",
        "url": "https://technopark.org/job-details/23221",
        "location": "Technopark",
        "closing_date": "10 Sep 2025",
        "job_description": "<h2>Java Lead Software Engineer</h2>\n<p><strong>Ospyn Technologies Ltd</strong>\n1st Floor, Kabani Building,\nTechnopark Phase-4, Pallipuram,\nThiruvananthapuram, 695317\n<a href=\"http://www.ospyn.com\">http://www.ospyn.com</a></p>\n<p><strong>Closing Date:</strong> 10, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025\n<strong>Contact Email:</strong> careers@ospyn.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Hands-on experience in Java development.</li>\n<li>Should have sound experience in Java, Java EE, Hibernate.</li>\n<li>Good knowledge in Java frameworks including Spring Framework, Spring MVC, and Spring Boot.</li>\n<li>Experience in SQL, JDBC, and JPA.</li>\n<li>Knowledge in JavaScript, jQuery, and other front-end technologies like React.</li>\n<li>Experience working with APIs, specifically REST APIs, SDKs, and CLI tools.</li>\n<li>Knowledge of Document Management / Enterprise Content Management domain.</li>\n<li>Performing requirement analyses.</li>\n<li>Developing high-quality and detailed designs.</li>\n<li>Identifying risks and conducting mitigation action planning.</li>\n<li>Using coding standards and best practices to ensure quality.</li>\n<li>Reviewing the work of other developers and providing constructive feedback.</li>\n<li>Good team leader and should have exceptional communication skills.</li>\n<li>Coaches and mentors members of the team.</li>\n<li>Helps set strategic direction for the team.</li>\n<li>Knowledge of industry-wide technology trends and best practices.</li>\n<li>Ability to work in large distributed teams, conduct software analysis, develop technical designs, develop high-quality code, test, debug, write automated tests, deliver, and maintain highly scalable and distributed applications using Java &amp; J2EE.</li>\n</ul>\n<p><strong>Preferred Skills/Qualification:</strong></p>\n<ul>\n<li>B.Tech/BE/ME/MCA/M.Tech</li>\n<li><strong>Experience:</strong> 6 to 10 Years</li>\n<li><strong>Job Location:</strong> Trivandrum</li>\n<li><strong>DOJ:</strong> Immediate</li>\n</ul>",
        "tags": [
            "6-10 Years",
            "Java",
            "Spring Framework",
            "Hibernate"
        ],
        "summary": "Seeking a Java Lead Software Engineer with strong Java, Spring, and Hibernate experience. Responsibilities include development, team leadership, and contributing to application scalability."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23220",
        "location": "Technopark",
        "closing_date": "05 Sep 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\nwww.trainonexsolutions.in</p>\n<p><strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Closing Date:</strong> 05, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li><strong>Experience:</strong> 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Have fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Communication"
        ],
        "summary": "Join Trainonex Solutions as a Telesales Executive. This role involves phone sales, customer relationship management, and business development in office."
    },
    {
        "job_title": "React.JS Lead",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/23219",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>React.JS Lead</h2>\n<p><strong>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</strong> is seeking a highly skilled Senior React Lead with Project Management expertise to join our team at Technopark, Trivandrum.</p>\n<p><strong>Contact Information:</strong>\n*   Email: recruitment@ateamsoftsolutions.com\n*   Phone: +91 7907410058\n*   Address: Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus 695581, 695581</p>\n<p><strong>Key Details:</strong>\n*   Experience: 5+ Years\n*   Location: Technopark, Trivandrum\n*   Joining: Immediate Joiners Preferred\n*   Closing Date: 30, Sept 2025\n*   Job Published: 03, Sept 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead design, development &amp; deployment of complex web apps using React.js &amp; Next.js</li>\n<li>Provide technical leadership &amp; mentorship to front-end teams</li>\n<li>Drive project planning, execution &amp; delivery within timelines &amp; quality standards</li>\n<li>Collaborate with product owners, designers &amp; backend teams for seamless solutions</li>\n<li>Conduct code reviews &amp; enforce best practices</li>\n<li>Implement GraphQL, React Query &amp; WebSockets for real-time, scalable solutions</li>\n<li>Stay updated with the latest front-end technologies</li>\n</ul>\n<p><strong>Leadership &amp; PM Skills:</strong></p>\n<ul>\n<li>Proven project leadership &amp; team mentoring experience</li>\n<li>Strong communication &amp; problem-solving skills</li>\n<li>Familiarity with Agile methodologies (Scrum/Kanban)</li>\n</ul>\n<p><strong>Required Technical Skills:</strong></p>\n<ul>\n<li>Deep expertise in React.js &amp; Next.js (SSR, SSG, API routes)</li>\n<li>Strong in JavaScript (ES6+), HTML5, CSS3, Tailwind CSS</li>\n<li>Proficient in Redux / Zustand for state management</li>\n<li>Experience with GraphQL &amp; React Query</li>\n<li>Hands-on with WebSockets/real-time communication</li>\n<li>Solid knowledge of build tools (Webpack/Vite), Git workflow</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>TypeScript</li>\n<li>Testing Frameworks (Jest, Cypress)</li>\n<li>Cloud Platforms (AWS/Azure/GCP)</li>\n<li>GraphQL Subscriptions</li>\n</ul>",
        "tags": [
            "5+ Years",
            "React.js",
            "Next.js",
            "GraphQL"
        ],
        "summary": "Seeking a Senior React Lead to lead web app development using React.js and Next.js. The role involves technical leadership, project management, and collaboration within Agile methodologies."
    },
    {
        "job_title": "Comic Artist",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/23218",
        "location": "Technopark",
        "closing_date": "10 Sep 2025",
        "job_description": "<h2>Comic Artist</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong> is seeking a talented and passionate Comic Artist to join our creative team. The ideal candidate will have strong skills in visual storytelling and a deep understanding of comic book art techniques. Whether you specialize in penciling, inking, coloring, or lettering, you will be an integral part of bringing our narratives to life. The comic artist will work closely with writers, editors, and other team members to produce high-quality comic books, graphic novels, or web comics that captivate readers.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Penciling:</strong> Create dynamic, detailed, and expressive line drawings for comic pages, ensuring clear visual storytelling and effective panel composition.</li>\n<li><strong>Inking:</strong> Enhance penciled art with clean, precise lines, adding depth, contrast, and texture to the artwork.</li>\n<li><strong>Coloring:</strong> Apply colors to finished inked pages, maintaining consistency, mood, and tone that complements the story.</li>\n<li><strong>Lettering:</strong> Add dialogue, sound effects, and captions in a visually appealing way, ensuring readability and proper integration with the artwork.</li>\n<li><strong>Storytelling:</strong> Interpret the script and bring the story to life through artwork, ensuring proper pacing, character expressions, and action flow.</li>\n<li><strong>Collaboration:</strong> Work closely with writers, editors, and other team members to ensure the artwork matches the narrative vision and adheres to deadlines.</li>\n<li><strong>Revisions:</strong> Accept feedback and make necessary revisions to artwork to meet editorial or project requirements.</li>\n<li><strong>Meeting Deadlines:</strong> Manage time effectively to ensure the timely delivery of high-quality artwork according to project schedules.</li>\n<li><strong>Style Consistency:</strong> Maintain consistency in style, tone, and artistic quality throughout the project, including character designs, settings, and action sequences.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Proven experience as a comic artist, with a portfolio displaying previous comic book, graphic novel, or web comic work.</li>\n<li>5+ years of experience in comic art.</li>\n<li>Strong drawing and illustration skills.</li>\n<li>Proficiency in digital art tools (e.g., Photoshop, Clip Studio Paint, Procreate) or traditional media.</li>\n<li>Knowledge of comic book and print production processes (layouts, paneling, and composition).</li>\n<li>Understanding of comic book anatomy, perspective, and visual storytelling.</li>\n<li>Ability to work from scripts and adapt to a variety of art styles.</li>\n<li>Experience in lettering, coloring and inking is a plus.</li>\n<li>Experience with character design, environment design or world building.</li>\n<li>Experience with 2D modeling or digital sculpture.</li>\n<li>Strong attention to detail and the ability to manage multiple projects simultaneously.</li>\n</ul>\n<p><strong>Job Type:</strong> Full time</p>\n<p><strong>Schedule:</strong> Day shift</p>\n<p><strong>Location:</strong> Trivandrum, Kerala: Reliably commute or planning to relocate before starting work.</p>\n<p><strong>Education:</strong> Fine Art</p>\n<p><strong>Experience:</strong> 5+ Years</p>\n<p><strong>Expected Start Date:</strong> At the earliest.</p>\n<p><strong>To Apply:</strong></p>\n<p>Please submit your resume, and a link to your online portfolio highlighting your best work to jobs@prayananimation.com. Email Subject Line: Resume – “Comic Artist”</p>\n<p><strong>Contact Information</strong></p>\n<p>Prayan Animation Studio (P) Ltd\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala\nIndia, 695 581\nhttp://www.prayananimation.com\nContact Email: jobs@prayananimation.com</p>",
        "tags": [
            "5+ Years",
            "Comic Art",
            "Digital Art",
            "Visual Storytelling"
        ],
        "summary": "Prayan Animation Studio is hiring a Comic Artist to create high-quality comic books. The role involves visual storytelling, collaboration, and meeting deadlines while maintaining style consistency."
    },
    {
        "job_title": "Business Analyst",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23217",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p>KENLAND IT SOLUTIONS (P) Ltd is seeking a skilled and detail-oriented Business Analyst with a minimum of 3 years of experience in IT or software development environments.</p>\n<p><strong>Contact:</strong> recruiter@kenland.in</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Conduct requirement gathering sessions with clients and stakeholders via calls and meetings.</li>\n<li>Translate business needs into clear, concise, and detailed functional and non-functional requirements.</li>\n<li>Create use case diagrams, flowcharts, and wireframes (if applicable).</li>\n<li>Act as the liaison between the client and the technical team, ensuring clarity and consistency.</li>\n<li>Participate in daily stand-ups, sprint planning, and project status meetings.</li>\n<li>Assist in backlog grooming and creation of user stories in Agile environments.</li>\n<li>Ensure timely and accurate communication with internal teams and external stakeholders.</li>\n<li>Manage requirement changes using structured change control processes.</li>\n<li>Contribute to product vision, roadmap discussions, and process improvements.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>3+ years of experience as a Business Analyst in an IT or software development environment.</li>\n<li>Experience preparing comprehensive documentation (BRD, FRD, SRS).</li>\n<li>Proficient in tools like MS Office, Confluence.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong analytical thinking, attention to detail, and problem-solving capabilities.</li>\n<li>Experience in working with cross-functional teams and multiple stakeholders.</li>\n<li>Ability to manage multiple priorities in a fast-paced environment.</li>\n</ul>\n<p><strong>Address:</strong></p>\n<p>3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA , 695581\nhttps://www.kenland.in</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 03, Sept 2025</p>",
        "tags": [
            "3+ Years",
            "Business Analysis",
            "Requirements Gathering",
            "Agile"
        ],
        "summary": "Seeking a detail-oriented Business Analyst to gather requirements and facilitate communication between stakeholders and technical teams. The candidate will ensure project deliverables meet business needs."
    },
    {
        "job_title": "Business Development Executive(Software Sales Required)",
        "company": "Nirast Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23216",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>NIRAST Solutions (P) Ltd</strong>\nAmstor Building, Technopark Phase-1, Trivandrum, 695581\nhttp://www.nirasystems.com</p>\n<p><strong>Contact Email:</strong> careers@nirasystems.com</p>\n<p><strong>About the Role:</strong>\nWe are seeking a highly motivated and experienced Business Development Executive with a strong background in IT/Software Sales. The ideal candidate will have a proven track record in business development, lead generation, and client relationship management within the software and services industry.</p>\n<p>Only candidates with relevant experience in IT Sales/Software Sales are encouraged to apply.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage the complete sales cycle from lead generation to contract negotiation and closure.</li>\n<li>Generate leads through cold calling, email campaigns, LinkedIn networking, and online bidding platforms (Upwork, Fiverr, etc.).</li>\n<li>Conduct product demos and service presentations for prospective clients (online and offline).</li>\n<li>Negotiate terms, close deals, and ensure smooth client onboarding.</li>\n<li>Build and maintain strong client relationships to drive repeat and long-term business opportunities.</li>\n<li>Collaborate with internal teams to align proposals with project and client requirements.</li>\n<li>Research market trends, competitors, and opportunities for business growth.</li>\n<li>Maintain accurate records of client interactions, proposals, deals, and follow-ups.</li>\n<li>Manage and enhance company profiles on Upwork, Fiverr, LinkedIn Sales Navigator, and other relevant platforms.</li>\n<li>Communicate effectively with clients, including the ability to discuss requirements using technical terminologies.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li><strong>5+ years of proven experience in IT/Software Sales (mandatory).</strong></li>\n<li>Strong expertise in lead generation, negotiation, and deal closure.</li>\n<li>Proficiency in LinkedIn Sales Navigator, Upwork, Fiverr, and other online bidding platforms.</li>\n<li>Excellent communication skills (verbal &amp; written) with a strong command of English.</li>\n<li>Proficiency in MS Office.</li>\n<li>Knowledge of ChatGPT and AI tools is an added advantage.</li>\n<li>Strong networking, relationship-building, and presentation abilities.</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\nExperience in international business development is preferred.</p>",
        "tags": [
            "5+ Years",
            "Software Sales",
            "Lead Generation",
            "Client Relationship Management"
        ],
        "summary": "Seeking a Business Development Executive with 5+ years in IT/Software Sales. Responsibilities include lead generation, client relationship management, and closing deals within the software industry."
    },
    {
        "job_title": "L1 Network Technician",
        "company": "Iqmatrix Infoways Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23215",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>L1 Network Technician</h2>\n<p><strong>IQMATRIX INFOWAYS SOLUTIONS (P) Ltd</strong>\nGround Floor, Padmanabham Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.iqmatrix-solutions.com\">http://www.iqmatrix-solutions.com</a></p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 02, Sept 2025\n<strong>Contact Email:</strong> hradmin@iqmatrix-solutions.com</p>\n<p><strong>Brief Description</strong>\nOverall purpose of the job:\n- Dealing with broadband technical incidents and providing a high level of customer support and service.</p>\n<p><strong>Key Responsibilities</strong>\n- Troubleshooting xDSL incidents and achieving efficient resolution for our customers.\n- Driving fault resolution to ensure SLA’s are achieved.\n- Ensuring all incidents are handled effectively in accordance with our processes.\n- Configuring and testing routers and modems.\n- Driving resolution of escalated/aged incidents.\n- Handling customer queries and support issues using our ticketing system.\n- Maintaining professional working relationships with customers, suppliers, and work colleagues.\n- Performing other 1st line triage\n- Performing other duties as assigned.</p>\n<p><strong>Preferred Skills, Knowledge, and Experience</strong>\n- Excellent verbal and written communication skills.\n- Demonstrable understanding of xDSL / Broadband technologies and protocols.\n- Understanding of basic networking including IP, DHCP, DNS.\n- Experience with enterprise grade routers and/or modems.\n- Understanding of basic logging and alerting principles</p>\n<p><strong>Desirable Knowledge and Experience</strong>\n- Cisco CCNA or Juniper JNCIA certification.\n- Understanding of basic WiFi networking principles.\n- Experience working with cellular networks.</p>",
        "tags": [
            "1+ Years",
            "xDSL",
            "Networking",
            "Routers/Modems"
        ],
        "summary": "IQMATRIX is seeking an L1 Network Technician to troubleshoot xDSL incidents and provide customer support. The role involves configuring routers/modems and ensuring effective incident handling."
    },
    {
        "job_title": "AI/ML Engineer (min 2+ years of experience)",
        "company": "Storygame (P) Ltd",
        "url": "https://technopark.org/job-details/23214",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>AI/ML Engineer</h2>\n<p><strong>Storygame (P) Ltd</strong> is seeking a highly skilled and innovative AI/ML Engineer to join our team. This role requires deep experience in Large Language Models (LLMs), Generative AI, Retrieval-Augmented Generation (RAG), and multimodal AI involving audio and video processing. The ideal candidate will have hands-on experience building and integrating cutting-edge AI solutions, fine-tuning open-source and proprietary models, and deploying them into production environments.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and deploy solutions using LLMs (GPT, LLaMA, Mistral, Claude, etc.) for real-world applications.</li>\n<li>Implement and optimize RAG pipelines combining vector databases (e.g., Pinecone, Weaviate, FAISS) with LLMs.</li>\n<li>Fine-tune transformer-based models using Hugging Face, LoRA, QLoRA, PEFT, or similar frameworks.</li>\n<li>Work with generative AI models for text, image, audio, and video generation (e.g., Stable Diffusion, Whisper, AudioLM, DreamBooth, SDXL, etc.).</li>\n<li>Design and integrate multimodal systems that can process and generate content across different formats.</li>\n<li>Deploy models using ONNX, TorchServe, Triton, or custom APIs.</li>\n<li>Collaborate with DevOps and MLOps teams for model versioning, deployment, and monitoring.</li>\n<li>Research, prototype, and implement the latest advancements in generative AI and foundation models.</li>\n<li>Ensure ethical AI practices, model alignment, and bias mitigation.</li>\n<li>Optimize models for performance, latency, and resource efficiency.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Experience with AutoGPT, Agentic AI systems, or LangGraph.</li>\n<li>Knowledge of RLHF, alignment training, and custom dataset curation.</li>\n<li>Exposure to MLOps tools like MLflow, Weights &amp; Biases, or Kubeflow.</li>\n<li>Contribution to open-source AI projects or publications in relevant areas.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>3+ years of hands-on experience in AI/ML engineering.</li>\n<li>Proficient with Python, PyTorch, TensorFlow, and ML libraries (e.g., Hugging Face Transformers, LangChain, OpenAI, etc.).</li>\n<li>Strong understanding of LLMs, tokenization, attention mechanisms, and transformer architectures.</li>\n<li>Experience with fine-tuning, prompt engineering, and in-context learning.</li>\n<li>Knowledge of vector databases, embeddings, and RAG-based architectures.</li>\n<li>Familiarity with cloud platforms (AWS/GCP/Azure) and scalable AI infrastructure.</li>\n<li>Experience working with Docker, Kubernetes, and GPU optimization.</li>\n<li>Solid grasp of audio and video processing models.</li>\n<li>Passion for innovation and staying updated with the latest research and trends.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: jincy.storygame@gmail.com</li>\n<li>Address: Ground floor, Tejaswini building, Technopark Phase 1 Kazakootam trivandrum kerala , 695581</li>\n<li>Website: https://storygame.io</li>\n</ul>\n<p><strong>Closing Date:</strong> 04, Sept 2025\n<strong>Job Published:</strong> 02, Sept 2025</p>",
        "tags": [
            "3+ Years",
            "LLMs",
            "Generative AI",
            "Python"
        ],
        "summary": "Storygame is looking for an AI/ML Engineer to develop AI solutions using LLMs and Generative AI. The role involves fine-tuning models and deploying them into production."
    },
    {
        "job_title": "TECHNICAL SALES SPECIALIST (Hindi Speaking Preferred)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23213",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Technical Sales Specialist</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong> is seeking a Technical Sales Specialist to drive sales and marketing initiatives for our Hospital Management Software (HMS) solutions. This role is crucial for expanding our reach across the healthcare domain. The ideal candidate will possess strong presentation skills, the ability to drive revenue growth, and fluency in Hindi to effectively communicate with a broad client base.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute a strategic sales plan to meet company targets and accelerate business growth in the healthcare software sector.</li>\n<li>Identify and engage with new prospects including hospitals, clinics, diagnostic centers, and healthcare networks.</li>\n<li>Maintain and deepen relationships with key clients by understanding their operational needs and offering tailored HMS solutions.</li>\n<li>Design and manage integrated marketing campaigns in line with the company’s GTM strategy.</li>\n<li>Conduct regular market research and competitor analysis to ensure strategic positioning and adapt to healthcare market needs.</li>\n<li>Create compelling marketing content including brochures, case studies, and presentations, maintaining brand consistency.</li>\n<li>Collaborate with internal teams (product, sales, and support) to align messaging and improve customer engagement.</li>\n<li>Analyze campaign performance, ROI, and make data-driven decisions to improve effectiveness.</li>\n<li>Stay updated on healthcare trends, software innovations, and regulatory guidelines affecting hospital IT systems.</li>\n<li>Represent the company at industry events, conferences, and webinars to strengthen brand visibility.</li>\n</ul>\n<p><strong>Required Qualifications &amp; Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Healthcare IT, or related field (MBA preferred).</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li>Fluent in Hindi and English – must be able to communicate confidently with clients in Hindi-speaking regions.</li>\n<li>Familiarity with Hospital Management Systems (HMS), EMR/EHR solutions, or healthcare IT workflows is a strong advantage.</li>\n<li>Ability to create effective marketing materials and sales presentations.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Self-driven, target-oriented</li>\n<li>Capable of working independently.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Experience in handling client demos and product presentations.</li>\n<li>Ability to travel as needed for client meetings, demos, and events.</li>\n</ul>\n<p><strong>Salary Package:</strong> 6-12 LPA</p>\n<p><strong>Contact Information:</strong> careers@shmsolutions.in</p>\n<p><strong>Closing Date:</strong> 17, Oct 2025</p>",
        "tags": [
            "0-5 Years",
            "Sales",
            "Marketing",
            "Hospital Management Systems"
        ],
        "summary": "We seek a Technical Sales Specialist to promote our Hospital Management Software, focusing on growing our healthcare market reach. The role requires strong presentation skills and fluency in Hindi and English."
    },
    {
        "job_title": "SOFTWARE TESTING - FRESHERS/2024/2025 PASSOUTS",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23211",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Software Testing - Freshers/2024/2025 Passouts</h2>\n<p>SMARTHMS &amp; SOLUTIONS (P) Ltd is seeking a highly motivated and passionate individual to join our team as a Test and Implementation Engineer. This position is perfect for a graduate who is passionate with a strong desire to learn and grow in the field.</p>\n<p><strong>Job Responsibilities:</strong></p>\n<ul>\n<li>Configure, implement, and demonstrate software products.</li>\n<li>Oversee projects with specific development requirements, internal testing, and guiding clients through user acceptance to go-live status.</li>\n<li>Develop and deliver training for both administrators and end-users.</li>\n<li>Document all customer interactions in designated CRM, and provide excellent customer experiences.</li>\n<li>Guide and drive the client towards the best solution for their business needs.</li>\n<li>Analyze existing systems, interface requirements, business processes.</li>\n<li>Partner with clients to understand their business and related needs.</li>\n<li>Perform testing and provide final QA/QC before client is ready to go live.</li>\n<li>Test all aspects of the product/system like function/component, system, performance, regression and service.</li>\n<li>Work with the development team to identify and capture test cases.</li>\n<li>Ensure version management setting up of test environments, designing test plans, developing test cases/scenarios/usage cases, and executing these cases.</li>\n<li>Provide feedback on usability and serviceability, trace the result to quality risk and report it to concerned people.</li>\n<li>Good Communication Skill, able to articulate and a command on English.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience required: 0 to 1 year</li>\n<li>Salary: 2.5 lakh to 4 lakh per annum</li>\n</ul>\n<p><strong>Contact:</strong>\nKindly share your resume to careers@shmsolutions.in</p>\n<p><strong>Address:</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building Technopark Phase 1, 695581\nhttps://shmsolutions.in</p>",
        "tags": [
            "0-1 Year",
            "Software Testing",
            "Test Cases",
            "QA/QC"
        ],
        "summary": "SMARTHMS & SOLUTIONS is looking for a motivated Test and Implementation Engineer to configure, test, and implement software products. This role involves testing, training, and ensuring quality before go-live."
    },
    {
        "job_title": "Apprenticeship at Electronics Technology Parks-Kerala (Technopark)",
        "company": "Electronics Technology Parks Kerala (Technopark)",
        "url": "https://technopark.org/job-details/23210",
        "location": "Technopark",
        "closing_date": "08 Sep 2025",
        "job_description": "<h2>Apprenticeship Opportunity at Electronics Technology Parks Kerala (Technopark)</h2>\n<p><strong>Electronics Technology Parks Kerala (Technopark)</strong> is seeking talented and driven graduates for paid apprenticeships at Park Centre, Technopark.</p>\n<p><strong>Brief Description:</strong></p>\n<p>Grab this opportunity to gain hands-on experience in Electronics and Communication. The contract will last for 1 year.</p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Diploma in Electronics and Communication, Electrical and Electronics, Electronics &amp; Instrumentation, and Applied Electronics (pass out from 2021 onwards).</li>\n<li>Ability to communicate clearly and consistently, and a natural interest in working with people are required for the position.</li>\n<li>Ability to work in a fast-paced and dynamic environment.</li>\n</ul>\n<p><strong>Duties and Responsibilities:</strong></p>\n<ul>\n<li>Monitor and operate the CCTV surveillance system from the Control Room on a continuous basis.</li>\n<li>Perform live monitoring of all access points, perimeters, and critical areas within the Technopark campus to ensure security and safety.</li>\n<li>Log and report any suspicious activity, unauthorized access, or system anomalies to the concerned authority immediately.</li>\n<li>Register and respond to grievances and complaints received in the Control Room; coordinate follow-up actions as necessary.</li>\n<li>Maintain clear and accurate records of incidents, system faults, or maintenance needs in the Control Room logbook.</li>\n<li>Assist AMC technicians or authorized service personnel with on-ground support, system checks, or troubleshooting as required.</li>\n<li>Ensure proper functioning of all surveillance equipment and report any technical issues or malfunctions without delay.</li>\n<li>Adhere to Standard Operating Procedures (SOPs) and always maintain confidentiality and data security.</li>\n<li>Maintain cleanliness and operational readiness of the Control Room environment.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p>Operators will work in rotating 8-hour shifts as follows:</p>\n<ul>\n<li>Morning Shift: 6:00 AM to 2:00 PM</li>\n<li>Afternoon Shift: 2:00 PM to 10:00 PM</li>\n<li>Night Shift: 10:00 PM to 6:00 AM</li>\n</ul>\n<p><strong>Stipend:</strong> Rs.12,000/month.</p>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates may send your resumes to apprenticeship@technopark.in with “Application for Technician Apprentice – Control Room” as subject. Also, please make sure you attach the scanned copies of your certificates along with your resume. Last date to apply is 08.09.2025</p>\n<p><strong>Note:</strong> The vacancies notified here are subjected to change without assigning any reason and Technopark reserves the right, to change, modify, add or cancel the recruitment process if required.</p>\n<p><strong>Contact Information:</strong></p>\n<p>Electronics Technology Parks Kerala (Technopark)\nPark Centre,\nTechnopark Campus,\nTrivandrum, 695581\nhttps://technopark.in\nContact Email: apprenticeship@technopark.in</p>",
        "tags": [
            "No Experience",
            "CCTV",
            "Electronics",
            "Communication"
        ],
        "summary": "Technopark is offering paid apprenticeship for talented graduates to gain hands-on experience in Electronics and Communication. The selected apprentice will monitor CCTV and report suspicious activities."
    },
    {
        "job_title": "Golang Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23209",
        "location": "Technopark",
        "closing_date": "25 Sep 2025",
        "job_description": "<h2>Golang Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years.</p>\n<p>We offer expertise and consultation in multiple technology domains including Golang, and are seeking an experienced Team Lead specializing in GoLang to join our team.</p>\n<p><strong>Closing Date:</strong> 25, Sept 2025\n<strong>Job Published:</strong> 02, Sept 2025\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead and mentor a team of engineers, providing guidance on design, coding, and troubleshooting.</li>\n<li>Architect highly scalable and highly available systems with minimal guidance.</li>\n<li>Translate business requirements into scalable and extensible designs.</li>\n<li>Work closely with team members to deliver complete solutions to customers.</li>\n<li>Communicate effectively with clients to gather requirements, provide updates, and ensure their needs are met.</li>\n<li>Participate in all phases of the agile development cycle, including planning, design, implementation, review, testing, deployment, documentation, and training.</li>\n<li>Troubleshoot and resolve customer issues promptly and effectively.</li>\n<li>Advocate for and practice Agile methodologies within the team.</li>\n<li>Strive for continuous improvement in development processes and team productivity.</li>\n<li>Implement and maintain APIs using REST, GraphQL, and gRPC.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>6+ years of web development experience, with at least 2+ years of proven proficiency in Go programming.</li>\n<li>Deep understanding of RDBMS and NoSQL databases.</li>\n<li>Experience implementing AWS services, including containerization to support Go applications and repository maintenance.</li>\n<li>Proficiency with Kubernetes for application development, deployment, and scaling.</li>\n<li>Strong knowledge of RESTful APIs, GraphQL, and an understanding of the differences between REST, GraphQL, and gRPC.</li>\n<li>Knowledge of additional web technologies such as Python or PHP is a plus.</li>\n<li>Strong time management and organizational skills.</li>\n<li>Knowledge of Go templating, common frameworks, and tools.</li>\n<li>Ability to instill and enforce best practices in web development within the team.</li>\n<li>Strong design skills, with an understanding of design and architectural patterns.</li>\n<li>Excellent understanding of data structures and algorithms.</li>\n<li>A sense of urgency and ownership over the product, with a proactive approach to work.</li>\n<li>Great attitude towards work and people, fostering a positive team environment.</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>Ability to thrive in a fast-paced service environment.</li>\n<li>Experience in technical mentorship or coaching is highly desirable.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Experience working in an Agile development environment is a plus.</li>\n<li>Knowledge of front-end development technologies such as HTML, CSS, and JavaScript.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Contact Information:</strong>\nTechversant Infotech (P) Ltd\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "6+ Years",
            "Golang",
            "RESTful APIs",
            "Kubernetes"
        ],
        "summary": "Techversant Infotech is looking for a Golang Team Lead to guide a team in developing scalable applications. The candidate will design solutions, mentor engineers, and ensure customer needs are met."
    },
    {
        "job_title": "Java Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23207",
        "location": "Technopark",
        "closing_date": "25 Sep 2025",
        "job_description": "<h2>Java Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Java Team Lead to manage our Java development team and ensure the successful design, development, and maintenance of Java-based software solutions.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company with over 16 years of experience providing high-quality end-to-end IT Solutions and Services to clients worldwide. We offer expertise in Digital Transformation and various technologies, including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, and Business Intelligence.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Leading and managing the Java development team.</li>\n<li>Designing, developing, and delivering large-scale Web Applications.</li>\n<li>Applying code optimization techniques and coding best practices.</li>\n<li>Utilizing static code analysis tools.</li>\n<li>Understanding complex business requirements.</li>\n<li>Independently solving problems and creating solutions.</li>\n<li>Addressing systems integration, compatibility, and multiple platform issues.</li>\n<li>Communicating with clients to understand technical requirements and presenting technical solutions and system designs.</li>\n<li>Analyzing business requirements, preparing work breakdown structures, and providing technical estimates.</li>\n<li>Providing visibility and updates on the progress of all activities and tasks, escalating issues in a timely manner.</li>\n<li>Maintaining a cohesive team spirit.</li>\n<li>Serving as a lead contributor on assigned projects.</li>\n<li>Instructing, assigning, directing, and checking the work of other software developers.</li>\n<li>Conducting peer reviews on code quality.</li>\n<li>Ensuring Information Security in all perspectives.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>6+ years of Work experience as a Senior Java Developer and 2 years in Lead Role.</li>\n<li>In-depth knowledge of popular Java frameworks and Spring frameworks (Core/MVC/Spring Boot etc.).</li>\n<li>Proficient knowledge and experience in Webservices (REST/SOAP).</li>\n<li>Strong knowledge in writing stored procedures and SQL queries.</li>\n<li>Experience in modeling databases based on various business requirements.</li>\n<li>Strong knowledge in Data Analysis.</li>\n<li>Proficiency in Angular or similar frontend frameworks is desirable.</li>\n<li>Working experience with GIT and Artefactory.</li>\n<li>Good knowledge of DevOps, Test Driven Development and CI/CD pipelines is desirable.</li>\n<li>Deployment to Cloud Services.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule with weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs.</li>\n<li>Work-life Balance with flexible work timings, early out Fridays, and various social and cultural activities.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>",
        "tags": [
            "6+ Years",
            "Java",
            "Spring Framework",
            "Webservices"
        ],
        "summary": "Techversant Infotech is looking for a Java Team Lead to lead Java development, design solutions, and ensure code quality. The role requires strong Java skills, leadership abilities, and experience with web services."
    },
    {
        "job_title": "Angular Developer",
        "company": "Faya Innovations",
        "url": "https://technopark.org/job-details/23206",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>Angular Developer</h2>\n<p><strong>FAYA INNOVATIONS</strong> is looking for an Angular Developer to be responsible for the client side of our service. The primary focus will be to implement a complete user interface in the form of a mobile and desktop web app, with a focus on performance. </p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Delivering a complete front-end application.</li>\n<li>Ensuring high performance on mobile and desktop.</li>\n<li>Writing tested, idiomatic, and documented JavaScript, HTML, and CSS.</li>\n<li>Coordinating the workflow between the graphic designer, the HTML coder, and yourself.</li>\n<li>Cooperating with the back-end developer in the process of building the RESTful API.</li>\n<li>Communicating with external web services.</li>\n<li>Creating modules and components and coupling them together into a functional app.</li>\n</ul>\n<p><strong>Qualifications and Requirements:</strong></p>\n<ul>\n<li>Proficiency with JavaScript, Typescript, and HTML5.</li>\n<li>Professional, precise communication skills.</li>\n<li>Deep knowledge of Angular practices and commonly used modules based on extensive work experience.</li>\n<li>Creating self-contained, reusable, and testable modules and components.</li>\n<li>Ensuring a clear dependency chain, in regard to the app logic as well as the file system.</li>\n<li>Ability to provide SEO solutions for single-page apps.</li>\n<li>Validating user actions on the client-side and providing responsive feedback.</li>\n<li>Writing non-blocking code, and resorting to advanced techniques such as multi-threading, when needed.</li>\n<li>Creating custom, general use modules, and components that extend the elements and modules of the core Angular app.</li>\n<li>Experience with building the infrastructure for serving the front-end app and assets.</li>\n<li>Architecting and automating the build process for production, using task runners or scripts.</li>\n<li>Creating e2e test suites for all components, and running them with Protractor (or a well-reasoned alternative).</li>\n<li>1-4 Years of experience in Angular alone is a must.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>Autonomy &amp; Impact – Own your work, drive innovation, and see your solutions in action.</li>\n<li>Growth &amp; Mentorship – Be part of an elite team that values continuous learning.</li>\n<li>Stability &amp; Culture – A performance-driven, transparent, and innovation-friendly environment.</li>\n<li>Health Benefits – Family medical insurance with up to ₹2L coverage.</li>\n<li>Brilliance deserves to be well compensated.</li>\n</ul>\n<p><strong>Location:</strong> Technopark phase I, Thiruvananthapuram, Kerala 695581</p>\n<p><strong>Working:</strong> 5 days a week.</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: hr.india@fayausa.com</li>\n<li>Website: http://www.fayausa.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 17, Oct 2025\n<strong>Job Published:</strong> 02, Sept 2025</p>",
        "tags": [
            "1-4 Years",
            "Angular",
            "JavaScript",
            "Typescript"
        ],
        "summary": "Faya Innovations is seeking an Angular Developer to implement user interfaces for web and mobile apps. The role involves front-end development, ensuring performance, and collaborating with back-end developers."
    },
    {
        "job_title": ".Net Developer, SSE, TL, Architect, PM",
        "company": "Ars Traffic & Transport Technology India (P) Ltd",
        "url": "https://technopark.org/job-details/23203",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>.Net Developer, SSE, TL, Architect, PM</h2>\n<p><strong>ARS Traffic &amp; Transport Technology India (P) Ltd</strong>\n131-135, First Floor, Nila Building\nTechnopark Campus\nThiruvananthapuram , 695581\n<a href=\"http://www.ars-traffic.com\">http://www.ars-traffic.com</a></p>\n<p><strong>Contact Email:</strong> ankitac@arstraffc.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>3+ years of development experience using C# .NET.</li>\n<li>Technical hands-on experience in .NET Core (nice to have), MVC and Web APIs/Microservices design patterns.</li>\n<li>Knowledge of Entity Framework and ADO.NET.</li>\n<li>Familiarity with REST architecture styles/APIs.</li>\n<li>Knowledge in HTML5/CSS3 and JavaScript.</li>\n<li>At least 2 years Hands-on Experience in jQuery and Team leading.</li>\n<li>Proficient understanding of code versioning tools such as Git.</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\nPlease share the details below:</p>\n<ul>\n<li>Total Experience</li>\n<li>CTC</li>\n<li>ECTC</li>\n<li>Notice Period</li>\n<li>Reason for change</li>\n<li>Current location</li>\n<li>Preferred location</li>\n</ul>\n<p><strong>Regards,</strong>\nAnkita\n<a href=\"https://www.linkedin.com/in/ankita-chourasia-1266a86b/\">https://www.linkedin.com/in/ankita-chourasia-1266a86b/</a></p>\n<p><strong>Closing Date:</strong> 12, Oct 2025\n<strong>Job Published:</strong> 02, Sept 2025</p>",
        "tags": [
            "3+ Years",
            ".NET",
            "C#",
            "Web APIs"
        ],
        "summary": "Seeking a .Net Developer with 3+ years of experience. The role requires proficiency in C#, .NET, MVC, Web APIs, and microservices."
    },
    {
        "job_title": "Business Analyst",
        "company": "Ars Traffic & Transport Technology India (P) Ltd",
        "url": "https://technopark.org/job-details/23202",
        "location": "Technopark",
        "closing_date": "12 Oct 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p><strong>ARS Traffic &amp; Transport Technology India (P) Ltd</strong></p>\n<p>131-135, First Floor, Nila Building\nTechnopark Campus\nThiruvananthapuram, 695581\n<a href=\"http://www.ars-traffic.com\">http://www.ars-traffic.com</a></p>\n<p><strong>Contact Email:</strong> ankitac@arstraffic.com</p>\n<p><strong>Location:</strong> Trivandrum\n<strong>Job Type:</strong> Full time\n<strong>Experience Level:</strong> 4 +</p>\n<p><strong>Closing Date:</strong> 12, Oct 2025\n<strong>Job Published:</strong> 02, Sept 2025</p>\n<h3>About the Role:</h3>\n<p>We are seeking a highly motivated and detail-oriented Business Analyst to join our team. In this role, you will bridge the gap between business needs and technology solutions, using data-driven insights to identify problems, propose solutions, and drive strategic decision-making.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Exhibited good requirement gathering and analytical skills to understand complex project requirements and further documenting those as Use Cases, SRS, BRD etc.</li>\n<li>Collaborate with business, product and technology teams to develop the software solutions required by the clients</li>\n<li>Excellent communication and inter-personal skills with good verbal and written English language proficiency</li>\n<li>Should have worked extensively with international clients</li>\n<li>Deep dive and acquire an extensive knowledge of emerging industry practices and apply when solving business problems</li>\n<li>Understand RFP requirements and provide optimum business solutions</li>\n<li>Knowledge of development life cycle, concepts and practices, draft proposal responses</li>\n<li>Preferred to have a technical background, but not mandatory</li>\n</ul>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Collaborate with stakeholders to understand business objectives, processes, and requirements</li>\n<li>Gather, document, and analyze functional and non-functional requirements</li>\n<li>Translate business needs into clear specifications for technical teams</li>\n<li>Conduct data analysis and interpret trends to support business decisions</li>\n<li>Facilitate workshops, meetings, and presentations to communicate insights and recommendations</li>\n<li>Create user stories, process flows, and wireframes as needed</li>\n<li>Support project management teams in scope definition, risk analysis, and solution evaluation</li>\n<li>Ensure solutions meet business needs and requirements through rigorous testing and validation</li>\n<li>Assist in the development of training materials and user documentation</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, or related field.</li>\n<li>Certification in Business Analysis (e.g., CBAP, CCBA, PMI-PBA) is a plus</li>\n</ul>\n<h3>Skills and Abilities:</h3>\n<ul>\n<li>Strong leadership and team management skills with a focus on traffic management requirements.</li>\n<li>Excellent problem-solving and decision-making abilities.</li>\n<li>Effective communication and interpersonal skills with traffic management authorities and internal teams.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p>Please share the details below.\nTotal Experience\nCTCECTC\nNotice\nReason for change\nCurrent location\nPreferred location</p>",
        "tags": [
            "4+ Years",
            "Requirement Gathering",
            "Data Analysis",
            "Stakeholder Collaboration"
        ],
        "summary": "Seeking a Business Analyst to bridge business needs and tech solutions using data-driven insights. This role involves requirement gathering, stakeholder collaboration, and support for project management."
    },
    {
        "job_title": "Business Analyst - COBOL Modernization",
        "company": "Macrosoft It Solutions India Pvt. Ltd",
        "url": "https://technopark.org/job-details/23201",
        "location": "Technopark",
        "closing_date": "01 Oct 2025",
        "job_description": "<h2>Business Analyst - COBOL Modernization</h2>\n<p><strong>Macrosoft IT Solutions India Pvt. Ltd.</strong> is seeking an expert Business Analyst to play a pivotal role in Migrating Legacy CCM.</p>\n<p><strong>Location:</strong> Technopark, Trivandrum (Option to Work From Home)</p>\n<p><strong>Contact:</strong> jobs@macrosoftindia.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Translate Code into Business Requirements: Perform functional decomposition of COBOL programs, JCL, and Unix scripts. Trace data flows and process logic to meticulously document the \"what\" and \"why\".</li>\n<li>Author the Blueprint for Modernization: Create detailed Business Requirement Documents (BRDs) and Functional Specification Documents (FSDs). Include process flows, explicit business rules, data mappings, and use cases.</li>\n</ul>\n<p><strong>Required Skills and Experience:</strong></p>\n<ul>\n<li>Proven Business Analyst Experience: Minimum 5+ years of experience as a Business Analyst, with a proven track record of creating comprehensive BRDs and Functional Specifications.</li>\n<li>COBOL Documentation Expertise: Must have significant, hands-on experience (at least 2+ years) analyzing, understanding, and formally documenting the business logic contained within COBOL programs, JCL, and related mainframe assets.</li>\n<li>Demonstrated Documentation Mastery: A portfolio or ability to discuss in detail past projects where you created BRDs/FSDs from scratch by reverse-engineering legacy code.</li>\n<li>Technical Acumen: Strong ability to read and interpret COBOL and JCL. Solid understanding of UNIX environment</li>\n<li>Exceptional Communication Skills: Ability to translate complex technical details from source code into clear, unambiguous business and functional requirements for non-technical stakeholders.</li>\n<li>Education: A Bachelor's degree in Computer Science, Information Systems, or a related field.</li>\n</ul>\n<p><strong>Closing Date:</strong> 01, Oct 2025</p>",
        "tags": [
            "5+ Years",
            "COBOL",
            "Business Requirements Documents",
            "Functional Specifications"
        ],
        "summary": "Macrosoft IT Solutions is looking for a Business Analyst to help with migrating Legacy CCM. The role involves translating COBOL code into business requirements and authoring modernization blueprints."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/23200",
        "location": "Technopark",
        "closing_date": "07 Sep 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Picky Assist Pvt Ltd (Kerala Startup Mission)</strong></p>\n<p><strong>Location:</strong> T-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<strong>Website:</strong> <a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<p><strong>Contact:</strong> careers@pickyassist.com</p>\n<p><strong>Job Details:</strong></p>\n<ul>\n<li><strong>Job Published:</strong> 01, Sept 2025</li>\n<li><strong>Closing Date:</strong> 07, Sept 2025</li>\n<li><strong>Job Type:</strong> Full Time - On-Site</li>\n<li><strong>Number of Vacancies:</strong> 5</li>\n<li><strong>Location Preference:</strong> Candidates based in Trivandrum or willing to relocate.</li>\n</ul>\n<p><strong>Salary:</strong></p>\n<ul>\n<li>₹20,000/month (Basic Salary + Incentive) for MBA graduates of 2024 and 2025 (awaiting results, no backlogs).</li>\n<li>Salary based on experience and interview performance for candidates with a minimum of 1 year of sales experience (MBA not mandatory).</li>\n</ul>\n<p><strong>Responsibilities and Duties:</strong></p>\n<ul>\n<li>Dealing with clients worldwide.</li>\n<li>Generating new prospective leads from various sources (small shops to big MNCs).</li>\n<li>Fixing appointments (online meetings).</li>\n<li>Preparing customized presentations (solutions).</li>\n<li>Giving demos (Google Meet, Zoom).</li>\n<li>Participating in seminars &amp; exhibitions (networking).</li>\n<li>Closing sales &amp; generating revenue (numbers matter).</li>\n<li>Following up with customers (never quit).</li>\n<li>Providing first-level training (after sales).</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Understanding of how technology works in a business.</li>\n<li>Must have completed MBA (BBA/B Tech with MBA candidates can also apply).</li>\n<li>Good Communication Skills (Fluency in English Mandatory).</li>\n<li>Preference to candidates knowing any international languages.</li>\n<li>Ability to convince No to Yes.</li>\n<li>Preference to candidates with a minimum of 1 year of experience in sales.</li>\n<li>Freshers with a Go-Getting Attitude can also apply.</li>\n<li>Willingness to learn every day.</li>\n<li>Fluency in English and the Local Language</li>\n<li>Candidates who can communicate in any foreign language are preferred</li>\n<li>Linguistic Skills</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<p>A positive working environment with personal and professional growth opportunities, a future-proof job, annual salary increments based on performance, and numerous opportunities for career progression.</p>\n<p><strong>How to Apply:</strong></p>\n<p>Send your CV to careers@pickyassist.com or WhatsApp <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></p>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Mobile &amp; Data Allowance</li>\n<li>Sales Incentive based on performance</li>\n<li>Flexible Shift Timings</li>\n</ul>\n<p><strong>Work Timings, Job Location &amp; Salary</strong></p>\n<ul>\n<li>10 am to 06 pm Monday to Saturday</li>\n<li>Office Location: Edapazhanji, Trivandrum</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Sales",
            "Business Development",
            "Communication Skills"
        ],
        "summary": "Seeking a Business Development Executive to manage clients, generate leads, and close sales. Requires strong communication skills and a background in sales or an MBA."
    },
    {
        "job_title": "Virtual Preview Designer",
        "company": "Faya Innovations",
        "url": "https://technopark.org/job-details/23198",
        "location": "Technopark",
        "closing_date": "16 Oct 2025",
        "job_description": "<h2>Virtual Preview Designer</h2>\n<p>FAYA INNOVATIONS is seeking a Virtual Preview Designer to create compelling and realistic virtual previews of logos on apparel and caps. The ideal candidate will possess a strong sense of color theory and design principles, expertise in industry-standard design software, and a passion for creating impactful designs.</p>\n<p><strong>Primary Responsibilities:</strong></p>\n<ul>\n<li><strong>Logo Editing &amp; Customization:</strong> Edit logos as per customer requirements, ensuring high-quality, precise, and accurate results.</li>\n<li><strong>Virtual Previews Creation:</strong> Create compelling and realistic virtual previews of logos on apparel and caps, using multiple angles and showcasing products in the most engaging way.</li>\n<li><strong>Design Execution:</strong> Bring creative concepts to life and provide polished, professional designs that match customer specifications. Collaborate with the team to meet design objectives.</li>\n<li><strong>Digitizing Support:</strong> Demonstrate a willingness to learn digitizing techniques and support digitizing works for embroidered designs.</li>\n<li><strong>Order Follow-Through:</strong> Ensure designs meet the order’s requirements by following up with CSRs from initiation through to final delivery. Actively track progress to guarantee the fulfillment of objectives.</li>\n<li><strong>Collaborative Teamwork:</strong> Work efficiently within a team and share knowledge while maintaining a self-motivated approach to tasks. Be proactive in identifying issues and solutions.</li>\n<li><strong>Problem Solving:</strong> Display strong problem-solving ability to address design issues and improve the quality of work.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li><strong>Colour Sense &amp; Design Skills:</strong> A strong sense of colour theory and design principles is essential for creating visually appealing and effective logos and previews. A high level of creativity and attention to detail is expected.</li>\n<li><strong>Expertise in Design Tools:</strong> Proficiency in industry-standard design software is a must:</li>\n<li>Adobe Photoshop</li>\n<li>Adobe Illustrator</li>\n<li>CorelDRAW (if applicable)</li>\n<li>Experience with mockup tools (e.g., Placeit) and digital art software will be a plus.</li>\n<li><strong>Desire to Learn &amp; Grow:</strong> Strong interest in continuous learning, especially in digitizing techniques and embroidery design, with a growth mindset for improving skills and taking on new challenges.</li>\n<li><strong>Self-Motivated &amp; Proactive:</strong> Ability to work independently while being a self-starter. Must be proactive in addressing challenges and solving problems efficiently.</li>\n<li><strong>Team Collaboration:</strong> Ability to work well in a team environment while also being capable of taking initiative on individual projects.</li>\n<li><strong>Communication Skills:</strong> Clear and effective communication with customers and colleagues, ensuring design requests are well-understood and met.</li>\n<li><strong>Experience &amp; Passion for Design:</strong> 1-2 years of experience and proficient in Photoshop, Illustrator and other designing tools.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>Autonomy &amp; Impact – Own your work, drive innovation, and see your solutions in action.</li>\n<li>Growth &amp; Mentorship – Be part of an elite team that values continuous learning.</li>\n<li>Stability &amp; Culture – A performance-driven, transparent, and innovation-friendly environment.</li>\n<li>Health Benefits – Family medical insurance with up to ₹2L coverage.</li>\n</ul>\n<p><strong>Job Details:</strong></p>\n<ul>\n<li><strong>Location:</strong> Technopark phase I, Thiruvananthapuram, Kerala 695581</li>\n<li><strong>Working:</strong> 5 days a week</li>\n<li><strong>Shift:</strong> Night Shift (8:30 PM to 5:30 AM)</li>\n<li><strong>Department:</strong> Customer Service Team</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> hr.india@fayausa.com</li>\n<li><strong>Website:</strong> http://www.fayausa.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 16, Oct 2025</p>\n<p>If you are passionate about design and eager to create exceptional, customer-centered work, apply now and be part of the FAYA team! Please send your resume and portfolio showcasing your best design work, along with a brief statement about why you are passionate about graphic design.</p>",
        "tags": [
            "1-2 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "CorelDRAW"
        ],
        "summary": "FAYA INNOVATIONS is hiring a Virtual Preview Designer. Responsibilities include logo editing, virtual previews creation, and collaborative teamwork in a night shift."
    },
    {
        "job_title": "Google Ad Expert",
        "company": "Innure Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23197",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Google Ads Expert</h2>\n<p><strong>Innure Infotech (P) Ltd</strong>\nModule No-14, 4th Floor, Nila Building, Technopark Campus, Trivandrum, 695581\n<a href=\"http://www.innure.com\">http://www.innure.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025\n<strong>Contact Email:</strong> info@scalevel.in</p>\n<p><strong>Brief Description:</strong>\nAre you a results-driven digital marketer with a passion for Google Ads? We're looking for a talented and motivated Digital Marketing Executive to join our team. If you have a solid understanding of pay-per-click (PPC) campaigns and a proven track record of driving conversions, we want to hear from you.</p>\n<p>As a Digital Marketing Executive, you'll be responsible for developing, implementing, and managing our paid search campaigns to increase brand awareness, website traffic, and sales. You'll work closely with our marketing team to optimize our digital strategy and ensure our campaigns meet key performance indicators (KPIs).</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Plan, execute, and optimize paid search campaigns on Google Ads.</li>\n<li>Conduct keyword research and analysis to identify new opportunities.</li>\n<li>Monitor and analyze campaign performance, making data-driven decisions to improve results.</li>\n<li>Manage daily budget spend and pacing to meet performance goals.</li>\n<li>Develop and A/B test ad copy and landing pages to maximize conversion rates.</li>\n<li>Generate regular reports on campaign performance and present insights to the team.</li>\n<li>Stay up-to-date with the latest Google Ads features, trends, and best practices.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Google Ads",
            "PPC",
            "Digital Marketing"
        ],
        "summary": "Innure Infotech is seeking a Digital Marketing Executive to manage Google Ads campaigns. The role involves optimizing PPC campaigns, analyzing performance, and staying updated with industry trends."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "Innure Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23196",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Digital Marketing Executive</h2>\n<p><strong>Innure Infotech (P) Ltd</strong>\nModule No-14, 4th Floor, Nila Building, Technopark Campus, Trivandrum, 695581\n<a href=\"http://www.innure.com\">http://www.innure.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025\n<strong>Contact Email:</strong> info@scalevel.in</p>\n<p>Are you a results-driven digital marketer with a passion for Google Ads? We're looking for a talented and motivated Digital Marketing Executive to join our team. If you have a solid understanding of pay-per-click (PPC) campaigns and a proven track record of driving conversions, we want to hear from you.</p>\n<p>As a Digital Marketing Executive, you'll be responsible for developing, implementing, and managing our paid search campaigns to increase brand awareness, website traffic, and sales. You'll work closely with our marketing team to optimize our digital strategy and ensure our campaigns meet key performance indicators (KPIs).</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Plan, execute, and optimize paid search campaigns on Google Ads.</li>\n<li>Conduct keyword research and analysis to identify new opportunities.</li>\n<li>Monitor and analyze campaign performance, making data-driven decisions to improve results.</li>\n<li>Manage daily budget spend and pacing to meet performance goals.</li>\n<li>Develop and A/B test ad copy and landing pages to maximize conversion rates.</li>\n<li>Generate regular reports on campaign performance and present insights to the team.</li>\n<li>Stay up-to-date with the latest Google Ads features, trends, and best practices.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Google Ads",
            "PPC",
            "Keyword Research"
        ],
        "summary": "Innure Infotech is seeking a Digital Marketing Executive to manage and optimize paid search campaigns. The role involves driving brand awareness, website traffic, and sales through data-driven strategies."
    },
    {
        "job_title": "UI/UX and Graphic Designer",
        "company": "Tigrid Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23193",
        "location": "Technopark",
        "closing_date": "07 Sep 2025",
        "job_description": "<h2>UI/UX and Graphic Designer</h2>\n<p><strong>TIGRID TECHNOLOGIES (P) Ltd</strong> is seeking a passionate and creative UI/UX and Graphic Designer to join our team.</p>\n<p><strong>Location:</strong> Trivandrum, Kerala</p>\n<p><strong>Work Mode:</strong> Hybrid</p>\n<p><strong>Duration:</strong> 3 - 6 months</p>\n<p><strong>Contact:</strong> hr@tigrid.in</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design intuitive web and mobile interfaces</li>\n<li>Develop branding and marketing materials</li>\n<li>Collaborate with cross-functional teams to bring ideas to life</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Candidates who have completed a design-related course</li>\n<li>Candidates with prior internship experience</li>\n</ul>\n<p><strong>Skills and Qualifications:</strong></p>\n<ul>\n<li>Minimum 1 year of experience in both UI/UX &amp; Graphic Design</li>\n<li>Proficiency in Adobe Creative Suite, Figma, Illustrator &amp; Photoshop</li>\n<li>Strong skills in web, mobile app, branding &amp; marketing design</li>\n<li>Creativity, attention to detail &amp; problem-solving mindset</li>\n<li>Strong collaboration and time management skills</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your updated CV and portfolio (mandatory) to hr@tigrid.in</p>\n<p>Learn more about us at: www.tigrid.in</p>\n<p><strong>Address:</strong></p>\n<p>TIGRID TECHNOLOGIES (P) Ltd\n1st FLOOR, M SQUARED MAIN BUILDING, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA - 695581</p>\n<p><strong>Closing Date:</strong> 07, Sept 2025</p>\n<p><strong>Job Published:</strong> 01, Sept 2025</p>",
        "tags": [
            "1+ Years",
            "UI/UX Design",
            "Graphic Design",
            "Adobe Creative Suite"
        ],
        "summary": "Tigrid Technologies is looking for a UI/UX and Graphic Designer to design interfaces and develop marketing materials. The role requires 1+ years of experience and proficiency in design software."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/23192",
        "location": "Technopark",
        "closing_date": "26 Sep 2025",
        "job_description": "<h2>Odoo Developer</h2>\n<p>QWY Software (P) Ltd is seeking a skilled and experienced Odoo Developer to join our team.</p>\n<p><strong>Location:</strong>\nSecond Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581</p>\n<p><strong>Industry:</strong>\nIT/ITES covering E-com, Logistics and Hyperlocal Delivery Services</p>\n<p><strong>Responsibilities:</strong>\n- Developing, customizing, and maintaining Odoo modules.</p>\n<p><strong>Required Skills:</strong>\n- Strong knowledge of Odoo, Python, PostgreSQL, JSON &amp; JavaScript, Linux &amp; GIT\n- Experience in Odoo version 12, 13, 14, 15, 16</p>\n<p><strong>Good to Have:</strong>\n- Functional knowledge of Sales, CRM, Accounts &amp; HR\n- Experience with Git, Docker or Linux environment is a plus\n- Odoo Certification is a plus</p>\n<p><strong>Experience:</strong>\n- 2-5 Years</p>\n<p><strong>Contact Information:</strong>\nInterested candidates please share your updated CV to careers@qwysoft.com, with the subject line \"Application for Odoo Developer\".</p>\n<p><strong>Closing Date:</strong> 26, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025</p>",
        "tags": [
            "2-5 Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "We are seeking an Odoo Developer to develop, customize, and maintain Odoo modules. The ideal candidate will possess strong knowledge of Odoo, Python, and PostgreSQL."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Good Methods Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23191",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p><strong>Good Methods Software Solutions (P) Ltd</strong> is seeking a Full Stack Developer to join their team focused on modernizing U.S. dental practices through CareStack's cloud platforms. This role is part of a startup-mode team dedicated to super-charging Revenue Cycle Management (RCM) with AI, automation, and data-driven workflows. The team operates as a tech-agnostic innovation unit, transforming manual RCM processes into scalable, tech-enabled solutions.</p>\n<p><strong>Contact Information:</strong> visakhgoommen@carestack.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and deploy full-stack solutions for untapped RCM opportunities, iterating based on real-world feedback.</li>\n<li>Select and justify the best tools/frameworks for each project, implementing Proof of Concepts (PoCs) as needed.</li>\n<li>Build and maintain secure, scalable APIs, UIs, automations, and data pipelines.</li>\n<li>Integrate third-party systems (EHR, CRM, payment gateways, RPA bots).</li>\n<li>Uphold code quality through reviews, automated tests, CI/CD, and cloud-native best practices.</li>\n<li>Mentor junior engineers in problem-solving and tech-agnostic thinking.</li>\n<li>Collaborate with the RCM operations team to understand pain points and identify high-impact automation opportunities.</li>\n<li>Focus on measurable business outcomes and improving RCM performance metrics.</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Own green-field products that directly cut costs and boost revenue.</li>\n<li>Work in a lean, cross-functional squad with minimal bureaucracy.</li>\n<li>Have your voice matter and influence product direction, with ample room for professional growth.</li>\n<li>Be part of transforming RCM operations into a tech-enabled, highly scalable offering.</li>\n</ul>\n<p><strong>Experience:</strong> 2-8 Years</p>\n<p><strong>Location:</strong> Trivandrum, Kochi (Onsite)</p>\n<p><strong>Preferred Skills/Must-Have Skills &amp; Mindset:</strong></p>\n<ul>\n<li>2 – 8 years of experience designing, coding, testing, and running production software end-to-end.</li>\n<li>Proven ability to learn new stacks quickly and choose the “best-fit” tech (language, framework, cloud, DB) per use case.</li>\n<li>Deep understanding of computer science fundamentals, distributed systems, and REST/gRPC/GraphQL API design.</li>\n<li>Solid understanding of front-end ↔ back-end integration patterns (contract design, API gateways, auth flows) and real-time communication (WebSockets, SSE, pub-sub, event streams).</li>\n<li>Hands-on experience with cloud (AWS / GCP / Azure), container orchestration, and observability.</li>\n<li>Strong unit/integration testing discipline; Git &amp; trunk-based workflows.</li>\n<li>Bias for metrics-driven decisions and rapid experimentation.</li>\n<li>Outcome-focused approach that prioritizes solving real business problems.</li>\n<li>Excellent written &amp; verbal communication with non-technical stakeholders.</li>\n</ul>\n<p><strong>Notice period</strong> - Immediate 30 days</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025</p>\n<p><strong>Job Published:</strong> 01, Sept 2025</p>",
        "tags": [
            "2-8 Years",
            "AWS/GCP/Azure",
            "REST/gRPC/GraphQL",
            "CI/CD"
        ],
        "summary": "Seeking a Full Stack Developer to build cloud platforms and transform Revenue Cycle Management (RCM) using AI and automation. The role involves full-stack development, cloud technologies, and collaboration with the RCM operations team."
    },
    {
        "job_title": "Flutter Developer",
        "company": "Tigrid Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23189",
        "location": "Technopark",
        "closing_date": "07 Sep 2025",
        "job_description": "<h2>Flutter Developer</h2>\n<p><strong>TIGRID TECHNOLOGIES (P) Ltd</strong>\n1st FLOOR, M SQUARED MAIN BUILDING, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA , 695581\n<a href=\"https://www.tigrid.in\">https://www.tigrid.in</a></p>\n<p><strong>Closing Date:</strong> 07, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025\n<strong>Contact Email:</strong> hr@tigrid.in</p>\n<p><strong>Brief Description:</strong>\nWe are seeking an experienced Flutter Developer (IOS and Android) with approximately 1 year of experience to become part of our dynamic team. The selected candidate will be responsible for the design, development, and maintenance of mobile applications using Flutter. This is an immediate joining opportunity with a hybrid work mode.</p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>0-1 year experience in Flutter and Dart development</li>\n<li>Strong understanding of mobile app development principles and best practices.</li>\n<li>Experience integrating RESTful APIs and third-party libraries.</li>\n<li>Proficiency with version control tools like Git.</li>\n<li>Excellent problem-solving skills and strong attention to detail.</li>\n</ul>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain high-quality mobile applications using Flutter and Dart.</li>\n<li>Collaborate with cross-functional teams, including UI/UX designers, to create beautiful and responsive interfaces.</li>\n<li>Write clean, maintainable, and efficient code following industry best practices.</li>\n<li>Troubleshoot, debug, and optimize application performance.</li>\n<li>Stay updated with the latest Flutter advancements and industry trends.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Immediate joiners are highly preferred.</li>\n<li>Knowledge of native Android / iOS development is a plus.</li>\n<li>Familiarity with CI/CD processes.</li>\n<li>Freshers or interns with strong skills may also apply.</li>\n</ul>\n<p>Interested candidates can send their resumes to hr@tigrid.in.</p>",
        "tags": [
            "0-1 Year",
            "Flutter",
            "Dart",
            "RESTful APIs"
        ],
        "summary": "Tigrid Technologies is looking for a Flutter Developer to design, develop, and maintain mobile applications. Hybrid work mode with immediate joining is available."
    },
    {
        "job_title": "Asp.net Developer ( 3-5years exp)",
        "company": "Estrrado Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23188",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>ASP.NET Developer</h2>\n<p><strong>Estrrado Technology Solutions (P) Ltd</strong>\nACE 07, 3rd Floor, CDAC Building, Technopark Campus, Trivandrum, 695581\nhttp://www.estrrado.com</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025\n<strong>Contact Email:</strong> career@estrrado.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced and energetic ASP.NET Developer who can quickly adapt to ongoing projects, manage multiple tasks, and deliver high-quality results. You will work on diverse web development projects, collaborate with cross-functional teams, and leverage AI-assisted coding tools to enhance productivity.</p>\n<p><strong>Type of Job:</strong> Full time\n<strong>Experience:</strong> 3–5 years of experience\n<strong>Preferred Applicants From:</strong> Kerala</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain web applications using ASP.NET, C#, and MVC.</li>\n<li>Build responsive front-end interfaces with HTML, CSS, JavaScript, Bootstrap, and jQuery.</li>\n<li>Work with MS SQL or other SQL-based databases for data management.</li>\n<li>Apply coding standards, best practices, and participate in code reviews.</li>\n<li>Use AI-powered tools like ChatGPT and GitHub Copilot to optimize development and generate quality code.</li>\n<li>Take ownership of assigned project modules and ensure timely delivery.</li>\n<li>Collaborate with cross-functional teams to define requirements and deliver effective solutions.</li>\n<li>Provide technical guidance and mentoring support to junior team members when required.</li>\n<li>Contribute to process improvements and ensure smooth project execution.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, IT, or related field.</li>\n<li>3–5 years of experience in ASP.NET, C#, and MVC framework.</li>\n<li>Strong front-end skills (HTML, CSS, JavaScript, Bootstrap, jQuery).</li>\n<li>Proficiency in MS SQL or equivalent database systems.</li>\n<li>Experience managing project deliveries with minimal supervision.</li>\n<li>Strong problem-solving, analytical, and communication skills.</li>\n<li>Ability to multitask, prioritize, and adapt to dynamic project requirements.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Apply via Career Estrrado OR Send your resume to career@estrrado.com with the subject line: ASP.NET Developer (3-5 years exp). Applications without the correct subject line may be put on hold or rejected.</p>",
        "tags": [
            "3-5 Years",
            "ASP.NET",
            "C#",
            "MVC"
        ],
        "summary": "Estrrado Technology Solutions is looking for an ASP.NET Developer to design and maintain web applications. The role involves collaboration, using AI tools, and ensuring timely project delivery."
    },
    {
        "job_title": "NodeJS Developer-Urgent Hiring",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/23187",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>NodeJS Developer - Urgent Hiring</h2>\n<p><strong>ATeam InfoSoft Solutions Private Limited</strong> is looking for a skilled and motivated NodeJS Developer to join our team in Technopark, Trivandrum.</p>\n<p><strong>Contact:</strong>\n*   Email: recruitment@ateamsoftsolutions.com\n*   Phone: 7907410058</p>\n<p><strong>Location:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus 695581, 695581</p>\n<p><strong>Job Details:</strong></p>\n<ul>\n<li><strong>Job Title:</strong> Node.js Developer</li>\n<li><strong>Experience:</strong> 3+ Years</li>\n<li><strong>Location:</strong> Technopark, Trivandrum, Kerala</li>\n<li><strong>Work Mode:</strong> Onsite</li>\n<li><strong>Joining:</strong> Immediate joiners preferred</li>\n<li><strong>Closing Date:</strong> 19, Sept 2025</li>\n<li><strong>Job Published:</strong> 01, Sept 2025</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable server-side applications using Node.js.</li>\n<li>Collaborate with cross-functional teams to define and implement new features.</li>\n<li>Write clean, modular, and reusable code following best practices.</li>\n<li>Ensure optimal performance and scalability of applications.</li>\n<li>Integrate APIs and third-party services.</li>\n<li>Participate in code reviews, testing, and deployment processes.</li>\n<li>Troubleshoot and resolve application issues and bugs in a timely manner.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field.</li>\n<li>Experience in Agile/Scrum development environments.</li>\n<li>Exposure to frontend technologies like React or Angular is a plus.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong proficiency in JavaScript and Node.js.</li>\n<li>Experience with Express.js or similar Node.js frameworks.</li>\n<li>Good understanding of RESTful APIs, asynchronous programming, and event-driven architecture.</li>\n<li>Proficiency in working with databases such as MongoDB, MySQL, or PostgreSQL.</li>\n<li>Experience with version control tools like Git.</li>\n<li>Knowledge of authentication and authorization mechanisms (OAuth, JWT).</li>\n<li>Familiarity with CI/CD pipelines and cloud platforms is a plus.</li>\n<li>Strong debugging, problem-solving, and analytical skills.</li>\n</ul>\n<p><strong>To Apply:</strong></p>\n<p>Send your updated resume to recruitment@ateamsoftsolutions.com</p>",
        "tags": [
            "3+ Years",
            "Node.js",
            "JavaScript",
            "RESTful APIs"
        ],
        "summary": "ATeam InfoSoft Solutions is seeking a skilled NodeJS Developer for their Technopark, Trivandrum office. The role involves designing and maintaining scalable server-side applications."
    },
    {
        "job_title": "AI/ML – Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23186",
        "location": "Technopark",
        "closing_date": "08 Sep 2025",
        "job_description": "<h2>AI/ML – Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a highly skilled and experienced AI/ML Lead to lead the design and implementation of our artificial intelligence and machine learning solutions. The successful candidate will work closely with cross-functional teams to understand business requirements and develop scalable, efficient, and robust AI/ML systems.</p>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption. We offer expertise and consultation in multiple technology domains.</p>\n<p><strong>Job Description:</strong></p>\n<p>As an AI/ML Lead, you will:</p>\n<ul>\n<li>Build Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and generative models.</li>\n<li>Define, design, and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Create demos and proofs of concept, develop AI/ML based products and services.</li>\n<li>Create Functional and technical specifications for AI &amp; ML solutions.</li>\n<li>Follow SDLC process.</li>\n<li>Demonstrate advanced analytical knowledge of data and data conditioning.</li>\n<li>Program advanced computing and developing algorithms.</li>\n<li>Develop software, data models and executing predictive analysis.</li>\n<li>Design, develop, and implement generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements and develop innovative solutions.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).</li>\n<li>Strong proficiency in SQL, NO SQL Databases.</li>\n<li>Experience in implementing and deploying AI\\ Machine Learning solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)</li>\n<li>Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.</li>\n<li>Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g. Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</li>\n<li>B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience in production software engineering routines in DevOps/MLOps (e.g.Continuous Code Integration and Deployment).</li>\n<li>Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>careers@techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 08, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025</p>",
        "tags": [
            "5+ Years",
            "Python",
            "AI/ML",
            "Tensorflow"
        ],
        "summary": "Techversant is looking for an AI/ML Team Lead to design and implement AI/ML solutions. The role involves working with cross-functional teams to develop scalable AI/ML systems."
    },
    {
        "job_title": "Senior Software Engineer- Dot Net",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23183",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Senior Software Engineer - .NET</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a proactive and results-driven Senior Software Engineer with a strong background in .NET development to join our team. As a global technology services and solutions company with over 16 years of experience, Techversant provides high-quality end-to-end IT solutions and services to clients worldwide.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead a team of developers, providing technical guidance, mentoring, and performance management.</li>\n<li>Conduct code reviews to ensure code quality, consistency, and adherence to coding standards.</li>\n<li>Design and develop high-quality software solutions using .NET Core, Angular or React, MS SQL, and Azure technologies.</li>\n<li>Collaborate with cross-functional teams to understand project requirements and translate them into technical specifications.</li>\n<li>Stay up-to-date with the latest .NET technologies, frameworks, and best practices.</li>\n<li>Troubleshoot and resolve complex technical issues across the application stack.</li>\n<li>Work closely with product managers and designers to ensure successful project delivery.</li>\n<li>Manage and prioritize project tasks, ensuring deadlines are met and milestones achieved.</li>\n<li>Architect scalable and maintainable solutions that align with the company’s technical vision.</li>\n<li>Participate in project planning, estimation, and documentation processes.</li>\n<li>Understand code in other technology projects and convert them into .NET projects, if required.</li>\n<li>Be ready to learn new technologies.</li>\n<li>Ensure code reviews, unit testing, and integration testing are completed efficiently and effectively.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science, Engineering, or a related field (or equivalent practical experience).</li>\n<li>Minimum 7+ years of experience in .NET technology.</li>\n<li>Fluent in English.</li>\n<li>Proficiency in .NET Core, C#, ASP.NET MVC, Web API.</li>\n<li>Strong expertise in frontend technologies including Angular or React, TypeScript, HTML, CSS, and JavaScript.</li>\n<li>Experience in implementing design patterns and SOLID principles.</li>\n<li>Experience in cloud technologies, particularly Azure services (e.g., Azure App Service, Azure Functions).</li>\n<li>Knowledge in Azure DevOps will be an added advantage.</li>\n<li>Experience in leading development teams and providing technical guidance.</li>\n<li>Knowledge in NoSQL databases will be an added advantage.</li>\n<li>Excellent problem-solving skills and the ability to troubleshoot complex technical challenges.</li>\n<li>Strong communication skills and the ability to collaborate effectively with cross-functional teams.</li>\n<li>Familiarity with version control systems, especially Git.</li>\n<li>Ability to balance technical leadership and hands-on development.</li>\n<li>Ability to work as an individual contributor.</li>\n<li>Proven ability to manage project tasks, priorities, and deadlines.</li>\n<li>Experience with Agile methodologies like Scrum and practices is a plus.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule with weekends off.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs.</li>\n<li>Work-life Balance with flexible work timings, early out Fridays, various social and cultural activities, etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>",
        "tags": [
            "7+ Years",
            ".NET Core",
            "Azure",
            "Angular/React"
        ],
        "summary": "Techversant is seeking a Senior Software Engineer to lead a team and develop solutions using .NET Core and Azure. The candidate should have expertise in .NET technologies and experience with Agile methodologies."
    },
    {
        "job_title": "ColdFusion Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23182",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>ColdFusion Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced ColdFusion Developer to join our team. We are a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to clients across the globe for more than 15 years.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025</p>\n<p><strong>Job Published:</strong> 01, Sept 2025</p>\n<h3>About Techversant:</h3>\n<p>We offer expertise and consultation in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence, etc.</p>\n<h3>What’s important to us:</h3>\n<p>We are looking for an Experienced ColdFusion Developer with a strong background in Web Application Development. The ideal candidate should be well-versed in ColdFusion Technologies and have a proven ability to deliver efficient, reliable, and user-friendly solutions.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Collaborate with cross-functional teams to gather and understand project requirements, and then translate them into technical specifications and development plans.</li>\n<li>Develop, maintain, and enhance web applications using ColdFusion and related technologies.</li>\n<li>Write efficient, secure, and maintainable code while following coding standards and best practices.</li>\n<li>Debug and troubleshoot issues in existing applications to ensure optimal performance and functionality.</li>\n<li>Integrate frontend interfaces with backend systems, ensuring seamless data flow and user experiences.</li>\n<li>Create and maintain databases and database interactions using SQL or other relevant technologies.</li>\n<li>Work closely with UI/UX designers to implement user-friendly and visually appealing interfaces.</li>\n<li>Collaborate with other developers to conduct code reviews and ensure code quality.</li>\n<li>Stay updated with emerging trends and advancements in ColdFusion Development.</li>\n<li>Assist in planning and estimation for projects and contribute to documentation processes</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience).</li>\n<li>Minimum of 3 years of hands-on experience in web application development using ColdFusion.</li>\n<li>Proficiency in ColdFusion markup language (CFML) and ColdFusion components (CFCs).</li>\n<li>Strong expertise in frontend technologies such as HTML, CSS, and JavaScript.</li>\n<li>Experience in integrating frontend interfaces with backend systems and APIs.</li>\n<li>Familiarity with Databases and SQL queries for data manipulation and retrieval.</li>\n<li>Solid understanding of version control systems, especially Git.</li>\n<li>Strong problem-solving skills and the ability to troubleshoot and resolve complex technical issues.</li>\n<li>Excellent teamwork and communication skills.</li>\n<li>Ability to work independently and collaboratively in a fast-paced environment.</li>\n<li>A portfolio of completed projects demonstrating your ColdFusion development skills.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581</strong>\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "3+ Years",
            "ColdFusion",
            "SQL",
            "JavaScript"
        ],
        "summary": "Techversant Infotech is hiring a ColdFusion Developer to develop and maintain web applications. The role requires expertise in ColdFusion, front-end technologies, and database interactions."
    },
    {
        "job_title": "AI/ML – Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23181",
        "location": "Technopark",
        "closing_date": "08 Sep 2025",
        "job_description": "<h2>AI/ML Architect</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a visionary and hands-on AI Solution Architect to conceptualize, design, and deliver robust AI-driven applications. This client-facing leadership role requires someone who can stay ahead of emerging AI trends and technologies.</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. They offer expertise and consultation in multiple technology domains including Artificial Intelligence and Data Science.</p>\n<p><strong>Key Responsibilities:</strong>\n- Interact directly with clients and stakeholders to understand complex business problems.\n- Translate business needs into AI/ML opportunities and articulate solution strategies clearly.\n- Present solution architectures, effort estimates, timelines, and potential ROI.\n- Define end-to-end AI architecture including data pipelines, model selection, AI engines, integration layers, APIs, and deployment strategies.\n- Make informed choices of AI/ML/DL algorithms, frameworks, and platforms based on problem type and constraints.\n- Ensure the architecture is scalable, modular, secure, and optimized for performance.\n- Develop critical components or proof-of-concepts when needed.\n- Perform hands-on design and coding for pipelines, model training, inferencing, or integrations.\n- Create reusable components and automation scripts for repeatability.\n- Build and mentor a high-performing AI development team.\n- Drive agile development cycles, ensuring timely and quality delivery.\n- Collaborate with DevOps, Product Managers, and QA teams throughout SDLC.</p>\n<p><strong>Preferred Skills:</strong>\n- <strong>AI/ML/DL Expertise:</strong> Proven experience with supervised, unsupervised, and reinforcement learning. Deep knowledge of ML algorithms (e.g., XGBoost, SVM, Random Forest) and DL architectures (CNNs, RNNs, Transformers, LLMs). Hands-on with Python, PyTorch, TensorFlow, Keras, Scikit-learn, Hugging Face, etc.\n- <strong>Architecture &amp; System Design:</strong> Strong grasp on designing large-scale AI/ML pipelines using microservices, APIs, and cloud-native architecture. Experience designing MLOps workflows (CI/CD for ML) using tools like MLflow, Kubeflow, Airflow, DVC.\n- <strong>Cloud &amp; Platforms:</strong> Proficient in AWS/GCP/Azure AI/ML services (e.g., SageMaker, Vertex AI, Azure ML Studio). Familiarity with vector databases (e.g., FAISS, Pinecone), model versioning, and deployment strategies (e.g., REST APIs, gRPC, containers, Kubernetes).\n- <strong>Data Engineering:</strong> Working knowledge of data wrangling, preprocessing, ETL, feature engineering, data versioning. Tools: Spark, Pandas, Snowflake, Kafka, Databricks, Delta Lake.\n- <strong>Product &amp; Project Ownership:</strong> Ability to estimate efforts, manage scope, and align delivery with client expectations. Experience in productizing AI models and integrating them into full-stack applications.\n- <strong>Soft Skills:</strong> Excellent communication, stakeholder management, and presentation skills. Ability to simplify complex AI concepts for non-technical stakeholders.</p>\n<p><strong>Preferred/Nice-to-Have:</strong>\n- Experience with Generative AI (LLMs, GPT, BERT, Stable Diffusion, LangChain, RAG, etc.)\n- Knowledge of Prompt Engineering, Fine-Tuning, and RLHF\n- Experience in NLP, Computer Vision, Time Series, or Recommendation Engines\n- Understanding of ethical AI, explainable AI, and compliance in AI systems\n- Publications, contributions to open-source, or AI certifications</p>\n<p><strong>Education:</strong>\n- Bachelor’s or Master’s degree in Computer Science, Data Science, AI, or related fields.\n- Certifications in Cloud AI/ML platforms or advanced AI specializations are a plus.</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 08, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025</p>\n<p><strong>Location:</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "5+ Years",
            "AI/ML/DL",
            "Python",
            "Cloud Platforms"
        ],
        "summary": "Techversant is seeking an AI/ML Architect to lead the design and delivery of AI solutions. The role involves client engagement, solution architecture, and team leadership in AI development."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23179",
        "location": "Technopark",
        "closing_date": "08 Sep 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Senior AI/ML Engineer to join our team. As a Global Technology Services and Solutions Company, we provide high-quality end-to-end IT solutions and services to clients worldwide for over 16 years.</p>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for an AI/ML Engineer to develop and drive new business opportunities internationally, discover sales opportunities, and create qualified leads.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.</li>\n<li>Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs) and diffusion models for various use cases involving text, code, and multi-modal data.</li>\n<li>Build Scalable Recommendation Engines: Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.</li>\n<li>Cloud-Native ML Engineering: Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.</li>\n<li>End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.</li>\n<li>Collaborate Across Functions: Work with cross-functional teams to translate business goals into AI-powered solutions.</li>\n</ul>\n<p><strong>Core Requirements:</strong></p>\n<ul>\n<li>Minimum 4 years of experience in building and deploying production-level ML/DL systems.</li>\n<li>Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Strong understanding of transformer architectures and deep learning model design</li>\n<li>Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution</li>\n<li>Expertise in Python programming with a focus on:<ul>\n<li>Code optimization and profiling</li>\n<li>Multi-threading and multiprocessing</li>\n<li>Object-oriented programming and design principles</li>\n</ul>\n</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Technical Stack:</strong></p>\n<ul>\n<li>Languages: Excellent understanding of object-oriented concepts and Python.</li>\n<li>ML/DL Frameworks:<ul>\n<li>Machine Learning: Scikit-learn, XGBoost, LightGBM</li>\n<li>Deep Learning: PyTorch, TensorFlow, Keras</li>\n<li>GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework</li>\n</ul>\n</li>\n<li>Cloud &amp; MLOps: AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes</li>\n<li>Data &amp; Compute: Apache Spark, BigQuery, RabbitMQ, S3, EC2</li>\n<li>Embedding Stores &amp; Vector Search: FAISS, Pinecone, ChromaDB</li>\n<li>Orchestration &amp; APIs: Apache Airflow, Docker Deployment, and FastAPI are a must</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience with multi-modal models combining text, vision, or audio</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct)</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure)</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field</li>\n<li>Equivalent practical experience in developing scalable AI solutions will also be considered</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Techversant Infotech (P) Ltd</li>\n<li>Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581</li>\n<li>http://www.techversantinfotech.com</li>\n<li>Contact Email: careers@techversantinfotech.com</li>\n<li>Closing Date: 08,Sept 2025</li>\n<li>Job Published: 01,Sept 2025</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Python",
            "Deep Learning",
            "Generative AI"
        ],
        "summary": "Techversant Infotech is hiring a Senior AI/ML Engineer to build and deploy machine learning and generative AI solutions. The role involves cloud deployment, collaboration, and owning the ML lifecycle."
    },
    {
        "job_title": "Senior E-mail Marketing Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23175",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Senior B2C Email Marketing Specialist</h2>\n<p><strong>About Way.com</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, they deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list and recognized as the top Product in Insurance by UnitQ.</p>\n<p><strong>Job Overview</strong></p>\n<p>We are seeking a results-driven, detail-oriented Senior B2C Email Marketing Specialist to lead our product-focused email marketing efforts. This role demands deep expertise in Mailchimp, a strategic approach to customer engagement, and the ability to drive product growth, retention, and conversions through data-backed, high-impact campaigns.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design and implement impactful email marketing strategies that drive engagement, retention, and conversions.</li>\n<li>Plan, launch, and optimize campaigns, automations, and workflows using Mailchimp and other platforms.</li>\n<li>Utilize customer insights to build segmented lists and deliver personalized, targeted messaging.</li>\n<li>Conduct A/B testing on subject lines, content, and CTAs to continuously enhance performance.</li>\n<li>Partner with product, design, and content teams to create visually compelling, high-impact email campaigns.</li>\n<li>Track key performance indicators, analyze campaign results, and provide actionable recommendations to improve ROI.</li>\n<li>Ensure all campaigns align with regulations such as CCPA and CAN-SPAM while following industry standards.</li>\n<li>Stay informed on emerging email marketing trends, tools, and best practices to maintain a competitive edge.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>4–6 years of hands-on experience in B2C email marketing, ideally within digital product or SaaS environments.</li>\n<li>Proven expertise in Mailchimp, including automation setup, audience segmentation, and performance reporting.</li>\n<li>Solid understanding of customer journey mapping and lifecycle marketing strategies.</li>\n<li>Working knowledge of HTML/CSS for email design is a plus, though not mandatory.</li>\n<li>Strong data-driven approach, with experience using tools such as Google Analytics, UTM tracking, and campaign reporting dashboards.</li>\n<li>Ability to craft engaging, action-oriented email copy that drives conversions.</li>\n<li>Excellent analytical skills with a focus on tracking, measuring, and optimizing campaign performance.</li>\n<li>Proficient in A/B testing and iterative experimentation to improve results.</li>\n<li>Exceptional communication and cross-functional collaboration skills.</li>\n</ul>\n<p><strong>Why you will love working with us?</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Details</strong></p>\n<ul>\n<li><strong>Job Title:</strong> Senior B2C Email Marketing Specialist</li>\n<li><strong>Experience:</strong> 4 to 6 Years</li>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n<li><strong>Location:</strong> Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</li>\n<li><strong>Contact Email:</strong> careers@way.com</li>\n<li><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/senior-product-email-marketing-specialist-b2c</li>\n</ul>",
        "tags": [
            "4-6 Years",
            "Mailchimp",
            "B2C Email Marketing",
            "Google Analytics"
        ],
        "summary": "Way.com is seeking a Senior B2C Email Marketing Specialist to drive product growth through email campaigns. The role requires expertise in Mailchimp and a data-driven approach."
    },
    {
        "job_title": "Product Team Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23174",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Product Manager</h2>\n<p><strong>Way.com</strong> - America’s dominant automotive super app, is looking for a Product Manager to enhance user experience and drive business growth. Way.com powers every mile for over 10 million customers, from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership.</p>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>As a <strong>Product Manager</strong>, you will take ownership of developing and delivering impactful product features. You will collaborate closely with engineering, design, and data teams to transform innovative ideas into market-ready solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>End-to-End Product Ownership:</strong> Drive product features from ideation to launch, ensuring alignment with business goals and delivery of high-quality outcomes.</li>\n<li><strong>Data-Driven Decision Making:</strong> Leverage analytics and user feedback to identify opportunities and implement impactful product enhancements.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with engineering, design, and data teams to deliver seamless, timely product releases.</li>\n<li><strong>Performance Management:</strong> Track product performance metrics and execute strategies to maximize growth, retention, and engagement.</li>\n<li><strong>Stakeholder Alignment:</strong> Communicate priorities, timelines, and progress clearly to stakeholders, ensuring transparency and alignment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>3–7 years of experience in product management.</li>\n<li>Product Strategy &amp; Roadmapping – Defining a clear vision, goals, and long-term plan for a product, and translating them into a prioritized roadmap that guides development and release.</li>\n<li>Data-Driven Decision Making – Using quantitative and qualitative data to inform choices, validate assumptions, and measure product performance for better business outcomes.</li>\n<li>User-Centric Design Thinking – Applying a creative, iterative problem-solving approach focused on understanding user needs and delivering solutions that enhance their experience.</li>\n<li>Stakeholder Management – Building and maintaining positive relationships with individuals or groups who have an interest in the product, ensuring alignment and effective communication.</li>\n<li>Agile Product Development – Using flexible, iterative methods to develop and deliver product features quickly, adapting to feedback and changing requirements.</li>\n<li>Market &amp; Competitive Analysis – Researching industry trends, customer behavior, and competitor offerings to identify opportunities and threats for product positioning.</li>\n<li>A/B Testing &amp; Experimentation – Comparing two or more variations of a product element with real users to determine which performs best.</li>\n<li>Go-To-Market Execution – Planning and carrying out the strategies needed to launch a product successfully, including positioning, messaging, and channel selection.</li>\n<li>Wireframing &amp; Prototyping – Creating visual blueprints and interactive mockups of a product to test concepts and guide development before final build.</li>\n<li>User Research – Collecting and analyzing feedback, observations, and data from real users to understand their behaviors, needs, and motivations.</li>\n<li>Bachelor’s degree in Engineering or an MBA from a Tier 1 institute.</li>\n<li>Proven track record of launching successful user-facing products.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Contact Information:</h3>\n<p>careers@way.com</p>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/product-manager\">https://waydot.greythr.com/hire/jobs/product-manager</a></p>\n<p><strong>Address:</strong> Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583</p>",
        "tags": [
            "3-7 Years",
            "Product Management",
            "Data-Driven Decision Making",
            "Stakeholder Management"
        ],
        "summary": "Way.com is seeking a Product Manager to develop impactful product features, enhance user experience and drive business growth. The role involves collaboration with cross-functional teams and data-driven decision-making."
    },
    {
        "job_title": "Regional Operations Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23173",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Regional Manager - Operations</h2>\n<p><strong>About Us</strong>\nWay.com is America’s dominant automotive super app, powering every mile for over 10 million customers. We leverage cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership.</p>\n<p><strong>Role Overview</strong>\nWe are seeking a strategic, results-driven, and hands-on Regional Manager – Operations to lead regional performance, boost sales, and strengthen vendor relationships. This role demands a leader with proven operational expertise and exceptional problem-solving skills.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>Regional Operations Leadership:</strong> Oversee daily operations across assigned regions, ensuring accuracy, efficiency, and consistent sales performance with timely reporting.</li>\n<li><strong>Sales &amp; Marketing Alignment:</strong> Collaborate with marketing teams to synchronize campaigns with operational goals, maintain data integrity, and generate actionable insights.</li>\n<li><strong>Team Leadership &amp; Development:</strong> Lead, coach, and motivate high-performing teams, fostering a culture of accountability, collaboration, and excellence.</li>\n<li><strong>Vendor Management:</strong> Establish and maintain strong, trust-based relationships with vendors to drive mutual success and long-term partnerships.</li>\n<li><strong>Strategic Growth &amp; Innovation:</strong> Partner with cross-functional teams to identify new opportunities, implement innovative sales strategies, and enhance customer satisfaction.</li>\n<li><strong>Issue Management:</strong> Act as the primary escalation point for critical operational challenges, driving swift resolutions and implementing process improvements.</li>\n<li><strong>Process Optimization:</strong> Continuously evaluate and refine workflows to improve scalability, efficiency, and overall operational effectiveness.</li>\n<li><strong>Adaptability:</strong> Demonstrate flexibility by supporting night shifts and occasional weekends to meet business requirements and ensure seamless operations.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>A Bachelor’s degree in any discipline.</li>\n<li>Minimum 3 years of experience in Operations or a related functional area.</li>\n<li>Exceptional communication skills, both written and verbal.</li>\n<li>Strong cold-calling skills.</li>\n<li>Highly organized and a natural team player.</li>\n<li>Proficiency in Google Workspace, Microsoft Excel, and internal ticketing or CRM systems.</li>\n<li>A solution-driven mindset.</li>\n<li>Comfortable working independently and managing real-time challenges.</li>\n<li>Strong analytical thinking.</li>\n<li>A growth mindset with a willingness to continuously up-skill.</li>\n</ul>\n<p><strong>Why you will love working with us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong>\nEmail: careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/regional-manager-operations</p>",
        "tags": [
            "3-7 Years",
            "Operations",
            "Vendor Management",
            "Sales"
        ],
        "summary": "We are looking for a Regional Manager to lead regional operations, improve sales, and strengthen vendor relationships. The candidate must have proven operational expertise."
    },
    {
        "job_title": "Senior HR Director - Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23172",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Senior Director – HR Operations</h2>\n<p>Way.com is seeking a visionary and results-oriented leader to head end-to-end HR operations. This role champions operational excellence across the entire employee lifecycle, leveraging data, automation, and next-gen HR technology to deliver a seamless, high-impact employee experience in a fast-paced, tech-first environment.</p>\n<p><strong>About Us</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>Operational Leadership</strong></p>\n<ul>\n<li>Oversee end-to-end HR operations including talent acquisition, onboarding, payroll, benefits, compliance, performance management, and offboarding.</li>\n<li>Design and implement scalable, technology-driven processes to enhance efficiency, accuracy, and compliance.</li>\n<li>Champion automation and AI-powered solutions to streamline recruitment, engagement, and HR analytics workflows.</li>\n</ul>\n<p><strong>Data-Driven Strategy</strong></p>\n<ul>\n<li>Build a comprehensive HR analytics framework with real-time dashboards to inform strategic decision-making.</li>\n<li>Track and report key metrics such as hiring velocity, payroll accuracy, retention, engagement, and productivity.</li>\n<li>Apply predictive and prescriptive analytics to strengthen workforce planning, reduce attrition, and boost performance.</li>\n</ul>\n<p><strong>Performance &amp; Talent Management</strong></p>\n<ul>\n<li>Collaborate with business and HR leaders to refine performance management systems including OKRs, feedback loops, appraisals, and talent reviews.</li>\n<li>Ensure fairness, consistency, and timeliness across all performance-related processes.</li>\n</ul>\n<p><strong>Compliance, Risk &amp; Governance</strong></p>\n<ul>\n<li>Ensure strict compliance with labor laws, organizational policies, and regulatory requirements.</li>\n<li>Lead audits, conduct risk assessments, and update policies to mitigate legal and operational risks.</li>\n</ul>\n<p><strong>Leadership &amp; Collaboration</strong></p>\n<ul>\n<li>Build, mentor, and lead a high-performing HR operations team with a culture of innovation and continuous improvement.</li>\n<li>Partner with Finance, Legal, and IT teams to deliver seamless cross-functional support.</li>\n<li>Act as a strategic advisor to the executive team, providing actionable, data-driven insights to maximize HR’s impact and organizational success.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>15+ years of progressive HR experience, with at least 5 years in a leadership role overseeing HR operations.</li>\n<li>Prior experience in product or technology companies with fast-paced, high-growth environments.</li>\n<li>Strong hands-on expertise in HR technology platforms (HRIS, ATS, payroll systems) and AI-enabled tools for recruitment, employee service, or performance management.</li>\n<li>Proven experience in delivering data-driven results across HR functions.</li>\n<li>Demonstrated ability to scale HR operations, build shared services models, and drive automation and process excellence.</li>\n<li>Strong understanding of compliance and labor laws across regions (India/US/global preferred).</li>\n<li>Excellent leadership, project management, and communication skills.</li>\n<li>Experience working in global or distributed teams.</li>\n<li>Certification in HR Analytics, AI in HR, Six Sigma, or SHRM/SPHR preferred.</li>\n<li>Proficiency in tools like Power BI, Tableau, Workday, Darwinbox, SAP SuccessFactors, or other HRMS tools.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li>Email: careers@way.com</li>\n<li>Apply Here: https://waydot.greythr.com/hire/jobs/senior-director-hr-operations</li>\n</ul>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com</p>",
        "tags": [
            "15+ Years",
            "HR Technology Platforms",
            "HR Analytics",
            "Compliance"
        ],
        "summary": "Seeking a Senior Director of HR Operations to lead end-to-end HR functions. The role focuses on leveraging data and technology for operational excellence in a fast-paced environment."
    },
    {
        "job_title": "Performance Marketing Manager - SEM",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23171",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Performance Marketing Manager - SEM</h2>\n<p><strong>About Way.com</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. They offer services from auto insurance and parking to EV charging. Way.com leverages AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions. They have been featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide. They were also recognized as the top Product in Insurance by UnitQ.</p>\n<p><strong>Job Title:</strong> Digital Marketing Manager / Performance Marketing Manager</p>\n<p><strong>Experience:</strong> 6 to 8 Years</p>\n<p><strong>Work Arrangement:</strong> On-site</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview</strong></p>\n<p>Way.com is seeking a data-driven and results-oriented Digital Marketing / Performance Marketing Manager to lead their paid media efforts, primarily focused on Search Engine Marketing (SEM) across Google Ads, Bing Ads, and other relevant platforms. You’ll drive performance across key verticals: Airport Parking, City Parking, Auto Insurance, Car Repair &amp; Maintenance, and more.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design, launch, and optimize high-performance SEM campaigns to achieve traffic, conversion, and revenue goals.</li>\n<li>Conduct comprehensive keyword research, create well-structured campaigns, and execute A/B testing across ads and landing pages.</li>\n<li>Track and analyze key performance metrics (CTR, CPC, CVR, ROAS) to identify opportunities for scalability and efficiency improvements.</li>\n<li>Collaborate with cross-functional teams (analytics, product, content, and design) to ensure effective campaign execution and iteration.</li>\n<li>Leverage beta features, automation tools, and emerging ad formats to maintain a competitive edge.</li>\n<li>Develop and present detailed performance reports, insights, and strategic recommendations to stakeholders.</li>\n<li>Maintain full compliance with platform advertising policies while ensuring strong quality scores.</li>\n<li>Stay updated on AI-driven innovations in digital advertising, adopting new features and tools launched by Google, Meta, Microsoft, and other major platforms.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>6+ years of hands-on experience in digital/performance marketing with a strong focus on SEM.</li>\n<li>Experience managing $100K+/month in paid media spend, preferably for US-based markets.</li>\n<li>Strong command of platforms including Google Ads, Bing Ads, and tools such as Google Analytics, Looker Studio, SA360, etc.</li>\n<li>Proven expertise with AI-powered advertising solutions (e.g., Google Performance Max, Meta Advantage+, DSA, automated audience expansion).</li>\n<li>Google Ads Certification required; Meta Blueprint or multi-channel expertise is a plus.</li>\n<li>Prior experience in e-commerce, mobility, or booking-based platforms is highly desirable.</li>\n<li>Exposure to beta product testing, new feature launches, or award-winning campaigns is a strong advantage.</li>\n<li>Agency background with multi-client and multi-platform experience is a plus.</li>\n<li>Excellent analytical, project management, and communication skills.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Email: careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>",
        "tags": [
            "6-8 Years",
            "SEM",
            "Google Ads",
            "Google Analytics"
        ],
        "summary": "Way.com is looking for a Digital Marketing Manager to lead SEM efforts across various platforms. The role involves optimizing campaigns and using data to improve performance."
    },
    {
        "job_title": "Marketing Manager - Social Media",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23170",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Social Media Marketing Manager</h2>\n<p><strong>About Us:</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers. Leveraging AI, machine learning, and advanced data analytics, we provide innovative solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, we're dedicated to making car ownership easier and more rewarding.</p>\n<p><strong>Job Title:</strong> Social Media Marketing Manager</p>\n<p><strong>Experience:</strong> 9 to 12 Years</p>\n<p><strong>Work Arrangement:</strong> On-site</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview:</strong>\nWe are seeking a creative and strategic Social Media Marketing Manager to lead our brand's digital growth. You will own the strategy and execution of our social media presence, driving brand awareness and deepening community engagement.</p>\n<p><strong>Key Responsibilities:</strong>\n- <strong>Strategic Leadership:</strong> Define and implement platform-specific strategies that reflect Way.com’s brand voice and growth objectives.\n- <strong>Content Strategy &amp; Execution:</strong> Lead the planning, creation, and scheduling of content for Instagram, Facebook, LinkedIn, X/Twitter, TikTok, and other platforms.\n- <strong>Community Management:</strong> Drive daily interactions by responding to comments and messages, and cultivate a loyal online community.\n- <strong>Brand Growth &amp; Advocacy:</strong> Design and launch creative campaigns to deepen emotional connections and encourage user advocacy.\n- <strong>Analytics &amp; Optimization:</strong> Monitor KPIs, analyze performance data, and refine strategies to maximize ROI.\n- <strong>Influencer &amp; Partnership Development:</strong> Identify and collaborate with influencers and partners to expand brand presence.\n- <strong>Trend &amp; Innovation Leadership:</strong> Stay ahead of emerging trends and platform updates.\n- <strong>Cross-Functional Collaboration:</strong> Partner with design, content, product, and customer support teams.\n- <strong>Budget &amp; Resource Management:</strong> Oversee social media budgets and allocate resources strategically.\n- <strong>Reputation Management:</strong> Monitor brand sentiment and address feedback proactively.</p>\n<p><strong>Preferred Skills:</strong>\n- Bachelor’s degree in Marketing, Communications, or a related field (Master’s degree is a plus).\n- Minimum 9 years of experience in social media marketing.\n- Deep understanding of social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.).\n- Proficiency in social media management tools (e.g., Hootsuite, Sprout Social, Buffer) and analytics tools (e.g., Google Analytics, Socialbakers).\n- Exceptional communication and leadership skills.\n- Strong creative acumen and strategic thinking capabilities.\n- Expertise in paid social media strategies and advertising techniques.\n- Ability to manage multiple projects efficiently under tight deadlines.\n- Passion for digital innovation.</p>\n<p><strong>Why You Will Love Working With Us:</strong>\n- Opportunity to work for the #1 Auto Super App in the US.\n- Opportunity to make a meaningful impact across 10+ million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth.\n- Competitive compensation.</p>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p><strong>Apply Now:</strong>\nhttps://waydot.greythr.com/hire/jobs/manager-social-media-marketing</p>",
        "tags": [
            "9-12 Years",
            "Social Media Marketing",
            "Content Strategy",
            "Community Management"
        ],
        "summary": "Seeking a Social Media Marketing Manager to drive brand awareness and engagement across multiple platforms. This role involves strategic leadership, content creation, and community growth."
    },
    {
        "job_title": "Data Architect/Data Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23169",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Data Architect/Manager</h2>\n<p><strong>About Way.com</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions. Way.com has been featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list. Recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking a visionary and hands-on Data Architect/Manager to design, build, and optimize high-performance, scalable data ecosystems. This role requires a strategic thinker with deep technical expertise, capable of balancing long-term architectural vision with practical execution.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design Scalable Data Architectures: Build and implement resilient data models, infrastructure, and pipelines.</li>\n<li>Leadership &amp; Mentorship: Guide and inspire data engineers and analysts.</li>\n<li>Business-Aligned Data Strategy: Partner with product, engineering, business, and design teams.</li>\n<li>Technology Innovation: Assess, adopt, and oversee advanced data platforms and tools.</li>\n<li>End-to-End Data Ownership: Oversee data ingestion, transformation, storage, access, and lifecycle management.</li>\n<li>Governance &amp; Compliance: Define and enforce standards to ensure data quality, integrity, and adherence to regulatory requirements.</li>\n<li>Actionable Insights: Provide architectural guidance and analytics.</li>\n<li>Data-Driven Culture: Advocate best practices, standardization, and data literacy.</li>\n<li>Clear Communication: Keep stakeholders informed through transparent reporting.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Proven leadership and team management capabilities.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication skills.</li>\n<li>Exceptional attention to detail.</li>\n<li>Ability to balance leadership duties with technical execution.</li>\n<li>Effective project and stakeholder management skills.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/data-architectmanager\">https://waydot.greythr.com/hire/jobs/data-architectmanager</a></li>\n</ul>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583. http://www.way.com</p>",
        "tags": [
            "10+ Years",
            "Data Architecture",
            "Data Management",
            "Data Governance"
        ],
        "summary": "Way.com is seeking a Data Architect/Manager to design and optimize data ecosystems. This role involves leadership, strategy alignment, and ensuring data quality and innovation."
    },
    {
        "job_title": "Senior Manager - QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23164",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Senior QA Manager</h2>\n<p><strong>About Us</strong></p>\n<p>Way.com is a leading automotive super app in the US, serving over 10 million customers with services ranging from auto insurance to EV charging. Leveraging AI, machine learning, and advanced data analytics, Way.com delivers innovative and personalized solutions. Recognized as a top product in insurance and featured by Bloomberg, Way.com is dedicated to making car ownership easier and more rewarding.</p>\n<p><strong>Job Overview</strong></p>\n<p>We are seeking a visionary and experienced Senior QA Manager to lead quality engineering, automation strategy, and enterprise-scale system quality. This role requires technical expertise, strategic thinking, and the ability to influence cross-functional teams to enhance test automation across products and teams. You will own the quality roadmap, design robust automation ecosystems, and lead a high-performing QA organization.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Define and drive a comprehensive QA automation vision and roadmap across all product lines.</li>\n<li>Build, scale, and lead a high-performing global QA organization focused on impactful automation.</li>\n<li>Architect robust, enterprise-level automation frameworks spanning UI, API, Mobile, and Data layers.</li>\n<li>Establish and oversee standards for functional, performance, security, and compliance testing.</li>\n<li>Collaborate with engineering, product, DevOps, compliance, and business teams to align quality initiatives with business objectives.</li>\n<li>Define benchmarks for automation coverage, release confidence, and continuous improvement models.</li>\n<li>Champion new tools, methodologies, and emerging QA practices to elevate testing effectiveness.</li>\n<li>Integrate automation seamlessly into CI/CD pipelines for faster, more reliable releases.</li>\n<li>Monitor and report key quality metrics, defect patterns, and incidents, implementing proactive measures.</li>\n<li>Grow future QA leaders, mentor engineers, and nurture a culture of innovation and accountability.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>15+ years of experience in QA/testing, with a strong emphasis on test automation, and at least 5+ years in senior leadership roles.</li>\n<li>Proven track record of building automation teams and strategies from the ground up.</li>\n<li>Hands-on expertise with test automation tools/frameworks such as Selenium, Cypress, Playwright, Appium, Rest Assured, etc.</li>\n<li>Proficiency in programming/scripting languages like Java, Python, JavaScript, or similar.</li>\n<li>Strong understanding of Agile, DevOps, and Shift-Left testing methodologies.</li>\n<li>Experience with CI/CD tools such as Jenkins, GitHub Actions, or GitLab CI.</li>\n<li>Familiarity with cloud platforms (AWS, GCP, Azure) and containerization technologies (Docker, Kubernetes).</li>\n<li>Exposure to compliance/regulatory testing (PCI-DSS, SOC2, ISO 27001) is highly desirable.</li>\n<li>Exceptional stakeholder management and communication skills, including executive-level reporting.</li>\n<li>Domain expertise in Fintech, Banking, SaaS, or other regulated industries.</li>\n<li>Experience with AI-driven testing, predictive quality analytics, or model-based testing.</li>\n<li>ISTQB Advanced Certification or equivalent credentials.</li>\n<li>Demonstrated ability to scale QA practices in multi-product or platform environments.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Way.Com India Pvt Ltd\n4th Floor, Yamuna, Technopark Phase-III\nThiruvananthapuram, 695583\nEmail: careers@way.com</p>\n<p><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/sr-manager-qa</p>",
        "tags": [
            "15+ Years",
            "Test Automation",
            "Selenium",
            "CI/CD"
        ],
        "summary": "We are seeking a Senior QA Manager to lead quality engineering and automation strategy. The role involves building automation ecosystems and leading a high-performing QA organization."
    },
    {
        "job_title": "Business Development Manager [ 5 Years and above]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/23163",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p><strong>Alzone Software (P) Ltd</strong> is seeking a Business Development Manager to drive business growth and build client relationships. This role focuses on managing international sales in industries like Supply Chain/Logistics, Pharma/Healthcare, and Banking/Finance.</p>\n<p><strong>Location:</strong> Trivandrum (Work From Office)\n<strong>Shift:</strong> Normal</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Business Development: Formulate strategies to identify and secure new business opportunities in the Digital Transformation domain.</li>\n<li>Client Engagement: Build and maintain relationships with CXOs, acting as a trusted advisor for IT consulting and digital transformation solutions.</li>\n<li>Revenue Generation: Drive consistent revenue growth, meeting and exceeding sales targets with a proven track record of high-value deals.</li>\n<li>Sales Execution: Manage the complete sales cycle, including lead generation, proposal development, and contract negotiations.</li>\n<li>Market Insights: Conduct research to identify market trends, competitive landscape, and new business opportunities.</li>\n<li>Collaboration: Partner with internal teams to deliver tailored client solutions and align with organizational goals.</li>\n<li>Negotiation: Lead high-value contract negotiations, ensuring mutually beneficial agreements.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Education: Bachelor’s degree in Computer Science/IT (MBA preferred).</li>\n<li>Experience: 5+ years in IT/Software business development, focusing on Digital Transformation and Web Development Services.</li>\n<li>Revenue Generation History: Proven ability to deliver measurable revenue growth, supported by a verifiable record of successful deals and their impact on organizational growth.</li>\n<li>International Sales: Expertise in global markets, with a strong network of CXO-level contacts and experience navigating diverse business environments.</li>\n<li>Industry Expertise: In-depth understanding of Supply Chain/Logistics, Pharma/Healthcare, and Banking/Finance verticals.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your resume to careers@alzonesoftware.com with the subject line: \"Application for Business Development Manager.\"</p>\n<p><strong>Contact Information:</strong></p>\n<p>Alzone Software (P) Ltd\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\nhttp://www.alzonesoftware.com\nContact Email: careers@alzonesoftware.com</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025</p>",
        "tags": [
            "5+ Years",
            "Digital Transformation",
            "Web Development",
            "International Sales"
        ],
        "summary": "Alzone Software is hiring a Business Development Manager to drive growth in digital transformation. They will focus on building client relationships and managing international sales."
    },
    {
        "job_title": "Tech Lead iOS",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23162",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>iOS Technical Lead</h2>\n<p><strong>About Us</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list and recognized as the top Product in Insurance by UnitQ.</p>\n<p><strong>Job Title:</strong> iOS Technical Lead</p>\n<p><strong>Experience Required:</strong> 10–15 years</p>\n<p><strong>Work Arrangement:</strong> On-site</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking a seasoned iOS Technical Lead with proven expertise in Swift to lead the full iOS application development lifecycle. You will be responsible for architecting scalable, high-performance mobile solutions, mentoring the development team, and ensuring our products deliver exceptional user experiences.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>iOS Development Leadership:</strong> Lead end-to-end app development with Swift, delivering scalable, efficient, and high-quality solutions.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with Product Managers and Designers to transform requirements into seamless, user-friendly mobile experiences.</li>\n<li><strong>Performance Optimization:</strong> Improve app responsiveness, stability, and performance across multiple iOS devices and OS versions.</li>\n<li><strong>Mentorship &amp; Code Quality:</strong> Conduct code reviews, enforce best coding standards, and mentor junior developers to elevate overall team output.</li>\n<li><strong>Testing &amp; Documentation:</strong> Ensure app reliability through thorough unit testing, clear documentation, and adherence to clean architecture practices.</li>\n<li><strong>Backend &amp; API Integration:</strong> Work with backend teams to enable secure, efficient, and smooth API integrations.</li>\n<li><strong>Innovation &amp; Improvement:</strong> Drive adoption of new tools, processes, and best practices to accelerate development and improve quality.</li>\n<li><strong>Feature Ownership:</strong> Take complete ownership of features from design to deployment, including post-release monitoring and optimization.</li>\n<li><strong>Continuous Learning:</strong> Keep pace with evolving iOS technologies to deliver modern, future-ready solutions.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>10+ years of mobile app development experience, including 6+ years in iOS development.</li>\n<li>Deep expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.</li>\n<li>Strong understanding of RESTful APIs, JSON parsing, and third-party library integration.</li>\n<li>Skilled in architecting complex mobile apps using modular design patterns such as MVVM, MVI, or MVP.</li>\n<li>Proficient in CI/CD workflows, automated testing, code review processes, and App Store deployments.</li>\n<li>Demonstrated leadership in team management and mentoring iOS developers.</li>\n<li>Experience with tools like Firebase, Mixpanel, or equivalent analytics/crash reporting platforms.</li>\n<li>Solid understanding of web application ecosystems and cross-platform compatibility challenges.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Hands-on experience with Core Bluetooth, Core Location, or real-time service integrations (e.g., EV charging or roadside assistance).</li>\n<li>Background in mobility, transportation, or automotive technology platforms.</li>\n<li>Familiarity with Kotlin Multiplatform or other cross-platform development frameworks.</li>\n</ul>\n<p><strong>Why you will love working with us?</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Email: careers@way.com</p>\n<p>Apply Now: https://waydot.greythr.com/hire/jobs/ios-technical-lead</p>\n<p>Way Dot Com (P) LtdWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583 http://www.way.com</p>",
        "tags": [
            "10-15 Years",
            "Swift",
            "UIKit",
            "RESTful APIs"
        ],
        "summary": "Way.com is seeking a skilled iOS Technical Lead to lead app development using Swift. The role involves architecture, mentorship, and ensuring high-quality mobile solutions."
    },
    {
        "job_title": "Business Analyst [ 4 years and above]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/23161",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p><strong>Alzone Software (P) Ltd</strong> is seeking an experienced Business Analyst to join our team in Trivandrum. The ideal candidate will collaborate with stakeholders to gather, analyze, and document business requirements, translating them into functional specifications for the technology teams. You will play a key role in designing solutions, improving business processes, and ensuring successful project execution.</p>\n<p><strong>Contact:</strong> careers@alzonesoftware.com</p>\n<p><strong>Location:</strong>\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\nhttp://www.alzonesoftware.com</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025</p>\n<h3>Key Responsibilities:</h3>\n<p><strong>Requirement Gathering &amp; Analysis:</strong></p>\n<ul>\n<li>Work closely with business stakeholders to understand their needs, objectives, and pain points.</li>\n<li>Elicit, document, and analyze business requirements, workflows, and processes.</li>\n<li>Translate business needs into clear, concise functional specifications for the development team.</li>\n</ul>\n<p><strong>Solution Design &amp; Implementation:</strong></p>\n<ul>\n<li>Collaborate with technology teams to propose practical and innovative solutions.</li>\n<li>Ensure alignment of solutions with organizational strategy and technological capabilities.</li>\n<li>Assist in defining project scope, objectives, and deliverables.</li>\n</ul>\n<p><strong>Stakeholder Communication:</strong></p>\n<ul>\n<li>Act as a bridge between business teams and technical teams.</li>\n<li>Present findings, recommendations, and project updates to key stakeholders.</li>\n<li>Simplify complex technical concepts for non-technical audiences.</li>\n</ul>\n<p><strong>Documentation &amp; Quality Assurance:</strong></p>\n<ul>\n<li>Create detailed documentation, including business requirements, process flows, use cases, and user stories.</li>\n<li>Ensure accuracy and maintenance of project documentation.</li>\n<li>Support system testing, user acceptance testing, and solution validation.</li>\n</ul>\n<p><strong>Process Improvement &amp; Risk Management:</strong></p>\n<ul>\n<li>Identify areas for process optimization and efficiency enhancement.</li>\n<li>Recommend and assist in implementing process improvements.</li>\n<li>Monitor project progress, identify risks, and suggest mitigation strategies.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Business Administration, Information Technology, or a related field (Master’s degree is a plus).</li>\n<li>Minimum 4 years and above of relevant experience as a Business Analyst.</li>\n<li>Strong analytical, problem-solving, and critical-thinking skills.</li>\n<li>Excellent communication and stakeholder management abilities.</li>\n<li>Proficiency in requirement gathering techniques, process modeling, and documentation.</li>\n<li>Familiarity with project management methodologies and the software development lifecycle (SDLC).</li>\n<li>Experience with tools like JIRA, Confluence, Microsoft Visio, etc.</li>\n<li>Business Analysis certification (CBAP, CCBA) is a plus.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>If you are interested, please send your updated CV to careers@alzonesoftware.com with the subject line \"Business Analyst\".</p>\n<p>Join us and be a part of a dynamic team driving business success!</p>",
        "tags": [
            "4+ Years",
            "Business Analysis",
            "JIRA",
            "Stakeholder Management"
        ],
        "summary": "Alzone Software is hiring a Business Analyst to gather requirements and design solutions. The role involves stakeholder communication, documentation, and process improvement in Trivandrum."
    },
    {
        "job_title": "Senior Java Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23160",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Senior Java Engineer</h2>\n<p>Way.com is seeking a Senior Java Engineer to join our team! As America’s dominant automotive super app, we empower every mile for over 10 million customers. We are leveraging cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership. </p>\n<p><strong>Closing Date:</strong> 04, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>About Us:</strong>\nWay.com is ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Senior Java Engineer\n<strong>Experience Required:</strong> 5–12 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced Senior Java Developer with deep expertise in Java, Spring Boot, MySQL, and RESTful APIs. This role involves architecting, developing, and optimizing high-performance, scalable applications, establishing technical standards, and mentoring junior team members.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Build, enhance, and maintain Java applications leveraging the <strong>Spring Boot framework</strong>, ensuring robust, scalable, and high-quality solutions.</li>\n<li>Partner with <strong>Product Owners, Architects, and other stakeholders</strong> to convert business needs into effective technical designs.</li>\n<li>Develop and integrate <strong>RESTful APIs</strong> to support application features and streamline system interoperability.</li>\n<li>Continuously improve application performance through code optimization, refactoring, and scalability enhancements.</li>\n<li>Lead code reviews, guide and mentor junior developers, and help drive adoption of best engineering practices.</li>\n<li>Keep abreast of advancements in the Java ecosystem and proactively apply relevant technologies.</li>\n<li>Diagnose, troubleshoot, and resolve complex technical issues to maintain system stability and reliability.</li>\n<li>Uphold industry standards and organizational guidelines throughout the software development lifecycle.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in <strong>Computer Science, Engineering, or related field</strong> (or equivalent work experience).</li>\n<li>Minimum of <strong>5+ years of professional Java development experience</strong>, with strong proficiency in <strong>Spring Boot and MySQL</strong>.</li>\n<li>In-depth knowledge of <strong>Java SE and Java EE concepts</strong>, including multi-threading, design patterns, and JVM internals.</li>\n<li>Solid experience in designing and implementing <strong>RESTful APIs</strong>.</li>\n<li>Proficiency in <strong>MySQL</strong> (or other relational databases) and writing efficient SQL queries.</li>\n<li>Familiarity with modern version control tools, particularly Git.</li>\n<li>Experience working within <strong>Agile methodologies</strong> (Scrum, Kanban, etc.).</li>\n<li>Strong problem-solving, debugging, and troubleshooting skills.</li>\n<li>Excellent communication skills and ability to collaborate in a team environment.</li>\n<li>Proven ability to mentor and guide junior developers.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p>Apply Now: https://waydot.greythr.com/hire/jobs/senior-java-developer</p>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583http://www.way.com</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Seeking a Senior Java Engineer to build scalable applications using Java, Spring Boot, and MySQL. The role involves mentoring junior developers and optimizing application performance."
    },
    {
        "job_title": "UiPath- RPA Developer [ 3+ Years]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/23158",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>UiPath RPA Developer</h2>\n<p><strong>Alzone Software (P) Ltd</strong> is seeking an experienced UiPath RPA Developer to join their team.</p>\n<p><strong>Location:</strong> ACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581</p>\n<p><strong>Website:</strong> <a href=\"http://www.alzonesoftware.com\">http://www.alzonesoftware.com</a></p>\n<p><strong>Contact Email:</strong> careers@alzonesoftware.com</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025</p>\n<p><strong>Job Published:</strong> 01, Sept 2025</p>\n<h3>Brief Description</h3>\n<p>The ideal candidate will have a solid background in developing automation solutions using UiPath, along with strong analytical skills to enhance operational efficiency through automation. This role includes designing, implementing, and maintaining automation workflows, collaborating with stakeholders, and optimizing processes to support business growth.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Automation Development:</strong> Design, develop, and implement automation workflows using UiPath to streamline business operations.</li>\n<li><strong>Solution Design:</strong> Collaborate with business analysts and stakeholders to understand business requirements and convert them into effective technical solutions.</li>\n<li><strong>Process Optimization:</strong> Identify and recommend areas for automation to improve efficiency, reduce errors, and enhance productivity.</li>\n<li><strong>Testing &amp; Debugging:</strong> Perform thorough testing and debugging of automation solutions to ensure they meet quality standards and function correctly.</li>\n<li><strong>Documentation:</strong> Create and maintain comprehensive documentation for automation processes, including workflows, technical specifications, and user guides.</li>\n<li><strong>Support &amp; Maintenance:</strong> Provide ongoing support and maintenance for deployed automation solutions, troubleshoot issues, and implement updates as needed.</li>\n</ul>\n<h3>Preferred Skills/Requirements:</h3>\n<ol>\n<li><strong>Education:</strong> Bachelor’s degree in computer science, Information Technology, Engineering, or a related field.</li>\n<li><strong>Experience:</strong> Proven 3+ years experience in developing RPA solutions, specifically with UiPath.</li>\n<li><strong>Technical Skills:</strong><ul>\n<li>Proficiency in UiPath for automation design and development.</li>\n<li>Strong understanding of RPA principles and best practices.</li>\n<li>Familiarity with database management and SQL.</li>\n<li>Experience in scripting languages such as Python or JavaScript is a plus.</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong><ul>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Ability to manage multiple projects and work independently.</li>\n</ul>\n</li>\n</ol>\n<p>Interested candidates share your updated resume to careers@alzonesoftware.com with the subject line \"RPA Developer-Uipath.\"</p>",
        "tags": [
            "3+ Years",
            "UiPath",
            "RPA",
            "Automation"
        ],
        "summary": "We need a UiPath RPA Developer to design, develop, and implement automation workflows. The ideal candidate will enhance operational efficiency through automation."
    },
    {
        "job_title": "Sales Manager",
        "company": "Itwagon (P) Ltd",
        "url": "https://technopark.org/job-details/23157",
        "location": "Technopark",
        "closing_date": "08 Sep 2025",
        "job_description": "<h2>Sales Manager</h2>\n<p><strong>ITWAGON (P) Ltd</strong> is seeking an enthusiastic Sales Executive to build business by identifying and selling prospects and maintaining client relationships. This role involves sales promotion via phone, online channels, and social media, targeting clients globally.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Identification of potential Channel Partners/resellers and developing new partners.</li>\n<li>Maintaining an assigned Channel Partners/reseller base and growing new business stream.</li>\n<li>Achieving assigned sales targets.</li>\n<li>Bringing sales queries to closure via phone and email.</li>\n<li>Generating and growing business with existing clients and developing new business sources.</li>\n<li>Establishing and maintaining excellent relationships with existing and new customers.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>3 to 4 years of Sales experience, preferably in IT Hardware; knowledge in CISCO devices is a plus.</li>\n<li>Highly motivated with a flair for sales.</li>\n<li>Excellent communication skills in English.</li>\n<li>Self-driven, aggressive, and independent with a desire to achieve targets.</li>\n<li>Working knowledge in Excel / Google sheet.</li>\n</ul>\n<p><strong>Educational Qualification:</strong></p>\n<ul>\n<li>Any degree with experience in sales and marketing; diploma holders in CS/IT can also apply.</li>\n</ul>\n<p><strong>Contact Information:</strong>\n- Email: priya@itwagon.com</p>\n<p><strong>Important Dates:</strong>\n- Closing Date: 08, Sept 2025\n- Job Published: 01, Sept 2025</p>\n<p>Visit: https://www.itwagon.com</p>",
        "tags": [
            "3-4 Years",
            "Sales",
            "IT Hardware",
            "Communication Skills"
        ],
        "summary": "ITWAGON is hiring a Sales Manager to drive business growth through partner development and achieving sales targets. The ideal candidate has IT hardware sales experience and excellent communication skills."
    },
    {
        "job_title": "Procurement Executive",
        "company": "Itwagon (P) Ltd",
        "url": "https://technopark.org/job-details/23156",
        "location": "Technopark",
        "closing_date": "08 Sep 2025",
        "job_description": "<h2>Procurement Executive</h2>\n<p><strong>ITWAGON (P) Ltd</strong>\n6th Floor, STPI Building, Technopark Phase 1, Trivandrum, 695581\n<a href=\"https://www.itwagon.com\">https://www.itwagon.com</a></p>\n<p><strong>Closing Date:</strong> 08, Sept 2025\n<strong>Job Published:</strong> 01, Sept 2025\n<strong>Contact Email:</strong> priya@itwagon.com</p>\n<p>We are looking for experienced candidates who will be responsible for the procurement (IT Hardware) process. This job demands good communication skills in English.</p>\n<p><strong>Duties and Responsibilities</strong></p>\n<ul>\n<li>Responsible for sourcing IT equipment, materials &amp; services and managing vendors.</li>\n<li>Identify, comprehend specifications, and source products requested by clients.</li>\n<li>Estimate the effective cost of items to be procured, adding up other expenses such as freight, warehousing, etc.</li>\n<li>Constantly find new vendors, distributors, and manufacturers to ensure the best pricing and quality.</li>\n<li>Preparation of comparison for quotes, releasing purchase orders, and following up with suppliers for timely delivery of quality products.</li>\n<li>Readiness to work extended hours or in different time zones to meet product delivery schedules.</li>\n</ul>\n<p><strong>Preferred Skills, Knowledge, and Skills</strong></p>\n<ul>\n<li>Comfortable with figures and in collecting, analyzing, and interpreting data.</li>\n<li>Solid judgement with the ability to make good decisions.</li>\n<li>Must possess good communication skills in English.</li>\n<li>Working knowledge in MS Excel, Google Sheets, etc.</li>\n</ul>\n<p><strong>Minimum Qualification</strong></p>\n<ul>\n<li>Degree in any discipline, preferably with subjects related to procurement / material management included in the academic curriculum</li>\n</ul>\n<p>OR</p>\n<ul>\n<li>Diploma in IT or Computer Science</li>\n</ul>\n<p>Additional certificates related to the Procurement Process will be given weightage.</p>\n<p><strong>Experience</strong></p>\n<ul>\n<li>Minimum 2 years of experience in Procurement, preferably IT networking devices.</li>\n</ul>\n<p><strong>Language Proficiency</strong></p>\n<ul>\n<li>English</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Procurement",
            "IT Hardware",
            "Vendor Management"
        ],
        "summary": "We are seeking a Procurement Executive to handle IT hardware sourcing and vendor management. The role requires strong communication skills and experience in procurement."
    }
]