[
    {
        "job_title": "Creative Designer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22104/312",
        "location": "Infopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<p><strong>Creative Designer</strong></p>\n<p>We are seeking a <strong>Creative Designer</strong> who demonstrates strong visual thinking, originality, and full ownership of their work. The ideal candidate will stay connected to marketing and design trends, think beyond briefs, and deliver high-quality visuals that enhance brand identity and audience engagement. You will collaborate with Marketing, Creative, and Development teams to produce impactful digital and offline design assets.</p>\n<p><strong>Key Responsibilities</strong>\n- Design engaging and high-quality creatives for branding, marketing, and promotional use\n- Create marketing assets (brochures, flyers, posters, social media creatives, website visuals, presentations, email campaigns)\n- Conceptualize ideas and translate them into clear visual communication\n- Own design deliverables from concept to final output\n- Ensure visual consistency across brand touchpoints using brand guidelines\n- Manage multiple projects in parallel while meeting timelines\n- Collaborate with Marketing teams, Creative Leads, and Project Managers on updates and revisions\n- Stay updated with design, branding, marketing trends, and creative tools\n- Use modern design tools to support ideation while maintaining originality and brand alignment\n- Maintain organized design files, versions, and documentation</p>\n<p><strong>Requirements</strong>\n- Diploma or Bachelor’s Degree in Graphic Design, Visual Arts, or related field\n- 2 to 4 years of professional experience in a creative or design role\n- Strong proficiency in Adobe Photoshop, Adobe Illustrator, Adobe InDesign, Adobe Premiere Pro, and After Effects\n- Working knowledge of MS Office tools (PowerPoint, Word)\n- Basic understanding of HTML and CSS\n- Strong typography skills and layout/design principles\n- High attention to detail and visual judgment\n- Excellent verbal and written communication skills</p>\n<p><strong>Creativity, Ownership, and Mindset</strong>\n- Demonstrate quick and creative thinking\n- Take ownership and accountability for assigned work\n- Show self-discipline in reviewing work before submission\n- Accept feedback and iterate on designs efficiently\n- Present and explain design concepts confidently\n- Think beyond briefs and suggest innovative ideas</p>\n<p><strong>Portfolio Requirement</strong>\n- A strong portfolio is mandatory\n- Showcase branding, marketing creatives, and originality\n- Ability to explain design intent, approach, and execution</p>\n<p><strong>Experience</strong>\n- 2 to 4 years of relevant industry experience</p>\n<p><strong>Benefits</strong>\n- Growth-driven environment with opportunities to lead, innovate, and upskill continuously</p>\n<p><strong>Contact</strong>\n- Email: careers@2basetechnologies.com</p>",
        "tags": [
            "2-4 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Adobe InDesign"
        ],
        "summary": "Creative Designer role requiring 2-4 years of experience in branding and marketing design, with expertise in Adobe tools and a strong portfolio."
    },
    {
        "job_title": "Sr.DevSecOps Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22105/312",
        "location": "Infopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<p><strong>Sr. DevSecOps Engineer</strong></p>\n<p>We are seeking a <strong>Senior DevSecOps Engineer</strong> to lead our cybersecurity, infrastructure automation, and DevSecOps practices as we transition to a secure, scalable, and modern engineering environment. This role will strengthen 2Base’s security posture, modernize pipelines, and foster a secure-by-design culture. You will collaborate with engineering, product, and leadership teams to ensure systems, applications, and cloud environments are secure, reliable, and future-ready.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define, implement, and enforce security standards, policies, and best practices across cloud and on-prem environments.</li>\n<li>Conduct security risk assessments, vulnerability scans, penetration testing, and mitigation plans.</li>\n<li>Architect and enhance secure CI/CD pipelines with automated compliance and governance checkpoints.</li>\n<li>Promote a \"Security First\" culture, ensuring secure design and development practices.</li>\n<li>Monitor, detect, investigate, and respond to security threats, incidents, breaches, and anomalies.</li>\n<li>Develop Infrastructure-as-Code practices using Terraform, Ansible, and automation frameworks.</li>\n<li>Design secure cloud architectures on AWS, Azure, or GCP for scalable, compliant deployments.</li>\n<li>Build and secure containerized environments with Docker and Kubernetes, enforcing security baselines.</li>\n<li>Implement secure monitoring, logging, SIEM, and alerting systems for infrastructure and applications.</li>\n<li>Improve system reliability, scalability, performance, and fault tolerance across critical workloads.</li>\n<li>Mentor DevOps engineers in secure development, automation, and operational excellence.</li>\n<li>Lead technical strategy, tool selection, process improvements, and DevSecOps roadmap execution.</li>\n<li>Collaborate with BA, PM, and Engineering teams to align security, performance, and delivery goals.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>4–8 years</strong> of experience in DevOps, Cloud, or Infrastructure engineering with strong security exposure.</li>\n<li>Hands-on CI/CD tools: Jenkins, GitLab CI, GitHub Actions.</li>\n<li>Expertise in AWS, Azure, or GCP with secure architecture focus.</li>\n<li>Proficiency in Infrastructure-as-Code (Terraform, Ansible).</li>\n<li>Experience securing Docker and Kubernetes environments.</li>\n<li>Strong networking knowledge: LAN/WAN, firewalls, VPN, load balancers.</li>\n<li>Familiarity with security frameworks (OWASP, NIST, CIS Benchmarks).</li>\n<li>Experience with monitoring/logging tools: Prometheus, Grafana, ELK, CloudWatch, SIEM.</li>\n<li>Scripting skills: Python, Bash, Shell.</li>\n<li>Excellent troubleshooting, analytical, and problem-solving abilities.</li>\n<li>Strong communication and collaboration skills to influence engineering teams.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4–8 Years",
            "Terraform",
            "Ansible",
            "AWS"
        ],
        "summary": "Lead cybersecurity and infrastructure automation for secure, scalable cloud environments. Requires 4–8 years of DevSecOps experience with expertise in Terraform, Ansible, and AWS."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22106/312",
        "location": "Infopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<p><strong>Senior Business Analyst</strong></p>\n<p>At 2Base, we are rebuilding the Business Analyst function into a world-class, product-minded, clarity-driven team. This role is <strong>not</strong> a documentation role, <strong>not</strong> a screen updater role, and <strong>not</strong> a support role. This is a <strong>core Business Analyst</strong> position responsible for functional modeling, system reasoning, requirement clarity, and building the foundation for correct development.</p>\n<p>As a Senior Business Analyst, you will be the functional brain of the project. You will ensure that the right problem is understood, broken down, analyzed, validated, clarified, communicated, and owned end-to-end. You will drive requirement precision, reduce rework, and enable confident and aligned delivery across teams.</p>\n<p><strong>Key Responsibilities</strong>\n- Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.\n- Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.\n- Convert ambiguous client inputs into structured, logical, and actionable functional understanding.\n- Break large features into modules, workflows, components, and clear dependencies.\n- Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.\n- Translate business processes into functional logic that development teams can execute.\n- Decompose requirements into use-case flows, system behaviors, edge cases, alternate paths, validation rules, and dependencies.\n- Prepare high-quality documentation, including BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API requirement specs, and acceptance criteria.\n- Ensure all documentation is clear, logical, structured, testable, and ready for developers and QA to use.\n- Collaborate closely with developers, architects, QA, and product owners to validate feasibility and align understanding.\n- Ensure QA teams can derive test cases effectively from your functional logic and acceptance criteria.\n- Communicate confidently with clients, handle requirement discussions smoothly, and clarify misunderstandings immediately.\n- Push back politely on unclear or changing requirements and ensure final decisions are documented properly.\n- Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover to development.\n- Own the entire requirement lifecycle from discovery to development readiness with high accountability.\n- Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</p>\n<p><strong>Required Skills &amp; Experience</strong>\n- Minimum 4+ years of core Business Analyst experience with strong analytical and system-level thinking.\n- Ability to break down complex requirements into clear components, workflows, and functional logic.\n- Excellent verbal and written communication with confidence in client interactions and clarifications.\n- Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria with high clarity.\n- Ability to challenge assumptions politely, ask the right questions, and ensure zero ambiguity.\n- Strong collaboration experience with development, QA, architects, and cross-functional teams.\n- Understanding of API behaviors, integrations, data flows, and multi-module system interactions.\n- Ability to run requirement discussions, workshops, and independently lead discovery sessions.\n- Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.\n- Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.\n- Not suitable for UI-only thinkers, passive communicators, template-based writers, or those relying on AI for answers.\n- Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.</p>\n<p><strong>Candidates must align with 2Base’s structured thinking, clarity-driven culture, and transformation of the BA function.</strong></p>\n<p><strong>Minimum Qualifications</strong>\n- Bachelor’s degree in Computer Science, Engineering, Business, or related field\n- 4 to 8 years of experience as a Business Analyst or Product Analyst\n- Experience in SaaS or scalable product environments\n- Exposure to AI/Automation, integrations, or multi-module systems\n- Ability to run independent client workshops\n- Must have independently handled requirement ownership for at least one full project lifecycle</p>\n<p><strong>Benefits</strong>\n- A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "SaaS",
            "API",
            "BRD/FRD/SRS"
        ],
        "summary": "Senior Business Analyst at 2Base drives requirement precision and cross-team alignment through functional modeling, system reasoning, and clear documentation."
    },
    {
        "job_title": "Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22107/312",
        "location": "Infopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<p><strong>Business Analyst</strong></p>\n<p>The Business Analyst plays a key role in ensuring requirements are clearly understood, accurately documented, and traceable throughout the software development lifecycle. This role focuses on translating business and functional inputs into structured, standardized documentation that supports effective development, testing, and delivery. Working closely with business analysts, design teams, and technical stakeholders, the role ensures consistency, clarity, and alignment across all requirement artifacts.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Create Software Requirement Specifications (SRS) based on inputs from Core Business Analysts, stakeholder discussions, and requirement walkthroughs</li>\n<li>Prepare Business Requirement Documents (BRD) using approved templates while ensuring business intent and system behavior are clearly documented</li>\n<li>Participate in requirement discussions to understand business objectives, functional flows, dependencies, and assumptions before documentation</li>\n<li>Analyze requirements to identify gaps, ambiguities, and inconsistencies, and work with Core BAs to resolve them</li>\n<li>Document functional flows, business rules, and acceptance criteria where applicable to support development and QA teams</li>\n<li>Document wireframes, UI flows, validations, and UI specifications in collaboration with design and product teams</li>\n<li>Maintain change logs, version history, and document updates throughout the project lifecycle</li>\n<li>Create and manage traceability matrices linking business, functional, and technical requirements</li>\n<li>Maintain cross-references across BRD, SRS, UI, API, and related documentation</li>\n<li>Ensure documentation consistency, completeness, and alignment with approved scope and delivery timelines</li>\n<li>Ensure accurate and timely PMS updates with structured documentation details</li>\n<li>Support development, QA, UAT, and audit processes through clear, traceable, and up-to-date documentation</li>\n<li>Assist in requirement reviews, walkthroughs, and validation sessions with internal and client stakeholders</li>\n</ul>\n<h2>Requirements</h2>\n<h3>Required Skills and Experience</h3>\n<ul>\n<li>1 to 4 years of experience in Business Analysis documentation or related roles</li>\n<li>Strong experience in BRD and SRS creation</li>\n<li>Hands-on experience with documentation templates, standards, and version control</li>\n<li>Ability to document UI wireframes and functional flows clearly</li>\n<li>Working knowledge of APIs and system integrations for documentation purposes</li>\n<li>Experience with project management systems and documentation tools</li>\n<li>Strong attention to detail and ability to manage multiple documents in parallel</li>\n<li>Excellent written communication and stakeholder coordination skills</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field</li>\n<li>1 to 4 years of experience as a Business Analyst or Product Analyst</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong></p>",
        "tags": [
            "1-4 Years",
            "BRD/SRS Documentation",
            "UI Wireframes & Functional Flows",
            "API Documentation & System Integrations"
        ],
        "summary": "Translates business needs into structured documentation for software development. Ensures clarity, traceability, and alignment across requirements and stakeholder deliverables."
    },
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22108/312",
        "location": "Infopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p>We are seeking a high-performing, self-driven <strong>Senior Business Development Executive</strong> to join our team at <strong>2Base Technologies</strong>. In this role, you will drive revenue by generating leads, building client relationships, and managing the end-to-end sales process for IT services and digital solutions. If you thrive in a tech-driven, consultative sales environment, we want to hear from you!</p>\n<p><strong>Responsibilities</strong>\n- Identify and generate qualified leads via outbound channels, referrals, and market research.\n- Drive new business opportunities for web, mobile, and enterprise software development services.\n- Manage the full sales cycle: lead qualification, client communication, requirement analysis, proposal preparation, pricing, negotiation, and closure.\n- Propose tailored IT and digital transformation solutions aligned with client business objectives.\n- Build relationships with key decision-makers (Founders, CXOs, Product Owners).\n- Collaborate with delivery, design, and marketing teams to craft compelling proposals.\n- Maintain CRM records and provide sales forecasts and reports.\n- Represent the company at networking events and client meetings to enhance visibility.\n- Meet/exceed monthly and quarterly revenue targets consistently.</p>\n<p><strong>Requirements</strong>\n- Bachelor’s degree or equivalent in education/training/experience.\n- <strong>2-5 years</strong> of B2B sales experience in IT services/digital solutions.\n- Proven ability to manage sales pipelines and close deals independently.\n- Strong understanding of software development services (web, mobile, SaaS, enterprise).\n- Experience with international clients preferred.\n- Proficiency in CRM systems (Zoho, HubSpot, Salesforce) and outbound tools (LinkedIn Sales Navigator).\n- Excellent communication, presentation, and negotiation skills.\n- Ability to work autonomously with minimal supervision.\n- Strategic thinker who can address client pain points and position solutions.</p>\n<p><strong>Education &amp; Certifications</strong>\n- Bachelor’s/BSc. in IT/CS/BCA/B-Tech/CS/EC, MBA, or CS/IT diploma.\n- Additional certifications in sales, digital marketing, or business consulting are a plus.</p>\n<p><strong>Contact</strong>: Email your resume to <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-5 Years",
            "B2B Sales",
            "CRM Systems",
            "IT Services Sales"
        ],
        "summary": "Senior Business Development Executive role at 2Base Technologies requires 2-5 years of B2B sales experience in IT services, CRM proficiency, and strategic client relationship management to drive revenue growth."
    },
    {
        "job_title": "UI Designer",
        "company": "Fingent Global Solutions",
        "url": "https://infopark.in/company-jobs/details/22115/83",
        "location": "Infopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<p><strong>UI Designer</strong></p>\n<p>At Fingent, we believe that technology can make a meaningful difference to the lives around us—the lives of those who use it, the lives of those who build it, and to society at large. We create and provide software that is beautiful, usable, and compelling to solve complex business challenges. We nurture smart people who bring out the best in themselves, their peers, and their clients.</p>\n<h3>Skill Set</h3>\n<ul>\n<li>Strong understanding of UI fundamentals: layout, typography, color, spacing, and visual hierarchy</li>\n<li>Proficiency in <strong>Figma</strong> (components, auto-layout, styles); familiarity with <strong>Sketch</strong> or <strong>Adobe XD</strong> is a plus</li>\n<li>Ability to design clean, consistent, and responsive interfaces for web and mobile</li>\n<li>Basic understanding of UX principles, user flows, wireframes, and usability best practices</li>\n<li>Experience working with or following <strong>design systems</strong> and reusable components</li>\n<li>Good communication and presentation skills to explain design decisions clearly</li>\n<li>Ability to collaborate effectively with developers, business analysts, and stakeholders</li>\n<li>Attention to detail with a strong visual sense and quality-focused mindset</li>\n<li>Basic awareness of design handoff and implementation considerations</li>\n<li>A portfolio showcasing UI skills and design thinking</li>\n</ul>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Design user interfaces for web and mobile applications</li>\n<li>Create screens, layouts, components, and icons based on requirements</li>\n<li>Translate ideas, wireframes, and requirements into high-quality UI designs</li>\n<li>Maintain visual consistency using design systems, typography, color, and spacing</li>\n<li>Collaborate with Business Analysts, developers, and product teams</li>\n<li>Present design concepts and explain design decisions clearly</li>\n<li>Iterate designs based on feedback from stakeholders</li>\n<li>Prepare designs for developer handoff and support implementation</li>\n<li>Ensure quality, usability, and attention to detail across all designs</li>\n</ul>\n<p><strong>Experience:</strong> 1-3 years</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@fingent.com</strong>.</p>",
        "tags": [
            "1-3 Years",
            "Figma",
            "Design Systems",
            "UX Principles"
        ],
        "summary": "UI Designer with 1-3 years of experience required to create responsive interfaces using Figma and design systems, collaborating with cross-functional teams to deliver user-centric solutions."
    },
    {
        "job_title": "Odoo Developer (On-site – Qatar)",
        "company": "Infintor Solutions LLP",
        "url": "https://infopark.in/company-jobs/details/22095/380",
        "location": "Infopark",
        "closing_date": "18 Feb 2026",
        "job_description": "<p><strong>Odoo Developer (On-site – Qatar)</strong></p>\n<p>We are seeking experienced <strong>Odoo Developers</strong> to join a high-profile project on-site in Qatar. This opportunity allows you to work within a global environment, representing Infintor while being embedded directly into our client's technical team in Doha.</p>\n<h3>Working Environment</h3>\n<p>As part of our <strong>Staff Augmentation model</strong>, you will be deployed to the client’s office in Qatar. You will collaborate with local stakeholders and international consultants to <strong>customize, implement, and support Odoo solutions</strong>. The role combines high-level technical coding with professional on-site consultancy.</p>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Programming Languages</strong>: Proficiency in <strong>Python</strong> &amp; <strong>JavaScript</strong>.</li>\n<li><strong>Database</strong>: Familiarity with <strong>PostgreSQL</strong>, including object relational mapping.</li>\n<li><strong>Collaboration Platform</strong>: Experience with <strong>GitHub</strong>.</li>\n<li><strong>Development Model</strong>: Familiarity with the open-source approach, collaborating with an external community.</li>\n<li><strong>Framework</strong>: Proficiency in <strong>Odoo</strong>, including ORM, Workflows, Report Engine, BI, and AI.</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop customized solutions for clients across various industries and company sizes.</li>\n<li>Provide ongoing support and maintenance for tailored solutions.</li>\n<li>Adapt our SaaS offerings to meet client requirements.</li>\n<li>Assist in training and supporting our partner network.</li>\n</ul>\n<h3>Must-Have Qualifications</h3>\n<ul>\n<li>Proficiency in multiple programming languages.</li>\n<li>Strong grasp of object-oriented programming, object modeling, and relational databases.</li>\n<li>Passion for software development.</li>\n<li>Ability to learn and adapt quickly.</li>\n<li>Fluency in English.</li>\n<li>Team-oriented mindset.</li>\n</ul>\n<h3>Nice-to-Have Qualifications</h3>\n<ul>\n<li>Self-organized work ethic.</li>\n<li>Bachelor's or Master's degree in a related field.</li>\n<li>Proficiency in Python, JavaScript, HTML, SQL, and UML-like modeling.</li>\n<li>Familiarity with Linux platform.</li>\n</ul>\n<h3>Experience</h3>\n<p><strong>2+ Years</strong></p>\n<p>If you are a dynamic and motivated Odoo Developer with a passion for customization and development, join our talented team at Infintor. Your expertise will help meet the unique needs of our diverse clientele.</p>\n<p><strong>How to Apply</strong>: Send your updated resume to <strong>odoo.developer_qa@infintor.odoo.com</strong>.</p>",
        "tags": [
            "2+ Years",
            "Python",
            "JavaScript",
            "Odoo"
        ],
        "summary": "Odoo Developer in Qatar with 2+ years experience required. Focus on custom solutions, client support, and collaboration in a global team."
    },
    {
        "job_title": "Marketing Executive – Email Campaigns (MBA Fresher)",
        "company": "ThoughtMinds System Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22114/485",
        "location": "Infopark",
        "closing_date": "18 Feb 2026",
        "job_description": "<h2>Marketing Executive – Email Campaigns (MBA Fresher)</h2>\n<p><strong>Department:</strong> Marketing\n<strong>Location:</strong> Kochi\n<strong>Experience:</strong> MBA Fresher (0–1 Year)</p>\n<h3>Role Overview</h3>\n<p>We are seeking enthusiastic MBA graduates to support our marketing team in planning and executing email marketing campaigns. The ideal candidate should have strong communication skills, analytical thinking, and an interest in digital marketing.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Plan, create, and execute email marketing campaigns</li>\n<li>Manage email databases and segmentation</li>\n<li>Monitor campaign performance and prepare reports</li>\n<li>Conduct A/B testing to optimize campaigns</li>\n<li>Coordinate with content and design teams</li>\n<li>Ensure email campaigns align with marketing goals</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>MBA in Marketing</li>\n<li>Strong written and verbal communication skills</li>\n<li>Basic understanding of digital marketing concepts</li>\n<li>Familiarity with MS Excel and reporting</li>\n<li>Willingness to learn marketing automation tools</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Knowledge of email marketing tools (Mailchimp, HubSpot, etc.)</li>\n<li>Basic understanding of lead generation and CRM systems</li>\n</ul>\n<h3>Compensation</h3>\n<p>As per company standards.</p>\n<p><strong>Contact:</strong> Share your updated resume at <a href=\"mailto:shabeek.s@thoughtminds.io\">shabeek.s@thoughtminds.io</a></p>",
        "tags": [
            "0–1 Year",
            "Email Marketing Tools",
            "Digital Marketing",
            "CRM Systems"
        ],
        "summary": "MBA fresher to plan and execute email campaigns. Requires communication, digital marketing, and CRM skills with a focus on analytics and optimization."
    },
    {
        "job_title": "Front End Developer",
        "company": "Mashuptech",
        "url": "https://infopark.in/company-jobs/details/22118/360",
        "location": "Infopark",
        "closing_date": "19 Feb 2026",
        "job_description": "<h2>Front End Developer</h2>\n<p><strong>MashupTech</strong> is seeking a skilled and detail-oriented <strong>Front End Developer</strong> to build modern, responsive, and high-performance web applications. The ideal candidate should have strong expertise in <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>React</strong>, and <strong>Tailwind CSS</strong>, with a passion for creating clean UI and excellent user experiences.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop responsive and user-friendly web interfaces using <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, and <strong>React</strong></li>\n<li>Build reusable UI components and front-end libraries</li>\n<li>Implement designs using <strong>Tailwind CSS</strong> and ensure cross-browser compatibility</li>\n<li>Collaborate with <strong>UI/UX designers</strong> to translate designs into high-quality code</li>\n<li>Integrate front-end components with backend APIs</li>\n<li>Optimize applications for maximum speed and scalability</li>\n<li>Debug, test, and maintain existing front-end code</li>\n<li>Ensure best practices in code quality, performance, and accessibility</li>\n<li>Work closely with backend developers and project managers</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>3–5 years</strong> of hands-on experience in Front End Development</li>\n<li>Strong proficiency in <strong>HTML5</strong>, <strong>CSS3</strong>, <strong>JavaScript (ES6+)</strong></li>\n<li>Extensive experience with <strong>React.js</strong></li>\n<li>Practical experience using <strong>Tailwind CSS</strong></li>\n<li>Good understanding of responsive design and mobile-first development</li>\n<li>Experience with <strong>REST APIs</strong> and <strong>JSON</strong></li>\n<li>Familiarity with <strong>Git/version control systems</strong></li>\n<li>Strong problem-solving and debugging skills</li>\n</ul>\n<h3>Preferred Skills (Added Advantage)</h3>\n<ul>\n<li>Experience with modern build tools (<strong>Vite</strong>, <strong>Webpack</strong>, etc.)</li>\n<li>Knowledge of <strong>UI/UX principles</strong></li>\n<li>Exposure to <strong>Agile/Scrum</strong> development methodology</li>\n<li>Experience in <strong>IT services</strong> or <strong>software development companies</strong></li>\n</ul>\n<h3>How to Apply</h3>\n<p>Click <a href=\"#\">here</a> to apply for the role. If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>career@mashuptech.in</strong>.</p>",
        "tags": [
            "3–5 Years",
            "React.js",
            "Tailwind CSS",
            "JavaScript (ES6+)"
        ],
        "summary": "A Front End Developer with 3-5 years of experience is needed to build responsive web apps using React and Tailwind CSS, collaborating with designers and developers."
    },
    {
        "job_title": "Sales Executive",
        "company": "Woxro",
        "url": "https://infopark.in/company-jobs/details/22102/399",
        "location": "Infopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>Sales Executive Intern</h2>\n<h3>Role Overview</h3>\n<p>We are seeking a motivated and enthusiastic Sales Intern to support our sales and business development activities. This internship offers hands-on experience in B2B sales, lead generation, and client communication.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Research and identify potential leads through LinkedIn and other platforms</li>\n<li>Assist in lead generation and outreach activities</li>\n<li>Support in sending introductory emails and follow-ups</li>\n<li>Maintain and update CRM data</li>\n<li>Coordinate with the marketing and technical team</li>\n<li>Help prepare proposals and presentations</li>\n<li>Attend client meetings (if required)</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Pursuing or recently completed a degree in Business, Marketing, or related field</li>\n<li>Good communication skills (written and verbal)</li>\n<li>Basic knowledge of LinkedIn and MS Office</li>\n<li>Interest in sales, marketing, and business development</li>\n<li>Self-motivated and willing to learn</li>\n</ul>\n<p><strong>Contact:</strong> Apply by sharing your updated resume at jobs@woxro.com</p>",
        "tags": [
            "0-1 Years",
            "LinkedIn",
            "MS Office",
            "Sales"
        ],
        "summary": "Sales Executive Intern supporting B2B sales, lead generation, and client communication. Requires business/marketing degree, LinkedIn/MS Office skills, and sales interest."
    },
    {
        "job_title": "Business Development - Freshers",
        "company": "iLeaf Solutions Pvt Ltd.",
        "url": "https://infopark.in/company-jobs/details/22099/59",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<p><strong>Sales Development Representative (SDR)</strong></p>\n<p><strong>Company</strong>: iLeaf Solutions</p>\n<p>iLeaf Solutions is seeking a high-energy, persistent, and articulate <strong>Sales Development Representative (SDR)</strong> to join our international business development team. With 15 years of excellence in software services and offshore development, we are looking for a dedicated professional to help us expand our footprint within the US market.</p>\n<p><strong>Shift Details</strong>\n- <strong>US Night Shift</strong>: 9 PM – 6 AM or 6 PM – 3 AM\n- Purpose: Ensure real-time engagement with US prospects</p>\n<p><strong>Key Responsibilities</strong>\n- <strong>Outbound Prospecting</strong>: Identify and proactively reach out to key decision-makers (CTOs, VPs of Engineering, and Product Owners) in US-based firms through cold calling, personalized emailing, and LinkedIn outreach.\n- <strong>Lead Qualification</strong>: Vet potential leads to ensure alignment with iLeaf’s core competencies in software development and offshore support.\n- <strong>Appointment Setting</strong>: Schedule discovery calls and technical consultations for the senior sales team, managing complex calendar coordination across multiple US time zones.\n- <strong>Pitching Services</strong>: Articulate iLeaf Solutions’ 15-year value proposition, emphasizing expertise in custom software development and team augmentation.\n- <strong>CRM Data Integrity</strong>: Track outreach activities, lead statuses, and follow-up schedules within the CRM to maintain a seamless sales pipeline.\n- <strong>Market Intelligence</strong>: Gather insights on prospect pain points and industry trends to refine outreach messaging and improve conversion rates.\n- <strong>Target Achievement</strong>: Meet or exceed monthly targets for qualified meetings booked and opportunities generated.</p>\n<p><strong>Contact</strong>: Share your updated resume at <strong>careers@ileafsolutions.com</strong></p>",
        "tags": [
            "0-1 Years",
            "Outbound Prospecting",
            "Lead Qualification",
            "CRM Data Management"
        ],
        "summary": "Freshers sought as SDR to expand US market via outreach, lead generation, and CRM management for iLeaf Solutions' software services."
    },
    {
        "job_title": "Social Media Marketing Executive",
        "company": "Soulxes Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22101/447",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>🚀 Social Media Marketing Executive</h2>\n<p><strong>Company:</strong> Soulxes Technologies Pvt. Ltd.\n<strong>Location:</strong> Infopark, Kochi\n<strong>Experience:</strong> 1 – 3 Years\n<strong>Employment Type:</strong> Full-Time\n<strong>Working Days &amp; Time:</strong> Monday to Friday | 9:00 AM – 6:00 PM</p>\n<p>Soulxes Technologies Pvt. Ltd. is seeking a <strong>creative and results-driven Social Media Marketing Executive</strong> to join our team at Infopark, Kochi. The ideal candidate should have hands-on experience in managing social media platforms and executing digital marketing strategies.</p>\n<h3>🔍 Key Responsibilities:</h3>\n<ul>\n<li>Develop, implement, and manage social media strategies</li>\n<li>Create engaging content (posts, reels, captions, creatives)</li>\n<li>Manage company pages on platforms like Instagram, Facebook, LinkedIn, etc.</li>\n<li>Monitor social media trends and competitor activities</li>\n<li>Run paid campaigns and analyze performance metrics</li>\n<li>Generate leads and improve brand awareness</li>\n</ul>\n<h3>✅ Requirements:</h3>\n<ul>\n<li>1–3 years of experience in social media marketing</li>\n<li>Strong knowledge of social media platforms and analytics tools</li>\n<li>Basic understanding of SEO and digital marketing concepts</li>\n<li>Good communication and creative writing skills</li>\n<li>Experience with design tools (Canva/Adobe) is an added advantage</li>\n</ul>\n<h3>📩 How to Apply:</h3>\n<p>Interested candidates can share their updated resume to <strong>info@soulxes.com</strong></p>\n<p>Join our team and grow your career in digital marketing with Soulxes Technologies! 🚀</p>",
        "tags": [
            "1–3 Years",
            "Social Media Platforms",
            "SEO & Digital Marketing",
            "Design Tools (Canva/Adobe)"
        ],
        "summary": "Creative Social Media Marketing Executive needed for Kochi-based tech firm. Requires 1-3 years of experience in digital campaigns and content creation."
    },
    {
        "job_title": "React Native Developer(Mobile App Developer)(Immediate Joiners Preferred)",
        "company": "Armia Systems Pvt. Ltd",
        "url": "https://infopark.in/company-jobs/details/22096/3",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2><strong>React Native Developer (Mobile App Developer)</strong></h2>\n<p><strong>Company:</strong> Armia Systems Pvt Ltd\n<strong>Location:</strong> Kochi Infopark</p>\n<p><strong>About the Role:</strong>\nArmia Systems Pvt Ltd is seeking experienced React Native developers to collaborate with technical, functional, and industry specialists to create innovative system solutions.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Develop and maintain cross-platform mobile applications using React Native</li>\n<li>Translate UI/UX designs into high-quality, reusable code</li>\n<li>Integrate REST APIs and third-party libraries</li>\n<li>Ensure app performance, quality, and responsiveness</li>\n<li>Debug and resolve application issues and crashes</li>\n<li>Work closely with backend developers and designers</li>\n<li>Publish apps to Google Play Store and Apple App Store</li>\n<li>Participate in code reviews and follow best coding practices</li>\n</ul>\n<h3><strong>Required Skills &amp; Qualifications</strong></h3>\n<ul>\n<li>Solid knowledge in JavaScript (ES6+) and React.js fundamentals</li>\n<li><strong>2 Years</strong> hands-on experience in React Native-based mobile application development</li>\n<li>Experience with AI coding agents like Cursor, Codex, or Claude</li>\n<li>Proficiency in React Native libraries (e.g., Redux or MobX)</li>\n<li>Knowledge of native modules integration (Android/iOS)</li>\n<li>Experience with TypeChecker (Flow or TypeScript)</li>\n<li>Hands-on experience with RESTful APIs and JSON</li>\n<li>Knowledge of app store submission processes for Android and iOS</li>\n<li>At least 2 apps published in App Stores</li>\n<li>Experience handling push notifications (Firebase preferred)</li>\n<li>Debugging and performance optimization skills</li>\n<li>Excellent written and oral communication skills (Mandatory)</li>\n<li>Self-starter and highly motivated</li>\n<li>Ability to work in a dynamic environment and adapt to changes</li>\n<li>Strong analytical and problem-solving skills</li>\n<li>Familiarity with Agile software development methodologies</li>\n</ul>\n<p><strong>Immediate Joiners Preferred</strong></p>\n<p><strong>Contact:</strong>\nEmail your resume to <strong>jobs@armia.com</strong></p>",
        "tags": [
            "2 Years",
            "React Native",
            "RESTful APIs",
            "TypeScript"
        ],
        "summary": "Seeking a React Native Developer to build cross-platform apps, integrate APIs, and publish to app stores. Requires 2+ years of React Native experience and strong coding skills."
    },
    {
        "job_title": "BIM Implementation Specialist",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/22110/107",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>BIM Implementation Specialist</strong></p>\n<p><strong>Relevant Experience:</strong> 4+ years\n<strong>Location:</strong> Kochi, India\n<strong>Employment Type:</strong> Full time</p>\n<p><strong>Profile Summary</strong>\nWe are seeking a proactive and skilled BIM Implementation Specialist to lead the development and execution of BIM strategies across projects. The ideal candidate will bring expertise in BIM tools, standards, and coordination practices to ensure effective collaboration and model management throughout the project lifecycle.</p>\n<p><strong>Key Responsibilities</strong>\n- Develop and manage BIM Execution Plans (BEP/BXP)\n- Implement and enforce BIM workflows and company-wide standards\n- Facilitate coordination meetings and conduct model walkthroughs\n- Perform clash detection and lead issue resolution strategies\n- Ensure alignment with ISO 19650 / PAS 1192 and other relevant BIM standards\n- Provide technical guidance and support to project teams on BIM best practices\n- Meeting facilitation and stakeholder communication</p>\n<p><strong>Skills and Qualifications</strong>\n- Bachelor’s degree in Mechanical / Civil Engineering\n- <strong>Autodesk Revit</strong>\n- <strong>Navisworks</strong>\n- <strong>AutoCAD</strong>\n- <strong>Dynamo</strong> (for Revit automation)\n- <strong>BIM 360 / Autodesk Construction Cloud (ACC)</strong></p>\n<p><strong>Contact</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>jobs@advenser.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "Autodesk Revit",
            "Navisworks",
            "BIM 360 / Autodesk Construction Cloud"
        ],
        "summary": "Lead BIM strategy execution, enforce standards, and provide technical support for project teams using Revit and Navisworks."
    },
    {
        "job_title": "Sr SEO Analyst",
        "company": "Planet Media India ( PMIN Agency Pvt.Ltd.)",
        "url": "https://infopark.in/company-jobs/details/22113/266",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Sr SEO Analyst</h2>\n<h3>Job Summary</h3>\n<p>We are seeking an experienced Sr SEO Analyst to own and drive overall SEO performance across all clients. This role involves leading the SEO team, managing client relationships, defining SEO strategies, ensuring execution excellence, and delivering measurable business results. You will act as the primary decision-maker and escalation point for all SEO-related matters while maintaining high standards of quality, governance, and client satisfaction.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Core Role</strong>: Own overall SEO strategy, quality, delivery, and outcomes across all SEO clients. Act as the strategic owner and escalation point for SEO performance. Ensure consistent growth and ROI through effective SEO initiatives.</li>\n<li><strong>Leadership &amp; Team Management</strong>: Oversee day-to-day operations of the SEO team. Ensure optimal workload distribution, productivity, and quality output. Represent the SEO team in internal and client meetings. Act as the final escalation authority for SEO-related issues.</li>\n<li><strong>Client SEO Ownership</strong>: Own end-to-end SEO performance for assigned and key clients. Drive growth through strategy development, approval, and execution oversight. Ensure SEO activities align with client goals, industry standards, and local markets. Take full accountability for performance outcomes and challenges.</li>\n<li><strong>Strategy &amp; Planning</strong>: Develop and manage SEO roadmaps for key and high-value clients. Define priorities across: Technical SEO, On-page SEO, Off-page SEO, Local SEO, Content SEO. Review performance regularly and optimize strategies using data insights.</li>\n<li><strong>Quality Control &amp; Governance</strong>: Review SEO audits, technical implementations, on-page work, and link-building activities. Ensure compliance with internal SOPs and best practices. Conduct final quality checks before client reporting. Minimize execution, reporting, and process errors.</li>\n<li><strong>Mentorship &amp; Process Management</strong>: Provide continuous feedback and performance reviews. Upskill team members through training and SOP improvements. Maintain standardized documentation and workflows.</li>\n<li><strong>Client Communication &amp; Management</strong>: Manage all SEO-related client communication. Handle coordination, clarifications, and approvals. Gather feedback and translate requirements into actionable tasks. Build long-term client relationships and ensure high satisfaction levels.</li>\n<li><strong>Reporting &amp; Performance Tracking</strong>: Oversee preparation and validation of SEO performance reports. Maintain client trackers and performance dashboards. Ensure data accuracy and consistency. Create, update, and monitor monthly SEO team KPI sheets.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, IT, Business, or related field (preferred).</li>\n<li><strong>5+ years of experience</strong> in SEO, with at least 2 years in a leadership role.</li>\n<li>Strong expertise in technical, on-page, off-page, and local SEO.</li>\n<li>Proficiency in tools such as Google Analytics, Search Console, SEMrush, Ahrefs, Screaming Frog, etc.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Excellent client communication and presentation skills.</li>\n<li>Proven experience managing and mentoring teams.</li>\n<li>Strong documentation and process management abilities.</li>\n</ul>\n<p><strong>Contact</strong>: For inquiries, email your resume to <strong>hr@planetmedia.in</strong>.</p>",
        "tags": [
            "5+ Years",
            "Technical SEO",
            "On-page SEO",
            "Off-page SEO"
        ],
        "summary": "Lead SEO strategy and team for multiple clients, ensuring high-quality execution and client satisfaction. Manage SEO initiatives, mentor teams, and deliver measurable business results through data-driven strategies."
    },
    {
        "job_title": "Project Manager",
        "company": "Experion Technologies",
        "url": "https://infopark.in/company-jobs/details/22116/103",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Project Manager</strong></p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Client Account Management</strong>: Ensure balance between ongoing project delivery and customer relationship maintenance to identify new opportunities.</li>\n<li><strong>Client Management</strong>: Demonstrate confidence in articulation, detailing, and negotiation skills.</li>\n<li><strong>Project Coordination</strong>: Oversee product requirement grooming, development (CI/CD, DevOps, Automated Testing), UAT, rollout, and release phases.</li>\n<li><strong>Technical Expertise</strong>: Experience in web/mobile product development with modern engineering practices.</li>\n<li><strong>Agile Methodology</strong>: End-to-end project delivery using Agile, including grooming, ceremonies, and collaboration with architects, development, and testing teams.</li>\n<li><strong>Team Leadership</strong>: Manage teams of 15–20 resources, fostering professional growth and quality improvement.</li>\n<li><strong>Technical Exposure</strong>: Understand modern web/mobile architecture and development practices.</li>\n</ol>\n<h3>Duties &amp; Responsibilities</h3>\n<ol>\n<li><strong>Delivery &amp; Pre-Sales Ownership</strong>: Balance project execution with new opportunity identification.</li>\n<li><strong>Client Management</strong>: Build trust through proactive communication, business value additions, and quality assurance.</li>\n<li><strong>Scrum Master Role</strong>: Facilitate grooming, sprint planning, daily scrums, demos, and retrospectives.</li>\n<li><strong>Project Metrics</strong>: Track schedules, threats, and commercial margins; prepare invoices and timesheets.</li>\n<li><strong>Pre-Sales Skills</strong>: Collaborate on proposals, case studies, and blogs.</li>\n<li><strong>Communication</strong>: Excellent verbal and written communication with data-driven articulation.</li>\n<li><strong>Travel</strong>: Willingness to travel domestically/internationally for 1–4 weeks.</li>\n<li><strong>Compliance</strong>: Adhere to ISMS policies.</li>\n</ol>\n<h3>Nice to Have</h3>\n<ul>\n<li>Experience in delivery fulfillment, e-commerce, or retail domains.</li>\n</ul>\n<p><strong>Contact</strong>: Share resume at remi.thomas@experionglobal.com</p>",
        "tags": [
            "5+ Years",
            "Agile Methodology",
            "Scrum Master",
            "CI/CD & DevOps"
        ],
        "summary": "Lead end-to-end project delivery for clients using Agile practices, manage 15–20-person teams, and ensure technical and commercial quality in web/mobile product development."
    },
    {
        "job_title": "SSE/Lead Engineer- Python",
        "company": "Experion Technologies",
        "url": "https://infopark.in/company-jobs/details/22117/103",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Job Purpose</h2>\n<p>Be a Lead/Senior Engineer in Python Technology.</p>\n<h2>Job Description</h2>\n<ul>\n<li><strong>Hands-on knowledge</strong>: Django or Flask frameworks.</li>\n<li><strong>Experience in</strong>: Designing &amp; developing microservices-based applications, unit testing (Pytest), DevOps, Agile practices, and code reviews.</li>\n<li><strong>Development expertise</strong>: Minimum 6+ years in Python + one of .NET, NodeJS, Angular.</li>\n<li><strong>Code quality</strong>: Ability to write structured, modularized code.</li>\n<li><strong>Frameworks</strong>: Proficiency in Flask, Django, or similar.</li>\n<li><strong>Database integration</strong>: Experience with MySQL, MariaDB, and NoSQL databases.</li>\n<li><strong>Templating</strong>: Working knowledge of Jinja2.</li>\n<li><strong>Cloud skills</strong>: AWS, Azure APIs (Python) is a plus.</li>\n<li><strong>Design practices</strong>: Passion for best coding practices and innovation.</li>\n<li><strong>Version control</strong>: Git, SVN, or similar tools.</li>\n<li><strong>Nice to have</strong>: DevOps experience.</li>\n</ul>\n<h2>Duties and Responsibilities</h2>\n<ul>\n<li>Lead/mentor in sprints, code reviews, and ensuring code quality.</li>\n<li>Write clean, well-designed code.</li>\n<li>Translate user stories into technical specs and functional code.</li>\n<li>Follow Agile/TDD processes and produce detailed specifications.</li>\n<li>Troubleshoot, optimize, and maintain core software/databases.</li>\n<li>Contribute to all development lifecycle phases.</li>\n<li>Develop/deploy features for procedures/tools.</li>\n</ul>\n<h2>Additional Information</h2>\n<ul>\n<li>Participate in full product cycles: brainstorming, releases, QA, client coordination.</li>\n<li>Thrive in dynamic environments with proactive communication and technical leadership.</li>\n<li>Adhere to ISMS policies.</li>\n</ul>\n<p><strong>Contact</strong>: Share your resume at remi.thomas@experionglobal.com.</p>",
        "tags": [
            "6+ Years",
            "Python",
            "Django/Flask",
            "AWS/Azure"
        ],
        "summary": "Lead/Senior Python Engineer with 6+ years of experience in Django/Flask, microservices, and cloud platforms. Requires Agile practices, code reviews, and full-stack development expertise."
    },
    {
        "job_title": "Business Development Executive",
        "company": "MarketBytes WebWorks Private Limited",
        "url": "https://infopark.in/company-jobs/details/22100/460",
        "location": "Infopark",
        "closing_date": "15 Mar 2026",
        "job_description": "<p>**## Role Overview</p>\n<p>We are seeking a dynamic and result-oriented <strong>Business Development Executive</strong> to join <strong>MarketBytes WebWorks Private Limited</strong>. This role is ideal for candidates passionate about sales, client relationship management, and driving business growth in the <strong>IT and Digital Marketing</strong> industry.</p>\n<p>As a Business Development Executive, you will be responsible for identifying new business opportunities, generating leads, presenting company services, and closing deals. You will work closely with the marketing and technical teams to ensure smooth project onboarding and long-term client satisfaction. The ideal candidate should have strong communication skills, a proactive mindset, and the ability to consistently achieve sales targets.</p>\n<h2>Key Responsibilities:</h2>\n<h3>Business Development &amp; Lead Generation:</h3>\n<ul>\n<li>Identify and generate new business opportunities in IT and digital marketing services.</li>\n<li>Conduct lead generation through cold calling, networking, referrals, and online platforms.</li>\n<li>Research potential clients and understand their business needs.</li>\n</ul>\n<h3>Client Meetings &amp; Presentations:</h3>\n<ul>\n<li>Schedule meetings with prospects and present company services effectively.</li>\n<li>Understand client requirements and propose suitable digital solutions.</li>\n<li>Deliver persuasive presentations and product demonstrations.</li>\n</ul>\n<h3>Proposal &amp; Sales Closure:</h3>\n<ul>\n<li>Prepare customized proposals, quotations, and service documents.</li>\n<li>Follow up consistently with prospects to drive conversions.</li>\n<li>Negotiate terms and close deals efficiently.</li>\n</ul>\n<h3>CRM &amp; Pipeline Management:</h3>\n<ul>\n<li>Maintain and update CRM with accurate lead information.</li>\n<li>Track leads from initial contact to closure.</li>\n<li>Generate sales reports and analyze pipeline performance.</li>\n</ul>\n<h3>Target Achievement &amp; Relationship Management:</h3>\n<ul>\n<li>Achieve monthly and quarterly sales targets.</li>\n<li>Build and maintain long-term client relationships.</li>\n<li>Ensure client satisfaction and identify opportunities for upselling and cross-selling.</li>\n</ul>\n<h2>Preferred Qualifications:</h2>\n<ul>\n<li>BBA / MBA (Marketing, Sales, or related field).</li>\n<li>Prior experience in IT sales, digital marketing sales, or business development is preferred.</li>\n<li>Freshers with strong communication skills and a sales-oriented mindset may also apply.</li>\n</ul>\n<h2>Required Skills:</h2>\n<ul>\n<li>Excellent communication and negotiation skills.</li>\n<li>Strong presentation and interpersonal skills.</li>\n<li>Basic understanding of digital marketing and web development services.</li>\n<li>Target-oriented, self-driven, and proactive mindset.</li>\n<li>Ability to work in a fast-paced, performance-driven environment.</li>\n</ul>\n<h2>What We Offer:</h2>\n<ul>\n<li>Competitive salary with performance-based incentives.</li>\n<li>Career growth opportunities within the organization.</li>\n<li>Exposure to diverse clients across industries.</li>\n<li>Supportive and collaborative work environment.</li>\n<li>Continuous learning and professional development opportunities.</li>\n</ul>\n<p>If you are ambitious, confident, and ready to build a rewarding career in IT sales and business development, we encourage you to apply and grow with us. If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@marketbyteswebworks.com</strong>.</p>",
        "tags": [
            "0-2 Years",
            "IT Sales",
            "Digital Marketing",
            "CRM Management"
        ],
        "summary": "Dynamic Business Development Executive driving IT and digital marketing sales. Achieve targets, manage client relationships, and leverage CRM for growth."
    },
    {
        "job_title": "Hiring: Marketing Executive – Software Sales (ERP for Manufacturing)",
        "company": "Carol Solutions",
        "url": "https://infopark.in/company-jobs/details/22092/435",
        "location": "Infopark",
        "closing_date": "16 Mar 2026",
        "job_description": "<p><strong>Company:</strong> Carol Solutions\n<strong>Location:</strong> Kochi, Kerala\n<strong>Experience:</strong> Minimum 3 Years in Software Sales</p>\n<p><strong>About Us:</strong>\nCarol Solutions is a leading software company with over 25 years of experience specializing in customized ERP solutions for manufacturing industries. We empower businesses to streamline operations through technology-driven solutions.</p>\n<p><strong>Role Overview:</strong>\nWe are seeking a dynamic <strong>Marketing Executive</strong> with strong experience in software/ERP sales, preferably in the manufacturing sector. The ideal candidate will excel in identifying new clients, managing relationships, and achieving sales targets.</p>\n<p><strong>Key Responsibilities:</strong>\n- Identify and approach manufacturing companies for ERP solutions.\n- Conduct product presentations and demos.\n- Build and maintain strong client relationships.\n- Achieve monthly and quarterly sales targets.\n- Coordinate with technical and implementation teams.</p>\n<p><strong>Requirements:</strong>\n- ✅ Minimum 3 years of experience in software or ERP sales.\n- ✅ Excellent communication and presentation skills.\n- ✅ Strong understanding of the manufacturing domain preferred.\n- ✅ Self-motivated and target-driven.</p>\n<p><strong>What We Offer:</strong>\n- Attractive salary with incentives.\n- Growth-oriented environment.</p>\n<p><strong>Contact:</strong>\nShare your resume at <strong>jobs@carolsolutions.com</strong>.</p>",
        "tags": [
            "3+ Years",
            "ERP Sales",
            "Manufacturing Domain",
            "Software Sales"
        ],
        "summary": "Marketing Executive for ERP software sales in manufacturing, requiring 3+ years of experience and client relationship management skills."
    },
    {
        "job_title": "ERP Consulatant",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/22097/401",
        "location": "Infopark",
        "closing_date": "16 Mar 2026",
        "job_description": "<h2>ERP Consultant</h2>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Implementation &amp; Configuration</strong>: Managing the entire implementation lifecycle, including installing, customizing, and configuring ERP software to meet specific business workflows.</li>\n<li><strong>Business Analysis</strong>: Assessing current business processes, identifying gaps, and recommending improvements to enhance efficiency.</li>\n<li><strong>Data Migration &amp; Integration</strong>: Overseeing the secure transfer of data from legacy systems and integrating the ERP with third-party applications.</li>\n<li><strong>Project Management</strong>: Overseeing project timelines, budgets, and resources to ensure successful, timely, and on-budget delivery.</li>\n<li><strong>Training &amp; Support</strong>: Conducting user training, creating documentation, and providing post-implementation support to resolve issues and optimize performance.</li>\n</ul>\n<h3>Qualifications &amp; Skills</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Business, or related fields.</li>\n<li>Proven experience with specific ERP systems (e.g., SAP, Oracle, NetSuite, Microsoft Dynamics 365).</li>\n<li>Strong analytical, problem-solving, and communication skills to translate business needs into technical solutions.</li>\n<li>Knowledge of SQL, database management, and business processes (finance, supply chain).</li>\n</ul>\n<h3>Contact</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>joinus@pearlsofttechnologies.com</strong>.</p>",
        "tags": [
            "7+ Years",
            "SAP",
            "Oracle",
            "Microsoft Dynamics 365"
        ],
        "summary": "ERP Consultant with 7+ years of experience in implementing and configuring ERP systems, managing projects, and providing training to optimize business processes."
    },
    {
        "job_title": "Software Architect",
        "company": "Classic Technologies & Business Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/22093/340",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>The Company</h2>\n<p>CTeBS, a subsidiary of Classic Fashion, is a leading software solution provider to the apparel manufacturing industry globally. Our suite of enterprise-level products, including our flagship <strong>Trendz CMP</strong>, leverages cutting-edge technology to enhance productivity, quality, and efficiency, ensuring our clients achieve unparalleled growth and success. Our journey with Classic Fashion has uniquely positioned us to design technology-enabled products and solutions for the ever-evolving needs of the apparel manufacturing sector, and we are poised for an exciting phase of growth.</p>\n<h2>Job Summary</h2>\n<p>We are looking for a hands-on <strong>Software Architect</strong> who is passionate about building scalable, high-performance software. In this role, you will serve as the bridge between high-level architectural vision and low-level code implementation. Unlike a pure manager, you will remain deeply involved in the code. You will own the technical design for major features, enforce coding standards, and solve the complex problems that stall development teams. You will work closely with the Associate Technical Manager (who handles delivery/metrics) while you ensure the technical integrity of the solution.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Take full architectural responsibility for specific products or core modules (e.g., the <strong>Production Planning Engine</strong> or <strong>Payroll Calculation System</strong>).</li>\n<li>Translate business requirements into technical design documents (TDDs), defining data models, API contracts, and class structures before coding begins.</li>\n<li>Proactively identify \"spaghetti code\" or technical debt in our legacy <strong>Java/MSSQL</strong> systems and design safe refactoring plans to modernize them.</li>\n<li>Be the final approver for critical code merges. You do not just check for bugs; you check for maintainability, security, and scalability.</li>\n<li>Deep dive into database execution plans (<strong>Oracle/MSSQL</strong>) and application logic to optimize slow queries and reduce latency.</li>\n<li>Enforce consistent design patterns (<strong>Singleton, Factory, Observer</strong>, etc.) across the development team to ensure the codebase remains uniform.</li>\n<li>Act as the \"Problem Solver in Chief\" for the development team. When a developer is stuck on a complex logic issue, you provide the solution.</li>\n<li>Mentor Senior Developers on how to write clean, efficient, and testable code. Conduct technical workshops on new frameworks or best practices.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li><strong>8 to 12 years</strong> of software development experience, with at least <strong>2+ years</strong> in a <strong>Software Architect Role</strong>.</li>\n<li>Expert in <strong>Java/J2EE</strong> (<strong>Spring, Hibernate, Multithreading</strong>).</li>\n<li>Strong proficiency in <strong>MSSQL</strong> or <strong>Oracle</strong> (<strong>Stored Procedures, Indexing, Partitioning</strong>).</li>\n<li>Solid understanding of <strong>Angular component architecture</strong> (even if you don't write CSS daily, you understand the data flow).</li>\n<li>Strong grasp of <strong>Object-Oriented Design (OOD)</strong>, <strong>Microservices patterns</strong>, and <strong>RESTful API design</strong>.</li>\n<li>Experience with <strong>CI/CD pipelines</strong> (<strong>Jenkins/GitLab</strong>), <strong>Docker</strong>, and code quality tools (<strong>SonarQube</strong>).</li>\n<li>Proven ability to debug complex production issues (<strong>memory leaks, thread deadlocks</strong>) under pressure.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@ctebs.com</strong>.</p>",
        "tags": [
            "8-12 Years",
            "Java/J2EE",
            "MSSQL/Oracle",
            "Angular"
        ],
        "summary": "Seeking a hands-on Software Architect with 8-12 years of experience in Java, MSSQL/Oracle, and Angular to lead technical design and mentor teams."
    },
    {
        "job_title": "Technical Support Agent",
        "company": "VIPoint Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22094/62",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<p><strong>Position:</strong> Technical Support Agent</p>\n<p><strong>Experience:</strong> 5+ Years</p>\n<p><strong>Summary:</strong> Technical support agents are responsible for helping our customers and free users to work through technical problems and to better understand how our products can accomplish their goals. In doing so, they will also contribute to our feedback loop by identifying and logging bugs, in addition to other general user feedback including feature requests and pain points. Technical support agents will use the insight they gain through talking to customers to contribute to the overall improvement of our team internally and to our user experience through documentation and other tool, process, or product improvements.</p>\n<p><strong>Responsibilities</strong>\n- Respond to support requests via email, chat, and our wordpress.org forums to solve technical issues and guide users through setting up and using our plugins to accomplish their goals\n- Meet team standards related to work volume, SLAs, and quality\n- Take ownership of work, work independently, and use available resources to get through roadblocks to complete assignments\n- Report feedback received during support interactions, including feature requests, bugs, and user pain points, following the appropriate processes\n- Contribute to the growth of the support team by assisting teammates and creating internal documentation\n- Contribute regularly to improving our public documentation by identifying, logging, and completing needed updates to the knowledgebase\n- Strive for continuous improvement in both technical and customer service skills</p>\n<p><strong>General Skills, Competencies, and Qualifications</strong>\n- Excellent communication skills in English\n- Ability to efficiently solve problems that don't have pre-documented answers\n- Clear communication of technical concepts to non-technical users\n- Ability to communicate information from non-technical users to our engineers, with the technical detail they need to understand the issue\n- Outstanding customer service skills</p>\n<p><strong>Contact Information</strong>\n- Send your CV to <a href=\"mailto:hr@vipointsolutions.net\">hr@vipointsolutions.net</a>\n- If this opportunity aligns with your career goals, kindly share your updated resume with us at <a href=\"mailto:hr.vipointsolutions@gmail.com\">hr.vipointsolutions@gmail.com</a></p>",
        "tags": [
            "5+ Years",
            "WordPress",
            "Problem-Solving",
            "Customer Service"
        ],
        "summary": "Technical Support Agent provides technical assistance and feedback to improve products and user experience."
    },
    {
        "job_title": "Digital Marketing Specialist",
        "company": "Cabot Technology Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/22098/64",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Digital Marketing Specialist</h2>\n<p>We’re seeking a dynamic <strong>Senior Digital Marketing Specialist</strong> to lead and elevate our digital marketing strategy. This role combines a deep understanding of digital marketing with strategic thinking, data-driven insights, and the ability to lead cross-functional teams. The ideal candidate will have a strong track record of executing and optimizing SEO, paid media, social media, and CMS strategies while driving measurable business growth. If you're a leader with a passion for digital innovation, this is the role for you!</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead and oversee the development and execution of comprehensive digital marketing strategies across <strong>SEO</strong>, <strong>paid media</strong> (Google Ads, Meta Ads, etc.), <strong>social media</strong>, and <strong>CMS</strong>.</li>\n<li>Manage and mentor a team of digital marketers, setting clear objectives, performance standards, and guiding the team in executing high-impact campaigns.</li>\n<li>Drive strategic direction for <strong>SEO optimization</strong>, including advanced on-page and off-page strategies, keyword research, and content alignment with business goals.</li>\n<li>Lead the planning, budgeting, and execution of paid media campaigns, ensuring ROI and performance optimization across channels.</li>\n<li>Oversee the design and implementation of complex websites and landing pages, working closely with design and content teams to align with business objectives.</li>\n<li>Develop and execute social media strategies to increase engagement, brand awareness, and conversions.</li>\n<li>Lead cross-functional teams to design and optimize marketing automation workflows and oversee CRM integrations for lead nurturing and conversion.</li>\n<li>Analyse, interpret, and present campaign performance data, generating actionable insights to continuously improve campaigns.</li>\n<li>Stay up to date with the latest trends, technologies, and best practices in digital marketing to ensure the company stays ahead of the curve.</li>\n<li>Manage relationships with external vendors and agencies as needed for specialized projects or initiatives.</li>\n<li>Own key performance indicators (KPIs), ensuring alignment with broader company goals, and drive continuous improvement based on data insights.</li>\n</ul>\n<h3>Skills You Need:</h3>\n<ul>\n<li><strong>Advanced SEO Expertise</strong>: Proven experience in developing and executing advanced SEO strategies, including on-page, off-page, technical SEO (site audits, Core Web Vitals, schema markup, etc.), and local SEO.</li>\n<li><strong>Paid Media Mastery</strong>: Hands-on experience with Google Ads, Meta Ads, and other paid media platforms; expertise in campaign optimization, A/B testing, audience segmentation, and budget management.</li>\n<li><strong>Social Media Strategy</strong>: Strong knowledge in social media strategy, content creation, community engagement, and campaign analytics to drive measurable results.</li>\n<li><strong>Analytics and Reporting</strong>: Advanced proficiency in Google Analytics 4 (GA4), Tag Manager, UTM tracking, data analysis, and creating dashboards to track performance and report insights.</li>\n<li><strong>CMS and Web Development</strong>: Experience managing websites with CMS platforms like WordPress, Webflow, or similar, including optimizing user experience and improving conversion rates.</li>\n<li><strong>Leadership</strong>: Proven ability to lead and inspire a team, with strong project management skills and the ability to manage multiple projects simultaneously.</li>\n<li><strong>Marketing Automation/CRM</strong>: Expertise in marketing automation platforms (e.g., HubSpot, Marketo, Salesforce, etc.) to create personalized customer journeys and optimize lead nurturing.</li>\n<li><strong>Cross-Functional Collaboration</strong>: Ability to work closely with product, sales, and content teams to ensure alignment and synergy across all marketing channels.</li>\n<li><strong>Strategic Vision</strong>: Strong analytical mindset with the ability to think strategically and execute hands-on, balancing creative and data-driven approaches.</li>\n<li><strong>Communication &amp; Presentation Skills</strong>: Strong written and verbal communication skills, with experience in presenting to stakeholders and executive teams.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Solid experience in digital marketing, with a proven track record of managing and optimizing large-scale campaigns.</li>\n<li>Experience in a leadership role, managing and mentoring teams, and collaborating with cross-functional teams to drive marketing initiatives.</li>\n<li>Strong understanding of the digital marketing landscape, trends, and tools.</li>\n</ul>\n<p><strong>Experience</strong>: 7-10 years</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@cabotsolutions.com</strong>.</p>",
        "tags": [
            "7-10 Years",
            "SEO",
            "Paid Media",
            "CMS/Web Development"
        ],
        "summary": "Lead digital marketing strategies across SEO, paid media, and CMS. Drive growth through data-driven campaigns and team leadership."
    },
    {
        "job_title": "Senior Electrical Engineer-BIM",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/22109/107",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Senior Electrical Engineer - BIM</h2>\n<p><strong>Relevant Experience:</strong> 5+ years\n<strong>Location:</strong> Kochi, Bangalore\n<strong>Employment Type:</strong> Full time</p>\n<h3>Profile Summary</h3>\n<p>Electrical Senior BIM Engineer with strong expertise in <strong>Revit</strong> and <strong>Navisworks</strong> and solid knowledge of power, lighting, and ELV systems. Experienced in coordinated BIM modeling, shop drawings, clash resolution, and leading electrical deliverables to meet quality and project timelines.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and manage electrical BIM models</li>\n<li>Review designs and ensure model accuracy</li>\n<li>Perform clash detection and coordination</li>\n<li>Prepare shop drawings, schedules, cable routing, and quantity take-offs</li>\n<li>Lead deliverables and support junior team members</li>\n<li>Coordinate with teams, consultants, and clients</li>\n<li>Maintain BIM standards and ensure timely delivery</li>\n</ul>\n<h3>Skills and Requirements</h3>\n<ul>\n<li><strong>BE / B.Tech</strong> in Electrical Engineering</li>\n<li>Proficiency in <strong>Revit</strong>, <strong>Navisworks</strong>, <strong>BIM 360 / ACC</strong></li>\n<li>Electrical systems expertise: power, lighting, ELV, grounding</li>\n<li>Knowledge of BIM standards, LOD, ISO 19650, COBie</li>\n<li>Strong coordination, leadership, and problem-solving skills</li>\n<li>Effective communication, time management, adaptability</li>\n</ul>\n<p><strong>Contact:</strong> Share your updated resume at <a href=\"mailto:jobs@advenser.com\">jobs@advenser.com</a></p>",
        "tags": [
            "5+ Years",
            "Revit",
            "Navisworks",
            "BIM 360 / ACC"
        ],
        "summary": "Senior Electrical Engineer with BIM expertise in Revit and Navisworks, managing electrical models, coordination, and leading deliverables to meet project timelines."
    },
    {
        "job_title": "Engineer-Precast Detailing- (Revit)",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/22111/107",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Profile Summary</h2>\n<p>Advenser is seeking an experienced <strong>Revit Precast Detailer</strong> (5–9 years) to join our <strong>Kochi, India</strong> team. The role involves producing accurate precast detailing primarily in <strong>Autodesk Revit</strong>, supported by <strong>AutoCAD</strong>. Responsibilities include creating and managing precast families, preparing <strong>BBS</strong>, coordinating with engineering teams, and ensuring all models and drawings meet international standards. The ideal candidate must be proficient in <strong>Revit-based precast workflows</strong>, with strong knowledge of precast reinforced concrete detailing and the ability to deliver high-quality outputs efficiently.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Strong expertise in <strong>Autodesk Revit</strong> &amp; precast detailing.</li>\n<li>Knowledge of international codes &amp; standards.</li>\n<li>Experience in <strong>family creation</strong>.</li>\n<li>Good communication &amp; coordination skills.</li>\n</ul>\n<h2>Skills and Requirements</h2>\n<ul>\n<li><strong>5–9 years</strong> in rebar detailing and reinforced concrete structures.</li>\n<li>Strong knowledge of <strong>AutoCAD</strong>, <strong>RebarCAD</strong>, <strong>CADS RC</strong>, and <strong>Tekla Structures</strong>.</li>\n<li>Expert in <strong>BBS preparation</strong> and detailing standards.</li>\n<li>Strong communication and leadership skills.</li>\n<li>Familiarity with <strong>BIM workflows</strong> (preferred).</li>\n<li><strong>B.Tech in Civil Engineering</strong></li>\n</ul>\n<p><strong>Contact:</strong> For inquiries, reach out to <strong>jobs@advenser.com</strong>.</p>",
        "tags": [
            "5-9 Years",
            "Autodesk Revit",
            "AutoCAD",
            "Tekla Structures"
        ],
        "summary": "Advenser seeks a Revit Precast Detailer with 5-9 years' experience to produce accurate precast models in Revit, coordinate with engineering teams, and ensure compliance with international standards."
    },
    {
        "job_title": "Sr. Java Developer",
        "company": "Dooth Internet Service Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/22112/438",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Senior Java Developer</h2>\n<p><strong>Company Overview</strong>\nDooth is a private internet platform dedicated to protecting online privacy. We believe privacy should not be traded as a commodity for profit. Our mission is to safeguard user data against exploitation by internet companies, ensuring privacy remains a fundamental right in the Age of the Internet of Things.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Experience:</strong> 7+ years</li>\n<li>Design, develop, and maintain robust, scalable, and high-performance Java-based applications.</li>\n<li>Lead technical design discussions and contribute to architectural decisions.</li>\n<li>Develop and consume RESTful Web Services and integrate third-party APIs.</li>\n<li>Write clean, maintainable, and efficient code following best practices.</li>\n<li>Implement unit and integration testing using JUnit, Mockito, and similar libraries.</li>\n<li>Optimize application performance and troubleshoot production issues.</li>\n<li>Collaborate with cross-functional teams (UI/UX, QA, DevOps).</li>\n<li>Mentor junior developers and conduct code reviews.</li>\n<li>Ensure adherence to coding standards, security practices, and CI/CD processes.</li>\n</ul>\n<h3>Technical Skills Required:</h3>\n<ul>\n<li>Strong experience in <strong>Spring Framework</strong> (Spring Core – Dependency Injection, Annotations, XML Configuration).</li>\n<li>Extensive hands-on experience with <strong>Spring Boot</strong>, <strong>Spring JDBC</strong>, and <strong>Spring Hibernate ORM</strong>.</li>\n<li>Proven experience in developing applications using <strong>RESTful Web Services</strong>.</li>\n<li>Experience with application servers like <strong>Apache Tomcat</strong>.</li>\n<li>Expertise in <strong>MySQL</strong> database design, query optimization, and performance tuning.</li>\n<li>Proficiency in front-end technologies: <strong>HTML5</strong>, <strong>CSS3</strong>, <strong>JavaScript</strong>, <strong>jQuery</strong>, <strong>AJAX</strong>, <strong>JSON</strong>, and <strong>Bootstrap</strong>.</li>\n<li>Experience with <strong>Git</strong> and ticket tracking tools (Redmine, Backlog).</li>\n<li>Knowledge of <strong>microservices architecture</strong>, <strong>Docker</strong>, and <strong>CI/CD pipelines</strong> is a plus.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Strong communication and leadership skills.</li>\n<li>Ability to manage multiple projects and meet deadlines.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, share your updated resume at <strong>thrindia@dooth.com</strong>.</p>",
        "tags": [
            "7+ Years",
            "Spring Framework",
            "Spring Boot",
            "RESTful Web Services"
        ],
        "summary": "Senior Java Developer with 7+ years of experience leading scalable application development, mentoring teams, and utilizing Spring Framework and RESTful services. Focus on enterprise solutions and privacy-driven innovation at Dooth."
    },
    {
        "job_title": "Technical Architect",
        "company": "White Rabbit Group",
        "url": "https://infopark.in/company-jobs/details/22103/149",
        "location": "Infopark",
        "closing_date": "31 May 2026",
        "job_description": "<p><strong>Technical Architect</strong></p>\n<p><strong>Experience:</strong> 10+ Years | <strong>Location:</strong> Kochi</p>\n<h3>What we're looking for</h3>\n<p>Join us to help shape scalable, high-performing, and future-ready technology solutions across our engineering landscape. We’re seeking a Technical Architect who combines deep technical expertise with strong architectural thinking and leadership maturity. This role plays a critical part in defining solution direction, guiding engineering teams, and ensuring technical excellence across projects and platforms.</p>\n<p>If you thrive on solving complex technical challenges, influencing engineering standards, and building systems that are scalable, secure, and sustainable, we would like to talk to you!</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Define and drive solution architecture across multiple projects, ensuring scalability, performance, security, and maintainability.</li>\n<li>Provide architectural oversight and hands-on technical guidance across CMS platforms, UI frameworks, APIs, and cloud-based systems.</li>\n<li>Translate business objectives and functional requirements into clear architectural blueprints and implementation strategies.</li>\n<li>Collaborate with Sales, Delivery, and Engineering teams to support pre-sales discussions, technical estimations, and structured solutioning.</li>\n<li>Review and validate key technical decisions, ensuring alignment with engineering standards and long-term maintainability.</li>\n<li>Mentor senior engineers and technical leads, fostering a culture of technical excellence, discipline, and innovation.</li>\n<li>Evaluate emerging technologies and recommend pragmatic adoption strategies aligned with business goals.</li>\n<li>Champion engineering best practices including code quality, DevOps standards, CI/CD governance, and architectural consistency.</li>\n<li>Contribute to strengthening engineering processes that improve predictability, scalability, and delivery quality.</li>\n<li>Represent technical expertise confidently in client engagements and stakeholder discussions.</li>\n<li>Balance multiple initiatives while maintaining strong organisational discipline and architectural integrity.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>9 years of experience in software engineering and architecture.</li>\n<li>Demonstrated experience providing architectural leadership and mentoring engineering teams and following a structured, proactive, and disciplined leadership approach.</li>\n<li>Strong architectural expertise across CMS platforms, UI frameworks, Web APIs, PHP, .NET, and Cloud technologies (AWS, Azure).</li>\n<li>Excellent client-facing experience with the ability to confidently present and defend technical decisions.</li>\n<li>Solid experience with Cloud-native architectures, Microservices, CI/CD pipelines, and DevOps practices.</li>\n</ul>\n<h3>Bonus Points</h3>\n<ul>\n<li>Experience contributing to technology strategy and roadmap planning.</li>\n<li>Exposure to scaling engineering practices across multiple teams.</li>\n<li>Multi-cloud architectural experience (AWS, Azure, GCP).</li>\n<li>Background in designing systems capable of handling high traffic and complex integrations.</li>\n<li>Experience collaborating closely with Sales and Business teams in strategic solutioning.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Hybrid WFH policy</li>\n<li>Health insurance</li>\n<li>Employee Well-being &amp; Assistance Program</li>\n<li>40+ Paid Off days</li>\n<li>Year-end leave encashment</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@whiterabbit.group</strong>.</p>",
        "tags": [
            "10+ Years",
            "Cloud Technologies (AWS, Azure)",
            "CMS Platforms",
            "Microservices"
        ],
        "summary": "A Technical Architect with 10+ years of experience is needed to lead scalable solutions, mentor teams, and ensure technical excellence across cloud-native and CMS platforms."
    },
    {
        "job_title": "Graphic Designer",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27766",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>TRENSER Technology Solutions (P) Ltd</h2>\n<p><strong>Address:</strong> Thejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.trenser.com\">http://www.trenser.com</a>\n<strong>Contact Email:</strong> <a href=\"mailto:careers@trenser.com\">careers@trenser.com</a></p>\n<h3>Graphic Designer</h3>\n<p><strong>Closing Date:</strong> 28 Feb 2026\n<strong>Published:</strong> 17 Feb 2026</p>\n<h4>About the Role</h4>\n<p>We are seeking a <strong>creative and detail-oriented Graphic Designer</strong> to join our team. The ideal candidate will support branding, marketing, and product design initiatives by creating visually engaging digital assets aligned with business goals.</p>\n<h4>Key Responsibilities</h4>\n<ul>\n<li>Design graphics for websites, mobile apps, social media, presentations, and marketing materials</li>\n<li>Create UI elements such as icons, banners, and layouts for digital products</li>\n<li>Collaborate with developers, marketers, and product teams to translate requirements into visual designs</li>\n<li>Maintain brand consistency across all visual outputs</li>\n<li>Assist in creating promotional materials including brochures, infographics, and email creatives</li>\n<li>Edit and enhance images, illustrations, and visual content</li>\n<li>Stay updated with design trends, tools, and technologies</li>\n</ul>\n<h4>Preferred Skills</h4>\n<ul>\n<li>Bachelor’s degree or diploma in any relevant field</li>\n<li>Proficiency in design tools such as Adobe Photoshop, Illustrator, and Figma</li>\n<li>Basic understanding of UI/UX principles</li>\n<li>Strong creativity, typography, and layout skills</li>\n<li>Ability to manage multiple tasks and meet deadlines</li>\n<li>Good communication and teamwork skills</li>\n</ul>",
        "tags": [
            "Not Specified",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Figma"
        ],
        "summary": "Creative Graphic Designer to create digital assets and maintain brand consistency. Requires proficiency in design tools and collaboration with cross-functional teams."
    },
    {
        "job_title": "BDE-Remote",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/27765",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Picky Assist (P) Ltd</strong>\n<strong>Location</strong>: T-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<strong>Website</strong>: <a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a>\n<strong>Closing Date</strong>: 28 Feb 2026\n<strong>Job Published</strong>: 17 Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@pickyassist.com\">careers@pickyassist.com</a>\n<strong>WhatsApp</strong>: <a href=\"https://wa.me/18302680508?text=careers\">Apply via WhatsApp</a></p>\n<h2>Job Overview</h2>\n<p>We are seeking a dynamic and customer-focused <strong>Business Development Executive</strong> with strong communication skills in <strong>English and Hindi</strong>. The candidate will be responsible for acquiring new customers, delivering product demonstrations, and maintaining strong client relationships.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Identify and generate new business leads (SMEs to MNCs)</li>\n<li>Fix online appointments and conduct virtual meetings</li>\n<li>Prepare customized product presentations and solutions</li>\n<li>Deliver product demos via <strong>Google Meet/Zoom</strong></li>\n<li>Participate in seminars and exhibitions (as required)</li>\n<li>Close sales and achieve targets</li>\n<li>Coordinate with the support team for client follow-ups</li>\n<li>Maintain strong customer relationships and collect feedback</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Sales / Marketing / Business Development knowledge</li>\n<li>Excellent communication and listening skills (<strong>Hindi &amp; English mandatory</strong>)</li>\n<li>Confident presentation skills</li>\n<li>Go-getter attitude with willingness to learn</li>\n<li>Professional and pleasing personality</li>\n</ul>\n<h2>Eligibility &amp; Qualifications</h2>\n<ul>\n<li>Bachelor’s Degree (Preferred). B.Tech/Diploma candidates may apply</li>\n<li><strong>Minimum 1 year experience</strong> in business development (Preferred)</li>\n<li>Freshers with strong communication skills are welcome</li>\n<li>Basic understanding of technology in business applications</li>\n<li>Looking for candidates from <strong>North India</strong> (Fluent Hindi required)</li>\n</ul>\n<h2>Work Setup (Remote) – Mandatory Requirements</h2>\n<ul>\n<li>Wired internet connection</li>\n<li>Dedicated home office setup</li>\n<li>Good mobile network</li>\n<li>Laptop/Desktop with webcam</li>\n</ul>\n<h2>Work Timings</h2>\n<ul>\n<li>Monday to Friday</li>\n<li>9:30 AM – 6:30 PM</li>\n</ul>\n<h2>Salary &amp; Benefits</h2>\n<ul>\n<li>₹20,000 – ₹30,000 per month (Based on experience &amp; interview performance)</li>\n<li>Sales incentives</li>\n<li>Mobile &amp; data allowance</li>\n<li>Annual performance-based increments</li>\n<li>Career growth opportunities</li>\n</ul>\n<h2>Apply Now</h2>\n<ul>\n<li>Email: <a href=\"mailto:careers@pickyassist.com\">careers@pickyassist.com</a></li>\n<li>WhatsApp: <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></li>\n</ul>",
        "tags": [
            "1+ Years",
            "Business Development",
            "Sales",
            "Communication (Hindi/English)"
        ],
        "summary": "Remote Business Development Executive role requiring Hindi/English communication skills to acquire clients and deliver product demos. 1+ years sales/business development experience preferred."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/27764",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Picky Assist (P) Ltd</strong>\n<strong>Picky Assist Pvt Ltd</strong>\n<em>(Kerala Startup Mission)</em>\nT-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<a href=\"https://www.pickyassist.com\">Visit Website</a></p>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@pickyassist.com\">careers@pickyassist.com</a></p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Drive new client acquisition and expand market presence</li>\n<li>Lead, mentor, and performance-manage the business development team</li>\n<li>Develop sales strategies and revenue forecasts</li>\n<li>Identify new market opportunities through research and analysis</li>\n<li>Conduct high-level client meetings, negotiations, and contract closures</li>\n<li>Collaborate with marketing for campaigns and lead generation</li>\n<li>Monitor pipeline, track KPIs, and report to executive leadership</li>\n<li>Ensure smooth onboarding and long-term client success</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>2–5 years</strong> in Sales/Business Development</li>\n<li>Minimum <strong>2–3 years</strong> in Technology/SaaS in a managerial role</li>\n<li>Bachelor’s degree in Business, Marketing, or related field</li>\n<li>Strong leadership and team management skills</li>\n<li>Excellent communication in English &amp; Hindi (foreign language is a plus)</li>\n<li>Experience using CRM tools and sales reporting systems</li>\n</ul>\n<h3>Ideal Candidate</h3>\n<ul>\n<li>Strategic thinker with strong analytical skills</li>\n<li>Confident negotiator with enterprise-level clients</li>\n<li>Strong coaching and team-building abilities</li>\n<li>Target-driven with a high-performance mindset</li>\n</ul>\n<p><strong>Location:</strong> Edapazhinji, Trivandrum\n<strong>Work Hours:</strong> Monday–Friday | 9:30 AM – 6:30 PM\n<strong>Salary:</strong> As per industry standards</p>\n<p><strong>Apply Now</strong>\n<a href=\"mailto:careers@pickyassist.com\">Email: careers@pickyassist.com</a> or <a href=\"https://wa.me/18302680508?text=careers\">WhatsApp</a></p>",
        "tags": [
            "2-5 Years",
            "Business Development",
            "Sales Strategy",
            "CRM Tools"
        ],
        "summary": "Lead sales growth and team management for a SaaS startup. Requires 2-5 years in sales/BD and CRM experience."
    },
    {
        "job_title": "Business Growth Executive",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/27763",
        "location": "Technopark",
        "closing_date": "25 Feb 2026",
        "job_description": "<h2>Picky Assist (P) Ltd</h2>\n<p><strong>Picky Assist Pvt Ltd</strong>\n<strong>( Kerala Startup Mission)</strong>\nT-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom , 695581\n<a href=\"https://www.pickyassist.com\">Visit Website</a></p>\n<p><strong>Closing Date:</strong> 25, Feb 2026\n<strong>Job Published:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@pickyassist.com\">careers@pickyassist.com</a></p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and acquire new B2B clients across South India</li>\n<li>Conduct high-impact demos, solution presentations &amp; technical discussions</li>\n<li>Translate business requirements into scalable API-based solutions</li>\n<li>Coordinate with internal solution teams to ensure smooth onboarding</li>\n<li>Own revenue targets and contribute to growth strategy</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Engineering graduate with understanding of APIs &amp; integrations</li>\n<li>6+ months experience in SaaS Sales / Technical Sales</li>\n<li>Strong business communication skills (<strong>English mandatory</strong>)</li>\n<li>Confident in client-facing demos &amp; solution selling</li>\n<li>Customer-centric with a consultative approach</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Willingness to travel across South India</li>\n<li>Own 2-wheeler with valid license</li>\n<li>Personal laptop</li>\n</ul>\n<h3>Apply Now</h3>\n<ul>\n<li>Email: <a href=\"mailto:careers@pickyassist.com\">careers@pickyassist.com</a></li>\n<li>WhatsApp: <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></li>\n<li>WhatsApp: <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></li>\n</ul>",
        "tags": [
            "6+ Months",
            "SaaS Sales",
            "API Integrations",
            "Technical Sales"
        ],
        "summary": "Business Growth Executive at Picky Assist seeks SaaS sales professionals with API integration expertise to drive B2B client acquisition and revenue growth in South India."
    },
    {
        "job_title": "Software Tester",
        "company": "Orisysindia Consultancy Services (P) Ltd",
        "url": "https://technopark.org/job-details/27762",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Company:</strong> Orisysindia Consultancy Services (P) Ltd\n<strong>Address:</strong> D3, 6th Floor, Bhavani Building\n<strong>Website:</strong> http://www.orisys.in\n<strong>Contact Email:</strong> recruitment@orisys.in</p>\n<h2>Job Details</h2>\n<p><strong>Job Title:</strong> Software Tester\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Published Date:</strong> 17, Feb 2026\n<strong>Location:</strong> Technopark\n<strong>Work Mode:</strong> Work from Office</p>\n<h2>Job Summary</h2>\n<p>We are seeking a detail-oriented and proactive <strong>Software Tester</strong> with <strong>2–5 years of experience</strong> in manual testing and a strong grasp of coding principles. The ideal candidate should thrive in <strong>Agile/Scrum environments</strong> and ensure high-quality software delivery through rigorous testing practices.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Analyze requirements, user stories, and technical specifications.</li>\n<li>Design, develop, and execute detailed test cases and scenarios.</li>\n<li>Perform comprehensive manual testing of web and/or mobile applications.</li>\n<li>Identify, document, and track defects through resolution.</li>\n<li>Collaborate with developers, product owners, and business analysts.</li>\n<li>Participate in Agile/Scrum ceremonies (Sprint Planning, Daily Stand-ups, Retrospectives).</li>\n<li>Conduct regression, functional, integration, and system testing.</li>\n<li>Ensure product quality aligns with business and technical requirements.</li>\n<li>Contribute to continuous improvement of testing processes.</li>\n</ul>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>2–5 years</strong> of software testing experience.</li>\n<li>Strong manual testing expertise.</li>\n<li>Understanding of SDLC and STLC.</li>\n<li>Agile/Scrum methodology experience.</li>\n<li>Basic to intermediate coding knowledge (Java/Python/JavaScript).</li>\n<li>SQL query writing for database validation.</li>\n<li>Experience with bug tracking tools (JIRA, Bugzilla).</li>\n<li>Analytical, problem-solving, communication, and documentation skills.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Scrum-based project experience.</li>\n<li>API testing tools (Postman).</li>\n<li>Basic automation testing knowledge.</li>\n<li>ISTQB certification (preferred, not mandatory).</li>\n</ul>\n<h2>Soft Skills</h2>\n<ul>\n<li>Strong attention to detail.</li>\n<li>Independent and team-oriented work ethic.</li>\n<li>Time management and multitasking abilities.</li>\n<li>Proactive, quality-focused mindset.</li>\n</ul>",
        "tags": [
            "2–5 Years",
            "Manual Testing",
            "Agile/Scrum",
            "Java/Python/JavaScript"
        ],
        "summary": "A Software Tester with 2–5 years of manual testing experience is needed to ensure quality delivery in Agile/Scrum environments through thorough testing and collaboration."
    },
    {
        "job_title": "Business Operations Executive (Fresher)",
        "company": "Techstas Global Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27761",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Techstas Global Innovations (P) Ltd</h2>\n<p><strong>Address:</strong> Module 9, -2 Floor, Thejaswini Building, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://www.techstas.com\">https://www.techstas.com</a></p>\n<h3>Job Title: Business Operations Executive (Fresher)</h3>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> career@techstas.com</p>\n<h3>Brief Description</h3>\n<p>Techstas Global Innovations Private Limited is seeking a responsible and well-organized fresher to support billing activities, client coordination, agreement preparation, and daily business operations. The selected candidate will handle Tally entries, prepare quotations and invoices, maintain documentation, and update client work status regularly. This role is ideal for candidates who are detail-oriented, eager to learn, and interested in building a career in business operations and administration.</p>\n<h3>Job Responsibilities</h3>\n<p><strong>Billing and Accounts</strong>\n- Enter sales transactions, receipts, and payment details in Tally.\n- Prepare quotations, invoices, and payment receipts.\n- Maintain accurate billing and payment records.\n- Assist in tracking outstanding payments and follow-ups when required.</p>\n<p><strong>Agreement and Documentation</strong>\n- Generate client agreements using the company’s standard format.\n- Maintain proper documentation of client agreements and related records.\n- Organize and update digital and physical files systematically.</p>\n<p><strong>Client Coordination</strong>\n- Communicate with clients regarding project updates and work status.\n- Maintain client-wise work status in the system or CRM.\n- Coordinate with internal teams to ensure smooth workflow and timely updates.</p>\n<p><strong>Operations Support</strong>\n- Assist in daily business operations and administrative tasks.\n- Maintain accurate operational data and records.\n- Provide support to management in operational and coordination activities.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Basic knowledge of computers and MS Office.</li>\n<li>Familiarity with Tally (preferred, not mandatory for freshers).</li>\n<li>Good communication skills in English, Malayalam, and Tamil.</li>\n<li>Strong coordination and organizational skills.</li>\n<li>Responsible, disciplined, and detail-oriented.</li>\n<li>Willingness to learn and adapt to new systems and processes.</li>\n</ul>\n<h3>Qualification</h3>\n<ul>\n<li>Any Degree or Diploma.</li>\n<li>Freshers are preferred.</li>\n</ul>\n<h3>Languages Required</h3>\n<ul>\n<li>English</li>\n<li>Malayalam</li>\n<li>Tamil</li>\n</ul>\n<h3>Application Process</h3>\n<p>Interested candidates are requested to send their updated resume to <strong>career@techstas.com</strong> with the email subject line: <strong>Business Operations Executive (Fresher)</strong>. Applications without the proper email subject may be put on hold or rejected.</p>",
        "tags": [
            "Freshers",
            "Tally",
            "MS Office",
            "Multilingual Communication"
        ],
        "summary": "Support billing, client coordination, and documentation for business operations. Requires freshers with basic computer skills and multilingual communication."
    },
    {
        "job_title": "BUSINESS DEVELOPMENT EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27760",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<p><strong>Company Information</strong></p>\n<p><strong>Trainonex Solutions (P) Ltd</strong>\nGround Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala - 695581\n<strong>Website</strong>: <a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a>\n<strong>Contact Email</strong>: trainonexsolutions.hr@gmail.com\n<strong>Closing Date</strong>: 20, Feb 2026\n<strong>Job Published</strong>: 17, Feb 2026</p>\n<p><strong>Job Title</strong>: Business Development Executive</p>\n<p><strong>Brief Description</strong>\nWe are seeking a motivated and dynamic <strong>Business Development Executive</strong> to drive growth through new business opportunities, client relationship building, and operational support.</p>\n<p><strong>Key Responsibilities</strong>\n- Identify and approach potential vendors for business opportunities.\n- Conduct vendor calls to explain company services.\n- Create and manage professional content for company communications.\n- Demonstrate strong proficiency in MS Office software.\n- Conduct client meetings and maintain positive business relationships.\n- Handle client calls with persuasive pitch techniques.\n- Support day-to-day operational and coordination activities.\n- Develop lead generation strategies to attract potential clients.</p>\n<p><strong>Qualifications</strong>\n- Any degree (freshers welcome).\n- Basic computer knowledge and MS Office proficiency.\n- Strong communication and negotiation skills.\n- Ability to build rapport and maintain long-term relationships.\n- Goal-oriented, confident, and self-motivated.\n- Basic understanding of sales and vendor management.</p>\n<p><strong>Experience Required</strong>: 0-1 years\n<strong>Gender Preference</strong>: Male and Female candidates preferred\n<strong>Basic Pay</strong>: ₹12,000 - ₹15,000/month\n<strong>Note</strong>: Office work only</p>\n<p><strong>What We Offer</strong>\n- 💰 <strong>Performance-Based Incentives</strong>: Earn rewards for your dedication and achievements.\n- 🎉 <strong>Fun Fridays</strong>: Engaging team activities to kick off the weekend.\n- 🎈 <strong>Special Occasion Celebrations</strong>: Celebrate milestones and birthdays together.\n- 🤝 <strong>Supportive Team Environment</strong>: Collaborate with passionate professionals.\n- 📈 <strong>Career Development</strong>: Access training and growth opportunities.</p>\n<p><strong>Application Instructions</strong>\n- Email your resume to trainonexsolutions.hr@gmail.com\n- <strong>Subject Line</strong>: \"Application for Business Development Executive\"</p>\n<p><strong>Preferred Skills</strong>\n- Strong communication and negotiation skills\n- Relationship-building expertise\n- Goal-oriented mindset\n- Sales and vendor management knowledge</p>",
        "tags": [
            "0-1 Years",
            "Business Development",
            "MS Office Proficiency",
            "Vendor Management"
        ],
        "summary": "A Business Development Executive role at Trainonex Solutions requires lead generation, client relationship management, and operational support with opportunities for performance-based incentives and career growth."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27759",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>TRAINONEX SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<h3>Walk-In Details</h3>\n<p><strong>Position:</strong> TELESALES EXECUTIVE\n<strong>Date:</strong> 20, Feb 2026\n<strong>Time:</strong> 10:30:00 AM - 12:30:00 PM\n<strong>Job Published:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3>Job Description</h3>\n<p>We are seeking an energetic and confident <strong>Telesales Executive</strong> to join our growing team. This role is ideal for individuals passionate about sales and customer interaction. As a Telesales Executive, you will:\n- Make outbound calls to potential and existing customers\n- Promote products/services professionally and clearly\n- Explain product features, pricing, and benefits effectively\n- Handle customer queries and provide accurate information\n- Follow up on leads and maintain customer records\n- Build and maintain strong customer relationships</p>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> 0–1 year (Freshers welcome)</li>\n<li>Immediate joiners preferred</li>\n<li>Open to male and female candidates</li>\n<li><strong>Fluency in Malayalam required</strong></li>\n<li>Willingness to work from the office</li>\n<li><strong>Basic Pay:</strong> ₹14,000/- to ₹20,000/-</li>\n<li>Performance-based incentives</li>\n</ul>\n<h3>Application Instructions</h3>\n<ul>\n<li>Apply with the subject line: <strong>“Telesales Executive”</strong></li>\n</ul>\n<h3>Walk-In Venue</h3>\n<p><strong>TECHNOPARK PHASE 1, CARNIVAL BUILDING, GROUND FLOOR, KAZHAKUTTAM, TRIVANDRUM, 695581</strong></p>\n<h3>Entry Pass Instructions</h3>\n<ol>\n<li>Apply for the entry pass via <a href=\"http://vms.technopark.in\">vms.technopark.in</a> or the Technopark mobile app (Android <a href=\"#\">here</a> / iOS <a href=\"#\">here</a>).</li>\n<li>The entry pass will be sent to your registered mobile/email.</li>\n<li>Show the softcopy at the Technopark Entrance Gate.</li>\n<li><strong>Hardcopy option:</strong> Use the 5-digit OTP received via SMS/email at self-operating kiosks near the Reception Building.</li>\n</ol>\n<p><strong>Note:</strong> Original certificates will be verified at the entry gate.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Confident and professional telephone etiquette</li>\n<li>Ability to handle rejection positively and remain self-motivated</li>\n<li>Strong customer interaction and relationship-building skills</li>\n<li>Excellent verbal communication skills</li>\n<li>Effective time management and organizational abilities</li>\n</ul>",
        "tags": [
            "0-1 Year",
            "Malayalam",
            "Telesales",
            "Customer Relationship Management"
        ],
        "summary": "Seeking a 0-1 year experienced Telesales Executive fluent in Malayalam to drive sales through outbound calls and customer engagement."
    },
    {
        "job_title": "Graphic Designer Junior",
        "company": "Movytech Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27758",
        "location": "Technopark",
        "closing_date": "17 Mar 2026",
        "job_description": "<p><strong>Movytech Innovations (P) Ltd</strong>\nFourth Floor, CDAC Building, Technpark Phase 1, Thiruvananthapuram, 695581\n<a href=\"https://movytech.co\">Company Website</a></p>\n<p><strong>Job Title</strong>: Graphic Designer Junior\n<strong>Closing Date</strong>: 17, Mar 2026\n<strong>Published On</strong>: 17, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:hr@movytech.co\">hr@movytech.co</a></p>\n<h3>What You’ll Be Designing</h3>\n<ul>\n<li>Creative flyers &amp; posters that don’t look recycled</li>\n<li>Brochures &amp; marketing collaterals that make sense when printed</li>\n<li>Mockups &amp; presentations that sell ideas clearly</li>\n<li>Social media creatives (static + motion)</li>\n<li>Brand visuals that stay consistent instead of random</li>\n</ul>\n<h3>What We Care About (More Than Your Resume)</h3>\n<ul>\n<li>Your portfolio (mandatory — no exceptions)</li>\n<li>Your ability to explain why you designed something a certain way</li>\n<li>Speed without killing quality</li>\n<li>Clean files, proper layers, correct exports</li>\n<li>Consistency — good design once is luck, good design repeatedly is skill</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Adobe Photoshop</strong> – Real compositing, not just text-on-image</li>\n<li><strong>Adobe Illustrator</strong> – Vectors, icons, layouts</li>\n<li><strong>After Effects</strong> – Basic motion, logo animations, reels</li>\n<li><strong>CapCut</strong> – Fast, social-first video edits</li>\n<li>Plus any other tools you actually know how to use</li>\n</ul>\n<h3>Apply Only If</h3>\n<ul>\n<li>You have <strong>6 months – 3 years</strong> of hands-on experience</li>\n<li>You have a portfolio link (Behance, Drive, website — anything clean)</li>\n<li>You’re ready to design, not just talk about design</li>\n</ul>\n<p><strong>Application Link</strong>: <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfKexRSd1t_zLQybn8yIyUDRLwVV8WO2yKBD1B7Qff7N5nPoQ/viewform?usp=sharing&amp;ouid=116218732465483188910\">Apply Here</a> (Mandatory)</p>",
        "tags": [
            "6 Months – 3 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "After Effects"
        ],
        "summary": "Junior graphic designer role requiring 6 months–3 years of experience, focusing on creative design, social media content, and brand consistency using Adobe tools."
    },
    {
        "job_title": "Associate, Finance and Accounts",
        "company": "Zyxware Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27757",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company:</strong> Zyxware Technologies (P) Ltd\n<strong>Location:</strong> SBC 2205, II Floor, Yamuna Building, Technopark Phase III, Trivandrum, 695583\n<strong>Website:</strong> <a href=\"http://www.zyxware.com\">www.zyxware.com</a>\n<strong>Contact Email:</strong> <a href=\"mailto:careers@zyxware.com\">careers@zyxware.com</a>\n<strong>Closing Date:</strong> 27, Feb 2026\n<strong>Published Date:</strong> 17, Feb 2026</p>\n<h3>Role Overview</h3>\n<p>At Zyxware Technologies, we empower organizations through digital transformation by leveraging expertise in Business, Engineering, and Experience. We are seeking an <strong>Associate, Finance and Accounts</strong> to join our Corporate team. The ideal candidate will have <strong>2+ years of experience</strong> and a <strong>B.Com / M.Com / CA-Inter</strong> qualification.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Assist in preparing financial statements and MIS reports.</li>\n<li>Establish and maintain accounting procedures and controls.</li>\n<li>Monitor accounting systems for optimization.</li>\n<li>Manage accounts receivables and follow-ups.</li>\n<li>Analyze revenue/expenditure trends and recommend budget controls.</li>\n<li>Prepare client invoices for application development.</li>\n<li>Handle financial data input for automated systems.</li>\n<li>Maintain fixed asset records (capitalization, depreciation, amortization).</li>\n<li>Collaborate with auditors for internal and external audits.</li>\n<li>Execute statutory compliances (TDS, PF, GST, Softex, SEZ, FIRC, Income Tax).</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Knowledge of finance, accounting, budgeting, and cost control principles (GAAP).</li>\n<li>Proficiency in <strong>QuickBooks</strong> and <strong>ZohoBooks</strong> for bookkeeping.</li>\n<li>Experience in EOU (Export Oriented Unit) operations.</li>\n<li>Excellent English communication (verbal/written).</li>\n<li>Ability to liaise with auditors and financial institutions.</li>\n<li>Hands-on experience with <strong>MS Office/Google Sheets</strong>.</li>\n<li>Voucher preparation for payments, receipts, and journals.</li>\n</ul>\n<h3>Application Details</h3>\n<p>Apply via <a href=\"mailto:careers@zyxware.com\">careers@zyxware.com</a> by 27, Feb 2026.</p>",
        "tags": [
            "2+ Years",
            "QuickBooks",
            "ZohoBooks",
            "MS Office/Google Sheets"
        ],
        "summary": "Seeking an Associate, Finance and Accounts with 2+ years of experience to manage accounting, statutory compliance, and financial reporting for a digital transformation firm in Trivandrum."
    },
    {
        "job_title": "Senior Cloud Engineer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27756",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>TECHVANTAGE SYSTEMS (P) Ltd</h2>\n<p><strong>Module L1A, Level -1, Thejaswini, Technopark, Trivandrum</strong>\n<strong>2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581</strong>\n<a href=\"http://www.techvantagesystems.com\">http://www.techvantagesystems.com</a></p>\n<h3>Senior Cloud Engineer</h3>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<h3>Brief Description</h3>\n<p>We are building a dedicated Cloud Operations (CloudOps) function to establish strong operational ownership, governance discipline, and financial accountability across a complex Azure environment. The Senior Cloud Engineer will be part of the founding CloudOps team and will serve as an operational authority responsible for platform reliability, governance enforcement, cost control, and risk management. This role is focused on protecting the Azure estate, enforcing guardrails, and translating business risk into technical controls.</p>\n<p>This is not a DevOps enablement or application delivery role. The mandate is to ensure structured, auditable, and cost-governed cloud operations by clearly defining boundaries between CloudOps, Platform Engineering, and Application Development teams.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ol>\n<li><strong>Azure Operational Ownership</strong></li>\n<li>Own Azure operational reliability, uptime, and overall platform readiness across production and non-production environments</li>\n<li>Ensure structured environment management across subscriptions and management groups</li>\n<li>\n<p>Maintain formal operational discipline including runbooks, SOPs, and change control processes</p>\n</li>\n<li>\n<p><strong>Incident &amp; Risk Management</strong></p>\n</li>\n<li>Lead incident response and coordinate major incident handling</li>\n<li>Perform root cause analysis (RCA) and drive permanent remediation</li>\n<li>\n<p>Establish preventive controls to reduce recurring incidents</p>\n</li>\n<li>\n<p><strong>Governance &amp; Guardrails Enforcement</strong></p>\n</li>\n<li>Design and enforce Azure governance guardrails including:<ul>\n<li>Azure Policy</li>\n<li>RBAC</li>\n<li>Privileged Identity Management (PIM)</li>\n<li>Naming conventions</li>\n<li>Tagging standards</li>\n</ul>\n</li>\n<li>Identify and remediate governance drift</li>\n<li>Correct over-permissioned access models and unsafe deployment pipelines</li>\n<li>\n<p>Ensure strict separation of operational responsibilities between CloudOps, Platform Engineering, and Application teams</p>\n</li>\n<li>\n<p><strong>FinOps &amp; Cost Accountability</strong></p>\n</li>\n<li>Own FinOps execution across the Azure estate</li>\n<li>Drive rightsizing initiatives and cost optimization programs</li>\n<li>Manage reservations and savings plans</li>\n<li>Implement cost allocation and spend accountability models</li>\n<li>\n<p>Enforce cost guardrails aligned to business risk tolerance</p>\n</li>\n<li>\n<p><strong>AKS Platform Operations</strong></p>\n</li>\n<li>Operate Azure Kubernetes Service (AKS) with strong platform ownership</li>\n<li>Implement scaling discipline and node-level cost optimization</li>\n<li>\n<p>Define and enforce workload responsibility boundaries</p>\n</li>\n<li>\n<p><strong>Infrastructure as Code Governance</strong></p>\n</li>\n<li>Oversee operational integrity of IaC deployments (ARM, Bicep, Terraform)</li>\n<li>Ensure IaC aligns with governance, compliance, and security controls</li>\n<li>Prevent bypass of guardrails through automation pipelines</li>\n</ol>\n<h3>Preferred Skills</h3>\n<p><strong>Mandatory Skill Set</strong>\n- 6+ years of hands-on Azure experience with direct production accountability\n- Strong ownership of:\n  - Azure Subscriptions\n  - Management Groups\n  - Networking Architecture\n  - Identity &amp; Access Management (IAM)\n- Deep understanding of Azure governance frameworks\n- Hands-on experience with:\n  - Azure Policy\n  - RBAC\n  - PIM\n  - Azure Landing Zones\n- Strong FinOps knowledge including rightsizing, reservations, savings plans, and cost optimization strategies\n- Operational experience with Azure Kubernetes Service (AKS)\n- Strong knowledge of Infrastructure as Code:\n  - ARM\n  - Bicep\n  - Terraform\n- Experience identifying and correcting governance drift\n- Experience handling over-permissioned environments and risky access models\n- Strong incident management and root cause analysis capability\n- Clear understanding that Operations, DevOps, and Development are separate disciplines</p>\n<p><strong>Good to Have Skill Set</strong>\n- Experience building Azure governance operating models from scratch\n- Exposure to multi-subscription enterprise Azure estates\n- Experience implementing Azure cost allocation models\n- Automation scripting (PowerShell / Azure CLI)\n- Exposure to audit and compliance frameworks\n- Experience in regulated environments</p>\n<h3>Mandatory Certifications</h3>\n<ul>\n<li>AZ-305 – Azure Solutions Architect Expert</li>\n<li>AZ-104 – Azure Administrator</li>\n<li>AZ-140 – Azure Virtual Desktop</li>\n<li>AZ-900 – Azure Fundamentals</li>\n<li>ITIL 4 Foundation (Strongly Preferred)</li>\n</ul>",
        "tags": [
            "6+ Years",
            "Azure Policy",
            "Azure Kubernetes Service (AKS)",
            "Infrastructure as Code (IaC)"
        ],
        "summary": "Senior Cloud Engineer role focused on Azure governance, FinOps, and platform reliability. Requires 6+ years of Azure experience with mandatory certifications and governance expertise."
    },
    {
        "job_title": "AI/ ML Engineer",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27755",
        "location": "Technopark",
        "closing_date": "17 Mar 2026",
        "job_description": "<p><strong>Company:</strong> ZL Software Systems (P) Ltd\n<strong>Address:</strong> C-22, 2nd Floor, Thejaswini Building, Phase-1 Campus, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a></p>\n<p><strong>Job Title:</strong> AI/ML Engineer\n<strong>Closing Date:</strong> 17, Mar 2026\n<strong>Published Date:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> careerstvm@zlinkcorp.com</p>\n<h3>Job Description</h3>\n<ul>\n<li>Strong experience in <strong>Data Analytics and Modeling</strong></li>\n<li>Strong knowledge and experience with <strong>SQL queries</strong> and <strong>Database Management Systems (SQL Server)</strong></li>\n<li>Strong experience in <strong>GenAI, LLMs (OpenAI, Hugging Face, etc.)</strong> and their integration through APIs or fine-tuning for domain-specific use cases</li>\n<li>Experience with <strong>Apache Spark</strong>, <strong>PySpark</strong>, and distributed data processing</li>\n<li>Strong programming skills in <strong>Python</strong> (preferred), with experience in AI/ML frameworks like <strong>scikit-learn</strong>, <strong>Hugging Face Transformers</strong>, or <strong>Keras</strong></li>\n<li>Experience with <strong>MLOps tools</strong>, <strong>version control (Git)</strong>, and basic <strong>cloud services</strong> (preferably Azure)</li>\n<li>Proficiency in <strong>Data extraction using natural language prompts</strong> using LLM pipelines</li>\n<li>Excellent problem-solving skills and an independent, ownership-driven attitude</li>\n<li>Knowledge in <strong>Azure AI studio</strong>, <strong>Visual Studio Copilot</strong></li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s or master’s degree in <strong>Computer Science</strong>, <strong>Data Science</strong>, or related field</li>\n<li>3–7 years of relevant hands-on experience in <strong>AI/ML</strong>, <strong>data engineering</strong>, or <strong>intelligent automation</strong></li>\n</ul>",
        "tags": [
            "3–7 Years",
            "GenAI/LLMs",
            "Python",
            "Apache Spark/PySpark"
        ],
        "summary": "AI/ML Engineer with 3–7 years of experience in data analytics, LLMs, and cloud services. Requires expertise in Python, Spark, and MLOps tools."
    },
    {
        "job_title": "Senior .Net Full Stack Developer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27754",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Company:</strong> TECHVANTAGE SYSTEMS (P) Ltd\n<strong>Location:</strong> Module L1A, Level -1, Thejaswini, Technopark, Trivandrum &amp; 2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.techvantagesystems.com\">http://www.techvantagesystems.com</a>\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Senior .Net Full Stack Developer</strong> to join our engineering team. The ideal candidate will design, develop, and maintain scalable web applications using modern .NET and Angular frameworks, with expertise in real-time application development and AI-driven tools.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain scalable backend services using <strong>.NET 8+ / .NET Core</strong> and Web APIs.</li>\n<li>Build responsive, high-performance front-end applications using <strong>Angular 16+</strong>.</li>\n<li>Implement real-time features using <strong>SignalR</strong> for live updates and notifications.</li>\n<li>Develop clean, maintainable, and testable code following <strong>SOLID principles</strong> and design patterns.</li>\n<li>Own and manage the full <strong>Software Development Life Cycle (SDLC)</strong>.</li>\n<li>Build and maintain <strong>CI/CD pipelines</strong> using <strong>Azure DevOps</strong> or <strong>GitHub Actions</strong>.</li>\n<li>Monitor, troubleshoot, and optimize application performance using <strong>Azure App Insights</strong> or <strong>Datadog</strong>.</li>\n<li>Leverage <strong>AI-assisted development tools</strong> (e.g., GitHub Copilot) to enhance productivity and code quality.</li>\n<li>Collaborate with cross-functional teams to deliver scalable solutions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Core Technologies:</strong>\n- Strong expertise in <strong>.NET Core / .NET 6/8</strong>\n- Proficiency in <strong>C#</strong>, <strong>TypeScript</strong>, <strong>HTML5</strong>, <strong>CSS/SCSS</strong>\n- Experience with <strong>Angular 16+</strong>\n- Solid understanding of <strong>RESTful API design</strong>, authentication, and security protocols\n- Hands-on experience with <strong>SignalR</strong> or <strong>WebSocket-based technologies</strong></p>\n<p><strong>Cloud &amp; DevOps:</strong>\n- Experience with <strong>Azure App Services</strong>, <strong>Azure Functions</strong>, <strong>Azure Key Vault</strong>\n- Hands-on knowledge of <strong>Azure DevOps</strong> or <strong>GitHub Actions</strong>\n- Ability to diagnose and resolve performance issues using <strong>Azure App Insights</strong> or <strong>Datadog</strong></p>\n<p><strong>Nice to Have:</strong>\n- Experience with <strong>Semantic Kernel</strong> and <strong>LLM-based applications</strong>\n- Advanced usage of <strong>GitHub Copilot</strong>\n- Experience with <strong>SQL Server</strong>, <strong>PostgreSQL</strong>, or <strong>Cosmos DB</strong>\n- Exposure to <strong>AI-driven</strong> or <strong>real-time enterprise applications</strong></p>\n<h3>What We’re Looking For</h3>\n<ul>\n<li>Strong analytical and problem-solving skills</li>\n<li>Ability to work independently and take ownership of deliverables</li>\n<li>Experience in <strong>Agile/Scrum</strong> environments</li>\n<li>Excellent communication and collaboration skills</li>\n<li>Passion for continuous learning and adopting emerging technologies</li>\n</ul>",
        "tags": [
            "5+ Years",
            ".NET Core",
            "Angular",
            "Azure DevOps"
        ],
        "summary": "Senior .Net Full Stack Developer required to design and maintain scalable web applications using .NET, Angular, and Azure DevOps, with expertise in real-time features and AI-driven tools."
    },
    {
        "job_title": "Automation Engineer(C#, Playwright)",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27753",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>TECHVANTAGE SYSTEMS (P) Ltd</strong></p>\n<p><strong>Module L1A, Level -1, Thejaswini, Technopark, Trivandrum</strong>\n<strong>2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581</strong>\n<a href=\"http://www.techvantagesystems.com\">http://www.techvantagesystems.com</a></p>\n<p><strong>Automation Engineer (C#, Playwright)</strong></p>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced Automation Engineer with expertise in <strong>C#</strong>, <strong>Selenium</strong>, and <strong>Playwright</strong> to design, develop, and maintain automated test frameworks for web applications. The role requires hands-on automation experience, a strong testing mindset, and the ability to work independently in a fully remote environment.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain automated test scripts using <strong>C#</strong>, <strong>Selenium</strong>, and <strong>Playwright</strong>.</li>\n<li>Build and enhance automation frameworks for web applications.</li>\n<li>Execute automated test suites and analyze test results.</li>\n<li>Identify, log, and track defects, and collaborate with developers to resolve issues.</li>\n<li>Perform functional, regression, and integration testing using automation tools.</li>\n<li>Review test cases and ensure adequate test coverage.</li>\n<li>Integrate automated tests with CI/CD pipelines.</li>\n<li>Maintain test documentation and automation reports.</li>\n<li>Collaborate with cross-functional teams in an Agile environment.</li>\n<li>Continuously improve automation processes, tools, and best practices.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>4+ years</strong> of experience in test automation.</li>\n<li>Strong hands-on experience with <strong>C#</strong> programming.</li>\n<li>Solid experience in <strong>Selenium</strong> and <strong>Playwright</strong> for web automation.</li>\n<li>Good understanding of test automation frameworks and design patterns.</li>\n<li>Experience in testing web applications and APIs.</li>\n<li>Familiarity with CI/CD tools and version control systems.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Excellent communication skills and ability to work independently in a remote setup.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "C#",
            "Selenium",
            "Playwright"
        ],
        "summary": "Automation Engineer with C# and Playwright expertise to design test frameworks and collaborate in Agile environments remotely."
    },
    {
        "job_title": "Content Writer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27752",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Content Writer</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic individual to join our team as a Content Writer. If you have a passion for writing and a talent for creating compelling content, this is your moment to shine. Join one of the fastest-growing digital and content marketing teams in Technopark, work with a diverse, inclusive team from India and the U.S., gain exposure to global content strategies, and grow with an award-winning product company recognized for excellence in product quality, innovation, and achievement.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Write compelling content for our website, blogs, and UX (user experience) copy that enhances the user journey</li>\n<li>Research industry trends and user insights to develop fresh, engaging content ideas</li>\n<li>Collaborate with the product, design, and dev teams to create content that aligns with business and user needs</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>A passion for writing with excellent English writing and editing skills</li>\n<li>1-2 years of experience in content writing, copywriting, or journalism</li>\n<li>A portfolio of previous work</li>\n<li>Ability to work efficiently under deadlines and deliver high-quality content</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US</li>\n<li>Opportunity to make a meaningful impact across 10+ million users</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company</li>\n<li>Competitive compensation</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Email:</strong> careers@way.com</li>\n<li><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/content-writer\">https://waydot.greythr.com/hire/jobs/content-writer</a></li>\n<li><strong>Closing Date:</strong> 31, Mar 2026</li>\n<li><strong>Job Published:</strong> 17, Feb 2026</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Content Writing",
            "Copywriting",
            "UX Writing"
        ],
        "summary": "Way.com seeks a Content Writer to create engaging content for their automotive super app, supporting 10+ million users with innovative solutions. The role offers growth in a fast-paced, award-winning tech environment."
    },
    {
        "job_title": "Senior Content Writer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27751",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3><strong>Job Title:</strong> Senior Content Writer</h3>\n<h3><strong>Work Arrangement:</strong> On-site</h3>\n<h3><strong>Employment Type:</strong> Full-time</h3>\n<h3><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</h3>\n<h3><strong>Closing Date:</strong> 31, Mar 2026</h3>\n<h3><strong>Contact Email:</strong> careers@way.com</h3>\n<h3><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/senior-content-writer\">https://waydot.greythr.com/hire/jobs/senior-content-writer</a></h3>\n<h3><strong>Role Overview</strong></h3>\n<p>We are seeking a dynamic <strong>Senior Content Writer</strong> to join our team at one of Technopark’s fastest-growing product companies. You’ll create high-impact digital and UX content reaching millions of American consumers. Collaborate with a diverse, inclusive team from India and the U.S., gain exposure to global content strategies, and grow with an award-winning product company recognized for excellence in innovation and achievement.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Craft UX and product copy across web, app, and platform experiences (onboarding, flows, CTAs, error states, system messaging)</li>\n<li>Write clear, concise, conversion-focused content for B2C users and B2B partners</li>\n<li>Partner with product managers, designers, engineers, and business teams to translate complex functionality into intuitive user experiences</li>\n<li>Contribute to long-form and short-form content, ensuring consistent voice, clarity, and usability</li>\n<li>Use user insights, product context, and business goals to inform copy decisions</li>\n<li>Maintain and evolve content standards for quality and scalability across the product</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li><strong>3+ years</strong> of experience in UX writing, product content, or content design</li>\n<li>Strong understanding of UX principles, information hierarchy, and user-centered writing</li>\n<li>Experience writing for B2C and B2B audiences</li>\n<li>Ability to simplify complex ideas into clear, actionable language</li>\n<li>Comfort working in fast-moving product environments with multiple stakeholders</li>\n<li>A portfolio demonstrating UX thinking (not just marketing copy)</li>\n</ul>\n<h3><strong>Why You Will Love Working with Us</strong></h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong></li>\n<li>Impact across <strong>10+ million users</strong></li>\n<li>Dynamic, fast-paced, innovation-driven work culture</li>\n<li>Clear pathways for career growth in a rapidly scaling tech company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/senior-content-writer\">https://waydot.greythr.com/hire/jobs/senior-content-writer</a></p>",
        "tags": [
            "3+ Years",
            "UX Writing",
            "Product Content",
            "Content Design"
        ],
        "summary": "Senior Content Writer needed to create high-impact digital content for a leading automotive app. Requires 3+ years of UX writing experience and collaboration with cross-functional teams."
    },
    {
        "job_title": "Customer Success Executive - Need Immediate Joiners",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27750",
        "location": "Technopark",
        "closing_date": "22 Feb 2026",
        "job_description": "<h2>Way.com - Customer Success Executive</h2>\n<p><strong>Company</strong>: Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide.</p>\n<p><strong>Location</strong>: 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>\n<p><strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused <strong>Customer Success Executive</strong> to join our voice process team. This role involves delivering exceptional customer service via phone, email, chat, and social media channels.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Address customer queries through <strong>phone, email, chat, and social media</strong>.</li>\n<li>Troubleshoot and resolve customer concerns efficiently.</li>\n<li>Handle inquiries related to <strong>products, orders, returns, and general support</strong>.</li>\n<li>Maintain accurate <strong>customer records and feedback</strong> in the CRM system.</li>\n<li>Escalate complex issues to internal teams.</li>\n<li>Track <strong>customer satisfaction metrics</strong> and suggest improvements.</li>\n<li>Ensure all interactions reflect professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>2-5 years</strong> of experience in customer service or similar roles.</li>\n<li>Excellent <strong>verbal and written communication skills</strong> in English.</li>\n<li>Ability to communicate with US customers <strong>without mother tongue influence</strong>.</li>\n<li>Calm under pressure and adept at handling difficult situations.</li>\n<li>Strong <strong>problem-solving abilities</strong> with attention to detail.</li>\n<li>Knowledge of <strong>CRM systems</strong> (preferred).</li>\n<li>Willingness to work <strong>rotational shifts</strong>: Morning (7 AM–4 PM), Afternoon (2:30 PM–11:30 PM), and Night (10:30 PM–7:30 AM).</li>\n<li>Team collaboration skills.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with innovative solutions.</li>\n<li>Dynamic, fast-paced, and innovation-driven culture.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a>\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "Customer Success Executive at Way.com handles customer queries via multiple channels, ensuring satisfaction and resolving issues. The role requires strong communication, CRM knowledge, and adaptability to rotational shifts in a tech-driven automotive app environment."
    },
    {
        "job_title": "UI/UX Designer ( 3+ Years of Experience)",
        "company": "Marvelloux Apps (P) Ltd",
        "url": "https://technopark.org/job-details/27748",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Marvelloux Apps (P) Ltd</h2>\n<p><strong>Location:</strong> Ground Floor, Gayatri Building, Technopark Phase I, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.marvelloux.com\">http://www.marvelloux.com</a>\n<strong>Contact Email:</strong> hr@marvelloux.com</p>\n<h3>Job Title: UI/UX Designer</h3>\n<p><strong>Experience Required:</strong> 3-5 Years\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 17, Feb 2026\n<strong>Work Mode:</strong> Work from office</p>\n<h3>About Us</h3>\n<p>Marvelloux Design Studio is a dynamic and innovative design studio dedicated to crafting exceptional digital experiences. We specialize in user interface (UI), user experience (UX), and customer experience (CX) design, working with diverse clients to create solutions that delight users and drive business success. If you are passionate about design and thrive in a collaborative, creative environment, we invite you to join our team.</p>\n<h3>Job Description</h3>\n<p>As a UI/UX/CX Designer at Marvelloux, you will play a pivotal role in conceptualizing, designing, and delivering outstanding digital experiences for our clients. You will collaborate with cross-functional teams, including project managers, developers, and fellow designers, to bring innovative ideas to life. You'll work on a variety of projects across different industries, ensuring each design solution meets the highest standards of usability, aesthetics, and customer satisfaction.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>UI/UX/CX Design:</strong> Create visually appealing and user-centric designs for websites, web applications, and digital products.</li>\n<li><strong>User Research:</strong> Conduct user research and translate insights into design decisions.</li>\n<li><strong>Prototyping:</strong> Develop interactive prototypes and wireframes.</li>\n<li><strong>Information Architecture:</strong> Define digital product structures to optimize user flow.</li>\n<li><strong>Visual Design:</strong> Design interfaces with branding consistency.</li>\n<li><strong>Usability Testing:</strong> Plan and conduct testing sessions for iterative improvements.</li>\n<li><strong>Customer Journey Mapping:</strong> Refine customer journey maps.</li>\n<li><strong>Collaboration:</strong> Work with project managers, developers, and teams.</li>\n<li><strong>Client Interaction:</strong> Communicate design concepts and address feedback.</li>\n<li><strong>Stay Current:</strong> Follow industry trends and design best practices.</li>\n<li><strong>Deadline Management:</strong> Meet project deadlines and handle multiple projects.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>3-5 years of experience in UI/UX Designing</li>\n<li>Excellent communication and presentation skills</li>\n<li>Proven experience in UI, UX, and CX design with a strong portfolio</li>\n<li>Proficiency in Adobe Creative Suite, Sketch, Figma</li>\n<li>Knowledge of HTML, CSS, JavaScript</li>\n<li>Strong problem-solving and attention to detail</li>\n<li>Agile/iterative design methodology experience</li>\n<li>Usability and accessibility principles</li>\n<li>Design systems and component-based design</li>\n<li>Design tokens and scalable UI systems</li>\n</ul>\n<p><strong>Send your resume and portfolio to:</strong> hr@marvelloux.com</p>",
        "tags": [
            "3-5 Years",
            "UI/UX Design",
            "Figma",
            "Adobe Creative Suite"
        ],
        "summary": "UI/UX Designer with 3-5 years experience needed to create digital experiences. Requires design tools proficiency and collaboration skills."
    },
    {
        "job_title": "Digital Marketing Specialist (3-4 Years of Experience)",
        "company": "Marvelloux Apps (P) Ltd",
        "url": "https://technopark.org/job-details/27747",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Description</h2>\n<p><strong>Marvelloux Design Studio</strong> is a premier CX/UX design studio specializing in User Experience (UX), User Interface (UI), and Customer Experience (CX) design. We are dedicated to not just meeting client expectations but consistently exceeding them. Through meticulous research and innovative design execution, we create seamless product experiences that delight users and drive recommendations. By marrying creativity and strategy, we develop solutions that enhance product performance while delivering exceptional customer engagement. Our goal is to push the boundaries of design and unlock new possibilities for our clients.</p>\n<h2>Job Role</h2>\n<p><strong>Marvelloux Apps Pvt Ltd</strong> is seeking a <strong>Digital Marketing Specialist</strong> with <strong>3–4 years of hands-on experience</strong> in digital marketing and performance marketing. This role is ideal for a performance-focused professional who can manage paid campaigns, strengthen organic presence, and drive consistent lead generation and brand growth. You will work closely with leadership and internal teams to execute data-driven marketing strategies that directly impact business growth.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Plan, launch, manage, and optimize <strong>Meta (Facebook &amp; Instagram)</strong> advertising campaigns aligned with lead generation and performance goals.</li>\n<li>Manage and optimize <strong>Google Ads</strong> campaigns, including Search, Display, and Performance Max.</li>\n<li>Execute end-to-end <strong>SEO activities</strong> (on-page, off-page, and technical SEO) to improve keyword rankings, organic traffic, and website performance.</li>\n<li>Monitor key performance indicators (KPIs), analyze campaign data, and prepare detailed performance reports with actionable insights.</li>\n<li>Develop and implement <strong>social media marketing strategies</strong>, including content planning, audience engagement, and platform growth across multiple channels.</li>\n<li>Collaborate with media, content, and design teams to ensure consistent, high-performing campaigns.</li>\n<li>Work closely with senior management to align marketing initiatives with business objectives.</li>\n<li>Support brand-building and lead-generation initiatives, especially for educational and institutional segments.</li>\n</ul>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>3–4 years</strong> of hands-on experience in digital marketing and performance marketing.</li>\n<li>Proven expertise in <strong>Meta Ads</strong>, <strong>Google Ads</strong>, and <strong>SEO</strong>.</li>\n<li>Strong understanding of campaign optimization, audience targeting, and budget management.</li>\n<li>Experience with analytics and reporting tools such as <strong>Google Analytics</strong>, <strong>Search Console</strong>, and <strong>Meta Business Manager</strong>.</li>\n<li>Solid knowledge of social media platforms and growth strategies.</li>\n<li>Ability to analyze data and convert insights into effective action plans.</li>\n<li>Excellent communication and coordination skills.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience working with <strong>Educational Academies</strong> or <strong>EdTech brands</strong> (added advantage).</li>\n<li>Exposure to <strong>CRM</strong>, marketing automation tools, or lead management systems.</li>\n</ul>\n<h2>Why Join Marvelloux Apps Pvt Ltd?</h2>\n<ul>\n<li>Work with a fast-growing, innovation-driven organization.</li>\n<li>Opportunity to collaborate directly with leadership.</li>\n<li>High ownership and visibility in decision-making.</li>\n<li>Dynamic work environment focused on learning and growth.</li>\n</ul>\n<p><strong>Contact Email:</strong> <a href=\"mailto:hr@marvelloux.com\">hr@marvelloux.com</a></p>",
        "tags": [
            "3-4 Years",
            "Meta Ads",
            "Google Ads",
            "SEO"
        ],
        "summary": "Marvelloux Apps seeks a Digital Marketing Specialist with 3-4 years of experience in Meta Ads, Google Ads, and SEO to drive performance marketing. The role involves campaign management, SEO, and collaboration with leadership to boost brand growth."
    },
    {
        "job_title": "IT Systems & Network Administrator",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/27746",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<p><strong>Cloud Nautical Solutions India Pvt Ltd</strong></p>\n<p><strong>Address:</strong> Module No. K12, 2nd Floor, Kabani Building, Technocity, Phase 4, Technopark, Trivandrum, Kerala, India, 695317\n<strong>Website:</strong> <a href=\"https://www.cloudnautical.com\">https://www.cloudnautical.com</a>\n<strong>Closing Date:</strong> 31, Mar 2026\n<strong>Published Date:</strong> 17, Feb 2026\n<strong>Contact Email:</strong> careers@cloudnautical.com</p>\n<h3><strong>Job Title</strong></h3>\n<p>IT Systems &amp; Network Administrator</p>\n<h3><strong>Brief Description</strong></h3>\n<p>Seeking an IT Systems &amp; Network Administrator with <strong>at least 3 years</strong> of proven expertise in managing IT systems and networks, including Microsoft 365 services.</p>\n<h3><strong>Job Responsibilities</strong></h3>\n<ul>\n<li>Manage day-to-day administration and performance of servers and IT infrastructure, including Microsoft 365 services (Entra ID, Exchange, Teams, SharePoint, etc.).</li>\n<li>Administer Azure Resources – Virtual Machines, Databases, etc.</li>\n<li>Monitor and maintain network resources including Firewalls and Routers.</li>\n<li>Proactively implement security measures to prevent potential threats.</li>\n<li>Ensure system backups and updates.</li>\n<li>Provide Level 2 support to business users.</li>\n</ul>\n<h3><strong>Requirements</strong></h3>\n<ul>\n<li>Bachelor's Degree in Computer Science, Information Technology, or similar.</li>\n<li>Extensive experience in managing and troubleshooting IT systems and networks.</li>\n<li>Solid working knowledge of the Microsoft stack (Windows Server, Exchange, System Centre, Active Directory, Microsoft 365) at administrator level.</li>\n<li>Proficiency in networking (TCP/IP, DNS, DHCP, etc.) and voice/data communications.</li>\n<li>Knowledge of Cyber Security protection measures and tools.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Experience in managing FortiGate firewalls.</li>\n<li>ITIL Certification.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Microsoft 365",
            "Azure",
            "Cyber Security"
        ],
        "summary": "Cloud Nautical Solutions seeks IT Systems & Network Administrator with 3+ years experience in Microsoft 365 and Azure, managing infrastructure, security, and providing Level 2 support."
    },
    {
        "job_title": "Audit Assistant",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27745",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Yarab Technologies (P) Ltd</strong>\nModule No: 2706, 7th Floor, Yamuna building, Phase-III Campus, Technopark, Kazhakootam, 695581\n<a href=\"http://www.yrtechnologies.co.in\">Visit Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Position</strong>: Audit Assistant\n<strong>Closing Date</strong>: 20, Feb 2026\n<strong>Published On</strong>: 16, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:jobs@yarabltd.co.uk\">jobs@yarabltd.co.uk</a></p>\n<h2>Job Description</h2>\n<p>We are seeking an Audit Assistant to support the team in executing the audit engagements of the company. This role involves assisting in auditing, accounting, data analysis, documentation, and preparing audit reports in accordance with professional standards and company policies.</p>\n<h2>Duties &amp; Responsibilities</h2>\n<ul>\n<li>Assist in planning and performing internal and external audit engagements</li>\n<li>Collect, analyze, and verify financial data and documentation</li>\n<li>Assist in developing and executing risk-based audit plans across business functions and jurisdictions</li>\n<li>Prepare audit working papers, schedules, and supporting documentation</li>\n<li>Reconciliation of accounts and finalisation of reports</li>\n<li>Demonstrate strong working knowledge of corporate budgeting and international accounting/auditing standards</li>\n<li>Support the team in drafting audit findings and reports</li>\n<li>Collaborate with cross-functional teams globally to ensure audit readiness</li>\n<li>Support special reviews, investigations, and ad-hoc assignments</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Education</strong>: BCom/CA Intermediate</li>\n<li><strong>Experience</strong>: 3-5 years in Financial Audit and/or Finance</li>\n<li><strong>Industry Knowledge</strong>: Insurance field experience is an advantage</li>\n<li><strong>Technical Skills</strong>: Proficiency in MS Office (Excel, Word, PowerPoint); ERP financial systems experience preferred</li>\n<li><strong>Soft Skills</strong>: Strong communication, ability to work under pressure, meet deadlines, and willingness to grow professionally</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "ERP Financial Systems",
            "Insurance/Reinsurance Industry",
            "MS Office (Excel, Word, PowerPoint)"
        ],
        "summary": "Audit Assistant role requiring 3-5 years in finance/audit, expertise in ERP systems, and insurance industry knowledge to support audit engagements and reporting."
    },
    {
        "job_title": "Business Development Associate",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27744",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<p><strong>Yarab Technologies (P) Ltd</strong></p>\n<p><strong>Module No: 2706, 7th Floor, Yamuna Building, Phase-III Campus, Technopark, Kazhakootam, 695581</strong>\n<strong>Website</strong>: <a href=\"http://www.yrtechnologies.co.in\">http://www.yrtechnologies.co.in</a>\n<strong>Closing Date</strong>: 20, Feb 2026\n<strong>Job Published</strong>: 16, Feb 2026\n<strong>Contact Email</strong>: jobs@yarabltd.co.uk</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>proactive and customer-focused Insurance Sales Agent</strong> to handle inbound and outbound calls, deliver exceptional service, and drive sales growth. The role involves resolving queries, promoting insurance products, and ensuring compliance with regulatory standards.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Inbound &amp; Outbound Call Handling</strong>:</li>\n<li>Manage calls from UK customers, addressing inquiries and providing accurate product information.</li>\n<li>Proactively follow up with potential and existing customers for cross-selling and up-selling opportunities.</li>\n<li><strong>Sales Achievement</strong>:</li>\n<li>Achieve and exceed monthly and quarterly sales targets.</li>\n<li>Cross-sell and up-sell relevant insurance products or services to meet customer needs.</li>\n<li><strong>Customer Experience</strong>:</li>\n<li>Maintain high levels of customer satisfaction through effective communication, active listening, and problem-solving.</li>\n<li>Resolve queries promptly and ensure a positive customer journey.</li>\n<li><strong>Record Management</strong>:</li>\n<li>Accurately document customer interactions and transactions in the CRM system.</li>\n<li>Ensure data accuracy for reporting and compliance purposes.</li>\n<li><strong>Team Collaboration</strong>:</li>\n<li>Work closely with team members to achieve overall sales and customer service goals.</li>\n<li>Share best practices and support colleagues to enhance team performance.</li>\n<li><strong>Compliance &amp; Quality Assurance</strong>:</li>\n<li>Adhere to FCA regulations, Consumer Duty principles, and company policies during all interactions.</li>\n<li>Follow approved scripts and maintain high compliance scores in quality audits.</li>\n</ul>\n<h3>Preferred Skills &amp; Competencies</h3>\n<ul>\n<li>Strong communication and interpersonal skills.</li>\n<li>Proven ability to handle sales objections and negotiate effectively.</li>\n<li>Customer-focused mindset with problem-solving abilities.</li>\n<li>Comfortable working in a target-driven environment.</li>\n<li>Basic technical proficiency with CRM systems and telephony platforms.</li>\n</ul>\n<h3>Qualifications &amp; Experience</h3>\n<ul>\n<li>Experience in insurance sales, call center operations, or financial services (preferred).</li>\n<li>Knowledge of FCA guidelines and UK insurance market regulations (advantageous).</li>\n</ul>",
        "tags": [
            "Not Specified",
            "CRM Systems",
            "FCA Regulations",
            "Sales Negotiation"
        ],
        "summary": "Seeking a proactive Insurance Sales Agent to manage calls, drive sales, and ensure compliance with FCA regulations. Responsibilities include customer service, sales targets, and CRM documentation."
    },
    {
        "job_title": "Claims Handlers / Customer Service Executives",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27743",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<p><strong>Yarab Technologies (P) Ltd</strong></p>\n<p><strong>Address:</strong> Module No: 2706, 7th Floor, Yamuna building, Phase-III Campus, Technopark, Kazhakootam, 695581\n<strong>Website:</strong> <a href=\"http://www.yrtechnologies.co.in\">http://www.yrtechnologies.co.in</a></p>\n<p><strong>Job Title:</strong> Claims Handlers / Customer Service Executives\n<strong>Closing Date:</strong> 20, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:jobs@yarabltd.co.uk\">jobs@yarabltd.co.uk</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking <strong>Claims Handlers / Customer Service Executives</strong> to join our dynamic team. The ideal candidate will handle customer queries, process claims, and ensure timely resolution while maintaining the highest standards of service. UK experience is highly desirable, and prior insurance industry experience is a strong advantage—but not mandatory. We also welcome freshers with excellent communication skills and a willingness to learn.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Handle inbound and outbound calls related to claims and customer service.</li>\n<li>Assist customers in reporting First Notification of Loss (FNOL) and gathering relevant information.</li>\n<li>Validate and process claims in line with company guidelines and compliance standards (FCA regulations).</li>\n<li>Communicate clearly and professionally with customers, service partners, and underwriters.</li>\n<li>Manage claim updates via email and phone, ensuring timely follow-ups.</li>\n<li>Maintain accurate records of all interactions in the system.</li>\n<li>Handle queries, complaints, and escalations effectively, ensuring fair outcomes.</li>\n</ul>\n<h3>Key Skills &amp; Competencies</h3>\n<ul>\n<li>Excellent communication skills (verbal and written).</li>\n<li>Strong problem-solving abilities and attention to detail.</li>\n<li>Ability to remain calm under pressure and handle challenging conversations.</li>\n<li>Basic computer literacy and ability to work with CRM or ticketing systems.</li>\n<li>Team player with a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Previous experience in <strong>UK customer service or claims handling</strong> (highly desirable).</li>\n<li><strong>Insurance experience</strong> will be an added advantage.</li>\n<li>Fresh graduates or candidates with no prior experience are encouraged to apply (full training provided).</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Customer Service",
            "Claims Handling",
            "CRM/Ticketing Systems"
        ],
        "summary": "Seeking Claims Handlers/Customer Service Executives to manage claims and customer queries. Offers training for freshers with excellent communication skills."
    },
    {
        "job_title": "Project Manager",
        "company": "Eartheye Space Private Limited",
        "url": "https://technopark.org/job-details/27742",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Eartheye Space Private Limited</strong>\n<strong>Location:</strong> STPI BUILDING, Technopark, Karyavattom P. O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"https://eartheye.space\">eartheye.space</a>\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> abhishek@eartheye.space</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced <strong>Technical Project Manager</strong> to lead multidisciplinary delivery across software engineering, data science, and generative AI. You will manage complex initiatives spanning product development, integration, and client onboarding.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Lead and manage delivery</strong> ensuring alignment and successful execution with product requirements.</li>\n<li><strong>Plan, schedule, and track</strong> timely software releases and integration milestones.</li>\n<li><strong>Coordinate across product, engineering, data science, Gen AI, and QA teams</strong> to drive high-quality delivery.</li>\n<li><strong>Ensure technical requirements</strong> are well-defined, understood, and executed with minimal ambiguity.</li>\n<li><strong>Act as a key interface</strong> between product leadership, technical teams, and external stakeholders.</li>\n<li><strong>Proactively identify risks, dependencies, and blockers</strong>; implement mitigation strategies.</li>\n<li><strong>Provide hands-on technical support</strong> including code review, architectural discussions, and technical problem solving.</li>\n<li><strong>Drive process improvements</strong> and adopt agile best practices across teams.</li>\n<li><strong>Mentor and grow team leads and individual contributors</strong>.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Strong technical background</strong> with hands-on coding proficiency (Python, JavaScript/TypeScript).</li>\n<li><strong>Demonstrated success</strong> in managing cross-functional teams and large technical deliverables.</li>\n<li><strong>Proficient in modern software development practices</strong>, Agile frameworks, and CI/CD workflows.</li>\n<li><strong>Excellent organizational, communication, and stakeholder management skills</strong>.</li>\n<li><strong>Ability to translate complex technical challenges</strong> into actionable plans.</li>\n<li><strong>Certifications in PMP, Scrum Master, or equivalent</strong>.</li>\n<li><strong>Experience with cloud platforms</strong> (AWS, Azure, or Google Cloud).</li>\n<li><strong>Familiarity with geospatial domain, APIs, and data processing workflows</strong>.</li>\n<li><strong>Knowledge of satellite data processing and remote sensing workflows</strong> is a bonus.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>At least 10+ years of experience</strong> in software product delivery management.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Python",
            "JavaScript/TypeScript",
            "AWS/Azure/GCP"
        ],
        "summary": "Lead multidisciplinary software, data science, and AI projects with 10+ years of technical delivery experience. Manage cross-functional teams and ensure high-quality product integration."
    },
    {
        "job_title": "Multimedia Designer",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/27741",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>About the Job</h2>\n<p><strong>Company:</strong> Klystron Technologies\n<strong>Location:</strong> Technopark, Thiruvananthapuram\n<strong>Job Type:</strong> Full-time\n<strong>Joining Time:</strong> Within 30 days\n<strong>Experience Required:</strong> 0 to 1 year\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> jobs.in@klystronglobal.com</p>\n<h3>Role Overview</h3>\n<p>Klystron Technologies is urgently hiring a <strong>Multimedia Designer</strong> to create engaging visual content for digital platforms, marketing campaigns, and internal communication. The ideal candidate will produce high-quality 2D/3D animations, videos, and graphics that align with brand standards.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design graphics for digital marketing, social media, presentations, and print materials.</li>\n<li>Create 2D/3D animation videos, including explainer videos, product demos, and corporate storytelling.</li>\n<li>Edit, color-correct, and enhance promotional and internal videos.</li>\n<li>Conceptualize and execute creative visual ideas.</li>\n<li>Maintain brand consistency across all multimedia assets.</li>\n<li>Collaborate with marketing and content teams to deliver impactful content.</li>\n<li>Stay updated on design trends, animation techniques, and visual tools.</li>\n</ul>\n<h3>Required Skills &amp; Tools</h3>\n<ul>\n<li><strong>Graphic Design:</strong> Adobe Illustrator, Adobe Photoshop, Adobe InDesign</li>\n<li><strong>Video Editing &amp; Animation:</strong> Adobe After Effects, Adobe Premiere Pro</li>\n<li><strong>2D Animation Tools:</strong> After Effects, Animate, Toon Boom</li>\n<li><strong>3D Animation Tools:</strong> Blender, Cinema 4D, Maya (basic/intermediate)</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong understanding of layout, typography, and color theory.</li>\n<li>Experience creating visuals for social media, ads, websites, and corporate communication.</li>\n<li>Creativity, attention to detail, and ability to manage multiple projects.</li>\n</ul>\n<h3>Nice-to-Have Skills</h3>\n<ul>\n<li>Knowledge of UI/UX design for web or mobile.</li>\n<li>Familiarity with Canva or Figma for quick design tasks.</li>\n</ul>",
        "tags": [
            "0-1 Year",
            "Adobe After Effects",
            "Adobe Premiere Pro",
            "2D/3D Animation"
        ],
        "summary": "Klystron Technologies seeks a Multimedia Designer to create engaging digital content using Adobe tools and 2D/3D animation. The role involves designing graphics, editing videos, and collaborating with marketing teams for brand consistency."
    },
    {
        "job_title": "Digital Marketing Expert",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/27740",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>Job Posting: Digital Marketing Expert</h2>\n<p><strong>Location:</strong> Technopark, Thiruvananthapuram\n<strong>Job Type:</strong> Full-time\n<strong>Joining Time:</strong> Within 30 days\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> jobs.in@klystronglobal.com\n<strong>Company Website:</strong> <a href=\"https://www.klystronglobal.com\">Klystron Technologies</a></p>\n<h3>Overview</h3>\n<p>Klystron Technologies seeks a <strong>Digital Marketing Expert</strong> to lead SEO, graphic design, UI/UX, video editing, and web development initiatives. The role requires a blend of technical and creative skills to enhance digital presence and user engagement.</p>\n<h3>Key Responsibilities</h3>\n<h4>SEO &amp; Website Optimization</h4>\n<ul>\n<li>Develop and execute SEO strategies to boost website traffic and rankings.</li>\n<li>Conduct keyword research, technical audits, and on-page/off-page optimization.</li>\n<li>Track performance using Google Analytics, Search Console, and other tools.</li>\n</ul>\n<h4>Graphic Design</h4>\n<ul>\n<li>Create engaging visuals for social media, ads, websites, and campaigns.</li>\n<li>Ensure brand consistency across all platforms.</li>\n</ul>\n<h4>UI &amp; UX Design</h4>\n<ul>\n<li>Improve user journeys on websites and landing pages to drive engagement and conversions.</li>\n<li>Conduct user research, wireframing, and prototyping using Figma or Adobe XD.</li>\n</ul>\n<h4>Video Editing</h4>\n<ul>\n<li>Edit promotional videos, reels, and content for social media/ads.</li>\n<li>Add motion graphics, effects, and branding elements to enhance quality.</li>\n</ul>\n<h4>Web Development</h4>\n<ul>\n<li>Manage and maintain company websites (WordPress or custom-built).</li>\n<li>Implement landing pages, updates, and ensure mobile responsiveness.</li>\n<li>Collaborate with teams to integrate SEO and UX best practices.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience as a Digital Marketing Expert or similar role.</li>\n<li>Strong knowledge of SEO tools (Ahrefs, SEMrush, Google Analytics).</li>\n<li>Proficiency in design tools (Photoshop, Illustrator, Canva).</li>\n<li>Experience in UI/UX design (Figma, Adobe XD, Sketch).</li>\n<li>Skilled in video editing software (Adobe Premiere Pro, After Effects, Final Cut Pro).</li>\n<li>Hands-on experience with web development (WordPress, HTML, CSS, JavaScript).</li>\n<li>Ability to manage multiple projects and deliver high-quality work on time.</li>\n</ul>\n<p><strong>Office Address:</strong> Office Nbr: 2210, Yamuna Building, Technopark Phase-III, 695583</p>",
        "tags": [
            "3-5 Years",
            "SEO",
            "UI/UX Design",
            "WordPress"
        ],
        "summary": "Digital Marketing Expert needed for SEO, UI/UX, and video editing to drive online engagement and optimize digital strategies."
    },
    {
        "job_title": "Dot Net Developer",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/27739",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Klystron Global is a leading provider of cutting-edge Digital Transformation solutions, tailored to meet the evolving needs of businesses across diverse industries. With a strong focus on innovation and client satisfaction, we deliver exceptional technology solutions that empower organizations to thrive in the digital era. Established in 2009, Klystron Global has expanded its presence worldwide with branches in Dubai, Oman, Bahrain, India, and the US.</p>\n<h2>Position Overview</h2>\n<p>We are seeking dynamic and results-driven ASP.NET, MVC developers to develop and support existing applications. The main scope of work includes everything from back-end to client-side code, using optimal and efficient technologies, frameworks, and patterns. Your primary responsibilities will be to design and develop these applications.</p>\n<h2>Roles &amp; Responsibilities</h2>\n<ul>\n<li>Work in a development team to develop integrated ASP.NET applications.</li>\n<li>Perform design and development of web-based services and applications.</li>\n<li>Work closely with quality assurance teams to ensure delivery of high-quality and reliable web applications.</li>\n<li>Experience in WPF.</li>\n<li>Develop databases including queries, triggers, and stored procedures.</li>\n<li>Monitor application performance post-deployment and make necessary changes.</li>\n<li>Interact with customers to define project features and requirements.</li>\n<li>Research and develop prototypes of complex design solutions.</li>\n<li>Perform code reviews and provide necessary corrections.</li>\n<li>Develop coding guidelines for the ASP.NET development team.</li>\n<li>Perform application design, development, and deployment based on industry best practices.</li>\n<li>Resolve application defects and issues promptly.</li>\n<li>Prepare technical documents per established project standards.</li>\n<li>Conduct application testing based on test cases and test plans.</li>\n<li>Work collaboratively with Project Managers to ensure timely project delivery.</li>\n<li>Coordinate with Business Analysts and Test Analysts to meet technical requirements and client needs.</li>\n</ul>\n<h2>Preferred Skills &amp; Education</h2>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, Software Engineering, or similar.</li>\n<li><strong>2+ years of experience</strong> in C#, ASP.NET, MVC, WPF, WCF.</li>\n<li>Prior experience as a Developer.</li>\n<li>Extensive working knowledge of .NET languages (C#, VB.NET).</li>\n<li>Familiarity with ASP.NET framework and SQL Server.</li>\n<li>Strong attention to detail.</li>\n<li>Excellent communication skills.</li>\n</ul>\n<h2>Preferred Knowledge</h2>\n<ul>\n<li>Experience with design and implementation of controls or data acquisition systems.</li>\n<li>Excellent interpersonal, presentation, and leadership skills.</li>\n<li>Demonstrated initiative and attention to completeness, accuracy, and details.</li>\n<li>Must be a self-starter, able to balance priorities across multiple projects.</li>\n<li>Demonstrated ability to meet budgets and schedules.</li>\n<li>Ability to work independently and collaborate in a multi-disciplinary team.</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Competitive salary.</li>\n<li>Ongoing professional development opportunities.</li>\n<li>Collaborative and innovative work environment.</li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Email:</strong> <a href=\"mailto:jobs.in@klystronglobal.com\">jobs.in@klystronglobal.com</a>\n<strong>Website:</strong> <a href=\"https://www.klystronglobal.com\">https://www.klystronglobal.com</a>\n<strong>Location:</strong> Technopark, Thiruvananthapuram\n<strong>Job Type:</strong> Full-time\n<strong>Joining Time:</strong> Within 30 days\n<strong>Closing Date:</strong> 23, Feb 2026</p>",
        "tags": [
            "2+ Years",
            "ASP.NET",
            "MVC",
            "WPF"
        ],
        "summary": "Develop and support ASP.NET applications with a focus on full-stack development. Collaborate with teams to deliver high-quality digital solutions for Klystron Global's clients."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/27738",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Klystron Global is a leading provider of cutting-edge Digital Transformation solutions, tailored to meet the evolving needs of businesses across diverse industries. With a strong focus on innovation and client satisfaction, we deliver exceptional technology solutions that empower organizations to thrive in the digital era. Established in 2009, Klystron Global has expanded its presence worldwide with branches in Dubai, Oman, Bahrain, India, and the US.</p>\n<h2>Position Overview</h2>\n<p>We are seeking dynamic and results-driven <strong>Odoo Developers</strong> to develop and support existing applications. The main scope of work includes everything from back-end to client-side code using optimal and efficient technologies, frameworks, and patterns. Your primary responsibilities will be to design and develop these applications.</p>\n<h2>Roles &amp; Responsibilities</h2>\n<ul>\n<li>Programming Languages: <strong>Python &amp; JavaScript</strong></li>\n<li>Database: <strong>PostgreSQL</strong> (with object-relational mapping)</li>\n<li>Collaboration platform: <strong>GitHub</strong></li>\n<li>Design, review, and test code within the Odoo ecosystem</li>\n<li>Develop integrated Odoo applications using proper conventions and design standards</li>\n<li>Analyze, diagnose, and resolve application errors</li>\n<li>Develop solutions for clients across industries and company sizes</li>\n<li>Provide client support</li>\n<li>Customize Odoo ERP modules</li>\n</ul>\n<h2>Preferred Education / Experience</h2>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, Software Engineering, or similar</li>\n<li><strong>1 - 4 years of experience</strong> as an Odoo Developer</li>\n<li>Prior experience as a Python Developer</li>\n<li>PostgreSQL or relational database skills</li>\n<li>Strong attention to detail</li>\n<li>Excellent communication skills</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Framework: <strong>Odoo versions 11.0 to 19.0</strong> (ORM, Workflows, Report Engine, BI, AI)</li>\n<li>Object-oriented programming and relational database expertise</li>\n<li>Strong interpersonal, presentation, and leadership skills</li>\n<li>Ability to manage multiple projects simultaneously</li>\n<li>Demonstrated ability to meet budgets and schedules</li>\n<li>Collaborative team player and independent contributor</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Competitive salary</li>\n<li>Ongoing professional development opportunities</li>\n<li>Collaborative and innovative work environment</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:jobs.in@klystronglobal.com\">jobs.in@klystronglobal.com</a></li>\n<li><strong>Website</strong>: <a href=\"https://www.klystronglobal.com\">www.klystronglobal.com</a></li>\n<li><strong>Office Address</strong>: Office Nbr 2210, Yamuna Building, Technopark Phase-III, 695583</li>\n<li><strong>Closing Date</strong>: 23 Feb 2026</li>\n<li><strong>Job Published</strong>: 16 Feb 2026</li>\n</ul>",
        "tags": [
            "1-4 Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Odoo Developer with 1-4 years of experience required to design, develop, and support applications using Python and PostgreSQL in a collaborative tech environment."
    },
    {
        "job_title": "Service Coordinator (0-1 Year)",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27737",
        "location": "Technopark",
        "closing_date": "04 Mar 2026",
        "job_description": "<p><strong>GENROBOTIC INNOVATIONS (P) Ltd</strong>\n<strong>Address:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a></p>\n<p><strong>Job Title:</strong> Service Coordinator (0-1 Year)\n<strong>Closing Date:</strong> 04, Mar 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:career@genrobotics.org\">career@genrobotics.org</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>Coordinates and manages service requests, acts as a liaison for technicians and internal teams, tracks service progress, and ensures accurate documentation of all service-related activities.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Prepare CAMC and Paid Service proposals based on client requirements.</li>\n<li>Maintain and update CAMC schedules, registers, and service reports.</li>\n<li>Coordinate PO collection and manage the CAMC Register.</li>\n<li>Draft and review Warranty Certificates, terms, and conditions.</li>\n<li>Create internal billing and ensure timely updates.</li>\n<li>Generate CAMC and Maintenance letters for clients.</li>\n<li>Maintain a daily task list for all service activities.</li>\n<li>Collect, organize, and archive service reports from engineers.</li>\n<li>Review ISO-related documentation monthly for compliance.</li>\n<li>Update KPI tasks and monitor engineer performance indicators.</li>\n<li>Manage monthly expense sheets and draft fund request documents with supporting details.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Strong documentation skills</li>\n<li>Excellent coordination and communication abilities</li>\n<li>Proficiency in MS Office</li>\n<li>Multitasking and deadline management</li>\n<li>Proficiency in Hindi</li>\n</ul>\n<h3><strong>Education &amp; Experience</strong></h3>\n<ul>\n<li><strong>Education:</strong> Bachelor’s degree (any discipline)</li>\n<li><strong>Experience:</strong> 0–1 year (Freshers)</li>\n<li><strong>Mandatory Requirement:</strong> Hindi speaking</li>\n</ul>\n<h3><strong>Job Location</strong></h3>\n<p>Technopark, Thiruvananthapuram</p>\n<h3><strong>Application</strong></h3>\n<p><a href=\"#\">Click here to Apply</a></p>",
        "tags": [
            "0-1 Year",
            "MS Office",
            "Documentation",
            "Hindi"
        ],
        "summary": "Coordinates service requests, manages documentation, and supports technical teams. Requires Hindi proficiency and MS Office skills with 0-1 years of experience."
    },
    {
        "job_title": "Business Development Associate(Technical)",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/27736",
        "location": "Technopark",
        "closing_date": "25 Feb 2026",
        "job_description": "<p><strong>Picky Assist (P) Ltd</strong></p>\n<p><strong>Location:</strong> T-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<p><strong>Job Title:</strong> Business Development Associate (Technical)\n<strong>Closing Date:</strong> 25 Feb 2026\n<strong>Published Date:</strong> 16 Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@pickyassist.com\">careers@pickyassist.com</a></p>\n<h3>Role Overview</h3>\n<ul>\n<li><strong>Identify and approach software companies</strong> across South India to introduce and promote Picky Assist’s WhatsApp API solutions.</li>\n<li><strong>Analyze customer requirements</strong> and explain technical concepts in a user-friendly manner.</li>\n<li><strong>Guide clients</strong> through WhatsApp API integration, coordinating with internal teams.</li>\n<li><strong>Conduct demos, walkthroughs, and technical discussions</strong> (online/onsite) for potential clients.</li>\n<li><strong>Build long-term client relationships</strong> for seamless onboarding and satisfaction.</li>\n<li><strong>Meet monthly sales targets</strong> and drive revenue growth.</li>\n<li><strong>Travel across South India</strong> for client visits and business development.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Engineering degree with basic understanding of APIs, programming, and software integration.</li>\n<li><strong>Excellent English communication skills</strong> (mandatory).</li>\n<li><strong>Minimum 6 months</strong> in Sales or Technical roles.</li>\n<li>Strong customer-centric mindset with solution-oriented problem-solving.</li>\n<li>Excellent interpersonal skills.</li>\n</ul>\n<h3>Mandatory Requirements</h3>\n<ul>\n<li><strong>Own 2-wheeler with valid driving license</strong>.</li>\n<li><strong>Personal laptop</strong> for daily work.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your CV to <a href=\"mailto:careers@pickyassist.com\">careers@pickyassist.com</a> or WhatsApp <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></p>",
        "tags": [
            "6+ Months",
            "WhatsApp API",
            "Sales & Technical Communication",
            "Customer Relationship Management"
        ],
        "summary": "Promote WhatsApp API solutions to South Indian software companies. Build client relationships and meet sales targets through technical demos and integration guidance."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27735",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Revyrie Global\n<strong>Location:</strong> 17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a>\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Job Description</h3>\n<p>Support end-to-end business development activities including:\n- Lead generation, client acquisition, and basic account management.\n- Executing inside sales activities to generate qualified leads and conversions.\n- Planning and executing sales/marketing campaigns across industries/regions.\n- Identifying new business opportunities and contributing to market expansion.\n- Collaborating with leadership, marketing teams, and partners for growth initiatives.\n- Maintaining CRM systems to track leads, sales activities, and pipeline status.\n- Following up with prospects, conducting initial discussions, and coordinating closures.\n- Conducting market research and competitor analysis to understand customer needs.\n- Preparing sales reports, lead updates, and performance summaries.\n- Handling client communication, feedback, and issue resolution for satisfaction.\n- Supporting account management to build long-term client relationships.\n- Following sales processes and suggesting improvements.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>2–3 years</strong> of experience in Business Development, Inside Sales, or Lead Generation.</li>\n<li>Exposure to B2B/B2C sales and client interaction.</li>\n<li>Hands-on CRM tools and lead research platforms.</li>\n<li>Strong communication, interpersonal, and negotiation skills.</li>\n<li>Ability to analyze leads and suggest solutions.</li>\n<li>Collaboration with cross-functional teams.</li>\n<li>Basic sales planning/forecasting knowledge.</li>\n<li>Proficiency in MS Office.</li>\n<li>Organizational skills, time management, and results-driven mindset.</li>\n<li>Independence in meeting targets.</li>\n</ul>\n<p><strong>Information Requested:</strong> Mention <strong>Job Code: BD/2026</strong> in the subject line.</p>",
        "tags": [
            "2-3 Years",
            "CRM Tools",
            "B2B/B2C Sales",
            "MS Office"
        ],
        "summary": "Business Development Executive supporting sales, client acquisition, and CRM management. Requires 2-3 years in B2B/B2C sales with CRM tools and MS Office proficiency."
    },
    {
        "job_title": "NODE JS DEVELOPER",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/27734",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>About the Role</h2>\n<p>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED is seeking a <strong>Node.js Developer</strong> with a passion for backend development, clean coding, and collaborative problem-solving. The ideal candidate will design and maintain scalable server-side applications while working closely with cross-functional teams to implement new features.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Design, develop, and maintain scalable server-side applications using <strong>Node.js</strong>.</li>\n<li>Develop server-side logic and integrate front-end components.</li>\n<li>Collaborate with cross-functional teams to define and implement new features.</li>\n<li>Ensure high performance, reliability, and responsiveness of applications.</li>\n<li>Troubleshoot, debug, and optimize applications.</li>\n<li>Participate in code reviews and provide constructive feedback.</li>\n<li>Contribute to architectural and design decisions.</li>\n<li>Stay updated with the latest Node.js trends and best practices.</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field.</li>\n<li><strong>4+ years</strong> of professional Node.js development experience.</li>\n<li>Strong proficiency in JavaScript and frameworks like <strong>Express.js</strong>.</li>\n<li>Experience with asynchronous programming and event-driven architecture.</li>\n<li>Knowledge of <strong>RESTful APIs</strong>, microservices, and database systems (<strong>MongoDB</strong>, MySQL, PostgreSQL).</li>\n<li>Familiarity with <strong>Git</strong> and version control systems.</li>\n<li>Agile development experience and a team-oriented mindset.</li>\n<li>Excellent communication skills.</li>\n<li>Experience with front-end technologies like <strong>React.js</strong> or <strong>Angular.js</strong> is a plus.</li>\n</ul>\n<h2>Work Details</h2>\n<ul>\n<li><strong>Location</strong>: Technopark, Trivandrum, Kerala</li>\n<li><strong>Experience</strong>: 4+ Years</li>\n<li><strong>Work Mode</strong>: Onsite</li>\n<li><strong>Joining</strong>: Immediate joiners (within 30 days)</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Experience in code reviews and providing constructive feedback.</li>\n<li>Writing unit tests and performing initial testing of applications.</li>\n<li>Knowledge of CI/CD pipelines and automated testing.</li>\n<li>Experience with <strong>GraphQL</strong> or <strong>WebSocket</strong>-based real-time applications.</li>\n<li>Understanding of performance monitoring and optimization techniques.</li>\n</ul>\n<h2>How to Apply</h2>\n<ul>\n<li><strong>Email</strong>: recruitment@ateamsoftsolutions.com</li>\n<li><strong>Phone</strong>: +91 7907410058</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Node.js",
            "Express.js",
            "RESTful APIs"
        ],
        "summary": "Seeking a Node.js Developer with 4+ years of experience to design scalable backend solutions using Express.js, RESTful APIs, and databases. Requires collaboration, code reviews, and expertise in performance optimization."
    },
    {
        "job_title": "Node JS Developer",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27733",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2><strong>Revyrie Global</strong></h2>\n<p><strong>Address:</strong> 17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a></p>\n<h3><strong>Job Details</strong></h3>\n<ul>\n<li><strong>Closing Date:</strong> 23, Feb 2026</li>\n<li><strong>Published Date:</strong> 16, Feb 2026</li>\n<li><strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></li>\n</ul>\n<h3><strong>Job Description</strong></h3>\n<p>Design, develop, test, and maintain scalable backend services using Node.js.\nBuild and optimize RESTful and/or GraphQL APIs for web and mobile applications.\nImplement secure authentication and authorization mechanisms (JWT, OAuth).\nIntegrate third-party APIs and external services.\nCollaborate with frontend developers, product managers, and QA teams to deliver high-quality solutions.\nWrite clean, maintainable, and well-documented code.\nPerform code reviews and contribute to best development practices.\nTroubleshoot, debug, and optimize application performance.\nParticipate in architecture discussions and technical decision-making.</p>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>2+ years of experience in backend development using Node.js.</li>\n<li>Strong proficiency in JavaScript (ES6+) and/or TypeScript.</li>\n<li>Experience with frameworks such as Express.js, NestJS.</li>\n<li>Solid understanding of RESTful API design principles.</li>\n<li>Experience with databases: MySQL, PostgreSQL, or MongoDB.</li>\n<li>Knowledge of ORMs/ODMs.</li>\n<li>Familiarity with Git and modern CI/CD pipelines.</li>\n<li>Experience with cloud platforms such as AWS, Azure, or GCP.</li>\n<li>Understanding of Docker and containerized deployments.</li>\n</ul>\n<h3><strong>Information Requested</strong></h3>\n<p>Kindly mention <strong>Job code</strong> in the Subject line - <strong>ND/2026</strong>.</p>",
        "tags": [
            "2+ Years",
            "Node.js",
            "JavaScript (ES6+)",
            "Express.js/NestJS"
        ],
        "summary": "Develop scalable backend services with Node.js, build APIs, and collaborate with cross-functional teams. Requires 2+ years of backend development experience."
    },
    {
        "job_title": "Frontend Developer - React JS & Native",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27732",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<p><strong>Revyrie Global</strong>\n17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a></p>\n<p><strong>Frontend Developer - React JS &amp; Native</strong>\n- <strong>Closing Date:</strong> 23 Feb 2026\n- <strong>Job Published:</strong> 16 Feb 2026\n- <strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Brief Description</h3>\n<p>Develop and maintain scalable, high-performance web applications using React.js. Build reusable components and frontend libraries for future use. Collaborate with backend developers, UI/UX designers, and product managers to implement user-facing features. Optimize applications for maximum speed, scalability, and responsiveness. Implement state management using Redux, Context API, or other modern libraries. Ensure cross-browser compatibility and responsive UI design. Write clean, maintainable, and well-documented code. Participate in code reviews and follow best frontend development practices. Troubleshoot, debug, and resolve frontend issues. Contribute to mobile app development using React Native.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>3+ years of experience in frontend development with React.js</li>\n<li>Strong proficiency in JavaScript (ES6+), HTML5, and CSS3</li>\n<li>Hands-on experience with React Hooks, functional components, and modern React patterns</li>\n<li>Hands-on experience with React Native for building mobile applications</li>\n<li>Strong experience using TypeScript in React/React Native projects</li>\n<li>Experience with RESTful APIs and API integration</li>\n<li>Familiarity with state management libraries such as Redux or Context API</li>\n<li>Experience with modern build tools like Webpack, Vite, or Babel</li>\n<li>Knowledge of Git and version control workflows</li>\n<li>Strong problem-solving and debugging skills</li>\n</ul>\n<p><strong>Information Requested:</strong> Kindly mention Job code in the Subject line - <strong>RD/2026</strong></p>",
        "tags": [
            "3+ Years",
            "React.js",
            "React Native",
            "TypeScript"
        ],
        "summary": "Develop scalable web and mobile apps using React.js/Native. Collaborate with teams to build high-performance, responsive UIs with modern frontend tools."
    },
    {
        "job_title": "Software Testing Intern",
        "company": "Breeze Brain Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27731",
        "location": "Technopark",
        "closing_date": "19 Feb 2026",
        "job_description": "<p><strong>Breeze Brain Technologies (P) Ltd</strong></p>\n<p><strong>Location:</strong> Module 20, SBC, 2nd Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://www.breezebrain.com\">https://www.breezebrain.com</a>\n<strong>Closing Date:</strong> 19, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> careers@breezebrain.com</p>\n<h3><strong>Software Testing Intern</strong></h3>\n<p><strong>Brief Description</strong>\nWe are seeking a motivated and detail-oriented <strong>Software Testing Intern</strong> to gain hands-on experience in testing <strong>Web and Windows applications</strong>. This role is ideal for candidates with basic exposure to software testing concepts and automation tools like <strong>Selenium</strong> and introductory knowledge of <strong>Winium</strong>. As an intern, you will support the QA team in ensuring the quality, performance, and reliability of our software products prior to release.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Assist in manual and automated testing of web and desktop applications.</li>\n<li>Support the creation and execution of test cases, test scripts, and test plans.</li>\n<li>Learn and apply <strong>Selenium</strong> for web application automation and <strong>Winium</strong> for Windows application testing.</li>\n<li>Identify, document, and help track bugs and performance issues.</li>\n<li>Collaborate with developers and senior testers to understand application features and technical workflows.</li>\n<li>Participate in various stages of the <strong>Software Development Life Cycle (SDLC)</strong>.</li>\n<li>Ensure software meets quality standards and end-user requirements.</li>\n</ul>\n<h3><strong>Required Skills &amp; Qualifications</strong></h3>\n<ul>\n<li>Bachelor’s degree in <strong>Computer Science</strong>, <strong>Engineering</strong>, or a related field.</li>\n<li>Basic to intermediate knowledge of <strong>Selenium WebDriver</strong> for web automation.</li>\n<li>Basic knowledge of <strong>Winium</strong> for Windows application testing.</li>\n<li>Understanding of <strong>testing methodologies</strong>, <strong>SDLC</strong>, and <strong>defect lifecycle</strong>.</li>\n<li>Strong communication skills and problem-solving abilities.</li>\n</ul>\n<h3><strong>Internship Details</strong></h3>\n<ul>\n<li><strong>Duration:</strong> 6 Months</li>\n<li><strong>Stipend:</strong> ₹6,000 – ₹12,000 (based on performance and skill level)</li>\n</ul>\n<h3><strong>How to Apply</strong></h3>\n<p>Send your resume to: <strong>careers@breezebrain.com</strong>\n<strong>Subject Line:</strong> Software Testing Intern\n<em>Applications without the correct subject line may be delayed or rejected.</em></p>",
        "tags": [
            "0-1 Years",
            "Selenium",
            "Winium",
            "SDLC"
        ],
        "summary": "A 6-month Software Testing Internship at Breeze Brain Technologies for students to gain hands-on experience in testing web and Windows applications using Selenium and Winium, with a stipend of ₹6,000–₹12,000."
    },
    {
        "job_title": "Support & Implementation Engineer",
        "company": "Kameda Infologics (P) Ltd",
        "url": "https://technopark.org/job-details/27730",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Kameda Infologics (P) Ltd</h2>\n<p><strong>Address:</strong> 2nd Floor, Amstor House, Technopark Campus, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.kamedainfologics.com\">http://www.kamedainfologics.com</a>\n<strong>Contact Email:</strong> preeyanka@kamedainfologics.com</p>\n<h3>Job Title: Support &amp; Implementation Engineer</h3>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026</p>\n<h3>About Us</h3>\n<p>At Kameda Infologics, we are a passionate team of technology and healthcare enthusiasts applying cutting-edge technology to solve real-world, multi-dimensional healthcare problems. We drive digital transformation to meet our clients’ needs by building innovative solutions.</p>\n<h3>Role Overview</h3>\n<p>As a <strong>Support &amp; Implementation Engineer</strong>, you will work with a unique team of clinical and technical experts, developing exciting products for our customers and collaborating with cross-functional teams. You will play a key role in assisting with technical design concepts, troubleshooting, and ensuring features and performance meet the highest quality standards.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Interact with Project Managers and external customers to plan, implement, and support projects.</li>\n<li>Participate in product installations and updates, remotely or via WebEx, with customers.</li>\n<li>Maintain accurate records of installations and updates in CRM.</li>\n<li>Collaborate with Project Managers and Solution Consultants in internal and client meetings.</li>\n<li>Troubleshoot products with the Help Desk and provide timely resolutions.</li>\n<li>Prepare documentation to support product development and implementation.</li>\n<li>Act as a client advocate by identifying opportunities for product and process improvements.</li>\n<li>Stay updated with technical knowledge related to our products.</li>\n<li>Resolve SQL database issues in client environments.</li>\n<li>Assist with HL7 integrations, APIs, Mirth configurations, and related healthcare interoperability requirements.</li>\n<li>Provide support on network-related issues (added advantage).</li>\n<li>Deliver technical training and support to end users as required.</li>\n<li>Ensure professional interactions with internal and external stakeholders, maintaining client satisfaction.</li>\n<li>Work during weekends or nights as required during project go-live phases.</li>\n<li>Be open to travel for client engagements.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>3–6 years</strong> of experience in HMIS/HIS application support.</li>\n<li>Strong knowledge of <strong>SQL</strong>, <strong>HL7</strong>, <strong>APIs</strong>, <strong>Mirth</strong>, and related configurations.</li>\n<li>Familiarity with computer hardware, networking components, and system configurations (added advantage).</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong problem-solving ability with patience and customer-centric approach.</li>\n<li>Experience in a technical support or implementation environment.</li>\n</ul>",
        "tags": [
            "3-6 Years",
            "SQL",
            "HL7",
            "APIs"
        ],
        "summary": "Support & Implementation Engineer at Kameda Infologics requires 3-6 years of HMIS/HIS experience with SQL, HL7, and APIs. Role involves technical troubleshooting, client collaboration, and healthcare interoperability solutions."
    },
    {
        "job_title": "Flutter Developer",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27729",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>ZL Software Systems (P) Ltd</h2>\n<p><strong>Location:</strong> C-22, 2nd Floor, Thejaswini Building, Phase-1 Campus, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a>\n<strong>Closing Date:</strong> 31, Mar 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> careerstvm@zlinkcorp.com</p>\n<h3>Role Overview</h3>\n<p>We are seeking a highly skilled <strong>Flutter Developer</strong> to design and develop high-quality mobile applications for Android and iOS platforms using Flutter.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop advanced applications for the Flutter platform</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features</li>\n<li>Ensure performance, quality, and responsiveness of applications</li>\n<li>Identify and correct bottlenecks and fix bugs</li>\n<li>Maintain code quality, organization, and automation</li>\n</ul>\n<h3>Preferred Skills &amp; Requirements</h3>\n<ul>\n<li>Proven experience as a Flutter Developer (iOS and Android platforms)</li>\n<li>Strong proficiency in Dart programming language</li>\n<li>Experience with third-party libraries and APIs</li>\n<li>Knowledge of mobile application architecture, design patterns, and best practices</li>\n<li>Familiarity with RESTful APIs to connect Flutter applications to back-end services</li>\n<li>Understanding of Agile development lifecycle and teamwork with designers and backend developers</li>\n<li>Excellent problem-solving skills and ability to work independently or in a team</li>\n<li>Strong attention to detail and passion for high-quality work</li>\n<li>Willingness to learn and adopt latest industry trends and technologies</li>\n</ul>\n<h3>Preferred Qualification</h3>\n<ul>\n<li>Degree/Diploma in CSE or equivalent</li>\n<li><strong>Experience:</strong> 3-5 Years</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "Flutter",
            "Dart",
            "RESTful APIs"
        ],
        "summary": "Flutter Developer with 3-5 years experience required to build cross-platform mobile apps using Dart and Flutter frameworks."
    },
    {
        "job_title": "Software Test Engineer",
        "company": "Kameda Infologics (P) Ltd",
        "url": "https://technopark.org/job-details/27728",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Kameda Infologics (P) Ltd</strong>\n2nd Floor, Amstor House, Technopark Campus, Trivandrum, Kerala, 695581\n<a href=\"http://www.kamedainfologics.com\">http://www.kamedainfologics.com</a></p>\n<h2>Job Details</h2>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> preeyanka@kamedainfologics.com</p>\n<h2>Brief Description</h2>\n<p>At Kameda Infologics, we apply cutting-edge technology to solve healthcare challenges. As a <strong>Software Test Engineer</strong>, you will evaluate software functions, design test protocols, and ensure product quality through manual and automated testing.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Test software releases during product development</li>\n<li>Configure hardware and operating environments for testing</li>\n<li>Provide technical expertise on products and environments</li>\n<li>Develop test conditions, test cases, and execute test case execution</li>\n<li>Report, track, and close bugs</li>\n<li>Improve testing processes</li>\n<li>Develop and execute automated scripts in <strong>Selenium/Java</strong></li>\n<li>Identify areas/test cases for automation</li>\n<li>Coordinate with test and development teams to resolve issues</li>\n<li>Debug test cases and fix errors</li>\n<li>Execute test cases and generate defect reports</li>\n<li>Define and export test results</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Highly organized and detail-oriented</li>\n<li>Ability to handle multiple tasks in a fast-paced environment</li>\n<li>Excellent documentation and organizational skills</li>\n<li>Familiarity with testing methodologies and defect reporting</li>\n</ul>\n<h2>Education &amp; Experience</h2>\n<ul>\n<li><strong>Education:</strong> B.E/B.Tech/MCA/M.Sc</li>\n<li><strong>Certification:</strong> Software testing course from a reputed institution (ISTQB preferred)</li>\n<li><strong>Experience:</strong> 3 to 6 years in testing (manual/automation)</li>\n<li><strong>Technical Knowledge:</strong> Programming languages</li>\n</ul>",
        "tags": [
            "3-6 Years",
            "Selenium",
            "Java",
            "Test Automation"
        ],
        "summary": "Kameda Infologics seeks a Software Test Engineer with 3-6 years of experience in manual and automated testing using Selenium and Java. Responsibilities include test case development, bug tracking, and collaboration with development teams."
    },
    {
        "job_title": "Site supervisor",
        "company": "Hyz Ventures Intl (P) Ltd",
        "url": "https://technopark.org/job-details/27727",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>HYZ VENTURES INTL (P) Ltd is a diversified business group managing multiple companies across different domains. We are seeking a <strong>Site Supervisor</strong> to coordinate operational requirements across our group companies.</p>\n<h2>Job Responsibilities</h2>\n<ul>\n<li>Coordinate and supervise day-to-day site operations across multiple company units</li>\n<li>Communicate with departments to fulfill requirements on time</li>\n<li>Monitor staff activities and ensure smooth workflow</li>\n<li>Maintain documentation and daily reports</li>\n<li>Ensure discipline, productivity, and quality standards at each site</li>\n<li>Handle vendor coordination and basic administrative tasks</li>\n<li>Identify operational issues and report to management with solutions</li>\n<li>Ensure compliance with company policies and procedures</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Proven experience as a Site Supervisor or similar role (any industry)</li>\n<li>Strong coordination and communication skills</li>\n<li>Ability to handle multiple tasks and work under pressure</li>\n<li>Basic computer knowledge (MS Office, reporting)</li>\n<li>Leadership and problem-solving ability</li>\n<li>Willingness to travel between company units if required</li>\n</ul>\n<h2>Salary &amp; Contact</h2>\n<ul>\n<li>Salary: ₹18,000 – ₹25,000 per month (Based on experience and performance)</li>\n<li>Closing Date: 23, Feb 2026</li>\n<li>Job Published: 16, Feb 2026</li>\n<li>Contact Email: <a href=\"mailto:hr@hyzventures.com\">hr@hyzventures.com</a></li>\n<li>Application Subject Line: <strong>Application for Site Supervisor</strong></li>\n</ul>",
        "tags": [
            "Not Specified",
            "Site Supervisor",
            "Coordination",
            "Communication"
        ],
        "summary": "Hyz Ventures Intl seeks a proactive Site Supervisor to coordinate operations across multiple units, ensuring productivity and compliance with company standards."
    },
    {
        "job_title": "Software developer Fresher (2025/2026)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27726",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p>Software Developer Fresher (2025/2026)</p>\n<h2>Closing Date</h2>\n<p>02, Apr 2026</p>\n<h2>Job Published</h2>\n<p>16, Feb 2026</p>\n<h2>Contact</h2>\n<p><strong>Email:</strong> <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<h2>Brief Description</h2>\n<p>We are seeking fresh CS graduates/Postgraduates eager to build a career in software development and work with the <strong>Symfony framework</strong>.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to continuous codebase improvement.</li>\n<li>Troubleshoot and debug issues as they arise.</li>\n<li>Collaborate with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Proficiency in programming with a strong grasp of core concepts.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Knowledge of statistical concepts and techniques.</li>\n<li>Excellent communication and presentation skills.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science or related field.</li>\n<li><strong>Experience:</strong> 0-1 years.</li>\n<li><strong>Salary Package:</strong> 4-6 LPA</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Symfony Framework",
            "Core Programming Concepts",
            "Problem-Solving Skills"
        ],
        "summary": "Seeking fresh CS graduates for a Software Developer role focused on Symfony framework. Requires strong programming skills and eagerness to learn in a collaborative environment."
    },
    {
        "job_title": "Software developer (Entry level)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27725",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581</p>\n<p><strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<p><strong>Job Title:</strong> Software Developer (Entry Level)</p>\n<p><strong>Closing Date:</strong> 02, Apr 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking fresh CS graduates/Postgraduates who are eager to build a career in software development and work with the Symfony framework.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to continuous codebase improvement.</li>\n<li>Troubleshoot and debug issues as they arise.</li>\n<li>Collaborate with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in programming with a strong grasp of core concepts.</li>\n<li>Strong problem-solving skills to analyze and resolve programming challenges.</li>\n<li>Knowledge of statistical concepts and techniques.</li>\n<li>Excellent analytical and communication skills.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science or a related field.</li>\n<li><strong>Experience:</strong> 0-1 years.</li>\n<li><strong>Salary Package:</strong> 4-6 LPA</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Symfony Framework",
            "Problem-Solving Skills",
            "Programming Proficiency"
        ],
        "summary": "Entry-level Software Developer role for fresh CS graduates to work with Symfony framework, focusing on application development and problem-solving."
    },
    {
        "job_title": "Sr layout Artist",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/27724",
        "location": "Technopark",
        "closing_date": "25 Feb 2026",
        "job_description": "<p><strong>Prayan Animation Studio (P) Ltd</strong>\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala, India - 695 581\n<a href=\"http://www.prayananimation.com\">www.prayananimation.com</a></p>\n<p><strong>Senior Layout Artist</strong>\n<strong>Closing Date:</strong> 25, Feb 2026\n<strong>Published:</strong> 16, Feb 2026\n<strong>Contact:</strong> <a href=\"mailto:jobs@prayananimation.com\">jobs@prayananimation.com</a></p>\n<h3>Job Overview</h3>\n<p>We are seeking a talented and experienced <strong>Layout Artist</strong> with <strong>3 to 5 years</strong> of experience in visual design. The ideal candidate will create visually compelling layouts for animation, video games, or media projects, ensuring alignment with artistic vision and technical requirements.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Scene Composition &amp; Design:</strong> Develop detailed layouts with strong perspective, depth, and proportion.</li>\n<li><strong>Collaborate with Teams:</strong> Work with art directors, animators, and production teams to meet creative and technical goals.</li>\n<li><strong>Creative Problem-Solving:</strong> Innovate solutions while maintaining visual integrity.</li>\n<li><strong>Consistency:</strong> Ensure uniform visual style across all layouts.</li>\n<li><strong>Feedback &amp; Revisions:</strong> Adjust designs based on director and senior artist feedback.</li>\n<li><strong>Technical Proficiency:</strong> Master industry tools like Adobe Photoshop/Illustrator for high-quality outputs.</li>\n<li><strong>Attention to Detail:</strong> Perfect background elements, character placements, and props for immersive environments.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> 3–5 years in layout art with a strong portfolio.</li>\n<li><strong>Software Skills:</strong> Advanced in Adobe Photoshop, Illustrator, or similar tools.</li>\n<li><strong>Design Principles:</strong> Expertise in perspective, balance, contrast, and visual storytelling.</li>\n<li><strong>Creativity:</strong> Ability to innovate while maintaining project aesthetics.</li>\n<li><strong>Communication:</strong> Strong collaboration skills for cross-functional teams.</li>\n<li><strong>Detail-Oriented:</strong> Precision in both artistic and technical execution.</li>\n</ul>\n<h3>Job Type</h3>\n<ul>\n<li><strong>Full Time</strong></li>\n<li><strong>Day Shift</strong></li>\n<li><strong>Relocation Required:</strong> Trivandrum, Kerala</li>\n<li><strong>Start Date:</strong> Immediate joining</li>\n</ul>\n<h3>How to Apply</h3>\n<ul>\n<li>Submit resume and portfolio link to <a href=\"mailto:jobs@prayananimation.com\">jobs@prayananimation.com</a></li>\n<li>Email subject: <strong>Resume – “Layout Artist”</strong></li>\n</ul>",
        "tags": [
            "3 to 5 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Perspective Design"
        ],
        "summary": "Senior Layout Artist with 3–5 years of experience in scene composition, perspective design, and collaboration with creative teams. Requires proficiency in Adobe tools and a strong portfolio."
    },
    {
        "job_title": "IT Sales Executive",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/27723",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>QWY Software (P) Ltd</strong>\nSecond Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581</p>\n<h2>Job Overview</h2>\n<p><strong>Role:</strong> IT Sales Executive\n<strong>Industry:</strong> IT/ITES (E-commerce, Logistics, Hyperlocal Delivery Services)\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> careers@qwysoft.com</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Identify and generate new business opportunities in the IT sector</li>\n<li>Understand client requirements and offer suitable IT solutions</li>\n<li>Maintain strong relationships with clients</li>\n<li>Achieve monthly and quarterly sales targets</li>\n<li>Prepare proposals, presentations, and sales reports</li>\n<li>Coordinate with internal teams for smooth project execution</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>MBA (Marketing/IT/Business) or any Degree (Mandatory)</li>\n<li>Minimum 1 year experience in IT Sales</li>\n<li>Excellent communication and negotiation skills</li>\n<li>Good understanding of IT products and services</li>\n<li>Strong interpersonal skills</li>\n<li>Target-oriented and self-motivated</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates should share their CV to <strong>careers@qwysoft.com</strong> with the subject line <strong>\"IT Sales\"</strong>.</p>",
        "tags": [
            "1+ Year",
            "IT Sales",
            "Communication Skills",
            "MBA (Marketing/IT/Business)"
        ],
        "summary": "Seeking an IT Sales Executive with 1+ year of experience to generate business opportunities, build client relationships, and meet sales targets. Requires strong communication, IT product knowledge, and MBA in relevant fields."
    },
    {
        "job_title": "Junior System Administrator -  Linux (Freshers)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27722",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a>\n<strong>Closing Date:</strong> 02, Apr 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Junior Linux System Administrator</strong> to support and maintain Linux-based infrastructure and assist in implementing security controls. This role is ideal for someone eager to build a strong foundation in system administration, infrastructure operations, and security best practices.</p>\n<h3>Key Responsibilities</h3>\n<h4>Infrastructure Support</h4>\n<ul>\n<li>Assist in maintaining and monitoring Linux-based servers</li>\n<li>Support on-premise and cloud infrastructure (basic exposure)</li>\n<li>Monitor server health, disk usage, CPU, memory, and uptime</li>\n<li>Assist with application deployment, configuration, and backups</li>\n<li>Perform basic troubleshooting for server and infrastructure issues</li>\n<li>Maintain infrastructure documentation and system records</li>\n</ul>\n<h4>Network &amp; Systems</h4>\n<ul>\n<li>Support networking fundamentals including IP addressing, DNS, and firewalls</li>\n<li>Assist in managing SSL certificates, VPN access, and basic network security</li>\n<li>Coordinate with senior engineers for system upgrades and changes</li>\n</ul>\n<h4>Security Responsibilities</h4>\n<ul>\n<li>Assist in implementing system hardening and security best practices</li>\n<li>Monitor system logs and alerts for potential security issues</li>\n<li>Support patching and vulnerability remediation</li>\n<li>Assist in managing user access, roles, and permissions</li>\n<li>Help with backup verification and disaster recovery activities</li>\n</ul>\n<h4>Compliance &amp; Best Practices</h4>\n<ul>\n<li>Follow defined security policies and operational procedures</li>\n<li>Support internal and external audits when required</li>\n<li>Ensure systems adhere to security and compliance guidelines</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>Basic to intermediate knowledge of Linux operating systems</li>\n<li>Understanding of server concepts and system services</li>\n<li>Basic knowledge of networking fundamentals (IP, DNS, ports, firewalls)</li>\n<li>Awareness of information security fundamentals</li>\n<li>Good problem-solving and troubleshooting skills</li>\n<li>Willingness to learn and adapt in a production environment</li>\n</ul>\n<h3>Work Flexibility &amp; Support Requirements</h3>\n<ul>\n<li>Willingness to provide off-day, after-hours, or on-call support when required</li>\n<li>Ability to respond to critical incidents and system outages</li>\n<li>Flexible mindset to support infrastructure operations in a 24×7 environment (rotational / need-based)</li>\n</ul>\n<h3>Preferred Certifications (Not Mandatory)</h3>\n<ul>\n<li>RHCSA / RHCE</li>\n<li>CCNA (Basic networking knowledge)</li>\n<li>AWS / Azure Fundamentals</li>\n</ul>\n<h3>Experience</h3>\n<p><strong>0–2 years</strong> of experience in Infrastructure, Linux Administration, or Security\n<strong>Salary:</strong> 4-6 LPA\n<strong>Work Location:</strong> Work from office, Trivandrum\n<strong>Eligibility:</strong> Fresh graduates with strong Linux fundamentals are encouraged to apply</p>\n<h3>Career Growth Opportunity</h3>\n<ul>\n<li>Opportunity to grow into DevOps, Cloud, or Security roles based on interest and performance</li>\n<li>Exposure to real-world production environments and enterprise systems</li>\n<li>Continuous learning through hands-on experience and mentorship</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Hands-on experience with Linux production servers</li>\n<li>Structured learning and mentorship</li>\n<li>Stable and security-focused working environment</li>\n<li>Clear technical growth path</li>\n</ul>",
        "tags": [
            "0–2 Years",
            "Linux Administration",
            "Networking Fundamentals",
            "Information Security"
        ],
        "summary": "Junior Linux System Administrator role for freshers to support infrastructure, security, and cloud environments with growth into DevOps or Security."
    },
    {
        "job_title": "Technical Sales Specialist | 0-5yrs",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27721",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p><strong>Technical Sales Specialist</strong></p>\n<h2>Application Details</h2>\n<ul>\n<li><strong>Closing Date</strong>: 02, Apr 2026</li>\n<li><strong>Job Published</strong>: 16, Feb 2026</li>\n<li><strong>Contact Email</strong>: <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></li>\n</ul>\n<h2>Job Summary</h2>\n<p>Type: Full-Time | On-Site\nExperience: 0-5 years\nLanguage Requirement: Fluent in English</p>\n<p>We are seeking a <strong>Technical Sales &amp; Marketing Specialist</strong> to drive sales and marketing initiatives for our Hospital Management Software (HMS) solutions. The ideal candidate will expand our healthcare domain reach, demonstrate strong presentation skills, and fluency in Hindi for effective communication with a broad client base.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Develop and execute strategic sales plans to meet targets and accelerate business growth in healthcare software.</li>\n<li>Identify and engage new prospects (hospitals, clinics, diagnostic centers, healthcare networks).</li>\n<li>Maintain client relationships by understanding operational needs and offering tailored HMS solutions.</li>\n<li>Design integrated marketing campaigns aligned with company GTM strategy.</li>\n<li>Conduct market research and competitor analysis to adapt to healthcare market needs.</li>\n<li>Create marketing content (brochures, case studies, presentations) with brand consistency.</li>\n<li>Collaborate with product, sales, and support teams to align messaging and improve engagement.</li>\n<li>Analyze campaign performance and ROI for data-driven improvements.</li>\n<li>Stay updated on healthcare trends, software innovations, and regulatory guidelines.</li>\n<li>Represent the company at industry events, conferences, and webinars.</li>\n</ul>\n<h2>Required Qualifications &amp; Skills</h2>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Healthcare IT, or related field (MBA preferred).</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li>Fluency in Hindi and English for client communication in Hindi-speaking regions.</li>\n<li>Familiarity with Hospital Management Systems (HMS), EMR/EHR solutions, or healthcare IT workflows.</li>\n<li>Ability to create effective marketing materials and sales presentations.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Self-driven, target-oriented.</li>\n<li>Capable of independent work.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Experience in client demos and product presentations.</li>\n<li>Willingness to travel for client meetings, demos, and events.</li>\n</ul>\n<h2>Salary Package</h2>\n<p>7-11 LPA</p>",
        "tags": [
            "0-5 Years",
            "Hospital Management Systems (HMS)",
            "EMR/EHR Solutions",
            "Healthcare IT"
        ],
        "summary": "Technical Sales Specialist for Hospital Management Software with 0-5 years experience, driving sales and marketing in healthcare IT."
    },
    {
        "job_title": "AI Solutions Architect / AI Engineer",
        "company": "Cocopalms Tech (P) Ltd",
        "url": "https://technopark.org/job-details/27720",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Cocopalms Tech (P) Ltd</h2>\n<p><strong>Contact Email:</strong> aiswarya@cocopalms.io</p>\n<h3>About Cocopalms Tech</h3>\n<p>Cocopalms Tech is a software product company building next-generation AI-enabled business solutions under the BizoSuite ecosystem, including ERP, accounting, meal prep management, CRM, and property management systems. We are transforming traditional business operations using intelligent automation and data-driven insights.</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced <strong>AI Solutions Architect / AI Engineer</strong> to lead the design and implementation of AI capabilities across all our applications. This role is responsible for defining AI architecture, integrating AI services (LLMs, ML models, predictive analytics), and building scalable AI solutions that enhance business intelligence, automation, and customer experience across the BizoSuite ecosystem.</p>\n<h3>Key Responsibilities</h3>\n<h4>AI Architecture &amp; Strategy</h4>\n<ul>\n<li>Design company-wide AI architecture for all products.</li>\n<li>Define reusable AI services and APIs across applications.</li>\n<li>Establish AI integration standards and best practices.</li>\n<li>Align AI strategy with business objectives and product vision.</li>\n</ul>\n<h4>AI Integration &amp; Development</h4>\n<ul>\n<li>Integrate AI services such as OpenAI, Gemini, or local LLMs.</li>\n<li>Design AI-driven dashboards for predictions, insights, and anomaly detection.</li>\n<li>Develop AI modules for customer retention, sales forecasting, sales/promotion analytics, and meal recommendation intelligence.</li>\n<li>Implement AI-powered insights and automation.</li>\n</ul>\n<h4>Machine Learning &amp; Data Intelligence</h4>\n<ul>\n<li>Design ML pipelines using structured business data.</li>\n<li>Develop predictive models for retention/churn analysis, demand forecasting, customer segmentation, and pricing/promotion analysis.</li>\n<li>Work with analytics and reporting systems.</li>\n</ul>\n<h4>AI Platform Engineering</h4>\n<ul>\n<li>Build centralized AI services usable by multiple apps.</li>\n<li>Design secure APIs between AI services and backend systems.</li>\n<li>Ensure scalability for multi-tenant SaaS environments.</li>\n<li>Optimize AI performance and cost.</li>\n</ul>\n<h4>Security &amp; Governance</h4>\n<ul>\n<li>Ensure data privacy and secure AI usage.</li>\n<li>Design AI workflows for on-prem enterprise deployments.</li>\n<li>Implement responsible AI practices and auditability.</li>\n</ul>\n<h4>Cross-Team Collaboration</h4>\n<ul>\n<li>Work with product managers, developers, and leadership.</li>\n<li>Mentor development teams on AI integration.</li>\n<li>Translate business problems into AI solutions.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, AI, ML, Data Science, or related field.</li>\n<li>Master’s degree in AI/ML or Computer Science preferred.</li>\n<li>Equivalent industry experience in large-scale AI solutions may substitute advanced education.</li>\n<li>Relevant AI cloud certifications (Azure AI Engineer, AWS AI/ML, Google Vertex AI) are highly desirable.</li>\n</ul>\n<h3>What Makes This Role Unique</h3>\n<p>You will architect AI for an entire product ecosystem impacting:\n- Finance &amp; ERP\n- Meal Prep Automation\n- Customer Management\n- Real Estate &amp; Operations</p>\n<p>This is a <strong>company-wide AI leadership position</strong>, not a single-project role.</p>\n<h3>Preferred Skills</h3>\n<h4>Technical Skills</h4>\n<ul>\n<li>Strong understanding of AI/ML architecture.</li>\n<li>Experience with LLM integration (OpenAI, Gemini, etc.).</li>\n<li>Knowledge of Python (ML pipelines), Node.js backend integration, REST APIs/microservices.</li>\n<li>Experience with vector databases (pgvector, Qdrant, Pinecone), RDBMS (PostgreSQL), NoSQL (MongoDB), embeddings/RAG architecture.</li>\n<li>Strong data modeling and analytics experience.</li>\n</ul>\n<h4>Machine Learning</h4>\n<ul>\n<li>Experience with XGBoost/LightGBM, forecasting models (Prophet, ARIMA), recommendation systems.</li>\n<li>Understanding of model evaluation and deployment.</li>\n</ul>\n<h4>Architecture &amp; Systems</h4>\n<ul>\n<li>Cloud/on-prem deployment experience.</li>\n<li>Distributed systems and scalable architecture design.</li>\n<li>API-first design approach.</li>\n</ul>\n<h4>Soft Skills</h4>\n<ul>\n<li>Product-oriented thinking.</li>\n<li>Strong problem-solving ability.</li>\n<li>Ability to communicate with technical and business teams.</li>\n<li>Leadership and mentorship mindset.</li>\n</ul>\n<h4>Nice to Have</h4>\n<ul>\n<li>Experience with SaaS ERP or business automation systems.</li>\n<li>Experience in F&amp;B, meal prep, or subscription-based businesses.</li>\n<li>DevOps knowledge (Docker, Kubernetes).</li>\n<li>Experience building AI dashboards.</li>\n</ul>\n<h3>Success Metrics (KPIs)</h3>\n<ul>\n<li>AI features delivered across products.</li>\n<li>Reduction in churn using predictive AI.</li>\n<li>AI adoption across BizoSuite modules.</li>\n<li>Prediction accuracy performance.</li>\n<li>Business impact through AI insights.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "AI/ML Architecture",
            "Python",
            "REST APIs"
        ],
        "summary": "Lead the design and implementation of AI solutions across the BizoSuite ecosystem, enhancing business intelligence and automation. Requires expertise in AI/ML architecture, Python, and scalable system design."
    },
    {
        "job_title": "Lead - Data Scientist/Data Analyst",
        "company": "Magpii Innovations Private Limited",
        "url": "https://technopark.org/job-details/27719",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Magpii Innovations Private Limited</strong>\n2nd FLOOR, M SQUARED BUILDING, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA - 695581\n<a href=\"http://www.magpiitech.com\">http://www.magpiitech.com</a></p>\n<h2>Job Details</h2>\n<p><strong>Role</strong>: Lead - Data Scientist/Data Analyst\n<strong>Closing Date</strong>: 31, Mar 2026\n<strong>Published</strong>: 16, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@magpiitech.com\">careers@magpiitech.com</a></p>\n<h2>The Role</h2>\n<p>We are seeking a seasoned <strong>Lead - Data Scientist / Data Analyst</strong> with <strong>8+ years of experience</strong> to lead our data intelligence initiatives. You will transform massive volumes of operational (OT) and enterprise (IT) data into actionable strategic insights, requiring deep statistical expertise, industrial domain knowledge, AI/ML proficiency, and executive communication skills.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Operational Intelligence</strong>: Develop predictive models for industrial use cases (Predictive Maintenance, RUL estimation, anomaly detection in heavy machinery).</li>\n<li><strong>Enterprise Analytics</strong>: Optimize business processes, financial forecasting, and resource allocation via ERP/CRM/Supply Chain data analysis.</li>\n<li><strong>Agentic Data Frameworks</strong>: Collaborate on \"Reason + Act\" loops for autonomous agentic workflows.</li>\n<li><strong>Architecture Design</strong>: Lead scalable data pipelines and \"Single Source of Truth\" architectures for multinational industrial clients.</li>\n<li><strong>Stakeholder Management</strong>: Translate data science insights into value-driven narratives for C-suite stakeholders.</li>\n<li><strong>Mentorship</strong>: Guide junior teams in data cleaning, feature engineering, and model validation.</li>\n</ul>\n<h3>Required Technical Skills</h3>\n<ul>\n<li><strong>Advanced Analytics</strong>: Python/R, SQL, statistical modeling</li>\n<li><strong>Machine Learning</strong>: Scikit-learn, XGBoost, TensorFlow/PyTorch</li>\n<li><strong>Generative AI</strong>: Expertise in Generative AI and agentic systems</li>\n<li><strong>Data Orchestration</strong>: Airflow, Databricks, Snowflake</li>\n<li><strong>Visualization</strong>: PowerBI/Tableau for executive dashboards</li>\n<li><strong>Cloud Platforms</strong>: AWS SageMaker, Azure ML, Google Cloud Vertex AI</li>\n</ul>\n<h3>Qualifications &amp; Soft Skills</h3>\n<ul>\n<li><strong>Education</strong>: Bachelor’s/Master’s in Computer Science, Data Science, AI, or related fields</li>\n<li><strong>Experience</strong>: Proven ROI delivery in Industrial/Energy/Logistics sectors</li>\n<li><strong>Communication</strong>: Exceptional English (written/verbal) for data storytelling</li>\n<li><strong>Mindset</strong>: \"Founding Team\" mentality with solution-building agility</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>SQL/cloud data platform experience</li>\n<li>MLOps/AI deployment workflows</li>\n<li>AI integration into business applications</li>\n<li>Consulting/enterprise analytics background</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>If your profile matches, email <strong>careers@magpiitech.com</strong> with the job title included in your subject line.</p>",
        "tags": [
            "8+ Years",
            "Python/R",
            "Machine Learning",
            "Generative AI"
        ],
        "summary": "Lead Data Scientist/Analyst with 8+ years to design predictive models, optimize enterprise analytics, and build agentic AI systems for industrial clients."
    },
    {
        "job_title": "Technical Sales Specialist | 0-3yrs",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27718",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>Company Info</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">Website</a></p>\n<h2>Job Title</h2>\n<p><strong>Technical Sales Specialist</strong></p>\n<h2>Experience Required</h2>\n<p>0-3 Years</p>\n<h2>Closing Date</h2>\n<p>02, Apr 2026</p>\n<h2>Job Published</h2>\n<p>16, Feb 2026</p>\n<h2>Contact Information</h2>\n<p><strong>Email:</strong> <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<h2>Job Summary</h2>\n<p>We are seeking a <strong>Technical Sales &amp; Marketing Specialist</strong> to drive sales and marketing initiatives for our <strong>Hospital Management Software (HMS)</strong> solutions. The role focuses on expanding our healthcare domain reach, requiring strong presentation skills, revenue growth strategies, and fluency in Hindi for effective client communication.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Develop and execute strategic sales plans to meet company targets in healthcare software.</li>\n<li>Identify and engage new prospects (hospitals, clinics, diagnostic centers).</li>\n<li>Maintain client relationships by understanding operational needs and offering tailored HMS solutions.</li>\n<li>Design integrated marketing campaigns aligned with GTM strategy.</li>\n<li>Conduct market research and competitor analysis.</li>\n<li>Create marketing content (brochures, case studies) with brand consistency.</li>\n<li>Collaborate with product, sales, and support teams.</li>\n<li>Analyze campaign performance and ROI for data-driven improvements.</li>\n<li>Stay updated on healthcare trends, software innovations, and regulations.</li>\n<li>Represent the company at industry events/webinars.</li>\n</ul>\n<h2>Required Qualifications &amp; Skills</h2>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Healthcare IT, or related field (MBA preferred).</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li><strong>Fluent in Hindi and English</strong> for client interactions in Hindi-speaking regions.</li>\n<li>Familiarity with <strong>Hospital Management Systems (HMS)</strong>, EMR/EHR solutions, or healthcare IT workflows.</li>\n<li>Ability to create marketing materials and sales presentations.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Self-driven, target-oriented.</li>\n<li>Capable of independent work.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Experience in client demos and product presentations.</li>\n<li>Willingness to travel for client meetings and events.</li>\n</ul>\n<h2>Salary Package</h2>\n<p>7-11 LPA</p>",
        "tags": [
            "0-3 Years",
            "Hospital Management Systems",
            "Marketing Campaigns",
            "Healthcare IT"
        ],
        "summary": "Technical Sales Specialist driving healthcare software sales and marketing. Requires Hindi/English fluency, sales expertise, and HMS knowledge."
    },
    {
        "job_title": "Sr.Wordpress Developer",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27716",
        "location": "Technopark",
        "closing_date": "22 Feb 2026",
        "job_description": "<p><strong>Softnotions Technologies (P) Ltd</strong></p>\n<p><strong>Location:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</p>\n<p><strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a></p>\n<p><strong>Job Title:</strong> Sr. WordPress Developer</p>\n<p><strong>Closing Date:</strong> 22, Feb 2026</p>\n<p><strong>Published Date:</strong> 16, Feb 2026</p>\n<p><strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a skilled WordPress Developer to independently manage ongoing maintenance, enhancements, and new feature development across multiple WordPress websites. The role demands deep expertise in WordPress internals, including Gutenberg, theme/child theme architecture, custom plugin development, WordPress APIs, and performance/SEO best practices.</p>\n<h3>Key Responsibilities</h3>\n<h4>WordPress Development &amp; Maintenance</h4>\n<ul>\n<li>Maintain, enhance, and troubleshoot existing WordPress websites.</li>\n<li>Develop custom WordPress themes and child themes based on design requirements.</li>\n<li>Customize and extend Gutenberg blocks and block-based themes.</li>\n<li>Build and maintain custom WordPress plugins for business-specific functionality.</li>\n<li>Handle WordPress core, plugin, and theme updates safely.</li>\n</ul>\n<h4>Core WordPress &amp; APIs</h4>\n<ul>\n<li>Work with WordPress Hooks (Actions &amp; Filters) to extend functionality.</li>\n<li>Develop and consume WordPress REST APIs for integrations.</li>\n<li>Implement custom post types, taxonomies, and meta fields.</li>\n<li>Ensure compatibility with WordPress coding standards and best practices.</li>\n</ul>\n<h4>Performance, Security &amp; SEO</h4>\n<ul>\n<li>Optimize website performance (caching, asset optimization, query optimization).</li>\n<li>Implement WordPress security best practices (nonces, sanitization, escaping).</li>\n<li>Support SEO using tools like Yoast or RankMath.</li>\n<li>Ensure SEO structure: metadata, schema, URLs, performance, and mobile friendliness.</li>\n</ul>\n<h4>Collaboration &amp; Quality</h4>\n<ul>\n<li>Collaborate with designers, backend teams, and stakeholders.</li>\n<li>Debug and analyze production issues.</li>\n<li>Maintain clean, documented, version-controlled code (Git).</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong hands-on experience with WordPress core development.</li>\n<li>Deep understanding of Gutenberg editor, themes/child themes, custom plugins, hooks, and APIs.</li>\n<li>Proficiency in PHP, HTML5, CSS3, JavaScript.</li>\n<li>Experience with page builders (Elementor/WPBakery) and their customization.</li>\n<li>Solid MySQL and WordPress database knowledge.</li>\n<li>SEO plugin experience and on-page optimization.</li>\n<li>Performance optimization and caching techniques.</li>\n<li>Git/version control expertise.</li>\n<li>Gutenberg custom block development (ACF blocks or native blocks).</li>\n<li>WooCommerce customization.</li>\n<li>Headless WordPress or REST-based integrations.</li>\n<li>Hosting environment experience (cPanel, Cloud, CDN, staging setups).</li>\n</ul>\n<h3>Experience &amp; Qualification</h3>\n<ul>\n<li><strong>4+ years</strong> of real-world WordPress development experience.</li>\n<li>Proven experience maintaining and extending live WordPress websites.</li>\n<li>Degree in Computer Science/IT or equivalent practical experience.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "WordPress",
            "PHP",
            "Git"
        ],
        "summary": "A senior WordPress developer with 4+ years of experience required to manage WordPress sites, develop custom themes/plugins, and optimize SEO and performance."
    },
    {
        "job_title": "Business Associate -Inside Sales",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27715",
        "location": "Technopark",
        "closing_date": "22 Feb 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Address</strong>: Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website</strong>: <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Contact Email</strong>: recruitment@softnotions.com</p>\n<h3>Job Title: Business Associate - Inside Sales</h3>\n<p><strong>Closing Date</strong>: 22, Feb 2026\n<strong>Published Date</strong>: 16, Feb 2026</p>\n<h3>Role Overview</h3>\n<p>Softnotions Technologies seeks energetic, tech-savvy individuals passionate about business growth and international sales. As part of the Revenue Operations Team, you will identify global business opportunities, build a strong lead pipeline, and support the sales cycle end-to-end. This role offers hands-on exposure to international markets (US, Europe, Middle East) and practical experience in prospecting, CRM management, client communication, and sales coordination.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct market research and identify potential international clients in targeted verticals (US, Europe, Middle East, etc.)</li>\n<li>Generate qualified leads via outbound email campaigns, LinkedIn prospecting, and cold calls</li>\n<li>Build/maintain a strong prospect pipeline in the CRM system</li>\n<li>Understand and communicate Softnotions’ service value propositions to clients</li>\n<li>Schedule/coordinate meetings/demos for the Business Development Manager or Technical Sales Team</li>\n<li>Support RFP/RFI processes with background data and documentation</li>\n<li>Maintain reports/dashboards to track outreach and conversion metrics</li>\n<li>Collaborate with marketing/delivery teams to align messaging and client approach</li>\n<li>Assist in proposal follow-ups, lead nurturing, and basic client queries</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong communication skills (written/verbal) – English proficiency mandatory</li>\n<li>Understanding of technology trends, software development, and digital transformation</li>\n<li>Basic CRM tool knowledge (HubSpot, Zoho, or equivalent)</li>\n<li>Ability to work across international time zones/cultures</li>\n<li>High attention to detail, responsiveness, and follow-through</li>\n<li>Positive attitude, growth mindset, eagerness to learn</li>\n<li><strong>Education</strong>: BSC/BTech (CS) + MBA (Marketing)</li>\n</ul>\n<h3>Contact</h3>\n<p>For inquiries, email: <a href=\"mailto:recruitment@softnotions.com\">recruitment@softnotions.com</a></p>",
        "tags": [
            "0-2 Years",
            "CRM Tools (HubSpot, Zoho)",
            "International Sales",
            "Communication Skills"
        ],
        "summary": "Support international sales by generating leads, managing CRM, and coordinating with teams to drive business expansion. Requires strong communication and tech-savvy skills."
    },
    {
        "job_title": "LINUX SYSTEM ADMINISTRATOR",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27714",
        "location": "Technopark",
        "closing_date": "22 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Softnotions Technologies (P) Ltd</strong>\nModule No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<a href=\"https://softnotions.com\">https://softnotions.com</a></p>\n<h2>Job Details</h2>\n<p><strong>Position</strong>: LINUX SYSTEM ADMINISTRATOR\n<strong>Closing Date</strong>: 22, Feb 2026\n<strong>Published Date</strong>: 16, Feb 2026\n<strong>Contact Email</strong>: recruitment@softnotions.com</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Proficiency in Linux, Windows 2008/2012, Windows 8/10, and Apple Macintosh OS</li>\n<li>Configure and manage DNS, WINS, DHCP, TCP/IP, RIP v1/2, IGRP, EIGRP, OSPF, routing, and WiFi access</li>\n<li>Troubleshoot network issues and implement LAN designs</li>\n<li>Administer web CMS hosting, security patching, and web traffic management (Iptables, Squid, URL filtering)</li>\n<li>Database administration (MySQL, SQL Server)</li>\n<li>Web server administration (Apache, IIS); Nginx configuration preferred</li>\n<li>Virtualization, cloud server administration, and clustering</li>\n<li>Version control using Git and Subversion</li>\n<li>Configure and troubleshoot email servers, relays, and hardware/software issues</li>\n<li>Provide technical support for hardware/software</li>\n<li>Secure office networks and manage server security (hardening, Deny Hosts, CMS updates)</li>\n<li>Track office assets and upgrade systems for enhanced functionality and security</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>4+ years of Linux administration experience</li>\n<li>Experience configuring Apache, Nginx, and Apache-Tomcat</li>\n<li>Database administration knowledge</li>\n<li>Cloud server management</li>\n<li>Server security hardening (Deny Hosts, web server security)</li>\n<li>Server configuration, installation, and optimization</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Linux Administration",
            "Networking (DNS, DHCP, TCP/IP)",
            "Web Servers (Apache, Nginx)"
        ],
        "summary": "Linux System Administrator role requiring 4+ years of experience in Linux, networking, and web server management. Responsibilities include system security, cloud administration, and technical support."
    },
    {
        "job_title": "Senior Digital Marketing Specialist -Immediate joinees prefered",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27713",
        "location": "Technopark",
        "closing_date": "19 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Softnotions Technologies (P) Ltd\n<strong>Location:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Job Title:</strong> Senior Digital Marketing Specialist\n<strong>Closing Date:</strong> 19, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Digital Marketing Lead</strong> with <strong>6+ years of IT experience</strong> in Digital Marketing. Immediate joiners (within 15 days) are preferred.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and implement digital marketing strategies across SEO, PPC, email marketing, social media, content marketing, and LinkedIn automation.</li>\n<li>Follow best practices for social media marketing on platforms like Facebook, Instagram, LinkedIn, etc.</li>\n<li>Launch optimized online advertisements to enhance brand awareness.</li>\n<li>Create and manage link-building and content marketing strategies.</li>\n<li>Measure ROI and KPIs for campaign performance.</li>\n<li>Plan and execute social media strategies to drive traffic and engagement.</li>\n<li>Stay updated on industry trends, technologies, and digital marketing best practices.</li>\n<li>Monitor and manage online reputation via social media and review platforms.</li>\n<li>Adapt to search engine algorithm changes to maximize organic visibility.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>MBA in Marketing or a Diploma in Digital Marketing (preferred).</li>\n<li>Proven experience in digital marketing, ideally in a similar role.</li>\n<li>Proficiency in tools: Google Analytics, Google Ads, SEO tools, email marketing platforms, and social media management tools.</li>\n<li>Expertise in managing PPC campaigns (keyword research, bid management, performance tracking).</li>\n<li>Strong analytical skills for data interpretation and decision-making.</li>\n<li>Up-to-date knowledge of SEO best practices and search algorithms.</li>\n<li>Excellent communication skills for creating persuasive content.</li>\n<li>Self-motivated with problem-solving and continuous learning capabilities.</li>\n</ul>\n<p><strong>Experience Required:</strong> 6+ years preferred.</p>",
        "tags": [
            "6+ Years",
            "Google Analytics",
            "Google Ads",
            "SEO"
        ],
        "summary": "Senior Digital Marketing Specialist with 6+ years of experience to develop and execute digital marketing strategies across SEO, PPC, and social media. Requires expertise in Google Analytics, Google Ads, and SEO to drive brand awareness and campaign ROI."
    },
    {
        "job_title": "Full Stack Developers (Angular/React + Node.js)",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27712",
        "location": "Technopark",
        "closing_date": "21 Feb 2026",
        "job_description": "<h2>iBoson Innovations (P) Ltd</h2>\n<p><strong>Address:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.iboson.io\">http://www.iboson.io</a></p>\n<h3>Full Stack Developers (Angular/React + Node.js)</h3>\n<p><strong>Closing Date:</strong> 21, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <strong>career@ibosoninnov.com</strong></p>\n<h4>Brief Description</h4>\n<p>At iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to build next-gen solutions. We are expanding our team and looking for a skilled Node.js Developer to help develop robust, scalable, and high-performance backend systems for our products.</p>\n<h4>Responsibilities</h4>\n<ul>\n<li>Design, development, and maintenance of both front-end and back-end web applications using Angular and Node.js.</li>\n<li>Develop and integrate RESTful APIs services to support front-end applications and other backend services.</li>\n<li>Optimize application performance, security, and reliability.</li>\n<li>Design and manage databases (PostgreSQL, MySQL, MongoDB, etc.).</li>\n<li>Collaborate with frontend, product, and DevOps teams.</li>\n<li>Write clean, maintainable, and well-tested code.</li>\n<li>Review code and mentor junior engineers.</li>\n<li>Participate in architecture and technical decision-making.</li>\n<li>Troubleshoot and resolve production issues.</li>\n<li>Work closely with UX/UI designers, product managers, and QA teams to deliver outstanding user experiences and ensure project deadlines are met.</li>\n</ul>\n<h4>Preferred Skills &amp; Requirements</h4>\n<ul>\n<li><strong>5+ years</strong> of experience in full-stack development with strong proficiency in Angular, Node.js, and JavaScript/TypeScript.</li>\n<li>Strong experience in backend development with Node.js, including building and integrating REST APIs, middleware, and microservices.</li>\n<li>Extensive experience with front-end frameworks like Angular, including component-driven architecture, state management, and UI performance optimization.</li>\n<li>Experience with databases, both SQL (e.g., MySQL/PostgreSQL), including database design, query optimization, and migrations.</li>\n<li>Expertise in version control systems, particularly Git, with an understanding of Git workflows and branching strategies.</li>\n<li>Strong understanding of software design patterns, microservices architecture, and agile development methodologies (e.g., Scrum, Kanban).</li>\n<li>Ability to write clean, maintainable, and efficient code with a focus on test-driven development (TDD) and continuous integration.</li>\n<li>Experience with front-end optimization techniques, including bundling, lazy loading, code splitting, and caching.</li>\n</ul>\n<h4>What We Offer</h4>\n<ul>\n<li>Work-life balance with flexible work timings.</li>\n<li>Opportunity to work on challenging, high-impact projects.</li>\n<li>Learning and career growth opportunities.</li>\n<li>Collaborative and engineering-driven culture.</li>\n<li>Be part of a team that thrives on innovation and problem-solving. At iBoson, you’ll work with emerging AR &amp; AI technologies, contribute to impactful projects, and grow in a collaborative and tech-driven environment.</li>\n</ul>\n<p><strong>Apply Now:</strong> Send your resume to <strong>career@ibosoninnov.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Angular",
            "Node.js",
            "PostgreSQL"
        ],
        "summary": "Seeking a Full Stack Developer with Angular and Node.js expertise to build scalable backend systems and collaborate on AR/AI projects. Requires 5+ years of experience and proficiency in REST APIs, databases, and agile methodologies."
    },
    {
        "job_title": "Back End Engineer - Node.js",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27711",
        "location": "Technopark",
        "closing_date": "21 Feb 2026",
        "job_description": "<h2>iBoson Innovations (P) Ltd</h2>\n<p><strong>Address:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.iboson.io\">http://www.iboson.io</a></p>\n<h3>Back End Engineer - Node.js</h3>\n<p><strong>Closing Date:</strong> 21, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:career@ibosoninnov.com\">career@ibosoninnov.com</a></p>\n<p><strong>Brief Description</strong>\nAt iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to build next-gen solutions. We are expanding our team and looking for a skilled Node.js Developer to help develop robust, scalable, and high-performance backend systems for our products.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable server-side applications using Node.js.</li>\n<li>Develop and integrate RESTful APIs and third-party services.</li>\n<li>Optimize back-end processes for performance, security, and scalability.</li>\n<li>Work closely with front-end developers to integrate user-facing elements.</li>\n<li>Manage and implement database solutions (SQL/NoSQL).</li>\n<li>Debug, troubleshoot, and resolve back-end issues efficiently.</li>\n<li>Follow best practices in code quality, testing, and documentation.</li>\n</ul>\n<h3>Preferred Skills/Requirements:</h3>\n<ul>\n<li><strong>5+ years</strong> of experience in back-end development, with a focus on Node.js.</li>\n<li>Strong understanding of JavaScript, TypeScript, and asynchronous programming.</li>\n<li>Experience in building and managing RESTful APIs and microservices architecture.</li>\n<li>Proficiency in databases (MongoDB, MySQL, or PostgreSQL).</li>\n<li>Strong understanding of OOP (Object-Oriented Programming) Concepts.</li>\n<li>Knowledge of authentication and authorization mechanisms (JWT, OAuth).</li>\n<li>Experience with server-side frameworks like Express.js, Nest.js, or similar.</li>\n<li>Familiarity with cloud platforms (AWS, Google Cloud, or Azure) is a plus.</li>\n<li>Understanding of Agile methodologies and CI/CD pipelines.</li>\n<li>Exposure to AI integrations in back-end applications is an advantage.</li>\n<li>AR technology exposure is a plus.</li>\n</ul>\n<p><strong>Company Culture</strong>\nBe part of a team that thrives on innovation and problem-solving. At iBoson, you’ll work with emerging AR &amp; AI technologies, contribute to impactful projects, and grow in a collaborative and tech-driven environment.</p>\n<p><strong>Application Instructions</strong>\nIf you're ready to take on exciting challenges, we’d love to hear from you! Send your resume to <a href=\"mailto:career@ibosoninnov.com\">career@ibosoninnov.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "RESTful APIs",
            "MongoDB/MySQL/PostgreSQL"
        ],
        "summary": "Seeking a Node.js developer to build scalable backend systems for AR/AI solutions. Requires 5+ years experience with Node.js, REST APIs, and databases."
    },
    {
        "job_title": "Software Sales Executive",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27710",
        "location": "Technopark",
        "closing_date": "15 Mar 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company</strong>: KENLAND IT SOLUTIONS (P) Ltd\n<strong>Address</strong>: 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website</strong>: <a href=\"https://www.kenland.in\">https://www.kenland.in</a>\n<strong>Closing Date</strong>: 15, Mar 2026\n<strong>Published Date</strong>: 16, Feb 2026\n<strong>Contact Email</strong>: recruiter@kenland.in</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and results-driven <strong>Software Sales Executive</strong> to join our team. This role involves identifying business opportunities, building strong client relationships, and driving software sales to achieve revenue targets. The ideal candidate will have a strong understanding of software solutions, excellent communication skills, and a proven track record in sales.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and generate new business opportunities through lead generation, networking, and cold calling.</li>\n<li>Understand client needs and recommend suitable software solutions.</li>\n<li>Deliver compelling sales presentations, product demonstrations, and proposals.</li>\n<li>Negotiate contracts and close sales to achieve revenue targets.</li>\n<li>Develop and maintain strong relationships with existing and potential clients.</li>\n<li>Stay updated on industry trends, competitor activities, and market conditions.</li>\n<li>Collaborate with the marketing and product teams to drive sales strategies.</li>\n<li>Maintain accurate sales records and reports using CRM tools.</li>\n</ul>\n<h3>Preferred Skills &amp; Requirements</h3>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, IT, or a related field.</li>\n<li>Proven experience in software sales, IT sales, or B2B sales.</li>\n<li>Strong understanding of <strong>SaaS</strong>, <strong>cloud solutions</strong>, or <strong>enterprise software</strong>.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Proficiency in <strong>CRM software</strong> and Microsoft Office Suite.</li>\n<li>Willingness to travel as needed.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience selling <strong>ERP</strong>, <strong>CRM</strong>, <strong>cybersecurity</strong>, or other enterprise software solutions.</li>\n<li>Familiarity with consultative sales techniques.</li>\n<li>Technical background or understanding of software development is a plus.</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "ERP",
            "CRM",
            "SaaS"
        ],
        "summary": "KENLAND IT SOLUTIONS seeks a Software Sales Executive to drive software sales, build client relationships, and achieve revenue targets. Requires experience in software sales and expertise in ERP, CRM, and SaaS solutions."
    },
    {
        "job_title": "Business Analyst",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27709",
        "location": "Technopark",
        "closing_date": "15 Mar 2026",
        "job_description": "<h2>KENLAND IT SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA , 695581\n<strong>Website:</strong> <a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<h3>Business Analyst</h3>\n<p><strong>Closing Date:</strong> 15, Mar 2026\n<strong>Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p><strong>Brief Description</strong>\nWe are seeking a skilled and detail-oriented <strong>Business Analyst</strong> with a minimum of 3 years of experience in IT or software development environments. The ideal candidate will be responsible for gathering and analyzing business requirements, facilitating communication between stakeholders and technical teams, and ensuring that project deliverables meet business needs. This is a key role that directly contributes to project success by enabling effective planning, development, and execution.</p>\n<p><strong>Key Responsibilities</strong>\n- Conduct requirement gathering sessions with clients and stakeholders via calls and meetings.\n- Translate business needs into clear, concise, and detailed functional and non-functional requirements.\n- Use case diagrams, flowcharts, and wireframes (if applicable).\n- Act as the liaison between the client and the technical team, ensuring clarity and consistency.\n- Participate in daily stand-ups, sprint planning, and project status meetings.\n- Assist in backlog grooming and creation of user stories in Agile environments.\n- Ensure timely and accurate communication with internal teams and external stakeholders.\n- Manage requirement changes using structured change control processes.\n- Contribute to product vision, roadmap discussions, and process improvements.</p>\n<p><strong>Preferred Skills</strong>\n- 3+ years of experience as a Business Analyst in an IT or software development environment.\n- Experience preparing comprehensive documentation (BRD, FRD, SRS).\n- Proficient in tools like MS Office, Confluence.\n- Excellent communication and interpersonal skills.\n- Strong analytical thinking, attention to detail, and problem-solving capabilities.\n- Experience in working with cross-functional teams and multiple stakeholders.\n- Ability to manage multiple priorities in a fast-paced environment.</p>",
        "tags": [
            "3+ Years",
            "BRD/FRD/SRS Documentation",
            "Agile Methodologies",
            "MS Office/Confluence Tools"
        ],
        "summary": "A Business Analyst with 3+ years of IT experience is needed to bridge stakeholders and technical teams, ensuring project deliverables align with business needs through requirements analysis and Agile collaboration."
    },
    {
        "job_title": "Junior Dot Net Developer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27708",
        "location": "Technopark",
        "closing_date": "15 Mar 2026",
        "job_description": "<h2><strong>KENLAND IT SOLUTIONS (P) Ltd</strong></h2>\n<p><strong>Address:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA , 695581\n<strong>Website:</strong> <a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<h3><strong>Junior Dot Net Developer</strong></h3>\n<p><strong>Closing Date:</strong> 15, Mar 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a junior ASP.NET Developer with 1-2 years of experience to join our development team. The ideal candidate will be responsible for designing, developing, and maintaining web applications using ASP.NET MVC and .Net Core.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Develop, test, and deploy ASP.NET MVC applications.</li>\n<li>Collaborate with cross-functional teams to define and implement new features.</li>\n<li>Debug and resolve software issues to ensure optimal performance.</li>\n<li>Participate in code reviews and follow best coding practices.</li>\n<li>Maintain and improve existing applications, identifying areas for optimization.</li>\n<li>Stay updated with the latest technologies and ASP.NET best practices.</li>\n<li>Document code and technical designs for future reference.</li>\n<li>Provide basic technical support and troubleshooting for applications in production.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Strong knowledge of C# programming language.</li>\n<li>Experience in software development, with .NET Core.</li>\n<li>Familiarity with HTML, CSS, JavaScript, and jQuery.</li>\n<li>Basic experience with front-end frameworks like Bootstrap.</li>\n<li>Understanding of relational databases, Entity Framework, and ORM tools (Dapper).</li>\n<li>Knowledge of version control systems like Git.</li>\n<li>Good problem-solving skills and attention to detail.</li>\n<li>Ability to work effectively in a collaborative team environment.</li>\n<li>A positive attitude, willingness to learn, and adaptability to project requirements.</li>\n<li>Basic understanding of object-oriented programming (OOP) principles.</li>\n<li>Experience in writing SQL queries and working with relational databases.</li>\n<li>Exposure to RESTful APIs and Web Services.</li>\n<li>Understanding of Agile methodologies.</li>\n<li>Knowledge of cloud platforms like Azure.</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "ASP.NET MVC",
            ".NET Core",
            "C#"
        ],
        "summary": "Junior Dot Net Developer role at Kenland IT Solutions requires 1-2 years of experience in ASP.NET MVC and .NET Core development, with skills in C#, web frameworks, and databases."
    }
]