[
    {
        "job_title": "AI Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20951/312",
        "location": "Infopark",
        "closing_date": "04 Nov 2025",
        "job_description": "<h2>AI Engineer</h2>\n<p>We are looking for a talented and passionate AI Engineer to join our team. The AI Engineer will be responsible for designing, developing, and deploying AI models and algorithms to solve complex problems and drive business value. The ideal candidate will have a strong background in machine learning, deep learning, and data science, along with excellent programming skills.</p>\n<h3>Responsibilities :</h3>\n<ul>\n<li>Design, develop, and implement AI models and algorithms to solve real-world problems.</li>\n<li>Collaborate with cross-functional teams to understand business requirements and translate them into technical solutions.</li>\n<li>Conduct data analysis and preprocessing to ensure high-quality input for AI models.</li>\n<li>Train, test, and validate AI models to ensure accuracy and performance.</li>\n<li>Deploy AI models into production environments and monitor their performance.</li>\n<li>Continuously improve AI models by incorporating new data and feedback.</li>\n<li>Stay up-to-date with the latest advancements in AI and machine learning technologies.</li>\n<li>Document AI models, processes, and results for knowledge sharing and future reference.</li>\n<li>Participate in code reviews and provide constructive feedback to peers.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Proven experience as an AI Engineer, Machine Learning Engineer, or similar role.</li>\n<li>Strong understanding of machine learning algorithms, deep learning frameworks, and statistical methods.</li>\n<li>Experience with LLMs (GPT-4, Llama-2)</li>\n<li>Experience with NLP and RAG (Retrieval-Augmented Generation)</li>\n<li>Proficiency in programming languages such as Python, R, or Java.</li>\n<li>Experience with machine learning libraries and frameworks such as TensorFlow, Keras, PyTorch, or Scikit-learn.</li>\n<li>Familiarity with data preprocessing, feature engineering, and data visualization techniques.</li>\n<li>Familiarity with vector databases such as Pinecone and ChromaDB</li>\n<li>Knowledge of cloud platforms such as AWS, Google Cloud, or Azure.</li>\n<li>Experience with version control systems like Git.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Excellent communication and collaboration skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@2basetechnologies.com</p>",
        "tags": [
            "Proven experience",
            "Machine Learning",
            "Deep Learning",
            "LLMs"
        ],
        "summary": "Seeking an AI Engineer to design, develop, and deploy AI models. Requires strong ML/DL background, programming skills, and experience with LLMs, NLP, and RAG."
    }
]