[
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21434/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p>We are seeking a high-performing and self-driven <strong>Senior Business Development Executive</strong> to join our team at <strong>2Base Technologies</strong>. In this role, you will drive revenue by generating leads, building client relationships, and managing the end-to-end sales process for IT services and digital solutions. If you thrive in consultative selling and technology-driven business growth, this opportunity is for you!</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Identify and generate qualified leads via outbound channels, referrals, and market research.</li>\n<li>Drive new business opportunities for web, mobile, and enterprise software development services.</li>\n<li>Manage the full sales cycle: lead qualification, client communication, requirement analysis, proposal preparation, pricing, negotiation, and closure.</li>\n<li>Propose tailored IT and digital transformation solutions aligned with client objectives.</li>\n<li>Build relationships with Founders, CXOs, and Product Owners.</li>\n<li>Collaborate with delivery, design, and marketing teams to create compelling proposals.</li>\n<li>Maintain CRM records and provide sales forecasts/reports.</li>\n<li>Represent the company at networking events and client meetings.</li>\n<li>Meet/exceed monthly/quarterly revenue targets.</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Bachelor’s degree or equivalent in education/experience.</li>\n<li><strong>2 - 5 years</strong> of B2B sales experience in IT services/digital solutions.</li>\n<li>Proven ability to manage sales pipelines and close deals independently.</li>\n<li>Strong knowledge of software development (web/mobile apps, SaaS, enterprise solutions).</li>\n<li>Experience with international clients preferred.</li>\n<li>Proficiency in CRM tools (Zoho, HubSpot, Salesforce) and outbound sales tools (LinkedIn Sales Navigator).</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to work autonomously and own sales targets.</li>\n<li>Strategic thinking to address client pain points and position solutions.</li>\n</ul>\n<h2>Education &amp; Certifications</h2>\n<ul>\n<li>Bachelor’s degree in IT/CS/BCA/B-Tech/CS/EC, MBA, or CS/IT diploma.</li>\n<li>Certifications in sales, digital marketing, or business consulting are a plus.</li>\n</ul>\n<p><strong>Apply now</strong>: Share your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2 - 5 Years",
            "B2B Sales",
            "IT Services Sales",
            "CRM Systems (Zoho, HubSpot, Salesforce)"
        ],
        "summary": "Senior Business Development Executive needed to drive IT services sales, manage end-to-end sales cycles, and build client relationships. Requires 2-5 years of B2B sales experience and CRM proficiency."
    },
    {
        "job_title": "Project Manager",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21435/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<p><strong>Project Manager</strong></p>\n<p>We are looking for a dynamic and detail-oriented Project Manager to join our team at 2Base Technologies. In this role, you will be responsible for the planning, execution, and successful delivery of projects while ensuring seamless coordination between teams and stakeholders. If you have a passion for technology, strong organizational skills, and the ability to manage multiple projects effectively, we’d love to hear from you!</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Develop and manage project plans, including timelines, budgets, and resource allocations.</li>\n<li>Define project scope, objectives, and deliverables in collaboration with stakeholders.</li>\n<li>Ensure that projects are delivered on time, within scope, and within budget while adhering to company policies, procedures, and quality standards.</li>\n<li>Identify and manage project risks, issues, and dependencies, implementing mitigation strategies as needed.</li>\n<li>Facilitate and document project meetings, including kick-off meetings, status updates, and post-project evaluations, ensuring follow-ups are tracked.</li>\n<li>Communicate project progress, challenges, and key updates to stakeholders, maintaining strong relationships with customers, vendors, and business partners.</li>\n<li>Mentor and oversee team members, ensuring their professional growth, training, and on-the-job delivery.</li>\n<li>Oversee and guide project teams, including internal staff, external vendors, and contractors, ensuring effective resource utilization.</li>\n<li>Govern development, design, integration, and testing activities, ensuring best practices are followed.</li>\n<li>Evaluate and optimize workflows, making recommendations for process improvements to enhance efficiency and delivery.</li>\n<li>Coordinate cross-functional collaboration to ensure seamless integration of different project components.</li>\n</ul>\n<h2>Job Requirements</h2>\n<ul>\n<li>Bachelor’s degree in IT, Computer Science, Electronics, or a related technical field, or a combination of relevant education and experience.</li>\n<li>4–8 years of experience coordinating or managing projects in the IT industry.</li>\n<li>Strong verbal and written communication skills.</li>\n<li>Proven experience working with agile software development teams.</li>\n<li>Excellent organizational and time management skills.</li>\n<li>Ability to work independently with minimal supervision.</li>\n<li>Strong problem-solving skills with a logical and data-driven approach.</li>\n<li>PMP Certification or equivalent project management certification will be an added advantage.</li>\n<li>Experience managing web and mobile application projects.</li>\n<li>Proficiency with project management tools like Jira, time-tracking, or any agile planning tools.</li>\n<li>Exposure to working with cross-functional or international teams.</li>\n<li>Experience in proofreading and editing technical documentation.</li>\n<li>Ability to quickly learn and adapt to new software and technologies.</li>\n</ul>\n<h2>Experience and Education</h2>\n<ul>\n<li>4-8 years</li>\n<li>Bachelor’s degree or BSc. IT or CS / BCA / B-Tech IT, CS, or EC, MBA, Diploma in CS / IT.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4-8 Years",
            "Agile",
            "Jira",
            "Project Management Tools"
        ],
        "summary": "2Base Technologies seeks a Project Manager to oversee IT projects, ensuring timely delivery within budget while coordinating cross-functional teams and stakeholders."
    },
    {
        "job_title": "AI Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21436/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<p><strong>AI Engineer</strong></p>\n<p>We are seeking a talented and passionate <strong>AI Engineer</strong> to join our team. The role involves designing, developing, and deploying AI models and algorithms to solve complex problems and drive business value. The ideal candidate will have a strong background in machine learning, deep learning, and data science, along with excellent programming skills.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and implement AI models and algorithms to solve real-world problems.</li>\n<li>Collaborate with cross-functional teams to translate business requirements into technical solutions.</li>\n<li>Conduct data analysis and preprocessing for high-quality AI model inputs.</li>\n<li>Train, test, and validate AI models to ensure accuracy and performance.</li>\n<li>Deploy models into production environments and monitor their performance.</li>\n<li>Continuously improve models using new data and feedback.</li>\n<li>Stay updated on AI and machine learning advancements.</li>\n<li>Document models, processes, and results for knowledge sharing.</li>\n<li>Participate in code reviews and provide peer feedback.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Proven experience as an AI Engineer, Machine Learning Engineer, or similar role.</li>\n<li>Strong understanding of machine learning algorithms, deep learning frameworks, and statistical methods.</li>\n<li>Experience with <strong>LLMs</strong> (GPT-4, Llama-2) and <strong>NLP/RAG</strong>.</li>\n<li>Proficiency in <strong>Python, R, or Java</strong>.</li>\n<li>Experience with <strong>TensorFlow, Keras, PyTorch, or Scikit-learn</strong>.</li>\n<li>Familiarity with data preprocessing, feature engineering, and visualization.</li>\n<li>Knowledge of <strong>vector databases</strong> (Pinecone, ChromaDB).</li>\n<li>Cloud platform experience (AWS, Google Cloud, Azure).</li>\n<li>Git version control proficiency.</li>\n<li>Strong problem-solving, attention to detail, and communication skills.</li>\n</ul>\n<h3>Experience &amp; Education:</h3>\n<ul>\n<li><strong>2-6 Years</strong> of experience.</li>\n<li>Bachelor's or Master's in computer science, AI, machine learning, or related fields.</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Growth-driven environment with opportunities to lead, innovate, and upskill.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-6 Years",
            "LLMs (GPT-4, Llama-2)",
            "NLP & RAG",
            "TensorFlow/PyTorch"
        ],
        "summary": "Designs and deploys AI models using machine learning and NLP. Requires 2-6 years of experience with LLMs and cloud platforms."
    },
    {
        "job_title": "Sr.DevSecOps",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21437/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Senior DevSecOps Engineer</h2>\n<p>We are seeking a <strong>Senior DevSecOps Engineer</strong> to lead our cybersecurity, infrastructure automation, and DevSecOps practices as we transition to a secure, scalable, and modern engineering environment. This role will strengthen 2Base’s security posture, modernize pipelines, and foster a secure-by-design culture. You will collaborate with engineering, product, and leadership teams to ensure systems, applications, and cloud environments are secure, reliable, and future-ready.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define, implement, and enforce security standards, policies, and best practices across cloud and on-prem environments.</li>\n<li>Conduct security risk assessments, vulnerability scans, penetration testing, and execute mitigation plans.</li>\n<li>Architect and enhance secure CI/CD pipelines with automated compliance and governance checkpoints.</li>\n<li>Promote a \"Security First\" culture across engineering, ensuring secure design and development practices.</li>\n<li>Monitor, detect, investigate, and respond to security threats, incidents, breaches, and anomalies.</li>\n<li>Develop Infrastructure-as-Code practices using Terraform, Ansible, and other automation frameworks.</li>\n<li>Design secure cloud architectures across AWS, Azure, or GCP for scalable, compliant deployments.</li>\n<li>Build and secure containerized environments using Docker and Kubernetes with enforced security baselines.</li>\n<li>Implement secure monitoring, logging, SIEM, and alerting systems for infrastructure and application layers.</li>\n<li>Improve system reliability, scalability, performance, and fault tolerance across critical workloads.</li>\n<li>Mentor DevOps engineers in secure development, automation, and operational excellence.</li>\n<li>Lead technical strategy, tool selection, process improvements, and DevSecOps roadmap execution.</li>\n<li>Collaborate with BA, PM, and Engineering teams to align security, performance, and delivery goals.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>4–8 years</strong> of experience in DevOps, Cloud, or Infrastructure engineering with strong security exposure.</li>\n<li>Hands-on experience with CI/CD tools (Jenkins, GitLab CI, GitHub Actions).</li>\n<li>Expertise in AWS, Azure, or GCP cloud platforms with a focus on secure architecture.</li>\n<li>Proficiency in Infrastructure-as-Code (Terraform, Ansible).</li>\n<li>Experience securing Docker and Kubernetes environments.</li>\n<li>Strong understanding of networking technologies (LAN/WAN, firewalls, VPN, load balancers).</li>\n<li>Knowledge of security frameworks (OWASP, NIST, CIS Benchmarks).</li>\n<li>Experience with monitoring/logging tools (Prometheus, Grafana, ELK, CloudWatch, SIEM).</li>\n<li>Strong scripting skills (Python, Bash, Shell).</li>\n<li>Excellent troubleshooting, analytical, and problem-solving skills.</li>\n<li>Strong communication and collaboration skills to influence engineering teams.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Diploma/B.Tech in IT, CS, MCA.</li>\n<li>Experience in SOC operations or exposure to SIEM/SOAR tools.</li>\n<li>Certifications: AWS Security/DevOps Engineer – Professional, CKS, CEH, CompTIA Security+.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p><strong>Contact:</strong> For inquiries, email your resume to <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4–8 Years",
            "Terraform",
            "AWS",
            "Kubernetes"
        ],
        "summary": "Lead cybersecurity and infrastructure automation for a secure, scalable engineering environment. Requires 4–8 years of DevSecOps experience with expertise in cloud platforms and IaC tools."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21438/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Senior Business Analyst</h2>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.</li>\n<li>Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.</li>\n<li>Convert ambiguous client inputs into structured, logical, and actionable functional understanding.</li>\n<li>Break large features into modules, workflows, components, and clear dependencies.</li>\n<li>Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.</li>\n<li>Translate business processes into functional logic that development teams can execute.</li>\n<li>Decompose requirements into use-case flows, system behaviours, edge cases, alternate paths, validation rules, and dependencies.</li>\n<li>Prepare high-quality documentation, including BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API requirement specs, and acceptance criteria.</li>\n<li>Ensure all documentation is clear, logical, structured, testable, and ready for developers and QA to use.</li>\n<li>Collaborate closely with developers, architects, QA, and product owners to validate feasibility and align understanding.</li>\n<li>Ensure QA teams can derive test cases effectively from your functional logic and acceptance criteria.</li>\n<li>Communicate confidently with clients, handle requirement discussions smoothly, and clarify misunderstandings immediately.</li>\n<li>Push back politely on unclear or changing requirements and ensure final decisions are documented properly.</li>\n<li>Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover to development.</li>\n<li>Own the entire requirement lifecycle from discovery to development readiness with high accountability.</li>\n<li>Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>Minimum 4+ years</strong> of core Business Analyst experience with strong analytical and system-level thinking.</li>\n<li>Ability to break down complex requirements into clear components, workflows, and functional logic.</li>\n<li>Excellent verbal and written communication with confidence in client interactions and clarifications.</li>\n<li>Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria with high clarity.</li>\n<li>Ability to challenge assumptions politely, ask the right questions, and ensure zero ambiguity.</li>\n<li>Strong collaboration experience with development, QA, architects, and cross-functional teams.</li>\n<li>Understanding of API behaviours, integrations, data flows, and multi-module system interactions.</li>\n<li>Ability to run requirement discussions, workshops, and independently lead discovery sessions.</li>\n<li>Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.</li>\n<li>Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.</li>\n<li>Not suitable for UI-only thinkers, passive communicators, template-based writers, or those relying on AI for answers.</li>\n<li>Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.</li>\n<li>Candidates must align with 2Base’s structured thinking, clarity-driven culture, and transformation of the BA function.</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, Business, or related field</li>\n<li>4 to 8 years of experience as a Business Analyst or Product Analyst</li>\n<li>Experience in SaaS or scalable product environments</li>\n<li>Exposure to AI/Automation, integrations, or multi-module systems</li>\n<li>Ability to run independent client workshops</li>\n<li>Must have independently handled requirement ownership for at least one full project lifecycle</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "SaaS",
            "API",
            "BRD/FRD/SRS"
        ],
        "summary": "Senior Business Analyst translates business needs into structured requirements, collaborating with cross-functional teams. Requires 4+ years experience, SaaS, API, and BRD/FRD/SRS expertise."
    },
    {
        "job_title": "Technical Consultant- Microsoft Dynamics Business Central",
        "company": "Woxro",
        "url": "https://infopark.in/company-jobs/details/21439/399",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<p><strong>Technical Consultant - Microsoft Dynamics Business Central</strong></p>\n<p><strong>Responsibilities</strong>\n- Implement and configure Microsoft Dynamics NAV/Business Central solutions.\n- Collaborate with clients to gather business requirements and define project scope.\n- Develop customizations and integrations with other systems.\n- Provide technical support and troubleshooting for Dynamics NAV/Business Central.\n- Conduct system testing and user training sessions.\n- Prepare technical documentation and user manuals.\n- Stay current with system updates and new features.</p>\n<p><strong>Qualifications</strong>\n- Bachelor's degree in Computer Science, Information Technology, or related field.\n- Proven experience with Microsoft Dynamics NAV/Business Central.\n- Strong understanding of ERP systems and their business applications.\n- Excellent problem-solving and analytical skills.\n- Strong communication and interpersonal skills.</p>\n<p><strong>Skills</strong>\n- Microsoft Dynamics Business Central\n- SQL\n- C/AL\n- AL Language\n- Power BI\n- Azure\n- Integration Services\n- Technical Support\n- ERP Configuration</p>\n<p><strong>Contact</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume at <strong>jobs@woxro.com</strong>.</p>",
        "tags": [
            "Proven Experience",
            "Microsoft Dynamics Business Central",
            "AL Language",
            "SQL"
        ],
        "summary": "Technical Consultant for Microsoft Dynamics Business Central, implementing solutions, customizations, and providing technical support. Requires expertise in ERP systems, AL Language, and SQL."
    },
    {
        "job_title": "Full Stack Developer (Next.js & Node.js)",
        "company": "Woxro",
        "url": "https://infopark.in/company-jobs/details/21440/399",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Full Stack Developer (Next.js &amp; Node.js)</h2>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and maintain full-stack web applications using <strong>Next.js</strong> and <strong>Node.js</strong></li>\n<li>Build responsive and SEO-friendly user interfaces with <strong>React / Next.js</strong></li>\n<li>Create and maintain backend services and APIs using <strong>Node.js</strong></li>\n<li>Work with <strong>Payload CMS</strong> for content management (training/support provided if needed)</li>\n<li>Integrate databases and manage schemas in <strong>Payload CMS</strong></li>\n<li>Implement authentication, authorization, and security best practices</li>\n<li>Optimize application performance, scalability, and reliability</li>\n<li>Collaborate with designers, product managers, and cross-functional teams</li>\n<li>Participate in code reviews and technical discussions</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Strong experience with <strong>Next.js</strong> and <strong>React</strong></li>\n<li>Proficiency in <strong>Node.js</strong> and backend frameworks (Express, NestJS, etc.)</li>\n<li>Solid understanding of <strong>JavaScript (ES6+)</strong> or <strong>TypeScript</strong></li>\n<li>Experience with <strong>RESTful API</strong> development</li>\n<li>Familiarity with relational or NoSQL databases</li>\n<li>Experience using <strong>Git</strong> and version control systems</li>\n<li>Good understanding of web fundamentals (<strong>HTML, CSS, HTTP</strong>)</li>\n<li>Willingness to learn and work with <strong>Payload CMS</strong></li>\n<li>Prior experience with headless CMS platforms (<strong>Payload, Strapi, Sanity</strong>, etc.)</li>\n<li>Experience with <strong>TypeScript</strong> across frontend and backend</li>\n<li>Knowledge of <strong>SSR, SSG, and ISR</strong> in Next.js</li>\n<li>Familiarity with authentication tools (<strong>JWT, OAuth, NextAuth</strong>)</li>\n<li>Experience with testing frameworks and <strong>CI/CD pipelines</strong></li>\n<li>Exposure to cloud platforms (<strong>Vercel, AWS</strong>, etc.)</li>\n</ul>\n<p><strong>Contact:</strong> Share your updated resume at jobs@woxro.com if this opportunity aligns with your career goals.</p>",
        "tags": [
            "3-5 Years",
            "Next.js",
            "Node.js",
            "TypeScript"
        ],
        "summary": "A Full Stack Developer role requiring expertise in Next.js, Node.js, and TypeScript, with responsibilities in building scalable web applications and integrating CMS platforms."
    },
    {
        "job_title": "Supply Chain Intern",
        "company": "Dynamed Healthcare Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21441/132",
        "location": "Infopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Supply Chain Intern</h2>\n<p>📢 <strong>Hiring: Supply Chain Intern (3 Months)</strong></p>\n<p>We are seeking enthusiastic and dedicated candidates to join our Supply Chain team for a <strong>3-month unpaid internship</strong>. This role provides hands-on exposure to:</p>\n<ul>\n<li>Supply chain operations</li>\n<li>Coordination activities</li>\n<li>Real-time business processes</li>\n</ul>\n<p><strong>Ideal for freshers or students</strong> looking to gain practical experience in supply chain management.</p>\n<h3>Duration</h3>\n<p>3 Months</p>\n<h3>Internship Type</h3>\n<p>Unpaid</p>\n<h3>How to Apply</h3>\n<p>Interested candidates should send their resume to <strong>anoop.rajan@dynamedhealth.com</strong>. If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>anoop.rajan@dynamedhealth.com</strong>.</p>",
        "tags": [
            "3 Months",
            "Supply Chain Operations",
            "Coordination",
            "Business Processes"
        ],
        "summary": "3-month unpaid Supply Chain Intern role offering hands-on operations and coordination experience for freshers or students."
    },
    {
        "job_title": "Academic Associate (Operations) - (Preferring Freshers)",
        "company": "TutorComp Infotech (I) Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21443/44",
        "location": "Infopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Academic Associate (Operations) - (Preferring Freshers)</h2>\n<p><strong>Location:</strong> Infopark Cochin Phase-I</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Strong problem-solving and client interaction skills, with the ability to work in a result-oriented team environment.</li>\n<li>Maintain client relationships by providing support, information, and guidance, while researching and recommending new opportunities.</li>\n<li>Identify business opportunities by identifying prospects, researching, and analyzing sales options.</li>\n<li>Prepare reports by collecting, analyzing, and summarizing information.</li>\n<li>Maintain quality service by establishing and enforcing organizational standards.</li>\n<li>Contribute to team efforts by accomplishing related tasks as needed.</li>\n<li>Communicate with clients or employers about project, event, or campaign expectations and goals.</li>\n<li>Answer telephones and respond to inquiries from clients and participants.</li>\n<li>Create, compile, and export databases containing all information for each event.</li>\n<li>Handle customer complaints or issues.</li>\n<li>Support other teams with administrative tasks (e.g., redirecting calls, disseminating correspondence, scheduling meetings).</li>\n<li>Actively support the collective well-being of the organization and team to provide quality educational services worldwide.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Graduate/Post Graduate.</li>\n<li>0–1 year of experience in customer handling.</li>\n<li>Strong written and oral communication skills in English.</li>\n<li>Organized with the ability to prioritize and multitask.</li>\n<li>Reliable, patient, and professional.</li>\n<li>Willing to work in shifts.</li>\n</ul>\n<h3>Contact:</h3>\n<p>Interested candidates can apply by sharing their resume to <strong>hr@tutorcomp.com</strong>.</p>\n<h3>About Us:</h3>\n<p>TutorComp is a global leader in online tutoring, providing personalized tutors worldwide. We enable students to learn, excel, and stay ahead of the knowledge and innovation curve. Our mission is to make learning accessible through technology and global talent, operating in markets across the US, UK, Hong Kong, Singapore, Australia, France, India, UAE, Kuwait, Bahrain, Qatar, Saudi Arabia, and Malaysia.</p>",
        "tags": [
            "0-1 Year",
            "English Communication",
            "Customer Service",
            "Database Management"
        ],
        "summary": "Academic Associate (Operations) supports client relationships, administrative tasks, and team collaboration to deliver global educational services. Requires 0–1 year of customer handling experience and strong English communication skills."
    },
    {
        "job_title": "Video Editor & Graphic Designer",
        "company": "MarketBytes WebWorks Private Limited",
        "url": "https://infopark.in/company-jobs/details/21442/460",
        "location": "Infopark",
        "closing_date": "30 Jan 2026",
        "job_description": "<h2>Video Editor &amp; Graphic Designer</h2>\n<p><strong>Location:</strong> Infopark Cherthala\n<strong>Type:</strong> Full-Time</p>\n<p>Are you a creative powerhouse with a passion for both video editing and graphic design? Join our team and help bring our visions to life through stunning visuals and captivating videos!</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Video Editing:</strong> Edit and produce high-quality video content for marketing, social media, and internal projects</li>\n<li><strong>Graphic Design:</strong> Design eye-catching graphics for websites, social media, print materials, and campaigns</li>\n<li>Collaborate with the marketing and creative teams to align visuals with company goals and branding</li>\n<li>Manage multiple projects while ensuring high-quality results and meeting deadlines</li>\n<li>Stay updated with the latest trends and tools in both video editing and graphic design</li>\n<li>Assist in creating engaging animations and motion graphics</li>\n</ul>\n<h3>Skills &amp; Experience:</h3>\n<ul>\n<li><strong>Video Editing:</strong> Proficiency in Adobe Premiere Pro, DaVinci Resolve, CapCut, Filmora, Adobe After Effects</li>\n<li><strong>Graphic Design:</strong> Expertise in Adobe Photoshop, Illustrator, Figma</li>\n<li>Knowledge of animation and motion graphics is a plus</li>\n<li>Strong attention to detail with the ability to adapt to different styles and formats</li>\n<li>Ability to work on multiple projects simultaneously in a fast-paced environment</li>\n<li>Experience in social media content creation and digital marketing design is a plus</li>\n</ul>\n<p><strong>Contact:</strong> Share your updated resume at hr@marketbyteswebworks.com</p>",
        "tags": [
            "2-4 Years",
            "Adobe Premiere Pro",
            "Adobe Photoshop",
            "Adobe After Effects"
        ],
        "summary": "Creative Video Editor & Graphic Designer needed to produce marketing content and collaborate with teams on branding projects."
    },
    {
        "job_title": "Customer Success - QC Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26326",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Customer Success - QC Specialist</p>\n<h2>Experience</h2>\n<p>5-8 years</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>The Customer Success QC Specialist (Mid–Senior Level) is responsible for owning the quality assurance framework for customer interactions across all support channels. This role ensures high standards of communication, accuracy, and customer experience while driving continuous improvement initiatives across the Customer Success and Support teams. The specialist acts as a quality gatekeeper and a partner to training, operations, and product teams.</p>\n<h2>Key Responsibilities</h2>\n<ol>\n<li><strong>Quality Assurance Leadership</strong></li>\n<li>Conduct detailed audits of customer interactions (email, chat, phone, tickets) using advanced QA scorecards.</li>\n<li>Identify quality gaps at agent, process, and system levels.</li>\n<li>Lead calibrations with internal QA teams and external partners.</li>\n<li>\n<p>Maintain and evolve quality frameworks and rubrics for CS/support functions.</p>\n</li>\n<li>\n<p><strong>Coaching &amp; Skill Development</strong></p>\n</li>\n<li>Provide structured, actionable feedback to support executives and customer success specialists.</li>\n<li>Work closely with L&amp;D and Ops to implement coaching plans and refresher training.</li>\n<li>\n<p>Conduct communication etiquette, tone, and product knowledge sessions when required.</p>\n</li>\n<li>\n<p><strong>Process &amp; Compliance Ownership</strong></p>\n</li>\n<li>Ensure consistency in SOPs, escalation workflows, and service guidelines.</li>\n<li>Identify recurring defects and lead root-cause analysis (RCA).</li>\n<li>Recommend process improvements to reduce errors, improve FCR, and increase CSAT.</li>\n<li>\n<p>Ensure compliance with customer data privacy and operational standards.</p>\n</li>\n<li>\n<p><strong>Insights, Reporting &amp; Stakeholder Management</strong></p>\n</li>\n<li>Create weekly, monthly, and quarterly quality dashboards for leadership review.</li>\n<li>Present trends on CX gaps, agent performance, and customer sentiment insights.</li>\n<li>Partner with Product, CS Ops, and Support teams to improve workflows and customer journey experience.</li>\n<li>\n<p>Track impact of implemented improvements and coaching cycles.</p>\n</li>\n<li>\n<p><strong>Tools &amp; Systems</strong></p>\n</li>\n<li>Experience with Zendesk, Freshdesk, Salesforce, Intercom, or similar platforms.</li>\n<li>Ability to work with QA tools, knowledge bases, reporting dashboards, and analytics platforms.</li>\n<li>Manage and continuously update QA documentation, SOPs, and knowledge articles.</li>\n</ol>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li>5–8 years of experience in Customer Success, Customer Support QA/QC, or CX Quality roles.</li>\n<li>Strong expertise in customer interaction evaluation and quality frameworks.</li>\n<li>Excellent written and verbal communication skills with strong attention to detail.</li>\n<li>Ability to diagnose behavioural, technical, and communication issues.</li>\n<li>Experience running calibrations, RCAs, and process improvement initiatives.</li>\n<li>Strong analytical skills with experience in quality reporting and dashboards.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Exposure to SaaS support environments or global customer bases.</li>\n<li>Experience coaching support teams at scale.</li>\n<li>Knowledge of metrics such as CSAT, FCR, NPS, QA accuracy, AHT, and SLA adherence.</li>\n<li>Experience handling multilingual or culturally diverse customer interactions.</li>\n</ul>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Apply Now</h2>\n<p><a href=\"https://waydot.greythr.com/hire/jobs/customer-success-qc\">Apply Here</a></p>\n<h2>Contact</h2>\n<p>Email: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>\n<h2>Company Address</h2>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>",
        "tags": [
            "5-8 Years",
            "Customer Success QA",
            "Quality Assurance",
            "Customer Support"
        ],
        "summary": "Customer Success QC Specialist ensures quality in customer interactions, drives process improvements, and coaches support teams. Requires 5-8 years of QA/QC experience in customer success roles."
    },
    {
        "job_title": "Finance Executive/ Financial Analyst",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26325",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Company:</strong> Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Finance Executive/ Financial Analyst\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/finance-executive\">Apply Here</a></p>\n<h3><strong>Role Overview</strong></h3>\n<p>We are seeking a <strong>CA-qualified</strong> Finance Professional with <strong>2–3 years of experience</strong> in <strong>FP&amp;A</strong>, accounting, financial reporting, and reconciliations. The ideal candidate will collaborate closely with businesses, prepare financial statements, manage AR/AP processes, and utilize ERP systems.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<p><strong>Financial Planning &amp; Analysis</strong>\n- Partner with business teams to drive financial analysis and provide performance insights.\n- Coordinate and lead annual/quarterly/monthly forecasts.\n- Conduct month-close activities and analyze forecast vs. actuals.</p>\n<p><strong>Financial Accounting &amp; Reporting</strong>\n- Prepare monthly, quarterly, and annual financial statements compliant with accounting standards.\n- Handle revenue and cost booking using POC method and contract completion method.\n- Perform P&amp;L, balance sheet, and cash flow analysis.\n- Maintain accurate general ledger accounts and balance sheet schedules.</p>\n<p><strong>Reconciliation &amp; Compliance</strong>\n- Conduct AP/AR and intercompany reconciliations.\n- Assist in statutory, internal, and external audits with timely documentation.</p>\n<p><strong>Budgeting &amp; Costing</strong>\n- Support monthly budgets, cash flow forecasts, and variance analysis.\n- Prepare cost variation reports and revenue–cost reconciliation for projects.</p>\n<p><strong>Accounts Payable / Receivable</strong>\n- Manage vendor payments, invoice processing, and staff expense claims.\n- Track receivables, revenue entries, and client invoices.\n- Monitor advances, inventory booking, asset depreciation, and petty cash.</p>\n<p><strong>ERP &amp; Tools</strong>\n- Work extensively with <strong>SAP/Tally/ERP systems</strong>, <strong>MS Excel (advanced)</strong>, <strong>Power BI</strong>, and <strong>SQL</strong>.</p>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Strong knowledge of accounting standards and financial principles.</li>\n<li>Proficiency in <strong>SAP/Tally/ERP applications</strong>.</li>\n<li>Advanced <strong>Excel</strong>, <strong>Power BI</strong>, and <strong>SQL</strong> skills.</li>\n<li>Excellent analytical, reconciliation, and problem-solving abilities.</li>\n<li>Strong attention to detail and accuracy.</li>\n<li>Cross-functional teamwork and deadline management.</li>\n</ul>\n<h3><strong>Why Work With Us?</strong></h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with meaningful solutions.</li>\n<li>Dynamic, innovation-driven culture in a fast-paced environment.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "SAP/Tally/ERP",
            "Advanced Excel/Power BI/SQL",
            "Financial Reporting/FP&A"
        ],
        "summary": "CA-qualified Finance Executive/Analyst with 2-3 years in FP&A, accounting, and ERP systems. Key responsibilities include financial analysis, reporting, and reconciliation for a leading US automotive super app."
    },
    {
        "job_title": "Lead - Product Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26324",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We’re seeking a <strong>Lead Product Designer</strong> to own end-to-end product experiences, raise design standards, and drive outcomes—not just deliver screens. You’ll lead design for core products, collaborating directly with Product, Engineering, Growth, and Leadership. Report to the <strong>Head of Design</strong>. Apply if you’re a Lead or Senior Designer ready to advance your career.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>End-to-end product design for key verticals.</li>\n<li>Define UX strategy, drive research, and ship high-quality flows/UI with speed.</li>\n<li>Elevate visual/UI standards across the product ecosystem.</li>\n<li>Influence product roadmap using data, customer insights, and business context.</li>\n<li>Align cross-functionally to simplify ambiguity and ensure design is prioritized.</li>\n<li>Establish and enforce lean, effective design workflows.</li>\n<li>Mentor junior designers, provide critique, guide hiring, and shape team culture.</li>\n<li>Evolve Way.com’s design system for scalability.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>7–10+ years</strong> of product design experience, including <strong>3+ years</strong> in a lead/senior-lead role.</li>\n<li>Strong portfolio showcasing complex problem-solving, consumer app work, and high-quality UI.</li>\n<li>Proven ability to drive outcomes, not just outputs.</li>\n<li>Comfort with fast-paced environments, ambiguity, and data-driven decisions.</li>\n<li>Experience leading discovery, research, prototyping, and iterative testing.</li>\n<li>Expertise in <strong>Figma</strong> and modern design tools.</li>\n<li>Strong communication: direct, clear, and decisive.</li>\n<li>Ability to influence product, engineering, and leadership without compromising clarity.</li>\n<li>Bias for action: move quickly, ship, and iterate.</li>\n</ul>\n<h3>Why You’ll Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with meaningful solutions.</li>\n<li>Dynamic, innovation-driven culture in a fast-paced environment.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-product-designer\">https://waydot.greythr.com/hire/jobs/lead-product-designer</a>\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "7–10+ Years",
            "Figma",
            "Design Systems",
            "Data-Driven Design"
        ],
        "summary": "Lead Product Designer to lead end-to-end design strategy for a top US auto super app, requiring 7–10+ years of experience and expertise in Figma and data-driven outcomes."
    },
    {
        "job_title": "IT System - Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26323",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking an experienced <strong>IT System Engineer</strong> with <strong>2–4 years</strong> of experience in IT infrastructure management, Office 365 administration, and system support. The ideal candidate will have hands-on experience in Linux and Windows environments, networking (Fortigate or similar routers), and cloud-based server deployments. The role also involves infrastructure monitoring using <strong>Grafana, Zabbix, or similar tools</strong>, with opportunities to grow into <strong>DevOps and automation domains</strong>.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Provide <strong>technical support</strong> and troubleshooting for hardware, software, and networking issues.</li>\n<li>Manage and maintain <strong>IT infrastructure</strong>, ensuring uptime, performance, and security.</li>\n<li><strong>Administer and support Office 365</strong>, including Exchange Online, Teams, SharePoint, and OneDrive.</li>\n<li>Configure and manage <strong>Fortigate routers/firewalls</strong> and VPN connections.</li>\n<li>Perform <strong>Linux system administration</strong> – user management, configurations, patching, and updates.</li>\n<li>Support <strong>Windows environments</strong> for installation, configuration, and maintenance.</li>\n<li><strong>Deploy and manage virtual machines (VMs)</strong> on cloud platforms such as <strong>DigitalOcean</strong> and <strong>OVH</strong>.</li>\n<li>Implement and manage <strong>infrastructure monitoring</strong> using <strong>Grafana, Zabbix, or similar tools</strong>.</li>\n<li>Maintain IT documentation, system configurations, and internal knowledge base.</li>\n<li>Collaborate with teams to <strong>support the transition toward DevOps workflows</strong> and infrastructure automation.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in <strong>Computer Science, Information Technology, or a related field</strong>.</li>\n<li><strong>2–4 years</strong> of experience in IT Support, System Administration, or Infrastructure Engineering.</li>\n<li>Hands-on experience with <strong>Office 365 administration</strong>.</li>\n<li>Strong understanding of <strong>Fortigate routers/firewalls</strong> and networking fundamentals.</li>\n<li>High-level knowledge of Linux administration.</li>\n<li>Experience with <strong>cloud VM management</strong> (DigitalOcean, OVH, or equivalent).</li>\n<li>Familiarity with <strong>monitoring tools such as Grafana, Zabbix, or similar platforms</strong>.</li>\n<li>Strong troubleshooting, analytical, and problem-solving skills.</li>\n<li>Excellent communication and documentation abilities.</li>\n<li>Willingness to work in <strong>rotational shifts</strong>.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email</strong>: careers@way.com\n<strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/it-system-engineer\">https://waydot.greythr.com/hire/jobs/it-system-engineer</a></p>",
        "tags": [
            "2-4 Years",
            "Office 365",
            "Linux",
            "Fortigate"
        ],
        "summary": "The IT System Engineer role requires 2-4 years of experience in IT infrastructure, Office 365, and system support. Join a dynamic tech environment at a leading automotive app company with opportunities for growth and innovation."
    },
    {
        "job_title": "Communication Trainer - English",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26322",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> English Communication Trainer\n<strong>Work Arrangement:</strong> On-site training/WFO\n<strong>Employment Type:</strong> Contract</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced <strong>English Communication Trainer</strong> to deliver offline corporate training programs specifically designed for <strong>Customer Support teams</strong>. The trainer will enhance employees’ communication quality, customer-handling skills, grammar accuracy, and overall service language proficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct <strong>offline communication training</strong> for customer support executives across voice, email, and chat processes.</li>\n<li>Train employees on <strong>professional communication</strong>, <strong>customer empathy</strong>, <strong>tone &amp; clarity</strong>, <strong>neutral accent</strong>, and <strong>grammar usage</strong>.</li>\n<li>Develop and deliver training modules on:</li>\n<li>Spoken English</li>\n<li>Business communication</li>\n<li>Customer handling phrases &amp; scripts</li>\n<li>Call etiquette &amp; soft skills</li>\n<li>Email writing &amp; chat etiquette</li>\n<li>Evaluate learners through role plays, call simulations, mock chats/emails, and assessments.</li>\n<li>Identify communication gaps and create customized training for new hires and existing employees.</li>\n<li>Provide actionable feedback to improve language proficiency, customer interactions, and overall CSAT.</li>\n<li>Track performance, maintain training reports, and coordinate with managers and QA teams for continuous improvement.</li>\n<li>Create an engaging and professional classroom environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>4–7 years</strong> of experience as a Communication Trainer / English Trainer in <strong>BPO, Customer Support, or Corporate Training</strong>.</li>\n<li>Strong command of spoken and written English with ability to simplify concepts.</li>\n<li>Experience in voice, email, or chat process training (preferred).</li>\n<li>Excellent presentation, facilitation, and coaching skills.</li>\n<li>Ability to handle diverse learners and drive measurable improvement.</li>\n</ul>\n<h3>Preferred Attributes</h3>\n<ul>\n<li>Certification in communication training, TEFL/TESOL, or soft skills (added advantage).</li>\n<li>Experience working with customer support KPIs such as CSAT, quality scores, AHT impact, etc.</li>\n<li>Strong understanding of customer service language, tone, and escalation handling.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer\">https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer</a></p>\n<p><strong>Contact Email:</strong> careers@way.com</p>",
        "tags": [
            "4-7 Years",
            "Communication Training",
            "Customer Support",
            "Corporate Training"
        ],
        "summary": "English Communication Trainer to enhance customer support teams' communication skills and improve CSAT through corporate training programs."
    },
    {
        "job_title": "Sales Expert",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26321",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Sales Expert\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Closing Date:</strong> 01, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking dynamic, customer-focused <strong>Sales Experts</strong> to join our <strong>Refinance Team</strong>. In this role, you will be the voice of our product — engaging directly with customers, understanding their needs, and helping them choose the best refinance solutions. This is a <strong>B2C sales role</strong>, where communication skills, persuasion, and a passion for sales will make all the difference.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Engage with potential customers through <strong>inbound and outbound calls, emails, and chats</strong>.</li>\n<li>Clearly explain refinance products, features, and benefits to customers.</li>\n<li>Build <strong>trust and rapport</strong> with customers to convert inquiries into successful sales.</li>\n<li>Consistently <strong>achieve individual and team sales targets</strong>.</li>\n<li>Maintain accurate records of customer interactions and transactions in <strong>CRM systems</strong>.</li>\n<li>Collaborate with <strong>Customer Support, Product, and Marketing teams</strong> to ensure a smooth post-sale experience.</li>\n<li>Stay updated on <strong>product knowledge, process updates, and industry trends</strong>.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in any discipline (preferably Business or Engineering).</li>\n<li><strong>2–5 years of experience</strong> in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and <strong>experience with CRM tools</strong>.</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<p><strong>Why You Will Love Working with Us</strong></p>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/sales-expert\">https://waydot.greythr.com/hire/jobs/sales-expert</a></p>",
        "tags": [
            "2–5 Years",
            "B2C Sales",
            "CRM Tools",
            "Financial Products"
        ],
        "summary": "Sales Expert at Way.com, a leading auto super app, to drive B2C refinance sales through customer engagement and CRM tools."
    },
    {
        "job_title": "Senior - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26320",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>Senior Marketing Designer</h2>\n<p><strong>Company:</strong> Way.com India Pvt Ltd\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Closing Date:</strong> 01, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/senior-marketing-designer\">Senior Marketing Designer Application</a></p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, parking, EV charging, and more. Utilizing AI, machine learning, and data analytics, we deliver personalized experiences. Recognized by Bloomberg and ranked #48 on Andreessen Horowitz’s Marketplace list, we redefine car ownership.</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>Senior Marketing Designer</strong> to create high-impact campaigns, ads, and visuals across platforms (paid media, social, email). Collaborate with creative, growth, and product teams to design performance-driven content aligned with Way.com’s brand.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design digital ad creatives, banners, and social visuals for ongoing campaigns.</li>\n<li>Conceptualize visuals for product launches and seasonal campaigns.</li>\n<li>Balance creativity and clarity in performance-focused designs.</li>\n<li>Collaborate with copywriters, growth managers, and product designers.</li>\n<li>Execute brand-aligned designs with a focus on storytelling and motion.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>3–5 years</strong> of experience in marketing or growth design.</li>\n<li>Proficiency in <strong>Figma, Photoshop, Illustrator, After Effects</strong>.</li>\n<li>Strong layout, typography, and storytelling skills.</li>\n<li>Understanding of digital marketing and ad metrics.</li>\n<li>Portfolio showcasing creativity and attention to detail.</li>\n<li>Eagerness to collaborate in a fast-paced environment.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work for the #1 Auto Super App in the US.</li>\n<li>Impact 10+ million users with innovative solutions.</li>\n<li>Dynamic, innovation-driven culture with clear growth pathways.</li>\n<li>Competitive compensation in a rapidly scaling tech company.</li>\n</ul>\n<p><strong>Contact:</strong> careers@way.com | <strong>Apply:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/senior-marketing-designer\">Senior Marketing Designer Application</a></p>",
        "tags": [
            "3-5 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Senior Marketing Designer creates high-impact campaigns and visuals across platforms, collaborating with creative and growth teams to drive engagement through innovative design solutions."
    },
    {
        "job_title": "Lead - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26319",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>Way.com — Lead - Marketing Designer</h2>\n<p><strong>Company Overview</strong>\nWay.com is America’s leading automotive super app, serving over 10 million customers with solutions ranging from auto insurance and parking to EV charging. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, we leverage AI and data analytics to redefine car ownership.</p>\n<p><strong>Position Details</strong>\n- <strong>Role</strong>: Lead - Marketing Designer\n- <strong>Location</strong>: Trivandrum\n- <strong>Type</strong>: Full-time / Work From Office\n- <strong>Closing Date</strong>: 01, Jan 2026\n- <strong>Job Published</strong>: 29, Dec 2025\n- <strong>Contact</strong>: careers@way.com\n- <strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-marketing-designer\">Link</a></p>\n<p><strong>Role Overview</strong>\nWe seek a hands-on creative leader to drive marketing design strategy, lead a team of designers, and execute high-impact campaigns across digital channels, brand initiatives, and performance ads.</p>\n<p><strong>Responsibilities</strong>\n- Lead and mentor a team of marketing designers.\n- Develop and execute creative strategies for paid, owned, and social channels.\n- Design campaign concepts for product launches, seasonal campaigns, and partnerships.\n- Maintain a consistent global visual identity for Way.com.\n- Collaborate with Growth, Product, and Content teams to create performance-driven visuals.\n- Balance creative excellence with data-driven decision-making.</p>\n<p><strong>Preferred Skills</strong>\n- 6–10 years of experience in marketing design, art direction, or brand design.\n- Proven leadership in managing creative/design teams.\n- Strong portfolio showcasing campaign systems, digital storytelling, and ad design.\n- Expertise in <strong>Figma</strong>, <strong>Photoshop</strong>, <strong>Illustrator</strong>, and <strong>After Effects / Premiere Pro</strong>.\n- Experience in performance design with knowledge of CTR, engagement metrics, and creative testing.\n- Strong visual storytelling and typography skills.</p>\n<p><strong>Why Join Us?</strong>\n- Work for the #1 Auto Super App in the US.\n- Impact 10+ million users with innovative solutions.\n- Dynamic, fast-paced, and innovation-driven culture.\n- Clear career growth in a rapidly scaling tech company.\n- Competitive compensation package.</p>",
        "tags": [
            "6–10 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Lead Marketing Designer to lead creative strategy and campaigns for a top US auto super app, managing a design team and creating high-performing visuals using Figma, Photoshop, and Illustrator."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26318",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a <strong>Seasoned Project Manager</strong> with <strong>8+ years of experience</strong> to oversee and drive strategic projects from initiation to completion. The ideal candidate will bring strong leadership, domain expertise, and hands-on execution skills to ensure successful delivery within scope, timeline, and budget.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead the full project lifecycle across multiple <strong>medium to large-scale initiatives</strong>.</li>\n<li>Define and manage <strong>project scope, objectives, deliverables, and success criteria</strong>.</li>\n<li>Develop and execute detailed project plans, including <strong>resource allocation, timelines, and budgets</strong>.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate when required.</li>\n<li>Manage <strong>stakeholder relationships</strong>, ensuring clear communication and alignment at all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams to ensure smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes and policies.</li>\n<li>Mentor and guide junior team members to build project management capability within the team.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in <strong>Engineering, Business Administration, or related field</strong> (Master’s degree is an advantage).</li>\n<li><strong>8+ years of proven project management experience</strong>, preferably in fintech platforms.</li>\n<li>Strong expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in <strong>project management tools</strong> (MS Project, JIRA, Asana, Trello, or similar).</li>\n<li>In-depth knowledge of <strong>Agile, Waterfall, or hybrid project management methodologies</strong>.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities under pressure.</li>\n<li>Certifications such as <strong>PMP, PRINCE2, or Agile (Scrum Master/SAFe)</strong> are highly preferred.</li>\n<li>Experience with tools like <strong>MPP</strong>.</li>\n<li>Ability to work with <strong>multiple teams</strong>, drive for execution &amp; results.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Application Details</h3>\n<ul>\n<li><strong>Closing Date</strong>: 01, Jan 2026</li>\n<li><strong>Job Published</strong>: 29, Dec 2025</li>\n<li><strong>Contact Email</strong>: careers@way.com</li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/project-manager\">https://waydot.greythr.com/hire/jobs/project-manager</a></li>\n</ul>",
        "tags": [
            "8+ Years",
            "Project Management Tools",
            "Agile Methodologies",
            "PMP Certification"
        ],
        "summary": "Lead strategic projects for a top US auto super app with 8+ years of experience in Agile methodologies and cross-functional team collaboration."
    },
    {
        "job_title": "SEO Team Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26317",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Team Lead - SEO</p>\n<h2>Experience</h2>\n<p>9 - 11 years</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a highly skilled <strong>Team Lead, SEO</strong> to spearhead our organic growth initiatives and enhance our search engine presence. In this leadership role, you will drive the development and execution of comprehensive SEO strategies, manage a team of SEO specialists, and collaborate cross-functionally to optimize our digital footprint. If you have a deep understanding of search algorithms, technical SEO, and content strategy, along with a passion for driving results, we want to hear from you!</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies</strong> – Define and implement a robust SEO roadmap, ensuring alignment with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team</strong> – Manage a team of SEO professionals, fostering a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO</strong> – Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management</strong> – Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making</strong> – Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration</strong> – Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization</strong> – Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis</strong> – Conduct SEO audits, monitor competitor strategies, and identify new opportunities to stay ahead in the industry.</li>\n<li><strong>SEO Performance Reporting</strong> – Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data to make data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li>Understanding of PPC advertising and its relationship with organic search.</li>\n<li>Experience working in a high-growth startup or fast-paced environment.</li>\n<li>Familiarity with social media marketing and its impact on SEO.</li>\n<li>Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/seo-team-lead\">https://waydot.greythr.com/hire/jobs/seo-team-lead</a></p>\n<p><strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "9-11 Years",
            "Technical SEO",
            "Google Analytics",
            "SEO Tools (SEMrush, Ahrefs)"
        ],
        "summary": "Lead SEO strategy and team for a top US automotive app, optimizing digital presence and driving organic growth through technical expertise and data-driven insights."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26316",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic and customer-focused <strong>Spanish Customer Success Executive</strong> to join our on-site, full-time team. This role involves delivering excellent customer service to Spanish-speaking clients via phone, resolving inquiries professionally and efficiently.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction</strong>: Manage inbound/outbound calls to resolve queries, concerns, and complaints.</li>\n<li><strong>Service Excellence</strong>: Provide empathetic, professional support for positive customer experiences.</li>\n<li><strong>Issue Escalation</strong>: Prioritize and escalate complex cases to relevant departments.</li>\n<li><strong>Documentation</strong>: Maintain accurate records of interactions and update databases.</li>\n<li><strong>Performance Goals</strong>: Meet/exceed targets for satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge</strong>: Stay updated on company products/services.</li>\n<li><strong>Team Collaboration</strong>: Foster a collaborative, high-performing work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Fluency in <strong>Spanish and English</strong> (written/spoken) for bilingual communication.</li>\n<li>Proven customer service experience in a voice process.</li>\n<li>Strong interpersonal/communication skills with patience and empathy.</li>\n<li>Ability to multitask and manage time efficiently in fast-paced settings.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries.</li>\n<li>Flexibility to work shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact 10+ million users with meaningful solutions.</li>\n<li>Dynamic, innovation-driven culture in a rapidly scaling tech company.</li>\n<li>Clear career growth pathways.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Contact Information</h3>\n<p><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\">Application Link</a></p>",
        "tags": [
            "2-4 Years",
            "Spanish/English Bilingual",
            "Customer Service",
            "Automotive/Fintech Knowledge"
        ],
        "summary": "Spanish-speaking Customer Success Executive needed for a US auto super app, requiring bilingual fluency, customer service experience, and automotive/fintech familiarity."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26315",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Customer Success Executive</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a <strong>Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Address customer queries through <strong>phone, email, chat, and social media channels</strong>.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to <strong>products, orders, returns, and general support requests</strong>.</li>\n<li>Maintain accurate <strong>customer records and feedback</strong> in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking <strong>customer satisfaction metrics</strong> and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Proven experience (2-5 years) in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a></li>\n</ul>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Customer Service",
            "Problem-Solving"
        ],
        "summary": "Customer Success Executive at Way.com handles customer queries via multiple channels, requiring 2-5 years of experience. Role focuses on resolving issues, maintaining CRM records, and enhancing customer satisfaction in a tech-driven environment."
    },
    {
        "job_title": "Institutional Sales Executive",
        "company": "Xminds Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/26314",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Xminds Infotech (P) Ltd</strong>\nT4 &amp; T8, 7th, Thejaswini, Technopark Rd, Technopark Campus, Phase I, Thiruvananthapuram, Kerala, 695581\n<a href=\"http://www.xminds.com\">Website</a></p>\n<h2>Job Details</h2>\n<ul>\n<li><strong>Role</strong>: Institutional Sales Executive</li>\n<li><strong>Closing Date</strong>: 31, Jan 2026</li>\n<li><strong>Published Date</strong>: 29, Dec 2025</li>\n<li><strong>Contact Email</strong>: <a href=\"mailto:careers@xminds.com\">careers@xminds.com</a></li>\n</ul>\n<h2>Brief Description</h2>\n<p>We are seeking a confident, relationship-driven <strong>Institutional Sales Executive</strong> to promote VR Lab solutions. The role involves on-ground sales, demonstrations, partnership building, and closing institutional contracts.</p>\n<h2>Key Responsibilities</h2>\n<ol>\n<li><strong>Institutional Sales &amp; Outreach</strong></li>\n<li>Visit engineering colleges, universities, polytechnics, and professional institutions</li>\n<li>Meet HODs, Principals, Deans, Lab Heads, and Academic Coordinators</li>\n<li>\n<p>Present VR Lab concepts, benefits, and academic value</p>\n</li>\n<li>\n<p><strong>Product Demonstration</strong></p>\n</li>\n<li>Conduct live demos of VR headsets and learning modules</li>\n<li>Explain VR-based learning of engine components, assembly, and functioning</li>\n<li>\n<p>Address technical, academic, and ROI-related queries from decision-makers</p>\n</li>\n<li>\n<p><strong>Relationship Management</strong></p>\n</li>\n<li>Build long-term relationships with academic/administrative stakeholders</li>\n<li>Follow up on proposals, approvals, and pilot programs</li>\n<li>\n<p>Serve as a single point of contact for assigned institutions</p>\n</li>\n<li>\n<p><strong>Sales &amp; Closure</strong></p>\n</li>\n<li>Convert leads into paid VR Lab installations or pilot programs</li>\n<li>Coordinate with internal teams for pricing, proposals, and onboarding</li>\n<li>\n<p>Achieve monthly/quarterly sales targets</p>\n</li>\n<li>\n<p><strong>Market Intelligence</strong></p>\n</li>\n<li>Gather insights on curriculum needs, competitor solutions, and budget cycles</li>\n<li>Provide feedback to product and leadership teams</li>\n</ol>\n<h2>Key Competencies</h2>\n<ul>\n<li>Strong communication and presentation skills</li>\n<li>Confidence to engage with HODs, Deans, and senior academicians</li>\n<li>Ability to explain technical products in value-driven terms</li>\n<li>Comfort with field sales, travel, and on-site demonstrations</li>\n<li>Negotiation and closing skills</li>\n</ul>\n<h2>Personality Traits</h2>\n<ul>\n<li>Professional and well-presented</li>\n<li>Self-driven and target-oriented</li>\n<li>Curious about VR, EdTech, and emerging technologies</li>\n<li>Patient listener with a consultative selling approach</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Competitive salary + performance-based incentives</li>\n<li>Opportunity to work with cutting-edge VR education technology</li>\n<li>Strong growth potential in EdTech &amp; immersive learning</li>\n<li>Direct exposure to academic leaders and institutions</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Educational Background</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Science, Business, or related field</li>\n<li>MBA or education-tech background is a plus</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li>2–5 years in B2B/Institutional/Education sales</li>\n<li>Prior experience selling to colleges, universities, or training institutes preferred</li>\n</ul>",
        "tags": [
            "2–5 Years",
            "VR Education",
            "B2B Sales",
            "EdTech Solutions"
        ],
        "summary": "Institutional Sales Executive to promote VR Lab solutions in educational institutions. Requires B2B sales experience, VR product demonstrations, and relationship-building with academic stakeholders."
    },
    {
        "job_title": "ACADEMIC COUNSELLOR'S /TELE CALLING EXECUTIVES (Female Fresher/Experienced Candidates)",
        "company": "Doubtbox Edutainment (P) Ltd",
        "url": "https://technopark.org/job-details/26313",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2><strong>Doubtbox Edutainment (P) Ltd</strong></h2>\n<p><strong>Address:</strong> 1st Floor, Nila Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.doubtbox.com\">http://www.doubtbox.com</a></p>\n<h3><strong>Walk-In Interview Details</strong></h3>\n<p><strong>Role:</strong> Academic Counsellor / Tele Calling Executive (Female Candidates Only)\n<strong>Walk-In Dates:</strong> 30th Dec 2025 - 31st Dec 2025\n<strong>Timing:</strong> 10:30 AM - 5:00 PM\n<strong>Job Published:</strong> 29th Dec 2025\n<strong>Contact Email:</strong> hr@doubtbox.com</p>\n<h3><strong>Company Overview</strong></h3>\n<p>Doubtbox is a leading Personalised LIVE Learning platform for students of classes 1-12 under CBSE/ICSE/State Boards. With over 100,000 students served and investments from Times of India Group, Doubtbox aims to expand into the Middle East. Recognized as the Best EdTech Start-up of 2020 by Amazon Edstart, the platform offers LIVE Online Teaching tailored to individual learning styles.</p>\n<h3><strong>Job Summary</strong></h3>\n<ul>\n<li>Conduct outbound calls to potential/existing customers (parents of Class 1-12 students).</li>\n<li>Work from Technopark, Thiruvananthapuram.</li>\n<li>Introduce products/services, explain features, and highlight benefits.</li>\n<li>Follow company scripts and adapt them for customer engagement.</li>\n<li>Identify and qualify sales leads by understanding customer needs.</li>\n<li>Maintain accurate records of interactions and update databases.</li>\n<li>Address customer inquiries, resolve complaints, and provide solutions.</li>\n<li>Collaborate with the sales team to meet targets.</li>\n<li>Stay updated on product knowledge and industry trends.</li>\n<li>Meet daily/weekly/monthly performance targets for call volume, conversion rates, and sales.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Bachelor's degree in any stream.</li>\n<li>Proven experience in telemarketing, sales, or customer service (advantageous).</li>\n<li>Excellent verbal/written communication skills with a pleasant telephone manner.</li>\n<li>Strong persuasion and negotiation skills.</li>\n<li>Ability to work in a fast-paced environment with multitasking.</li>\n<li>Good organizational skills and attention to detail.</li>\n<li>Proficiency in MS Office and CRM software.</li>\n<li>Positive attitude, resilience, and professional handling of rejection.</li>\n<li>Willingness to work flexible hours (evenings/weekends).</li>\n</ul>\n<h3><strong>Walk-In Venue</strong></h3>\n<p><strong>DOUBTBOX EDUTAINMENT (P) Ltd</strong>\n1st Floor, Nila Building, Technopark Phase 1, Trivandrum.</p>\n<h3><strong>Entry Pass Instructions</strong></h3>\n<ul>\n<li>Apply for the Technopark entry pass via mobile app or website (<a href=\"vms.technopark.org\">vms.technopark.org</a>).</li>\n<li>Entry pass will be sent to registered mobile/email. Show softcopy on gadgets at the entrance gate.</li>\n<li>Non-smartphone users can print hardcopy using a 5-digit OTP at kiosks near the main gate.</li>\n<li>Original certificates will be verified at the entry gate.</li>\n</ul>\n<h3><strong>Working Hours</strong></h3>\n<p>9:30 AM - 6:30 PM</p>",
        "tags": [
            "Fresher/Experienced",
            "Telemarketing/Sales",
            "CRM Software",
            "MS Office"
        ],
        "summary": "Doubtbox seeks Academic Counsellors/Tele Callers to engage parents, promote educational services, and meet sales targets. Candidates should have strong communication and sales skills, with flexibility in work hours."
    },
    {
        "job_title": "PHP Developaer",
        "company": "Hiworth Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26312",
        "location": "Technopark",
        "closing_date": "25 Jan 2026",
        "job_description": "<h2>Hiworth Solutions (P) Ltd</h2>\n<p>C-23, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.hiworthsolutions.com\">http://www.hiworthsolutions.com</a></p>\n<h3>PHP Developer</h3>\n<p><strong>Closing Date:</strong> 25, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> hr@hiworthsolutions.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking talented and adaptive PHP Developers with <strong>minimum 3 years</strong> of experience in handling <strong>core PHP/Laravel</strong> projects. Responsibilities include:\n- PHP/Laravel-based software program development\n- CMS-based website development using <strong>Pyro/WordPress</strong> frameworks\n- Theme integration, plugin editing, and installation to meet client requirements\n- E-commerce application development with shopping cart and payment gateway integration</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong knowledge of CMS-based application development and hands-on experience in plugin modifications and theme development/customization</li>\n<li>Proficiency in <strong>PHP5</strong> and proven track record in <strong>Laravel</strong>-based application development</li>\n<li>Expertise in <strong>MySQL</strong>, <strong>HTML</strong>, <strong>XML</strong>, <strong>CSS</strong>, <strong>AJAX</strong></li>\n<li>Understanding of <strong>MVC design patterns</strong></li>\n<li>Proficiency in front-end technologies: <strong>JavaScript</strong>, <strong>HTML5</strong>, <strong>CSS3</strong></li>\n<li>Scalable application design principles</li>\n<li>Familiarity with <strong>SQL/MySQL</strong> databases</li>\n<li>Experience with <strong>Laravel</strong>, <strong>Magento</strong>, or <strong>WordPress</strong> (added advantage)</li>\n<li>Proven ability to develop standalone applications independently</li>\n</ul>",
        "tags": [
            "3+ Years",
            "PHP",
            "Laravel",
            "CMS (WordPress/Pyro)"
        ],
        "summary": "Hiworth Solutions seeks experienced PHP Developers with 3+ years in Laravel and CMS-based projects, including e-commerce solutions and theme customization."
    },
    {
        "job_title": "Junior Python Developer (Gen AI Experience)",
        "company": "Tiltlabs Consultancy Services (P) Ltd",
        "url": "https://technopark.org/job-details/26311",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>TILTLABS CONSULTANCY SERVICES (P) Ltd</h2>\n<p>GH, Ground Floor,\nCarnival Technopark Building,\nTechnopark, Trivandrum, Kerala, India , 695581\n<a href=\"http://www.tiltlabs.io\">http://www.tiltlabs.io</a></p>\n<h3>Job Title</h3>\n<p><strong>Junior Python Developer (GenAI Experience)</strong></p>\n<h3>Experience</h3>\n<p><strong>2–3 Years</strong></p>\n<h3>Location</h3>\n<p><strong>Technopark, Trivandrum</strong></p>\n<h3>Employment Type</h3>\n<p><strong>Full-time</strong></p>\n<h3>Closing Date</h3>\n<p><strong>31, Jan 2026</strong></p>\n<h3>Job Summary</h3>\n<p>We are seeking a skilled Python Developer with <strong>GenAI implementation experience</strong> to join our team. The ideal candidate should have hands-on experience in Python, FastAPI, SQLAlchemy, API development, and applying <strong>Generative AI use cases</strong> in real-world applications.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop, test, and deploy RESTful APIs using <strong>FastAPI</strong>.</li>\n<li>Build and optimize backend services and workflows using <strong>Python</strong> and <strong>SQLAlchemy</strong>.</li>\n<li>Integrate <strong>GenAI models</strong> (OpenAI, Hugging Face, LangChain, or similar) into product features.</li>\n<li>Work with <strong>vector databases</strong>, <strong>embeddings</strong>, <strong>prompt engineering</strong>, and <strong>LLM pipelines</strong>.</li>\n<li>Collaborate with cross-functional teams to translate requirements into technical solutions.</li>\n<li>Optimize system performance, ensure scalability, and maintain code quality.</li>\n<li>Debug, troubleshoot, and resolve application issues.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Strong proficiency in Python</strong>.</li>\n<li><strong>Experience in FastAPI</strong> and API-based applications.</li>\n<li><strong>Hands-on experience with SQLAlchemy</strong> and relational databases.</li>\n<li>Understanding of <strong>GenAI concepts</strong>:</li>\n<li>LLMs and prompt engineering</li>\n<li>Building AI-powered APIs</li>\n<li>Working with embeddings, RAG, and model fine-tuning</li>\n<li>Familiarity with <strong>Git</strong>, <strong>CI/CD pipelines</strong>, and cloud platforms (<strong>AWS/GCP/Azure</strong> preferred).</li>\n<li>Strong problem-solving and debugging skills.</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Experience with <strong>Docker</strong>, <strong>Kubernetes</strong>, or containerized deployments.</li>\n<li>Knowledge of <strong>vector databases</strong> like Pinecone, ChromaDB, FAISS, etc.</li>\n<li>Exposure to <strong>microservices architecture</strong>.</li>\n<li>Understanding of <strong>machine learning fundamentals</strong>.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Candidates must include the following in the email body:\n- Relevant Exp:\n- Current CTC:\n- Expected CTC:\n- Immediate joiner or not:</p>\n<p><strong>Contact Email</strong>: <a href=\"mailto:careers@tiltlabs.io\">careers@tiltlabs.io</a></p>",
        "tags": [
            "2–3 Years",
            "Python",
            "FastAPI",
            "GenAI"
        ],
        "summary": "Junior Python Developer with GenAI experience to build APIs and integrate AI models. Requires Python, FastAPI, and Generative AI expertise."
    },
    {
        "job_title": "Senior DevAIOps Engineer - Lead Role",
        "company": "Eartheye Space Private Limited",
        "url": "https://technopark.org/job-details/26310",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<p><strong>Senior DevAIOps Engineer - Lead Role</strong></p>\n<p><strong>Company</strong>: Eartheye Space Private Limited\n<strong>Location</strong>: STPI Building, Technopark, Thiruvananthapuram, Kerala, India\n<strong>Application Deadline</strong>: 12, Feb 2026\n<strong>Published On</strong>: 29, Dec 2025\n<strong>Contact</strong>: <a href=\"mailto:apply@eartheye.space\">apply@eartheye.space</a></p>\n<p><strong>Role Overview</strong>\nAs the software development and GenAI AI/ML teams expand, you will serve as the senior DevAIOps lead engineer, bridging teams and ensuring seamless integration of workflows.</p>\n<p><strong>Key Responsibilities</strong>\n- Manage user access, health checks, vulnerability assessments, and software updates.\n- Oversee Git operations, CI/CD pipelines, and AWS environment management (IaC, serverless, private endpoints).\n- Deploy and orchestrate containers, manage ML model deployment, and maintain drift management pipelines.\n- Implement observability and reporting systems.</p>\n<p><strong>Company Culture</strong>\nEartheye Space operates in a fast-paced, high-performance environment with weekly micro-releases.</p>\n<p><strong>Compensation</strong>\n- Salary doubled based on your last three months' pay for qualified candidates.\n- Eligibility for ESOPs and RSUs.\n- Immediate joiners (within 30 days) preferred.</p>\n<p><strong>Preferred Skills</strong>\n- Minimum <strong>8 years</strong> of experience in designing, building, and managing automated infrastructure/data pipelines and workflow automation.\n- AWS Certification is preferred.</p>",
        "tags": [
            "8+ Years",
            "AWS",
            "DevAIOps",
            "CI/CD"
        ],
        "summary": "Lead DevAIOps engineer to manage infrastructure, automation, and ML deployment at a high-performance space tech startup. Salary doubled for qualified candidates."
    },
    {
        "job_title": "Content Creator",
        "company": "Tigrid Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26309",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>TIGRID TECHNOLOGIES (P) Ltd</h2>\n<p><strong>Location:</strong> Trivandrum, Kerala\n<strong>Employment Type:</strong> Remote or Hybrid\n<strong>Duration:</strong> 6 Months\n<strong>Closing Date:</strong> 10, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> hr@tigrid.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking a creative and motivated <strong>Content Creator</strong> to produce engaging digital content that supports our brand presence and audience engagement. The ideal candidate will create original content for social media, blogs, and various digital platforms.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Create original content for social media, blog posts, and digital platforms.</li>\n<li>Assist in planning and scheduling content calendars.</li>\n<li>Collaborate with the team to align content with brand goals and campaigns.</li>\n<li>Monitor content performance and suggest improvements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong writing and communication skills.</li>\n<li>Creative mindset with strong attention to detail.</li>\n<li>Familiarity with social media platforms and digital trends.</li>\n<li>Ability to manage multiple tasks and meet deadlines.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your updated CV to <strong>hr@tigrid.in</strong>\nLearn more about us at: <a href=\"https://www.tigrid.in\">www.tigrid.in</a></p>",
        "tags": [
            "Not Specified",
            "Content Creation",
            "Social Media Management",
            "Digital Marketing"
        ],
        "summary": "Creative Content Creator needed to develop digital content and collaborate on campaigns. Remote/Hybrid role in Trivandrum, Kerala, with 6-month duration."
    },
    {
        "job_title": "Technical Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26308",
        "location": "Technopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\n<a href=\"https://www.polussolutions.com\">Company Website</a></p>\n<p><strong>Technical Analyst</strong>\n<strong>Closing Date:</strong> 06, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a></p>\n<h3>Brief Description</h3>\n<p>Polus is seeking innovative candidates for a <strong>Technical Analyst</strong> role to deliver post-implementation support and solutions globally. The role emphasizes customer success through incident management, problem resolution, and adherence to service management processes.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Serve as the <strong>first point of contact</strong> for customers.</li>\n<li>Provide <strong>Level 2 technical support</strong> using diagnostic techniques to resolve issues.</li>\n<li>Own issues <strong>end-to-end</strong> and escalate complex problems to Level 3 support.</li>\n<li>Manage <strong>incident, problem, change, release, and service request</strong> operations.</li>\n<li>Ensure <strong>SLA adherence</strong> and follow established service management protocols.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in <strong>IT Service Management</strong> (Incident/Problem/Change/SR management).</li>\n<li>Proficiency in <strong>ticketing tools</strong> (ServiceNow, Jira).</li>\n<li>Strong knowledge of <strong>SQL/PL SQL</strong> and database fundamentals.</li>\n<li>Hands-on experience in <strong>database monitoring</strong>.</li>\n<li>Basic understanding of <strong>Java/JEE</strong>.</li>\n<li>Strong <strong>analytical reasoning</strong>, lateral thinking, and communication skills.</li>\n<li><strong>ITIL V3/V4</strong> certification is desirable.</li>\n<li>Willingness to work in <strong>rotational shifts (24/5)</strong>.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> Graduates in BE/BTech (Computer Science or related), MSC Computer Science, or MCA.</li>\n<li><strong>Experience:</strong> 1-3 years in IT support.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Send your resume to <strong>careers@polussolutions.com</strong> with the subject line: <strong>Technical Analyst - [Your Name]</strong>.</p>",
        "tags": [
            "1-3 Years",
            "ServiceNow/Jira",
            "SQL/PL SQL",
            "ITIL V3/V4"
        ],
        "summary": "Technical Analyst role providing IT support, incident management, and customer solutions. Requires 1-3 years experience, ticketing tools, SQL, and ITIL certification."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26307",
        "location": "Technopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum, Kerala, India - 695581\n<a href=\"https://www.polussolutions.com\">Company Website</a></p>\n<p><strong>Job Title</strong>: Business Development Executive\n<strong>Closing Date</strong>: 06, Jan 2026\n<strong>Published Date</strong>: 29, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a></p>\n<h3>Role Overview</h3>\n<p>Business Development teams are the cornerstone of any successful organisation. Polus is seeking <strong>driven, proactive, and self-motivated individuals</strong> to join our team and play a key role in expanding our business footprint.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Lead Generation &amp; Outreach</strong>: Identify and engage potential clients through cold calls, emails, and LinkedIn outreach.</li>\n<li><strong>Appointment Setting</strong>: Book qualified meetings for the US sales team with stakeholders.</li>\n<li><strong>Lead Qualification</strong>: Research and qualify leads based on company goals, target industries, and ICP criteria.</li>\n<li><strong>Cross-Team Collaboration</strong>: Coordinate meetings across time zones, maintain CRM records, and collaborate with marketing teams.</li>\n<li><strong>Event Participation</strong>: Attend virtual events to gather market insights and identify new leads.</li>\n<li><strong>Reporting</strong>: Provide weekly reports on pipeline activity, outreach metrics, and campaign effectiveness.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>2–5 years of Business Development experience</strong> in the IT industry.</li>\n<li>Bachelor’s degree in a relevant field.</li>\n<li>Proven experience in <strong>cold calling, email outreach, and appointment setting</strong>.</li>\n<li>Strong <strong>market research, requirement analysis, and proposal coordination</strong> skills.</li>\n<li>Ability to coordinate meetings across time zones (US alignment).</li>\n<li>Excellent <strong>communication, organisational, and data-driven decision-making</strong> skills.</li>\n</ul>\n<h3>Work Details</h3>\n<ul>\n<li><strong>Work Timing</strong>: 4:00 PM to 12:00 AM IST (Hybrid)</li>\n<li><strong>Location</strong>: Hybrid (flexible remote/in-office work)</li>\n<li><strong>Reporting To</strong>: Business Development Manager / Head of Sales</li>\n</ul>\n<p><strong>Application Instructions</strong>: Send your resume to <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a> with the subject line: <strong>Business Development Executive - [Your Name]</strong>.</p>",
        "tags": [
            "2-5 Years",
            "Lead Generation",
            "CRM Management",
            "Digital Marketing Support"
        ],
        "summary": "A Business Development Executive role at Polus Solutions in the IT industry, focused on lead generation, appointment setting, and US market alignment with hybrid work flexibility."
    },
    {
        "job_title": ".NET Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26306",
        "location": "Technopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\n<a href=\"https://www.polussolutions.com\">Company Website</a></p>\n<p><strong>.NET Developer</strong>\n<strong>Closing Date:</strong> 06, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a></p>\n<h3>About the Role</h3>\n<p>Polus Solutions is seeking a highly experienced <strong>.NET Developer</strong> with deep expertise in <strong>Microsoft SQL Server</strong> and enterprise-grade backend systems. This role demands strong technical leadership and hands-on development capabilities. Experience in the <strong>travel and booking domain</strong> is a strong plus.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain scalable, high-performance applications using <strong>.NET Core</strong> and <strong>C#</strong>.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Write clean, efficient, and testable code following best practices.</li>\n<li>Perform code reviews, debugging, and troubleshooting to ensure software quality.</li>\n<li>Work with databases (SQL Server, MySQL, or other RDBMS) to build efficient data-driven applications.</li>\n<li>Participate in the full software development life cycle (SDLC), from requirements gathering to deployment and support.</li>\n<li>Stay updated with the latest .NET ecosystem trends and recommend improvements.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>3–6 years</strong> of professional software development experience.</li>\n<li>Strong knowledge of <strong>.NET Core</strong> and <strong>C#</strong>.</li>\n<li>Proficiency in <strong>OOP concepts</strong>, design patterns, and best coding practices.</li>\n<li>Experience in <strong>Web API development</strong> and integration.</li>\n<li>Hands-on expertise with <strong>Entity Framework / EF Core</strong>.</li>\n<li>Proficiency in <strong>SQL</strong> and relational databases.</li>\n<li>Familiarity with version control systems (e.g., Git).</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Send your resume to <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a> with the subject line: <strong>“.NET Developer - [Your Name]”</strong>.</p>",
        "tags": [
            "3–6 Years",
            ".NET Core",
            "C#",
            "Entity Framework Core"
        ],
        "summary": "Polus Solutions seeks a .NET Developer with 3–6 years of experience in .NET Core, C#, and SQL for backend development in the travel domain."
    },
    {
        "job_title": "Associate Director – People & Program Management",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26305",
        "location": "Technopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India , 695581\n<a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a></p>\n<p><strong>Associate Director – People &amp; Program Management</strong>\n<strong>Closing Date:</strong> 06, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> ramya.a@polussolutions.com</p>\n<h3>About the Job</h3>\n<p>Polus Solutions is a values-led organization that blends strong business thinking with a people-first culture. As we scale, we are strengthening our delivery systems, leadership layers, and operational discipline, and this role plays a key part in that evolution.</p>\n<p>We are seeking an <strong>Associate Director – People &amp; Program Management</strong> to lead, mentor, and guide senior managers and delivery teams across Service Projects. This role ensures execution of excellence, brings consistency to delivery, and enables teams to operate with clarity, predictability, and accountability. It is ideal for a leader who enjoys building maturity, developing people, and raising the overall performance bar across the organization.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Leadership &amp; People Development</strong></li>\n<li>Manage and mentor group of PMs/Tech Leads to improve execution and decision-making.</li>\n<li>Build a culture of ownership, accountability, and proactive communication.</li>\n<li>Support leadership development and career growth for managers and emerging leaders.</li>\n<li>\n<p>Inspire and influence teams to adopt best practices and elevate performance.</p>\n</li>\n<li>\n<p><strong>Program &amp; Project Governance</strong></p>\n</li>\n<li>Oversee key initiatives through structured reviews, dashboards, KPIs, and governance routines.</li>\n<li>Establish delivery frameworks, reporting mechanisms, and risk management practices.</li>\n<li>Improve predictability with milestone planning, dependency tracking, and proactive issue resolution.</li>\n<li>\n<p>Drive standardization of delivery processes to uplift maturity across teams.</p>\n</li>\n<li>\n<p><strong>Operational Excellence &amp; Continuous Improvement</strong></p>\n</li>\n<li>Define practical KPIs that drive alignment, predictability, and accountability.</li>\n<li>Identify maturity gaps and implement initiatives to improve delivery performance.</li>\n<li>Promote structured execution, process discipline, and data-driven decision-making.</li>\n<li>Foster a high-energy, results-oriented delivery culture.</li>\n</ol>\n<h3>Preferred Skills &amp; Requirements</h3>\n<ul>\n<li>10–15 years of experience in technology, project, or program management roles.</li>\n<li>Proven experience leading managers and cross-functional teams.</li>\n<li>Strong understanding of SDLC, engineering practices, and project governance.</li>\n<li>High-energy, action-oriented leader with strong execution focus.</li>\n<li>Ability to influence and mentor senior team members without relying on authority.</li>\n<li>Excellent skills in prioritization, decision-making, stakeholder management, and communication.</li>\n</ul>\n<h3>Preferred Attributes</h3>\n<ul>\n<li>Ability to influence without authority and uplift team maturity.</li>\n<li>Strong ownership mindset with structured, strategic thinking.</li>\n<li>Experience in implementing governance models, KPIs, and delivery frameworks.</li>\n<li>Comfortable working with technical teams and understanding technology-driven decisions.</li>\n<li>Passion for developing leaders and building high-performing teams.</li>\n<li>Practical mindset, focus on what works, not overcomplicated frameworks.</li>\n</ul>\n<h3>Why Join Us</h3>\n<ul>\n<li>You get to directly shape how delivery teams operate.</li>\n<li>You work closely with Directors and have visibility in company strategy.</li>\n<li>You get autonomy to improve processes and influence how teams grow.</li>\n<li>You work in a culture that values clarity, respect, and ownership.</li>\n<li>Your work will have a clear impact on team efficiency and delivery quality.</li>\n</ul>\n<p><strong>If this role excites you, please share your resume at:</strong> ramya.a@polussolutions.com</p>",
        "tags": [
            "10–15 Years",
            "Program Management",
            "Leadership Development",
            "SDLC"
        ],
        "summary": "Lead senior managers and teams to ensure delivery excellence through governance and process improvement. Requires 10-15 years in program management with leadership and SDLC expertise."
    },
    {
        "job_title": "Junior Devops Technical Support Engineer (0.5 - 2 yrs)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/26304",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.reizendretail.in\">www.reizendretail.in</a>\n<strong>Job Title:</strong> Junior Devops Technical Support Engineer\n<strong>Experience Required:</strong> 0.5 - 2 Years\n<strong>Closing Date:</strong> 12, Feb 2026\n<strong>Published Date:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>\n<p><strong>Salary Package:</strong> 4 - 6 LPA\n<strong>Work Location:</strong> Work From Office (Trivandrum)</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a proactive and highly skilled <strong>Technical Support Engineer</strong> to provide exceptional technical support for overseas projects. The role requires working in rotational shifts to ensure 24/7 availability, troubleshooting complex issues across cloud platforms, networking, application architectures, and DevOps toolchains.</p>\n<p><strong>Key Responsibilities:</strong>\n- Provide technical support and troubleshoot issues related to <strong>Fargate, ECS, DynamoDB, BigQuery, SNS</strong>, etc.\n- Analyze logs and metrics using <strong>CloudWatch, Prometheus, Grafana, Loki, Alert Managers, Splunk</strong>.\n- Resolve networking challenges involving <strong>load balancers, API gateways, reverse proxies, ingress controllers, service-to-service communications</strong>.\n- Address client-server communications, firewalls, and virtual machines.\n- Collaborate with DevOps teams on <strong>Docker, Kubernetes, Jenkins, Ingress Controllers</strong>.\n- Act as the first point of contact for technical queries and escalate issues when necessary.\n- Liaise with development and operations teams to identify root causes and resolve incidents.\n- Document troubleshooting steps and maintain a knowledge base.\n- Implement best practices for monitoring and incident response.\n- Participate in shift handovers and provide updates on ongoing issues.</p>\n<p><strong>Preferred Skills:</strong>\n<strong>Cloud Platforms and Services:</strong>\n- Hands-on experience with <strong>Fargate, ECS, DynamoDB, BigQuery, SNS</strong>.</p>\n<p><strong>Monitoring and Logging Tools:</strong>\n- Proficiency in <strong>CloudWatch Logs, Loki, Splunk</strong>.\n- Hands-on knowledge of <strong>Prometheus, Grafana, Alert Manager</strong>.</p>\n<p><strong>Networking and Security:</strong>\n- Understanding of <strong>load balancers (ALB, NLB), API Gateways (AWS API Gateway, NGINX), reverse proxies, ingress controllers (NGINX Ingress, Traefik)</strong>.\n- Knowledge of <strong>firewalls, security groups, IAM roles, VM troubleshooting (AWS EC2)</strong>.</p>\n<p><strong>DevOps Toolchains:</strong>\n- Proficiency with <strong>Docker, Kubernetes, Jenkins, GitHub Actions, ArgoCD</strong>.\n- Understanding of <strong>CI/CD pipelines, Ingress controllers (NGINX, Traefik), SSL termination</strong>.</p>\n<p><strong>Troubleshooting and Incident Management:</strong>\n- Strong problem-solving skills using logs, metrics, and system-level debugging.\n- Document detailed troubleshooting steps for recurring issues.</p>\n<p><strong>Collaboration and Communication:</strong>\n- Collaborate with cross-functional teams (DevOps, development, operations).\n- Use tools like <strong>Slack, JIRA, Confluence, Google Workspace</strong> for communication and issue tracking.</p>",
        "tags": [
            "0.5 - 2 Years",
            "Docker",
            "Kubernetes",
            "Jenkins"
        ],
        "summary": "Junior DevOps Technical Support Engineer with 0.5-2 years experience providing 24/7 support for cloud, networking, and DevOps toolchain issues. Collaborates with teams to resolve incidents and optimize monitoring practices."
    },
    {
        "job_title": "Junior Business Development Executive",
        "company": "Srishti Innovative Educational Services (P) Ltd",
        "url": "https://technopark.org/job-details/26303",
        "location": "Technopark",
        "closing_date": "29 Jan 2026",
        "job_description": "<h2><strong>Junior Business Development Executive</strong></h2>\n<p><strong>Company</strong>: Srishti Innovative Educational Services (P) Ltd\n<strong>Location</strong>: 2C, 2nd Floor, Carnival Building, Technopark Phase 1, 695581\n<strong>Website</strong>: <a href=\"https://www.srishtis.com\">https://www.srishtis.com</a>\n<strong>Closing Date</strong>: 29, Jan 2026\n<strong>Job Published</strong>: 29, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:resumes@srishtis.com\">resumes@srishtis.com</a></p>\n<h3><strong>Job Description</strong></h3>\n<ul>\n<li>Learn and understand the company’s products and services.</li>\n<li>Assist in identifying and reaching out to potential clients through calls, emails, and online platforms.</li>\n<li>Support the marketing and sales team in lead generation and follow-ups.</li>\n<li>Participate in networking activities and sales campaigns to gain exposure.</li>\n<li>Maintain basic records of client interactions and follow-up status.</li>\n<li>Help build and maintain positive relationships with existing clients.</li>\n<li>Collect client feedback and share insights with the team.</li>\n<li>Support the preparation of proposals, presentations, and sales documents.</li>\n<li>Stay updated on market trends and competitor offerings.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Graduate or pursuing a degree in Marketing, Business Administration, or a related field.</li>\n<li>Strong interest in sales, business development, and client interaction.</li>\n<li>Good verbal and written communication skills.</li>\n<li>Willingness to learn and adapt in a fast-paced environment.</li>\n<li>Basic understanding of sales concepts (training will be provided).</li>\n<li>Positive attitude with a goal-oriented mindset.</li>\n<li>Presentable, professional, and confident personality.</li>\n<li>Ability to work well in a team and take guidance from seniors.</li>\n</ul>\n<h3><strong>Application</strong></h3>\n<p>Interested candidates are required to fill out the <a href=\"https://forms.gle/rpQJPfMDd3HX7ZAJA\">Google Form</a>.</p>",
        "tags": [
            "Entry Level",
            "Marketing",
            "Business Administration",
            "Sales Concepts"
        ],
        "summary": "Junior Business Development Executive to assist in client outreach, support sales, and maintain client relationships. Requires marketing/business background, communication skills, and sales interest."
    },
    {
        "job_title": "Accountant ( CA Pursuing )",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26302",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<p><strong>Company Information</strong></p>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">Website</a></p>\n<p><strong>Job Title</strong>: Accountant (CA Pursuing)\n<strong>Closing Date</strong>: 12, Feb 2026\n<strong>Job Published</strong>: 29, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<p><strong>Brief Description</strong>\n- Lead role in company share issue procedures, including valuation processes, preparation of projections, and statutory documents for stakeholders and ROC.\n- Communicate with valuers to explain projections and detail the logic used.\n- Prepare share issue offer documents, statutory meeting documentation, resolution passing, and ROC intimation.\n- Develop realistic cash flow projections considering statutory requirements, prioritizing payments and receivables.\n- Prepare budgets and analyze periodic performance against actual financial results.</p>\n<p><strong>Preferred Skills</strong>\n- <strong>Qualification</strong>: Cleared at least one group of CA IPCC.\n- <strong>Experience</strong>: 3 years of quality Articleship experience in a Chartered Accountants firm (no post-CA experience required).\n- Confident in using Excel at an intermediate level.\n- Ability to work independently and lead the finance team.\n- Strong attention to detail, analytical skills, and excellent verbal/written communication.</p>\n<p><strong>Salary</strong>: 5-6 LPA</p>\n<p><strong>Application</strong>: Submit your updated resume to <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>",
        "tags": [
            "3 Years",
            "CA",
            "Excel",
            "Financial Projections"
        ],
        "summary": "Accountant (CA Pursuing) leads share issue procedures, financial projections, and statutory compliance. Requires 3+ years of articleship experience and strong Excel skills."
    },
    {
        "job_title": "Accountant ( CA Pursuing )",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/26301",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>REIZEND (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark Phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Position</strong>: Accountant (CA Pursuing)\n<strong>Closing Date</strong>: 12, Feb 2026\n<strong>Published</strong>: 29, Dec 2025\n<strong>Contact</strong>: <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a>\n<strong>Salary</strong>: ₹5-6 LPA</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Lead company share issue procedures, including valuation processes, projections, and statutory document preparation for stakeholders and ROC.</li>\n<li>Communicate with valuers to explain projections and detail logic used.</li>\n<li>Prepare share issue offer documents, statutory meeting documentation, resolution passing, and ROC intimation.</li>\n<li>Develop realistic cash flow projections considering statutory requirements, prioritizing payments and receivables.</li>\n<li>Prepare budgets and analyze periodic performance against actual financial results.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Qualification</strong>: Cleared at least one group of CA IPCC.</li>\n<li><strong>Experience</strong>: 3 years of quality Articleship experience in a Chartered Accountants firm (no post-CA experience required).</li>\n<li><strong>Technical Skills</strong>: Intermediate Excel proficiency.</li>\n<li><strong>Soft Skills</strong>: Independent work capability, team leadership, strong analytical skills, and excellent verbal/written communication.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Submit your updated resume to <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a>.</p>",
        "tags": [
            "3 Years",
            "CA (Chartered Accountant)",
            "Excel",
            "Financial Projections"
        ],
        "summary": "Accountant (CA Pursuing) role at REIZEND (P) Ltd requires 3 years of Articleship experience, CA IPCC qualification, and Excel skills. Responsibilities include leading share issue procedures and financial projections with a salary of ₹5-6 LPA."
    },
    {
        "job_title": "Hiring | Digital Marketing Intern (SEO)_Technopark/Infopark",
        "company": "Saasvaap Techies (P) Ltd",
        "url": "https://technopark.org/job-details/26299",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Saasvaap Techies (P) Ltd</h2>\n<p><strong>Module No. B-11, B-12, 3rd Floor, Gayatri Building, Phase-I Campus, Technopark, Thiruvananthapuram, 695581</strong>\n<strong>Website:</strong> <a href=\"www.saasvaap.com\">www.saasvaap.com</a></p>\n<h3>Hiring: Digital Marketing Intern (SEO)</h3>\n<p><strong>Location:</strong> Technopark/Infopark\n<strong>Closing Date:</strong> 10, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@saasvaap.com\">careers@saasvaap.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking passionate and motivated <strong>Digital Marketing Interns with SEO experience</strong> to join our growing team. This internship offers <strong>real-time industry exposure</strong> and an opportunity to build a strong digital marketing portfolio.</p>\n<h3>✅ What We’re Looking For:</h3>\n<ul>\n<li><strong>3–6 months experience</strong> in Digital Marketing / SEO</li>\n<li>Familiarity with <strong>Google Analytics, Search Console, SEMrush, Ahrefs</strong>, etc.</li>\n<li>Basic knowledge of <strong>content marketing, social media, &amp; PPC</strong> (added advantage)</li>\n<li>Strong <strong>analytical &amp; communication skills</strong></li>\n<li>Ability to work in a <strong>fast-paced environment</strong></li>\n<li>Candidates who have completed <strong>Digital Marketing courses/internships</strong> preferred</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>3–6 months experience</strong> in Digital Marketing / SEO</li>\n<li>Proficiency in <strong>Google Analytics, Search Console, SEMrush, Ahrefs</strong>, etc.</li>\n<li>Basic understanding of <strong>content marketing, social media, &amp; PPC</strong></li>\n<li>Strong <strong>analytical &amp; communication skills</strong></li>\n<li>Adaptability to <strong>fast-paced environments</strong></li>\n<li>Preference for candidates with <strong>Digital Marketing courses/internships</strong> completed</li>\n</ul>",
        "tags": [
            "3-6 Months",
            "Google Analytics",
            "SEMrush",
            "Ahrefs"
        ],
        "summary": "Digital Marketing Intern (SEO) role requiring 3-6 months experience in SEO tools and analytics, offering real-time industry exposure and portfolio-building opportunities."
    },
    {
        "job_title": "BUSINESS DEVELOPMENT EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26298",
        "location": "Technopark",
        "closing_date": "02 Jan 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd\n<strong>Location:</strong> Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a>\n<strong>Closing Date:</strong> 02, Jan 2026\n<strong>Published Date:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Business Development Executive</strong> to drive new business opportunities, build client relationships, and contribute to company growth. Ideal candidates will be motivated, dynamic, and capable of fostering strong vendor and client partnerships.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Identify and approach potential vendors for business opportunities.</li>\n<li>Contact vendors via calls to explain company services.</li>\n<li>Build and maintain strong relationships with clients and vendors.</li>\n<li>Understand client requirements and offer tailored business solutions.</li>\n<li>Develop and implement lead generation strategies to attract potential clients.</li>\n<li>Manage client and partner relationships effectively.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Any degree (freshers welcome).</li>\n<li>Basic computer knowledge and proficiency in MS Office.</li>\n<li><strong>Experience:</strong> 0-1 years.</li>\n<li><strong>Basic Pay:</strong> ₹12,000/month.</li>\n<li><strong>Office Work Only.</strong></li>\n<li><strong>Female candidates preferred.</strong></li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong communication and negotiation skills.</li>\n<li>Ability to build rapport and maintain long-term relationships.</li>\n<li>Goal-oriented, confident, and self-motivated.</li>\n<li>Basic understanding of sales and vendor management.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>💰 <strong>Performance-Based Incentives:</strong> Earn rewards for dedication and achievements.</li>\n<li>🎉 <strong>Fun Fridays:</strong> Engaging team activities to kick off weekends.</li>\n<li>🎈 <strong>Special Occasion Celebrations:</strong> Celebrate milestones and birthdays together.</li>\n<li>🤝 <strong>Supportive Team Environment:</strong> Collaborate with passionate professionals.</li>\n<li>📈 <strong>Career Development:</strong> Access training for skill enhancement and growth.</li>\n</ul>\n<p><strong>Note:</strong> Mention the subject line as <strong>'Application for Business Development Executive'</strong> when applying.</p>",
        "tags": [
            "0-1 Years",
            "Sales & Vendor Management",
            "Lead Generation",
            "Client Relationship Management"
        ],
        "summary": "A Business Development Executive role with 0-1 years experience, focusing on sales, lead generation, and client relationships. Offers performance-based incentives and career growth opportunities."
    },
    {
        "job_title": "Manager - Service Delivery and Infrastructure",
        "company": "Alamy Images India (P) Ltd",
        "url": "https://technopark.org/job-details/26297",
        "location": "Technopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<p><strong>Alamy Images India (P) Ltd</strong>\n<strong>Address:</strong> C-16, Gayatri Building, Technopark Campus, Thiruvanathapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.alamy.com\">http://www.alamy.com</a></p>\n<p><strong>Job Title:</strong> Manager - Service Delivery and Infrastructure\n<strong>Closing Date:</strong> 15, Jan 2026\n<strong>Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:jobsindia@alamy.com\">jobsindia@alamy.com</a></p>\n<h3>Role Overview</h3>\n<p>The <strong>Manager - Service Delivery and Infrastructure</strong> will lead Customer Support, Service Improvement, Service Operations, Service Transition, and Infrastructure Services teams in India. This strategic role drives service excellence through:</p>\n<ul>\n<li><strong>Customer-Centricity:</strong> Incident leadership, ticket resolution, and trust safeguarding.</li>\n<li><strong>Operational Resilience:</strong> Monitoring, governance, and root cause analysis to mitigate risks.</li>\n<li><strong>Efficiency &amp; Transparency:</strong> Reporting and process optimization for continuous improvement.</li>\n<li><strong>Proactive Improvement:</strong> Trend analysis to prevent recurring issues and ensure long-term stability.</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Oversee Infrastructure services teams to meet KPIs/SLAs for service requests, incident management, and IT resource allocation.</li>\n<li>Develop dashboards and reports on SLA compliance, ticket trends, and incident metrics.</li>\n<li>Implement IT systems, controls, and policies to mitigate risks (e.g., IT security, GDPR).</li>\n<li>Manage CAB processes, validate dependencies, and ensure safe deployments with rollback strategies.</li>\n<li>Account for service quality, capacity planning, and growth demands.</li>\n<li>Drive internal/external service reviews and collaborate with teams to improve processes.</li>\n<li>Act as a Technology ambassador, fostering cross-departmental communication.</li>\n<li>Lead a team of service engineers for 3rd-line IT troubleshooting.</li>\n<li>Coordinate with Product Delivery and Platform Teams to optimize alerting systems (AWS, databases, monitoring tools).</li>\n<li>Manage major incidents, bridging technical squads, service desk, and leadership.</li>\n<li>Maintain IT infrastructure (compute, storage, network, cloud, data centers).</li>\n<li>Execute ITSCM operations (backups, high availability, resiliency, 3rd-party services).</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Leadership:</strong> 2+ years as a Senior Leader in a similar role; matrix management experience.</li>\n<li><strong>Technical Expertise:</strong> ITIL/SLM best practices, IT/Infra security, Windows/Linux servers, Office 365, Active Directory, network management (routers, switches, firewalls).</li>\n<li><strong>Service Desk:</strong> Experience with Jira Service Management, ServiceNow, Freshservice, or Zendesk (configuration, automation, reporting).</li>\n<li><strong>Collaboration:</strong> Integration of Service Desk with Product Delivery/Engineering teams in agile/DevOps environments.</li>\n<li><strong>Communication:</strong> High-level stakeholder management and clear, data-driven decision-making.</li>\n</ul>\n<h3>Desirable</h3>\n<ul>\n<li>ITIL/ITSM Certification</li>\n<li>AWS/Azure experience</li>\n<li>Scripting/automation skills</li>\n<li>Infrastructure budget management</li>\n<li>B2B digital/media/subscription services background</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://careers.pamediagroup.com/job-invite/669/\">ATS Link</a></p>",
        "tags": [
            "2+ Years",
            "ITIL/ITSM",
            "AWS/Azure",
            "Service Desk Platforms"
        ],
        "summary": "Lead IT service delivery and infrastructure for Alamy Images, ensuring operational excellence and customer-centric solutions through strategic leadership and technical expertise."
    },
    {
        "job_title": "Data Analyst",
        "company": "Alamy Images India (P) Ltd",
        "url": "https://technopark.org/job-details/26296",
        "location": "Technopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Company Info</h2>\n<p><strong>Alamy Images India (P) Ltd</strong>\nC-16, Gayatri Building\nTechnopark Campus\nThiruvanathapuram, 695581\n<a href=\"http://www.alamy.com\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p>Data Analyst</p>\n<h2>Closing Date</h2>\n<p>15, Jan 2026</p>\n<h2>Job Published</h2>\n<p>29, Dec 2025</p>\n<h2>Contact</h2>\n<p><strong>Email:</strong> <a href=\"mailto:jobsindia@la\">jobsindia@la</a> (incomplete email address)\n<strong>Apply Now:</strong> <a href=\"https://careers.pamediagroup.com/job-invite/673\">ATS Link</a></p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Maintain consistency, accuracy, and completeness of customer data across systems</li>\n<li>Track, validate, and update customer data in Salesforce</li>\n<li>Develop Power BI dashboards for business/sales insights</li>\n<li>Write/optimise SQL queries for data extraction, validation, and analysis</li>\n<li>Identify data quality issues and recommend corrective actions</li>\n<li>Support data process creation, documentation, and governance</li>\n<li>Collaborate with sales/operations teams on data requirements</li>\n<li>Define data standards, validation rules, and best practices</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Mandatory:</strong> 1.5-3 years as Data Analyst</li>\n<li>Strong SQL proficiency</li>\n<li>Hands-on Power BI experience</li>\n<li>Data quality expertise (accuracy, completeness, consistency)</li>\n<li>Analytical mindset with attention to detail</li>\n<li>Business process translation into data requirements</li>\n<li>Documentation/data workflow process definition</li>\n<li>Basic ETL/data pipeline understanding</li>\n<li>Salesforce (Sales Cloud) exposure preferred</li>\n<li>Customer/sales data experience</li>\n<li>Communication skills for non-technical stakeholders</li>\n<li>Scalable data process growth potential</li>\n<li>Proactive data issue resolution</li>\n<li>Ownership of data accuracy</li>\n</ul>\n<h2>Application</h2>\n<p><a href=\"https://careers.pamediagroup.com/job-invite/673\">APPLY NOW</a></p>",
        "tags": [
            "1.5-3 Years",
            "SQL",
            "Power BI",
            "Data Quality"
        ],
        "summary": "Data Analyst role requiring 1.5-3 years of SQL/Power BI experience to maintain data quality and support business decisions through analytics."
    },
    {
        "job_title": "Senior React Developer",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/26295",
        "location": "Technopark",
        "closing_date": "29 Jan 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</strong>\n<strong>Address:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"https://www.ateamsoftsolutions.com\">https://www.ateamsoftsolutions.com</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role:</strong> Senior React Developer\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Experience Required:</strong> 6+ years\n<strong>Joining Preference:</strong> Immediate joiners preferred\n<strong>Application Deadline:</strong> 29, Jan 2026\n<strong>Published On:</strong> 29, Dec 2025</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Lead a team of 4+ developers, manage project estimation, and delivery planning</li>\n<li>Design, develop, and deploy modern web applications using <strong>React.js</strong> and <strong>Next.js</strong></li>\n<li>Collaborate with product owners, designers, and backend teams to deliver seamless solutions</li>\n<li>Ensure application performance, quality, and responsiveness</li>\n<li>Conduct code reviews and maintain best practices</li>\n<li>Work with <strong>GraphQL</strong>, <strong>React Query</strong>, and <strong>WebSockets</strong> for scalable, real-time solutions</li>\n<li>Stay updated with emerging front-end technologies and industry trends</li>\n</ul>\n<h2>Required Technical Skills</h2>\n<ul>\n<li>Strong expertise in <strong>React.js</strong> and <strong>Next.js</strong> (SSR, SSG, API routes)</li>\n<li>Proficiency in <strong>JavaScript (ES6+)</strong>, <strong>HTML5</strong>, <strong>CSS3</strong>, and <strong>Tailwind CSS</strong></li>\n<li>Experience with <strong>Redux</strong> or <strong>Zustand</strong> for state management</li>\n<li>Familiarity with <strong>GraphQL</strong> &amp; <strong>React Query</strong></li>\n<li>Hands-on experience with <strong>WebSockets</strong> &amp; real-time communication</li>\n<li>Solid knowledge of <strong>Webpack/Vite</strong> and <strong>Git</strong> workflow</li>\n<li>Practical experience with <strong>Firebase</strong> (Auth, Firestore, Messaging, Storage, etc.)</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Strong experience in <strong>React.js</strong>, <strong>Next.js</strong>, <strong>Redux</strong>, or <strong>Zustand</strong></li>\n<li>Expert in <strong>JavaScript (ES6+)</strong>, <strong>HTML5</strong>, <strong>CSS3</strong>, and <strong>Tailwind CSS</strong></li>\n<li>Deep understanding of component-based architecture</li>\n<li>Experience with <strong>GraphQL</strong>, <strong>React Query</strong>, and real-time communication (<strong>WebSockets</strong>)</li>\n<li>Familiarity with tools like <strong>Webpack</strong>, <strong>Vite</strong>, and <strong>Git</strong></li>\n</ul>\n<h2>How to Apply</h2>\n<p><strong>Email:</strong> <a href=\"mailto:recruitment@ateamsoftsolutions.com\">recruitment@ateamsoftsolutions.com</a>\n<strong>Phone:</strong> +91 7907410058</p>",
        "tags": [
            "6+ Years",
            "React.js",
            "Next.js",
            "Redux/Zustand"
        ],
        "summary": "Senior React Developer needed to lead teams and build next-gen web apps using React/Next.js. Requires 6+ years of experience and expertise in modern front-end technologies."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26294",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>About SRS Global Technologies</h2>\n<p>SRS Web Solutions is a leading healthcare SaaS technology company specializing in digital healthcare documentation for the medical, dental, and veterinary industries. With over 3,000+ clients and 5 million patients served globally, we modernize practices by improving productivity and efficiency. Our senior software developers have a collective 100,000 hours in customized healthcare and security programming. SRS is ranked among the Inc 5000 fastest-growing companies in the USA.</p>\n<h2>Job Summary</h2>\n<p>We are seeking a <strong>UI/UX Designer</strong> with hands-on experience in designing and converting layouts into clean HTML. The role focuses on:</p>\n<ul>\n<li>Designing and developing HTML email templates for marketing and campaigns</li>\n<li>Creating marketing landing pages and converting them into responsive HTML</li>\n<li>Converting Figma designs into pixel-perfect HTML/CSS</li>\n<li>Designing social media creatives for ads and organic posts</li>\n<li>Ensuring mobile responsiveness and cross-browser compatibility</li>\n<li>Performing basic WordPress backend edits (pages, content, layouts)</li>\n<li>Collaborating with marketing and development teams</li>\n<li>Maintaining consistent UI/UX across all digital assets</li>\n</ul>\n<h2>Required Skills</h2>\n<ul>\n<li><strong>3–4 years</strong> experience in UI/UX and front-end design</li>\n<li>Strong knowledge of <strong>HTML5 &amp; CSS3</strong></li>\n<li>Proven experience with <strong>Figma to HTML conversion</strong></li>\n<li>Experience designing <strong>HTML email templates</strong></li>\n<li>Understanding of marketing landing page UX &amp; conversion design</li>\n<li>Basic working knowledge of <strong>WordPress backend</strong></li>\n<li>Experience creating <strong>social media creatives</strong></li>\n<li>Openness to working night shifts</li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Email:</strong> <a href=\"mailto:hr@srswebsolutions.com\">hr@srswebsolutions.com</a>\n<strong>Address:</strong> 1st Floor, Thejaswini Building, Technopark, Karyavattom PO, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://srsglobaltechnologies.com\">https://srsglobaltechnologies.com</a></p>\n<h2>Application Deadline</h2>\n<p><strong>Closing Date:</strong> 11, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025</p>",
        "tags": [
            "3-4 Years",
            "Figma to HTML",
            "HTML5/CSS3",
            "WordPress Backend"
        ],
        "summary": "UI/UX Designer needed for healthcare SaaS company to create email templates, landing pages, and social media designs with 3-4 years of HTML/CSS and Figma conversion experience."
    },
    {
        "job_title": "QA Manager",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26293",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>SRS Global Technologies (P) Ltd</h2>\n<p><strong>Address:</strong> 1st Floor, Thejaswini Building, Technopark, Karyavattom PO, Thirivananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://srsglobaltechnologies.com\">https://srsglobaltechnologies.com</a>\n<strong>Closing Date:</strong> 11, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> hr@srswebsolutions.com</p>\n<h3>About SRS</h3>\n<p>SRS Web Solutions is a leading healthcare SaaS technology company specializing in digital healthcare documentation for the medical, dental, and veterinary industries. With over 3,000+ clients and 5 million patients served globally, SRS modernizes practices by enhancing productivity and efficiency. Ranked among the Inc 5000 fastest-growing companies in the USA, SRS boasts senior developers with 100,000+ hours in customized healthcare and security programming.</p>\n<h3>Job Description</h3>\n<ul>\n<li>Design, develop, and execute manual and automated test cases using <strong>Selenium</strong>, <strong>Java</strong>, and <strong>Page Object Model (POM)</strong> frameworks.</li>\n<li>Build and maintain automation frameworks; integrate tests into <strong>CI/CD pipelines</strong> (Jenkins, GitHub).</li>\n<li>Conduct functional, regression, integration, and API testing using <strong>Postman</strong> and <strong>SwaggerUI</strong>.</li>\n<li>Validate backend data with <strong>SQL queries</strong> and perform data-driven testing.</li>\n<li>Collaborate with cross-functional teams in <strong>Agile environments</strong> to ensure high-quality software releases.</li>\n<li>Identify, document, and track defects; provide detailed QA reports and test coverage metrics.</li>\n<li>Mentor junior QA engineers and contribute to continuous process and framework improvements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Qualification:</strong> Bachelor’s degree in Engineering, Computer Science, or related discipline.</li>\n<li><strong>Experience:</strong> 3+ years in Manual and Automation Testing, with proven experience as a Senior QA Engineer.</li>\n<li><strong>Automation Tools:</strong> Selenium, TestNG, JUnit.</li>\n<li><strong>Programming:</strong> Java (strong hands-on experience).</li>\n<li><strong>Frameworks:</strong> Page Object Model (POM), Data-Driven Testing.</li>\n<li><strong>CI/CD &amp; Version Control:</strong> Jenkins, GitHub, Git.</li>\n<li><strong>API Testing:</strong> Postman, SwaggerUI, RESTful API validation.</li>\n<li><strong>Databases:</strong> SQL (complex queries, joins, data validation).</li>\n<li><strong>Test Management:</strong> Jira, TestRail (or equivalent).</li>\n<li><strong>Agile Methodologies:</strong> Scrum, Sprint Planning, Retrospectives.</li>\n<li><strong>Other Skills:</strong> JSON handling, defect lifecycle management, communication, teamwork, multitasking under deadlines.</li>\n</ul>\n<h3>Additional Information</h3>\n<ul>\n<li>Immediate joiners preferred.</li>\n<li>Candidates must be open to working night shifts.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Selenium",
            "Java",
            "Jenkins"
        ],
        "summary": "QA Manager role requiring 3+ years in manual and automation testing with expertise in Selenium, Java, and CI/CD tools."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/26292",
        "location": "Technopark",
        "closing_date": "13 Jan 2026",
        "job_description": "<h2>QWY Software (P) Ltd</h2>\n<p><strong>Address:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581</p>\n<p><strong>Industry:</strong> IT/ITES covering E-com, Logistics, and Hyperlocal Delivery Services</p>\n<p><strong>Job Title:</strong> UI/UX Designer</p>\n<p><strong>Closing Date:</strong> 13, Jan 2026\n<strong>Published Date:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@qwysoft.com\">careers@qwysoft.com</a></p>\n<h3>Experience Required</h3>\n<p><strong>2 to 6 years</strong></p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic <strong>UI/UX designer</strong> responsible for optimizing the user experience (UX) and user interface (UI) design of our digital assets. The ideal candidate will ensure usability, usefulness, and exceptional visual design across all online platforms.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Deliver adaptive and creative UI/UX solutions aligned with best practices and emerging trends.</li>\n<li>Design user flows, wireframes, sitemaps, and interactive prototypes for web and mobile platforms.</li>\n<li>Collaborate with developers to implement designs and provide necessary assets.</li>\n<li>Enhance applications by integrating new features that align with UX patterns and backend constraints.</li>\n<li>Conduct user research, competitor analysis, and usability testing to validate design decisions.</li>\n<li>Partner with the Office Innovation Team on concept development and early-stage product prototypes.</li>\n<li>Engage stakeholders for data collection, design thinking, feedback, training, and UAT.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor's degree and <strong>2+ years of UI/UX design experience</strong> for digital products/services.</li>\n<li>Professional portfolio showcasing web and mobile design work.</li>\n<li>Experience designing for iOS and Android platforms.</li>\n<li>Working knowledge of <strong>Sketch, InVision, Visio, Figma, Mobility UI, Design Systems</strong>, and <strong>Adobe Creative Suite</strong>.</li>\n<li>Strong communication skills and ability to work independently or in a team.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Multi-tasking and time-management abilities.</li>\n<li>Staying updated with design trends, usability principles, and front-end best practices.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their CV to <a href=\"mailto:careers@qwysoft.com\">careers@qwysoft.com</a> with the subject line <strong>\"UI/UX Designer\"</strong>.</p>",
        "tags": [
            "2-6 Years",
            "Figma",
            "Sketch",
            "Adobe Creative Suite"
        ],
        "summary": "Seeking a 2-6 year experienced UI/UX designer to create user-centric digital experiences for web and mobile platforms. Requires expertise in Figma, Sketch, and Adobe Creative Suite with strong collaboration skills."
    },
    {
        "job_title": "Java Developer/ Senior Java Developer",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26291",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>ECS Business Solutions (P) Ltd</strong>\nModule No. 422, 423 and 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, 695581\n<a href=\"https://www.ecsfin.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Position</strong>: Java Developer / Senior Java Developer\n<strong>Closing Date</strong>: 12, Feb 2026\n<strong>Published</strong>: 29, Dec 2025\n<strong>Contact</strong>: <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a>\n<strong>Location</strong>: Trivandrum</p>\n<h2>About the Company</h2>\n<p>ECS Fin is an engineering enterprise specializing in process optimization. Our software solutions include:\n- Enterprise messaging management system\n- SWIFT-certified transaction processing system\n- Post-trade processing application\n- Treasury management system</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Develop and maintain Java-based applications</li>\n<li>Implement front-end components using jQuery/HTML/CSS/JavaScript</li>\n<li>Apply design patterns and frameworks like Spring/Spring Boot</li>\n<li>Collaborate on ReactJS-based UI development</li>\n<li>Stay updated on emerging technologies</li>\n<li>Design and optimize web services (SOAP/REST)</li>\n<li>Work with Oracle PL/SQL and relational databases</li>\n</ul>\n<h2>Required Qualifications</h2>\n<ul>\n<li>1+ year of Java experience</li>\n<li>Proficiency in jQuery/HTML/CSS/JavaScript</li>\n<li>Strong learning agility and adaptability</li>\n<li>Excellent communication skills</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Knowledge of Spring/Spring Boot</li>\n<li>Experience with ReactJS</li>\n<li>Web service development (SOAP/REST)</li>\n<li>Oracle PL/SQL expertise</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Java",
            "Spring Boot",
            "ReactJS"
        ],
        "summary": "ECS Fin seeks Java Developers/Senior Java Developers with 1-3 years experience in Java, Spring Boot, and ReactJS for Trivandrum-based roles."
    },
    {
        "job_title": "Java Architect",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26290",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<h2>About the Company</h2>\n<p>ECS Business Solutions (P) Ltd is a FinTech enterprise specializing in process optimization. Our software solutions include:\n- Enterprise messaging management system\n- SWIFT certified transaction processing system\n- Post-trade processing application\n- Treasury management system</p>\n<h2>Job Overview</h2>\n<p><strong>Position:</strong> Java Architect\n<strong>Location:</strong> Trivandrum\n<strong>Experience Required:</strong> 8+ Years\n<strong>Closing Date:</strong> 12 February 2026\n<strong>Published Date:</strong> 29 December 2025\n<strong>Contact Email:</strong> careers@ecsfin.com</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Design and lead full-stack enterprise applications with Java, Spring Boot, and distributed architecture</li>\n<li>Manage large-scale codebases using Maven and Git</li>\n<li>Implement Spring Cloud ecosystem components (Config Server, Eureka, Gateway)</li>\n<li>Design Kafka-based streaming architectures</li>\n<li>Ensure API governance and documentation via Swagger/OpenAPI</li>\n<li>Integrate IAM systems like Keycloak</li>\n<li>Utilize Apache Camel and workflow orchestration tools</li>\n<li>Mentor technical teams and engage with international clients</li>\n<li>Work in a shift starting in the afternoon and ending late night</li>\n</ul>\n<h2>Required Skills</h2>\n<ul>\n<li><strong>8+ years</strong> full-stack enterprise application experience</li>\n<li><strong>3+ years</strong> hands-on Spring/Spring Boot</li>\n<li><strong>Maven &amp; Git</strong> expertise</li>\n<li><strong>Spring Cloud</strong> (Config Server, Eureka, Gateway)</li>\n<li><strong>Keycloak</strong> or similar IAM systems</li>\n<li><strong>Apache Camel</strong> and workflow tools</li>\n<li><strong>Kafka</strong> streaming architecture design</li>\n<li><strong>API governance</strong> and secure system design</li>\n<li>Excellent communication and cross-cultural collaboration skills</li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Address:</strong> Module No. 422, 423, 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://www.ecsfin.com\">www.ecsfin.com</a></p>",
        "tags": [
            "8+ Years",
            "Java",
            "Spring Boot",
            "Kafka"
        ],
        "summary": "ECS Fin seeks a Java Architect with 8+ years experience to lead enterprise applications in a FinTech environment."
    },
    {
        "job_title": "Java Technical Lead",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26289",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<h2><strong>Company Overview</strong></h2>\n<p>ECS Fin is an engineering enterprise specializing in process optimization. Our software solutions include:\n- Enterprise messaging management system\n- SWIFT certified transaction processing system\n- Post-trade processing application\n- Treasury management system\nUsed globally by financial institutions and corporations.</p>\n<h2><strong>Job Title</strong></h2>\n<p>Java Technical Lead</p>\n<h2><strong>Location</strong></h2>\n<p>Trivandrum</p>\n<h2><strong>Experience</strong></h2>\n<p>5+ Years</p>\n<h2><strong>Preferred Skills</strong></h2>\n<ul>\n<li>5–8 years of experience with <strong>Java</strong>, <strong>Spring Boot</strong>, and <strong>microservices architecture</strong></li>\n<li>Mandatory experience with <strong>Maven</strong> for project builds and <strong>Git/GitLab</strong> for CI/CD workflows</li>\n<li>Strong hands-on experience in writing, deploying, and managing <strong>Spring-based REST APIs</strong></li>\n<li>Proficiency in <strong>JUnit</strong> and <strong>Mockito</strong> for unit testing</li>\n<li><strong>Kafka</strong> experience (stream processing/asynchronous microservices) is an advantage</li>\n<li>Cloud-based environment experience is an added advantage</li>\n<li>Knowledge of <strong>Oracle PL/SQL</strong> and relational databases</li>\n<li>Strong debugging and troubleshooting expertise</li>\n<li>Ability to plan and lead code reviews</li>\n<li>Subject matter expert to propose technology solutions to Project Managers and clients</li>\n<li>Updated on latest technological advancements</li>\n<li>Good communication skills</li>\n</ul>\n<h2><strong>Work Schedule</strong></h2>\n<p>Shift timing: Afternoon to late night</p>\n<h2><strong>Contact</strong></h2>\n<p>Email: <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a></p>\n<h2><strong>Company Address</strong></h2>\n<p>Module No. 422, 423, 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, 695581\n<a href=\"https://www.ecsfin.com\">Visit Website</a></p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Microservices Architecture"
        ],
        "summary": "Java Technical Lead role requiring 5+ years of experience in Java, Spring Boot, and microservices. Must lead code reviews and propose tech solutions with strong debugging and communication skills."
    },
    {
        "job_title": "Senior Python Developer- AI/ML",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/26288",
        "location": "Technopark",
        "closing_date": "30 Jan 2026",
        "job_description": "<h2>QWY Software (P) Ltd</h2>\n<p><strong>Location:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581\n<strong>Industry:</strong> IT/ITES covering E-com, Logistics, and Hyperlocal Delivery Services</p>\n<h3>Senior Python Developer - AI/ML</h3>\n<p><strong>Closing Date:</strong> 30, Jan 2026\n<strong>Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@qwysoft.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Senior Python Developer - AI/ML</strong> with <strong>5 to 8 years</strong> of experience in Python development.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and maintain AI/ML-based applications using Python.</li>\n<li>Design, build, and deploy machine learning models and algorithms.</li>\n<li>Work with large datasets, data preprocessing, feature engineering, and model tuning.</li>\n<li>Integrate ML models into production-ready systems and applications.</li>\n<li>Collaborate with data scientists, engineers, and business teams to understand requirements and deliver solutions.</li>\n<li>Optimize and scale ML models for performance and accuracy.</li>\n<li>Stay updated with the latest AI/ML trends, tools, and technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science, Engineering, or related field.</li>\n<li><strong>5-8 years</strong> of professional experience in Python development.</li>\n<li>Strong understanding of machine learning algorithms (supervised/unsupervised, NLP, deep learning).</li>\n<li>Proficiency with ML libraries such as <strong>TensorFlow</strong>, <strong>Keras</strong>, <strong>PyTorch</strong>, <strong>Scikit-learn</strong>, etc.</li>\n<li>Experience with data manipulation tools like <strong>Pandas</strong>, <strong>NumPy</strong>.</li>\n<li>Experience in model evaluation, validation techniques, and deployment.</li>\n<li>Hands-on experience with APIs, <strong>Flask/Django</strong> for model deployment.</li>\n<li>Knowledge of cloud platforms (<strong>AWS</strong>, <strong>Azure</strong>, <strong>GCP</strong>) is a plus.</li>\n<li>Excellent problem-solving and communication skills.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their updated resume to <strong>careers@qwysoft.com</strong> with the subject line: <strong>Application for Senior Python Developer - AI/ML</strong>.</p>",
        "tags": [
            "5-8 Years",
            "Python",
            "TensorFlow",
            "AWS"
        ],
        "summary": "Senior Python Developer - AI/ML with 5-8 years experience required to design, build, and deploy machine learning models, collaborate with teams, and optimize systems for performance."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/26287",
        "location": "Technopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<h2>QWY Software (P) Ltd</h2>\n<p><strong>Address:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581</p>\n<p><strong>Industry:</strong> IT/ITES covering E-com, Logistics and Hyperlocal Delivery Services</p>\n<h3>Job Details</h3>\n<ul>\n<li><strong>Closing Date:</strong> 16, Jan 2026</li>\n<li><strong>Published Date:</strong> 29, Dec 2025</li>\n<li><strong>Contact Email:</strong> careers@qwysoft.com</li>\n</ul>\n<h3>Role Overview</h3>\n<p>We are seeking a skilled and experienced <strong>Odoo Developer</strong> to join our team. The ideal candidate will be responsible for developing, customizing, and maintaining Odoo modules.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop, customize, and maintain Odoo modules.</li>\n<li>Collaborate with cross-functional teams to implement business solutions.</li>\n<li>Troubleshoot and resolve technical issues.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>Technical Proficiency:</strong> Strong knowledge of Odoo, Python, PostgreSQL, JSON, JavaScript, Linux, and Git.</li>\n<li><strong>Functional Knowledge:</strong> Good understanding of Sales, CRM, Accounts, and HR modules.</li>\n<li><strong>Experience:</strong> 3-5 years in Odoo versions 12, 13, 14, 15, and 16.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with Git, Docker, or Linux environments.</li>\n<li>Odoo Certification.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their updated CV to <strong>careers@qwysoft.com</strong> with the subject line <strong>\"Application for Odoo Developer\"</strong>.</p>",
        "tags": [
            "3-5 Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Seeking an experienced Odoo Developer with 3-5 years of expertise in Python, PostgreSQL, and Odoo module customization. Requires proficiency in Linux environments and functional knowledge of CRM/HR modules."
    },
    {
        "job_title": "Pre-Sales Demo Experience Executive",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26286",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>About Lean Transition Solutions (LTS)</h2>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. We are proud to be trusted by leading global organizations, supporting them in building sustainable, people-centric transformation at scale.</p>\n<p>With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team. At LTS, we believe technology strengthens people, enabling them to do their best work. That belief shapes our products, our culture, and how we work together.</p>\n<p><strong>Location:</strong> Technopark Phase1, Trivandrum</p>\n<h2>Role Overview</h2>\n<p>The <strong>Pre-Sales Demo Experience Executive</strong> is responsible for delivering a best-in-class demo and trial experience across the company’s SaaS portfolio. This role owns the end-to-end demo readiness lifecycle—from environments, data, and scenarios to leadership briefings and meeting preparedness—ensuring that Sales, Pre-Sales, and Senior Leadership consistently present a compelling, confident, and professional product narrative to prospective customers.</p>\n<p>This is a senior individual contributor role with high visibility and influence, requiring strong ownership, attention to detail, and the ability to proactively drive standards across multiple teams.</p>\n<p><strong>Experience:</strong> 1 - 3 Years of experience</p>\n<h2>Key Responsibilities</h2>\n<ol>\n<li><strong>Demo Environment Ownership</strong></li>\n<li>Own and manage all demo environments across web and mobile platforms</li>\n<li>Ensure systems are stable, current, and demo-ready at all times</li>\n<li>Coordinate with Engineering and IT for deployments, updates, fixes, and environment health</li>\n<li>\n<p>Act as a super user with full system privileges and deep functional understanding</p>\n</li>\n<li>\n<p><strong>Demo Scenarios &amp; Data Excellence</strong></p>\n</li>\n<li>Design, create, and maintain multiple demo scenarios per product, including role-based and industry-specific scenarios</li>\n<li>Create realistic, high-quality demo datasets that clearly showcase product value</li>\n<li>Refresh and reset demo data to maintain consistency and reliability</li>\n<li>\n<p>Ensure all demo data complies with GDPR and internal data governance standards</p>\n</li>\n<li>\n<p><strong>Demo Flow Definition &amp; Documentation</strong></p>\n</li>\n<li>Define and document the ideal demo flow for each product, user role, and scenario</li>\n<li>Maintain clear demo runbooks, scripts, and supporting guidance</li>\n<li>\n<p>Continuously refine demo flows based on feedback from Sales, Pre-Sales, and Leadership</p>\n</li>\n<li>\n<p><strong>Access &amp; Credential Management</strong></p>\n</li>\n<li>Manage demo login credentials and access (manual process)</li>\n<li>Ensure credentials are secure, up to date, and readily available for internal use</li>\n<li>Coordinate access approvals with the Pre-Sales Leader</li>\n<li>\n<p>Maintain clear documentation of demo users and permissions</p>\n</li>\n<li>\n<p><strong>Sales, Pre-Sales &amp; Leadership Enablement</strong></p>\n</li>\n<li>Ensure demo readiness 3–5 days ahead of scheduled meetings</li>\n<li>Support teams with demo confirmations, demo paths, and pre-meeting briefs</li>\n<li>Provide concise daily or weekly summaries of planned demos and priorities</li>\n<li>\n<p>Attend key demos or leadership meetings where appropriate and value-adding</p>\n</li>\n<li>\n<p><strong>Meeting Preparation &amp; Collateral Readiness</strong></p>\n</li>\n<li>Ensure leadership and sales teams have the correct decks, tools, and demo environments</li>\n<li>Maintain a single source of truth for demo assets and supporting materials</li>\n<li>\n<p>Work closely with Product and Marketing teams to ensure consistent messaging</p>\n</li>\n<li>\n<p><strong>Standards, Governance &amp; Continuous Improvement</strong></p>\n</li>\n<li>Establish and enforce a standard demo workflow across teams</li>\n<li>Act as the quality gatekeeper for demo and trial experiences</li>\n<li>Capture demo feedback and share insights with Product and Pre-Sales teams</li>\n<li>Support long-term evolution towards PMO or Product Operations functions</li>\n</ol>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Experience in pre-sales, demo operations, product enablement, or SaaS operations roles</li>\n<li>Strong understanding of SaaS platforms and demo environments</li>\n<li>Ability to manage multiple systems and stakeholders</li>\n<li>Excellent documentation and organisation skills</li>\n<li>Confident communicator with senior leadership</li>\n<li>Strong ownership mindset</li>\n<li>Experience supporting enterprise or regulated customers</li>\n<li>Familiarity with GDPR and data governance</li>\n<li>Exposure to CRM or pre-sales workflows</li>\n<li>Background suitable for PMO or delivery governance progression</li>\n</ul>\n<h2>Why You’ll Love Working With Us</h2>\n<ul>\n<li><strong>Meaningful Work with Global Impact:</strong> Contribute to enterprise platforms used by world-class organizations such as Philips, Hitachi, Pfizer, and other global leaders—helping them improve how they operate, lead, and grow.</li>\n<li><strong>People-First, Collaborative Culture:</strong> Your ideas are heard, your work is valued, and you’re supported by a team built on trust and respect.</li>\n<li><strong>Purpose-Driven Technology:</strong> Build practical, thoughtful products that solve real operational and leadership challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Learn continuously, take ownership of your work, and grow your career in a supportive environment.</li>\n<li><strong>Global Exposure, Human Connection:</strong> Work with diverse teams and enterprise clients worldwide—while feeling connected and supported.</li>\n<li><strong>Quality, Security &amp; Trust:</strong> Our platforms and processes are backed by internationally recognised ISO certifications, reflecting our strong commitment to quality, data security, and operational reliability.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates may forward their detailed resume to <strong>careers@ltslean.com</strong> and include the following information in the email content:</p>\n<ul>\n<li>Current CTC:</li>\n<li>Expected CTC:</li>\n<li>Notice Period:</li>\n<li>Current Location:</li>\n<li>Total Relevant Experience:</li>\n<li>Willingness to work at office:</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "SaaS Platforms",
            "GDPR Compliance",
            "PMO/Operations"
        ],
        "summary": "The Pre-Sales Demo Experience Executive manages end-to-end demo operations for LTS's SaaS portfolio, ensuring sales teams deliver compelling product narratives. Requires 1-3 years of experience in pre-sales or SaaS operations."
    },
    {
        "job_title": "Executive Assistant to CEO & Office Operations Coordinator",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26285",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>About Lean Transition Solutions (LTS)</h2>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. We are proud to be trusted by leading global organizations, supporting them in building sustainable, people-centric transformation at scale.</p>\n<p>With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team. At LTS, we believe technology strengthens people, enabling them to do their best work. That belief shapes our products, our culture, and how we work together.</p>\n<p><strong>Location:</strong> Technopark Phase 1, Trivandrum\n<strong>Contact Email:</strong> careers@ltslean.com\n<strong>Closing Date:</strong> 29, Dec 2025</p>\n<h2>About the Role</h2>\n<p>We are seeking a trustworthy, detail-oriented, and proactive <strong>Executive Assistant to CEO &amp; Office Operations Coordinator</strong> to support the CEO across day-to-day executive coordination, documentation, procurement, office operations tracking, and statutory compliance coordination. This role requires strong follow-up discipline, excellent organization skills, and hands-on comfort with MS365 and Excel.</p>\n<p>At LTS, transaction volume is limited, but execution quality is critical. Your success will be measured by closures, on-time compliance, smooth office operations, and reduced operational load on the CEO. Training will be provided for internal processes and workflows such as PF/ESI/GST/Softex/basic accounts coordination.</p>\n<h2>Key Responsibilities</h2>\n<h3>A) CEO Office / Executive Assistance</h3>\n<ul>\n<li>Manage the CEO’s calendar, meetings, priorities, reminders, and day-to-day coordination.</li>\n<li>Prepare structured Minutes of Meetings (MoMs) with clear action items, owners, and timelines.</li>\n<li>Maintain an Action Tracker and ensure closures through disciplined follow-ups.</li>\n<li>Draft emails/messages, prepare documents, and ensure systematic record-keeping with confidentiality.</li>\n</ul>\n<h3>B) Compliance Coordination (with CA/Consultants)</h3>\n<ul>\n<li>Coordinate statutory compliance workflows and timelines: PF, ESI, GST, Softex (document collection, tracking, proof storage).</li>\n<li>Track payment due dates, challans/acknowledgements, and maintain clean compliance folders (SharePoint/OneDrive).</li>\n</ul>\n<h3>C) Procurement, Renewals &amp; Payments Support</h3>\n<ul>\n<li>Own routine procurement coordination: quotations, comparisons, ordering, delivery follow-up, and invoice collection (including bi-weekly stationery needs).</li>\n<li>Maintain trackers for payments, renewals, vendors, invoices, and ensure proper documentation for each transaction.</li>\n<li>Prepare periodic summaries for CEO: upcoming renewals, pending payments, procurement status, and exceptions requiring approval.</li>\n</ul>\n<h3>D) Office Operations &amp; Asset Coordination (Ownership + Tracking)</h3>\n<ul>\n<li>Maintain an accurate asset register (laptops/monitors/furniture/other equipment); support tagging, issue/return tracking during onboarding and exit.</li>\n<li>Coordinate office maintenance via vendors (internet/AC/electrical/plumbing/general maintenance): raise requests, follow up, and track closure.</li>\n<li>Ensure availability of office consumables/stationery through scheduled procurement; maintain stock/consumption trackers.</li>\n<li>Coordinate courier/dispatch, scanning/printing, and systematic filing (SharePoint/OneDrive).</li>\n<li>Ensure meeting rooms are ready (setup coordination, projector/cables/printers as needed) and support internal events/celebrations when required.</li>\n<li>Handle occasional external coordination tasks (bank/courier/vendor pickup) if needed.</li>\n</ul>\n<h3>E) HR Coordination Support (as needed)</h3>\n<ul>\n<li>Support HR in coordination activities such as interview scheduling, documentation, and onboarding checklists—while minimizing CEO involvement in routine HR steps.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Experience:</strong> 1–3 years as an Executive Assistant / Admin Assistant / Office Coordinator / Operations Coordinator (preferably in a small-to-mid sized company).</li>\n<li><strong>Education:</strong> Graduate in any discipline.</li>\n<li>Strong written and verbal communication skills.</li>\n<li>Hands-on experience with MS365 (Outlook, Teams, Word, OneDrive/SharePoint, PowerPoint, Excel).</li>\n<li>Strong Excel skills (filters, lookups, trackers; advanced formulas are a plus).</li>\n<li>High integrity, discretion, reliability, and ownership.</li>\n<li>Comfortable coordinating with vendors/consultants and pushing tasks to closure.</li>\n<li>Exposure to PF/ESI/GST/Softex/basic accounts (even if only coordination) is a strong advantage.</li>\n<li><strong>Optional/Preferred:</strong> Two-wheeler + valid driving licence (useful for occasional errands).</li>\n</ul>\n<h2>Why You’ll Love Working With Us</h2>\n<ul>\n<li><strong>Meaningful Work with Global Impact:</strong> Contribute to enterprise platforms used by world-class organizations such as Philips, Hitachi, Pfizer, and other global leaders—helping them improve how they operate, lead, and grow.</li>\n<li><strong>People-First, Collaborative Culture:</strong> Your ideas are heard, your work is valued, and you’re supported by a team built on trust and respect.</li>\n<li><strong>Purpose-Driven Technology:</strong> Build practical, thoughtful products that solve real operational and leadership challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Learn continuously, take ownership of your work, and grow your career in a supportive environment.</li>\n<li><strong>Global Exposure, Human Connection:</strong> Work with diverse teams and enterprise clients worldwide—while feeling connected and supported.</li>\n<li><strong>Quality, Security &amp; Trust:</strong> Our platforms and processes are backed by internationally recognized ISO certifications, reflecting our strong commitment to quality, data security, and operational reliability. This means you work in an environment built on high standards and trust.</li>\n<li><strong>Build a Strong Future Together:</strong> At LTS, we don’t just deliver solutions—we build long-term relationships. Together, we create a strong, sustainable future for our people, our clients, and our organization. From continuous learning and career development opportunities to meaningful ownership in your work, we support you at every stage of your journey. Our people benefit from a supportive work environment, competitive benefits, and a culture that values balance, trust, and long-term success. At LTS, your growth is our growth—and when our people succeed, everything we build becomes stronger.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates may forward their detailed resume to <strong>careers@ltslean.com</strong> and include the following information in the email content:\n- Current CTC:\n- Expected CTC:\n- Notice Period:\n- Current Location:\n- Total Relevant Experience:\n- Willingness to work at office:</p>",
        "tags": [
            "1–3 Years",
            "MS365",
            "Excel",
            "PF/ESI/GST/Softex"
        ],
        "summary": "Support the CEO and manage office operations with compliance, procurement, and coordination. Requires 1–3 years of executive/operations experience and strong MS365/Excel skills."
    },
    {
        "job_title": "Business Analyst",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26284",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<p><strong>Lean Transitions Solutions</strong>\n<em>Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581</em>\n<em>http://www.LeanTransitionSolutions.com</em></p>\n<p><strong>Closing Date:</strong> 29, Dec 2025\n<strong>Job Published:</strong> 28, Dec 2025\n<strong>Contact Email:</strong> careers@ltslean.com</p>\n<h3>About Lean Transition Solutions (LTS)</h3>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. Trusted by leading global organizations, we support sustainable, people-centric transformation at scale. With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team. At LTS, we believe technology strengthens people, enabling them to do their best work.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>detail-oriented Business Analyst</strong> with <strong>1–2 years of experience</strong> to gather, analyze, and document business requirements for web and mobile applications. The ideal candidate will collaborate with stakeholders, product managers, and development teams to deliver scalable, high-quality software solutions aligned with business objectives.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Requirement Gathering and Analysis</strong>:</li>\n<li>Collaborate with stakeholders to understand needs.</li>\n<li>Translate business requirements into functional specifications.</li>\n<li>\n<p>Organize workshops, interviews, or surveys to collect requirements.</p>\n</li>\n<li>\n<p><strong>Process Mapping and Documentation</strong>:</p>\n</li>\n<li>Create flowcharts, diagrams, or process maps for workflows.</li>\n<li>\n<p>Document As-Is and To-Be processes for stakeholders and teams.</p>\n</li>\n<li>\n<p><strong>Liaison Between Business and Development Teams</strong>:</p>\n</li>\n<li>Bridge communication between non-technical stakeholders and technical teams.</li>\n<li>\n<p>Explain technical details in simple terms and ensure developers understand business goals.</p>\n</li>\n<li>\n<p><strong>Creating User Stories and Use Cases</strong>:</p>\n</li>\n<li>Write detailed user stories or use cases for end-user interactions.</li>\n<li>\n<p>Clarify acceptance criteria for features.</p>\n</li>\n<li>\n<p><strong>Facilitating Meetings and Sprint Planning</strong>:</p>\n</li>\n<li>Organize requirement review meetings, sprint planning, and retrospectives.</li>\n<li>\n<p>Ensure alignment between business and technical teams.</p>\n</li>\n<li>\n<p><strong>Assisting in User Acceptance Testing (UAT)</strong>:</p>\n</li>\n<li>\n<p>Coordinate UAT by creating test scenarios and addressing defects.</p>\n</li>\n<li>\n<p><strong>Change Management and Impact Analysis</strong>:</p>\n</li>\n<li>Perform impact analysis on stakeholder changes.</li>\n<li>\n<p>Communicate risks, benefits, and effects of changes.</p>\n</li>\n<li>\n<p><strong>Market Research and Competitor Analysis</strong>:</p>\n</li>\n<li>Conduct research to understand industry trends and ensure product relevance.</li>\n</ol>\n<h3>Preferred Skills</h3>\n<ol>\n<li><strong>Understanding of Software Development Life Cycle (SDLC)</strong>:</li>\n<li>Knowledge of Agile, Scrum, or Waterfall methodologies.</li>\n<li><strong>Stakeholder Management</strong>:</li>\n<li>Build relationships and manage expectations.</li>\n<li><strong>Requirements Elicitation Techniques</strong>:</li>\n<li>Master interviews, workshops, wireframing, and mockups.</li>\n<li><strong>Documentation Skills</strong>:</li>\n<li>Clear writing for BRDs, FRS, and user stories.</li>\n<li><strong>Tools and Software</strong>:</li>\n<li>Proficiency in Jira, Confluence, Visio, Balsamiq, Trello, and prototyping tools.</li>\n<li><strong>Communication and Presentation</strong>:</li>\n<li>Convey ideas to technical and non-technical audiences.</li>\n<li><strong>Problem-Solving and Analytical Thinking</strong>:</li>\n<li>Analyze problems and propose solutions aligned with business goals.</li>\n<li><strong>Handling Ambiguity and Change</strong>:</li>\n<li>Adapt to fast-paced environments with evolving requirements.</li>\n<li><strong>Testing and Quality Assurance (QA)</strong>:</li>\n<li>Coordinate UAT and ensure requirements are tested.</li>\n<li><strong>Business Domain Knowledge</strong>:<ul>\n<li>Acquire industry-specific knowledge for informed decision-making.</li>\n</ul>\n</li>\n</ol>\n<h3>Why You’ll Love Working With Us</h3>\n<ul>\n<li><strong>Meaningful Work with Global Impact</strong>: Contribute to platforms used by global leaders like Philips, Hitachi, and Pfizer.</li>\n<li><strong>People-First, Collaborative Culture</strong>: Ideas are heard, work is valued, and teams are built on trust.</li>\n<li><strong>Purpose-Driven Technology</strong>: Build products solving real operational and leadership challenges.</li>\n<li><strong>Growth &amp; Ownership</strong>: Continuous learning, ownership of work, and career growth in a supportive environment.</li>\n<li><strong>Global Exposure, Human Connection</strong>: Work with diverse teams and clients worldwide.</li>\n<li><strong>Quality, Security &amp; Trust</strong>: ISO-certified platforms ensuring high standards and trust.</li>\n<li><strong>Build a Strong Future Together</strong>: LTS supports long-term relationships, career development, and a culture of balance and trust.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their detailed resume to <strong>careers@ltslean.com</strong> with the following information in the email content:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at office</p>\n<p><strong>Location:</strong> Technopark Phase 1, Trivandrum</p>",
        "tags": [
            "1-2 Years",
            "Agile",
            "Jira",
            "Confluence"
        ],
        "summary": "A Business Analyst role at Lean Transition Solutions requires 1-2 years of experience in gathering requirements, process mapping, and liaising between business and technical teams to deliver scalable software solutions."
    },
    {
        "job_title": "Graphic Designer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26283",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<p><strong>Lean Transitions Solutions</strong>\nBasement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581\n<a href=\"http://www.LeanTransitionSolutions.com\">Visit Website</a></p>\n<p><strong>Closing Date:</strong> 29, Dec 2025\n<strong>Job Published:</strong> 28, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@ltslean.com\">careers@ltslean.com</a></p>\n<h3>About Lean Transition Solutions (LTS)</h3>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. Trusted by global leaders like Philips, Hitachi, and Pfizer, we operate as a connected global team across India, Europe, the US, the Middle East, and Mexico.</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>Graphic Designer</strong> to translate ideas into visually compelling designs aligned with client objectives and brand identity. The ideal candidate will have strong fundamentals in visual design, branding, and UI/UX concepts, with exposure to AI-assisted design tools.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Creative &amp; Visual Design</strong></li>\n<li>Translate concepts into high-quality designs for branding, marketing, social media, and print.</li>\n<li>Develop logos, brand assets, and visual identities.</li>\n<li>\n<p>Brainstorm innovative design concepts aligned with strategies.</p>\n</li>\n<li>\n<p><strong>Branding &amp; Design Consistency</strong></p>\n</li>\n<li>Create and maintain style guides.</li>\n<li>\n<p>Ensure consistency across all designs and brand guidelines.</p>\n</li>\n<li>\n<p><strong>UI/UX &amp; Design Communication</strong></p>\n</li>\n<li>Create wireframes, mock-ups, and prototypes.</li>\n<li>\n<p>Apply user-centered design principles.</p>\n</li>\n<li>\n<p><strong>Collaboration &amp; Client Interaction</strong></p>\n</li>\n<li>Communicate design concepts to clients and stakeholders.</li>\n<li>\n<p>Incorporate feedback and collaborate with cross-functional teams.</p>\n</li>\n<li>\n<p><strong>Design Execution &amp; Production</strong></p>\n</li>\n<li>Use tools like Photoshop, Illustrator, InDesign, After Effects, Figma.</li>\n<li>\n<p>Prepare artwork for print/digital production.</p>\n</li>\n<li>\n<p><strong>Research &amp; Innovation</strong></p>\n</li>\n<li>Conduct market trend and competitor research.</li>\n<li>\n<p>Stay updated on design trends and experiment with new techniques.</p>\n</li>\n<li>\n<p><strong>AI-Assisted Design</strong></p>\n</li>\n<li>Use tools like MidJourney, DALL·E, Adobe Firefly for ideation.</li>\n<li>Refine AI outputs with traditional tools.</li>\n</ol>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>2–6 years</strong> of experience as a Graphic/ Creative Designer.</li>\n<li>Strong portfolio showcasing branding, digital, and visual design work.</li>\n<li>Proficiency in <strong>Adobe Creative Suite</strong> and <strong>Figma</strong>.</li>\n<li>Solid understanding of typography, color theory, layout, and composition.</li>\n<li>Experience with wireframes, prototypes, and mock-ups.</li>\n<li>Strong communication, collaboration, and deadline management skills.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Exposure to <strong>AI-assisted design tools</strong>.</li>\n<li>Understanding of UI/UX principles.</li>\n<li>Agency or fast-paced environment experience.</li>\n<li>Ability to mentor junior designers.</li>\n<li>Strong English communication skills.</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Motion graphics/video tools (After Effects, basic animation).</li>\n<li>Curiosity for new design technologies.</li>\n</ul>\n<h3>Why Work With Us?</h3>\n<ul>\n<li><strong>Meaningful Work:</strong> Contribute to platforms used by global leaders.</li>\n<li><strong>People-First Culture:</strong> Collaborative, trust-based environment.</li>\n<li><strong>Purpose-Driven Tech:</strong> Solve real operational challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Continuous learning and career development.</li>\n<li><strong>Global Exposure:</strong> Work with diverse teams and clients.</li>\n<li><strong>Quality &amp; Trust:</strong> ISO-certified processes for security and reliability.</li>\n</ul>\n<p><strong>Build a Strong Future Together</strong>\nAt LTS, your growth is our growth. We support you with competitive benefits, a culture of balance, and long-term success.</p>\n<p><strong>Apply Now:</strong>\nForward your resume to <a href=\"mailto:careers@ltslean.com\">careers@ltslean.com</a> with the following details in the email:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at office</p>",
        "tags": [
            "2–6 Years",
            "Adobe Creative Suite",
            "Figma",
            "AI-Assisted Design Tools"
        ],
        "summary": "Seeking a Graphic Designer with 2–6 years of experience in branding, UI/UX, and AI-assisted tools to create impactful designs for global clients. Collaborate in a people-first, tech-driven environment."
    },
    {
        "job_title": "Junior AI Engineer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26282",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>About Lean Transition Solutions (LTS)</h2>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. We are proud to be trusted by leading global organizations, supporting them in building sustainable, people-centric transformation at scale. With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team. At LTS, we believe technology strengthens people, enabling them to do their best work. That belief shapes our products, our culture, and how we work together.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a <strong>Junior AI Engineer</strong> (0–2 years experience) to support the development and implementation of AI-driven solutions for manufacturing and industrial use cases. This role provides hands-on exposure to modern AI technologies such as Large Language Models (LLMs), Retrieval Augmented Generation (RAG), data pipelines, and intelligent decision-support systems, while working closely with senior engineers and cross-functional teams.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>AI Model Development &amp; Support</strong>\n- Assist in developing, testing, and implementing AI and ML models for industrial applications.\n- Support the implementation of RAG (Retrieval Augmented Generation) architectures.\n- Help fine-tune pre-trained language models for domain-specific use cases.\n- Contribute to NLP pipelines for query interpretation and response generation.\n- Assist in implementing embeddings and vector-based semantic search solutions.</p>\n<p><strong>Data Engineering &amp; Processing</strong>\n- Work with structured data from databases, APIs, and industrial systems.\n- Support processing of unstructured data such as logs, notes, and documentation.\n- Assist in building and maintaining data pipelines for AI and analytics workflows.\n- Perform data cleaning, validation, and preprocessing tasks.</p>\n<p><strong>Intelligent System Development</strong>\n- Assist in building Q&amp;A systems for natural language interaction with manufacturing data.\n- Support automated reporting and insight generation solutions.\n- Help implement alerting mechanisms based on predefined rules and thresholds.\n- Contribute to basic recommendation logic for operational improvements.</p>\n<p><strong>Technical Architecture &amp; Optimization</strong>\n- Assist in configuring and maintaining vector databases under senior guidance.\n- Follow security, access control, and data governance standards.\n- Support logging, monitoring, and audit trail implementation.\n- Optimize code and model performance with guidance from senior engineers.</p>\n<p><strong>Collaboration &amp; Learning</strong>\n- Collaborate with senior engineers, data teams, and product stakeholders.\n- Participate in code reviews and team knowledge-sharing sessions.\n- Continuously learn emerging AI tools, frameworks, and industry best practices.</p>\n<h3>Preferred Skills</h3>\n<p><strong>Programming &amp; Core Skills</strong>\n- 0–2 years of experience in Python development.\n- Understanding of object-oriented programming concepts.\n- Experience with data handling using NumPy and Pandas.</p>\n<p><strong>AI / ML Fundamentals</strong>\n- Foundational knowledge of Machine Learning and Deep Learning concepts.\n- Exposure to TensorFlow or PyTorch.\n- Basic understanding of NLP, embeddings, and language models.</p>\n<p><strong>RAG &amp; LLM Exposure</strong>\n- Introductory understanding of RAG architectures.\n- Exposure to Hugging Face, LangChain, or LlamaIndex (projects, internships, or coursework).\n- Basic knowledge of prompt engineering techniques.</p>\n<p><strong>Databases &amp; Data Handling</strong>\n- Basic knowledge of relational databases (MySQL / PostgreSQL / MariaDB).\n- Ability to write basic SQL queries.\n- Understanding of API-based data integration concepts.</p>\n<p><strong>API &amp; Application Development</strong>\n- Basic understanding of RESTful APIs.\n- Familiarity with FastAPI or Flask is a plus.\n- Understanding of JSON data structures.</p>\n<h3>Preferred / Nice to Have</h3>\n<ul>\n<li>Exposure to vector databases (FAISS, Chroma, Pinecone).</li>\n<li>Familiarity with AWS or cloud computing fundamentals.</li>\n<li>Basic knowledge of Docker and Git.</li>\n<li>Interest in MLOps, model deployment, and monitoring.</li>\n<li>Awareness of manufacturing systems or Industry 4.0 concepts is an advantage.</li>\n</ul>\n<h3>Technology Stack</h3>\n<p>Python, SQL, TensorFlow/PyTorch, Hugging Face Transformers, LangChain/LlamaIndex, MySQL/PostgreSQL/MariaDB, Vector Databases, FastAPI/Flask, AWS, Git, Docker</p>\n<h3>Why You’ll Love Working With Us</h3>\n<p><strong>Meaningful Work with Global Impact</strong>\nContribute to enterprise platforms used by world-class organizations such as Philips, Hitachi, Pfizer, and other global leaders—helping them improve how they operate, lead, and grow.</p>\n<p><strong>People-First, Collaborative Culture</strong>\nYour ideas are heard, your work is valued, and you’re supported by a team built on trust and respect.</p>\n<p><strong>Purpose-Driven Technology</strong>\nBuild practical, thoughtful products that solve real operational and leadership challenges.</p>\n<p><strong>Growth &amp; Ownership</strong>\nLearn continuously, take ownership of your work, and grow your career in a supportive environment.</p>\n<p><strong>Global Exposure, Human Connection</strong>\nWork with diverse teams and enterprise clients worldwide—while feeling connected and supported.</p>\n<p><strong>Quality, Security &amp; Trust</strong>\nOur platforms and processes are backed by internationally recognised ISO certifications, reflecting our strong commitment to quality, data security, and operational reliability. This means you work in an environment built on high standards and trust.</p>\n<p><strong>Build a Strong Future Together</strong>\nAt LTS, we don’t just deliver solutions—we build long-term relationships. Together, we create a strong, sustainable future for our people, our clients, and our organization. From continuous learning and career development opportunities to meaningful ownership in your work, we support you at every stage of your journey. Our people benefit from a supportive work environment, competitive benefits, and a culture that values balance, trust, and long-term success. At LTS, your growth is our growth—and when our people succeed, everything we build becomes stronger.</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resume to <strong>careers@ltslean.com</strong> and include the following information in the email content:\n- Current CTC:\n- Expected CTC:\n- Notice Period:\n- Current Location:\n- Total Relevant Experience:\n- Willingness to work at office:</p>",
        "tags": [
            "0–2 Years",
            "Python",
            "TensorFlow/PyTorch",
            "Hugging Face Transformers"
        ],
        "summary": "Junior AI Engineer role at LTS requires 0-2 years experience, focusing on AI/ML model development, data pipelines, and RAG systems for industrial applications. Work with global teams to build impactful AI solutions."
    },
    {
        "job_title": "Senior AI Engineer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26281",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>Senior AI Engineer</h2>\n<p><strong>Company:</strong> Lean Transition Solutions (LTS)\n<strong>Location:</strong> Technopark Phase 1, Trivandrum, 695581\n<strong>Contact:</strong> <a href=\"mailto:careers@ltslean.com\">careers@ltslean.com</a>\n<strong>Closing Date:</strong> 29, Dec 2025\n<strong>Published:</strong> 27, Dec 2025</p>\n<h3>About Lean Transition Solutions (LTS)</h3>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. Trusted by global leaders like Philips, Hitachi, and Pfizer, we operate as a connected global team across India, Europe, the US, the Middle East, and Mexico.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>AI Model Development &amp; Implementation</strong>\n- Design and implement RAG (Retrieval Augmented Generation) architectures for enterprise manufacturing data\n- Build and fine-tune Large Language Models (LLMs) for domain-specific industrial applications\n- Develop NLP pipelines for query interpretation and response generation\n- Implement embedding models and vector databases for semantic search</p>\n<p><strong>Data Engineering &amp; Integration</strong>\n- Work with structured data from industrial systems (databases, APIs, real-time feeds)\n- Process unstructured data (operational notes, documentation)\n- Build data pipelines integrating multiple sources\n- Implement real-time data processing systems for alerts and anomaly detection</p>\n<p><strong>Intelligent System Development</strong>\n- Develop Q&amp;A functionality for manufacturing data\n- Build automated reporting and briefing systems\n- Implement intelligent alerting mechanisms\n- Create recommendation engines for process improvement</p>\n<p><strong>Technical Architecture &amp; Optimization</strong>\n- Design scalable vector database architectures\n- Implement security controls (role-based access, data scoping)\n- Build audit trails and logging systems\n- Optimize model performance for real-time manufacturing environments</p>\n<h3>Preferred Skills</h3>\n<p><strong>Programming &amp; Core Frameworks</strong>\n- Python: Strong proficiency in modern Python development, OOP, and design patterns\n- Deep Learning Frameworks: TensorFlow, PyTorch, or equivalents\n- ML/Data Libraries: Scikit-learn, NumPy, Pandas</p>\n<p><strong>AI/ML Specializations</strong>\n- RAG Architecture: Solid understanding of implementation approaches\n- Vector Databases: Pinecone, Chroma, FAISS\n- LLM Fine-tuning: LoRA, QLoRA, prompt engineering\n- NLP &amp; Embeddings: Semantic search, text embeddings</p>\n<p><strong>Databases &amp; Data Management</strong>\n- RDBMS: MySQL, PostgreSQL, MariaDB\n- SQL: Complex query writing\n- Data Integration: ETL processes, API integration</p>\n<p><strong>API Development &amp; Integration</strong>\n- RESTful API design and integration\n- JSON data structures\n- Authentication/authorization patterns\n- Microservices architecture</p>\n<p><strong>Cloud &amp; DevOps (Preferred)</strong>\n- AWS (EC2, S3, Lambda, RDS)\n- Docker containerization\n- Git version control\n- MLOps practices</p>\n<h3>Technology Stack</h3>\n<p>Python, SQL, TensorFlow/PyTorch, Hugging Face Transformers, LangChain/LlamaIndex, MariaDB/MySQL/PostgreSQL, Vector Databases, FastAPI/Flask, AWS, Git, Docker</p>\n<h3>Why Work With Us</h3>\n<ul>\n<li><strong>Meaningful Work:</strong> Contribute to platforms used by global leaders like Philips and Hitachi</li>\n<li><strong>People-First Culture:</strong> Collaborative, trust-based environment</li>\n<li><strong>Purpose-Driven Tech:</strong> Solve real operational challenges</li>\n<li><strong>Growth &amp; Ownership:</strong> Continuous learning and career development</li>\n<li><strong>Global Exposure:</strong> Work with diverse teams and clients</li>\n<li><strong>Quality &amp; Trust:</strong> ISO-certified processes ensuring high standards</li>\n</ul>\n<h3>Build a Strong Future Together</h3>\n<p>At LTS, we support continuous learning, career growth, and a balanced work environment. Our culture values trust, long-term success, and sustainable relationships with clients and employees.</p>\n<p><strong>Application Instructions:</strong>\nInterested candidates should email their detailed resume to <a href=\"mailto:careers@ltslean.com\">careers@ltslean.com</a> with the following details in the email body:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at office</p>",
        "tags": [
            "5+ Years",
            "Python",
            "TensorFlow/PyTorch",
            "Vector Databases"
        ],
        "summary": "Senior AI Engineer at LTS develops AI/ML solutions for industrial operations, focusing on RAG, LLMs, and data integration. Work with global teams to build scalable, impactful technology."
    },
    {
        "job_title": "Technical Project Manager",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26280",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>About Lean Transition Solutions (LTS)</h2>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company, headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. We are proud to be trusted by leading global organizations, supporting them in building sustainable, people-centric transformation at scale.</p>\n<p>With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team. At LTS, we believe technology strengthens people, enabling them to do their best work. That belief shapes our products, our culture, and how we work together.</p>\n<p><strong>Location:</strong> Technopark Phase1, Trivandrum</p>\n<h2>Role Overview</h2>\n<p>We are seeking an experienced <strong>Technical Project Manager</strong> who will serve as the technical leader and architect for our software projects. This role sits above Lead Developers and combines deep technical expertise with strong project management skills. You will own the complete technical vision, design software architectures, make key technical decisions, and serve as the primary technical liaison between our engineering teams and clients' IT departments. You will work closely with the CTO, Delivery Managers, Business Analysts, and DevOps teams to ensure project success. <strong>Knowledge of AI tools to enhance the software development lifecycle is essential.</strong></p>\n<h2>Key Responsibilities</h2>\n<h3>1. Technical Leadership &amp; Architecture</h3>\n<ul>\n<li>Own the technical direction and architecture of projects from conception to delivery</li>\n<li>Design scalable, robust software architectures aligned with client requirements and best practices</li>\n<li>Make critical technical decisions on technology stack, frameworks, databases, and integrations</li>\n<li>Define technical standards, coding practices, and development guidelines for project teams</li>\n<li>Guide and mentor Lead Developers on architectural decisions and implementation</li>\n<li>Evaluate new technologies and tools that improve delivery quality and efficiency</li>\n</ul>\n<h3>2. Cross-Functional Collaboration &amp; Coordination</h3>\n<ul>\n<li>Collaborate with CTO on technical strategy alignment, architecture standards, and platform evolution</li>\n<li>Partner with Delivery Managers to align technical delivery with project timelines and manage dependencies</li>\n<li>Work closely with Business Analysts to translate requirements into technical solutions</li>\n<li>Coordinate with DevOps teams for infrastructure planning, CI/CD pipelines, and security implementations</li>\n</ul>\n<h3>3. Technical-Client Engagement</h3>\n<ul>\n<li>Act as the primary technical point of contact for clients and their IT teams</li>\n<li>Conduct technical discovery sessions and present architecture designs to stakeholders</li>\n<li>Build strong technical relationships with client IT teams and decision-makers</li>\n</ul>\n<h3>4. Project Planning &amp; Technical Delivery</h3>\n<ul>\n<li>Lead end-to-end project delivery with technical oversight</li>\n<li>Define project scope, objectives, and deliverables</li>\n<li>Break down complex requirements into actionable plans</li>\n<li>Ensure projects meet scope, timeline, budget, and quality standards</li>\n</ul>\n<h3>5. System Design &amp; Integration</h3>\n<ul>\n<li>Design complex system integrations, API architectures, and data flows</li>\n<li>Plan cloud infrastructure and scalability approaches</li>\n<li>Oversee third-party system integrations and real-time data processing</li>\n</ul>\n<h3>6. Technical Team Leadership</h3>\n<ul>\n<li>Provide technical direction to Lead Developers and development teams</li>\n<li>Conduct technical design reviews and resolve conflicts</li>\n<li>Foster technical excellence and AI tool adoption</li>\n</ul>\n<h3>7. Risk Management &amp; Quality Assurance</h3>\n<ul>\n<li>Identify and mitigate technical risks early in projects</li>\n<li>Ensure code quality, security standards, and performance benchmarks</li>\n<li>Manage technical debt and coordinate with QA teams on testing strategies</li>\n</ul>\n<h3>8. Stakeholder Communication &amp; Reporting</h3>\n<ul>\n<li>Maintain transparent communication on technical progress and risks</li>\n<li>Facilitate cross-functional discussions and align technical implementation with business expectations</li>\n</ul>\n<h3>9. Pre-Sales &amp; Technical Scoping</h3>\n<ul>\n<li>Support pre-sales with technical solution design and architecture proposals</li>\n<li>Provide technical effort estimates and create Statements of Work (SoWs)</li>\n</ul>\n<h3>10. Documentation &amp; Continuous Improvement</h3>\n<ul>\n<li>Create and maintain technical documentation</li>\n<li>Conduct post-project reviews and document lessons learned</li>\n<li>Stay current with emerging technologies and industry trends</li>\n</ul>\n<h2>Required Skills &amp; Qualifications</h2>\n<h3>Experience</h3>\n<ul>\n<li>Minimum <strong>8+ years</strong> in software development and technical project management</li>\n<li>Minimum <strong>3+ years</strong> in technical leadership or software architecture role</li>\n<li>Proven track record delivering enterprise-scale software projects</li>\n<li>Experience managing technical teams and Lead Developers</li>\n<li>Strong client-facing technical experience</li>\n</ul>\n<h3>Core Technical Expertise</h3>\n<ul>\n<li>Software architecture patterns (microservices, distributed systems)</li>\n<li>API design (REST, GraphQL, WebSocket)</li>\n<li>Database design (SQL/NoSQL)</li>\n<li>Cloud platforms (AWS preferred)</li>\n<li>DevOps practices and CI/CD pipelines</li>\n<li>System integration and security frameworks (OAuth, JWT)</li>\n</ul>\n<h3>AI Tools for Development (Required)</h3>\n<ul>\n<li>Experience with LLMs (ChatGPT, Claude, Gemini) for code generation and problem-solving</li>\n<li>Proficiency in GitHub Copilot or similar AI code assistants</li>\n<li>Knowledge of AI-powered code review and documentation tools</li>\n<li>Ability to guide teams on AI tool adoption</li>\n</ul>\n<h3>Project Management Skills</h3>\n<ul>\n<li>Expert knowledge of Agile, Scrum, and Waterfall methodologies</li>\n<li>Strong project planning, risk management, and resource allocation</li>\n<li>Proficiency with Jira and change management</li>\n</ul>\n<h3>Communication &amp; Leadership</h3>\n<ul>\n<li>Excellent technical communication with developers and stakeholders</li>\n<li>Strong presentation skills for technical and executive audiences</li>\n<li>Proven client relationship management and cross-functional collaboration</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Bachelor's/Master's in Computer Science or related field</li>\n<li>Certifications: PMP, PRINCE2, Agile/Scrum Master</li>\n<li>Web development experience (Symfony, Laravel, React, Angular)</li>\n<li>Cloud expertise (AWS core services, serverless architectures)</li>\n<li>Database technologies (MySQL, PostgreSQL, MongoDB)</li>\n<li>DevOps tools (Docker, Infrastructure as Code)</li>\n<li>Pre-sales and solution consulting background</li>\n</ul>\n<h2>Why You’ll Love Working With Us</h2>\n<ul>\n<li><strong>Meaningful Work:</strong> Contribute to platforms used by global leaders like Philips, Hitachi, and Pfizer.</li>\n<li><strong>People-First Culture:</strong> Collaborate in a trust-based, supportive environment.</li>\n<li><strong>Purpose-Driven Technology:</strong> Build solutions solving real operational challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Learn continuously and take ownership of impactful work.</li>\n<li><strong>Global Exposure:</strong> Work with diverse teams and clients worldwide.</li>\n<li><strong>Quality &amp; Trust:</strong> Backed by ISO certifications for security and operational reliability.</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Interested candidates may forward their detailed resume to <strong>careers@ltslean.com</strong> and include the following in the email content:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at office</p>",
        "tags": [
            "8+ Years",
            "AI Tools",
            "Software Architecture",
            "Cloud Platforms"
        ],
        "summary": "Lead technical strategy and project delivery for enterprise software solutions. Requires 8+ years experience, AI tool proficiency, and cross-functional collaboration."
    },
    {
        "job_title": "Field Service engineer Automobile",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/26279",
        "location": "Technopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<p><strong>GENROBOTIC INNOVATIONS (P) Ltd</strong>\n<strong>Location</strong>: Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a>\n<strong>Closing Date</strong>: 12, Jan 2026\n<strong>Published Date</strong>: 27, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:career@genrobotics.org\">career@genrobotics.org</a></p>\n<h3><strong>Job Title</strong>: Field Service Engineer (Automobile)</h3>\n<h4><strong>Brief Description</strong></h4>\n<p>Responsible for inspection, maintenance, troubleshooting, operation, and repair of automobiles and vehicle-integrated systems, including hydraulic systems and basic auto electrical works. Requires extensive travel across India to support field service, operations, and client support.</p>\n<h4><strong>Job Summary</strong></h4>\n<p>The Service Engineer will ensure the reliability and performance of vehicles, robots, and integrated systems through effective maintenance, repair, and service support. The role involves frequent client interaction, technical troubleshooting, and field visits across India to provide timely assistance and maintain high service standards.</p>\n<h4><strong>Job Responsibilities</strong></h4>\n<ul>\n<li>Perform inspection, maintenance, and repair of automobiles and related systems.</li>\n<li>Troubleshoot issues related to engines, transmissions, hydraulics, and electrical systems.</li>\n<li>Perform service and support on different vehicle-integrated systems (mechanical, hydraulic, electrical, and control).</li>\n<li>Support field operations by providing technical assistance at client sites.</li>\n<li>Conduct regular service visits to ensure proper functioning and reliability of equipment.</li>\n<li>Prepare and submit service reports, inspection checklists, and feedback to the team.</li>\n<li>Coordinate with vendors, clients, and internal teams for smooth execution of service activities.</li>\n<li>Ensure safety standards and protocols are followed during field assignments.</li>\n<li>Provide basic training/demonstrations to operators or end-users when required.</li>\n</ul>\n<h4><strong>Preferred Skills</strong></h4>\n<ul>\n<li>Strong knowledge of engines, transmissions, and automobile systems.</li>\n<li>Good understanding of hydraulic systems.</li>\n<li>Basic knowledge of auto electrical systems (wiring, alternators, sensors, etc.).</li>\n<li>Ability to perform operation, inspection, maintenance, and troubleshooting of vehicle-integrated systems.</li>\n<li>Strong diagnostic and problem-solving skills.</li>\n<li>Good communication, documentation, and reporting skills.</li>\n<li>Flexibility and willingness to travel across India on short notice.</li>\n<li>Ability to work independently as well as in a team.</li>\n</ul>\n<h4><strong>Qualifications</strong></h4>\n<ul>\n<li>Diploma / B.E. in Automobile Engineering / ITI (Automobile).</li>\n</ul>\n<h4><strong>Location</strong></h4>\n<ul>\n<li>PAN India</li>\n</ul>\n<h4><strong>Experience</strong></h4>\n<ul>\n<li>0 - 1 year experience</li>\n</ul>\n<h4><strong>Application</strong></h4>\n<p><a href=\"#\">Click here to Apply</a></p>",
        "tags": [
            "0-1 Year",
            "Automobile Engineering",
            "Hydraulic Systems",
            "Auto Electrical Systems"
        ],
        "summary": "Field Service Engineer required for automobile and vehicle systems maintenance, with travel across India. Requires 0-1 years of experience and technical expertise in automotive systems."
    },
    {
        "job_title": "Reinforcement Learning (RL) Engineer",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/26278",
        "location": "Technopark",
        "closing_date": "07 Jan 2026",
        "job_description": "<h2>GENROBOTIC INNOVATIONS (P) Ltd</h2>\n<p><strong>Location:</strong> Technopark, Thiruvananthapuram, Kerala, India\n<strong>Website:</strong> <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a>\n<strong>Contact Email:</strong> career@genrobotics.org\n<strong>Closing Date:</strong> 07, Jan 2026\n<strong>Published Date:</strong> 27, Dec 2025</p>\n<h3>Job Title</h3>\n<p>Reinforcement Learning (RL) Engineer</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, implement, and optimize RL algorithms (PPO, SAC, TD3, DQN, A3C, TRPO, etc.).</li>\n<li>Develop custom reward functions, policy architectures, and learning workflows.</li>\n<li>Conduct research on state-of-the-art RL techniques and integrate into product or research pipelines.</li>\n<li>Build or work with simulation environments (PyBullet, Mujoco, IsaacGym, CARLA, Gazebo, or custom).</li>\n<li>Integrate RL agents with environment APIs, physics engines, and sensor models.</li>\n<li>Deploy RL models on real systems (robots, embedded hardware, autonomous platforms).</li>\n<li>Optimize RL policies for latency, robustness, and real-world constraints.</li>\n<li>Collaborate with control engineers to integrate RL with classical controllers (PID, MPC, etc.).</li>\n<li>Run large-scale experiments, hyperparameter tuning, and ablation studies.</li>\n<li>Analyze model performance, failure cases, and implement improvements.</li>\n<li>Collaborate with robotics, perception, simulation, and software engineering teams.</li>\n<li>Document algorithms, experiments, and results for stakeholders.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong expertise in <strong>Python</strong> with experience in ML frameworks (<strong>PyTorch</strong>, <strong>TensorFlow</strong>).</li>\n<li>Deep understanding of:</li>\n<li><strong>Markov Decision Processes (MDP)</strong></li>\n<li><strong>Policy &amp; value-based RL</strong></li>\n<li><strong>Deep learning architectures</strong> (CNN, RNN, Transformers)</li>\n<li><strong>Control theory fundamentals</strong></li>\n<li>Experience with RL libraries (<strong>stable-baselines3</strong>, <strong>RLlib</strong>, <strong>CleanRL</strong>).</li>\n<li>Experience with simulation tools or robotics middleware (<strong>ROS/ROS2</strong>, <strong>Gazebo</strong>).</li>\n</ul>\n<h3>Added Advantages</h3>\n<ul>\n<li>Experience in <strong>robotics</strong>, <strong>mechatronics</strong>, or <strong>embedded systems</strong>.</li>\n<li><strong>C++</strong> for performance-critical applications.</li>\n<li>Knowledge of <strong>GPU acceleration</strong>, <strong>CUDA</strong>, or <strong>distributed training</strong>.</li>\n<li>Experience with <strong>Sim2Real</strong> (simulation to real-world deployment).</li>\n<li>Experience with cloud platforms (<strong>AWS</strong>, <strong>GCP</strong>, <strong>Azure</strong>).</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li><strong>2–5 years</strong> of hands-on RL experience (academic or industry).</li>\n<li>Published RL research papers (optional but preferred).</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li><strong>Bachelor’s/Master’s/PhD</strong> in <strong>Computer Science</strong>, <strong>Robotics</strong>, <strong>AI</strong>, <strong>Machine Learning</strong>, or related fields.</li>\n</ul>\n<h3>Apply</h3>\n<p><a href=\"#\">Click here to Apply</a></p>",
        "tags": [
            "2–5 Years",
            "Python",
            "PyTorch/TensorFlow",
            "Reinforcement Learning Algorithms"
        ],
        "summary": "Develop and optimize RL algorithms for real-world applications. Requires Python, deep learning, and simulation expertise. Based in Thiruvananthapuram."
    },
    {
        "job_title": "Robotic Software Engineer",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/26277",
        "location": "Technopark",
        "closing_date": "07 Jan 2026",
        "job_description": "<h2>GENROBOTIC INNOVATIONS (P) Ltd</h2>\n<p><strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a>\n<strong>Job Title:</strong> Robotic Software Engineer\n<strong>Closing Date:</strong> 07, Jan 2026\n<strong>Published Date:</strong> 27, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:career@genrobotics.org\">career@genrobotics.org</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly skilled <strong>Robotic Software Engineer</strong> to develop autonomy, perception, and control software for an advanced dynamic mapping–based pick-and-place robot. In this role, you will design and implement safety-critical autonomy functions such as perception, obstacle avoidance, adaptive path planning, and intelligent assistive controls to enhance robot performance and reliability. Collaboration with cross-disciplinary teams in hardware, controls, and AI is essential to deliver robotic systems that operate safely in dynamic, real-world environments.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design and implement trajectory planning, grasp planning, collision avoidance, and manipulation pipelines.</li>\n<li>Develop and tune inverse kinematics, motion primitives, and real-time arm control for high-speed pick-and-place tasks.</li>\n<li>Build adaptive manipulation behaviors that adjust to moving objects, uncertain environments, or varying payloads.</li>\n<li>Implement global and local motion planners suitable for dynamic work cells.</li>\n<li>Design robotic ADAS-like features including obstacle detection, collision avoidance, autonomous navigation assistance, and safe human-robot interaction.</li>\n<li>Develop and optimize algorithms for sensor fusion, real-time perception, and environment understanding using LiDAR, radar, depth cameras, and IMUs.</li>\n<li>Path planning and localization software development for indoor/outdoor robotic platforms.</li>\n<li>Collaborate with hardware engineers to integrate sensors and validate performance on physical robots.</li>\n<li>Ensure reliable and safe operation of robots in complex environments by applying functional safety principles.</li>\n<li>Stay updated with emerging trends in robotics, autonomous systems, and advanced assistance technologies.</li>\n<li>Document software designs, code, and test procedures.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in <strong>C++ and Python</strong>.</li>\n<li>Extensive experience with <strong>Robot Operating System (ROS)</strong> or <strong>ROS 2</strong>.</li>\n<li>Strong understanding of robotics concepts, including <strong>kinematics, dynamics, and control systems</strong>.</li>\n<li>Expertise in <strong>perception algorithms, sensor fusion, and computer vision</strong> for robotics.</li>\n<li>Experience in <strong>SLAM (Simultaneous Localization and Mapping)</strong> and navigation algorithms.</li>\n<li>Familiarity with deep learning frameworks (<strong>PyTorch, TensorFlow</strong>) for perception tasks.</li>\n<li>Experience integrating and calibrating robotic sensors (<strong>LiDAR, radar, cameras, ultrasonic, GPS/IMU</strong>).</li>\n<li>Knowledge of <strong>embedded systems</strong> and <strong>real-time operating systems (RTOS)</strong>.</li>\n<li>Experience with <strong>version control systems</strong>, particularly <strong>Git</strong>.</li>\n<li>Familiarity with robotic simulation tools (<strong>Gazebo</strong>).</li>\n</ul>\n<h3>Added Advantage</h3>\n<ul>\n<li>Experience with <strong>industrial robotic arms and manipulators</strong>.</li>\n<li>Knowledge of <strong>web technologies</strong> for robotic interfaces.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li><strong>Bachelor's or Master's degree</strong> in <strong>Computer Science, Robotics, Electrical Engineering</strong>, or a related field.</li>\n<li><strong>Minimum of 2 years</strong> of professional experience in robotics software development.</li>\n<li><strong>Location:</strong> Technopark, Thiruvananthapuram</li>\n</ul>\n<p><strong>Application Link:</strong> <a href=\"#\">Click here to Apply</a></p>",
        "tags": [
            "2+ Years",
            "ROS/ROS 2",
            "C++/Python",
            "Sensor Fusion/Computer Vision"
        ],
        "summary": "Develops autonomy, perception, and control software for dynamic mapping-based pick-and-place robots. Collaborates with cross-disciplinary teams to enhance robot performance and safety in real-world environments."
    },
    {
        "job_title": "WALK-IN DRIVE - TELESALES",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26276",
        "location": "Technopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2><strong>Trainonex Solutions (P) Ltd</strong></h2>\n<p><strong>Address:</strong> Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<h3><strong>Walk-In Drive: Telesales Executive</strong></h3>\n<p><strong>Date:</strong> 30, Dec 2025\n<strong>Time:</strong> 10:30 AM - 12:30 PM\n<strong>Job Published:</strong> 27, Dec 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3><strong>Role Overview</strong></h3>\n<p>We are seeking an <strong>energetic and confident Telesales Executive</strong> to join our team. In this role, you will:\n- Make <strong>outbound calls</strong> to potential and existing customers\n- <strong>Promote products/services</strong> in a simple, friendly manner\n- <strong>Explain features, pricing, and benefits</strong> clearly\n- <strong>Handle customer queries</strong> and provide accurate information\n- <strong>Follow up on leads</strong> and maintain customer details\n- <strong>Build and maintain strong customer relationships</strong></p>\n<h3><strong>Qualifications</strong></h3>\n<ul>\n<li><strong>0-1 years of experience</strong> required (freshers welcome)</li>\n<li><strong>Fluency in Malayalam</strong> language</li>\n<li><strong>Immediate joiners</strong> preferred</li>\n<li><strong>Work from office</strong> opportunity</li>\n<li><strong>Male and female candidates</strong> preferred</li>\n</ul>\n<h3><strong>Compensation &amp; Benefits</strong></h3>\n<ul>\n<li><strong>Basic Pay:</strong> ₹14,000</li>\n<li><strong>Performance-Based Incentives</strong></li>\n<li><strong>Fun Fridays</strong> with team activities</li>\n<li><strong>Special Occasion Celebrations</strong></li>\n<li><strong>Supportive Team Environment</strong></li>\n<li><strong>Career Development</strong> opportunities</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p><strong>Venue:</strong> Technopark Phase 1, Carnival Building, Ground Floor, Kazhakuttam, Trivandrum, 695581\n<strong>Entry Pass Requirements:</strong>\n- Apply via <a href=\"vms.technopark.org\">Technopark VMS</a> (mobile app or web)\n- Entry pass sent to registered mobile/email\n- <strong>Hardcopy</strong> available at Technopark Reception via 5-digit OTP\n- <strong>Original certificates</strong> verified at entry gate</p>\n<p><strong>Mobile App Downloads:</strong>\n- <a href=\"link_to_android_app\">Android</a>\n- <a href=\"link_to_ios_app\">iOS</a></p>\n<p><strong>Subject Line:</strong> \"Telesales Executive\" when applying</p>\n<p><strong>Preferred Skills:</strong>\n- Confident, friendly telephone manner\n- Ability to handle rejections and stay motivated\n- Strong customer interaction and communication skills\n- Effective time management</p>\n<p><strong>Note:</strong> Work from office opportunity available.</p>",
        "tags": [
            "0-1 Years",
            "Communication",
            "Customer Interaction",
            "Malayalam Language"
        ],
        "summary": "Trainonex Solutions seeks a Telesales Executive with 0-1 years of experience to drive sales through outbound calls and customer engagement. Freshers welcome with performance-based incentives and career growth opportunities."
    },
    {
        "job_title": "Business Development Associate",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26275",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong></p>\n<p><strong>Address:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> <a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Job Title:</strong> Business Development Associate\n<strong>Closing Date:</strong> 10th February 2026\n<strong>Published Date:</strong> 27th December 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify potential clients and generate new leads through calls, emails, LinkedIn, and networking.</li>\n<li>Understand client requirements and present suitable IT services/solutions.</li>\n<li>Build and maintain strong, long-term client relationships.</li>\n<li>Assist in preparing business proposals, presentations, and sales pitches.</li>\n<li>Collaborate with the technical and pre-sales team to align solutions with client needs.</li>\n<li>Meet business development targets and contribute to organizational growth.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Excellent communication, negotiation, relationship-building, and interpersonal skills.</li>\n<li>1–3 years of experience in business development/sales (preferably in IT services).</li>\n<li>Strong analytical and research skills.</li>\n<li>Proficiency in LinkedIn for lead generation and networking.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Strong organizational and time management skills.</li>\n<li>High level of motivation and a proactive approach to tasks.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>B.Tech/MBA graduate or a related field.</li>\n</ul>\n<p><strong>Contact for inquiries:</strong> recruiter@kenland.in</p>",
        "tags": [
            "1–3 Years",
            "Business Development",
            "IT Services Sales",
            "LinkedIn"
        ],
        "summary": "Drive revenue growth by generating IT services leads, building client relationships, and collaborating with technical teams to deliver tailored solutions."
    }
]