[
    {
        "job_title": "Junior Sales and Marketing",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22786",
        "location": "Technopark",
        "closing_date": "22 Aug 2025",
        "job_description": "<h2>Junior Sales and Marketing Executive</h2>\n<p><strong>Alzone Software (P) Ltd</strong> is seeking an energetic and driven Junior Sales and Marketing Executive to join our team. This role is ideal for recent MBA graduates with a passion for sales and marketing, especially those who have completed internships in relevant domains.</p>\n<p><strong>Location:</strong> Technopark, Trivandrum</p>\n<p><strong>Work Mode:</strong> Offline only, Full-time</p>\n<p><strong>Eligibility:</strong> Only for pass-out candidates (Candidates from Kerala preferred)</p>\n<p><strong>Experience:</strong> MBA Fresher (Marketing) – Internship experience in Sales/Marketing is an added advantage</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Perform cold calling to generate and convert leads</li>\n<li>Assist in executing marketing strategies and sales initiatives</li>\n<li>Manage and grow social media platforms (LinkedIn, Instagram, etc.)</li>\n<li>Support ongoing digital and offline marketing campaigns</li>\n<li>Maintain and update client databases and CRM systems</li>\n<li>Research market trends and analyze competitor activity</li>\n<li>Participate in team meetings and contribute to brainstorming sessions</li>\n<li>Coordinate with internal teams for content and strategy development</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>MBA in Marketing / Business Administration or related field</li>\n<li>Strong verbal and written communication skills</li>\n<li>Energetic, self-motivated, and proactive attitude</li>\n<li>Basic understanding of digital marketing and social media platforms</li>\n<li>Proficiency in MS Office tools (Word, Excel, PowerPoint)</li>\n<li>Ability to handle multiple tasks independently and efficiently</li>\n</ul>\n<p><strong>Application Process:</strong>\nInterested candidates may share their updated CV to careers@alzonesoftware.com\nSubject Line: Junior Sales and Marketing</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@alzonesoftware.com</li>\n<li><strong>Website:</strong> http://www.alzonesoftware.com</li>\n<li><strong>Address:</strong> ACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581</li>\n</ul>\n<p><strong>Closing Date:</strong> 22, Aug 2025</p>\n<p><strong>Job Published:</strong> 14, Aug 2025</p>",
        "tags": [
            "Fresher",
            "Sales",
            "Marketing",
            "Digital Marketing"
        ],
        "summary": "Alzone Software is hiring a Junior Sales and Marketing Executive to assist with lead generation, marketing campaigns, and social media. This role requires an MBA and strong communication skills."
    },
    {
        "job_title": "Technical Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22785",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Technical Analyst</h2>\n<p><strong>Polus Solutions</strong> is seeking talented and experienced candidates to join our support organization. You will be responsible for delivering post-implementation support and solutions to customers across the globe.</p>\n<p><strong>Roles and Responsibilities:</strong></p>\n<ul>\n<li>First point of contact for Customers.</li>\n<li>Provide Level 2 technical support.</li>\n<li>Apply basic diagnostic techniques to identify issues, investigate causes, and recommend solutions.</li>\n<li>Take end-to-end ownership of issues until resolution.</li>\n<li>Escalate complex problems to Level 3 technical support if needed.</li>\n<li>Adhere to SLAs and follow established Service Management processes, including Incident Management, Problem Management, Change Management, Release Management, and Service Request handling.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Prior experience in IT Service Management (Incident/problem/Change/SR management).</li>\n<li>Experience in any ticketing tools (ServiceNow, Jira, etc.).</li>\n<li>Good working knowledge of SQL commands and PL SQL.</li>\n<li>Overall knowledge of database fundamentals.</li>\n<li>Hands-on experience in all generic database monitoring.</li>\n<li>Basic understanding of Java/JEE is a plus.</li>\n<li>Good analytical reasoning skills and lateral thinking capability.</li>\n<li>Good communication skills.</li>\n<li>Good Customer handling skills.</li>\n<li>ITIL V3/V4 foundation certification is desirable.</li>\n<li>Willingness to work in rotational shifts (24/5).</li>\n</ul>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li><strong>Education:</strong> Graduates in BE/BTech (Computer science or related) or MSC Computer science /MCA or equivalent.</li>\n<li><strong>Experience:</strong> 1-3 years of experience in IT support.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@polussolutions.com</li>\n<li>Please include “Technical Analyst - [Your Name]” in the subject line.</li>\n</ul>\n<p><strong>Company Information:</strong></p>\n<p>Polus Solutions (P) Ltd\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\n<a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a></p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 14, Aug 2025</p>",
        "tags": [
            "1-3 Years",
            "IT Service Management",
            "SQL",
            "Ticketing Tools"
        ],
        "summary": "Polus Solutions is hiring a Technical Analyst to deliver post-implementation support to global customers. This role involves Level 2 support, issue resolution, and adherence to service management processes."
    },
    {
        "job_title": "System Administration (Junior & Senior)",
        "company": "Good Methods Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22783",
        "location": "Technopark",
        "closing_date": "16 Aug 2025",
        "job_description": "<h2>System Administrator (Junior &amp; Senior)</h2>\n<p>Good Methods Software Solutions (P) Ltd is hiring for System Administrator roles. Located in Technopark, Trivandrum.</p>\n<p><strong>Contact:</strong> purplesquirrel@carestack.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Provide technical support to end-users, addressing hardware, software, and network issues.</li>\n<li>Respond to IT support requests and ensure timely resolution according to agreed SLAs.</li>\n<li>Promptly troubleshoot and resolve software, system, and network issues.</li>\n<li>Install, configure, and maintain Windows server operating systems.</li>\n<li>Install, configure, and manage network devices such as routers, switches, access points, and firewalls.</li>\n<li>Assist in the installation, configuration, and maintenance of desktops, laptops, software, and networks.</li>\n<li>Set up and oversee cloud environments (Azure &amp; AWS).</li>\n<li>Set up and manage user accounts, permissions, and access controls.</li>\n<li>Monitor and manage network performance, including LAN, WAN, and VPN.</li>\n<li>Monitor systems for security breaches and report any suspicious activity.</li>\n<li>Ensure system and data security by implementing and managing security measures.</li>\n<li>Conduct regular security audits and vulnerability assessments.</li>\n<li>Develop and maintain technical documentation, including network diagrams and IT policies.</li>\n<li>Collaborate with other IT professionals to ensure seamless integration and operation of IT systems.</li>\n<li>Update and patch software applications and operating systems.</li>\n<li>Help manage IT inventory, tracking, and documenting the allocation and usage of IT assets.</li>\n<li>Perform regular system and network backups and recovery operations.</li>\n<li>Maintain accurate records of issues and solutions in the help desk system for future references.</li>\n<li>Document procedures and create user guides to help end-users understand and resolve common issues.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in information technology or Diploma, Computer Science, or a related field.</li>\n<li>Proven experience as a System Administrator, Network Administrator, or similar role.</li>\n<li>Strong knowledge of Windows operating systems, macOS, Linux, and network management.</li>\n<li>Strong knowledge of Windows Server operating systems and related technologies (DNS, DHCP, Group Policy, etc.).</li>\n<li>Experience with network protocols, IP addressing, and network troubleshooting.</li>\n<li>Experience with troubleshooting hardware and software issues.</li>\n<li>Familiarity with system security practices and tools (e.g., firewalls, intrusion detection systems).</li>\n<li>Ability to create and manage scripts in PowerShell, Python, or other scripting languages.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Experience with virtualization technologies (e.g., VMware, Hyper-V).</li>\n<li>Knowledge of cloud services and platforms (e.g., Azure, AWS).</li>\n<li>Familiarity with IT support processes and best practices.</li>\n<li>Excellent problem-solving and troubleshooting skills.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Familiarity with help desk software and remote support tools.</li>\n<li>Willing to work in shifts and availability outside of working hours.</li>\n<li>Microsoft and Cisco certification is a plus.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>This role requires working in a 24/7 environment, which means you may need to work in shifts, including nights and weekends. There is no work-from-home option available for this position.</li>\n<li>Opportunities for professional development and advancement within the IT department.</li>\n</ul>\n<p><strong>Closing Date:</strong> 16, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>\n<p>If interested, please fill out the form: <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdGNx8GNhTshAwXvJ7sgm1tmEhd_J6UaiK3t0mTrkDU3uRmnw/viewform?usp=header\">https://docs.google.com/forms/d/e/1FAIpQLSdGNx8GNhTshAwXvJ7sgm1tmEhd_J6UaiK3t0mTrkDU3uRmnw/viewform?usp=header</a></p>",
        "tags": [
            "1+ Years",
            "Windows Server",
            "Azure",
            "AWS"
        ],
        "summary": "We're seeking a skilled System Administrator to manage and maintain our IT infrastructure, ensuring smooth operations. This role involves troubleshooting, system maintenance, and implementing security measures in a 24/7 environment."
    },
    {
        "job_title": "Technical Support Engineer",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/22782",
        "location": "Technopark",
        "closing_date": "22 Aug 2025",
        "job_description": "<h2>Technical Support Engineer</h2>\n<p><strong>Picky Assist Pvt Ltd (Kerala Startup Mission)</strong>\nT-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<p><strong>Closing Date:</strong> 22, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025\n<strong>Contact Email:</strong> careers@pickyassist.com</p>\n<p><strong>Brief Description:</strong></p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Identifying customers' requirements and onboarding customers with our no-code software.</li>\n<li>Integration with 3rd party software using our no code API &amp; Webhook builders/</li>\n<li>Troubleshooting the logical issues in the software products and educating the customers on proper usage of different features.</li>\n<li>Develop and sustain strong customer relationships to enhance satisfaction.</li>\n<li>Increase the product usage ratio by educating the customers about different possibilities and values the product can add to their business</li>\n<li>Provided technical support and guidance on software features and functionalities.</li>\n<li>Collaborate with internal teams, including sales, marketing, product development, and customer support to ensure a seamless customer experience.</li>\n<li>Minimise the Churn ratio by providing high-quality customer support and experience</li>\n</ul>\n<p><strong>Preferred Skills/Experience Required:</strong></p>\n<ul>\n<li>Minimum of 1-3 years of relevant experience as a technical support or freshers with a thorough understanding of software development can also apply.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in IT, Computer Science.</li>\n<li>Strong logical reasoning skills with the attitude to get this done</li>\n<li>Basic understanding of any programming language</li>\n<li>Strong background in software project management.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to manage multiple SaaS product lines and customer segments.</li>\n<li>Should be a proactive communicator</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "API",
            "SaaS",
            "Troubleshooting"
        ],
        "summary": "Picky Assist is seeking a Technical Support Engineer to onboard customers, troubleshoot software issues, and provide technical guidance. The role requires strong communication and logical reasoning skills."
    },
    {
        "job_title": "Social Media Optimization (SMO) Specialist",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22781",
        "location": "Technopark",
        "closing_date": "20 Aug 2025",
        "job_description": "<h2>Social Media Optimization (SMO) Specialist</h2>\n<p><strong>HONEYKODE TECHNOLOGIES (P) Ltd</strong>\nD-2 Module, 6th floor, Bhavani Building, Technopark Campus, 695581\nhttp://www.honeykode.com</p>\n<p><strong>Closing Date:</strong> 20, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025\n<strong>Contact Email:</strong> nandu@honeykode.com</p>\n<p><strong>Brief Description:</strong>\nAn SMO Specialist is responsible for managing, optimizing, and growing an organization’s presence across social media platforms. They focus on improving visibility, engagement, and traffic by creating strategies, implementing campaigns, and analyzing performance metrics to ensure maximum impact.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ol>\n<li>\n<p><strong>Strategy &amp; Planning</strong></p>\n<ul>\n<li>Develop and implement SMO strategies aligned with overall marketing goals.</li>\n<li>Research target audience behavior, competitor activities, and trending content.</li>\n<li>Identify the best platforms (Facebook, Instagram, LinkedIn, YouTube, etc.) for brand visibility.</li>\n</ul>\n</li>\n<li>\n<p><strong>Content Management</strong></p>\n<ul>\n<li>Coordinate with content creators and designers to develop high-performing posts (images, videos, stories, reels).</li>\n<li>Ensure consistency of brand voice, style, and message across platforms.</li>\n<li>Create and manage posting schedules for maximum reach and engagement.</li>\n</ul>\n</li>\n<li>\n<p><strong>Optimization &amp; Growth</strong></p>\n<ul>\n<li>Optimize profiles and pages for search visibility (bio, keywords, hashtags).</li>\n<li>Monitor and increase followers organically through campaigns and community building.</li>\n<li>Use analytics tools to track engagement, reach, and conversions.</li>\n</ul>\n</li>\n<li>\n<p><strong>Engagement &amp; Community Management</strong></p>\n<ul>\n<li>Respond promptly to comments, queries, and messages.</li>\n<li>Build relationships with followers, influencers, and relevant online communities.</li>\n<li>Handle feedback and maintain a positive brand image.</li>\n</ul>\n</li>\n<li>\n<p><strong>Campaign Management</strong></p>\n<ul>\n<li>Run promotional activities, contests, and collaborations to boost reach.</li>\n<li>Coordinate with paid social teams (if applicable) for integrated campaigns.</li>\n</ul>\n</li>\n<li>\n<p><strong>Analytics &amp; Reporting</strong></p>\n<ul>\n<li>Measure performance using KPIs (reach, engagement, CTR, conversions).</li>\n<li>Prepare periodic performance reports with insights and recommendations.</li>\n<li>Continuously test new strategies (A/B testing, post timing, content format).</li>\n</ul>\n</li>\n</ol>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Experience:</strong> 1 year</li>\n<li><strong>Key Skills:</strong> Profile optimization, content strategy, engagement growth, hashtag research, analytics tracking, competitor analysis, and paid promotions.</li>\n<li>Strong understanding of social media platforms and trends.</li>\n<li>Basic knowledge of SEO/Google Ads and content marketing.</li>\n<li>Proficiency with analytics tools (Meta Insights, LinkedIn Analytics, Google Analytics).</li>\n<li>Creative mindset with good visual/content sense.</li>\n<li>Excellent communication and project management skills.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Content Strategy",
            "Social Media Analytics",
            "Community Management"
        ],
        "summary": "Honeykode Technologies is seeking an SMO Specialist to enhance their social media presence. This role involves strategy, content management, optimization, and engagement to boost visibility and growth."
    },
    {
        "job_title": "Senior AI/ML Engineer – Expert in LLM and Agent Frameworks",
        "company": "E Team Informatica India (P) Ltd",
        "url": "https://technopark.org/job-details/22780",
        "location": "Technopark",
        "closing_date": "26 Sep 2025",
        "job_description": "<h2>Senior AI/ML Engineer – Expert in LLM and Agent Frameworks</h2>\n<p><strong>E TEAM INFORMATICA India (P) Ltd</strong>\nGround Floor, Periyar Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.gruppozenit.com\">http://www.gruppozenit.com</a></p>\n<p><strong>Closing Date:</strong> 26, Sept 2025\n<strong>Job Published:</strong> 13, Aug 2025\n<strong>Contact Email:</strong> careers@gruppozenit.com</p>\n<p><strong>Brief Description:</strong>\nGruppo Zenit is an Italian company with 25 years of industry experience, providing Software Solutions and IT Services. Our major clients are from Europe. Gruppozenit India Pvt Ltd. works side by side with our clients making a real impact through digital and infrastructure transformation. We provide help in design and development of web and mobile applications, ERP management systems and infrastructure management guaranteeing not only the setting up of the project but also providing ongoing assistance, till the entire life cycle of the application along with corrective and evolutionary maintenance services. We accompany our customers in the Digital Transformation path, guaranteeing the necessary support and skills, offering concrete solutions for growth, through technological innovation.</p>\n<p><strong>Role:</strong> Technical lead and mentor for AI agent development.</p>\n<p><strong>Experience:</strong> 5 + Years Minimum</p>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Ability to receive a project request, define a development plan, and identify the necessary tools and technologies.</li>\n<li>Experience with LLMs (LLaMA, Mistral, GPT-like), RAG, fine-tuning, prompt engineering.</li>\n<li>Agent architecture: task decomposition, memory, tool orchestration.</li>\n<li>Languages: Python.</li>\n<li>Handling a team and deliver it with support and guidance.</li>\n<li>Agent Building Expertise: Hands-on experience in developing and deploying LLM agents with advanced features like tool integration, contextual memory systems, and feedback-driven learning.</li>\n</ul>\n<p>On Subject Line: Please mention the Post you are applying with Experience / Current Location</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Handling a team and deliver it with support and guidance.</li>\n<li>Agent Building Expertise: Hands-on experience in developing and deploying LLM agents with advanced features like tool integration, contextual memory systems, and feedback-driven learning.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "LLMs",
            "Python",
            "Agent Architecture"
        ],
        "summary": "Seeking a Senior AI/ML Engineer to lead AI agent development, requiring 5+ years of experience. Must have expertise in LLMs, agent frameworks, and Python."
    },
    {
        "job_title": "IT Network Administrator",
        "company": "E Team Informatica India (P) Ltd",
        "url": "https://technopark.org/job-details/22779",
        "location": "Technopark",
        "closing_date": "26 Sep 2025",
        "job_description": "<h2>IT Network Administrator</h2>\n<p><strong>E TEAM INFORMATICA India (P) Ltd</strong>\nGround Floor, Periyar Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.gruppozenit.com\">http://www.gruppozenit.com</a></p>\n<p><strong>Closing Date:</strong> 26, Sept 2025\n<strong>Job Published:</strong> 13, Aug 2025\n<strong>Contact Email:</strong> careers@gruppozenit.com</p>\n<p><strong>Brief Description:</strong>\nGruppo Zenit, an Italian company with 25 years of industry experience, provides Software Solutions and IT Services. They partner with clients, primarily in Europe, for digital and infrastructure transformation. They offer design, development, and ongoing assistance for web, mobile applications, ERP management systems, and infrastructure management.</p>\n<p><strong>Job Description:</strong>\nOur company, a leader in the IT sector, is looking for a highly qualified and motivated <strong>Network Administrator</strong> to strengthen our team. The selected candidate will be responsible for managing, configuring, and monitoring the network infrastructures of our clients, ensuring high standards of performance, security, and operational continuity.</p>\n<p><strong>Main Responsibilities:</strong>\n- Configuration, management, and monitoring of LAN, WAN, and VPN networks for our clients.\n- Maintenance and optimization of enterprise network devices, including firewalls (Cisco, FortiGate), Layer 3 switches (Cisco, HPE Aruba), load balancers and reverse proxies (NetScaler, F5), SDN networks, Meraki solutions, and Azure VPN.\n- Application of procedures and best practices shared with clients to ensure high network management standards.\n- Identification, analysis, and proactive resolution of network issues through advanced troubleshooting activities.\n- Collaboration with other IT teams to improve network infrastructure and support technological innovation projects.\n- Drafting and updating technical documentation related to configurations and network management processes.\n- Support in the design, implementation, and expansion of network infrastructures in line with business needs.</p>\n<p><strong>Requirements:</strong>\n- Previous experience of at least <strong>5 + years</strong> in a similar role.\n- In-depth knowledge of dynamic routing protocols (OSPF and BGP).\n- Advanced expertise in managing and configuring firewalls (Cisco, Fortinet), Layer 3 switches (Cisco, HPE Aruba), load balancers (NetScaler, F5), Meraki solutions, and Azure VPN.\n- Experience in configuring and managing switches, routers, and access points.\n- Strong knowledge of server operating systems (Windows Server, Linux).\n- High-level troubleshooting and problem-solving skills to identify and resolve complex network issues.\n- Minimal Networking certifications CCNP. (CompTIA Network+, CCIE or another equivalent are considered a plus)\n- Excellent interpersonal skills, customer orientation, and teamwork attitude.</p>\n<p>On subject Line “Please mention the Post you are applying with Experience / Current Location\nPreferred Skills</p>\n<p><strong>What We Offer:</strong>\n- Professional growth opportunities within a dynamic and continuously evolving company.\n- Continuous training and the opportunity to obtain internationally recognized certifications.\n- An innovative work environment with access to cutting-edge technologies and challenging projects.\n- Competitive salary commensurate with experience and skills.</p>\n<p>If you are a networking and IT security professional with a strong aptitude for problem-solving and innovation, we would be delighted to receive your application.</p>",
        "tags": [
            "5+ Years",
            "Cisco",
            "Fortinet",
            "Azure VPN"
        ],
        "summary": "Seeking a Network Administrator to manage and optimize network infrastructures. Requires 5+ years experience with firewalls, switches, and routing protocols to ensure high performance and security."
    },
    {
        "job_title": "IT Systems Administrator - Win/Linux Patch Management",
        "company": "E Team Informatica India (P) Ltd",
        "url": "https://technopark.org/job-details/22778",
        "location": "Technopark",
        "closing_date": "26 Sep 2025",
        "job_description": "<h2>IT Systems Administrator - Win/Linux Patch Management</h2>\n<p>E TEAM INFORMATICA India (P) Ltd, a part of Gruppo Zenit, is seeking an IT Systems Administrator to manage patch management for client servers and workstations. Gruppo Zenit is an Italian company with 25 years of experience in providing Software Solutions and IT Services. The selected candidate will ensure the update and security of client IT infrastructures using tools like Microsoft SCCM, Intune, and Ansible.</p>\n<p><strong>Contact:</strong> careers@gruppozenit.com</p>\n<p><strong>Closing Date:</strong> 26, Sept 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>\n<h3>Brief Description</h3>\n<p>Gruppo Zenit works side-by-side with clients to make a real impact through digital and infrastructure transformation. Services include the design and development of web and mobile applications, ERP management systems, and infrastructure management. The company supports customers in their Digital Transformation path, offering solutions for growth through technological innovation.</p>\n<h3>Job Description</h3>\n<p>The IT Systems Administrator will have experience in patch management for servers and workstations, provided as a service to clients. This role requires expertise in Windows and Linux environments, and the ability to manage automated patching processes using Ansible Playbooks. The ideal candidate will have solid experience in managing security updates, patch distribution, and automation, ensuring compliance with corporate policies and IT security best practices.</p>\n<h3>Main Responsibilities</h3>\n<ul>\n<li>Plan, test, and deploy security updates and patches for client Windows and Linux environments.</li>\n<li>Manage Microsoft SCCM and Intune for Windows patch deployment and endpoint monitoring.</li>\n<li>Manage automated Linux patching using Ansible Playbooks and scripting tools.</li>\n<li>Monitor and generate reports on patch status and system reboot needs.</li>\n<li>Collaborate with other IT teams to optimize patch management processes.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Proven experience in patch management for Windows Server and Client environments using SCCM and Intune tools.</li>\n<li>Experience in Linux system administration and patch management using Ansible Playbooks.</li>\n<li>Good knowledge of Microsoft SCCM and Intune for Windows patch management and deployment.</li>\n<li>Familiarity with Windows Server, Active Directory, and Group Policy.</li>\n<li>Understanding of IT security best practices and software update management.</li>\n<li>Analytical and problem-solving skills to address update-related issues.</li>\n</ul>\n<p><strong>On subject Line:</strong> Please mention the Post you are applying with Experience / Current Location</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Microsoft certifications (e.g., MD-102, SCCM, Azure Administrator).</li>\n<li>Experience with automation and remote management tools (PowerShell, scripting).</li>\n<li>Knowledge of ITSM systems for patch management.</li>\n<li>Experience in MSSQL Server patching, with a focus on security and operational continuity.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>A dynamic and stimulating work environment with a diverse client base and challenging projects.</li>\n<li>Opportunities for professional growth and continuous training, with support for certifications.</li>\n<li>Competitive salary, commensurate with experience and skills.</li>\n</ul>\n<p>The company is excited to welcome new talents to provide excellent service to its clients.</p>\n<p><strong>Company Information:</strong>\nE TEAM INFORMATICA India (P) Ltd\nGround Floor, Periyar Building, Technopark\nTrivandrum, 695581\nhttp://www.gruppozenit.com</p>",
        "tags": [
            "2+ Years",
            "SCCM",
            "Intune",
            "Ansible"
        ],
        "summary": "Seeking an IT Systems Administrator to manage Windows/Linux patch management using SCCM, Intune, and Ansible. Responsibilities include planning, testing, and deploying security updates for client environments."
    },
    {
        "job_title": "Oracle DBA",
        "company": "E Team Informatica India (P) Ltd",
        "url": "https://technopark.org/job-details/22777",
        "location": "Technopark",
        "closing_date": "26 Sep 2025",
        "job_description": "<h2>Oracle DBA</h2>\n<p>E TEAM INFORMATICA India (P) Ltd\nGround Floor, Periyar Building, Technopark, Trivandrum, 695581</p>\n<p><a href=\"http://www.gruppozenit.com\">http://www.gruppozenit.com</a></p>\n<p><strong>Closing Date:</strong> 26, Sept 2025\n<strong>Job Published:</strong> 13, Aug 2025\n<strong>Contact Email:</strong> careers@gruppozenit.com</p>\n<h3>Brief Description</h3>\n<p>Gruppo Zenit, an Italian company with a 25-year industry presence, specializes in providing Software Solutions and IT Services. Our major clients are from Europe. Gruppozenit India Pvt Ltd. collaborates closely with clients, driving impactful digital and infrastructure transformation. We assist in the design and development of web and mobile applications, ERP management systems, and infrastructure management, ensuring project setup and continuous support throughout the application lifecycle, including corrective and evolutionary maintenance services. We support our customers in their Digital Transformation journey, delivering the necessary support and skills, and offering concrete solutions for growth through technological innovation.</p>\n<p><strong>Experience:</strong> 5+ Years</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Strong DBA skills and relevant working experience with Oracle Database 11gc/12c/18c/19C environments.</li>\n<li>Experience in installation, configuration, and administration on UNIX environments to support Oracle DB with RAC, RMAN, and Dataguard.</li>\n<li>Experience in Oracle DB Performance Tuning.</li>\n<li>Expertise in analyzing AWR, ADDM, ASH &amp; TKPROF.</li>\n<li>Experience in Cluster ware (GRID Infrastructure) - CRS management, RAC Administration, ASM, Dataguard administration, Backup &amp; Recovery.</li>\n<li>Knowledge in DB Upgrades and Patching Tasks.</li>\n<li>Knowledge in using backup tools like CommVault is an added advantage.</li>\n<li>Experience in Unix/Linux including basic commands and shell scripting.</li>\n<li>Critical events SLA management and response.</li>\n<li>Strong Experience in Oracle DB Performance Tuning &amp; Query Optimization skills.</li>\n<li>Experience in Oracle cloud control configuration and management</li>\n<li>Oracle application management knowledge is an added advantage.</li>\n</ul>\n<p>On subject Line “Please mention the Post you are applying with Experience / Current Location</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>ORACLE CERTIFICATION: OCP 11g or OCP 10g</li>\n<li>Added preference will be given to the Candidate who has ITIL v3 certificate and who can coordinate a team</li>\n<li>Good Communication Skills in English is a must.</li>\n<li>Should have a good attitude towards work and should be a good team player.</li>\n<li>Knowledge in any monitoring software is an added advantage.</li>\n</ul>\n<h3>Job Profile</h3>\n<ul>\n<li><strong>Role:</strong> Database Administrator</li>\n<li><strong>Industry Type:</strong> IT Services &amp; Consulting</li>\n<li><strong>Functional Area:</strong> Engineering - Software</li>\n<li><strong>Employment Type:</strong> Full Time, Permanent</li>\n<li><strong>Position Type:</strong> 24/7</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Oracle DBA",
            "Performance Tuning",
            "RAC"
        ],
        "summary": "We are looking for an Oracle DBA to administer our databases. You will need 5+ years of experience managing Oracle in UNIX environments."
    },
    {
        "job_title": "Jr. System Administrator",
        "company": "Mobatia Technology (P) Ltd",
        "url": "https://technopark.org/job-details/22776",
        "location": "Technopark",
        "closing_date": "17 Aug 2025",
        "job_description": "<h2>Junior System Administrator</h2>\n<p><strong>Mobatia Technology (P) Ltd</strong></p>\n<p>1F, Carnival Technopark, Technopark, Trivandrum, Kerala, India, 695581</p>\n<p><a href=\"http://www.mobatia.com\">http://www.mobatia.com</a></p>\n<p><strong>Closing Date:</strong> 17, Aug 2025</p>\n<p><strong>Job Published:</strong> 13, Aug 2025</p>\n<p><strong>Contact Email:</strong> jobs@mobatia.in</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are looking for a Junior System Administrator with 0 to 1 year of experience, preferably someone who can join immediately. The ideal candidate should have hands-on experience in basic networking, system monitoring, and a foundational understanding of DevOps practices.</p>\n<p>Preferred candidates from Trivandrum.</p>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Good understanding of networking fundamentals (DNS, DHCP, LAN/WAN, IP configuration, etc.)</li>\n<li>Experience with Linux/Unix system administration</li>\n<li>Basic knowledge of DevOps tools such as Git, Docker, CI/CD pipelines</li>\n<li>Familiarity with system monitoring tools and basic scripting</li>\n<li>Ability to troubleshoot hardware, software, and network issues</li>\n<li>Knowledge of cloud platforms (AWS/Azure/GCP) is a plus</li>\n<li>Strong communication and documentation skills</li>\n<li>Automate routine tasks using Shell, Bash, or Python scripting</li>\n<li>Willingness to learn and grow in a fast-paced environment</li>\n<li>Perform system upgrades, patch management, and security hardening</li>\n</ul>",
        "tags": [
            "0-1 Year",
            "Linux/Unix",
            "Networking",
            "DevOps"
        ],
        "summary": "Mobatia Technology is seeking a Junior System Administrator. The role involves networking, system monitoring, and DevOps practices, with opportunities for growth and learning."
    },
    {
        "job_title": "Marketing Executive (Male Candidates Only)",
        "company": "Breeze Brain Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22775",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Marketing Executive</h2>\n<p><strong>Breeze Brain Technologies (P) Ltd</strong> is seeking a dynamic, energetic, and results-driven Marketing Executive to join our growing team.</p>\n<p><strong>Contact Information:</strong> careers@breezebrain.com</p>\n<p><strong>Brief Description:</strong>\nThe role involves driving sales, building strong client relationships, and identifying new business opportunities in the IT sector. This is a field-intensive position for self-motivated individuals who thrive in a fast-paced environment and are passionate about achieving targets.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute strategic sales and marketing initiatives to achieve business growth.</li>\n<li>Identify and pursue new business opportunities through market research, lead generation, and networking.</li>\n<li>Build and maintain long-term client relationships by understanding their needs and providing tailored IT solutions.</li>\n<li>Consistently achieve and exceed sales targets through effective engagement and negotiation.</li>\n<li>Collaborate with internal teams to ensure sales strategies align with company objectives.</li>\n<li>Prepare reports on sales performance, client feedback, and market trends.</li>\n<li>Conduct field visits and client meetings as a core part of daily operations.</li>\n</ul>\n<p><strong>Preferred Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, or a related field.</li>\n<li>1–6 years of proven experience in sales/business development, preferably in the IT industry.</li>\n<li>Strong communication, negotiation, and interpersonal skills.</li>\n<li>Ability to work independently and manage fieldwork efficiently.</li>\n<li>Fluency in English, Tamil, and Hindi.</li>\n<li>Strong organizational and time-management abilities.</li>\n</ul>\n<p><strong>Additional Requirements:</strong></p>\n<ul>\n<li>Young and energetic male candidates only.</li>\n<li>Must own a two-wheeler and have a valid driving license.</li>\n<li>Fieldwork is a major part of the role.</li>\n<li>Immediate joiners will be given preference.</li>\n<li>Must be currently based in Tamil Nadu or Kerala.</li>\n</ul>\n<p><strong>Compensation &amp; Benefits:</strong></p>\n<ul>\n<li>Competitive salary based on experience.</li>\n<li>Attractive performance-based incentives.</li>\n<li>Travel and meal allowances.</li>\n<li>Insurance benefits and other perks.</li>\n</ul>\n<p><strong>How to Apply:</strong>\nSend your updated resume to careers@breezebrain.com with Subject line: “Marketing Executive”. Applications without the correct subject line may be delayed or rejected.</p>\n<p><strong>Address:</strong>\nModule 20, SBC, - 2 Floor, Thejaswini Building, Technopark, Trivandrum , 695581\nhttps://www.breezebrain.com</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>",
        "tags": [
            "1-6 Years",
            "Sales/Business Development",
            "IT Solutions",
            "Market Research"
        ],
        "summary": "Breeze Brain Technologies is hiring a Marketing Executive to drive sales and build client relationships in the IT sector. This role requires fieldwork and achieving sales targets."
    },
    {
        "job_title": "Content Strategist",
        "company": "Fingent Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22774",
        "location": "Technopark",
        "closing_date": "27 Sep 2025",
        "job_description": "<h2>Content Strategist</h2>\n<p><strong>Fingent Technology Solutions (P) Ltd</strong>\nSBC No : 2309, Yamuna, Technopark Phase III, 695583\n<a href=\"http://www.fingent.com\">http://www.fingent.com</a></p>\n<p>Closing Date: 27, Sept 2025\nJob Published: 13, Aug 2025\nContact Email: careers@fingent.com</p>\n<p>At Fingent, we believe that technology can make a meaningful difference to the lives around us. The lives of those who use it, the lives of those who build it and to society at large. We create and provide software which is beautiful, usable and compelling, to solve complex business challenges. We nurture smart people who bring out the best in themselves, their peers, and their clients.</p>\n<p><strong>Roles &amp; Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute a data-driven content strategy aligned with business objectives, brand voice, and target audience needs.</li>\n<li>Identify emerging trends, hot topics, and innovation stories in technology and AI, ensuring the brand stays relevant and ahead of the curve.</li>\n<li>Craft compelling, well-structured, and insightful content that resonates with our target audience across multiple industries.</li>\n<li>Transform complex technical topics into clear, engaging narratives using storytelling techniques.</li>\n<li>Develop high-impact content for various formats: website copy, blog posts, whitepapers, case studies, product pages, newsletters, and scripts for videos/podcasts.</li>\n<li>Work closely with designers, developers, product managers, and subject matter experts to create accurate, impactful content.</li>\n<li>Coordinate with SEO specialists to optimize all content for discoverability and engagement.</li>\n<li>Partner with marketing and sales teams to ensure messaging consistency across campaigns.</li>\n<li>Monitor content performance using analytics tools and adjust strategies to maximize reach, engagement, and conversions.</li>\n<li>Conduct regular content audits to identify gaps, opportunities, and areas for repurposing existing content.</li>\n</ul>\n<p><strong>Skill Set:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, Journalism, or a related field.</li>\n<li>5+ years of experience in content strategy, copywriting, or editorial roles, preferably in a B2B technology or software development environment.</li>\n<li>Excellent written and verbal communication skills with an exceptional command of English.</li>\n<li>Strong research skills to understand and simplify complex technical concepts.</li>\n<li>Proven ability to create compelling narratives for different buyer personas.</li>\n<li>Experience working cross-functionally with multiple stakeholders.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Content Strategy",
            "Copywriting",
            "SEO"
        ],
        "summary": "Fingent is seeking a Content Strategist to develop and execute data-driven content strategies. The ideal candidate will craft compelling narratives, optimize content for discoverability, and collaborate with cross-functional teams."
    },
    {
        "job_title": "Test Engineer - Entry Level",
        "company": "Subhosting Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/22773",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Test Engineer - Entry Level</h2>\n<p><strong>SubHosting Innovations (P) Ltd</strong> is seeking talented entry-level Test Engineers for its development center in Thiruvananthapuram. SubHosting is an innovative company providing web hosting solutions and developing cutting-edge web applications.</p>\n<p><strong>Location:</strong> Technopark Phase 3 Campus, Thiruvananthapuram, Kerala\n<strong>Type:</strong> Full-Time\n<strong>Experience:</strong> Fresher\n<strong>Preferred Joining:</strong> Immediate\n<strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Understand software requirements and specifications</li>\n<li>Design, document, and execute test cases based on requirements</li>\n<li>Identify, log, and track bugs using issue tracking tools (e.g., JIRA, Bugzilla)</li>\n<li>Work closely with developers and other team members to reproduce and resolve issues</li>\n<li>Perform regression, functional, and integration testing</li>\n<li>Support in creating automated test scripts (optional, based on skills)</li>\n<li>Participate in sprint planning and QA-related discussions</li>\n<li>Learn and apply best testing practices and tools</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong analytical and problem-solving skills</li>\n<li>Basic understanding of software testing concepts (manual and/or automation)</li>\n<li>Knowledge of any programming language (Java, Python, etc.) is a plus</li>\n<li>Familiarity with testing tools like Selenium, Postman, JUnit, or similar is a bonus</li>\n<li>Good communication skills and ability to work in a team</li>\n<li>Attention to detail and a passion for quality</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, Electronics, or a related field</li>\n<li>Internship experience or a certification in software testing (e.g., ISTQB, CSTE) will be an added advantage</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates please send an email to jobs@subhosting.net with your latest resume.</p>\n<p>SubHosting Innovations (P) Ltd\nSBC Module No. 2211, 2nd floor, Yamuna Building,\nPhase III SEZ Campus, Technopark, Thiruvananthapuram , 695583\nhttp://www.subhosting.net</p>",
        "tags": [
            "Fresher",
            "Software Testing",
            "JIRA",
            "Bugzilla"
        ],
        "summary": "SubHosting is seeking an entry-level Test Engineer to design and execute test cases. The role involves identifying and tracking bugs, working with developers, and performing various testing types."
    },
    {
        "job_title": "Data Engineer",
        "company": "Trivand Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22772",
        "location": "Technopark",
        "closing_date": "17 Aug 2025",
        "job_description": "<h2>Data Engineer</h2>\n<p><strong>TRIVAND TECHNOLOGIES (P) Ltd</strong>\nMODULE 406-A, 4th Floor, Thejaswini, Technopark, Trivandrum. , 695581\n<a href=\"http://www.trivand.com\">http://www.trivand.com</a></p>\n<p>We are looking for a talented Data Engineer to join our analytics team, driving innovation in transportation, tracking, and damage claims for finished vehicles. You will design and maintain data solutions, create impactful dashboards, and work closely with cross-functional teams to turn complex datasets into actionable insights.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable data pipelines to support analytics and reporting.</li>\n<li>Perform data mining, transformation, and cleansing for accurate, actionable insights.</li>\n<li>Develop and manage interactive dashboards and reports for both operational and leadership teams.</li>\n<li>Collaborate with stakeholders to translate business requirements into data-driven solutions.</li>\n<li>Monitor and enhance data quality, integrity, and performance.</li>\n<li>Support damage claims analysis by integrating tracking, incident logs, and external data sources.</li>\n<li>Leverage AWS services (especially Amazon QuickSight) for secure, scalable data visualization.</li>\n<li>Ensure data governance and compliance with internal and external regulations.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications</strong></p>\n<ul>\n<li>Bachelor’s or Master’s in Computer Science, Data Science, Engineering, or a related field.</li>\n<li>3+ years in data engineering or analytics.</li>\n<li>Proficiency in SQL, Python, or Scala for ETL and data manipulation.</li>\n<li>Hands-on experience with any BI tools (Amazon QuickSight, Power BI, Tableau).</li>\n<li>Experience with large datasets and data warehouses (Redshift, Snowflake, BigQuery).</li>\n<li>Knowledge of logistics, transportation, or supply chain data is a plus.</li>\n<li>Strong problem-solving skills, attention to detail, and communication skills.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Experience with AWS (S3, Glue, Lambda, QuickSight).</li>\n<li>Knowledge of vehicle tracking systems, telematics, or damage claim workflows.</li>\n<li>Exposure to real-time data processing (Kafka, Spark Streaming).</li>\n</ul>\n<p>Interested candidates shall please share your updated resume to hr@trivand.com</p>\n<p>Closing Date: 17, Aug 2025\nJob Published: 13, Aug 2025\nContact Email: hr@trivand.com</p>",
        "tags": [
            "3+ Years",
            "SQL",
            "Python",
            "AWS"
        ],
        "summary": "Trivand Technologies is seeking a Data Engineer to enhance transportation analytics. The role involves designing data pipelines, creating dashboards, and collaborating with teams to deliver data-driven solutions."
    },
    {
        "job_title": "Marketing Lead Generation_Internship",
        "company": "Enfin Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/22771",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Marketing Lead Generation Internship</h2>\n<p><strong>Enfin Technologies India (P) Ltd</strong>\nC 24, -2 Floor, Thejaswini, Technopark Campus, Trivandrum, Kerala. , 695581\n<a href=\"http://www.enfintechnologies.com\">http://www.enfintechnologies.com</a></p>\n<p><strong>Closing Date:</strong> 30, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025\n<strong>Contact Email:</strong> hr@enfintechnologies.com</p>\n<p><strong>Brief Description:</strong>\nThis is an internship opportunity to gain hands-on experience and develop critical customer data collection, mining, and research skills. You should be able to perform internet searches using Google search and leverage the internet to research and discover information from the web.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>You should have hands-on skills in using Microsoft Office apps such as Excel and Word.</li>\n<li>Research and collect customer accounts and contact information through Google, LinkedIn, and other resources from the web.</li>\n<li>Input, update, and maintain accurate data records in the company database/MS Excel</li>\n<li>Follow data entry procedures and protocols to ensure consistency.</li>\n<li>Verify data accuracy, quality checks, and ensure compliance with company standards.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>Any degree or diploma with good communication skills in English.</li>\n<li>Proficiency in using MS Office - Excel, Word, and LinkedIn.</li>\n</ul>\n<p><strong>Internship Details:</strong></p>\n<ul>\n<li><strong>Duration:</strong> 8 months</li>\n<li><strong>Schedule:</strong> Full-time, 9.30 AM to 6.30 PM, Monday to Saturday.</li>\n<li><strong>Stipend:</strong> Starts from Rs. 8000 / Month.</li>\n<li><strong>Work mode:</strong> Remote</li>\n<li>Immediate Joinee</li>\n</ul>\n<p>Interested candidates should submit their resume and a cover letter detailing their interest to hr@enfintechnologies.com with the Subject: Marketing Lead Generation Intern</p>",
        "tags": [
            "No Experience",
            "Google Search",
            "MS Excel",
            "LinkedIn"
        ],
        "summary": "Enfin Technologies is offering an 8-month remote internship focused on marketing lead generation. The role involves customer data collection and database maintenance, requiring proficiency in MS Office and online research."
    },
    {
        "job_title": "Angular Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22770",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Angular Developer (Contract Role)</h2>\n<p><strong>Polus Solutions</strong> is seeking a highly experienced <strong>Senior Angular Developer</strong> to build dynamic, high-performance web applications.</p>\n<p><strong>Contact:</strong> careers@polussolutions.com</p>\n<p><strong>Location:</strong> On-site, Trivandrum, Kerala, India</p>\n<p><strong>Experience:</strong> 5+ years</p>\n<p><strong>Notice Period:</strong> Immediate Joiner</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design and implementation of low-latency, high-availability, and performance applications.</li>\n<li>Writing reusable code and libraries, optimizing applications for performance and scalability.</li>\n<li>Produce high-quality work within set deadlines.</li>\n</ul>\n<h3>Required Qualifications:</h3>\n<ul>\n<li><strong>Experience:</strong> 4-8 years of total software development experience in Angular with good knowledge of design patterns.</li>\n<li><strong>Education:</strong> Graduates in BE/BTech (Computer science or related) or Msc Computer science /MCA or equivalent.</li>\n<li>In-depth knowledge of modern HTML, CSS, Angular, Json, JQuery, Bootstrap.</li>\n<li>Understanding the nature of asynchronous programming and its quirks and workarounds.</li>\n<li>Strong proficiency with Angular / React JS and JavaScript.</li>\n<li>Knowledge of Node.js and frameworks available for it such as Express, Sails etc.</li>\n<li>Experience in the travel and booking domain will be considered a strong advantage.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Understanding of Spring Framework, ASP.NET, MVC, MongoDB will be an added advantage.</li>\n</ul>\n<p>To apply, send your resume to careers@polussolutions.com. Please include “Angular Developer (Contract) - [Your Name]” in the subject line.</p>",
        "tags": [
            "5+ Years",
            "Angular",
            "TypeScript",
            "JavaScript",
            "HTML/CSS"
        ],
        "summary": "Polus Solutions is hiring an Angular Developer with 5+ years of experience to build high-performance web applications. Proficiency in Angular, TypeScript, and front-end architecture is required."
    },
    {
        "job_title": ".NET Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22769",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>.NET Developer</h2>\n<p><strong>Polus Solutions (P) Ltd</strong> is seeking a highly experienced <strong>Senior .NET Backend Developer</strong> (Contract Role) with deep expertise in Microsoft SQL Server and enterprise-grade backend systems. Experience in the travel and booking domain is a strong plus.</p>\n<p><strong>Contact:</strong> careers@polussolutions.com. Please include “.NET Developer - [Your Name]” in the subject line when applying.</p>\n<h3>About the Role</h3>\n<ul>\n<li><strong>Job Title:</strong> Senior .NET Backend Developer</li>\n<li><strong>Department:</strong> Product Development / Technology</li>\n<li><strong>Location:</strong> On-site</li>\n<li><strong>Experience:</strong> 10+ years</li>\n<li><strong>Employment Type:</strong> Contract</li>\n<li><strong>Notice Period:</strong> Immediate Joiner</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain backend services using C# and .NET Core / .NET Framework.</li>\n<li>Develop, review, and optimize complex stored procedures, triggers, views, and SQL queries in Microsoft SQL Server (MSSQL).</li>\n<li>Build and integrate RESTful APIs and Web Services.</li>\n<li>Architect scalable, secure, and maintainable backend systems.</li>\n<li>Collaborate closely with front-end developers, QA engineers, DevOps, and business analysts to ensure seamless delivery.</li>\n<li>Perform code reviews, write unit tests, and create supporting documentation.</li>\n<li>Diagnose and resolve backend performance issues and database-level inefficiencies.</li>\n<li>Implement robust data integrity, backup, and disaster recovery practices.</li>\n<li>Manage code using Git or similar version control tools.</li>\n<li>Work within Agile/Scrum-based project teams to meet sprint objectives.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related discipline.</li>\n<li>10+ years of professional experience in backend development using C#, .NET Core, and/or .NET Framework.</li>\n<li>Advanced hands-on expertise in Microsoft SQL Server, including performance tuning, indexing, normalization, and query optimization.</li>\n<li>Proficient in Entity Framework / ADO.NET.</li>\n<li>Strong experience in building RESTful APIs and microservices.</li>\n<li>Solid understanding of software design patterns and principles (SOLID, DRY, etc.).</li>\n<li>Familiarity with unit testing frameworks such as NUnit or MSTest.</li>\n<li>Hands-on experience with Git for version control.</li>\n<li>Exposure to Azure SQL, Azure DevOps, and CI/CD pipelines is a strong advantage.</li>\n<li>Knowledge of messaging queues like RabbitMQ or Azure Service Bus is a plus.</li>\n<li>Sound understanding of backend and database security standards.</li>\n<li>Preferred: Prior experience in building or supporting travel and booking websites or platforms.</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Excellent analytical and problem-solving capabilities.</li>\n<li>Strong interpersonal and communication skills.</li>\n<li>Proven ability to work independently and meet deadlines in a fast-paced environment.</li>\n<li>Continuous learning mindset and adaptability to new technologies.</li>\n</ul>",
        "tags": [
            "10+ Years",
            ".NET Core",
            "Microsoft SQL Server",
            "RESTful APIs"
        ],
        "summary": "Polus Solutions is hiring a Senior .NET Backend Developer to design, develop, and maintain backend services. The role requires expertise in .NET, SQL Server, and building scalable systems."
    },
    {
        "job_title": "Data Science Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22768",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Data Science Analyst</h2>\n<p><strong>Polus Solutions (P) Ltd</strong> is seeking a talented Data Science Analyst to join our dynamic team.</p>\n<p><strong>Contact:</strong> careers@polussolutions.com</p>\n<p><strong>Brief Description:</strong>\nIn this role, you will work closely with our senior data scientist to support the development and validation of machine learning solutions for fraud detection. Your quantitative expertise will be instrumental in demonstrating the value of Kevari's data solutions through rigorous analysis, testing, and research. As a key contributor to our fast-growing team, you will conduct ad hoc analyses, integrate and evaluate third-party data sources, and perform statistical studies that directly influence product strategy and client outcomes.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>Analysis &amp; Research</strong></p>\n<ul>\n<li>Conduct ad hoc exploratory data analysis to identify fraud patterns and trends, with focus on new account fraud and account takeovers</li>\n<li>Integrate and evaluate third-party data sources to test and enhance the efficacy of existing fraud detection solutions</li>\n<li>Perform retrospective analyses and back-testing to demonstrate solution value to prospective clients</li>\n<li>Execute statistical studies to support product development and optimization decisions</li>\n</ul>\n<p><strong>Model Support &amp; Validation</strong></p>\n<ul>\n<li>Collaborate with senior data scientist to support predictive model development and implementation</li>\n<li>Conduct quality assurance testing of machine learning algorithms and key data attributes</li>\n<li>Validate model performance and stability across different data scenarios</li>\n<li>Stay current on emerging data science techniques, particularly in AI/ML for fraud detection</li>\n</ul>\n<p><strong>Communication &amp; Reporting</strong></p>\n<ul>\n<li>Define and deliver analytical reports that translate complex findings into actionable business insights</li>\n<li>Present results to both technical and non-technical stakeholders</li>\n<li>Support client demonstrations and proof-of-concept initiatives</li>\n<li>Document analytical methodologies and findings</li>\n</ul>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li><strong>Education:</strong> Bachelor's or advanced degree in Statistics, Mathematics, Computer Science, Data Science, or related quantitative field</li>\n<li><strong>Experience:</strong> 3-5 years in data science, analytics, or related analytical role</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li>Proficiency in Python</li>\n<li>Experience with Jupyter Notebook and statistical analysis</li>\n<li>Strong SQL skills for data extraction and manipulation</li>\n<li>Proficiency in Microsoft Excel and PowerPoint</li>\n</ul>\n<p><strong>Analytical Skills:</strong></p>\n<ul>\n<li>Solid understanding of statistical modeling and machine learning concepts</li>\n<li>Experience with data exploration and pattern recognition</li>\n<li>Strong problem-solving and critical thinking abilities</li>\n</ul>\n<p><strong>Communication:</strong> Ability to explain complex analytical concepts to non-technical audiences</p>\n<p><strong>Personal Attributes:</strong></p>\n<ul>\n<li>Self-directed with strong project management skills</li>\n<li>Collaborative team player with eagerness to learn</li>\n<li>Detail-oriented with commitment to data quality and accuracy</li>\n</ul>\n<p><strong>To Apply:</strong>\nSend your resume to careers@polussolutions.com\nPlease include “Data Science Analyst - [Your Name]” in the subject line.</p>\n<p>Polus Solutions (P) Ltd\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India , 695581\nhttps://www.polussolutions.com</p>",
        "tags": [
            "3-5 Years",
            "Python",
            "SQL",
            "Machine Learning"
        ],
        "summary": "Polus Solutions seeks a Data Science Analyst to develop fraud detection machine learning solutions. Responsibilities include data analysis, model validation, and communicating insights to stakeholders."
    },
    {
        "job_title": "Senior Front-End Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22767",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Senior Front-End Developer</h2>\n<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\n<a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a></p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025\n<strong>Contact Email:</strong> careers@polussolutions.com</p>\n<p><strong>Role Description:</strong></p>\n<p>We are looking for a Senior Front-End Developer to build modern, scalable, and high-performance web applications. The ideal candidate should have strong expertise in <strong>Angular</strong> and a good working knowledge of <strong>React.js</strong>, along with hands-on experience in modern front-end technologies and integration with cloud-hosted environments.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop efficient, reusable, and scalable front-end components.</li>\n<li>Translate functional requirements into high-quality, interactive, and responsive web applications.</li>\n<li>Collaborate with backend teams to integrate RESTful and GraphQL APIs.</li>\n<li>Optimize front-end applications for performance, scalability, and cross-browser compatibility.</li>\n<li>Ensure code quality through unit testing and peer reviews.</li>\n<li>Work with DevOps teams on CI/CD pipelines and cloud deployments (AWS, Azure, or GCP).</li>\n<li>Maintain documentation and follow best practices in code versioning and deployment.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5+ years of experience in front-end development.</li>\n<li>Good understanding and hands-on experience with <strong>React.js</strong>.</li>\n<li>Proficiency in JavaScript, HTML5, CSS3.</li>\n<li>Familiarity with frameworks like Next.js or Vue.js is a plus.</li>\n<li>Knowledge of performance optimization techniques (lazy loading, SSR, caching).</li>\n<li>Experience in working with state management tools (NgRx, Redux).</li>\n<li>Familiarity with RESTful APIs and GraphQL integration.</li>\n<li>Exposure to automated testing frameworks (Jest, Cypress).</li>\n<li>Experience working in Agile &amp; Scrum teams.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, IT, or a related field.</li>\n<li>Experience with cloud-based deployment environments (AWS, Azure, GCP).</li>\n<li>Basic understanding of backend technologies like Node.js and databases (SQL/NoSQL).</li>\n<li>Experience building Progressive Web Apps (PWAs).</li>\n<li>Contributions to GitHub or a portfolio of projects showcasing your front-end development work.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your resume to careers@polussolutions.com\nPlease include “Senior Front-End Developer (Angular) - [Your Name]” in the subject line.</p>",
        "tags": [
            "5+ Years",
            "Angular",
            "React.js",
            "JavaScript"
        ],
        "summary": "Polus Solutions is seeking a Senior Front-End Developer to create scalable web applications. Proficiency in Angular and experience with cloud environments are crucial for this role."
    },
    {
        "job_title": "Business Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22766",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p><strong>Polus Solutions (P) Ltd</strong> is looking for an experienced, passionate, and self-driven Business Analyst to join their team with full dedication and cooperation.</p>\n<p><strong>Contact:</strong> careers@polussolutions.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Determine and write requirements for projects, through collaboration with Product Owners.</li>\n<li>Act as requirements owner, directing and coordinating requirements leading to sign off by all stakeholders.</li>\n<li>Gather, create mock-ups, and document requirements, translating functional requirements to technical requirements, and identify options for stakeholders.</li>\n<li>Ability to convey ideas concisely to audiences of varying levels of experience and knowledge.</li>\n<li>Review and verify test cases/test scenarios and coordinate with the QA/Testing team and ensure successful UAT.</li>\n<li>Create wireframes, mock-ups, or prototypes to explain requirements and ideas.</li>\n<li>Gather and document requirements, translating functional requirements to technical requirements, and draw flow diagrams.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>2-3 years’ experience in the Business Analyst role.</li>\n<li>Certification in Business Analysis e.g. CCBA, CBAP, or related topics will be an added advantage.</li>\n<li>Experience in working with tools like MS Office products like Word, PowerPoint, Excel, etc., JIRA, Wireframe tools like MS Visio, Balsamiq, etc.</li>\n<li>Good understanding of Agile Scrum practices.</li>\n<li>Experience working with stakeholders and software development team.</li>\n<li>Communication - written, verbal, and interpersonal communication skills including technical writing skills.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your resume to careers@polussolutions.com. Please include “Business Analyst- [Your Name]” in the subject line.</p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>",
        "tags": [
            "2-3 Years",
            "Business Analysis",
            "JIRA",
            "Agile Scrum"
        ],
        "summary": "Polus Solutions is seeking a Business Analyst to determine project requirements and translate functional requirements. The ideal candidate will have 2-3 years of experience and strong communication skills."
    },
    {
        "job_title": "Project Manager",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22765",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Project Manager</h2>\n<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\n<a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a></p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>\n<p><strong>Contact Email:</strong> careers@polussolutions.com</p>\n<p><strong>Brief Description:</strong>\nThe ideal candidate is a detail-oriented team player who will handle all the resources and coordination from a technical standpoint. You must set and achieve objectives, ensure both top quality and control of the project, handle client and vendor interaction, and act as the subject expert.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Analyse and identify the requirements, get feasibility checks done, and create sprints accordingly.</li>\n<li>Develop and manage a detailed project execution plan.</li>\n<li>Measure project performance to identify areas for improvement, complete projects according to outlined scope, budget, and timeline.</li>\n<li>Submitting project deliverables and ensuring that they adhere to quality standards.</li>\n<li>Communicating with the clients and addressing any concerns related to the product.</li>\n<li>Communicating with team members, including relaying briefs, connecting daily tasks to larger goals, and providing context and support.</li>\n<li>Ensuring the team remains focused and on track, including addressing any conflicts or bottlenecks.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5-10 years of overall experience in the software industry with 2-4 years of project management.</li>\n<li>Analytical and strong organizational skills, with excellent verbal and written ability.</li>\n<li>Proficiency with related software tools including but not limited to JIRA, MS Excel, etc.</li>\n<li>Solid technical background, with understanding or hands-on experience in software development and web technologies.</li>\n<li>Excellent client-facing and internal communication skills.</li>\n<li>Leadership and conflict resolution skills.</li>\n<li>A PMP certification is a plus.</li>\n</ul>\n<p><strong>How to Apply:</strong>\nSend your resume to careers@polussolutions.com. Please include “Project Manager - [Your Name]” in the subject line.</p>",
        "tags": [
            "2-4 Years",
            "Project Management",
            "JIRA",
            "MS Excel"
        ],
        "summary": "Polus Solutions is seeking a detail-oriented Project Manager to handle resources, ensure quality, and manage client/vendor interactions. The role involves project planning, performance measurement, and effective team communication."
    },
    {
        "job_title": "HR Intern",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22764",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>HR Intern</h2>\n<p><strong>Alzone Software (P) Ltd</strong>\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\n<a href=\"http://www.alzonesoftware.com\">http://www.alzonesoftware.com</a></p>\n<p><strong>Contact Email:</strong> careers@alzonesoftware.com</p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p><strong>Position:</strong> HR Intern (Unpaid Internship)\n<strong>Duration:</strong> 3 months\n<strong>Certificate:</strong> Provided upon successful completion\n<strong>Start Date:</strong> Immediate</p>\n<p>We are looking for motivated MBA HR 2025 passouts to join us as HR Interns. During this 3-month internship, you will assist the HR team in various functions such as recruitment support, employee engagement, documentation, and administrative tasks. This is a great opportunity to gain hands-on experience in the HR field and enhance your skills.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>MBA in HR (2025 passouts)</li>\n<li>Strong communication and interpersonal skills</li>\n<li>Basic understanding of HR processes and policies</li>\n<li>Detail-oriented and organized</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Proactive attitude and eagerness to learn</li>\n</ul>\n<p><strong>How to Apply:</strong>\nPlease send your updated resume to careers@alzonesoftware.com with the subject: “Application for HR Intern”</p>",
        "tags": [
            "Entry Level",
            "HR Processes",
            "Communication Skills",
            "Recruitment"
        ],
        "summary": "Alzone Software is seeking a motivated HR intern to support recruitment, employee engagement, and documentation. This is a 3-month unpaid internship for MBA HR 2025 graduates."
    },
    {
        "job_title": "Java Architect",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22762",
        "location": "Technopark",
        "closing_date": "27 Sep 2025",
        "job_description": "<h2>Java Architect</h2>\n<p>ECS Business Solutions (P) Ltd is seeking a Java Architect to join our team in Trivandrum. ECS Fin specializes in process optimization, offering software solutions such as enterprise messaging management, SWIFT certified transaction processing, post-trade processing, and treasury management systems used by financial institutions and corporations worldwide.</p>\n<p><strong>Experience:</strong> 8+ Years</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>8+ years of experience with full-stack enterprise applications, including deep expertise in Java, Spring Boot, and distributed architecture.</li>\n<li>Minimum 3 years of hands-on experience in Spring/Spring Boot is required.</li>\n<li>Proven expertise in Maven and Git (mandatory) for managing large-scale codebases and DevOps integration.</li>\n<li>Strong command of the Spring Cloud ecosystem: Config Server, Eureka, Gateway, and microservice patterns.</li>\n<li>Familiarity with Keycloak or similar IAM systems for federated identity and token-based access control.</li>\n<li>Working knowledge of integration frameworks like Apache Camel and workflow orchestration tools.</li>\n<li>Ability to design and guide Kafka-based streaming architecture.</li>\n<li>Expertise in API governance, documentation (Swagger/OpenAPI), and promoting secure and maintainable systems.</li>\n<li>Excellent communication skills, with proven experience engaging with international clients, mentoring technical teams, and driving architecture discussions across distributed environments.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>This position requires working in a shift that starts in the afternoon and ends late at night.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>careers@ecsfin.com</li>\n<li>https://www.ecsfin.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 27, Sept 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>",
        "tags": [
            "8+ Years",
            "Java",
            "Spring Boot",
            "Spring Cloud",
            "Kafka"
        ],
        "summary": "ECS Fin is hiring a Java Architect with 8+ years of experience to design and guide architecture. The role involves working with Java, Spring Boot, Spring Cloud, and Kafka."
    },
    {
        "job_title": "Java Technical Lead",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22761",
        "location": "Technopark",
        "closing_date": "27 Sep 2025",
        "job_description": "<h2>Java Technical Lead</h2>\n<p>ECS BUSINESS SOLUTIONS (P) Ltd is seeking a Java Technical Lead to join our team in Trivandrum. ECS Fin is an engineering enterprise specializing in process optimization, providing software solutions such as enterprise messaging management systems, SWIFT certified transaction processing systems, post-trade processing applications, and treasury management systems to financial institutions and corporates worldwide.</p>\n<p><strong>Contact:</strong> careers@ecsfin.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work in a shift that starts in the afternoon and ends late at night.</li>\n<li>Plan and lead code reviews.</li>\n<li>Propose the right technology solutions to Project Managers and clients as a subject matter expert.</li>\n<li>Stay updated on the latest technological advancements and versions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5–8 years of experience with Java, Spring Boot, and microservices architecture.</li>\n<li>Mandatory experience with Maven for project builds and Git/GitLab for CI/CD workflows.</li>\n<li>Strong hands-on experience in writing, deploying, and managing Spring-based REST APIs.</li>\n<li>Proficiency in unit testing and mocking frameworks (JUnit, Mockito).</li>\n<li>Kafka experience is an advantage, especially around stream processing or asynchronous microservices.</li>\n<li>Experience in Cloud Based environment will be an added advantage.</li>\n<li>Knowledge of Oracle PL/SQL and understanding of relational databases.</li>\n<li>Strong Debugging and Troubleshooting Expertise.</li>\n<li>Good communication skills.</li>\n</ul>\n<p><strong>Closing Date:</strong> 27, Sept 2025</p>\n<p><strong>Job Published:</strong> 13, Aug 2025</p>\n<p><strong>Location:</strong>\nModule No. 422, 423 and 424, Nila Building. 4th Floor, Phase 1 Campus, Technopark., 695581</p>\n<p>https://www.ecsfin.com</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Microservices",
            "Maven"
        ],
        "summary": "ECS Fin is looking for a Java Technical Lead with 5+ years of experience. The role involves leading code reviews and proposing technology solutions in Trivandrum."
    },
    {
        "job_title": "DevOps Technical Lead (Delivery)",
        "company": "Hybcloud Technologies (P) Ltd (Cloud Control)",
        "url": "https://technopark.org/job-details/22754",
        "location": "Technopark",
        "closing_date": "27 Sep 2025",
        "job_description": "<h2>DevOps Technical Lead (Delivery)</h2>\n<p><strong>About Us</strong></p>\n<p>We are a Platform Engineering company specializing in DevOps, CloudOps, and AIOps, working across various cloud platforms and services. Our team designs and delivers scalable, automated, and resilient cloud-native solutions for enterprises globally.</p>\n<p>As we continue to expand, we are looking for a Tech Lead to drive delivery excellence in our client projects. The ideal candidate will have strong technical expertise, leadership capabilities, and hands-on experience in DevOps, CI/CD, Infrastructure as Code (IaC), Kubernetes, observability, and cloud automation.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>Technical Leadership:</strong> Lead the delivery team, providing guidance on DevOps, CloudOps, and AIOps best practices.</li>\n<li><strong>Solution Architecture:</strong> Design, implement, and optimize cloud-native architectures on AWS, Azure, or GCP.</li>\n<li><strong>CI/CD &amp; Automation:</strong> Oversee and enhance CI/CD pipelines, ensuring seamless deployment and rollback mechanisms.</li>\n<li><strong>Infrastructure as Code (IaC):</strong> Implement and maintain automated infrastructure provisioning using Terraform, Ansible, or CloudFormation.</li>\n<li><strong>Kubernetes &amp; Containerization:</strong> Manage Kubernetes clusters, containerized workloads, and microservices architectures.</li>\n<li><strong>Observability &amp; AIOps:</strong> Integrate monitoring, logging, and observability tools (e.g., Prometheus, Grafana, ELK, Datadog) and implement AIOps-driven solutions for anomaly detection.</li>\n<li><strong>Cloud Security &amp; Compliance:</strong> Ensure security best practices, IAM policies, and compliance standards are met.</li>\n<li><strong>Customer Engagement:</strong> Work closely with clients to understand requirements, propose solutions, and lead technical discussions.</li>\n<li><strong>Team Mentorship:</strong> Coach and upskill junior engineers, ensuring delivery quality and efficiency.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<p><strong>Key Skills &amp; Experience Required</strong></p>\n<ul>\n<li><strong>Technical Expertise:</strong></li>\n<li>Deep understanding of DevOps, CloudOps, and AIOps concepts.</li>\n<li>Strong experience in AWS, Azure, or GCP cloud services.</li>\n<li>Hands-on expertise with Kubernetes, Docker, Helm, and service mesh (Istio/Linkerd).</li>\n<li>Experience in Terraform, Ansible, or CloudFormation for Infrastructure as Code (IaC).</li>\n<li>Proficiency in CI/CD tools (Jenkins, GitHub Actions, GitLab CI, ArgoCD, Spinnaker).</li>\n<li>Strong scripting skills in Python, Bash, or Golang for automation.</li>\n<li><strong>Observability &amp; Security:</strong></li>\n<li>Experience with monitoring and logging tools like Prometheus, Grafana, ELK, Datadog, New Relic.</li>\n<li>Knowledge of security best practices, IAM, RBAC, and cloud governance.</li>\n<li><strong>Leadership &amp; Delivery:</strong></li>\n<li>Experience leading delivery teams and working in agile environments.</li>\n<li>Strong problem-solving, communication, and client-handling skills.</li>\n<li>Ability to work in a fast-paced, highly technical environment with multiple projects.</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li><strong>Certifications:</strong> AWS/GCP/Azure Certified Solutions Architect, CKAD/CKA, Terraform Associate.</li>\n<li>Experience with multi-cloud or hybrid cloud environments.</li>\n<li>Exposure to serverless computing and cloud-native patterns.</li>\n</ul>\n<p><strong>Experience</strong></p>\n<ul>\n<li>Devops Lead: 6 years (Required)</li>\n<li>Immediate Joiners preferred</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li>Contact Email: asprasad@ecloudcontrol.com</li>\n<li>HybCloud Technologies (P) Ltd (Cloud Control)ACE-12, 4th Floor, C-DAC Building, Technopark, Trivandrum, Kerala, India , 695582</li>\n<li>http://www.ecloudcontrol.com</li>\n</ul>",
        "tags": [
            "6+ Years",
            "DevOps",
            "Kubernetes",
            "Cloud"
        ],
        "summary": "HybCloud Technologies is seeking a DevOps Technical Lead to drive delivery excellence. The role involves leading teams, designing cloud architectures, and ensuring best practices in DevOps, CloudOps, and AIOps."
    },
    {
        "job_title": "Customer Support Executive",
        "company": "Xilligence",
        "url": "https://technopark.org/job-details/22744",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Customer Support Executive</h2>\n<p><strong>Xilligence</strong>\nXilligence611-615, 6th Floor, Nila, Technopark, Trivandrum, 695581\nhttp://www.xilligence.com</p>\n<p><strong>Contact Email:</strong> aswathy.sk@xilligence.com</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 13, Aug 2025</p>\n<p><strong>Brief Description:</strong>\nWe are looking for Customer Support Executives to join our team in Technopark, Trivandrum. This is a full-time on-site opportunity – ideal for freshers or those with up to 1 year of experience in customer service.</p>\n<p><strong>Responsibilities:</strong>\n- Handle customer queries via phone, email, and chat\n- Provide accurate and timely resolutions\n- Maintain customer records and ensure satisfaction\n- Collaborate with the team to enhance support experience\n- Follow communication guidelines and procedures</p>\n<p><strong>Preferred Skills:</strong>\n- Any graduate with 0–1 year of experience\n- Fluency in Hindi and English is mandatory\n- Good problem-solving &amp; interpersonal skills\n- Computer proficiency and familiarity with support tools</p>",
        "tags": [
            "0-1 Year",
            "Customer Service",
            "Hindi",
            "English"
        ],
        "summary": "Join Xilligence as a Customer Support Executive in Technopark, Trivandrum! This on-site role involves handling customer queries and ensuring satisfaction."
    },
    {
        "job_title": "Internship: Research & Documentation (Online) -Freshers/Pursuing Courses",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/22743",
        "location": "Technopark",
        "closing_date": "26 Sep 2025",
        "job_description": "<h2>Reizend Private Limited - Research &amp; Documentation Internship (Remote)</h2>\n<p>Reizend Private Limited is seeking enthusiastic interns for a Research &amp; Documentation role. This is an excellent opportunity for freshers or students pursuing management or related courses to gain practical experience through online research and documentation tasks.</p>\n<p><strong>Company:</strong> REIZEND PRIVATE LIMITED</p>\n<p><strong>Role:</strong> Research &amp; Documentation Intern</p>\n<p><strong>Mode:</strong> Remote</p>\n<p><strong>Duration:</strong> 3 Months</p>\n<p><strong>Stipend:</strong> ₹10000 per month</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Conduct structured online research based on given topics.</li>\n<li>Create and maintain documentation, reports, and summaries.</li>\n<li>Assist in organizing relevant data for internal analysis or presentations.</li>\n</ul>\n<p><strong>What You’ll Gain:</strong></p>\n<ul>\n<li>Internship Certificate</li>\n<li>Hands-on exposure to real-time research and documentation</li>\n<li>Opportunity to work with a collaborative and professional team</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates can share their CV to careers@reizend.ai. Please mention \"Internship – Research &amp; Documentation\" in the subject line.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Pursuing MBA, BBA, or similar management courses (open to other relevant academic streams as well).</li>\n<li>Good Academics.</li>\n<li>Strong internet research skills and attention to detail</li>\n<li>Good command over written English and basic documentation tools (Google Docs/Sheets, MS Word, etc.)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 26, Sept 2025</p>",
        "tags": [
            "Freshers",
            "Research",
            "Documentation",
            "Written English"
        ],
        "summary": "Reizend Retail is hiring a remote Research & Documentation Intern. The role involves online research, documentation, and data organization, with a stipend of ₹10000 per month."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/22742",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Business Development Executive - Walk-In Interview</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong>\nSBC 22, -2, Thejaswini Building, Technopark, Thiruvananthapuram, 695581\n<a href=\"https://www.upcommune.net\">https://www.upcommune.net</a></p>\n<p><strong>Walk-In Details:</strong>\n- <strong>Date:</strong> August 13, 2025 - August 14, 2025\n- <strong>Time:</strong> 10:30 AM - 12:30 PM\n- <strong>Job Published:</strong> August 12, 2025\n- <strong>Contact Email:</strong> <a href=\"mailto:mail@upcommune.net\">mail@upcommune.net</a>\n- <strong>Contact Number:</strong> +91 9074882688</p>\n<p><strong>Brief Description:</strong>\nUpcommune Business Network is seeking a talented Business Development Executive to join their dynamic Sales and Marketing team. The ideal candidate should possess a robust background in sales, conversion, and digital marketing strategies. This role is pivotal in identifying new business opportunities, converting leads into clients, and devising effective marketing strategies to foster business growth.</p>\n<p><strong>Responsibilities:</strong>\n- Identify and pursue new business opportunities through networking, cold calling, and other lead generation techniques.\n- Develop and maintain strong relationships with prospective clients and key stakeholders.\n- Collaborate with the marketing team to create compelling campaigns that align with client needs and drive revenue.\n- Analyze market trends and competitor activities to ensure the company remains competitive in the marketplace.\n- Prepare and deliver pitches and presentations to potential clients, showcasing the company's products/services and value proposition.</p>\n<p><strong>Preferred Skills:</strong>\n- Proven experience in sales and business development, preferably in a related industry.\n- Ability to work independently and as part of a team, with a proactive approach to problem-solving.\n- Degree/ Diploma in Marketing or a related field is preferred.</p>\n<p><strong>Benefits:</strong>\n- Opportunity to work in a dynamic and innovative environment.\n- Competitive salary and performance-based incentives.\n- Career growth opportunities within the company.</p>\n<p><strong>Walk-In Venue:</strong>\nUpcommune Business Network Pvt Ltd\nForth Floor\nGayatri Building\nTechnopark - 695582\nTVM</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.\nCandidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\n- <a href=\"link_to_android_app\">Click here to download the Mobile App for Android</a>\n- <a href=\"link_to_ios_app\">Click here to download the Mobile App for iOS</a></p>\n<p><strong>Website URL:</strong>\n<a href=\"vms.technopark.org\">vms.technopark.org</a>\n<a href=\"link_to_user_manual\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "1+ Years",
            "Sales",
            "Business Development",
            "Digital Marketing"
        ],
        "summary": "Upcommune is seeking a Business Development Executive to identify opportunities and convert leads. The role involves sales, marketing, and client relationship management to drive business growth."
    },
    {
        "job_title": "PHP Laravel Developer",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/22741",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>PHP Laravel Developer</h2>\n<p><strong>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</strong></p>\n<ul>\n<li><strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, 695581</li>\n<li><strong>Website:</strong> <a href=\"https://www.ateamsoftsolutions.com\">https://www.ateamsoftsolutions.com</a></li>\n<li><strong>Closing Date:</strong> 12, Sept 2025</li>\n<li><strong>Job Published:</strong> 12, Aug 2025</li>\n<li><strong>Contact Email:</strong> recruitment@ateamsoftsolutions.com</li>\n</ul>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li><strong>Job Title:</strong> PHP Laravel Developer</li>\n<li><strong>Experience:</strong> 3+ Years</li>\n<li><strong>Location:</strong> Technopark, Trivandrum</li>\n<li><strong>Work Mode:</strong> WFO</li>\n<li><strong>Joining:</strong> Immediate or within 30 days</li>\n</ul>\n<p><strong>Job Description:</strong></p>\n<p>We are seeking a skilled PHP Laravel Developer with over 3 years of experience to join our dynamic team. The ideal candidate should have strong expertise in the Laravel framework, PHP programming, and modern web development practices.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, test, and maintain web applications using Laravel and PHP.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Write clean, reusable, and efficient code following best practices.</li>\n<li>Optimize application performance and troubleshoot issues.</li>\n<li>Integrate third-party services and APIs.</li>\n<li>Maintain database schemas and ensure data security.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 3 years of professional experience in PHP and Laravel framework.</li>\n<li>Strong understanding of OOP concepts, MVC architecture, and RESTful APIs.</li>\n<li>Proficiency in MySQL, HTML, CSS, JavaScript, and jQuery.</li>\n<li>Experience with Git or other version control systems.</li>\n<li>Knowledge of server-side deployment and debugging.</li>\n<li>Good problem-solving and communication skills.</li>\n</ul>\n<p><strong>To Apply:</strong></p>\n<p>Send your resume to recruitment@ateamsoftsolutions.com</p>\n<p><strong>Contact:</strong> 7907410058</p>",
        "tags": [
            "3+ Years",
            "Laravel",
            "PHP",
            "MySQL"
        ],
        "summary": "We are looking for a skilled PHP Laravel Developer to join our team in Trivandrum. The ideal candidate should have expertise in Laravel and modern web development practices."
    },
    {
        "job_title": "Asp.net Developer ( 2-4 years exp)",
        "company": "Estrrado Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22740",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>ASP.NET Developer</h2>\n<p><strong>Estrrado Technology Solutions (P) Ltd</strong>\nACE 07, 3rd Floor, CDAC Building,\nTechnopark Campus, Trivandrum, 695581\n<a href=\"http://www.estrrado.com\">http://www.estrrado.com</a></p>\n<p><strong>Contact Email:</strong> career@estrrado.com</p>\n<p><strong>Closing Date:</strong> 30, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced and energetic ASP.NET Developer who can quickly adapt to ongoing projects, manage multiple tasks, and deliver high-quality results. You will work on diverse web development projects, collaborate with cross-functional teams, and leverage AI-assisted coding tools to enhance productivity.</p>\n<p><strong>Type of Job:</strong> Full time\n<strong>Experience:</strong> 2-4 years\n<strong>Preferred Applicants From:</strong> Kerala</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain web applications using ASP.NET, C#, and MVC.</li>\n<li>Build responsive front-end interfaces with HTML, CSS, JavaScript, Bootstrap, and jQuery.</li>\n<li>Work with MS SQL or other SQL-based databases for data management.</li>\n<li>Apply coding standards, best practices, and participate in code reviews</li>\n<li>Use AI-powered tools like ChatGPT and GitHub Copilot to optimize development and generate quality code.</li>\n<li>Handle multiple projects simultaneously and meet delivery timelines.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, IT, or related field.</li>\n<li>2–4 years of experience in ASP.NET, C#, and MVC framework.</li>\n<li>Strong front-end skills (HTML, CSS, JavaScript, Bootstrap, jQuery).</li>\n<li>Proficiency in MS SQL or equivalent database systems.</li>\n<li>Ability to multitask and adapt to dynamic project requirements.</li>\n<li>Excellent problem-solving and communication skills.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Apply via Career Estrrado OR Send your resume to career@estrrado.com with the subject line: ASP.NET Developer ( 2-4 years exp)</p>\n<p>Applications without the correct subject line may be put on hold or rejected.</p>",
        "tags": [
            "2-4 Years",
            "ASP.NET",
            "C#",
            "MVC"
        ],
        "summary": "Estrrado is seeking an ASP.NET Developer to design and maintain web applications. The role involves using C#, MVC, and AI tools to deliver high-quality results."
    },
    {
        "job_title": "Computational Research Scientist – Deep Learning",
        "company": "Feathersoft Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22739",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Computational Research Scientist – Deep Learning</h2>\n<p><strong>Feathersoft Info Solutions (P) Ltd</strong>\nSBC No.2304, 3rd Floor, Yamuna Building, Technopark Phase III Trivandrum, Kerala, 695583\n<a href=\"https://www.feathersoft.com\">https://www.feathersoft.com</a></p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@feathersoft.com</p>\n<h3>Position Overview</h3>\n<p>We are seeking a deep learning scientist to develop AI models for predicting and optimizing enzymes and metabolic pathways in microbial systems. The role involves metabolic network modeling, data analysis, and collaboration with multidisciplinary teams to drive innovations in industrial biotechnology. Candidates should have strong deep learning expertise, proficiency in Python or similar languages, and excellent communication skills. Knowledge of biological systems, metabolic flux analysis, or protein modeling is a plus. This is a dynamic start-up environment requiring adaptability, initiative, and scientific rigor.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and implement deep learning models to predict and optimize enzymes and metabolic pathways in microbial systems.</li>\n<li>Conduct simulations and modeling of metabolic networks to identify key regulatory nodes and potential engineering targets.</li>\n<li>Communicate results and insights to multidisciplinary teams, including presentations and written reports.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>Ph.D. Computer Science, or any similar disciplines such as physics, mathematics, with a strong focus on deep learning.</li>\n<li>Proven experience with deep learning frameworks (e.g., TensorFlow, PyTorch) and libraries.</li>\n<li>Proficiency in programming languages such as Python, R, or MATLAB.</li>\n<li>Excellent communication skills, both written and verbal.</li>\n</ul>\n<h3>Preferred Skills/Desirable Additional Qualifications:</h3>\n<ul>\n<li>Familiarity with biological systems.</li>\n<li>Knowledge of metabolic flux analysis and constraint-based modeling (e.g., FBA, COBRA toolbox).</li>\n<li>Knowledge of protein structural modeling and prediction.</li>\n<li>Experience in industrial biotechnology or a related industry.</li>\n</ul>\n<h3>Preferred Working Style:</h3>\n<ul>\n<li>Must be very well-organized and be able to handle multiple projects simultaneously.</li>\n<li>Must be a quick learner who is self-motivated and able to ask questions and seek clarity.</li>\n<li>Must be flexible with day-to-day duties and able to thrive in a start-up environment.</li>\n<li>Must be an excellent team member with strong communication skills and a desire to work collaboratively.</li>\n<li>Must hold themselves to the highest professional, scientific and ethical standards.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Deep Learning",
            "Python",
            "Metabolic Network Modeling"
        ],
        "summary": "Feathersoft is seeking a Deep Learning Scientist to develop AI models for enzyme and metabolic pathway optimization. This role involves metabolic network modeling, data analysis, and multidisciplinary collaboration."
    },
    {
        "job_title": "Rust Developer",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/22738",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Rust Developer</h2>\n<p><strong>Revyrie Global</strong>\nLower Ground 1, Thejaswini, Technopark Campus, 695581\nhttp://www.revyrieglobal.com</p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@revyrieglobal.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Execute full software development life cycle (SDLC)</li>\n<li>Write clean, maintainable, and efficient Rust code</li>\n<li>Integrate software components into a fully functional software system</li>\n<li>Develop software verification plans and quality assurance procedures</li>\n<li>Document and maintain software functionality</li>\n<li>Troubleshoot, debug and upgrade existing systems</li>\n<li>Deploy programs and evaluate user feedback</li>\n<li>Comply with project plans and industry standards</li>\n<li>Work closely with other developers and stakeholders</li>\n<li>Ensure software is updated with the latest features</li>\n</ul>\n<p><strong>Qualifications/Preferred Skills:</strong></p>\n<ul>\n<li>3 years proven work experience as a Rust developer or similar role</li>\n<li>Experience developing highly scalable applications</li>\n<li>Proficiency in the Rust programming language</li>\n<li>Excellent knowledge of databases, SQL, and version control tools</li>\n<li>Experience with test-driven development</li>\n<li>Familiarity with front-end languages (e.g., HTML, JavaScript, and CSS)</li>\n<li>Ability to document requirements and specifications</li>\n</ul>\n<p><strong>Information Requested:</strong></p>\n<p>Kindly mention Job code in the Subject line - RD/2025</p>",
        "tags": [
            "3+ Years",
            "Rust",
            "SQL",
            "SDLC"
        ],
        "summary": "Revyrie Global is seeking a Rust Developer to participate in the full software development lifecycle. The ideal candidate should have 3+ years of experience and proficiency in Rust."
    },
    {
        "job_title": "\"Software Solutions Expert – FinTech (Male Candidates - PALAKKAD , THRISSUR)",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/22737",
        "location": "Technopark",
        "closing_date": "17 Aug 2025",
        "job_description": "<h2>Software Solutions Expert – FinTech</h2>\n<p><strong>IGNOSI ENTERPRISES</strong>\nGround Floor, Tejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.ignosi.in\">http://www.ignosi.in</a></p>\n<p>We're Hiring! Join Our Friendly Sales Team!</p>\n<p><strong>Role:</strong> Software Solutions Expert – FinTech (Male Candidates, Calicut &amp; Malappuram)</p>\n<p><strong>Location:</strong> CALICUT, MALAPPURAM (Travel involved)</p>\n<p><strong>Qualification:</strong> Any Degree</p>\n<p>Hey there! If you love talking to people, enjoy technology, and are curious to learn something new, we’d love to meet you.\nWe’re a super-friendly team looking for someone who’s:</p>\n<ul>\n<li>Good at communicating – Just be yourself and explain things clearly.</li>\n<li>Okay with a bit of travel – We visit clients and make real connections.</li>\n<li>Excited to learn – We’ll train you on everything!</li>\n<li><strong>Bonus:</strong> If you’ve done B2B sales in banking, finance, or jewelry – even better!</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<p><strong>What You Get:</strong></p>\n<ul>\n<li><strong>Monthly Salary:</strong> ₹18,000 - 25,000 + Extra Incentives (earn more if you enjoy selling!)</li>\n<li><strong>Growth Path:</strong> You can become a Sales Manager within a year</li>\n<li><strong>Training &amp; Support:</strong> We’ll guide you at every step – no pressure.</li>\n<li><strong>Friendly Culture:</strong> No bossy vibes here – just a good team with good goals.</li>\n</ul>\n<p>Not sure if you fit? Let’s just talk\nSend a message or your resume to: hr@ignosi.co.in\nOr call: 9778196774</p>\n<p>Closing Date: 17, Aug 2025\nJob Published: 12, Aug 2025</p>",
        "tags": [
            "1+ Years",
            "B2B Sales",
            "FinTech",
            "Communication Skills"
        ],
        "summary": "Ignosi Enterprises is hiring a Software Solutions Expert to join their sales team. This role involves client visits and offers growth into a Sales Manager position."
    },
    {
        "job_title": "\"Software Solutions Expert – FinTech (Male Candidates, Calicut & Malappuram)\"",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/22736",
        "location": "Technopark",
        "closing_date": "17 Aug 2025",
        "job_description": "<h2>Software Solutions Expert – FinTech</h2>\n<p><strong>IGNOSI ENTERPRISES</strong>\nGround Floor, Tejaswini Building, Technopark, Trivandrum , 695581\n<a href=\"http://www.ignosi.in\">http://www.ignosi.in</a></p>\n<p><strong>Closing Date:</strong> 17, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025</p>\n<p><strong>Contact:</strong>\n*   Email: hr@ignosi.co.in\n*   Call: 9778196774</p>\n<p><strong>Brief Description:</strong>\nWe're Hiring! Join Our Friendly Sales Team!</p>\n<p><strong>Role:</strong> Software Solutions Expert – FinTech (Male Candidates, Calicut &amp; Malappuram)\n<strong>Location:</strong> CALICUT, MALAPPURAM (Travel involved)\n<strong>Qualification:</strong> Any Degree</p>\n<p>Hey there! If you love talking to people, enjoy technology, and are curious to learn something new, we’d love to meet you.\nWe’re a super-friendly team looking for someone who’s:</p>\n<ul>\n<li>Good at communicating – Just be yourself and explain things clearly.</li>\n<li>Okay with a bit of travel – We visit clients and make real connections.</li>\n<li>Excited to learn – We’ll train you on everything!</li>\n</ul>\n<p><strong>Bonus:</strong> If you’ve done B2B sales in banking, finance, or jewelry – even better!</p>\n<p><strong>Preferred Skills</strong></p>\n<p><strong>What You Get:</strong></p>\n<ul>\n<li><strong>Monthly Salary:</strong> ₹18,000 - 25,000 + Extra Incentives (earn more if you enjoy selling!)</li>\n<li><strong>Growth Path:</strong> You can become a Sales Manager within a year</li>\n<li><strong>Training &amp; Support:</strong> We’ll guide you at every step – no pressure.</li>\n<li><strong>Friendly Culture:</strong> No bossy vibes here – just a good team with good goals.</li>\n</ul>\n<p>Not sure if you fit? Let’s just talk\nSend a message or your resume to: hr@ignosi.co.in\nOr call: 9778196774</p>",
        "tags": [
            "Entry Level",
            "FinTech",
            "B2B Sales",
            "Communication Skills"
        ],
        "summary": "Ignosi Enterprises is hiring a Software Solutions Expert for their FinTech team in Calicut and Malappuram. The role involves client visits and offers a growth path to Sales Manager."
    },
    {
        "job_title": "Asp.net Developer Trainee",
        "company": "Estrrado Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22735",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>ASP.NET Developer Trainee</h2>\n<p>Estrrado Technology Solutions (P) Ltd is looking for a passionate and self-motivated ASP.NET Developer Trainee to join their team. In this role, you will gain hands-on experience working on real projects, collaborate with senior developers, and enhance your skills using modern development practices and AI-assisted coding tools.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain web applications using ASP.NET, C#, and MVC</li>\n<li>Work with HTML, CSS, JavaScript, Bootstrap, and jQuery for front-end development</li>\n<li>Follow coding standards, best practices, and participate in code reviews.</li>\n<li>Use AI-powered tools like ChatGPT and GitHub Copilot effectively to generate quality code and improve productivity.</li>\n<li>Collaborate with the development team and contribute to project discussions.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, IT, or related field.</li>\n<li>Basic knowledge of ASP.NET, C#, and MVC framework.</li>\n<li>Understanding of HTML, CSS, JavaScript; familiarity with MS SQL or any SQL-based database is an advantage.</li>\n<li>Good communication skills, problem-solving ability, and willingness to learn.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Apply via Career Estrrado or Send your resume to career@estrrado.com with the subject line: ASP.NET Developer (Trainee). Applications without the correct subject line may be put on hold or rejected.</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: career@estrrado.com</li>\n<li>Website: http://www.estrrado.com</li>\n</ul>\n<p><strong>Address:</strong>\nACE 07, 3rd Floor, CDAC Building, Technopark Campus, Trivandrum, 695581</p>\n<p><strong>Closing Date:</strong> 30, Aug 2025</p>\n<p><strong>Job Published:</strong> 12, Aug 2025</p>",
        "tags": [
            "Fresher",
            "ASP.NET",
            "C#",
            "MVC"
        ],
        "summary": "Estrrado is seeking a motivated ASP.NET Developer Trainee to develop web applications. This role involves using modern practices, AI tools, and collaboration with senior developers."
    },
    {
        "job_title": "KONG API Gateway implementation",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/22734",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>KONG API Gateway Implementation</h2>\n<p><strong>Fakeeh Technologies (P) Ltd</strong>\nCarnival Building, 13th Floor,\nTechnopark Campus,\nKaryavattom,\nTrivandrum, 695581\n<a href=\"https://www.fakeeh.tech\">https://www.fakeeh.tech</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@fakeeh.tech</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li><strong>KONG API Gateway Management:</strong> Design, implement, and maintain Kong API Gateway configurations, including services, routes, plugins, and load balancing.</li>\n<li><strong>Custom Plugin Development:</strong> Develop custom plugins using Lua or other scripting languages to extend Kong's functionality.</li>\n<li><strong>Integration:</strong> Integrate Kong with existing APIs and backend systems to ensure seamless communication and data flow.</li>\n<li><strong>Security Management:</strong> Implement and manage API security measures such as authentication, authorization, rate limiting, and traffic management.</li>\n<li><strong>Monitoring and Troubleshooting:</strong> Monitor API performance, set up alerts, and debug issues to ensure high availability and reliability.</li>\n<li><strong>Documentation:</strong> Maintain comprehensive documentation for API configurations, processes, and procedures.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proficiency in Kong API Gateway and its architecture</li>\n<li>Experience with scripting languages such as Lua and Python</li>\n<li>Experience in API development using .NET will be an added advantage</li>\n<li>Strong understanding of RESTful API design principles and OpenAPI specifications</li>\n<li>Experience with containerization and orchestration tools like Docker and Kubernetes</li>\n<li>Knowledge of API security protocols, including OAuth, JWT, and API key management</li>\n</ul>\n<p><strong>Experience:</strong> 3-8 years</p>",
        "tags": [
            "3-8 Years",
            "KONG API Gateway",
            "Lua",
            "API Security"
        ],
        "summary": "Seeking a skilled professional to manage KONG API Gateway, develop custom plugins, and implement API security measures. The role involves integration, monitoring, and documentation to ensure high availability."
    },
    {
        "job_title": "Customer Success Executive ( 1-2 years exp)",
        "company": "Waybeo Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22733",
        "location": "Technopark",
        "closing_date": "19 Aug 2025",
        "job_description": "<h2>Customer Success Executive</h2>\n<p><strong>Waybeo Technology Solutions (P) Ltd</strong></p>\n<p>Waybeo offers advanced intelligence through call tracking &amp; ad generated calls for enterprises, serving about 22,000 locations across India. They have a clientele of 56 enterprise customers including Royal Enfield, Tata Motors, Honda cars etc.</p>\n<p>As a Customer Success Executive at Waybeo, you will collaborate with the customer success team in ensuring that customers are satisfied and receiving value from our products and services. You’ll assist in building and maintaining relationships with clients, addressing customer queries, and helping improve the overall customer experience.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Collaborate with the Customer Success team in managing customer accounts.</li>\n<li>Work with cross-functional teams (e.g., Tech, Sales, Marketing, Support) to ensure customer needs are met.</li>\n<li>Support onboarding and training of new customers to ensure successful product adoption.</li>\n<li>Learn more about competitors and analyse how to integrate new processes into the current.</li>\n<li>Monitor customer usage patterns to identify areas for improvement or potential upsell opportunities.</li>\n<li>Conduct customer follow-ups to gather feedback, identify pain points, and offer solutions.</li>\n<li>Assist with maintaining and updating customer data in CRM tools.</li>\n<li>Help create and manage customer success documentation and reports.</li>\n<li>Assist in developing and implementing strategies to improve the overall customer experience.</li>\n</ul>\n<p><strong>Qualification:</strong></p>\n<ul>\n<li>1-2 years experience</li>\n<li>A graduate degree in a relevant field, preferably an MBA or a related discipline.</li>\n</ul>\n<p><strong>What we offer:</strong></p>\n<ul>\n<li>Gain hands-on experience in customer success strategies and customer relationship management with premium brands &amp; clients all over the country</li>\n<li>Learn about key customer retention metrics and how to drive customer satisfaction.</li>\n<li>Build professional communication and problem-solving skills.</li>\n<li>Exposure to various departments such as Sales, Marketing, and Product Development.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Strong written and verbal communication skills in English, with the ability to interact effectively with customers.</li>\n<li>Basic computing knowledge, with multi-tasking &amp; documentation skills</li>\n<li>Good knowledge in using MS office tools like excel and familiarity with any CRM tools</li>\n<li>Passion for customer service and enhancing customer experience.</li>\n<li>Ability to collaborate with different departments and work in a team environment.</li>\n<li>High attention to detail and organizational skills.</li>\n<li>Willingness to learn and adapt in a fast-paced environment.</li>\n<li>Good understanding of Hindi language is a plus.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Email:</strong> aiswarya.cs@waybeo.com</li>\n<li><strong>Website:</strong> http://www.waybeo.com</li>\n<li><strong>Address:</strong> Module 15, Fourth Floor, Gayatri Building, Technopark, Trivandrum 6955581 Kerala , 695581</li>\n</ul>\n<p><strong>Important Dates</strong></p>\n<ul>\n<li><strong>Closing Date:</strong> 19, Aug 2025</li>\n<li><strong>Job Published:</strong> 12, Aug 2025</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Customer Success",
            "CRM Tools",
            "Communication Skills"
        ],
        "summary": "Waybeo is seeking a Customer Success Executive to ensure customer satisfaction and value from their call tracking services. This role involves client relationship management, addressing queries, and improving overall customer experience."
    },
    {
        "job_title": "Accounts Trainee",
        "company": "Analyse Digital Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22732",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Accounts Trainee</h2>\n<p><strong>Analyse Digital Business Solutions (P) Ltd</strong> is seeking a proactive and detail-oriented Accounts Trainee to join our team. This role involves handling daily financial operations, client billing, budgeting, and reporting within a fast-paced, creative environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage day-to-day financial transactions and bookkeeping using Tally.</li>\n<li>Ensure accurate and timely client billing, tracking receivables, and coordinating with account managers for payment follow-ups.</li>\n<li>Oversee payroll processing, vendor payments, and employee reimbursements.</li>\n<li>Work closely with account managers to prepare budgets for client projects.</li>\n<li>Track project expenses, analyse variances, and provide insights to optimize profitability.</li>\n<li>Support in client billing management and monitor receivables in coordination with the client servicing team.</li>\n<li>Generate monthly, quarterly, and annual financial reports using Tally.</li>\n<li>Provide P&amp;L, budget forecasts, and cash flow statements with insights for strategic decisions.</li>\n<li>Perform revenue and cost analysis to support agency growth initiatives.</li>\n<li>Ensure compliance with local financial regulations, including timely tax filings.</li>\n<li>Maintain accurate records for audits, assist with annual audit processes, and liaise with auditors.</li>\n<li>Prepare and submit necessary tax filings and manage GST compliance.</li>\n<li>Recommend process improvements and leverage Tally to streamline accounting operations.</li>\n<li>Stay updated on relevant financial regulations and agency industry standards.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Finance, Accounting, or a related field.</li>\n<li>0-1 years of finance or accounting experience, with a strong focus on Tally software.</li>\n<li>Knowledge in TDS &amp; GST compliance.</li>\n<li>Proficiency in Tally and advanced Excel skills for data analysis.</li>\n<li>Strong analytical skills and attention to detail.</li>\n<li>Familiarity with other financial tools is a plus.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Analyse Digital Business Solutions (P) Ltd\nPadmanabha, Technopark Campus, Trivandrum , 695581\nWebsite: http://www.analysedigital.com\nContact Email: careers@analysedigital.com</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025</p>",
        "tags": [
            "0-1 Years",
            "Tally",
            "GST Compliance",
            "Financial Reporting"
        ],
        "summary": "Seeking an Accounts Trainee to manage financial operations, client billing, and reporting. The role requires proficiency in Tally and knowledge of financial regulations."
    },
    {
        "job_title": "Power BI Developer",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/22731",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Power BI Developer</h2>\n<p><strong>Fakeeh Technologies (P) Ltd</strong>\nCarnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581</p>\n<p><strong>Contact:</strong> careers@fakeeh.tech</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Effectively coordinate with business users and technical users to customize analytical solutions to meet business needs.</li>\n<li>Provide timely solutions to expected deliverables by understanding the business requirements.</li>\n<li>Provide ongoing reports by efficiently using data analysis, data mining, and statistical techniques.</li>\n<li>Analyze business performance and develop reports on performance metrics.</li>\n<li>Hold responsibility for all activities related to developing and implementing Business Intelligence and analytics systems.</li>\n<li>Support the development and implementation of databases, data collection methods, data analytics, and other strategies to provide efficiency and quality reports.</li>\n<li>Create presentations, advanced charts, and dashboards using Power BI and publishing into server and embedding the dashboards websites as per the client requirements.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Excellent exposure to databases: Oracle SQL and P/L SQL, MS SQL, MY SQL, etc.</li>\n<li>Knowledgeable in ETL: SSIS, SSAS, SSRS.</li>\n<li>BI Tool: Power BI (Online and On-Premises).</li>\n<li>Background in data warehouse design (e.g., dimensional modeling) and data mining.</li>\n<li>In-depth understanding of database management systems, online analytical processing (OLAP) and ETL (Extract, transform, load) framework</li>\n<li>Industry experience is preferred</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li>Excellent exposure in databases: Oracle SQL and P/L SQL, MS SQL, MY SQL, etc.</li>\n<li>Good understanding of Data Warehouse concepts like, Inmon/Kimball methodologies, Star schema, snowflake schema, OLTP, OLAP.</li>\n<li>Knowledgeable in ETL: Informatica Power Center, Alteryx, Data Stage etc.</li>\n<li>BI Tool: Power BI</li>\n<li>Above average knowledge in Cloud platform: Azure, AWS, Big Query will be an added advantage.</li>\n</ul>\n<p><strong>Experience:</strong> 5+ yrs</p>\n<p><strong>Location:</strong> Trivandrum (WFO)</p>",
        "tags": [
            "5+ Years",
            "Power BI",
            "SQL",
            "ETL"
        ],
        "summary": "We are seeking a Power BI Developer to customize analytical solutions and develop insightful reports. The role involves database management, ETL processes, and creating dashboards to meet business needs."
    },
    {
        "job_title": "Manager - Survey Configuration Operations",
        "company": "Press Ganey Associates India (P) Ltd",
        "url": "https://technopark.org/job-details/22730",
        "location": "Technopark",
        "closing_date": "11 Sep 2025",
        "job_description": "<h2>Manager - Survey Configuration Operations</h2>\n<p><strong>Press Ganey Associates India (P) Ltd</strong>\nLevel 4 (L1), Thejaswani, Phase 1, Technopark Campus, Trivandrum, 695581\n<a href=\"https://www.pressganey.com\">https://www.pressganey.com</a></p>\n<p><strong>Closing Date:</strong> 11, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> hr-pgindia@pressganey.com</p>\n<h3>About the Role</h3>\n<p>The Manager of Survey Configuration Operations is responsible for managing a team dedicated to back-office operations in support of the Survey offerings based off the Press Ganey HX platform. This person will help hire members of the team, providing leadership to team members, offering operational guidance in close collaboration with their Product Configuration counterparts, monitoring team performance, and act as an escalation point for operational support and process improvement. The role requires proven people and process management skills, extensive experience in product configuration operations, data manipulation, and excellent cross-departmental collaboration ability. This role will operate on US business hours (IST 6pm to 4 am).</p>\n<h3>Duties and Responsibilities</h3>\n<ul>\n<li>Oversee client services Survey Configuration Operations team, including but not limited to developing and building a strong relationship with the team, workload assignment and accountability, leadership, and individual team mentorship.</li>\n<li>Oversee overall Survey Configuration Operations processes and act as a point of escalation when needed.</li>\n<li>Coordinate and handle client data ingestion and survey configuration in close collaboration with our Product Configuration and Implementation Management teams.</li>\n<li>Monitor team performance on quality and timeliness.</li>\n<li>Discuss, develop, and roll-out process improvement initiatives in collaboration with the other teams involved in Survey Configuration Operations EX domain.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>5yrs people management experience.</li>\n<li>5yrs web product configuration experience.</li>\n<li>Cross-departmental coordination.</li>\n<li>QC and QA processes ownership experience.</li>\n<li>Microsoft Excel proficiency.</li>\n<li>Process Improvement experience.</li>\n</ul>\n<h3>Bonus – Skills of Interest</h3>\n<ul>\n<li>Business Process Mapping experience.</li>\n<li>SQL.</li>\n<li>Salesforce reporting proficiency.</li>\n<li>Root cause analysis experience.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "People Management",
            "Web Product Configuration",
            "Process Improvement"
        ],
        "summary": "Seeking a Manager of Survey Configuration Operations to lead a team, manage operations, and improve processes. Requires 5+ years of management and web product configuration experience."
    },
    {
        "job_title": "API Gateway Engineer",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/22729",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>API Gateway Engineer</h2>\n<p><strong>Fakeeh Technologies (P) Ltd</strong>\nCarnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581</p>\n<p><a href=\"https://www.fakeeh.tech\">https://www.fakeeh.tech</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@fakeeh.tech</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li><strong>API Gateway Management:</strong> Design, implement, and maintain API Gateway configurations, including services, routes, plugins, and load balancing.</li>\n<li><strong>Custom Plugin Development:</strong> Develop custom plugins using Lua or other scripting languages to extend Kong's functionality.</li>\n<li><strong>Integration:</strong> Integrate Kong with existing APIs and backend systems to ensure seamless communication and data flow.</li>\n<li><strong>Security Management:</strong> Implement and manage API security measures such as authentication, authorization, rate limiting, and traffic management.</li>\n<li><strong>Monitoring and Troubleshooting:</strong> Monitor API performance, set up alerts, and debug issues to ensure high availability and reliability.</li>\n<li><strong>Documentation:</strong> Maintain comprehensive documentation for API configurations, processes, and procedures.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proficiency in API Gateway and its architecture</li>\n<li>Experience with scripting languages such as Lua and Python</li>\n<li>Experience in API development using .NET will be an added advantage</li>\n<li>Strong understanding of RESTful API design principles and OpenAPI specifications</li>\n<li>Experience with containerization and orchestration tools like Docker and Kubernetes</li>\n<li>Knowledge of API security protocols, including OAuth, JWT, and API key management</li>\n</ul>\n<p><strong>Experience:</strong> 3-8 years</p>",
        "tags": [
            "3-8 Years",
            "API Gateway",
            "Lua",
            "Kong"
        ],
        "summary": "Fakeeh Technologies is seeking an API Gateway Engineer to manage and secure APIs. The role involves custom plugin development, integration, and ensuring high availability."
    },
    {
        "job_title": "Trainees for Business Growth Team",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22728",
        "location": "Technopark",
        "closing_date": "19 Aug 2025",
        "job_description": "<h2>Trainees for Business Growth Team</h2>\n<p>Softnotions Technologies is hiring trainees for the Business Growth Team to explore opportunities in International Marketing.</p>\n<p><strong>Contact:</strong> recruitment@softnotions.com</p>\n<p><strong>Closing Date:</strong> 19, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p>Trainees will initially undergo a 3-month training period, with potential conversion to permanent roles based on performance.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Conduct market research and identify potential international clients in targeted verticals (US, Europe, Middle East, etc.)</li>\n<li>Generate qualified leads through outbound email campaigns, LinkedIn prospecting, and cold calls</li>\n<li>Build and maintain a strong prospect pipeline in the CRM system</li>\n<li>Understand Softnotions' service offerings and communicate value propositions to potential clients</li>\n<li>Schedule and coordinate meetings or demos for the Business Development Manager or Technical Sales Team</li>\n<li>Support RFP/RFI processes with background data and initial documentation</li>\n<li>Maintain reports and dashboards to track outreach and conversion metrics</li>\n<li>Collaborate with marketing and delivery teams to align messaging and client approach</li>\n<li>Assist in proposal follow-ups, nurturing leads, and handling basic client queries</li>\n</ul>\n<p><strong>Required Skills &amp; Attributes:</strong></p>\n<ul>\n<li>Strong communication skills – written and verbal (English proficiency is a must)</li>\n<li>Good understanding of technology trends, software development, and digital transformation concepts</li>\n<li>Basic knowledge of CRM tools (HubSpot, Zoho, or equivalent)-desirable</li>\n<li>Ability to work with international time zones and cultures</li>\n<li>High attention to detail, responsiveness, and follow-through</li>\n<li>Positive attitude, growth mindset, and eagerness to learn</li>\n<li>BSC/BTech (CS)+MBA (Mkg)</li>\n</ul>",
        "tags": [
            "Entry Level",
            "International Marketing",
            "CRM",
            "Lead Generation"
        ],
        "summary": "Softnotions Technologies is seeking trainees for its Business Growth Team to explore international marketing. This is a 3-month training with the possibility of a permanent position."
    },
    {
        "job_title": "Survey Configuration Specialist",
        "company": "Press Ganey Associates India (P) Ltd",
        "url": "https://technopark.org/job-details/22727",
        "location": "Technopark",
        "closing_date": "11 Sep 2025",
        "job_description": "<h2>Survey Configuration Specialist</h2>\n<p><strong>Press Ganey Associates India (P) Ltd</strong>\nLevel 4 (L1), Thejaswani, Phase 1, Technopark Campus, Trivandrum, 695581\n<a href=\"https://www.pressganey.com\">https://www.pressganey.com</a></p>\n<p><strong>Contact Email:</strong> hr-pgindia@pressganey.com</p>\n<p><strong>Closing Date:</strong> 11, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p>Seeking a detail-oriented and organized Survey Configuration Specialist to handle data ingestion and survey configuration operations for our Employer Experience clients. The role is focused on configuring and QCing data and survey parameters based on client-specific requirements.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Survey Configuration QC: Performing structured quality checks on survey configurations.</li>\n<li>Survey Configuration Development: Configuring EX surveys on the HX platform in accordance to client requirements compiled by the client implementation team.</li>\n<li>Data Ingestion: Performing the necessary data mapping and data conversion tasks to align client data with system requirements, based on guidance provided by the client implementation team.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Analytical Skills: Strong analytical and problem-solving skills.</li>\n<li>Attention to Detail: High attention to detail and organizational skills.</li>\n<li>Communication Skills: Effective communication, excellent English language proficiency, and collaboration skills.</li>\n<li>Knowledge of medical terminology: Understanding of medical terminology and healthcare industry trends.</li>\n<li>Excel proficiency.</li>\n</ul>\n<p><strong>Experience:</strong> 2 Years</p>\n<p><strong>Work Time:</strong> IST 6pm to 4 am</p>",
        "tags": [
            "2+ Years",
            "Data Ingestion",
            "Excel",
            "Quality Checking"
        ],
        "summary": "We are looking for a Survey Configuration Specialist to manage data and configure surveys for Employer Experience clients. Responsibilities include quality checks, survey configuration on the HX platform, and data ingestion."
    },
    {
        "job_title": "Production and Support Executive – Gate Automation, Security & Automation Systems",
        "company": "M Squared Software & Services (P) Ltd",
        "url": "https://technopark.org/job-details/22726",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Production and Support Executive – Gate Automation, Security &amp; Automation Systems</h2>\n<p>M Squared Software &amp; Services (P) Ltd\nM Squared Building\nTechnopark Campus\nTrivandrum , 695581\n<a href=\"http://www.m2india.com\">http://www.m2india.com</a></p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@m2comsys.us</p>\n<p><strong>Brief Description</strong>\nThe Production and Support Executive will be responsible for in-house production, assembly, soldering, and testing of gate automation systems and related automation products, along with providing on-site service, repairs, and client support. This role is suitable for freshers with technical education as well as candidates with relevant experience in electronics production, PCB assembly, and field support.</p>\n<p><strong>Key Responsibilities:</strong>\n- In-House Production &amp; Assembly\n- Electronics Testing &amp; Quality Control\n- Service &amp; Repairs\n- On-Site Client Services\n- Documentation &amp; Coordination</p>\n<p><strong>Qualifications:</strong>\nDiploma / Bachelor’s degree in Electronics, Electrical, Mechatronics, or related field\nOR\nITI certification in Electrical, Electronics, or a related trade.</p>\n<p><strong>Experience:</strong>\nExperience in electronics equipment production, PCB assembly, soldering, testing, or automation system service will be an advantage.\nFreshers are also welcome.</p>\n<p><strong>Preferred Skills</strong>\nInterested candidates are requested to send their Resumes to careers@m2comsys.us with Subject Line as \"Production and Support Executive\"</p>",
        "tags": [
            "Entry Level",
            "Electronics Production",
            "PCB Assembly",
            "Automation Systems"
        ],
        "summary": "Seeking a Production and Support Executive for gate automation and security systems. Responsibilities include production, testing, service, and client support; freshers are welcome!"
    },
    {
        "job_title": "Installation and Support Executive – ELV, Automation & IT Infrastructure",
        "company": "M Squared Software & Services (P) Ltd",
        "url": "https://technopark.org/job-details/22725",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Installation and Support Executive – ELV, Automation &amp; IT Infrastructure</h2>\n<p>M Squared Software &amp; Services (P) Ltd\nM Squared Building\nTechnopark Campus\nTrivandrum , 695581\nhttp://www.m2india.com</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@m2comsys.us</p>\n<h3>Brief Description</h3>\n<p>The Installation and Support Executive is responsible for the on-site installation, configuration, testing, and support of Extra Low Voltage (ELV) systems, automation solutions, and IT infrastructure. This role involves close collaboration with the project team, vendors, and clients to ensure smooth deployment, reliable operation, and timely technical support for all installed systems.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Install, configure, and commission ELV systems such as:</li>\n<li>CCTV Surveillance Systems</li>\n<li>Access Control &amp; Time Attendance Systems</li>\n<li>Fire Alarm &amp; Public Address Systems</li>\n<li>Structured Cabling &amp; Networking</li>\n<li>Technical Support &amp; Maintenance:</li>\n<li>Provide on-site and remote technical support for ELV, automation, and IT systems.</li>\n<li>Perform regular preventive maintenance, firmware updates, and system health checks.</li>\n<li>Troubleshoot faults, replace defective components, and restore system functionality quickly.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Diploma / Bachelor’s degree in Electronics, Electrical, IT, CS or related field, or ITI certification in a relevant trade.</li>\n</ul>\n<h3>Experience:</h3>\n<ul>\n<li>1–3 years of experience in the installation and support of ELV, automation, and IT infrastructure systems.</li>\n<li>Freshers are also welcome.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p>Interested candidates are requested to send their Resumes to careers@m2comsys.us with Subject Line as \"Installation and Support Executive\"</p>",
        "tags": [
            "1-3 Years",
            "ELV Systems",
            "CCTV",
            "IT Infrastructure"
        ],
        "summary": "Seeking an Installation and Support Executive for ELV systems, automation, and IT infrastructure. Responsibilities include installation, configuration, maintenance, and technical support, with freshers also welcome to apply."
    },
    {
        "job_title": "SEO & Digital Marketing Executive",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/22724",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>SEO &amp; Digital Marketing Executive</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong>\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala\nIndia, 695 581\n<a href=\"http://www.prayananimation.com\">http://www.prayananimation.com</a></p>\n<p><strong>Job Overview</strong></p>\n<p>We’re looking for a talented and driven SEO &amp; Digital Marketing Executive to join our team. You will help boost our online visibility, drive organic traffic, and manage digital campaigns—especially for our animation services.</p>\n<p><strong>Key Responsibilities</strong>:</p>\n<p><strong>SEO</strong></p>\n<ul>\n<li>Research keywords and competitors to find content opportunities</li>\n<li>Optimize website content (meta tags, headings, images, internal links)</li>\n<li>Conduct technical SEO audits (site speed, mobile-friendliness, crawl issues)</li>\n<li>Build and manage backlinks</li>\n<li>Handle local SEO (Google My Business, directory listings, NAP consistency)</li>\n<li>Monitor SEO performance using tools like Google Analytics, SEMrush, Ahrefs, etc.</li>\n<li>Keep up with SEO trends and algorithm updates</li>\n<li>Work with content writers and developers to meet SEO goals</li>\n<li>Improve conversions using A/B testing and layout tweaks</li>\n</ul>\n<p><strong>Digital Marketing</strong></p>\n<ul>\n<li>Plan and run paid ad campaigns (Google Ads, Facebook, Instagram, etc.)</li>\n<li>Manage and grow social media channels</li>\n<li>Create or support marketing content for digital platforms</li>\n<li>Run and monitor email campaigns</li>\n<li>Improve landing pages for better lead generation</li>\n<li>Track and report digital marketing performance</li>\n<li>Combine SEO &amp; SEM strategies for maximum reach</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>1+ years of experience in SEO and digital marketing (2+ preferred)</li>\n<li>Good knowledge of SEO tools (SEMrush, Ahrefs, Moz, Screaming Frog, etc.)</li>\n<li>Experience with Google Ads, Facebook Ads, LinkedIn Ads</li>\n<li>Familiar with WordPress, basic HTML/CSS</li>\n<li>Understanding of SEO, SEM, SMM, Email Marketing, and more</li>\n<li>Strong communication, analytical, and project management skills</li>\n<li>Experience in the animation/creative field is a plus</li>\n<li>Able to relocate or commute to Trivandrum</li>\n</ul>\n<p><strong>Location</strong>: Trivandrum, Kerala\n<strong>Job Type</strong>: Full-Time | Day Shift\n<strong>Experience</strong>: Minimum 1+ Year\n<strong>Salary</strong>: Based on Experience\n<strong>Start Date</strong>: At the Earliest</p>\n<p><strong>How to Apply</strong></p>\n<p>📧 Send your resume and a link to your portfolio or case studies to: <a href=\"mailto:jobs@prayananimation.com\">jobs@prayananimation.com</a>\nEmail Subject Line: Resume – “SEO &amp; Digital Marketing Executive”</p>\n<p><strong>Closing Date</strong>: 18, Aug 2025\n<strong>Job Published</strong>: 12, Aug 2025</p>\n<p><strong>Contact Email</strong>: <a href=\"mailto:jobs@prayananimation.com\">jobs@prayananimation.com</a></p>",
        "tags": [
            "1+ Years",
            "SEO",
            "Digital Marketing",
            "Google Analytics",
            "Google Ads"
        ],
        "summary": "Prayan Animation is hiring an SEO & Digital Marketing Executive to boost online visibility and manage digital campaigns. The role requires 1+ years of experience and proficiency in SEO tools."
    },
    {
        "job_title": "Sales Executive (Book Publishing)",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/22723",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Sales Executive (Book Publishing)</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong> is seeking a motivated and results-driven Sales Executive to lead the marketing and sales efforts for our Children’s Book services and Prayan’s own published titles. The ideal candidate will have a passion for books, strong networking skills, and the ability to identify and convert sales opportunities both in domestic and international markets.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Identify and connect with new authors, publishers, and potential clients for children’s book projects.</li>\n<li>Drive sales of Prayan’s published books across retail, online, and institutional channels.</li>\n<li>Achieve and exceed monthly and quarterly sales targets.</li>\n<li>Develop and implement marketing strategies to increase brand visibility and market reach.</li>\n<li>Build and maintain strong relationships with authors, distributors, and booksellers.</li>\n<li>Conduct market research to identify trends, competitor activities, and new business opportunities.</li>\n<li>Represent Prayan Animation at book fairs, events, and networking opportunities (national and international).</li>\n<li>Coordinate with the creative and production teams to ensure client requirements are met effectively.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Publishing, or related field.</li>\n<li>1–3 years of experience in sales, marketing, or publishing (experience in children’s books is a plus).</li>\n<li>Strong communication, negotiation, and interpersonal skills.</li>\n<li>Ability to work independently and meet deadlines in a target-driven environment.</li>\n<li>Willingness to travel for client meetings, events, and book fairs.</li>\n<li>Proficiency in MS Office; knowledge of digital marketing tools is an advantage.</li>\n<li>Willing to relocate or commute to Trivandrum.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<ul>\n<li>Send your resume to: jobs@prayananimation.com</li>\n<li>Email Subject Line: Resume – “Sales Executive ”</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Prayan Animation Studio (P) Ltd\nE-12, Tejaswini-1, Technopark\nTrivandrum, Kerala\nIndia, 695 581\nhttp://www.prayananimation.com\nContact Email: jobs@prayananimation.com</p>",
        "tags": [
            "1-3 Years",
            "Sales",
            "Marketing",
            "Book Publishing"
        ],
        "summary": "Prayan Animation is hiring a Sales Executive to market children's books and published titles. The role involves sales, networking, and achieving targets in domestic and international markets."
    },
    {
        "job_title": "Graphic Designer & Book Formatter",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/22722",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Graphic Designer &amp; Book Formatter</h2>\n<p>Prayan Animation Studio (P) Ltd is looking for a creative and detail-oriented Graphic Designer &amp; Book Formatter to join our team in Trivandrum, Kerala.</p>\n<p><strong>Contact:</strong> jobs@prayananimation.com</p>\n<p><strong>Location:</strong> Trivandrum, Kerala\n<strong>Job Type:</strong> Full-Time | Day Shift\n<strong>Salary:</strong> Based on Experience\n<strong>Start Date:</strong> At the Earliest</p>\n<h3>Job Overview</h3>\n<p>The ideal candidate will be responsible for designing layouts, formatting books for print/digital publishing, and supporting visual content creation across projects.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Graphic Design</strong></p>\n<ul>\n<li>Create appealing designs for book covers, promotional materials, and digital media</li>\n<li>Design layouts and templates aligned with brand and content guidelines</li>\n<li>Support the team with graphics for marketing, social media, and presentations</li>\n<li>Format children’s books and other publications for print and digital release</li>\n<li>Ensure correct margins, bleed, alignment, and typography across all pages</li>\n<li>Prepare final files for printing and eBook publishing (PDF, EPUB, etc.)</li>\n<li>Maintain consistency in layout and design throughout the book</li>\n<li>Work closely with illustrators, editors, and content teams</li>\n<li>Stay updated with design trends and tools used in publishing</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Minimum 1 year of experience in graphic design and book formatting</li>\n<li>Strong portfolio showcasing layout design and graphic work</li>\n<li>Good understanding of design principles, typography, and publishing formats</li>\n<li>Ability to format for both print and digital platforms</li>\n<li>Attention to detail and time management skills</li>\n<li>Familiarity with children's book design is a plus</li>\n<li>Able to relocate or commute to Trivandrum, Kerala</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Adobe InDesign – Preferred for book layout and formatting</li>\n<li>Adobe Photoshop &amp; Illustrator – For design and graphic editing</li>\n<li>Knowledge of PDF setup and export settings for print/digital</li>\n<li>Optional: Canva, CorelDRAW, or other design tools</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume and a link to your design/formatting portfolio to: jobs@prayananimation.com</p>\n<p>Email Subject Line: Resume – “Graphic Designer &amp; Book Formatter”</p>\n<p>Prayan Animation Studio (P) Ltd\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala\nIndia, 695 581\nhttp://www.prayananimation.com</p>",
        "tags": [
            "1+ Years",
            "Adobe InDesign",
            "Adobe Photoshop",
            "Book Formatting"
        ],
        "summary": "Prayan Animation Studio is hiring a Graphic Designer & Book Formatter to design layouts and format books for print/digital publishing. The role requires 1+ years of experience and proficiency in Adobe Creative Suite."
    },
    {
        "job_title": "Children’s Book Illustration Supervisor",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/22721",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Children’s Book Illustration Supervisor</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong>\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala, India, 695 581\n<a href=\"http://www.prayananimation.com\">http://www.prayananimation.com</a></p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> jobs@prayananimation.com</p>\n<h3>Job Overview</h3>\n<p>We are looking for a creative and experienced Illustration Supervisor to lead our children’s book illustration team. The ideal candidate will have a strong artistic background, experience in visual storytelling for children, and the ability to guide a team of illustrators from concept to final artwork.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Creative Supervision</strong></p>\n<ul>\n<li>Lead and supervise a team of children’s book illustrators</li>\n<li>Review and guide illustration concepts, character designs, and storytelling visuals</li>\n<li>Ensure the illustration style matches client expectations and project guidelines</li>\n<li>Provide constructive feedback to maintain high artistic quality and consistency</li>\n<li>Coordinate with writers, editors, and animation teams for seamless creative flow</li>\n</ul>\n<p><strong>Project Management</strong></p>\n<ul>\n<li>Manage multiple book projects and ensure timely delivery</li>\n<li>Plan and allocate work based on team strengths and project deadlines</li>\n<li>Maintain communication with clients for feedback and approvals</li>\n<li>Ensure all artwork meets publishing standards and formatting requirements</li>\n<li>Guide revisions based on client and editorial feedback</li>\n</ul>\n<p><strong>Hands-On Contribution</strong></p>\n<ul>\n<li>Contribute to key illustrations when needed (especially character development and cover art)</li>\n<li>Help create illustration templates and visual references for the team</li>\n<li>Stay updated with trends in children’s publishing and visual storytelling</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Minimum 5 years of experience in children’s book illustration</li>\n<li>Proven experience leading or supervising an art/illustration team</li>\n<li>Strong portfolio demonstrating illustration work for children's books</li>\n<li>Excellent understanding of storytelling, composition, color theory, and child-friendly design</li>\n<li>Proficiency in digital illustration tools (Adobe Photoshop, Illustrator, Procreate, etc.)</li>\n<li>Ability to manage time and meet tight deadlines</li>\n<li>Strong communication and leadership skills</li>\n<li>Attention to detail and a passion for children’s content</li>\n<li>Prior experience working with international publishers is a plus</li>\n<li>Able to relocate or commute to Trivandrum, Kerala</li>\n</ul>\n<p><strong>Location:</strong> Trivandrum, Kerala\n<strong>Job Type:</strong> Full-Time | Day Shift\n<strong>Experience:</strong> 5+ Years in Illustration &amp; Team Management\n<strong>Salary:</strong> Based on Experience\n<strong>Start Date:</strong> At the Earliest</p>\n<h3>How to Apply</h3>\n<p>📧 Send your resume and a link to your illustration portfolio (with children’s book samples) to: jobs@prayananimation.com\n📌 <strong>Email Subject Line:</strong> Resume – “Children’s Book Illustration Supervisor”</p>",
        "tags": [
            "5+ Years",
            "Children's Book Illustration",
            "Adobe Photoshop",
            "Team Management"
        ],
        "summary": "Prayan Animation Studio is seeking a Children’s Book Illustration Supervisor to lead a team of illustrators. The role involves creative supervision, project management, and hands-on contribution to children's book projects."
    },
    {
        "job_title": "Book Coloring Artist",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/22720",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Book Coloring Artist</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong> is looking for a talented Book Coloring Artist to join our team in Trivandrum, Kerala. We are seeking a skilled and experienced artist with a passion for enhancing visual storytelling through vibrant, high-quality coloring for children's books.</p>\n<p><strong>Job Overview</strong></p>\n<p>As a Book Coloring Artist, you will be part of a talented illustration team, responsible for digitally coloring illustrations for children's books based on provided line art. You will maintain consistency in coloring style, palette, lighting, and mood across pages, while following creative direction and color references accurately. Enhancing character appeal and storytelling through color choice is a key aspect of this role. Collaboration with illustration supervisors, project leads, and other team members is also required.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Digitally color illustrations for children's books based on the line art provided</li>\n<li>Maintain consistency in coloring style, palette, lighting, and mood across pages</li>\n<li>Follow creative direction and color references accurately</li>\n<li>Enhance character appeal and storytelling through color choice.</li>\n<li>Collaborate with illustration supervisors, project leads, and other team members</li>\n<li>Ensure timely delivery of high-quality, print-ready artwork</li>\n<li>Maintain attention to detail while meeting project deadlines</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Minimum 3 years of experience in digital coloring for children’s books or similar projects</li>\n<li>Strong portfolio demonstrating creativity, consistency, and technical skill in coloring</li>\n<li>Expertise in Adobe Photoshop (mandatory)</li>\n<li>Excellent sense of color, lighting, shading, and visual storytelling</li>\n<li>Ability to work independently and as part of a creative team</li>\n<li>Basic understanding of file formats, resolutions, and color profiles for publishing</li>\n<li>Strong communication and time management skills</li>\n<li>Must be able to relocate or commute to Trivandrum, Kerala</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Adobe Photoshop – Expert-level skills required</li>\n<li>Drawing Tablet (e.g., Wacom or equivalent)</li>\n<li>Optional: Procreate, Clip Studio Paint (based on workflow)</li>\n<li>Familiarity with working in layered PSD files and preparing files for print</li>\n</ul>\n<p><strong>Additional Information</strong></p>\n<ul>\n<li><strong>Location:</strong> Trivandrum, Kerala</li>\n<li><strong>Job Type:</strong> Full-Time | Day Shift</li>\n<li><strong>Experience:</strong> 3+ Years in Illustration &amp; Team Management</li>\n<li><strong>Salary:</strong> Based on Experience</li>\n<li><strong>Start Date:</strong> At the Earliest</li>\n</ul>\n<p><strong>How to Apply</strong></p>\n<p>Send your resume and a link to your coloring portfolio (with children’s book samples) to: jobs@prayananimation.com</p>\n<p>Email Subject Line: Resume – “Book Coloring Artist”</p>\n<p><strong>Contact Information</strong></p>\n<p>Prayan Animation Studio (P) Ltd\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala, India, 695 581\nhttp://www.prayananimation.com</p>\n<p><strong>Important Dates</strong></p>\n<ul>\n<li><strong>Closing Date:</strong> 18, Aug 2025</li>\n<li><strong>Job Published:</strong> 12, Aug 2025</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Adobe Photoshop",
            "Digital Coloring",
            "Children's Books"
        ],
        "summary": "Prayan Animation Studio is hiring a Book Coloring Artist to digitally color illustrations for children's books. The ideal candidate will have 3+ years of experience and expert Photoshop skills."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/22719",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p><strong>Fakeeh Technologies (P) Ltd</strong>\nCarnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581\nhttps://www.fakeeh.tech</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@fakeeh.tech</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Proficiency with fundamental front-end language: <strong>Angular</strong></li>\n<li>Knowledge in <strong>C#.Net, ASP.Net, MVC/WEB API</strong></li>\n<li>Knowledge of <strong>.Net Core and MongoDB</strong> is an added advantage.</li>\n<li>Familiarity with database technology such as <strong>SQL, and Oracle</strong>.</li>\n<li>Excellent verbal communication skills.</li>\n<li>Good problem-solving skills.</li>\n<li>Microsoft certification is an added advantage.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Skills: <strong>C#.NET, Angular, SQL/Oracle</strong></li>\n<li>Experience: <strong>2 to 7 years</strong></li>\n</ul>",
        "tags": [
            "2-7 Years",
            "Angular",
            "C#.NET",
            "SQL"
        ],
        "summary": "Fakeeh Technologies is seeking a Full Stack Developer proficient in Angular and C#.NET. The ideal candidate will have experience with SQL/Oracle and excellent problem-solving skills."
    },
    {
        "job_title": "API Developers (.NET) - Contract Role",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/22718",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>API Developers (.NET) - Contract Role</h2>\n<p><strong>Fakeeh Technologies (P) Ltd</strong>\nCarnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581\n<a href=\"https://www.fakeeh.tech\">https://www.fakeeh.tech</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@fakeeh.tech</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Knowledge of C#.Net, ASP.Net, MVC/WEB API</li>\n<li>Familiarity with database technology such as SQL and Oracle.</li>\n<li>Excellent verbal communication skills.</li>\n<li>Good problem-solving skills.</li>\n<li>Microsoft certification is an added advantage.</li>\n<li>Implement unit, integration, and automated tests.</li>\n<li>Deploy and maintain services in cloud environments (Azure, AWS, etc.).</li>\n<li>Solid understanding of API security (authentication, authorization, encryption).</li>\n<li>Familiarity with DevOps tools like Azure DevOps, Git, CI/CD pipelines.</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\n- Years of Experience: 5+ years\n- Work Location: Thiruvananthapuram (Work from Office)\n- Duration: 3 to 6 Months</p>",
        "tags": [
            "5+ Years",
            "C#.Net",
            "ASP.Net",
            "SQL"
        ],
        "summary": "Fakeeh Technologies is seeking an API Developer with strong .NET skills for a contract role. The ideal candidate will have 5+ years of experience and familiarity with cloud environments."
    },
    {
        "job_title": "Software Sales Executive",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22717",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Software Sales Executive</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA, 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p>We are seeking a dynamic and results-driven Software Sales Executive to join our team. This role involves identifying business opportunities, building strong client relationships, and driving software sales to achieve revenue targets. The ideal candidate will have a strong understanding of software solutions, excellent communication skills, and a proven track record in sales.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Identify and generate new business opportunities through lead generation, networking, and cold calling.</li>\n<li>Understand client needs and recommend suitable software solutions.</li>\n<li>Deliver compelling sales presentations, product demonstrations, and proposals.</li>\n<li>Negotiate contracts and close sales to achieve revenue targets.</li>\n<li>Develop and maintain strong relationships with existing and potential clients.</li>\n<li>Stay updated on industry trends, competitor activities, and market conditions.</li>\n<li>Collaborate with the marketing and product teams to drive sales strategies.</li>\n<li>Maintain accurate sales records and reports using CRM tools.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, IT, or a related field.</li>\n<li>Proven experience in software sales, IT sales, or B2B sales.</li>\n<li>Strong understanding of SaaS, cloud solutions, or enterprise software.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Proficiency in CRM software and Microsoft Office Suite.</li>\n<li>Willingness to travel as needed.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience selling ERP, CRM, cybersecurity, or other enterprise software solutions.</li>\n<li>Familiarity with consultative sales techniques.</li>\n<li>Technical background or understanding of software development is a plus.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Software Sales",
            "CRM Software",
            "SaaS"
        ],
        "summary": "Kenland IT Solutions is looking for a Software Sales Executive. Responsibilities include identifying opportunities, building client relationships, and achieving revenue targets through software sales."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22716",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>UI/UX Designer</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA , 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> <a href=\"mailto:recruiter@kenland.in\">recruiter@kenland.in</a></p>\n<p><strong>Brief Description</strong></p>\n<p><strong>Experience:</strong> Minimum 1 years\n<strong>Location:</strong> Thiruvananthapuram\n<strong>Job Type:</strong> Full-time\n<strong>Joining:</strong> Immediate joiners preferred</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Conduct user research and analyze user behavior to create intuitive designs.</li>\n<li>Design wireframes, prototypes, and user flows for websites, apps, and other digital products.</li>\n<li>Collaborate with product managers, developers, and stakeholders to align design with business goals.</li>\n<li>Create and maintain design systems, style guides, and UI components.</li>\n<li>Ensure responsiveness and accessibility in designs for all devices.</li>\n<li>Conduct usability testing and gather feedback to improve designs.</li>\n<li>Stay updated with UI/UX trends, tools, and best practices.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Proficiency in design tools like Figma and Adobe XD</li>\n<li>Knowledge of user-centered design (UCD) principles.</li>\n<li>Knowledge and experience on HTML, CSS and Bootstrap</li>\n<li>Strong problem-solving and communication skills.</li>\n<li>Ability to analyze user data and conduct usability testing.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in Design, Computer Science, or a related field (preferred).</li>\n<li>1+ years of experience in UI/UX design.</li>\n<li>Portfolio showcasing UI/UX projects.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Figma",
            "Adobe XD",
            "HTML/CSS"
        ],
        "summary": "We are looking for a UI/UX Designer to create intuitive designs for our digital products. The ideal candidate will have a passion for user-centered design."
    },
    {
        "job_title": "Associate RPA Developer (Fresher – 2025 Passout Only)",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22715",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Associate RPA Developer</h2>\n<p><strong>Alzone Software (P) Ltd</strong>\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\nhttp://www.alzonesoftware.com</p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@alzonesoftware.com</p>\n<p><strong>Location:</strong> Technopark Phase 1, Thiruvananthapuram</p>\n<p><strong>Eligibility:</strong> B.Tech Computer Science – 2025 batch only</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and test RPA automation scripts</li>\n<li>Analyze business processes to identify automation opportunities</li>\n<li>Configure and deploy RPA bots</li>\n</ul>\n<p><strong>Required Skills:</strong> MySQL, Python, JavaScript</p>\n<p><strong>Training:</strong> Comprehensive RPA training provided by the company</p>\n<p><strong>How to Apply:</strong> Please send your updated resume to careers@alzonesoftware.com with the subject: “Application for Associate RPA Developer”</p>",
        "tags": [
            "Fresher",
            "RPA",
            "Python",
            "MySQL"
        ],
        "summary": "Alzone Software is seeking an Associate RPA Developer to design, develop, and test RPA automation scripts. Comprehensive RPA training will be provided by the company."
    },
    {
        "job_title": "IT Manager",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22714",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>IT Manager</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA , 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 12, Aug 2025</p>\n<h3>Position Overview:</h3>\n<p>We are seeking an experienced IT Manager with a strong background in system administration to oversee our organization's IT infrastructure and operations. The ideal candidate will possess a blend of technical expertise, leadership skills, and strategic vision to effectively manage our IT resources and support our business objectives.</p>\n<h3>Responsibilities:</h3>\n<p><strong>IT Infrastructure Management:</strong>\n- Oversee the design, implementation, and maintenance of our organization's IT infrastructure, including networks, servers, storage systems, and cloud services.\n- Ensure the security, availability, and performance of IT systems through proactive monitoring, maintenance, and optimization.\n- Plan and execute infrastructure upgrades, migrations, and expansion projects as needed to support business growth and technological advancements.</p>\n<p><strong>System Administration:</strong>\n- Lead a team of system administrators responsible for managing servers, databases, operating systems, and other IT systems.\n- Develop and enforce IT policies, procedures, and standards to ensure compliance, security, and efficiency.\n- Troubleshoot complex technical issues and provide escalated support to resolve critical incidents in a timely manner.</p>\n<p><strong>IT Operations:</strong>\n- Manage IT service desk operations and ensure timely resolution of user support requests and technical issues.\n- Coordinate with internal stakeholders and external vendors to procure, deploy, and maintain IT hardware, software, and services.\n- Implement ITIL best practices for incident, problem, change, and asset management to streamline IT operations and improve service delivery.</p>\n<p><strong>Team Leadership and Development:</strong>\n- Provide leadership, guidance, and mentorship to the IT team, fostering a culture of collaboration, innovation, and continuous learning.\n- Set clear performance goals and objectives for team members, conduct regular performance evaluations, and provide constructive feedback for professional growth.\n- Identify training and development opportunities to enhance the skills and capabilities of the IT team in alignment with organizational goals.</p>\n<p><strong>Strategic Planning:</strong>\n- Collaborate with senior management to develop IT strategies, roadmaps, and budgets aligned with business objectives and priorities.\n- Evaluate emerging technologies and industry trends to recommend innovative solutions that drive operational excellence and competitive advantage.\n- Participate in IT governance processes to ensure alignment between IT investments and business strategy, risk management, and regulatory compliance.</p>\n<p><strong>Software Experience:</strong>\n- ERP / SAP Implementation &amp; Management\n- E-Commerce Management (Magento / Shopify)\n- CCTV Security / Surveillance system management\n- Time Attendance &amp; related management\n- Building Management System.</p>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in Information Technology, or related field.</li>\n<li>Proven experience (10 plus years) in IT management roles with a focus on system administration.</li>\n<li>Strong technical proficiency in system administration, networking, virtualization, and cloud.</li>\n<li>In-depth knowledge of ITIL frameworks, IT service management practices, and industry standards for security and compliance.</li>\n<li>Excellent leadership, communication, and interpersonal skills with the ability to effectively collaborate with cross-functional teams and stakeholders.</li>\n<li>Demonstrated experience in strategic planning, budgeting, and project management.</li>\n<li>Industry certifications such as ITIL, CISSP, MCSE, or CCNA are a plus.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>IT Infrastructure Management</li>\n<li>System Administration</li>\n<li>IT Operations</li>\n<li>Team Leadership and Development</li>\n<li>Strategic Planning</li>\n<li>Software Management.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "System Administration",
            "IT Infrastructure Management",
            "Strategic Planning"
        ],
        "summary": "Kenland IT Solutions is looking for an IT Manager to oversee IT infrastructure and operations. The role involves system administration, team leadership, and strategic planning to support business objectives."
    },
    {
        "job_title": "Dot Net Developer",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/22713",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>.Net Developer</h2>\n<p><strong>Fakeeh Technologies (P) Ltd</strong>\nCarnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581\n<a href=\"https://www.fakeeh.tech\">https://www.fakeeh.tech</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@fakeeh.tech</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Knowledge in C#.Net, ASP.Net, MVC/WEB API.</li>\n<li>Knowledge of .Net Core and MongoDB is an added advantage.</li>\n<li>Familiarity with database technology such as SQL.</li>\n<li>Excellent verbal communication skills.</li>\n<li>Good problem-solving skills.</li>\n<li>Healthcare background is desirable.</li>\n<li>Microsoft certification is an added advantage.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Education Qualification:</strong> PG Degree/ UG Degree/ Three years College Diploma with affiliated to State Technical Board in Computer Science or Computer related field</p>\n<p><strong>Experience:</strong> 3 to 7 years</p>\n<p><strong>Skills:</strong> C#, API, DotNET core, SQL, DotNet</p>\n<p><strong>Location:</strong> Trivandrum</p>",
        "tags": [
            "3-7 Years",
            "C#",
            ".NET Core",
            "SQL"
        ],
        "summary": "Fakeeh Technologies is seeking a .Net Developer with 3-7 years of experience. Key skills include C#, .NET Core, and SQL, located in Trivandrum."
    },
    {
        "job_title": "PostgreSQL",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/22711",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>PostgreSQL Expertise at Fakeeh Technologies</h2>\n<p><strong>Fakeeh Technologies (P) Ltd</strong> is seeking a skilled professional with strong hands-on experience in PostgreSQL database administration and development.</p>\n<p><strong>Location:</strong> Carnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581</p>\n<p><strong>Website:</strong> <a href=\"https://www.fakeeh.tech\">https://www.fakeeh.tech</a></p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>PostgreSQL database administration and development.</li>\n<li>Oracle to PostgreSQL migration, including:</li>\n<li>Schema conversion (tables, views, packages, procedures, functions)</li>\n<li>Data type mapping and transformation</li>\n<li>Performance tuning and optimization post-migration</li>\n<li>Writing and optimizing PL/pgSQL procedures</li>\n<li>Knowledge of foreign data wrappers (FDW) and PostgreSQL-specific features</li>\n<li>Understanding of data validation techniques post-migration</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience in Oracle to PostgreSQL migration</li>\n<li>Strong hands-on experience in PostgreSQL database</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@fakeeh.tech</li>\n</ul>\n<p><strong>Closing Date:</strong> 31, Aug 2025</p>\n<p><strong>Job Published:</strong> 12, Aug 2025</p>",
        "tags": [
            "3+ Years",
            "PostgreSQL",
            "Oracle Migration",
            "PL/pgSQL",
            "Database Administration"
        ],
        "summary": "We are looking for a PostgreSQL expert to help with database administration and development. The role involves Oracle to PostgreSQL migration, schema conversion, and performance tuning."
    },
    {
        "job_title": "Software security Engineer",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/22710",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Software Security Engineer</h2>\n<p><strong>Fakeeh Technologies (P) Ltd</strong>\nCarnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581\n<a href=\"https://www.fakeeh.tech\">https://www.fakeeh.tech</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025\n<strong>Contact Email:</strong> careers@fakeeh.tech</p>\n<p><strong>Brief Description:</strong></p>\n<p>Analyze and identify security vulnerabilities in source code using both automated and manual static analysis tools and techniques. Train and assist developers in writing secure software and remediating existing vulnerabilities. Discover security vulnerabilities through design review, manual source code review, and follow up on the remediation process using automated tools to find security vulnerabilities in source code and system.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Conduct Secure coding training sessions for developers</li>\n<li>Implement various security control verification and risk detection</li>\n<li>Implement security-related libraries for internal use</li>\n<li>Provide support on application-level security monitoring</li>\n<li>Conduct thorough code and design reviews of high-assurance embedded software searching for potential vulnerabilities that could be exploited using logic (e.g. fuzzing, stack overflows, etc.) and physical means (side-channel, fault injection, etc.)</li>\n<li>Identify the source of any malicious intent, or any weakness leading to access, and information leaks</li>\n<li>Lead the remediation of application vulnerability screening and penetration testing</li>\n<li>Assist the Information Security Manager with all application security tasks</li>\n<li>Good understanding of the whole software development lifecycle, CI/CD tools, cloud, Kubernetes, and various technology stacks</li>\n<li>Familiar with OWASP Top 10</li>\n<li>Experience in mobile application development will be an added advantage</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Familiar with OWASP Top 10</li>\n<li>Experience in mobile application development will be an added advantage</li>\n</ul>",
        "tags": [
            "1+ Years",
            "OWASP",
            "CI/CD",
            "Static Analysis"
        ],
        "summary": "Fakeeh Technologies is seeking a Software Security Engineer to analyze and remediate security vulnerabilities. The role involves secure coding training, risk detection, and application security monitoring."
    },
    {
        "job_title": "Graduate Apprentice (Business Development)",
        "company": "Zoondia Software (P) Ltd",
        "url": "https://technopark.org/job-details/22709",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Graduate Apprentice (Business Development)</h2>\n<p><strong>Zoondia Software (P) Ltd</strong>\nT2, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.zoondia.com\">http://www.zoondia.com</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 12, Aug 2025</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>NATS/NAPS Registration</li>\n<li>Candidates must be ready to work from our Trivandrum office.</li>\n<li>Any graduate can apply.</li>\n<li>Basic communication and willingness to learn required.</li>\n<li>Preferred Immediate Joiners</li>\n</ul>\n<p><strong>Contact Email:</strong> <a href=\"mailto:recruit@zoondia.in\">recruit@zoondia.in</a></p>",
        "tags": [
            "Entry Level",
            "Business Development",
            "Communication Skills",
            "NATS/NAPS"
        ],
        "summary": "Zoondia Software is seeking a Graduate Apprentice for Business Development. This role requires basic communication skills and a willingness to learn, based in Trivandrum."
    },
    {
        "job_title": "Dot Net Developer",
        "company": "Pearlsoft Technologies Llp",
        "url": "https://technopark.org/job-details/22708",
        "location": "Technopark",
        "closing_date": "16 Sep 2025",
        "job_description": "<h2>Backend Engineer (.NET)</h2>\n<p><strong>Location:</strong> Kochi</p>\n<p><strong>Contact:</strong> renjini.r@pearlsofttechnologies.co.in</p>\n<p><strong>About Pearlsoft Technologies:</strong></p>\n<p>Pearlsoft Technologies LLP\nModule No.2, -2 floor,\nThejaswini Building, Phase I,\nTechnopark, Trivandrum, 695581\n<a href=\"https://pearlsofttechnologies.com/\">https://pearlsofttechnologies.com/</a></p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain RESTful Web APIs using ASP.NET Core (C#).</li>\n<li>Build backend logic for core modules including:<ul>\n<li>Replenishment Engine</li>\n<li>Pick &amp; Bulk Workflow Management</li>\n<li>CSV-based data ingestion and business logic</li>\n<li>Messaging, notifications, and real-time updates via SignalR</li>\n</ul>\n</li>\n<li>Work closely with frontend (Blazor), mobile, and data teams to ensure API compatibility and performance.</li>\n<li>Implement security mechanisms: ADFS, SAML-based authentication, RBAC, and token management.</li>\n<li>Ensure API performance, scalability, and fault-tolerance.</li>\n<li>Integrate APIs with CI/CD pipelines using GitLab/Jenkins.</li>\n<li>Write unit and integration tests for critical business components.</li>\n<li>Participate in sprint planning, code reviews, and peer programming sessions.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li>4–6 years of backend development experience, including at least 2 years with ASP.NET Core Web API.</li>\n<li>Strong expertise in:<ul>\n<li>Designing scalable and stateless APIs with .NET 6/7+</li>\n<li>Entity Framework Core, LINQ, and SQL Server for data access</li>\n<li>Real-time communication using SignalR</li>\n<li>Working with structured file inputs (e.g., CSV parsers)</li>\n<li>Understanding of modern API security, performance optimization, and microservices patterns.</li>\n</ul>\n</li>\n<li>Proficiency in:<ul>\n<li>Git, CI/CD, and API versioning strategies.</li>\n<li>Windows AD + ASP.NET Identity</li>\n<li>SignalR (internal)</li>\n<li>SSRS</li>\n<li>Redis (local), Serilog + SQL</li>\n</ul>\n</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>.Net Core</li>\n<li>MVC</li>\n<li>AWS or Azure</li>\n</ul>",
        "tags": [
            "4-6 Years",
            "ASP.NET Core",
            "Entity Framework Core",
            "SignalR"
        ],
        "summary": "Seeking a Backend Engineer to design and maintain RESTful Web APIs using ASP.NET Core. The role involves backend logic development, security implementation, and ensuring API performance and scalability."
    }
]