[
    {
        "job_title": "Manager, Digital Services Sales",
        "company": "Zyxware Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23250",
        "location": "Technopark",
        "closing_date": "19 Oct 2025",
        "job_description": "<h2>Manager, Digital Services Sales</h2>\n<p>Zyxware Technologies is seeking a Sales Manager to join our Sales team. The primary goal is to generate revenue from assigned geographies by identifying potential new customers, presenting the company's brand, and building long-term client relationships.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute sales strategies to achieve target revenue and margins.</li>\n<li>Responsible for sales planning and accurate forecasting.</li>\n<li>Determine clients' needs through a consultative selling approach.</li>\n<li>Manage the sales pipeline with qualified leads and prospects.</li>\n<li>Present the organization's values, commitments, and capabilities to clients and at events.</li>\n<li>Manage revenue booking and collections and maintain reports.</li>\n<li>Manage escalations from client accounts.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li>A graduate degree in engineering or computer science, coupled with an MBA, would be preferred. Graduate degrees in other fields are accepted if there is a demonstrated interest in technology</li>\n<li>Familiarity with frameworks and tools for understanding markets and international trade.</li>\n<li>Ability to construct value chains and define industry structure.</li>\n<li>Experience developing and executing a sales plan.</li>\n<li>Experience designing and executing a sales process for mid-sized and large enterprises.</li>\n<li>Experience partnering with HR to build a sales team.</li>\n<li>Consistent track record of revenue generation and risk management.</li>\n<li>Experience handling B2B clients from US/Europe/UK/ME/APAC regions.</li>\n<li>Knowledge of Google Workspace / MS Office, CRM, and Bid Management.</li>\n<li>Strong communication &amp; presentation skills.</li>\n<li>Prior experience in dealing with decision makers in the services sector.</li>\n<li>US Business Visa preferred.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>5+ years of relevant international sales experience in IT or Digital Services</li>\n</ul>\n<p><strong>Location:</strong></p>\n<ul>\n<li>Technopark, Trivandrum</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If you meet the above requirements, please mail in your resume with the subject ‘Application for the post of Manager, Digital Services Sales - MS30092402' to careers@zyxware.com.</p>\n<p><strong>Company Information:</strong></p>\n<p>Zyxware Technologies (P) Ltd\nSBC 2205, II Floor, Yamuna Building, Technopark Phase III, Trivandrum, 695583\nhttp://www.zyxware.com</p>",
        "tags": [
            "5+ Years",
            "B2B Sales",
            "CRM",
            "Digital Services"
        ],
        "summary": "Seeking a Sales Manager to generate revenue by developing client relationships in assigned geographies. Requires 5+ years of international IT sales experience and strong communication skills."
    },
    {
        "job_title": "Product Operations Executive - Digital Health SaaS",
        "company": "Needstreet Web Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23249",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Product Operations Executive - Digital Health SaaS</h2>\n<p><strong>NeedStreet Web Technologies (P) Ltd</strong>\nPadmanabham, Technopark, Trivandrum, 695581\nhttp://www.continuouscare.io</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 04, Sept 2025\n<strong>Contact Email:</strong> jobs@needstreet.com</p>\n<p>We are seeking a customer-focused Product Operations Executive to bridge our healthcare clients and technical teams. You will provide expert support for our B2B digital health platform, manage technical setups, and ensure seamless customer experiences.</p>\n<p><strong>Core Responsibilities:</strong></p>\n<ul>\n<li><strong>Product Support:</strong> Handle inquiries on product features, issue investigation, and resolution, collaborating with other teams as needed.</li>\n<li><strong>Customer Onboarding:</strong> Support customers in setting up their preferred product configurations, including white-labeling and configuring their 3rd party service accounts.</li>\n<li><strong>Customer Success:</strong> Help customers derive the best value from product features by engaging and educating them on optimal product usage.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Strong technical aptitude with web and mobile apps, embracing technology for efficient workflows.</li>\n<li>Exceptional communication skills for both customers and technical teams.</li>\n<li>Demonstrates initiative, ownership mentality, and analytical problem-solving abilities.</li>\n<li>Process-oriented thinker who optimizes workflows for maximum efficiency.</li>\n<li>Knowledge steward who actively maintains and updates team documentation and knowledge bases.</li>\n<li>Customer value champion who leverages interactions to help clients maximize product ROI.</li>\n<li>Balances customer advocacy with organizational priorities.</li>\n<li>Understands healthcare technology environments, security, and compliance considerations.</li>\n<li>Previous experience supporting a SaaS product.</li>\n<li>1-3 years experience in product support for technology platforms.</li>\n<li>Qualification in any field is acceptable, provided the above requirements are met.</li>\n<li>Must be willing to work in hybrid mode (i.e., at the office).</li>\n</ul>\n<p>This role offers the opportunity to make a significant impact at the intersection of healthcare and technology, working with a collaborative team focused on delivering exceptional client experiences.</p>",
        "tags": [
            "1-3 Years",
            "SaaS",
            "Customer Support",
            "Product Support"
        ],
        "summary": "Seeking a Product Operations Executive to support a digital health platform. The role involves customer onboarding, support, and ensuring customer success with the SaaS product."
    },
    {
        "job_title": "Telesales Executive(immediate)",
        "company": "Azinova Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/23248",
        "location": "Technopark",
        "closing_date": "10 Sep 2025",
        "job_description": "<h2>Telesales Executive (Immediate)</h2>\n<p><strong>Azinova Technologies (P) Ltd</strong> is looking for smart, energetic, and confident individuals with excellent English communication skills to join our telesales team. If you are passionate about interacting with people, building relationships, and kickstarting your career in sales, this is the right opportunity for you!</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> 06 Sept 2025 - 10 Sept 2025\n*   <strong>Time:</strong> 11:00:00 - 12:00:00\n*   <strong>Venue:</strong> Azinova Technologies, Basement Floor-2, Thejaswini, C-14B, Technopark Rd, Technopark Campus, Thiruvananthapuram, Kerala 695581</p>\n<p><strong>Key Responsibilities:</strong>\n- Make outbound calls to potential customers and introduce company products/services.\n- Communicate effectively in English and build rapport with prospects.\n- Understand customer needs and provide the right solutions.\n- Maintain accurate records of calls and customer details.\n- Work towards achieving daily and monthly sales targets.\n- Collaborate with the team to improve sales performance.</p>\n<p><strong>Preferred Skills:</strong>\n- Freshers and recent graduates are welcome.\n- Must have good spoken English skills (fluency, clarity, and confidence).\n- Smart, positive, and eager to learn.\n- Goal-oriented with strong interpersonal skills.\n- Basic computer knowledge (MS Office/Excel) preferred.</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser.\nOnce the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.\nCandidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p>Mobile App:\n*   <a href=\"https://azinovatechnologies.com\">Click here to download the Mobile App for Android</a>\n*   <a href=\"https://azinovatechnologies.com\">Click here to download the Mobile App for iOS</a></p>\n<p>Website URL:\n*   <a href=\"https://vms.technopark.org\">vms.technopark.org</a>\n*   <a href=\"https://azinovatechnologies.com\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong>\n*   <strong>Email:</strong> careers@azinova.info\n*   <strong>Website:</strong> http://www.azinovatechnologies.com\n*   <strong>Address:</strong> C-14b, Basement Floor 2, Thejaswini, Technopark, Trivandrum, 695581</p>",
        "tags": [
            "Freshers",
            "Telesales",
            "Communication Skills",
            "English Fluency"
        ],
        "summary": "Azinova Technologies is hiring energetic Telesales Executives with excellent English skills. Fresh graduates are welcome to apply and build a sales career."
    },
    {
        "job_title": "Sales Engineer-AI | 0-3 Years",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23246",
        "location": "Technopark",
        "closing_date": "18 Oct 2025",
        "job_description": "<h2>AI Sales Engineer</h2>\n<p><strong>Reizend (P) Ltd</strong> is seeking a motivated AI Sales Engineer to drive the marketing initiatives for our AI products and services and contribute to business growth.</p>\n<p><strong>Contact:</strong> careers@reizend.ai</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and implement a strategic sales plan to achieve company sales targets and objectives.</li>\n<li>Identify new opportunities and potential clients, actively prospecting and generating leads.</li>\n<li>Build and maintain strong relationships with key clients, understanding their needs and providing tailored solutions to meet their requirements.</li>\n<li>Develop, execute, and monitor marketing programs for our AI products and services across a variety of channels in line with the GTM strategy derived.</li>\n<li>Research the market, analyze trends, and provide advice on defining the organization's marketing strategy to effectively reach the target market.</li>\n<li>Collaborate with internal teams, including product and sales, to develop and monitor strategic marketing initiatives.</li>\n<li>Analyze and report on the performance and efficiency of marketing campaigns.</li>\n<li>Create marketing materials, such as sales and product collateral, while ensuring brand guidelines are met.</li>\n<li>Work with external agencies and vendors to execute marketing programs.</li>\n<li>Write, proofread, and edit creative and technical content across different mediums to support marketing initiatives.</li>\n<li>Provide expert advice on branding, positioning, communications, and other marketing issues.</li>\n<li>Give direction to marketing efforts, utilizing the most effective methods and tools.</li>\n<li>Stay updated on emerging trends and share best practices, fostering knowledge and insights.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Excellent Academics.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>B.Tech in Non-IT disciplines, OR Bachelor’s/Master’s in Mathematics/Statistics, OR Technical degree with MBA</li>\n</ul>\n<p><strong>Experience Required:</strong></p>\n<ul>\n<li>0-3 years</li>\n</ul>\n<p><strong>Compensation:</strong></p>\n<ul>\n<li>6–11 LPA (Competitive fixed salary &amp; Attractive performance-based incentives &amp; ESOPs)</li>\n</ul>\n<p><strong>Location:</strong></p>\n<ul>\n<li>SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum , 695581</li>\n</ul>\n<p><strong>Website:</strong></p>\n<ul>\n<li>http://www.reizendretail.in</li>\n</ul>\n<p><strong>Closing Date:</strong></p>\n<ul>\n<li>18, Oct 2025</li>\n</ul>\n<p><strong>Job Published:</strong></p>\n<ul>\n<li>03, Sept 2025</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "Sales",
            "Marketing",
            "AI"
        ],
        "summary": "Reizend is seeking an AI Sales Engineer to market AI products, achieve sales targets, and drive business growth. The role involves strategic planning, client relationship management, and marketing program execution."
    }
]