[
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21434/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p>We are seeking a high-performing, self-driven <strong>Senior Business Development Executive</strong> to join <strong>2Base Technologies</strong>. In this individual contributor role, you will drive revenue by generating leads, building client relationships, and managing the full sales cycle for IT services and digital solutions. If you thrive in consultative sales and technology-driven business growth, this opportunity is for you.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Identify qualified leads via outbound channels, referrals, and market research.</li>\n<li>Drive opportunities for web, mobile, and enterprise software development services.</li>\n<li>Own the sales process from lead qualification to closure, including client communication, requirement analysis, proposal preparation, pricing, and negotiation.</li>\n<li>Propose tailored IT/digital transformation solutions aligned with client objectives.</li>\n<li>Build relationships with Founders, CXOs, and Product Owners.</li>\n<li>Collaborate with delivery, design, and marketing teams to create compelling proposals.</li>\n<li>Maintain CRM records and provide sales forecasts/reports.</li>\n<li>Represent the company at networking events and client meetings.</li>\n<li>Meet/exceed monthly/quarterly revenue targets.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor’s degree or equivalent in education/experience.</li>\n<li><strong>2 - 5 years</strong> in B2B sales (IT/digital solutions preferred).</li>\n<li>Proven ability to manage sales pipelines and close deals independently.</li>\n<li>Strong knowledge of software development services (web/mobile apps, SaaS, enterprise solutions).</li>\n<li>Experience with international clients preferred.</li>\n<li>Proficiency in CRM tools (Zoho, HubSpot, Salesforce) and outbound sales tools (LinkedIn Sales Navigator).</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to work autonomously with ownership of sales targets.</li>\n<li>Strategic thinking to address client pain points and position solutions.</li>\n</ul>\n<h3>Education &amp; Certifications</h3>\n<ul>\n<li><strong>2 - 5 years</strong> of sales/business development experience.</li>\n<li>Bachelor’s degree in IT/CS/BCA/B-Tech/CS/EC, MBA, or CS/IT diploma.</li>\n<li>Certifications in sales, digital marketing, or business consulting are a plus.</li>\n</ul>\n<p><strong>Apply now</strong>: Share your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2 - 5 Years",
            "IT Services",
            "Digital Solutions",
            "CRM Systems"
        ],
        "summary": "Senior Business Development Executive needed for 2Base Technologies to drive IT/digital sales. Requires 2-5 years in B2B sales with CRM and tech solution expertise."
    },
    {
        "job_title": "Project Manager",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21435/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Project Manager</h2>\n<p><strong>Company:</strong> 2Base Technologies</p>\n<p>We are seeking a dynamic and detail-oriented <strong>Project Manager</strong> to join our team. In this role, you will oversee the planning, execution, and delivery of projects while ensuring seamless coordination between teams and stakeholders. If you have a passion for technology, strong organizational skills, and the ability to manage multiple projects effectively, we’d love to hear from you!</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and manage project plans, including timelines, budgets, and resource allocations.</li>\n<li>Define project scope, objectives, and deliverables in collaboration with stakeholders.</li>\n<li>Ensure projects are delivered on time, within scope, and within budget while adhering to company policies and quality standards.</li>\n<li>Identify and manage project risks, issues, and dependencies, implementing mitigation strategies as needed.</li>\n<li>Facilitate and document project meetings (kick-off, status updates, post-project evaluations) and track follow-ups.</li>\n<li>Communicate project progress, challenges, and updates to stakeholders, maintaining relationships with customers, vendors, and partners.</li>\n<li>Mentor and oversee team members, ensuring professional growth and on-the-job delivery.</li>\n<li>Govern development, design, integration, and testing activities, enforcing best practices.</li>\n<li>Evaluate and optimize workflows, recommending process improvements for efficiency.</li>\n<li>Coordinate cross-functional collaboration for seamless project integration.</li>\n</ul>\n<h3>Job Requirements</h3>\n<ul>\n<li><strong>Bachelor’s degree</strong> in IT, Computer Science, Electronics, or a related technical field, or equivalent education/experience.</li>\n<li><strong>4–8 years</strong> of experience managing IT projects.</li>\n<li>Strong verbal and written communication skills.</li>\n<li>Proven experience with <strong>Agile software development teams</strong>.</li>\n<li>Excellent organizational and time management skills.</li>\n<li>Ability to work independently with minimal supervision.</li>\n<li>Strong problem-solving skills with a data-driven approach.</li>\n<li><strong>PMP Certification</strong> or equivalent is an added advantage.</li>\n<li>Experience managing <strong>web and mobile application projects</strong>.</li>\n<li>Proficiency with <strong>Jira</strong>, time-tracking tools, or Agile planning software.</li>\n<li>Exposure to cross-functional or international teams.</li>\n<li>Experience proofreading/editing technical documentation.</li>\n<li>Ability to quickly learn new software and technologies.</li>\n</ul>\n<h3>Contact</h3>\n<p>For inquiries, email your resume to <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4–8 Years",
            "Agile",
            "Jira",
            "Project Management"
        ],
        "summary": "Project Manager at 2Base Technologies manages IT projects, coordinates teams, and ensures delivery. Requires 4–8 years experience and Agile/Jira skills."
    },
    {
        "job_title": "AI Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21436/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>AI Engineer</h2>\n<p>We are seeking a talented and passionate <strong>AI Engineer</strong> to join our team. The role involves designing, developing, and deploying AI models and algorithms to solve complex problems and drive business value. The ideal candidate will have a strong background in machine learning, deep learning, and data science, along with excellent programming skills.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and implement AI models and algorithms to solve real-world problems.</li>\n<li>Collaborate with cross-functional teams to translate business requirements into technical solutions.</li>\n<li>Conduct data analysis and preprocessing for high-quality AI model inputs.</li>\n<li>Train, test, and validate AI models to ensure accuracy and performance.</li>\n<li>Deploy models into production environments and monitor their performance.</li>\n<li>Continuously improve models by incorporating new data and feedback.</li>\n<li>Stay updated on advancements in AI and machine learning technologies.</li>\n<li>Document models, processes, and results for knowledge sharing.</li>\n<li>Participate in code reviews and provide constructive feedback.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Proven experience as an AI Engineer, Machine Learning Engineer, or similar role.</li>\n<li>Strong understanding of machine learning algorithms, deep learning frameworks, and statistical methods.</li>\n<li>Experience with <strong>LLMs</strong> (GPT-4, Llama-2) and <strong>NLP/RAG</strong> (Retrieval-Augmented Generation).</li>\n<li>Proficiency in <strong>Python, R, or Java</strong>.</li>\n<li>Experience with <strong>TensorFlow, Keras, PyTorch, or Scikit-learn</strong>.</li>\n<li>Familiarity with data preprocessing, feature engineering, and visualization.</li>\n<li>Knowledge of <strong>vector databases</strong> (Pinecone, ChromaDB).</li>\n<li>Cloud platform experience (AWS, Google Cloud, Azure).</li>\n<li>Git version control proficiency.</li>\n<li>Strong problem-solving and communication skills.</li>\n</ul>\n<h3>Education &amp; Experience:</h3>\n<ul>\n<li><strong>2-6 Years</strong> of experience.</li>\n<li>Bachelor's or Master's degree in computer science, AI, ML, or a related field.</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Growth-driven environment with opportunities to lead, innovate, and upskill.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-6 Years",
            "LLMs (GPT-4, Llama-2)",
            "NLP & RAG",
            "TensorFlow/PyTorch"
        ],
        "summary": "Design and deploy AI models to solve complex problems. Requires ML/DL expertise and 2-6 years of AI engineering experience."
    },
    {
        "job_title": "Sr.DevSecOps",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21437/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Senior DevSecOps Engineer</h2>\n<p>We are seeking a <strong>Senior DevSecOps Engineer</strong> to lead our cybersecurity, infrastructure automation, and DevSecOps practices as we transition to a secure, scalable, and modern engineering environment. This role will strengthen 2Base’s security posture, modernize pipelines, and foster a secure-by-design culture. You will collaborate with engineering, product, and leadership teams to ensure systems, applications, and cloud environments are secure, reliable, and future-ready.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define, implement, and enforce security standards, policies, and best practices across cloud and on-prem environments.</li>\n<li>Conduct security risk assessments, vulnerability scans, penetration testing, and execute mitigation plans.</li>\n<li>Architect and enhance secure CI/CD pipelines with automated compliance and governance checkpoints.</li>\n<li>Promote a \"Security First\" culture across engineering, ensuring secure design and development practices.</li>\n<li>Monitor, detect, investigate, and respond to security threats, incidents, breaches, and anomalies.</li>\n<li>Develop Infrastructure-as-Code practices using Terraform, Ansible, and automation frameworks.</li>\n<li>Design secure cloud architectures on AWS, Azure, or GCP for scalable, compliant deployments.</li>\n<li>Build and secure containerized environments with Docker and Kubernetes using enforced security baselines.</li>\n<li>Implement secure monitoring, logging, SIEM, and alerting systems for infrastructure and applications.</li>\n<li>Improve system reliability, scalability, performance, and fault tolerance across critical workloads.</li>\n<li>Mentor DevOps engineers in secure development, automation, and operational excellence.</li>\n<li>Lead technical strategy, tool selection, process improvements, and DevSecOps roadmap execution.</li>\n<li>Collaborate with BA, PM, and Engineering teams to align security, performance, and delivery goals.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>4–8 years</strong> of experience in DevOps, Cloud, or Infrastructure engineering with security exposure.</li>\n<li>Hands-on experience with CI/CD tools (Jenkins, GitLab CI, GitHub Actions).</li>\n<li>Strong expertise in AWS, Azure, or GCP with secure architecture focus.</li>\n<li>Proficiency in Infrastructure-as-Code (Terraform, Ansible).</li>\n<li>Experience securing Docker and Kubernetes environments.</li>\n<li>Knowledge of networking technologies (LAN/WAN, firewalls, VPN, load balancers).</li>\n<li>Familiarity with security frameworks (OWASP, NIST, CIS Benchmarks).</li>\n<li>Experience with monitoring tools (Prometheus, Grafana, ELK, CloudWatch, SIEM).</li>\n<li>Strong scripting skills (Python, Bash, Shell).</li>\n<li>Excellent troubleshooting, analytical, and problem-solving abilities.</li>\n<li>Strong communication and collaboration skills to influence engineering teams.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Diploma/B.Tech/MCA in IT, CS, or related fields.</li>\n<li>Experience in SOC operations or SIEM/SOAR tools.</li>\n<li>Certifications: AWS Security/DevOps Engineer – Professional, CKS, CEH, CompTIA Security+.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Growth-driven environment with opportunities to lead, innovate, and upskill.</li>\n</ul>\n<p><strong>Contact:</strong> For inquiries, email your resume to <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4–8 Years",
            "Terraform",
            "Ansible",
            "AWS"
        ],
        "summary": "Lead cybersecurity and DevSecOps practices, architect secure cloud infrastructure, and mentor teams to ensure secure-by-design systems. Requires 4–8 years of experience in secure DevOps and cloud platforms."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21438/312",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Senior Business Analyst</h2>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.</li>\n<li>Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.</li>\n<li>Convert ambiguous client inputs into structured, logical, and actionable functional understanding.</li>\n<li>Break large features into modules, workflows, components, and clear dependencies.</li>\n<li>Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.</li>\n<li>Translate business processes into functional logic that development teams can execute.</li>\n<li>Decompose requirements into use-case flows, system behaviours, edge cases, alternate paths, validation rules, and dependencies.</li>\n<li>Prepare high-quality documentation, including BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API requirement specs, and acceptance criteria.</li>\n<li>Ensure all documentation is clear, logical, structured, testable, and ready for developers and QA to use.</li>\n<li>Collaborate closely with developers, architects, QA, and product owners to validate feasibility and align understanding.</li>\n<li>Ensure QA teams can derive test cases effectively from your functional logic and acceptance criteria.</li>\n<li>Communicate confidently with clients, handle requirement discussions smoothly, and clarify misunderstandings immediately.</li>\n<li>Push back politely on unclear or changing requirements and ensure final decisions are documented properly.</li>\n<li>Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover to development.</li>\n<li>Own the entire requirement lifecycle from discovery to development readiness with high accountability.</li>\n<li>Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Minimum 4+ years</strong> of core Business Analyst experience with strong analytical and system-level thinking.</li>\n<li>Ability to break down complex requirements into clear components, workflows, and functional logic.</li>\n<li>Excellent verbal and written communication with confidence in client interactions and clarifications.</li>\n<li>Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria with high clarity.</li>\n<li>Ability to challenge assumptions politely, ask the right questions, and ensure zero ambiguity.</li>\n<li>Strong collaboration experience with development, QA, architects, and cross-functional teams.</li>\n<li>Understanding of API behaviours, integrations, data flows, and multi-module system interactions.</li>\n<li>Ability to run requirement discussions, workshops, and independently lead discovery sessions.</li>\n<li>Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.</li>\n<li>Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.</li>\n<li>Not suitable for UI-only thinkers, passive communicators, template-based writers, or those relying on AI for answers.</li>\n<li>Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.</li>\n<li>Candidates must align with 2Base’s structured thinking, clarity-driven culture, and transformation of the BA function.</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, Business, or related field</li>\n<li>4 to 8 years of experience as a Business Analyst or Product Analyst</li>\n<li>Experience in SaaS or scalable product environments</li>\n<li>Exposure to AI/Automation, integrations, or multi-module systems</li>\n<li>Ability to run independent client workshops</li>\n<li>Must have independently handled requirement ownership for at least one full project lifecycle</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "SaaS",
            "API",
            "BRD/FRD/SRS"
        ],
        "summary": "Senior Business Analyst translates complex business needs into structured requirements, collaborating with cross-functional teams to ensure clear, testable documentation and seamless development execution."
    },
    {
        "job_title": "Digital Marketing Executive (04 to 06 Years)",
        "company": "Verteil Technologies Private Limited,",
        "url": "https://infopark.in/company-jobs/details/21453/265",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Digital Marketing Executive (4-6 Years)</h2>\n<p>We are seeking a proactive and performance-oriented Digital Marketing Executive to plan, execute, and optimize digital marketing initiatives across SEO coordination, social media, email &amp; WhatsApp marketing, newsletters, and paid advertising. The role requires close coordination with external vendors and internal stakeholders to strengthen online presence, drive user acquisition, and improve engagement across digital channels.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>SEO Vendor Coordination</strong></li>\n<li>Coordinate with external SEO vendors managing search engine optimization, backlinks, and online visibility initiatives.</li>\n<li>Evaluate and negotiate SEO proposals and support management in go/no-go decisions.</li>\n<li>Conduct weekly coordination meetings to track progress against defined objectives.</li>\n<li>\n<p>Prepare and present monthly performance reports covering traffic, rankings, and key SEO metrics.</p>\n</li>\n<li>\n<p><strong>Social Media Marketing</strong></p>\n</li>\n<li>Manage and grow social media presence across Facebook, Instagram, and YouTube.</li>\n<li>Plan and publish content related to:<ul>\n<li>Brand presence and positioning</li>\n<li>Product or service updates</li>\n<li>News, announcements, and campaigns</li>\n<li>Value propositions and comparisons</li>\n</ul>\n</li>\n<li>Coordinate with designers and content teams to ensure timely and consistent posting.</li>\n<li>\n<p>Monitor engagement, comments, and messages to support audience interaction.</p>\n</li>\n<li>\n<p><strong>Newsletters, Updates &amp; Communications</strong></p>\n</li>\n<li>Plan and execute regular newsletters and email communications for customers and prospects.</li>\n<li>Coordinate with internal stakeholders to gather information for product updates, announcements, and releases.</li>\n<li>\n<p>Ensure clarity, accuracy, and consistency in all outbound communications.</p>\n</li>\n<li>\n<p><strong>Email &amp; WhatsApp Marketing</strong></p>\n</li>\n<li>Execute email and WhatsApp marketing campaigns for lead nurturing, re-engagement, and conversions.</li>\n<li>Manage campaign execution while ensuring email domain health and sender reputation are maintained.</li>\n<li>Develop and test different outreach strategies to improve reach, engagement, and conversion rates.</li>\n<li>\n<p>Maintain and segment databases for effective targeting.</p>\n</li>\n<li>\n<p><strong>Paid Advertising (Performance Marketing)</strong></p>\n</li>\n<li>Plan, execute, and optimize paid advertising campaigns on Google and Meta platforms.</li>\n<li>Manage and optimize marketing budgets to drive high-quality leads and conversions.</li>\n<li>Track campaign performance, analyze results, and continuously improve ROI.</li>\n</ol>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Solid understanding of digital marketing fundamentals (SEO, social media, email marketing, paid ads).</li>\n<li>Experience working with external vendors and cross-functional internal teams.</li>\n<li>Hands-on experience with ad platforms, email marketing tools, and analytics dashboards.</li>\n<li>Strong analytical skills with the ability to interpret data and generate actionable insights.</li>\n<li>Excellent communication and coordination skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>B.Tech, BCA/MCA, B.Sc/M.Sc Computer Science.</li>\n<li>Experience in B2B, B2C, or SaaS marketing environments.</li>\n<li>Familiarity with CRM systems and marketing automation tools.</li>\n<li>Ability to manage multiple campaigns and deadlines simultaneously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>ta@verteil.com</strong>.</p>",
        "tags": [
            "4-6 Years",
            "SEO",
            "Social Media Marketing",
            "Paid Advertising"
        ],
        "summary": "Digital Marketing Executive required to coordinate SEO, social media, and paid campaigns. Must have 4-6 years experience in digital marketing and vendor management."
    },
    {
        "job_title": "Technical Consultant- Microsoft Dynamics Business Central",
        "company": "Woxro",
        "url": "https://infopark.in/company-jobs/details/21439/399",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Responsibilities</h2>\n<ul>\n<li>Implement and configure Microsoft Dynamics NAV/ Business Central solutions.</li>\n<li>Collaborate with clients to gather business requirements and define project scope.</li>\n<li>Develop customizations and integrations with other systems.</li>\n<li>Provide technical support and troubleshooting for Dynamics NAV/ Business Central.</li>\n<li>Conduct system testing and user training sessions.</li>\n<li>Prepare technical documentation and user manuals.</li>\n<li>Stay current with system updates and new features.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, or related field.</li>\n<li>Proven experience with Microsoft Dynamics NAV/ Business Central.</li>\n<li>Strong understanding of ERP systems and their business applications.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and interpersonal skills.</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Microsoft Dynamics Business Central</li>\n<li>SQL</li>\n<li>C/AL</li>\n<li>AL Language</li>\n<li>Power BI</li>\n<li>Azure</li>\n<li>Integration Services</li>\n<li>Technical Support</li>\n<li>ERP Configuration</li>\n</ul>\n<h2>Contact</h2>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>jobs@woxro.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Microsoft Dynamics Business Central",
            "SQL",
            "AL Language"
        ],
        "summary": "Technical Consultant for Microsoft Dynamics Business Central, implementing solutions, collaborating with clients, and providing technical support. Requires expertise in ERP systems and strong problem-solving skills."
    },
    {
        "job_title": "Full Stack Developer (Next.js & Node.js)",
        "company": "Woxro",
        "url": "https://infopark.in/company-jobs/details/21440/399",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Full Stack Developer (Next.js &amp; Node.js)</h2>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and maintain full-stack web applications using <strong>Next.js</strong> and <strong>Node.js</strong></li>\n<li>Build responsive and SEO-friendly user interfaces with <strong>React / Next.js</strong></li>\n<li>Create and maintain backend services and APIs using <strong>Node.js</strong></li>\n<li>Work with <strong>Payload CMS</strong> for content management (training/support provided if needed)</li>\n<li>Integrate databases and manage schemas in <strong>Payload CMS</strong></li>\n<li>Implement authentication, authorization, and security best practices</li>\n<li>Optimize application performance, scalability, and reliability</li>\n<li>Collaborate with designers, product managers, and cross-functional teams</li>\n<li>Participate in code reviews and technical discussions</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Strong experience with <strong>Next.js</strong> and <strong>React</strong></li>\n<li>Proficiency in <strong>Node.js</strong> and backend frameworks (Express, NestJS, etc.)</li>\n<li>Solid understanding of <strong>JavaScript (ES6+)</strong> or <strong>TypeScript</strong></li>\n<li>Experience with <strong>RESTful API</strong> development</li>\n<li>Familiarity with relational or NoSQL databases</li>\n<li>Experience using <strong>Git</strong> and version control systems</li>\n<li>Good understanding of web fundamentals (<strong>HTML, CSS, HTTP</strong>)</li>\n<li>Willingness to learn and work with <strong>Payload CMS</strong></li>\n<li>Prior experience with headless CMS platforms (<strong>Payload, Strapi, Sanity</strong>, etc.)</li>\n<li>Experience with <strong>TypeScript</strong> across frontend and backend</li>\n<li>Knowledge of <strong>SSR, SSG, and ISR</strong> in Next.js</li>\n<li>Familiarity with authentication tools (<strong>JWT, OAuth, NextAuth</strong>)</li>\n<li>Experience with testing frameworks and <strong>CI/CD pipelines</strong></li>\n<li>Exposure to cloud platforms (<strong>Vercel, AWS</strong>, etc.)</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at jobs@woxro.com if this opportunity aligns with your career goals.</p>",
        "tags": [
            "3-5 Years",
            "Next.js",
            "Node.js",
            "TypeScript"
        ],
        "summary": "Full Stack Developer role requiring Next.js/Node.js expertise, Payload CMS integration, and collaboration across teams. Focus on building scalable web apps with modern tech stacks."
    },
    {
        "job_title": "Intern - React Frontend (With UI/UX basics)",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/21448/296",
        "location": "Infopark",
        "closing_date": "02 Jan 2026",
        "job_description": "<h2>Intern - React Frontend (With UI/UX basics)</h2>\n<p><strong>Location:</strong> Infopark, Kakkanad\n<strong>Mode:</strong> Full-time (Office)</p>\n<h3>About the Role:</h3>\n<p>We are seeking a React Front-End Intern with foundational knowledge of web development and UI/UX principles. You will gain hands-on experience by supporting the team in building responsive web pages and implementing simple features.</p>\n<h3>Skills Required:</h3>\n<ul>\n<li>Basic understanding of <strong>React.js</strong></li>\n<li>Proficiency in <strong>HTML, CSS, and JavaScript</strong></li>\n<li>Good grasp of <strong>UI/UX</strong> concepts and tools like <strong>Figma/Adobe XD</strong></li>\n<li>Willingness to learn and collaborate in a team</li>\n<li>Basic understanding of <strong>Git</strong> (added advantage)</li>\n<li>Knowledge of <strong>REST APIs</strong> (added advantage)</li>\n</ul>\n<h3>Who Can Apply:</h3>\n<p>Freshers — only 2025, 2024, and 2023 passouts</p>\n<p><strong>Contact:</strong> Share your updated resume at <a href=\"mailto:careers@grapelime.in\">careers@grapelime.in</a></p>",
        "tags": [
            "Freshers",
            "React.js",
            "HTML/CSS/JavaScript",
            "UI/UX & Figma/Adobe XD"
        ],
        "summary": "A React Frontend Intern role for freshers to support web development with UI/UX basics, requiring React, HTML/CSS/JS, and Figma/Adobe XD skills."
    },
    {
        "job_title": "Freelance (HTML 5) Frontend Developer Female Only",
        "company": "Pueblo Shades Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21447/409",
        "location": "Infopark",
        "closing_date": "07 Jan 2026",
        "job_description": "<p><strong>Job Title:</strong> Freelance (HTML 5) Frontend Developer (Female Only)\n<strong>Job Type:</strong> Freelance\n<strong>Work Mode:</strong> Remote\n<strong>Project-Based Engagement</strong></p>\n<p>We are seeking a skilled <strong>Freelance Frontend Developer (HTML 5)</strong> to build modern, responsive websites and web applications. The ideal candidate must possess a strong design sensibility, performance expertise, and user experience focus to translate UI/UX designs into clean, functional code.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop responsive, user-friendly web interfaces</li>\n<li>Convert Figma/Adobe XD/UI designs into pixel-perfect frontend code</li>\n<li>Ensure cross-browser and cross-device compatibility</li>\n<li>Optimize websites for speed, performance, and SEO</li>\n<li>Integrate frontend with backend APIs</li>\n<li>Fix UI bugs and enhance existing frontend components</li>\n<li>Collaborate remotely with designers and backend developers</li>\n<li>Deliver tasks within agreed timelines</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong knowledge of <strong>HTML5</strong>, <strong>CSS3</strong>, and <strong>JavaScript</strong></li>\n<li>Experience with <strong>Bootstrap</strong></li>\n<li>WordPress frontend customization (optional but a plus)</li>\n<li>Understanding of responsive design and UI/UX principles</li>\n<li>Familiarity with <strong>Git/version control</strong></li>\n<li>Ability to work independently as a freelancer</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Prior freelance or project-based experience</li>\n<li>SEO-friendly frontend development understanding</li>\n<li>Experience with e-commerce or business websites</li>\n<li>Ability to suggest UI/UX improvements</li>\n</ul>\n<h3>Payment &amp; Engagement</h3>\n<ul>\n<li><strong>Payment:</strong> Per project</li>\n<li>Long-term collaboration opportunities for consistent performers</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates should send their resumes to <strong>hr@puebloshades.com</strong> with the subject line <strong>“Html developer”</strong>.</p>\n<p><strong>Contact:</strong>\n- Phone: 8075245591\n- Email: hr@puebloshades.com</p>\n<p><em>Pueblo Shades Pvt Ltd</em></p>",
        "tags": [
            "2-4 Years",
            "HTML5",
            "CSS3",
            "JavaScript"
        ],
        "summary": "A freelance HTML5 frontend developer role for creating responsive, SEO-optimized web interfaces. Requires 2-4 years of experience with HTML5, CSS3, and JavaScript."
    },
    {
        "job_title": "Supply Chain Intern",
        "company": "Dynamed Healthcare Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21441/132",
        "location": "Infopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Supply Chain Intern</h2>\n<p>📢 <strong>Hiring: Supply Chain Intern (3 Months)</strong></p>\n<p>We are seeking enthusiastic and dedicated candidates to join our Supply Chain team for a 3-month <strong>unpaid internship</strong>. This role provides hands-on exposure to:</p>\n<ul>\n<li>Supply chain operations</li>\n<li>Coordination activities</li>\n<li>Real-time business processes</li>\n</ul>\n<p><strong>Ideal for freshers or students</strong> looking to gain practical experience in a dynamic environment.</p>\n<h3>Duration</h3>\n<p>3 Months</p>\n<h3>Internship Type</h3>\n<p>Unpaid</p>\n<h3>How to Apply</h3>\n<p>Interested candidates should send their resume to <strong>anoop.rajan@dynamedhealth.com</strong>. If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>anoop.rajan@dynamedhealth.com</strong>.</p>",
        "tags": [
            "No Experience Required",
            "Supply Chain Operations",
            "Coordination",
            "Business Processes"
        ],
        "summary": "A 3-month unpaid Supply Chain Internship offering hands-on experience in operations and coordination. Ideal for freshers seeking exposure to real-time business processes."
    },
    {
        "job_title": "Academic Associate (Operations) - (Preferring Freshers)",
        "company": "TutorComp Infotech (I) Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21443/44",
        "location": "Infopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Job Description</h2>\n<p>We are seeking a dynamic and enthusiastic individual with a strong command of the English language and the ability to handle international clients to join our team as an <strong>Academic Associate (Operations)</strong>. Key responsibilities include:</p>\n<ul>\n<li>Providing client support through problem-solving, communication, and guidance.</li>\n<li>Identifying business opportunities by researching and analyzing sales options.</li>\n<li>Preparing reports by collecting, analyzing, and summarizing information.</li>\n<li>Maintaining quality service by enforcing organizational standards.</li>\n<li>Communicating with clients or employers about project goals and expectations.</li>\n<li>Managing client inquiries via telephone and email.</li>\n<li>Creating and maintaining databases for events.</li>\n<li>Resolving customer complaints or issues.</li>\n<li>Assisting other teams with administrative tasks (e.g., call redirection, scheduling meetings).</li>\n<li>Supporting the collective well-being of the organization to deliver quality educational services globally.</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Graduate/Postgraduate degree.</li>\n<li>0–1 year of experience in customer handling (freshers preferred).</li>\n<li>Strong written and oral communication skills in English.</li>\n<li>Organized with the ability to prioritize and multitask.</li>\n<li>Reliable, patient, and professional.</li>\n<li>Willingness to work in shifts.</li>\n<li>Job location: <strong>Infopark Cochin Phase-I</strong>.</li>\n</ul>\n<h2>About Us</h2>\n<p><strong>TutorComp</strong> is a global leader in online tutoring, providing personalized tutors worldwide. Our mission is to make learning accessible by leveraging technology and global talent. We operate in markets including the US, UK, Hong Kong, Singapore, Australia, France, India, UAE, Kuwait, Bahrain, Qatar, Saudi Arabia, and Malaysia.</p>\n<p>Interested candidates can apply by sharing their resume to <strong>hr@tutorcomp.com</strong>.</p>",
        "tags": [
            "0-1 Year",
            "English Communication",
            "Customer Service",
            "Database Management"
        ],
        "summary": "Academic Associate (Operations) supports client interactions, administrative tasks, and database management. Requires strong communication skills and 0–1 year of customer handling experience."
    },
    {
        "job_title": "Video Editor & Graphic Designer",
        "company": "MarketBytes WebWorks Private Limited",
        "url": "https://infopark.in/company-jobs/details/21442/460",
        "location": "Infopark",
        "closing_date": "30 Jan 2026",
        "job_description": "<p><strong>Job Title:</strong> Video Editor &amp; Graphic Designer\n<strong>Location:</strong> Infopark Cherthala\n<strong>Type:</strong> Full-Time</p>\n<p>Are you a creative powerhouse with a passion for both video editing and graphic design? Join our team and help bring our visions to life through stunning visuals and captivating videos!</p>\n<h2>Key Responsibilities:</h2>\n<ul>\n<li><strong>Video Editing:</strong> Edit and produce high-quality video content for marketing, social media, and internal projects</li>\n<li><strong>Graphic Design:</strong> Design eye-catching graphics for websites, social media, print materials, and campaigns</li>\n<li>Collaborate with the marketing and creative teams to align visuals with company goals and branding</li>\n<li>Manage multiple projects while ensuring high-quality results and meeting deadlines</li>\n<li>Stay updated with the latest trends and tools in both video editing and graphic design</li>\n<li>Assist in creating engaging animations and motion graphics</li>\n</ul>\n<h2>Skills &amp; Experience:</h2>\n<ul>\n<li><strong>Video Editing:</strong> Proficiency in Adobe Premiere Pro, DaVinci Resolve, CapCut, Filmora, Adobe After Effects</li>\n<li><strong>Graphic Design:</strong> Expertise in Adobe Photoshop, Illustrator, Figma</li>\n<li>Knowledge of animation and motion graphics is a plus</li>\n<li>Strong attention to detail with the ability to adapt to different styles and formats</li>\n<li>Ability to work on multiple projects simultaneously in a fast-paced environment</li>\n<li>Experience in social media content creation and digital marketing design is a plus</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@marketbyteswebworks.com</strong></p>",
        "tags": [
            "3-5 Years",
            "Adobe Creative Suite",
            "Video Editing",
            "Graphic Design"
        ],
        "summary": "Creative Video Editor & Graphic Designer needed to produce marketing/social media content. Requires Adobe expertise and design versatility."
    },
    {
        "job_title": "Mid-Level QA Automation Engineer",
        "company": "SE-Mentor Solutions",
        "url": "https://infopark.in/company-jobs/details/21444/483",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Mid-Level QA Automation Engineer</strong></p>\n<p>We are seeking a <strong>Mid-Level QA Automation Engineer</strong> eager to advance professionally. You will contribute to building and maintaining automation frameworks, integrate tests into Azure DevOps pipelines, and leverage AI-powered tools for intelligent test case generation. This role offers opportunities to expand technical expertise and take on increasing responsibilities.</p>\n<p><strong>Location:</strong> Trivandrum/Kochi\n<strong>Notice Period:</strong> Immediate to within 30 Days</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Assist in developing and maintaining automation frameworks using <strong>Playwright</strong>, <strong>Cypress</strong>, or <strong>Selenium</strong> for UI and <strong>RestAssured</strong> or <strong>Karate</strong> for API testing.</li>\n<li>Support integration of automated tests into <strong>Azure Pipelines</strong> and learn best practices for CI/CD.</li>\n<li>Collaborate on creating automated test cases and explore AI tools for test optimization.</li>\n<li>Participate in defining and executing test strategies for functional, regression, and smoke testing.</li>\n<li>Help automate REST API validations and integrate with <strong>Azure DevOps Test Plans</strong>.</li>\n<li>Contribute to performance testing efforts using <strong>JMeter</strong> or <strong>Gatling</strong>.</li>\n<li>Work with <strong>Azure Boards</strong> for defect tracking and assist in root cause analysis.</li>\n<li>Learn to manage test environments using <strong>Docker</strong> and <strong>Azure Kubernetes Service (AKS)</strong>.</li>\n<li>Track and report basic quality metrics and grow skills in advanced reporting.</li>\n<li>Demonstrate initiative to learn and adopt best practices in automation and CI/CD.</li>\n</ul>\n<h3>Growth Opportunities</h3>\n<p>This role is ideal for someone who wants to deepen technical expertise, gain experience with AI-driven testing, and progress toward senior-level responsibilities. You will receive mentorship and opportunities to lead small initiatives as you grow.</p>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>3+ years</strong> in QA with at least <strong>2 years</strong> in automation engineering.</li>\n<li>Proficiency in one programming language: <strong>Java</strong>, <strong>Python</strong>, or <strong>TypeScript</strong>.</li>\n<li>Hands-on experience with at least one automation tool: <strong>Playwright</strong>, <strong>Cypress</strong>, or <strong>Selenium</strong>.</li>\n<li>Basic understanding of <strong>Azure DevOps Pipelines</strong> and <strong>Boards</strong>.</li>\n<li>Familiarity with <strong>Git</strong> for version control.</li>\n<li>Strong desire to learn AI-powered QA tools and advanced automation techniques.</li>\n<li>Good problem-solving and debugging skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Exposure to API testing tools like <strong>Postman</strong> or <strong>RestAssured</strong>.</li>\n<li>Basic knowledge of performance testing tools (<strong>JMeter</strong> or <strong>Gatling</strong>).</li>\n<li>Understanding of <strong>BDD/TDD</strong> concepts.</li>\n<li>Experience with <strong>BrowserStack</strong> or <strong>Sauce Labs</strong> for cross-browser/device testing.</li>\n<li>Interest in learning service virtualization and feature flag testing.</li>\n</ul>\n<h3>Tools &amp; Stack</h3>\n<ul>\n<li><strong>Automation:</strong> Playwright, Cypress, Selenium</li>\n<li><strong>Languages:</strong> TypeScript, Java, Python</li>\n<li><strong>CI/CD:</strong> Azure DevOps Pipelines</li>\n<li><strong>API Testing:</strong> RestAssured, Karate</li>\n<li><strong>Performance:</strong> JMeter, Gatling</li>\n<li><strong>Management:</strong> Azure Boards, Azure Test Plans</li>\n<li><strong>Infra:</strong> Docker, AKS, Azure Cloud</li>\n<li><strong>AI Tools:</strong> Testim, Mabl, Functionize (learning encouraged)</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, share your updated resume at <strong>careers@se-mentor.com</strong>.</p>",
        "tags": [
            "3+ Years",
            "Playwright",
            "Azure DevOps",
            "RestAssured"
        ],
        "summary": "Mid-Level QA Automation Engineer role in Trivandrum/Kochi, focusing on automation frameworks, CI/CD integration, and AI-driven testing. Requires 3+ years QA experience with automation tools and offers growth into senior roles."
    },
    {
        "job_title": "Senior QA Automation Engineer",
        "company": "SE-Mentor Solutions",
        "url": "https://infopark.in/company-jobs/details/21445/483",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p>We are seeking a Senior QA Automation Engineer with strong experience in Azure DevOps and advanced automation practices. This role involves designing scalable test frameworks, integrating automation into CI/CD pipelines, and leveraging AI-powered tools for intelligent test case generation, flakiness detection, and predictive quality analytics. You will ensure high-quality releases across web, API, and mobile platforms while driving innovation in test automation.</p>\n<h3>Location</h3>\n<ul>\n<li>Trivandrum/Kochi</li>\n</ul>\n<h3>Notice Period</h3>\n<ul>\n<li>Immediate to within 30 Days</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Build and maintain robust automation frameworks using <strong>Playwright</strong>, <strong>Cypress</strong>, or <strong>Selenium</strong> for UI and <strong>RestAssured</strong> or <strong>Karate</strong> for API testing.</li>\n<li>Implement automated test execution in <strong>Azure Pipelines</strong>, configure triggers, and optimize parallelization for faster feedback.</li>\n<li>Utilize AI tools for automated test case creation, flakiness detection, and predictive analytics.</li>\n<li>Define and execute comprehensive test strategies for functional, regression, smoke, and integration testing.</li>\n<li>Automate REST API validations and schema checks; integrate with <strong>Azure DevOps Test Plans</strong>.</li>\n<li>Use <strong>JMeter</strong> or <strong>Gatling</strong> for load and stress testing; analyze results and provide recommendations.</li>\n<li>Utilize <strong>Azure Boards</strong> for defect tracking and reporting; perform root cause analysis.</li>\n<li>Leverage <strong>Docker</strong> and <strong>Azure Kubernetes Service (AKS)</strong> for test environments; manage test data and mocks.</li>\n<li>Track and report KPIs like test coverage, flakiness, and defect escape rate using <strong>Azure Test Plans</strong> dashboards.</li>\n<li>Guide junior QA engineers and promote best practices in automation and CI/CD.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>7+ years</strong> in QA with <strong>5+ years</strong> in automation engineering.</li>\n<li>Strong coding skills in <strong>Java</strong>, <strong>Python</strong>, or <strong>TypeScript</strong>.</li>\n<li>Hands-on experience with <strong>Playwright</strong>, <strong>Cypress</strong>, <strong>Selenium</strong>, and <strong>Appium</strong>.</li>\n<li>Expertise in <strong>Azure DevOps</strong>: <strong>Pipelines</strong>, <strong>Boards</strong>, <strong>Test Plans</strong>, and <strong>Artifacts</strong>.</li>\n<li>Familiarity with AI-powered QA tools (e.g., <strong>Testim</strong>, <strong>Mabl</strong>, <strong>Functionize</strong>, or similar).</li>\n<li>Proficient in <strong>Git</strong> and branching strategies.</li>\n<li>Familiarity with <strong>Docker</strong>, <strong>AKS</strong>, and cloud-based test environments.</li>\n<li>Strong debugging and problem-solving skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li><strong>BDD/TDD</strong> experience with <strong>Cucumber</strong> or <strong>SpecFlow</strong>.</li>\n<li>Performance testing with <strong>JMeter</strong> or <strong>Gatling</strong>.</li>\n<li>Security testing knowledge (<strong>OWASP</strong>, <strong>ZAP</strong>).</li>\n<li>Experience with <strong>BrowserStack</strong> or <strong>Sauce Labs</strong> for cross-browser/device testing.</li>\n<li>Familiarity with service virtualization and feature flags.</li>\n</ul>\n<h3>Tools &amp; Stack</h3>\n<ul>\n<li><strong>Automation</strong>: Playwright, Cypress, Selenium, Appium</li>\n<li><strong>Languages</strong>: TypeScript, Java, Python</li>\n<li><strong>CI/CD</strong>: Azure DevOps Pipelines</li>\n<li><strong>API Testing</strong>: RestAssured, Karate</li>\n<li><strong>Performance</strong>: JMeter, Gatling</li>\n<li><strong>Management</strong>: Azure Boards, Azure Test Plans</li>\n<li><strong>Infra</strong>: Docker, AKS, Azure Cloud; BrowserStack/Sauce Labs</li>\n<li><strong>AI Tools</strong>: Testim, Mabl, Functionize, or similar for intelligent test generation and optimization</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@se-mentor.com</strong>.</p>",
        "tags": [
            "7+ Years",
            "Azure DevOps",
            "Playwright/Cypress",
            "TypeScript/Java/Python"
        ],
        "summary": "Senior QA Automation Engineer role requiring 7+ years of QA experience, expertise in Azure DevOps, and advanced automation frameworks. Responsibilities include designing test strategies, integrating CI/CD pipelines, and leveraging AI for quality analytics."
    },
    {
        "job_title": "Data Developer/ Big Data Engineer/ Team Lead",
        "company": "SE-Mentor Solutions",
        "url": "https://infopark.in/company-jobs/details/21446/483",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Location</strong>: Kochi\n<strong>Notice Period</strong>: Immediate to 30 Days</p>\n<h3><strong>Data Warehouse Developer</strong></h3>\n<ul>\n<li><strong>Skillsets</strong>: SSIS Development, Azure Databricks, SQL Queries</li>\n<li><strong>Experience</strong>: 3+ Years</li>\n<li><strong>Positions</strong>: 4</li>\n</ul>\n<h3><strong>Big Data Engineer</strong></h3>\n<ul>\n<li><strong>Skillsets</strong>: Spark, Customer Data Platform (CDP)</li>\n<li><strong>Experience</strong>: 3+ Years</li>\n</ul>\n<h3><strong>Team Manager/Lead</strong></h3>\n<ul>\n<li><strong>Experience</strong>: 7 to 8 Years</li>\n<li><strong>Requirements</strong>: Ability to write complex SQL Queries, sound exposure in Data Warehouse (DWH) concepts, Databricks, and Big Data</li>\n<li><strong>Team Management</strong>: Must manage a team and handle onshore client interactions</li>\n<li><strong>Communication</strong>: Excellent communication skills mandatory</li>\n</ul>\n<p><strong>Contact</strong>: Share your updated resume at <strong>careers@se-mentor.com</strong></p>",
        "tags": [
            "7-8 Years",
            "Spark",
            "SQL Queries",
            "Databricks"
        ],
        "summary": "Lead big data teams with expertise in Spark and Databricks, requiring 7-8 years of experience and strong SQL skills for client-facing roles in Kochi."
    },
    {
        "job_title": "Front-End Developer - UI/UX",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21449/182",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Front-End Developer - UI/UX</strong></p>\n<p>We are seeking a talented and creative Front-End Developer to join our team. In this role, you will be responsible for translating user requirements into engaging, intuitive user interfaces. You’ll work closely with both design and development teams to deliver seamless, user-focused digital experiences.</p>\n<p><strong>Responsibilities:</strong>\n- Collaborate closely with designers and developers to understand project scope and objectives.\n- Develop user interfaces for web applications and mobile-responsive platforms.\n- Implement responsive design principles to ensure accessibility across different screen sizes and devices.\n- Write clean, efficient, and maintainable code using HTML, CSS (SASS/Less), and JavaScript.\n- Conduct thorough testing to ensure high performance and reliability of interfaces.\n- Stay updated on industry trends and best practices in UI/UX design and front-end development.</p>\n<p><strong>Requirements:</strong>\n- Strong proficiency in HTML, CSS, JavaScript, and styling frameworks like Bootstrap or Tailwind CSS.\n- <strong>2–4 years</strong> of hands-on experience in front-end development focused on UI/UX.\n- Strong understanding of key design principles and responsive design concepts.\n- Knowledgeable about web performance and optimization.\n- Understanding of web accessibility standards (WCAG) to design user interfaces.\n- Proven experience as a UI Developer or in a similar role.\n- Experience with UI/UX design principles and tools is a plus.\n- Excellent problem-solving skills and attention to detail.\n- Ability to work collaboratively in a team environment.</p>\n<p><strong>Added Advantage (Nice to Have):</strong>\n- Hands-on with WordPress or Shopify themes? That’s a plus.\n- Know your way around Vue, Nuxt, or anything in the Vue ecosystem? Even better.\n- Bonus points if you’ve worked with REST APIs, touched TypeScript, or used Material UI in your projects.</p>\n<p>If you're passionate about building clean, user-friendly interfaces and want to work in a team that values good design, attention to detail, and smart front-end development, we’d love to hear from you.</p>\n<p><strong>Contact:</strong>\n- Send us your resume and portfolio at 👉 <strong>hr@2hatslogic.com</strong> with subject line \"Front End Developer\"\n- If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>thr@2hatslogic.com</strong></p>",
        "tags": [
            "2–4 Years",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "summary": "Front-End Developer with 2–4 years of experience in UI/UX, HTML, CSS, and JavaScript to create responsive, user-friendly web interfaces."
    },
    {
        "job_title": "React Native Lead",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/21451/401",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>React Native Lead</strong></p>\n<p><strong>Pearlsoft Technologies LLP, Cochin</strong> is seeking a <strong>React Native Lead</strong> for a position in <strong>Kochi</strong>.</p>\n<p><strong>Total years of experience required:</strong> 7+ Yrs</p>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong experience in <strong>React Native</strong> and <strong>JavaScript / TypeScript</strong></li>\n<li>Solid understanding of <strong>React hooks</strong>, <strong>state management</strong> (Redux, Context API, Zustand, etc.)</li>\n<li>Experience with <strong>REST APIs</strong> and third-party integrations</li>\n<li>Hands-on experience with <strong>iOS and Android build processes</strong> and managing releases to <strong>App Store</strong> and <strong>Play Store</strong></li>\n<li>Strong understanding of <strong>mobile UI/UX principles</strong></li>\n<li>Lead <strong>technical design</strong>, <strong>code reviews</strong>, and <strong>performance optimization</strong></li>\n<li>Proficient with <strong>Git</strong>, <strong>branching strategies</strong>, and <strong>release management</strong></li>\n<li><strong>Knowledge of native modules</strong> (iOS &amp; Android) is a plus</li>\n</ul>\n<h3>Contact Information</h3>\n<ul>\n<li>Email resumes to <strong>preethi.nair@pearlsofttechnologies.co.in</strong></li>\n<li>For career inquiries, contact <strong>joinus@pearlsofttechnologies.com</strong></li>\n</ul>",
        "tags": [
            "7+ Yrs",
            "React Native",
            "JavaScript/TypeScript",
            "REST APIs"
        ],
        "summary": "Lead React Native development for mobile apps. Requires 7+ years in React Native, JavaScript/TypeScript, and REST APIs. Based in Kochi."
    },
    {
        "job_title": "Project Manager",
        "company": "Eqsoft Business Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21452/286",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Project Manager</strong></p>\n<p><strong>Company:</strong> Eqsoft Business Solutions Pvt Ltd</p>\n<p><strong>Job Description:</strong>\nEqsoft Business Solutions Pvt Ltd is seeking an experienced and technically strong Project Manager to lead software development projects. The ideal candidate will have hands-on experience in VB.NET, .NET Core, Flutter, Angular, APIs, SQL, MySQL, cloud technologies, and full-stack development, along with strong leadership and communication skills. The role involves managing both cloud-based and desktop ERP projects from start to finish.</p>\n<p><strong>Key Responsibilities:</strong>\n- Lead end-to-end software development projects (planning, execution, delivery, maintenance).\n- Manage ERP, cloud-based, and desktop software projects to ensure high-quality, timely delivery.\n- Supervise frontend, backend, and mobile development teams, ensuring collaboration.\n- Review technical architecture, database structure, and API integrations.\n- Handle cloud hosting, deployment, and maintenance (AWS, Azure, or similar).\n- Coordinate with clients and internal departments to define project goals.\n- Monitor timelines, team performance, and budgets for optimal results.\n- Ensure software security, performance, and scalability.\n- Conduct project review meetings and submit progress reports.\n- Provide technical mentoring and leadership to developers.</p>\n<p><strong>Required Skills &amp; Qualifications:</strong>\n- <strong>5+ years</strong> of experience in desktop-based and ERP system projects.\n- Strong expertise in <strong>VB.NET</strong>, <strong>.NET Core</strong>, API development, and SQL/MySQL databases.\n- Proficiency in <strong>Flutter</strong> (mobile app development) and <strong>Angular</strong> (frontend).\n- Knowledge of cloud technologies, deployment, and data management.\n- Solid understanding of frontend and backend development (Full Stack).\n- Good command over version control systems (SVN, Git, GitHub).\n- Excellent team management, task prioritization, and problem-solving skills.\n- Familiarity with Agile/Scrum methodologies.\n- Bachelor’s or Master’s degree in Computer Science/IT or equivalent.</p>\n<p><strong>Preferred Skills:</strong>\n- Experience in multi-platform ERP deployment (web, desktop, mobile).\n- Knowledge of UI/UX standards and third-party integrations.\n- Exposure to server-side performance optimization.\n- Ability to modernize legacy systems for scalability.</p>\n<p><strong>What We Offer:</strong>\n- Opportunity to lead innovative ERP and business software solutions.\n- Competitive salary and performance incentives.\n- Professional, growth-oriented environment.\n- Continuous learning and exposure to latest technologies.</p>\n<p><strong>Job Type:</strong> Full-time\n<strong>Work Location:</strong> In-person</p>\n<p><strong>Contact:</strong> Share your resume at <strong>hr@eqsoftglobal.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "VB.NET",
            ".NET Core",
            "Angular"
        ],
        "summary": "Eqsoft seeks a Project Manager with 5+ years of ERP/cloud project experience, requiring VB.NET, .NET Core, and Angular expertise to lead full-stack development teams and deliver high-quality software solutions."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "TouchWorld Technology",
        "url": "https://infopark.in/company-jobs/details/21450/352",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Digital Marketing Executive</strong></p>\n<p>We’re seeking a creative, analytical professional to make an impact in the digital space!</p>\n<p><strong>Responsibilities:</strong>\n- Plan, execute, and optimize online marketing campaigns to drive engagement, leads, and brand growth.\n- Collaborate with marketing and creative teams to develop data-driven strategies.\n- Manage <strong>Social Media Marketing</strong> (Facebook, Instagram, LinkedIn, X), <strong>Meta Ads</strong>, <strong>Google Ads &amp; PPC Campaigns</strong>, <strong>SEO</strong>, <strong>Content Creation</strong>, <strong>Email Marketing</strong>, and <strong>Analytics</strong> (Google Analytics, Meta Business Suite).\n- Utilize tools like <strong>Canva</strong> for basic graphic design and engage with <strong>Influencers &amp; Communities</strong>.\n- Stay updated on <strong>Marketing Trends &amp; Research</strong>.</p>\n<p><strong>Skills Required:</strong>\n- Social Media Marketing\n- Meta Ads Management\n- Google Ads &amp; PPC Campaigns\n- SEO (On-Page &amp; Off-Page)\n- Content Creation &amp; Copywriting\n- Email Marketing\n- Analytics &amp; Reporting\n- Canva / Basic Graphic Design\n- Influencer &amp; Community Engagement\n- Marketing Trends &amp; Research</p>\n<p><strong>Job Type:</strong> Onsite, Full-time\n<strong>Location:</strong> Infopark, Cochin\n<strong>Experience:</strong> 1 Year\n<strong>Contact:</strong> Send CV to <a href=\"mailto:hrteam@touchworldtechnology.com\">hrteam@touchworldtechnology.com</a></p>\n<p><strong>IMMEDIATE JOINER</strong>\nIf this aligns with your career goals, email your resume to hrteam@touchworldtechnology.com.</p>",
        "tags": [
            "1 Year",
            "Meta Ads Management",
            "Google Ads & PPC Campaigns",
            "SEO (On-Page & Off-Page)"
        ],
        "summary": "Digital Marketing Executive to plan, execute, and optimize online campaigns. Requires expertise in Meta/Google Ads, SEO, and analytics for measurable results."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26342",
        "location": "Technopark",
        "closing_date": "09 Jan 2026",
        "job_description": "<p><strong>Lean Transitions Solutions</strong></p>\n<p><strong>Location:</strong> Technopark Phase1, Trivandrum\n<strong>Website:</strong> <a href=\"http://www.LeanTransitionSolutions.com\">www.LeanTransitionSolutions.com</a>\n<strong>Contact Email:</strong> <a href=\"mailto:careers@ltslean.com\">careers@ltslean.com</a>\n<strong>Closing Date:</strong> 09, Jan 2026\n<strong>Published:</strong> 30, Dec 2025</p>\n<h3>About Lean Transition Solutions (LTS)</h3>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team.</p>\n<p>At LTS, we believe technology strengthens people, enabling them to do their best work. This belief shapes our products, culture, and how we work together.</p>\n<h3>Role Overview</h3>\n<p>We are seeking an <strong>Odoo Developer</strong> with <strong>around 3 years of hands-on experience</strong> in Odoo development and customization. The role involves designing, developing, and maintaining Odoo modules to support business processes, collaborating with cross-functional teams, and ensuring scalable, secure, and high-performing Odoo implementations.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Odoo Development &amp; Customization</strong></li>\n<li>Develop, customize, and maintain Odoo modules based on client and business requirements.</li>\n<li>Modify and extend core Odoo functionalities to support unique business workflows.</li>\n<li>\n<p>Implement best practices in Odoo module architecture and customization.</p>\n</li>\n<li>\n<p><strong>Requirement Analysis &amp; Solution Design</strong></p>\n</li>\n<li>Understand business processes and translate requirements into technical Odoo solutions.</li>\n<li>Provide guidance on optimal Odoo configurations and lifecycle management.</li>\n<li>\n<p>Ensure solutions are customer-centric, scalable, and maintainable.</p>\n</li>\n<li>\n<p><strong>Code Quality &amp; Maintenance</strong></p>\n</li>\n<li>Write clean, maintainable, and well-documented Python code.</li>\n<li>Participate in code reviews and knowledge-sharing sessions.</li>\n<li>\n<p>Identify, troubleshoot, and resolve issues in existing Odoo applications.</p>\n</li>\n<li>\n<p><strong>Database &amp; Data Management</strong></p>\n</li>\n<li>Work with PostgreSQL for data modeling and performance optimization.</li>\n<li>\n<p>Support data migration, cleansing, and validation activities.</p>\n</li>\n<li>\n<p><strong>Deployment, Security &amp; Performance</strong></p>\n</li>\n<li>Support Odoo deployment in cloud or on-premise environments.</li>\n<li>Ensure solutions comply with security standards and best practices.</li>\n<li>Enhance system performance and ensure scalability of implementations.</li>\n<li>\n<p>Contribute to DevOps pipelines and infrastructure automation where applicable.</p>\n</li>\n<li>\n<p><strong>Collaboration &amp; Documentation</strong></p>\n</li>\n<li>Collaborate with project managers, designers, QA, and other stakeholders.</li>\n<li>\n<p>Document technical designs, configurations, and customizations clearly.</p>\n</li>\n<li>\n<p><strong>Continuous Learning &amp; Improvement</strong></p>\n</li>\n<li>Stay updated with new Odoo versions, features, and industry best practices.</li>\n<li>Proactively suggest improvements to architecture, performance, and processes.</li>\n</ol>\n<h3>Preferred Skills</h3>\n<p><strong>Core Technical Skills:</strong>\n- 3+ years of hands-on experience with Odoo ERP (Enterprise preferred).\n- Strong knowledge of Odoo ORM, module architecture, and security framework.\n- Proficiency in Python and PostgreSQL.</p>\n<p><strong>Deployment &amp; DevOps:</strong>\n- Experience deploying Odoo in cloud or on-premise environments.\n- Familiarity with Docker, Kubernetes, and cloud platforms such as AWS or Azure.\n- Exposure to CI/CD pipelines and DevOps practices.</p>\n<p><strong>Methodologies &amp; Soft Skills:</strong>\n- Comfortable working in Agile/Scrum development environments.\n- Strong problem-solving and analytical skills.\n- Ability to communicate technical concepts clearly to stakeholders.</p>\n<p><strong>Nice to Have:</strong>\n- Exposure to Agentic AI, RPA, or AI-driven process automation.\n- Experience with advanced CI/CD pipelines and automation workflows.</p>\n<h3>Why You’ll Love Working With Us</h3>\n<ul>\n<li><strong>Meaningful Work with Global Impact:</strong> Contribute to enterprise platforms used by world-class organizations like Philips, Hitachi, Pfizer, and others.</li>\n<li><strong>People-First, Collaborative Culture:</strong> Your ideas are heard, your work is valued, and you’re supported by a team built on trust and respect.</li>\n<li><strong>Purpose-Driven Technology:</strong> Build practical, thoughtful products that solve real operational and leadership challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Learn continuously, take ownership of your work, and grow your career in a supportive environment.</li>\n<li><strong>Global Exposure, Human Connection:</strong> Work with diverse teams and enterprise clients worldwide—while feeling connected and supported.</li>\n<li><strong>Quality, Security &amp; Trust:</strong> Backed by ISO certifications, reflecting our commitment to quality, data security, and operational reliability.</li>\n</ul>\n<h3>Build a Strong Future Together</h3>\n<p>At LTS, we build long-term relationships and support our people at every stage of their journey. Our culture values balance, trust, and long-term success.</p>\n<p><strong>Interested candidates</strong> may forward their detailed resume to <a href=\"mailto:careers@ltslean.com\">careers@ltslean.com</a> and include the following in the email content:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at office</p>",
        "tags": [
            "3+ Years",
            "Odoo ERP",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Experienced Odoo Developer needed for customizing ERP solutions. Collaborate globally with LTS to drive operational excellence through scalable, secure implementations."
    },
    {
        "job_title": "Graphic Designer Lead",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26341",
        "location": "Technopark",
        "closing_date": "09 Jan 2026",
        "job_description": "<h2>About Lean Transition Solutions (LTS)</h2>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company, headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. We are proud to be trusted by leading global organizations, supporting them in building sustainable, people-centric transformation at scale.</p>\n<p>With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team. At LTS, we believe technology strengthens people, enabling them to do their best work. That belief shapes our products, our culture, and how we work together.</p>\n<p><strong>Location:</strong> Technopark Phase1, Trivandrum</p>\n<h2>Role Overview</h2>\n<p>We are seeking a talented and creative <strong>Graphic Designer Lead</strong> who can translate ideas and messages into visually compelling designs aligned with client objectives and brand identity. The ideal candidate will have strong fundamentals in visual design, branding, and UI/UX concepts, along with exposure to modern AI-assisted design tools to enhance creativity and efficiency.</p>\n<h2>Key Responsibilities</h2>\n<ol>\n<li><strong>Creative &amp; Visual Design</strong></li>\n<li>Translate concepts, messages, and ideas into high-quality visual designs based on client goals and target audiences</li>\n<li>Design creatives for branding, marketing campaigns, social media, digital platforms, and print materials</li>\n<li>Develop logos, brand assets, and visual identities that accurately represent client brands</li>\n<li>\n<p>Brainstorm and create innovative design concepts aligned with marketing and brand strategies</p>\n</li>\n<li>\n<p><strong>Branding &amp; Design Consistency</strong></p>\n</li>\n<li>Create and maintain style guides for artwork and branding</li>\n<li>Ensure consistency across all designs and adherence to brand guidelines</li>\n<li>\n<p>Contribute to company-wide branding initiatives and visual identity development</p>\n</li>\n<li>\n<p><strong>UI/UX &amp; Design Communication</strong></p>\n</li>\n<li>Create wireframes, mock-ups, and prototypes to communicate design ideas clearly</li>\n<li>Assist in selecting appropriate fonts, colours, imagery, and layouts</li>\n<li>\n<p>Apply user-centred design principles to improve usability and visual impact</p>\n</li>\n<li>\n<p><strong>Collaboration &amp; Client Interaction</strong></p>\n</li>\n<li>Actively listen to client needs and provide creative recommendations</li>\n<li>Communicate design concepts clearly to clients and stakeholders</li>\n<li>Incorporate client and stakeholder feedback into final designs</li>\n<li>\n<p>Collaborate closely with writers, marketers, developers, and the creative team</p>\n</li>\n<li>\n<p><strong>Design Execution &amp; Production</strong></p>\n</li>\n<li>Use tools such as Photoshop, Illustrator, InDesign, After Effects, Figma, and related software to create and refine designs</li>\n<li>Prepare artwork for print and digital production with high-quality standards</li>\n<li>\n<p>Manage multiple projects simultaneously while meeting deadlines</p>\n</li>\n<li>\n<p><strong>Research &amp; Innovation</strong></p>\n</li>\n<li>Conduct research on market trends, target audiences, and competitor designs</li>\n<li>Stay updated with the latest design trends, tools, and technologies</li>\n<li>\n<p>Experiment with new techniques (including AI-assisted tools where relevant) to enhance creativity and efficiency</p>\n</li>\n<li>\n<p><strong>AI-Assisted Design (Supporting Role)</strong></p>\n</li>\n<li>Use AI-based tools (such as MidJourney, DALL·E, Adobe Firefly, or similar) as supporting tools for ideation and productivity</li>\n<li>Refine AI-generated outputs using traditional design tools to achieve polished results</li>\n<li>Stay aware of emerging AI design trends without compromising core design principles</li>\n</ol>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>4+ years of experience</strong> as a Graphic / Creative Designer</li>\n<li>Strong portfolio showcasing branding, digital, and visual design work</li>\n<li>Proficiency in Adobe Creative Suite and Figma</li>\n<li>Solid understanding of typography, colour theory, layout, and composition</li>\n<li>Experience creating wireframes, prototypes, and mock-ups</li>\n<li>Strong communication, presentation, and collaboration skills</li>\n<li>Ability to manage time effectively and meet deadlines</li>\n<li>Attention to detail and problem-solving mindset</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Exposure to AI-assisted design tools (for ideation and productivity)</li>\n<li>Understanding of UI/UX principles and methodologies</li>\n<li>Experience working in fast-paced or agency environments</li>\n<li>Ability to mentor or guide junior designers</li>\n<li>Strong English communication skills</li>\n</ul>\n<h2>Nice to Have</h2>\n<ul>\n<li>Experience with motion graphics or video tools (After Effects, basic animation)</li>\n<li>Curiosity to explore new design technologies and workflows</li>\n</ul>\n<h2>Why You’ll Love Working With Us</h2>\n<ul>\n<li><strong>Meaningful Work with Global Impact:</strong> Contribute to enterprise platforms used by world-class organizations such as Philips, Hitachi, Pfizer, and other global leaders—helping them improve how they operate, lead, and grow.</li>\n<li><strong>People-First, Collaborative Culture:</strong> Your ideas are heard, your work is valued, and you’re supported by a team built on trust and respect.</li>\n<li><strong>Purpose-Driven Technology:</strong> Build practical, thoughtful products that solve real operational and leadership challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Learn continuously, take ownership of your work, and grow your career in a supportive environment.</li>\n<li><strong>Global Exposure, Human Connection:</strong> Work with diverse teams and enterprise clients worldwide—while feeling connected and supported.</li>\n<li><strong>Quality, Security &amp; Trust:</strong> Our platforms and processes are backed by internationally recognised ISO certifications, reflecting our strong commitment to quality, data security, and operational reliability. This means you work in an environment built on high standards and trust.</li>\n</ul>\n<h2>Build a Strong Future Together</h2>\n<p>At LTS, we don’t just deliver solutions—we build long-term relationships. Together, we create a strong, sustainable future for our people, our clients, and our organization. From continuous learning and career development opportunities to meaningful ownership in your work, we support you at every stage of your journey. Our people benefit from a supportive work environment, competitive benefits, and a culture that values balance, trust, and long-term success.</p>\n<h2>Application Process</h2>\n<p>Interested candidates may forward their detailed resume to <strong>careers@ltslean.com</strong> and include the following information in the email content:\n- Current CTC:\n- Expected CTC:\n- Notice Period:\n- Current Location:\n- Total Relevant Experience:\n- Willingness to work at office:</p>\n<p><strong>Closing Date:</strong> 09, Jan 2026\n<strong>Job Published:</strong> 30, Dec 2025</p>",
        "tags": [
            "4+ Years",
            "Adobe Creative Suite",
            "Figma",
            "AI-Assisted Design Tools"
        ],
        "summary": "Lead creative design for branding and digital projects using Adobe tools and AI. Collaborate globally to deliver impactful visual solutions for enterprise clients."
    },
    {
        "job_title": "Business Analyst",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26340",
        "location": "Technopark",
        "closing_date": "09 Jan 2026",
        "job_description": "<p><strong>Lean Transitions Solutions</strong></p>\n<p><strong>Location:</strong> Technopark Phase1, Trivandrum\n<strong>Contact Email:</strong> careers@ltslean.com\n<strong>Closing Date:</strong> 09, Jan 2026\n<strong>Job Published:</strong> 30, Dec 2025</p>\n<h3>About Lean Transition Solutions (LTS)</h3>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. Trusted by leading global organizations, we support sustainable, people-centric transformation at scale. With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a detail-oriented <strong>Business Analyst</strong> with <strong>1–2 years of experience</strong> to gather, analyze, and document business requirements for web and mobile applications. The ideal candidate will collaborate with stakeholders, product managers, and development teams to deliver scalable, high-quality software solutions aligned with business objectives.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Requirement Gathering and Analysis:</strong></li>\n<li>Collaborate with stakeholders to understand needs.</li>\n<li>Translate requirements into functional specifications.</li>\n<li>\n<p>Organize workshops, interviews, or surveys for requirement collection.</p>\n</li>\n<li>\n<p><strong>Process Mapping and Documentation:</strong></p>\n</li>\n<li>Create flowcharts, diagrams, or process maps for workflows.</li>\n<li>\n<p>Document As-Is and To-Be processes for stakeholders.</p>\n</li>\n<li>\n<p><strong>Liaison Between Business and Development Teams:</strong></p>\n</li>\n<li>Act as a bridge for clear communication.</li>\n<li>\n<p>Explain technical details to non-technical users and vice versa.</p>\n</li>\n<li>\n<p><strong>Creating User Stories and Use Cases:</strong></p>\n</li>\n<li>\n<p>Write user stories and use cases with acceptance criteria.</p>\n</li>\n<li>\n<p><strong>Facilitating Meetings and Sprint Planning:</strong></p>\n</li>\n<li>\n<p>Lead requirement reviews, sprint planning, and retrospectives.</p>\n</li>\n<li>\n<p><strong>Assisting in User Acceptance Testing (UAT):</strong></p>\n</li>\n<li>\n<p>Coordinate UAT, create test scenarios, and address defects.</p>\n</li>\n<li>\n<p><strong>Change Management and Impact Analysis:</strong></p>\n</li>\n<li>Perform impact analysis on requested changes.</li>\n<li>\n<p>Communicate risks and benefits of changes.</p>\n</li>\n<li>\n<p><strong>Market Research and Competitor Analysis:</strong></p>\n</li>\n<li>Conduct research to understand industry trends.</li>\n</ol>\n<h3>Preferred Skills</h3>\n<ol>\n<li><strong>Understanding of Software Development Life Cycle (SDLC):</strong> Agile, Scrum, Waterfall methodologies.</li>\n<li><strong>Stakeholder Management:</strong> Build relationships and manage expectations.</li>\n<li><strong>Requirements Elicitation Techniques:</strong> Interviews, workshops, wireframes.</li>\n<li><strong>Documentation Skills:</strong> BRD, FRS, user stories.</li>\n<li><strong>Tools and Software:</strong> Jira, Confluence, Visio, Balsamiq, Trello.</li>\n<li><strong>Communication and Presentation:</strong> Convey ideas to technical/non-technical audiences.</li>\n<li><strong>Problem-Solving and Analytical Thinking:</strong> Propose solutions aligned with business goals.</li>\n<li><strong>Handling Ambiguity and Change:</strong> Adapt to fast-paced environments.</li>\n<li><strong>Testing and QA:</strong> Coordinate UAT and verify requirements.</li>\n<li><strong>Business Domain Knowledge:</strong> Industry-specific insights (e.g., finance, healthcare).</li>\n</ol>\n<h3>Why You’ll Love Working With Us</h3>\n<ul>\n<li><strong>Meaningful Work with Global Impact:</strong> Contribute to platforms used by Philips, Hitachi, Pfizer, etc.</li>\n<li><strong>People-First Culture:</strong> Ideas heard, work valued, team built on trust.</li>\n<li><strong>Purpose-Driven Technology:</strong> Solve real operational and leadership challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Continuous learning, career development, and ownership.</li>\n<li><strong>Global Exposure:</strong> Work with diverse teams and clients worldwide.</li>\n<li><strong>Quality, Security &amp; Trust:</strong> ISO-certified platforms and processes.</li>\n</ul>\n<h3>Build a Strong Future Together</h3>\n<p>At LTS, we deliver solutions and build long-term relationships. We support continuous learning, career growth, and a balanced work environment. Apply now to join a culture that values trust, innovation, and sustainability.</p>\n<p><strong>Interested candidates may forward their detailed resume to:</strong>\n<strong>careers@ltslean.com</strong></p>\n<p>Include the following in your email:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at office</p>",
        "tags": [
            "1-2 Years",
            "Agile",
            "Jira",
            "Confluence"
        ],
        "summary": "Seeking a Business Analyst with 1-2 years experience to gather requirements, map processes, and bridge business and development teams for scalable software solutions."
    },
    {
        "job_title": "Pre-Sales Demo Experience Executive",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26339",
        "location": "Technopark",
        "closing_date": "09 Jan 2026",
        "job_description": "<h2>About Lean Transition Solutions (LTS)</h2>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. We are proud to be trusted by leading global organizations, supporting them in building sustainable, people-centric transformation at scale.</p>\n<p>With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team. At LTS, we believe technology strengthens people, enabling them to do their best work. That belief shapes our products, our culture, and how we work together.</p>\n<p><strong>Location:</strong> Technopark Phase 1, Trivandrum</p>\n<h2>Role Overview</h2>\n<p>The <strong>Pre-Sales Demo Experience Executive</strong> is responsible for delivering a best-in-class demo and trial experience across the company’s SaaS portfolio. This role owns the end-to-end demo readiness lifecycle—from environments, data, and scenarios to leadership briefings and meeting preparedness—ensuring that Sales, Pre-Sales, and Senior Leadership consistently present a compelling, confident, and professional product narrative to prospective customers.</p>\n<p>This is a senior individual contributor role with high visibility and influence, requiring strong ownership, attention to detail, and the ability to proactively drive standards across multiple teams.</p>\n<p><strong>Experience:</strong> 1 - 3 Years of experience</p>\n<h2>Key Responsibilities</h2>\n<ol>\n<li><strong>Demo Environment Ownership</strong></li>\n<li>Own and manage all demo environments across web and mobile platforms</li>\n<li>Ensure systems are stable, current, and demo-ready at all times</li>\n<li>Coordinate with Engineering and IT for deployments, updates, fixes, and environment health</li>\n<li>\n<p>Act as a super user with full system privileges and deep functional understanding</p>\n</li>\n<li>\n<p><strong>Demo Scenarios &amp; Data Excellence</strong></p>\n</li>\n<li>Design, create, and maintain multiple demo scenarios per product, including role-based and industry-specific scenarios</li>\n<li>Create realistic, high-quality demo datasets that clearly showcase product value</li>\n<li>Refresh and reset demo data to maintain consistency and reliability</li>\n<li>\n<p>Ensure all demo data complies with GDPR and internal data governance standards</p>\n</li>\n<li>\n<p><strong>Demo Flow Definition &amp; Documentation</strong></p>\n</li>\n<li>Define and document the ideal demo flow for each product, user role, and scenario</li>\n<li>Maintain clear demo runbooks, scripts, and supporting guidance</li>\n<li>\n<p>Continuously refine demo flows based on feedback from Sales, Pre-Sales, and Leadership</p>\n</li>\n<li>\n<p><strong>Access &amp; Credential Management</strong></p>\n</li>\n<li>Manage demo login credentials and access (manual process)</li>\n<li>Ensure credentials are secure, up to date, and readily available for internal use</li>\n<li>Coordinate access approvals with the Pre-Sales Leader</li>\n<li>\n<p>Maintain clear documentation of demo users and permissions</p>\n</li>\n<li>\n<p><strong>Sales, Pre-Sales &amp; Leadership Enablement</strong></p>\n</li>\n<li>Ensure demo readiness 3–5 days ahead of scheduled meetings</li>\n<li>Support teams with demo confirmations, demo paths, and pre-meeting briefs</li>\n<li>Provide concise daily or weekly summaries of planned demos and priorities</li>\n<li>\n<p>Attend key demos or leadership meetings where appropriate and value-adding</p>\n</li>\n<li>\n<p><strong>Meeting Preparation &amp; Collateral Readiness</strong></p>\n</li>\n<li>Ensure leadership and sales teams have the correct decks, tools, and demo environments</li>\n<li>Maintain a single source of truth for demo assets and supporting materials</li>\n<li>\n<p>Work closely with Product and Marketing teams to ensure consistent messaging</p>\n</li>\n<li>\n<p><strong>Standards, Governance &amp; Continuous Improvement</strong></p>\n</li>\n<li>Establish and enforce a standard demo workflow across teams</li>\n<li>Act as the quality gatekeeper for demo and trial experiences</li>\n<li>Capture demo feedback and share insights with Product and Pre-Sales teams</li>\n<li>Support long-term evolution towards PMO or Product Operations functions</li>\n</ol>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Experience in pre-sales, demo operations, product enablement, or SaaS operations roles</li>\n<li>Strong understanding of SaaS platforms and demo environments</li>\n<li>Ability to manage multiple systems and stakeholders</li>\n<li>Excellent documentation and organisation skills</li>\n<li>Confident communicator with senior leadership</li>\n<li>Strong ownership mindset</li>\n<li>Experience supporting enterprise or regulated customers</li>\n<li>Familiarity with GDPR and data governance</li>\n<li>Exposure to CRM or pre-sales workflows</li>\n<li>Background suitable for PMO or delivery governance progression</li>\n</ul>\n<h2>Why You’ll Love Working With Us</h2>\n<ul>\n<li><strong>Meaningful Work with Global Impact:</strong> Contribute to enterprise platforms used by world-class organizations such as Philips, Hitachi, Pfizer, and other global leaders—helping them improve how they operate, lead, and grow.</li>\n<li><strong>People-First, Collaborative Culture:</strong> Your ideas are heard, your work is valued, and you’re supported by a team built on trust and respect.</li>\n<li><strong>Purpose-Driven Technology:</strong> Build practical, thoughtful products that solve real operational and leadership challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Learn continuously, take ownership of your work, and grow your career in a supportive environment.</li>\n<li><strong>Global Exposure, Human Connection:</strong> Work with diverse teams and enterprise clients worldwide—while feeling connected and supported.</li>\n<li><strong>Quality, Security &amp; Trust:</strong> Our platforms and processes are backed by internationally recognised ISO certifications, reflecting our strong commitment to quality, data security, and operational reliability. This means you work in an environment built on high standards and trust.</li>\n</ul>\n<h2>Build a Strong Future Together</h2>\n<p>At LTS, we don’t just deliver solutions—we build long-term relationships. Together, we create a strong, sustainable future for our people, our clients, and our organization. From continuous learning and career development opportunities to meaningful ownership in your work, we support you at every stage of your journey. Our people benefit from a supportive work environment, competitive benefits, and a culture that values balance, trust, and long-term success.</p>\n<p><strong>At LTS, your growth is our growth—and when our people succeed, everything we build becomes stronger.</strong></p>\n<h2>Application Instructions</h2>\n<p>Interested candidates may forward their detailed resume to <strong>careers@ltslean.com</strong> and include the following information in the email content:\n- Current CTC:\n- Expected CTC:\n- Notice Period:\n- Current Location:\n- Total Relevant Experience:\n- Willingness to work at office:</p>",
        "tags": [
            "1 - 3 Years",
            "SaaS",
            "GDPR",
            "CRM"
        ],
        "summary": "Senior Pre-Sales Demo Executive managing SaaS product demos, ensuring sales teams deliver compelling client presentations. Requires 1-3 years of experience in pre-sales or SaaS operations."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26338",
        "location": "Technopark",
        "closing_date": "09 Jan 2026",
        "job_description": "<h2>About Lean Transition Solutions (LTS)</h2>\n<p>Lean Transition Solutions (LTS) is a global Operational Excellence and Lean Industry 4.0 software company headquartered in the UK. For over a decade, we’ve helped large organizations turn strategy into action by combining Lean thinking, leadership principles, and modern, scalable technology. We are proud to be trusted by leading global organizations, supporting them in building sustainable, people-centric transformation at scale. With teams across India, Europe, the US, the Middle East, and Mexico, we operate as one connected global team. At LTS, we believe technology strengthens people, enabling them to do their best work. That belief shapes our products, our culture, and how we work together.</p>\n<p><strong>Location:</strong> Technopark Phase1, Trivandrum</p>\n<h2>Role Overview</h2>\n<p>We are seeking a passionate and user-focused <strong>UI/UX Designer</strong> with <strong>2-4 years of professional UI/UX design experience</strong> to create intuitive, engaging, and visually compelling digital experiences for web and mobile applications serving the manufacturing industry. The ideal candidate will excel at understanding user needs, designing user-centered solutions, and maintaining high design standards while collaborating closely with product managers, developers, and stakeholders. Proficiency in AI-powered design tools is a valuable asset that will enhance productivity and innovation.</p>\n<h2>Key Responsibilities</h2>\n<h3>1. User Experience (UX) Design</h3>\n<ul>\n<li>Conduct user research to understand manufacturing workflows, user behavior, needs, and pain points</li>\n<li>Translate research insights into user personas, journey maps, and experience flows</li>\n<li>Design intuitive user flows and information architecture that enhance usability and engagement</li>\n<li>Create wireframes and user flows that optimize task completion and reduce complexity</li>\n<li>Apply UX best practices tailored to industrial and data-heavy applications</li>\n</ul>\n<h3>2. User Interface (UI) Design</h3>\n<ul>\n<li>Design clean, visually appealing interfaces for web and mobile applications</li>\n<li>Create cohesive UI elements including buttons, icons, typography systems, and color palettes</li>\n<li>Ensure visual consistency and brand alignment across all screens and digital platforms</li>\n<li>Design effective data visualization interfaces for dashboards, KPIs, and analytics</li>\n<li>Balance aesthetic excellence with functional requirements of manufacturing environments</li>\n</ul>\n<h3>3. Figma Prototyping &amp; Design Systems</h3>\n<ul>\n<li>Build high-fidelity, interactive prototypes in Figma with animations and micro-interactions</li>\n<li>Create and maintain comprehensive component libraries and design systems</li>\n<li>Develop advanced prototypes that simulate real application behavior and workflows</li>\n<li>Establish reusable design patterns and maintain organized, scalable Figma files</li>\n<li>Utilize Figma's advanced features including auto-layout, variants, and constraints</li>\n</ul>\n<h3>4. Front-End Development Integration</h3>\n<ul>\n<li>Translate Figma designs into clean, semantic HTML5 and modern CSS3</li>\n<li>Write production-ready front-end code with proper structure and best practices</li>\n<li>Understand responsive design principles and implement mobile-first layouts</li>\n<li>Collaborate effectively with developers to ensure accurate design implementation</li>\n<li>Apply CSS frameworks and modern layout techniques (Flexbox, Grid, animations)</li>\n</ul>\n<h3>5. Collaboration &amp; Stakeholder Communication</h3>\n<ul>\n<li>Work closely with product managers, developers, and stakeholders</li>\n<li>Present design concepts, user flows, and prototypes clearly</li>\n<li>Incorporate feedback while maintaining usability and design integrity</li>\n</ul>\n<h3>6. Usability Testing &amp; Validation</h3>\n<ul>\n<li>Conduct usability testing and gather user feedback</li>\n<li>Identify usability issues and recommend design improvements</li>\n<li>Continuously optimize designs based on data and user insights</li>\n</ul>\n<h3>7. Design Systems &amp; Standards</h3>\n<ul>\n<li>Follow and contribute to UI/UX design guidelines and design systems</li>\n<li>Maintain consistency in branding, interaction patterns, and accessibility</li>\n<li>Ensure adherence to usability and accessibility standards</li>\n</ul>\n<h3>8. AI-Assisted Design</h3>\n<ul>\n<li>Leverage AI design tools (Lovable, On Space, v0, etc.) to accelerate prototyping workflows</li>\n<li>Use LLMs (Claude, ChatGPT, Gemini) for design exploration, copywriting, and iteration</li>\n<li>Experiment with AI platforms to enhance productivity and design quality</li>\n<li>Apply AI-generated variations to explore alternative design directions</li>\n<li>Stay informed about emerging AI tools that can improve design processes</li>\n</ul>\n<h3>9. Continuous Improvement &amp; Trends</h3>\n<ul>\n<li>Stay updated with the latest UI/UX trends, tools, and technologies</li>\n<li>Explore new design approaches to improve product experience</li>\n<li>Apply best practices in user-centered and human-centered design</li>\n</ul>\n<h2>Why You’ll Love Working With Us</h2>\n<ul>\n<li><strong>Meaningful Work with Global Impact:</strong> Contribute to enterprise platforms used by world-class organizations such as Philips, Hitachi, Pfizer, and other global leaders—helping them improve how they operate, lead, and grow.</li>\n<li><strong>People-First, Collaborative Culture:</strong> Your ideas are heard, your work is valued, and you’re supported by a team built on trust and respect.</li>\n<li><strong>Purpose-Driven Technology:</strong> Build practical, thoughtful products that solve real operational and leadership challenges.</li>\n<li><strong>Growth &amp; Ownership:</strong> Learn continuously, take ownership of your work, and grow your career in a supportive environment.</li>\n<li><strong>Global Exposure, Human Connection:</strong> Work with diverse teams and enterprise clients worldwide—while feeling connected and supported.</li>\n<li><strong>Quality, Security &amp; Trust:</strong> Our platforms and processes are backed by internationally recognized ISO certifications, reflecting our strong commitment to quality, data security, and operational reliability. This means you work in an environment built on high standards and trust.</li>\n</ul>\n<h2>Build a Strong Future Together</h2>\n<p>At LTS, we don’t just deliver solutions—we build long-term relationships. Together, we create a strong, sustainable future for our people, our clients, and our organization. From continuous learning and career development opportunities to meaningful ownership in your work, we support you at every stage of your journey. Our people benefit from a supportive work environment, competitive benefits, and a culture that values balance, trust, and long-term success. At LTS, your growth is our growth—and when our people succeed, everything we build becomes stronger.</p>\n<h2>Application Process</h2>\n<p>Interested candidates may forward their detailed resume to <strong>careers@ltslean.com</strong> and include the following information in the email content:\n- Current CTC:\n- Expected CTC:\n- Notice Period:\n- Current Location:\n- Total Relevant Experience:\n- Willingness to work at office:</p>",
        "tags": [
            "2-4 Years",
            "Figma",
            "AI-Powered Design Tools",
            "Responsive Design"
        ],
        "summary": "UI/UX Designer with 2-4 years of experience needed to create intuitive digital experiences for manufacturing industry apps. Requires proficiency in Figma, AI tools, and responsive design, collaborating with global teams."
    },
    {
        "job_title": "Lead Graphic Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26337",
        "location": "Technopark",
        "closing_date": "14 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3><strong>Job Title</strong>:</h3>\n<p>Lead Graphic Designer</p>\n<h3><strong>Experience</strong>:</h3>\n<p>4–6 years</p>\n<h3><strong>Work Arrangement</strong>:</h3>\n<p>On-site</p>\n<h3><strong>Employment Type</strong>:</h3>\n<p>Full-time</p>\n<h3><strong>Role Overview</strong>:</h3>\n<p>We’re hiring a <strong>Lead Marketing Designer</strong> to work closely with the marketing and design leadership to shape how Way.com shows up visually, consistently, and at scale. This is not a pixel-pushing role.</p>\n<h3><strong>Key Responsibilities</strong>:</h3>\n<ul>\n<li>Lead visual design across marketing campaigns, brand initiatives, social/performance ads, and web/product-led marketing.</li>\n<li>Translate business and marketing goals into high-impact visual stories.</li>\n<li>Own design quality end-to-end, from concept to final delivery.</li>\n<li>Collaborate with marketing, content, growth, and product teams.</li>\n<li>Maintain and evolve brand consistency while pushing creative boundaries.</li>\n<li>Mentor junior designers and raise the team’s design bar.</li>\n<li>Manage multiple projects without compromising quality or timelines.</li>\n</ul>\n<h3><strong>Preferred Skills &amp; Qualifications</strong>:</h3>\n<ul>\n<li><strong>4–6 years</strong> of experience in graphic/marketing design.</li>\n<li>Strong portfolio showcasing creative thinking, not just visuals.</li>\n<li><strong>Expert-level proficiency in Figma</strong> and <strong>Adobe Creative Suite</strong>.</li>\n<li>Ability to leverage <strong>AI</strong> for faster concept generation, campaign variations, and training juniors on AI tools.</li>\n<li>Experience designing for digital-first brands and fast-moving teams.</li>\n<li>Ability to take feedback, push back when needed, and defend design decisions.</li>\n<li>Comfort with ambiguity and rapid iteration.</li>\n<li>High ownership mindset; treat the work like it’s your brand.</li>\n</ul>\n<h3><strong>Bonus (Not Mandatory, But Valuable)</strong>:</h3>\n<ul>\n<li>Motion, video, or basic animation skills.</li>\n<li>Understanding of performance marketing creatives.</li>\n<li>Experience in startups or high-growth environments.</li>\n</ul>\n<h3><strong>Why This Role Matters</strong>:</h3>\n<p>Design at Way.com is a <strong>growth lever</strong>, not a support function. You’ll work on marketing design that scales:\n- Large-scale app and web product marketing.\n- Recent product initiatives (B2B - SaaS, B2C).\n- Brand initiatives and more.</p>\n<h3><strong>Why You’ll Love Working With Us</strong>:</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, innovation-driven culture.</li>\n<li>Clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3><strong>Contact</strong>:</h3>\n<ul>\n<li><strong>Email</strong>: careers@way.com</li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-graphic-designer\">https://waydot.greythr.com/hire/jobs/lead-graphic-designer</a></li>\n<li><strong>Closing Date</strong>: 14, Jan 2026</li>\n<li><strong>Published</strong>: 30, Dec 2025</li>\n</ul>",
        "tags": [
            "4-6 Years",
            "Figma",
            "Adobe Creative Suite",
            "AI"
        ],
        "summary": "Lead Graphic Designer at Way.com leads visual design for marketing campaigns, translating business goals into impactful visuals. Requires 4-6 years, Figma, Adobe, and AI proficiency."
    },
    {
        "job_title": "Junior Graphic Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26336",
        "location": "Technopark",
        "closing_date": "14 Jan 2026",
        "job_description": "<h2>Way.com India Pvt Ltd</h2>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> <a href=\"http://www.way.com\">www.way.com</a>\n<strong>Closing Date:</strong> 14, Jan 2026\n<strong>Job Published:</strong> 30, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/junior-graphic-designer\">https://waydot.greythr.com/hire/jobs/junior-graphic-designer</a></p>\n<h3>About Us</h3>\n<p>Way.com is America’s leading automotive super app, serving 10+ million customers with services like auto insurance, EV charging, and parking. Leveraging AI, machine learning, and data analytics, we deliver innovative solutions. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, we’re redefining car ownership.</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>Junior Graphic Designer</strong> to join a high-impact marketing design team. Since its creation, the team has:\n- Launched high-impact digital/physical campaigns\n- Defined brand guidelines and asset systems\n- Ensured visual consistency organization-wide\n- Marketed/sold new/existing products\n- Designed for B2C and B2B audiences\n- Supported trade shows and product launches\n- Driven revenue through conversion-led design</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Support design execution for <strong>marketing campaigns, social media, ads, and web/internal communications</strong></li>\n<li>Translate briefs into clean, effective visual outputs</li>\n<li>Assist senior designers on campaigns, products, and brand assets</li>\n<li>Iterate designs based on feedback</li>\n<li>Maintain brand consistency across platforms</li>\n<li>Learn how design impacts marketing performance and business outcomes</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>1–3 years</strong> of graphic design experience (internships/freelance count)</li>\n<li>Portfolio showcasing design fundamentals and learning agility</li>\n<li>Proficiency in <strong>Figma</strong> and <strong>Adobe Creative Suite</strong></li>\n<li>Ability to use <strong>AI</strong> for:</li>\n<li>Rapid concept generation</li>\n<li>Campaign variations at scale</li>\n<li>Maintaining brand quality</li>\n<li>Strong layout, typography, color, and visual hierarchy skills</li>\n<li>Openness to feedback and eagerness to improve</li>\n<li>Task/time management and revision responsibility</li>\n<li>Curiosity, ownership, and work ethic</li>\n</ul>\n<h3>Bonus (Nice to Have)</h3>\n<ul>\n<li>Motion graphics/video skills</li>\n<li>Social/marketing creative experience</li>\n<li>Startup/fast-paced environment exposure</li>\n</ul>\n<h3>Why This Role Matters</h3>\n<p>You’ll contribute to impactful design for:\n- Large-scale app/web product launches\n- B2B SaaS and B2C initiatives\n- Brand campaigns</p>\n<h3>Why Work With Us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong></li>\n<li>Impact <strong>10+ million users</strong></li>\n<li>Dynamic, innovation-driven culture</li>\n<li>Clear career growth in a scaling tech company</li>\n<li>Competitive compensation</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Figma",
            "Adobe Creative Suite",
            "AI"
        ],
        "summary": "Junior Graphic Designer with 1-3 years experience creates marketing campaigns using Figma, Adobe Creative Suite, and AI for a top US auto app."
    },
    {
        "job_title": "Performance Marketing Specialist",
        "company": "Scalgo Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26335",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>SCALGO TECHNOLOGIES (P) Ltd</h2>\n<p><strong>Address:</strong> 1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> <a href=\"https://www.scalgo.net\">https://www.scalgo.net</a>\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Job Published:</strong> 30, Dec 2025\n<strong>Contact Email:</strong> hrteam@scalgo.net</p>\n<h3>Brief Description</h3>\n<p><strong>Experience:</strong> 2-5 Years\n<strong>Product:</strong> B2B SaaS Product</p>\n<h4>About the Role</h4>\n<p>We are at Day 1. We have a powerful product, but we are starting from scratch, with no defined prospect list and no historical data. We don't just need someone to manage an existing machine; we need someone to build the engine.</p>\n<p>You will work to figure out who our prospect is and how to sell to them. As we find our product-market fit, you will transition into leading the scaling phase.</p>\n<h4>Preferred Skills</h4>\n<ul>\n<li><strong>Proven Ad Spend Experience</strong> with knowledge of budget allocation.</li>\n<li><strong>Understanding of long-cycle sales</strong> and persona-based targeting.</li>\n<li><strong>A metric-obsessed decision maker</strong> based strictly on CTR, CPC, and CPA.</li>\n<li><strong>Capable of analyzing failures</strong> that happened in early experiments to refine future strategies.</li>\n</ul>\n<p>Since you are joining at the \"Day 1\" phase, you will have the opportunity to build and lead your own team as it scales. We are looking for a future leader, not just an ad manager.</p>\n<p>While this role focuses on specialized skills (which are the priority), we expect you to possess the standard fundamental knowledge of general Digital Marketing (SEO basics, Social Media presence, etc.) that any professional in this field is expected to have.</p>\n<h4>Application Instructions</h4>\n<p>Interested candidates are invited to apply by sending their resume to <strong>hrteam@scalgo.net</strong> with the subject as <strong>\"Application Submission: Performance Marketing Specialist\"</strong>.</p>",
        "tags": [
            "2-5 Years",
            "Performance Marketing",
            "B2B SaaS",
            "Digital Marketing"
        ],
        "summary": "Seeking a Performance Marketing Specialist to build and lead marketing strategies for a B2B SaaS startup, transitioning from product-market fit to scaling. Requires 2-5 years of ad spend expertise and metric-driven decision-making."
    },
    {
        "job_title": "Lead Product Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26333",
        "location": "Technopark",
        "closing_date": "14 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, serving 10+ million customers with solutions from insurance to EV charging — is seeking a <strong>Lead Product Designer</strong>.</p>\n<p><strong>Job Details</strong>\n- <strong>Experience</strong>: 4–6 years\n- <strong>Work Arrangement</strong>: On-site\n- <strong>Employment Type</strong>: Full-time\n- <strong>Closing Date</strong>: 14, Jan 2026\n- <strong>Contact</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n- <strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-product-designer\">https://waydot.greythr.com/hire/jobs/lead-product-designer</a></p>\n<p><strong>Role Overview</strong>\nWe seek a Lead Product Designer to own end-to-end product experiences, drive outcomes, and raise design standards. This role partners with Product, Engineering, and Leadership to shape product direction and design maturity. Ideal candidates think like PMs, design like pros, and lead like owners.</p>\n<p><strong>Key Responsibilities</strong>\n- Own end-to-end design for core Way.com verticals\n- Define UX strategy, lead discovery, and ship high-quality flows/UI\n- Elevate visual and interaction standards\n- Influence product roadmaps with data and insights\n- Align cross-functionally, simplify ambiguity, and prioritize design\n- Establish lean design workflows\n- Mentor junior designers and shape team culture\n- Evolve Way.com’s design system for scale</p>\n<p><strong>Preferred Skills &amp; Qualifications</strong>\n- 4–6 years of product design experience with Senior-to-Lead ownership\n- Portfolio showcasing complex problem-solving and consumer-facing UI\n- Proven ability to drive outcomes, not just outputs\n- Comfort with fast-paced, data-informed decision-making\n- Experience in discovery, research, prototyping, and testing\n- Proficiency in <strong>Figma</strong> and modern design tools\n- Clear communication and influence across Product, Engineering, and Leadership\n- Bias for action: move, ship, iterate</p>\n<p><strong>What This Role Is (and Isn’t)</strong>\n- <strong>Is</strong>: High ownership, visibility, and responsibility\n- <strong>Isn’t</strong>: A screen-polishing or maintenance-only role</p>\n<p><strong>Why Work With Us?</strong>\n- Opportunity to impact 10+ million users via the #1 US auto super app\n- Dynamic, innovation-driven culture\n- Clear growth pathways in a rapidly scaling tech company\n- Competitive compensation</p>",
        "tags": [
            "4-6 Years",
            "Figma",
            "AI",
            "Machine Learning"
        ],
        "summary": "Lead Product Designer with 4-6 years of experience needed to own end-to-end product design for a leading auto super app. Requires strategic UX leadership, Figma expertise, and cross-functional collaboration."
    },
    {
        "job_title": "Associate Facilities and Administration",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26332",
        "location": "Technopark",
        "closing_date": "17 Jan 2026",
        "job_description": "<p><strong>TRENSER Technology Solutions (P) Ltd</strong></p>\n<p><strong>Address:</strong> Thejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.trenser.com\">http://www.trenser.com</a>\n<strong>Job Title:</strong> Associate Facilities and Administration\n<strong>Closing Date:</strong> 17, Jan 2026\n<strong>Published Date:</strong> 30, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@trenser.com\">careers@trenser.com</a></p>\n<h3>Job Overview</h3>\n<p>We are seeking a reliable and organized <strong>Administrative Executive</strong> to support day-to-day office operations. The ideal candidate will handle administrative tasks, coordination activities, and ensure smooth functioning of the office.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Manage daily administrative and office operations</li>\n<li>Handle correspondence, emails, calls, and documentation</li>\n<li>Maintain records, files, and office databases</li>\n<li>Coordinate with internal teams, vendors, and service providers</li>\n<li>Support Delivery Units and Business Operations with basic admin-related activities</li>\n<li>Manage office supplies, inventory, and asset tracking</li>\n<li>Assist in scheduling meetings, appointments, and travel arrangements</li>\n<li>Ensure compliance with company policies and procedures</li>\n<li>Support onboarding/offboarding administrative formalities</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in any discipline</li>\n<li><strong>1–3 years of experience</strong> in an administrative or office support role</li>\n<li>Experience in managing SEZ-related administration, documentation, and coordination with statutory authorities</li>\n<li>Ability to ensure upkeep of facility infrastructure</li>\n<li>Knowledge of physical security management, including coordination with security agencies, access control, and surveillance systems</li>\n<li>Familiarity with quality standards, company policies, and statutory compliance requirements</li>\n<li>Experience in courier and dispatch management, including tracking and vendor coordination</li>\n<li>Good communication skills (written and verbal)</li>\n<li>Proficiency in <strong>MS Office</strong> (Word, Excel, Outlook)</li>\n<li>Strong organisational, multitasking, and time-management skills</li>\n<li>High attention to detail and problem-solving ability</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "MS Office",
            "SEZ Administration",
            "Physical Security Management"
        ],
        "summary": "Seeking an Associate Facilities and Administration professional with 1-3 years of experience to manage office operations, coordinate activities, and ensure compliance with company policies and statutory requirements."
    },
    {
        "job_title": "Data Analyst",
        "company": "Feathersoft Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26331",
        "location": "Technopark",
        "closing_date": "30 Jan 2026",
        "job_description": "<p><strong>Feathersoft Info Solutions (P) Ltd</strong></p>\n<p><strong>Location:</strong> SBC No.2304, 3rd Floor, Yamuna Building, Technopark Phase III, Trivandrum, Kerala, 695583\n<strong>Website:</strong> <a href=\"https://www.feathersoft.com\">https://www.feathersoft.com</a>\n<strong>Closing Date:</strong> 30, Jan 2026\n<strong>Job Published:</strong> 30, Dec 2025\n<strong>Contact Email:</strong> careers@feathersoft.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Data Analyst</strong> with <strong>1–2 years of hands-on experience in Power BI and SQL</strong>. The ideal candidate should demonstrate strong skills in both tools, along with a solid understanding of data analytics, reporting, and business intelligence.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Interpret data, analyze results using statistical techniques, and provide ongoing reports.</li>\n<li>Develop and implement databases, data collection systems, data analytics, and strategies to optimize statistical efficiency and quality.</li>\n<li>Acquire data from primary or secondary sources and maintain databases/data systems.</li>\n<li>Identify, analyze, and interpret trends or patterns in complex datasets.</li>\n<li>Filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems.</li>\n<li>Collaborate with management to prioritize business and information needs.</li>\n<li>Locate and define new process improvement opportunities.</li>\n</ul>\n<h3>Required Skills and Qualifications</h3>\n<ul>\n<li><strong>1–2 years of experience in Power BI</strong></li>\n<li><strong>1–2 years of hands-on experience in SQL</strong></li>\n<li>Strong analytical and problem-solving skills</li>\n<li>Excellent verbal and written communication skills</li>\n<li>MBA graduates are preferred for their strong background in statistics and business analysis</li>\n<li>Familiarity with any of the following tools/platforms:</li>\n<li>Tableau</li>\n<li>Databricks</li>\n<li>Python</li>\n<li>AWS Data Environments</li>\n<li>Azure Data Environments</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Power BI</li>\n<li>SQL</li>\n<li>Dax Measures</li>\n</ul>",
        "tags": [
            "1–2 Years",
            "Power BI",
            "SQL",
            "Dax Measures"
        ],
        "summary": "Seeking a Data Analyst with 1–2 years of Power BI and SQL experience to analyze data, optimize reporting, and drive business insights. MBA candidates with BI tools expertise preferred."
    },
    {
        "job_title": "AI Developer - Python (Remote)",
        "company": "Leader It (P) Ltd",
        "url": "https://technopark.org/job-details/26330",
        "location": "Technopark",
        "closing_date": "07 Jan 2026",
        "job_description": "<h2>LEADER IT (P) Ltd</h2>\n<p><strong>Address:</strong>\nSBC 1, -2 FLOOR,\nTHEJASWINI BUILDING,\nPHASE 1, TECHNOPARK CAMPUS,\nKARYAVATTOM P O,\nTRIVANDRUM, KERALA , 695581\n<strong>Website:</strong> <a href=\"http://www.leaderit.in\">www.leaderit.in</a></p>\n<h3>AI Developer - Python (Remote)</h3>\n<p><strong>Closing Date:</strong> 07, Jan 2026\n<strong>Job Published:</strong> 30, Dec 2025\n<strong>Contact Email:</strong> jobsindia@leadergroup.com</p>\n<h3>Job Title: AI Developer (Python)</h3>\n<p><strong>Location:</strong> Remote/Work From Home\n<strong>Experience:</strong> 3–4 years</p>\n<p><strong>APPLY HERE &gt;&gt;</strong> <a href=\"#\">AI Developer</a></p>\n<h3>Position Overview</h3>\n<p>Develop robust Python-based AI applications and end-to-end Machine Learning pipelines. Focus on training, fine-tuning, and deploying open-source models (Hugging Face) and Deep Learning solutions, while leveraging Generative AI and Agents to enhance system capabilities.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Python Application Development:</strong> Write clean, efficient, and scalable Python code for backend logic and data processing pipelines.</li>\n<li><strong>ML &amp; DL Model Lifecycle:</strong> Design, train, and validate Machine Learning and Deep Learning models (Regression, Classification, NLP, Computer Vision) using standard frameworks.</li>\n<li><strong>Open Source Deployment:</strong> Select, fine-tune, and deploy open-source models from Hugging Face into production environments.</li>\n<li><strong>Gen AI &amp; Agents:</strong> Implement Generative AI features (LLM integration) and Agentic workflows where they add specific value to the product.</li>\n<li><strong>API &amp; Serving:</strong> Build high-performance APIs (FastAPI/Flask) to expose ML/DL models and AI agents to front-end systems.</li>\n<li><strong>Optimization:</strong> Optimize model inference for latency and resource usage; ensure code quality through testing and CI/CD practices.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>Expertise in Python programming (Data Structures, Algorithms, OOP).</li>\n<li>Strong foundation in Machine Learning (Scikit-learn) and Deep Learning (PyTorch/TensorFlow).</li>\n<li>Hands-on experience deploying Hugging Face Transformers and managing open-source model pipelines.</li>\n<li>Experience building and consuming RESTful APIs (FastAPI/Flask/Django).</li>\n<li>Practical knowledge of Generative AI (RAG, basic Agentic patterns) and LLM APIs.</li>\n<li>Familiarity with containerization (Docker) and cloud deployment (AWS/GCP).</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Bachelor’s or Master’s in Computer Science, AI, or related field.</li>\n<li>Experience with model quantization and optimization techniques (TensorRT).</li>\n<li>Minimum 3 years of relevant experience.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p>Python, Machine Learning, Deep Learning, Hugging Face Transformers, scikit-learn, API Development, FastAPI, Generative AI, RAG, Docker, Git, SQL, Model Deployment, MLOps</p>",
        "tags": [
            "3–4 Years",
            "Python",
            "Machine Learning",
            "Hugging Face Transformers"
        ],
        "summary": "Develop Python-based AI applications and ML/DL pipelines. Requires 3–4 years of experience in Python, Machine Learning, and Hugging Face deployment."
    },
    {
        "job_title": "Data Developer/ Big Data Engineer/ Team Lead",
        "company": "Se-Mentor Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26329",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Company:</strong> SE-Mentor Solutions (P) Ltd\n<strong>Location:</strong> Kochi\n<strong>Job Title:</strong> Data Developer / Big Data Engineer / Team Lead\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@se-mentor.com</p>\n<h3>Job Overview</h3>\n<p>We are hiring for multiple positions across three roles:</p>\n<h4>1. <strong>Data Developer</strong></h4>\n<ul>\n<li><strong>Skillsets:</strong> SSIS Development, Azure Databricks, SQL Queries</li>\n<li><strong>Experience:</strong> 3+ Years</li>\n<li><strong>Positions:</strong> 4</li>\n</ul>\n<h4>2. <strong>Big Data Engineer</strong></h4>\n<ul>\n<li><strong>Skillsets:</strong> Spark, Customer Data Platform (CDP)</li>\n<li><strong>Experience:</strong> 3+ Years</li>\n</ul>\n<h4>3. <strong>Team Manager/Lead</strong></h4>\n<ul>\n<li><strong>Skillsets:</strong> Complex SQL Queries, Data Warehouse (DWH) concepts, Databricks, Big Data</li>\n<li><strong>Experience:</strong> 7-8 Years</li>\n<li><strong>Requirements:</strong> Team management experience</li>\n</ul>\n<p><strong>Additional Requirements:</strong>\n- Excellent communication skills (onshore client interactions)\n- Notice Period: Immediate to 30 Days</p>",
        "tags": [
            "7-8 Years",
            "SSIS Development",
            "Azure Databricks",
            "Spark"
        ],
        "summary": "SE-Mentor Solutions seeks Data Developers, Big Data Engineers, and Team Leads with 3-8 years experience in SSIS, Databricks, and Spark for Kochi-based roles."
    },
    {
        "job_title": "Senior QA Automation Engineer",
        "company": "Se-Mentor Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26328",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p><strong>Company</strong>: SE-Mentor Solutions (P) Ltd\n<strong>Location</strong>: Trivandrum/Kochi, Kerala, India\n<strong>Contact</strong>: careers@se-mentor.com\n<strong>Closing Date</strong>: 31, Jan 2026\n<strong>Published</strong>: 29, Dec 2025</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Build and maintain robust automation frameworks using <strong>Playwright</strong>, <strong>Cypress</strong>, <strong>Selenium</strong> (UI) and <strong>RestAssured</strong>, <strong>Karate</strong> (API).</li>\n<li>Implement automated test execution in <strong>Azure Pipelines</strong>, configure triggers, and optimize parallelization.</li>\n<li>Utilize AI tools (e.g., Testim, Mabl) for test case generation, flakiness detection, and predictive analytics.</li>\n<li>Define test strategies for functional, regression, smoke, and integration testing.</li>\n<li>Automate REST API validations and schema checks; integrate with <strong>Azure DevOps Test Plans</strong>.</li>\n<li>Conduct load/stress testing with <strong>JMeter</strong> or <strong>Gatling</strong> and analyze results.</li>\n<li>Track defects in <strong>Azure Boards</strong>, perform root cause analysis, and report KPIs (test coverage, flakiness, defect escape rate).</li>\n<li>Manage test environments using <strong>Docker</strong> and <strong>Azure Kubernetes Service (AKS)</strong>.</li>\n<li>Guide junior QA engineers and promote automation/CI/CD best practices.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>7+ years</strong> in QA with <strong>5+ years</strong> in automation engineering.</li>\n<li>Strong coding skills in <strong>Java</strong>, <strong>Python</strong>, or <strong>TypeScript</strong>.</li>\n<li>Hands-on experience with <strong>Playwright</strong>, <strong>Cypress</strong>, <strong>Selenium</strong>, <strong>Appium</strong>.</li>\n<li>Expertise in <strong>Azure DevOps</strong> (Pipelines, Boards, Test Plans, Artifacts).</li>\n<li>Familiarity with AI-powered QA tools (e.g., Testim, Mabl).</li>\n<li>Proficiency in <strong>Git</strong>, <strong>Docker</strong>, <strong>AKS</strong>, and cloud environments.</li>\n<li>Strong debugging and problem-solving skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>BDD/TDD experience with <strong>Cucumber</strong> or <strong>SpecFlow</strong>.</li>\n<li>Security testing knowledge (<strong>OWASP</strong>, <strong>ZAP</strong>).</li>\n<li>Cross-browser/device testing via <strong>BrowserStack</strong> or <strong>Sauce Labs</strong>.</li>\n<li>Service virtualization and feature flags familiarity.</li>\n</ul>\n<p><strong>Notice Period</strong>: Immediate to 30 days.</p>",
        "tags": [
            "7+ Years",
            "Azure DevOps",
            "Playwright",
            "Java"
        ],
        "summary": "Senior QA Automation Engineer role at SE-Mentor Solutions requires 7+ years of QA experience, focusing on Azure DevOps, Playwright, and Java. Responsibilities include designing test frameworks, AI-driven automation, and CI/CD pipeline integration."
    },
    {
        "job_title": "Mid-Level QA Automation Engineer",
        "company": "Se-Mentor Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26327",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2><strong>SE-Mentor Solutions (P) Ltd</strong></h2>\n<p><strong>Address:</strong> 2nd Floor, Gayathri Building, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.se-mentor.com\">http://www.se-mentor.com</a></p>\n<h3><strong>Mid-Level QA Automation Engineer</strong></h3>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@se-mentor.com\">careers@se-mentor.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We seek a Mid-Level QA Automation Engineer to advance professionally by building automation frameworks, integrating tests into Azure DevOps pipelines, and leveraging AI-powered tools for test case generation. This role offers growth in technical expertise and leadership opportunities.</p>\n<h3><strong>Location</strong></h3>\n<ul>\n<li>Trivandrum/Kochi</li>\n</ul>\n<h3><strong>Notice Period</strong></h3>\n<ul>\n<li>Immediate to within 30 Days</li>\n</ul>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Develop and maintain automation frameworks using <strong>Playwright</strong>, <strong>Cypress</strong>, or <strong>Selenium</strong> for UI testing and <strong>RestAssured</strong> or <strong>Karate</strong> for API testing.</li>\n<li>Integrate automated tests into <strong>Azure Pipelines</strong> and adopt CI/CD best practices.</li>\n<li>Collaborate on test case creation and explore AI tools (e.g., <strong>Testim</strong>, <strong>Mabl</strong>) for optimization.</li>\n<li>Execute test strategies for functional, regression, and smoke testing.</li>\n<li>Automate REST API validations and integrate with <strong>Azure DevOps Test Plans</strong>.</li>\n<li>Support performance testing using <strong>JMeter</strong> or <strong>Gatling</strong>.</li>\n<li>Track defects in <strong>Azure Boards</strong> and conduct root cause analysis.</li>\n<li>Manage test environments with <strong>Docker</strong> and <strong>Azure Kubernetes Service (AKS)</strong>.</li>\n<li>Report quality metrics and refine advanced reporting skills.</li>\n<li>Demonstrate initiative in learning automation and CI/CD best practices.</li>\n</ul>\n<h3><strong>Growth Opportunities</strong></h3>\n<p>Ideal for candidates aiming to deepen technical expertise, master AI-driven testing, and transition to senior roles. Mentorship and leadership opportunities in small initiatives are provided.</p>\n<h3><strong>Required Qualifications</strong></h3>\n<ul>\n<li><strong>3+ years</strong> in QA with <strong>2+ years</strong> in automation engineering.</li>\n<li>Proficiency in <strong>Java</strong>, <strong>Python</strong>, or <strong>TypeScript</strong>.</li>\n<li>Hands-on experience with <strong>Playwright</strong>, <strong>Cypress</strong>, or <strong>Selenium</strong>.</li>\n<li>Basic knowledge of <strong>Azure DevOps Pipelines</strong> and <strong>Boards</strong>.</li>\n<li>Familiarity with <strong>Git</strong> for version control.</li>\n<li>Strong problem-solving and debugging skills.</li>\n<li>Eagerness to learn AI-powered QA tools and advanced automation techniques.</li>\n</ul>\n<h3><strong>Preferred Qualifications</strong></h3>\n<ul>\n<li>Experience with <strong>Postman</strong>, <strong>RestAssured</strong>, or <strong>Karate</strong> for API testing.</li>\n<li>Knowledge of <strong>JMeter</strong> or <strong>Gatling</strong> for performance testing.</li>\n<li>Understanding of <strong>BDD/TDD</strong> concepts.</li>\n<li>Exposure to <strong>BrowserStack</strong> or <strong>Sauce Labs</strong> for cross-browser testing.</li>\n<li>Interest in service virtualization and feature flag testing.</li>\n</ul>\n<h3><strong>Tools &amp; Stack</strong></h3>\n<ul>\n<li><strong>Automation:</strong> Playwright, Cypress, Selenium</li>\n<li><strong>Languages:</strong> TypeScript, Java, Python</li>\n<li><strong>CI/CD:</strong> Azure DevOps Pipelines</li>\n<li><strong>API Testing:</strong> RestAssured, Karate</li>\n<li><strong>Performance:</strong> JMeter, Gatling</li>\n<li><strong>Management:</strong> Azure Boards, Azure Test Plans</li>\n<li><strong>Infra:</strong> Docker, AKS, Azure Cloud</li>\n<li><strong>AI Tools:</strong> Testim, Mabl, Functionize (learning encouraged)</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Playwright",
            "Azure DevOps Pipelines",
            "Cypress"
        ],
        "summary": "Mid-Level QA Automation Engineer to build frameworks, integrate CI/CD pipelines, and leverage AI tools. Opportunity to advance technical skills and lead initiatives."
    },
    {
        "job_title": "Customer Success - QC Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26326",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Customer Success - QC Specialist\n<strong>Experience:</strong> 5–8 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Contact Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-qc\">https://waydot.greythr.com/hire/jobs/customer-success-qc</a>\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025</p>\n<h3>Role Overview</h3>\n<p>The Customer Success QC Specialist (Mid–Senior Level) owns the quality assurance framework for customer interactions across all support channels. This role ensures high standards of communication, accuracy, and customer experience while driving continuous improvement initiatives across the Customer Success and Support teams. The specialist acts as a quality gatekeeper and a partner to training, operations, and product teams.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Quality Assurance Leadership</strong></li>\n<li>Conduct detailed audits of customer interactions (email, chat, phone, tickets) using advanced QA scorecards.</li>\n<li>Identify quality gaps at agent, process, and system levels.</li>\n<li>Lead calibrations with internal QA teams and external partners.</li>\n<li>\n<p>Maintain and evolve quality frameworks and rubrics for CS/support functions.</p>\n</li>\n<li>\n<p><strong>Coaching &amp; Skill Development</strong></p>\n</li>\n<li>Provide structured, actionable feedback to support executives and customer success specialists.</li>\n<li>Work closely with L&amp;D and Ops to implement coaching plans and refresher training.</li>\n<li>\n<p>Conduct communication etiquette, tone, and product knowledge sessions when required.</p>\n</li>\n<li>\n<p><strong>Process &amp; Compliance Ownership</strong></p>\n</li>\n<li>Ensure consistency in SOPs, escalation workflows, and service guidelines.</li>\n<li>Identify recurring defects and lead root-cause analysis (RCA).</li>\n<li>Recommend process improvements to reduce errors, improve FCR, and increase CSAT.</li>\n<li>\n<p>Ensure compliance with customer data privacy and operational standards.</p>\n</li>\n<li>\n<p><strong>Insights, Reporting &amp; Stakeholder Management</strong></p>\n</li>\n<li>Create weekly, monthly, and quarterly quality dashboards for leadership review.</li>\n<li>Present trends on CX gaps, agent performance, and customer sentiment insights.</li>\n<li>Partner with Product, CS Ops, and Support teams to improve workflows and customer journey experience.</li>\n<li>\n<p>Track impact of implemented improvements and coaching cycles.</p>\n</li>\n<li>\n<p><strong>Tools &amp; Systems</strong></p>\n</li>\n<li>Experience with Zendesk, Freshdesk, Salesforce, Intercom, or similar platforms.</li>\n<li>Ability to work with QA tools, knowledge bases, reporting dashboards, and analytics platforms.</li>\n<li>Manage and continuously update QA documentation, SOPs, and knowledge articles.</li>\n</ol>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>5–8 years of experience in Customer Success, Customer Support QA/QC, or CX Quality roles.</li>\n<li>Strong expertise in customer interaction evaluation and quality frameworks.</li>\n<li>Excellent written and verbal communication skills with strong attention to detail.</li>\n<li>Ability to diagnose behavioural, technical, and communication issues.</li>\n<li>Experience running calibrations, RCAs, and process improvement initiatives.</li>\n<li>Strong analytical skills with experience in quality reporting and dashboards.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Exposure to SaaS support environments or global customer bases.</li>\n<li>Experience coaching support teams at scale.</li>\n<li>Knowledge of metrics such as CSAT, FCR, NPS, QA accuracy, AHT, and SLA adherence.</li>\n<li>Experience handling multilingual or culturally diverse customer interactions.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "QA/QC",
            "Customer Success",
            "SaaS"
        ],
        "summary": "Customer Success QC Specialist ensures quality in customer interactions, driving improvements in support processes for a leading auto super app with 10M+ users."
    },
    {
        "job_title": "Finance Executive/ Financial Analyst",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26325",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Finance Executive/ Financial Analyst\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Closing Date:</strong> 01, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>Role Overview</h3>\n<p>We are looking for a results-driven <strong>CA-qualified</strong> Finance Professional with <strong>2–3 years of experience</strong> in <strong>FP&amp;A</strong>, accounting, financial reporting, and reconciliations. The ideal candidate should have hands-on expertise in working closely with businesses, preparing financial statements, AR / AP processes, and working with ERP systems.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Financial Planning &amp; Analysis</strong>\n- Be a strong business partner in driving financial analysis &amp; providing insights on financial performance\n- Coordinate &amp; lead annual / quarterly / monthly forecasts\n- Month close activities\n- Analysis of forecast vs. actuals &amp; drivers for the same</p>\n<p><strong>Financial Accounting &amp; Reporting</strong>\n- Prepare monthly, quarterly, and annual financial statements in compliance with accounting standards\n- Handle revenue and cost booking, including POC method and contract completion method\n- Perform monthly P&amp;L, balance sheet, and cash flow analysis\n- Maintain accurate general ledger accounts and prepare balance sheet schedules</p>\n<p><strong>Reconciliation &amp; Compliance</strong>\n- Conduct AP/AR reconciliation and intercompany reconciliation\n- Assist in statutory, internal, and external audits with timely submission of documentation</p>\n<p><strong>Budgeting &amp; Costing</strong>\n- Support preparation of monthly budgets, cash flow forecasts, and variance analysis\n- Prepare cost variation reports and perform revenue–cost reconciliation for ongoing projects</p>\n<p><strong>Accounts Payable / Receivable</strong>\n- Manage vendor payments, invoice processing, and staff expense claims\n- Track receivables, revenue entries, and client invoice preparation\n- Monitor advances, inventory booking, asset depreciation updates, and petty cash statements</p>\n<p><strong>ERP &amp; Tools</strong>\n- Work extensively with <strong>SAP / Tally / ERP systems</strong>, <strong>MS Excel (advanced)</strong>, <strong>Power BI</strong>, and <strong>SQL</strong> for financial reporting and analysis</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong knowledge of accounting standards and financial principles</li>\n<li>Proficiency in <strong>SAP / Tally / ERP applications</strong></li>\n<li><strong>Advanced Excel</strong>, <strong>Power BI</strong>, <strong>SQL</strong> skills</li>\n<li>Excellent analytical, reconciliation, and problem-solving abilities</li>\n<li>Strong attention to detail and accuracy</li>\n<li>Ability to work with cross-functional teams and meet monthly deadlines</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong></li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong></li>\n<li>Dynamic, fast-paced, and innovation-driven work culture</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/finance-executive\">https://waydot.greythr.com/hire/jobs/finance-executive</a></p>",
        "tags": [
            "2-3 Years",
            "SAP/Tally/ERP",
            "Advanced Excel",
            "Power BI/SQL"
        ],
        "summary": "CA-qualified Finance Executive/Financial Analyst with 2-3 years in FP&A, accounting, and ERP systems to drive financial analysis and reporting for a leading US auto super app."
    },
    {
        "job_title": "Lead - Product Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26324",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Lead Product Designer\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Closing Date:</strong> 01, Jan 2026\n<strong>Published Date:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Role Overview</strong></p>\n<p>We’re seeking a Lead Product Designer to own end-to-end product experiences, raise design standards, and drive outcomes—not just deliver screens. You’ll lead core product design, collaborate with Product, Engineering, Growth, and Leadership, and report to the Head of Design. Ideal candidates are current Leads or Seniors ready to elevate their careers.</p>\n<p><strong>Key Responsibilities</strong>\n- End-to-end design for key verticals\n- Define UX strategy, drive research, and ship high-quality flows/UI\n- Elevate visual/UI standards across the product ecosystem\n- Influence product roadmaps using data, customer insights, and business context\n- Align cross-functionally to simplify ambiguity and ensure design integration\n- Own lean, effective design workflows\n- Mentor junior designers, provide critique, guide hiring, and shape team culture\n- Evolve Way.com’s design system for scalability</p>\n<p><strong>Preferred Skills</strong>\n- 7–10+ years of product design experience, with 3+ years in a lead/senior role\n- Strong portfolio showcasing complex problem-solving, consumer app work, and high-quality UI\n- Proven ability to drive outcomes, not just outputs\n- Comfort with fast-paced environments, ambiguity, and data-driven decisions\n- Experience in discovery, research, prototyping, and iterative testing\n- Expertise in Figma and modern design tools\n- Strong communication: direct, clear, and decisive\n- Ability to influence product, engineering, and leadership without compromising clarity</p>\n<p><strong>Why Join Us?</strong>\n- Opportunity to lead the #1 Auto Super app in the US\n- Impact 10+ million users with innovative solutions\n- Dynamic, fast-paced, innovation-driven culture\n- Clear career growth in a rapidly scaling tech company\n- Competitive compensation</p>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/lead-product-designer\">https://waydot.greythr.com/hire/jobs/lead-product-designer</a></p>",
        "tags": [
            "7–10+ Years",
            "Figma",
            "UX/UI Design",
            "Product Design"
        ],
        "summary": "Lead Product Designer to drive end-to-end design for a top US auto super app, impacting 10M+ users with innovative solutions."
    },
    {
        "job_title": "IT System - Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26323",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title</strong>: IT System Engineer\n<strong>Experience</strong>: 2–4 years\n<strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time</p>\n<p><strong>Role Overview</strong>\nWe are seeking an experienced IT System Engineer with 2–4 years of experience in IT infrastructure management, Office 365 administration, and system support. The ideal candidate will have hands-on experience in Linux and Windows environments, networking (Fortigate or similar routers), and cloud-based server deployments. The role also involves infrastructure monitoring using Grafana, Zabbix, or similar tools, with opportunities to grow into DevOps and automation domains.</p>\n<p><strong>Key Responsibilities</strong>\n- Provide technical support and troubleshooting for hardware, software, and networking issues.\n- Manage and maintain IT infrastructure, ensuring uptime, performance, and security.\n- Administer and support Office 365, including Exchange Online, Teams, SharePoint, and OneDrive.\n- Configure and manage Fortigate routers/firewalls and VPN connections.\n- Perform Linux system administration – user management, configurations, patching, and updates.\n- Support Windows environments for installation, configuration, and maintenance.\n- Deploy and manage virtual machines (VMs) on cloud platforms such as DigitalOcean and OVH.\n- Implement and manage infrastructure monitoring using Grafana, Zabbix, or similar tools.\n- Maintain IT documentation, system configurations, and internal knowledge base.\n- Collaborate with teams to support the transition toward DevOps workflows and infrastructure automation.</p>\n<p><strong>Preferred Skills</strong>\n- Bachelor’s degree in Computer Science, Information Technology, or a related field.\n- 2–4 years of experience in IT Support, System Administration, or Infrastructure Engineering.\n- Hands-on experience with Office 365 administration.\n- Strong understanding of Fortigate routers/firewalls and networking fundamentals.\n- High-level knowledge of Linux administration.\n- Experience with cloud VM management (DigitalOcean, OVH, or equivalent).\n- Familiarity with monitoring tools such as Grafana, Zabbix, or similar platforms.\n- Strong troubleshooting, analytical, and problem-solving skills.\n- Excellent communication and documentation abilities.\n- Willingness to work in rotational shifts.</p>\n<p><strong>Why You Will Love Working With Us</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Opportunity to make a meaningful impact across 10+ million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth in a rapidly scaling technology company.\n- Competitive compensation.</p>\n<p><strong>Contact Email</strong>: careers@way.com\n<strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/it-system-engineer\">https://waydot.greythr.com/hire/jobs/it-system-engineer</a></p>",
        "tags": [
            "2-4 Years",
            "Office 365 Administration",
            "Fortigate Routers/Firewalls",
            "Linux Administration"
        ],
        "summary": "IT System Engineer role at Way.com requires 2-4 years of experience in IT infrastructure, Office 365, and Linux/Windows environments. Opportunity to work for a leading US auto super app with growth into DevOps."
    },
    {
        "job_title": "Communication Trainer - English",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26322",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>Way.Com India Pvt Ltd</h2>\n<p><strong>Address:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a>\n<strong>Contact Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a></p>\n<h3>About Us</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, EV charging, parking, and more. Recognized by Bloomberg and ranked #48 on Andreessen Horowitz’s fastest-growing companies list, we leverage AI and data analytics to redefine car ownership.</p>\n<h3>Job Title</h3>\n<p><strong>English Communication Trainer</strong></p>\n<h3>Work Arrangement</h3>\n<p>On-site training/WFO</p>\n<h3>Employment Type</h3>\n<p>Contract</p>\n<h3>Role Overview</h3>\n<p>We seek an experienced <strong>English Communication Trainer</strong> to deliver offline corporate training for Customer Support teams. The role focuses on enhancing communication quality, customer-handling skills, grammar accuracy, and service language proficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct offline training for customer support executives across <strong>voice, email, and chat processes</strong>.</li>\n<li>Train on <strong>professional communication</strong>, <strong>customer empathy</strong>, <strong>tone &amp; clarity</strong>, <strong>neutral accent</strong>, and <strong>grammar usage</strong>.</li>\n<li>Develop modules for:</li>\n<li>Spoken English</li>\n<li>Business communication</li>\n<li>Customer handling phrases &amp; scripts</li>\n<li>Call/email/chat etiquette</li>\n<li>Evaluate learners via <strong>role plays, call simulations, mock chats/emails</strong>, and assessments.</li>\n<li>Identify communication gaps and create <strong>customized training</strong> for new hires and existing employees.</li>\n<li>Provide <strong>actionable feedback</strong> to improve language proficiency and customer interactions.</li>\n<li>Track performance, maintain reports, and collaborate with managers/QA teams for improvement.</li>\n<li>Foster an <strong>engaging classroom environment</strong>.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>4–7 years</strong> of experience as a Communication/English Trainer in <strong>BPO, Customer Support, or Corporate Training</strong>.</li>\n<li>Strong command of <strong>spoken/written English</strong> with simplification skills.</li>\n<li>Experience in <strong>voice, email, or chat process training</strong> (preferred).</li>\n<li>Excellent <strong>presentation, facilitation, and coaching</strong> skills.</li>\n<li>Ability to handle diverse learners and drive measurable improvement.</li>\n</ul>\n<h3>Preferred Attributes</h3>\n<ul>\n<li>Certification in <strong>communication training, TEFL/TESOL, or soft skills</strong> (added advantage).</li>\n<li>Experience with <strong>customer support KPIs</strong> (CSAT, quality scores, AHT impact).</li>\n<li>Strong understanding of <strong>customer service language</strong> and <strong>escalation handling</strong>.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with meaningful training.</li>\n<li>Dynamic, innovation-driven culture in a <strong>rapidly scaling tech company</strong>.</li>\n<li><strong>Competitive compensation</strong> and clear career growth pathways.</li>\n</ul>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer\">https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer</a></p>",
        "tags": [
            "4–7 Years",
            "Communication Training",
            "Customer Support",
            "Corporate Training"
        ],
        "summary": "Way.com seeks an English Communication Trainer to enhance customer support teams' communication skills through offline training, focusing on customer interactions and service language proficiency. The role offers opportunities in a dynamic tech environment with a leading auto super app."
    },
    {
        "job_title": "Sales Expert",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26321",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p><strong>Sales Expert</strong></p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking dynamic, customer-focused <strong>Sales Experts</strong> to join our <strong>Refinance Team</strong>. In this role, you will be the voice of our product — engaging directly with customers, understanding their needs, and helping them choose the best refinance solutions. This is a <strong>B2C sales role</strong>, where communication skills, persuasion, and a passion for sales will make all the difference.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Engage with potential customers through <strong>inbound and outbound calls, emails, and chats</strong>.</li>\n<li>Clearly explain refinance products, features, and benefits to customers.</li>\n<li>Build <strong>trust and rapport</strong> with customers to convert inquiries into successful sales.</li>\n<li>Consistently <strong>achieve individual and team sales targets</strong>.</li>\n<li>Maintain accurate records of customer interactions and transactions in <strong>CRM systems</strong>.</li>\n<li>Collaborate with <strong>Customer Support, Product, and Marketing teams</strong> to ensure a smooth post-sale experience.</li>\n<li>Stay updated on <strong>product knowledge, process updates, and industry trends</strong>.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s or Master’s degree in any discipline (preferably Business or Engineering).</li>\n<li><strong>2–5 years of experience</strong> in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and <strong>experience with CRM tools</strong>.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Apply Now</h2>\n<p><a href=\"https://waydot.greythr.com/hire/jobs/sales-expert\">Apply Now</a></p>\n<h2>Contact Information</h2>\n<p><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Address</strong>: Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>",
        "tags": [
            "2–5 Years",
            "B2C Sales",
            "CRM Tools",
            "Communication Skills"
        ],
        "summary": "Sales Expert role at Way.com, a leading US auto super app, focusing on B2C refinance sales with CRM tools and customer engagement."
    },
    {
        "job_title": "Senior - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26320",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Way.com India Pvt Ltd</strong></p>\n<p><strong>Position</strong>: Senior Marketing Designer\n<strong>Location</strong>: Trivandrum\n<strong>Type</strong>: Full-time/WFO role\n<strong>Contact Email</strong>: careers@way.com</p>\n<h3>About Way.com</h3>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Role Overview</h3>\n<p>We’re seeking a <strong>Senior Marketing Designer</strong> who loves turning ideas into visuals that perform. You’ll design high-impact campaigns, ads, and visuals across platforms — from paid media to social and email — collaborating with the creative, growth, and product teams.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Create digital ad creatives, banners, and social visuals for ongoing campaigns.</li>\n<li>Conceptualize visuals for product launches and seasonal campaigns.</li>\n<li>Design for performance with a balance of creativity and clarity.</li>\n<li>Work with copywriters, growth managers, and product designers.</li>\n<li>Execute designs that fit Way.com’s visual brand and tone.</li>\n<li>Explore motion and storytelling to drive engagement.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>3–5 years</strong> of experience in marketing design or growth design.</li>\n<li>Proficiency in <strong>Figma</strong>, <strong>Photoshop</strong>, <strong>Illustrator</strong>, and <strong>After Effects</strong>.</li>\n<li>Strong sense of layout, typography, and storytelling.</li>\n<li>Understanding of digital marketing and ad metrics.</li>\n<li>A portfolio that shows creativity and an eye for detail.</li>\n<li>Eagerness to learn, collaborate, and grow fast in a creative environment.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/senior-marketing-designer\">Senior Marketing Designer Application</a></p>",
        "tags": [
            "3–5 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Senior Marketing Designer needed to create high-impact campaigns and visuals for Way.com, a leading automotive super app. Requires 3–5 years of experience in marketing design with proficiency in Figma, Photoshop, and Illustrator."
    },
    {
        "job_title": "Lead - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26319",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Way.com India Pvt Ltd</strong></p>\n<p><strong>Position:</strong> Lead - Marketing Designer\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Closing Date:</strong> 01, Jan 2026\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>About Way.com</h3>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Role Overview</h3>\n<p>We’re seeking a <strong>Lead Marketing Designer</strong>—a hands-on creative leader who can turn strategy into striking visuals and campaigns. You’ll lead the creative direction across digital marketing, brand campaigns, and performance ads, guiding a small team of designers while staying close to execution.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead and manage a team of marketing designers.</li>\n<li>Develop and execute creative strategy across paid, owned, and social channels.</li>\n<li>Drive campaign concepts for product launches, seasonal pushes, and partnerships.</li>\n<li>Maintain a consistent visual identity across Way.com’s global marketing ecosystem.</li>\n<li>Partner with Growth, Product, and Content teams to create high-performing visuals.</li>\n<li>Inspire creative excellence and mentor designers to elevate craft quality.</li>\n<li>Balance creativity with marketing performance and data-driven decisions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>6–10 years</strong> of experience in marketing design, art direction, or brand design.</li>\n<li>Proven experience leading creative or design teams.</li>\n<li>Strong portfolio showcasing campaign systems, digital storytelling, and ad design.</li>\n<li>Expertise in <strong>Figma, Photoshop, Illustrator, After Effects / Premiere Pro</strong>.</li>\n<li>Experience in <strong>performance design</strong> and knowledge of CTR, engagement metrics, and creative testing.</li>\n<li>Strong visual storytelling and typography skills.</li>\n<li>A passion for clean, modern, and conversion-friendly design.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/lead-marketing-designer\">https://waydot.greythr.com/hire/jobs/lead-marketing-designer</a></p>",
        "tags": [
            "6–10 Years",
            "Figma",
            "Photoshop",
            "Performance Design"
        ],
        "summary": "Lead Marketing Designer to lead creative strategy and campaigns for Way.com, a top US auto super app. Requires 6–10 years of experience and expertise in design tools like Figma and Photoshop."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26318",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title</strong>: Project Manager\n<strong>Experience</strong>: 8+ years\n<strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time\n<strong>Closing Date</strong>: 01, Jan 2026\n<strong>Contact Email</strong>: careers@way.com\n<strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/project-manager\">https://waydot.greythr.com/hire/jobs/project-manager</a></p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking a seasoned <strong>Project Manager</strong> with <strong>8+ years of experience</strong> to oversee and drive strategic projects from initiation to completion. The ideal candidate will bring strong leadership, domain expertise, and hands-on execution skills to ensure successful delivery within scope, timeline, and budget.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Lead the full project lifecycle across multiple <strong>medium to large-scale initiatives</strong>.</li>\n<li>Define and manage <strong>project scope, objectives, deliverables, and success criteria</strong>.</li>\n<li>Develop and execute detailed project plans, including <strong>resource allocation, timelines, and budgets</strong>.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate when required.</li>\n<li>Manage <strong>stakeholder relationships</strong>, ensuring clear communication and alignment at all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams to ensure smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes and policies.</li>\n<li>Mentor and guide junior team members to build project management capability within the team.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Bachelor’s degree in <strong>Engineering, Business Administration, or related field</strong> (Master’s degree is an advantage).</li>\n<li><strong>8+ years</strong> of proven project management experience, preferably in fintech platforms.</li>\n<li>Strong expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in <strong>project management tools</strong> (MS Project, JIRA, Asana, Trello, or similar).</li>\n<li>In-depth knowledge of <strong>Agile, Waterfall, or hybrid project management methodologies</strong>.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities under pressure.</li>\n<li>Certifications such as <strong>PMP, PRINCE2, or Agile (Scrum Master/SAFe)</strong> are highly preferred.</li>\n<li>Experience with tools like <strong>MPP</strong>.</li>\n<li>Ability to work with <strong>multiple teams</strong>, drive for execution &amp; results.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/project-manager\">https://waydot.greythr.com/hire/jobs/project-manager</a></p>",
        "tags": [
            "8+ Years",
            "Agile",
            "Project Management Tools",
            "PMP Certification"
        ],
        "summary": "Lead large-scale projects for a top US auto super app with 8+ years of experience in Agile methodologies and cross-functional team collaboration."
    },
    {
        "job_title": "SEO Team Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26317",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title</strong>: Team Lead - SEO\n<strong>Experience</strong>: 9-11 years\n<strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a highly skilled <strong>Team Lead, SEO</strong> to spearhead our organic growth initiatives and enhance our search engine presence. In this leadership role, you will drive the development and execution of comprehensive SEO strategies, manage a team of SEO specialists, and collaborate cross-functionally to optimize our digital footprint. If you have a deep understanding of search algorithms, technical SEO, and content strategy, along with a passion for driving results, we want to hear from you!</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies</strong>: Define and implement a robust SEO roadmap, ensuring alignment with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team</strong>: Manage a team of SEO professionals, fostering a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO</strong>: Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management</strong>: Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making</strong>: Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration</strong>: Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization</strong>: Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis</strong>: Conduct SEO audits, monitor competitor strategies, and identify new opportunities to stay ahead in the industry.</li>\n<li><strong>SEO Performance Reporting</strong>: Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data to make data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email</strong>: careers@way.com\n<strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/seo-team-lead\">https://waydot.greythr.com/hire/jobs/seo-team-lead</a></p>",
        "tags": [
            "9-11 Years",
            "Technical SEO",
            "Google Analytics",
            "Ahrefs"
        ],
        "summary": "Lead SEO strategies and team for a top US auto super app, driving organic growth through technical SEO and data-driven insights. Requires 9-11 years of experience with team leadership and advanced SEO tools."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26316",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p><strong>Spanish Customer Success Executive</strong></p>\n<h2>Work Arrangement</h2>\n<p><strong>On-site</strong></p>\n<h2>Employment Type</h2>\n<p><strong>Full-time</strong></p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a <strong>Spanish Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our Spanish-speaking clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction</strong>: Manage inbound and outbound calls, delivering prompt and effective resolutions to customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence</strong>: Provide empathetic, professional support to ensure a positive customer experience in every interaction.</li>\n<li><strong>Issue Escalation</strong>: Identify, prioritize, and escalate complex cases to the appropriate departments for swift resolution.</li>\n<li><strong>Documentation</strong>: Maintain accurate records of customer interactions and keep databases up to date.</li>\n<li><strong>Performance Goals</strong>: Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge</strong>: Stay informed on company products and services to provide customers with accurate and up-to-date information.</li>\n<li><strong>Team Collaboration</strong>: Work closely with colleagues to foster a supportive, collaborative, and high-performing work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Fluent in both Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li><strong>Proven experience</strong> in a customer service role, preferably in a voice process.</li>\n<li><strong>Strong interpersonal and communication skills</strong>, with a patient and empathetic approach.</li>\n<li><strong>Ability to multitask</strong> and <strong>manage time efficiently</strong> in a fast-paced environment.</li>\n<li><strong>Familiarity with automotive services</strong>, fintech platforms, or similar industries is an advantage.</li>\n<li><strong>Flexibility to work in shifts</strong> and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a <strong>meaningful impact</strong> across 10+ million users.</li>\n<li><strong>Dynamic, fast-paced</strong>, and innovation-driven work culture.</li>\n<li><strong>Clear pathways for career growth</strong> in a rapidly scaling technology company.</li>\n<li><strong>Competitive compensation</strong>.</li>\n</ul>\n<p><strong>Contact Email</strong>: careers@way.com\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\">https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</a></p>",
        "tags": [
            "2-4 Years",
            "Bilingual (Spanish/English)",
            "Customer Service",
            "AI & Data Analytics"
        ],
        "summary": "Spanish-speaking Customer Success Executive needed for a tech-driven automotive super app. Deliver service excellence and resolve client queries in a fast-paced environment."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26315",
        "location": "Technopark",
        "closing_date": "01 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Customer Success Executive</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a <strong>Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Address customer queries through <strong>phone, email, chat, and social media channels</strong>.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to <strong>products, orders, returns, and general support requests</strong>.</li>\n<li>Maintain accurate <strong>customer records and feedback</strong> in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking <strong>customer satisfaction metrics</strong> and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Proven experience (2-5 years)</strong> in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a></li>\n</ul>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Customer Service",
            "Problem-Solving"
        ],
        "summary": "Customer Success Executive for US-based auto super app; 2-5 years experience required to manage customer queries via multiple channels and improve satisfaction metrics."
    },
    {
        "job_title": "Institutional Sales Executive",
        "company": "Xminds Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/26314",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Xminds Infotech (P) Ltd</strong></p>\n<p><strong>Address:</strong> T4 &amp; T8, 7th, Thejaswini, Technopark Rd, Technopark Campus, Phase I, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.xminds.com\">www.xminds.com</a>\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@xminds.com\">careers@xminds.com</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>confident, relationship-driven Institutional Sales Executive</strong> to promote our VR Lab solutions to educational institutions. The role involves on-ground sales, demonstrations, partnership building, and market intelligence.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Institutional Sales &amp; Outreach</strong></li>\n<li>Visit engineering colleges, universities, polytechnics, and professional institutions.</li>\n<li>Meet HODs, Principals, Deans, Lab Heads, and Academic Coordinators.</li>\n<li>\n<p>Present VR Lab concepts, benefits, and academic value.</p>\n</li>\n<li>\n<p><strong>Product Demonstration</strong></p>\n</li>\n<li>Conduct live demos of VR headsets and learning modules.</li>\n<li>Explain VR-based learning of engine components, assembly, and functioning.</li>\n<li>\n<p>Address technical, academic, and ROI-related questions from decision-makers.</p>\n</li>\n<li>\n<p><strong>Relationship Management</strong></p>\n</li>\n<li>Build long-term relationships with academic/administrative stakeholders.</li>\n<li>Follow up on proposals, approvals, and pilot programs.</li>\n<li>\n<p>Act as a single point of contact for assigned institutions.</p>\n</li>\n<li>\n<p><strong>Sales &amp; Closure</strong></p>\n</li>\n<li>Convert leads into paid VR Lab installations or pilot programs.</li>\n<li>Coordinate with internal teams for pricing, proposals, and onboarding.</li>\n<li>\n<p>Achieve monthly/quarterly sales targets.</p>\n</li>\n<li>\n<p><strong>Market Intelligence</strong></p>\n</li>\n<li>Gather insights on curriculum needs, competitor solutions, and budget cycles.</li>\n<li>Provide feedback to product and leadership teams.</li>\n</ol>\n<h3>Key Competencies</h3>\n<ul>\n<li>Strong communication and presentation skills.</li>\n<li>Confidence to engage with HODs, Deans, and senior academicians.</li>\n<li>Ability to simplify technical products into value-driven explanations.</li>\n<li>Comfort with field sales, travel, and on-site demonstrations.</li>\n<li>Negotiation and closing skills.</li>\n</ul>\n<h3>Personality Traits</h3>\n<ul>\n<li>Professional and well-presented.</li>\n<li>Self-driven and target-oriented.</li>\n<li>Curious about VR, EdTech, and emerging technologies.</li>\n<li>Patient listener with a consultative selling approach.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary + performance-based incentives.</li>\n<li>Opportunity to work with cutting-edge VR education technology.</li>\n<li>Strong growth potential in EdTech and immersive learning.</li>\n<li>Direct exposure to academic leaders and institutions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Educational Background:</strong> Bachelor’s degree in Engineering, Science, Business, or related field (MBA/EdTech background preferred).\n<strong>Experience:</strong> 2–5 years in B2B/Institutional/Education sales; prior experience selling to colleges/universities is a plus.</p>",
        "tags": [
            "2–5 Years",
            "VR Technology",
            "Education Sales",
            "B2B Sales"
        ],
        "summary": "Institutional Sales Executive to promote VR Lab solutions to colleges and universities, focusing on relationship-building, product demonstrations, and closing partnerships in the EdTech sector."
    },
    {
        "job_title": "ACADEMIC COUNSELLOR'S /TELE CALLING EXECUTIVES (Female Fresher/Experienced Candidates)",
        "company": "Doubtbox Edutainment (P) Ltd",
        "url": "https://technopark.org/job-details/26313",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Company Overview</h2>\n<p>Doubtbox Edutainment (P) Ltd is a prominent Personalised LIVE Learning platform catering to students of classes 1-12 under CBSE/ICSE/State Boards. With a decade of experience and distribution through Malayala Manorama, Doubtbox has benefited over 100,000 students. Backed by the Times of India group and recognized as the best EdTech start-up of 2020 by Amazon Edstart, the platform is expanding into the Middle East.</p>\n<h2>Job Summary</h2>\n<p><strong>Role:</strong> Academic Counsellor / Telecalling Executive\n<strong>Location:</strong> Technopark, Thiruvananthapuram\n<strong>Walk-In Dates:</strong> 30, Dec 2025 - 31, Dec 2025\n<strong>Timing:</strong> 10:30 AM - 5:00 PM\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact:</strong> hr@doubtbox.com</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Conduct outbound calls to potential/existing customers (parents of Class 1-12 students)</li>\n<li>Work from Technopark, Thiruvananthapuram</li>\n<li>Introduce products/services, explain features, and highlight benefits</li>\n<li>Follow/adapt company scripts for customer engagement</li>\n<li>Identify and qualify sales leads by understanding customer needs</li>\n<li>Maintain accurate records of interactions and update databases</li>\n<li>Address customer inquiries, resolve complaints, and provide solutions</li>\n<li>Collaborate with sales teams to meet targets</li>\n<li>Stay updated on product knowledge and industry trends</li>\n<li>Meet daily/weekly/monthly performance targets for call volume, conversion rates, and sales</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor's degree in any stream</li>\n<li>Proven experience in telemarketing, sales, or customer service</li>\n<li>Excellent verbal/written communication with a pleasant telephone manner</li>\n<li>Strong persuasion/negotiation skills</li>\n<li>Ability to work in a fast-paced environment with multitasking</li>\n<li>Good organizational skills with attention to detail</li>\n<li>Proficiency in MS Office and CRM software</li>\n<li>Positive attitude, resilience, and professional handling of rejection</li>\n<li>Willingness to work flexible hours (evenings/weekends)</li>\n</ul>\n<h3>Walk-In Venue</h3>\n<p><strong>Address:</strong> Doubtbox Edutainment (P) Ltd, 1st Floor, Nila Building, Technopark Phase 1, Trivandrum\n<strong>Eligibility:</strong> Female Candidates Only\n<strong>Working Hours:</strong> 9:30 AM - 6:30 PM</p>\n<h3>Entry Pass Instructions</h3>\n<ul>\n<li>Apply for a Technopark entry pass via mobile app/website (vms.technopark.org)</li>\n<li>Entry pass sent to registered mobile/email; show softcopy at the gate</li>\n<li>Non-smartphone users can print hardcopy using 5-digit OTP at kiosks near Main Gate</li>\n<li>Original certificates verified at the entry gate</li>\n</ul>\n<h3>Mobile App &amp; Website</h3>\n<ul>\n<li><a href=\"#\">Android App</a></li>\n<li><a href=\"#\">iOS App</a></li>\n<li><a href=\"vms.technopark.org\">Entry Pass Portal</a></li>\n<li><a href=\"#\">User Manual</a></li>\n</ul>",
        "tags": [
            "0+ Years",
            "Communication Skills",
            "CRM Software",
            "Sales & Customer Service"
        ],
        "summary": "Doubtbox seeks Academic Counsellors/Telecalling Executives to conduct outbound calls, promote educational services, and meet sales targets. Requires strong communication, CRM proficiency, and sales skills."
    },
    {
        "job_title": "PHP Developaer",
        "company": "Hiworth Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26312",
        "location": "Technopark",
        "closing_date": "25 Jan 2026",
        "job_description": "<h2>Hiworth Solutions (P) Ltd</h2>\n<p><strong>Location:</strong> C-23, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.hiworthsolutions.com\">http://www.hiworthsolutions.com</a>\n<strong>Job Title:</strong> PHP Developer\n<strong>Closing Date:</strong> 25, Jan 2026\n<strong>Published On:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> hr@hiworthsolutions.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking talented and adaptive PHP Developers with <strong>minimum 3 years of experience</strong> in core PHP/Laravel projects. Responsibilities include:\n- PHP/Laravel-based software program development\n- CMS website development using Pyro/WordPress frameworks\n- Theme integration, plugin installation/editing for client needs\n- E-commerce application development with shopping carts and payment gateways</p>\n<h3>Preferred Skills</h3>\n<ol>\n<li>Strong CMS application development expertise with plugin/theme customization</li>\n<li>Proficiency in PHP5 and proven Laravel application development experience</li>\n<li>MySQL knowledge with added advantage in HTML, XML, CSS, AJAX</li>\n<li>Understanding of MVC design patterns</li>\n<li>Front-end skills in JavaScript, HTML5, CSS3</li>\n<li>Scalable application design principles</li>\n<li>SQL/MySQL database familiarity</li>\n<li>Experience with Laravel, Magento, or WordPress preferred</li>\n<li>Proven ability to develop standalone applications independently</li>\n</ol>",
        "tags": [
            "3+ Years",
            "PHP",
            "Laravel",
            "MySQL"
        ],
        "summary": "Hiworth Solutions seeks PHP Developers with 3+ years of experience in Laravel, CMS, and e-commerce. Requires strong PHP, Laravel, and MySQL skills for scalable application development."
    },
    {
        "job_title": "Junior Python Developer (Gen AI Experience)",
        "company": "Tiltlabs Consultancy Services (P) Ltd",
        "url": "https://technopark.org/job-details/26311",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Company Info</h2>\n<p><strong>TILTLABS CONSULTANCY SERVICES (P) Ltd</strong>\nGH, Ground Floor, Carnival Technopark Building, Technopark, Trivandrum, Kerala, India - 695581\n<a href=\"http://www.tiltlabs.io\">Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Job Title:</strong> Junior Python Developer (GenAI Experience)\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@tiltlabs.io\">careers@tiltlabs.io</a></p>\n<h2>Job Summary</h2>\n<p>We are seeking a skilled Python Developer with <strong>GenAI implementation experience</strong> to join our team. The ideal candidate should have hands-on experience in Python, FastAPI, SQLAlchemy, API development, and applying Generative AI use cases in real-world applications.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Develop, test, and deploy RESTful APIs using FastAPI.</li>\n<li>Build and optimize backend services and workflows using Python and SQLAlchemy.</li>\n<li>Integrate GenAI models (OpenAI, Hugging Face, LangChain, or similar) into product features.</li>\n<li>Work with vector databases, embeddings, prompt engineering, and LLM pipelines.</li>\n<li>Collaborate with cross-functional teams to translate requirements into technical solutions.</li>\n<li>Optimize system performance, ensure scalability, and maintain code quality.</li>\n<li>Debug, troubleshoot, and resolve application issues.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n</ul>\n<h2>Required Skills</h2>\n<ul>\n<li><strong>Strong proficiency in Python</strong></li>\n<li><strong>Experience in FastAPI and API-based applications</strong></li>\n<li><strong>Hands-on experience with SQLAlchemy and relational databases</strong></li>\n<li>Understanding of GenAI concepts:</li>\n<li>LLMs and prompt engineering</li>\n<li>Building AI-powered APIs</li>\n<li>Working with embeddings, RAG, and model fine-tuning</li>\n<li>Familiarity with Git, CI/CD pipelines, and cloud platforms (AWS/GCP/Azure preferred)</li>\n<li>Strong problem-solving and debugging skills</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Experience with Docker, Kubernetes, or containerized deployments</li>\n<li>Knowledge of vector databases like Pinecone, ChromaDB, FAISS</li>\n<li>Exposure to microservices architecture</li>\n<li>Understanding of machine learning fundamentals</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Candidates must include the following details in the email body:\n- Relevant Experience\n- Current CTC\n- Expected CTC\n- Availability to join immediately</p>",
        "tags": [
            "2-3 Years",
            "Python",
            "FastAPI",
            "SQLAlchemy"
        ],
        "summary": "Junior Python Developer with GenAI experience needed for API development and AI integration. Requires Python, FastAPI, and SQLAlchemy expertise with 2-3 years of experience."
    },
    {
        "job_title": "Senior DevAIOps Engineer - Lead Role",
        "company": "Eartheye Space Private Limited",
        "url": "https://technopark.org/job-details/26310",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<h2>Senior DevAIOps Engineer - Lead Role</h2>\n<p><strong>Company:</strong> Eartheye Space Private Limited\n<strong>Location:</strong> STPI BUILDING, Technopark, Karyavattom P. O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"https://eartheye.space\">https://eartheye.space</a>\n<strong>Closing Date:</strong> 12, Feb 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> apply@eartheye.space</p>\n<h3>Role Overview</h3>\n<p>As the software development and GenAI AI/ML teams grow, a senior DevAIOps lead engineer is the glue that binds the teams' work together. This role requires managing user access, health and vulnerability checks, software updates, Git operations, CI/CD pipelines, AWS environment management (including IaC, serverless, private endpoint access, container deployment and orchestration), ML model deployment, drift management pipelines, and observability/reporting. The team operates in a fast-paced, high-performing environment with weekly micro-releases.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Oversee automated infrastructure and data pipelines.</li>\n<li>Manage CI/CD, AWS environment (IaC, serverless, private endpoints), and container orchestration.</li>\n<li>Ensure ML model deployment, drift management, and system observability.</li>\n<li>Coordinate cross-functional teams to align DevAIOps practices with development and AI/ML workflows.</li>\n</ul>\n<h3>Compensation &amp; Benefits</h3>\n<ul>\n<li>Salary will be <strong>doubled</strong> for qualified candidates based on their last three months' pay.</li>\n<li>Eligibility for ESOPs and RSUs.</li>\n<li>Preference for candidates who can start within 30 days.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>8+ years</strong> of experience in designing, building, and managing automated infrastructure and data pipelines.</li>\n<li>Proficiency in workflow automation.</li>\n<li><strong>AWS Certification</strong> is preferred.</li>\n</ul>\n<p>Apply via <strong>apply@eartheye.space</strong> for immediate consideration.</p>",
        "tags": [
            "8+ Years",
            "AWS",
            "CI/CD",
            "DevAIOps"
        ],
        "summary": "Lead DevAIOps Engineer to manage infrastructure, automation, and CI/CD. Salary doubled for qualified candidates with 8+ years of experience."
    },
    {
        "job_title": "Content Creator",
        "company": "Tigrid Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26309",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<p><strong>TIGRID TECHNOLOGIES (P) Ltd</strong></p>\n<p><strong>Address:</strong> 1st FLOOR, M SQUARED MAIN BUILDING, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA , 695581\n<strong>Website:</strong> <a href=\"https://www.tigrid.in\">https://www.tigrid.in</a></p>\n<p><strong>Job Title:</strong> Content Creator\n<strong>Closing Date:</strong> 10, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:hr@tigrid.in\">hr@tigrid.in</a></p>\n<p><strong>Brief Description</strong>\nWe are seeking a creative and motivated Content Creator to produce engaging digital content that supports our brand presence and audience engagement. The ideal candidate will create original content for social media, blogs, and various digital platforms.</p>\n<p><strong>Location:</strong> Trivandrum, Kerala\n<strong>Employment Type:</strong> Remote or Hybrid\n<strong>Duration:</strong> 6 Months</p>\n<p><strong>Key Responsibilities:</strong>\n- Create original content for social media, blog posts, and digital platforms.\n- Assist in planning and scheduling content calendars.\n- Collaborate with the team to align content with brand goals and campaigns.\n- Monitor content performance and suggest improvements.</p>\n<p><strong>Preferred Skills:</strong>\n- Strong writing and communication skills.\n- Creative mindset with strong attention to detail.\n- Familiarity with social media platforms and digital trends.\n- Ability to manage multiple tasks and meet deadlines.</p>\n<p><strong>How to Apply:</strong>\nSend your updated CV to <a href=\"mailto:hr@tigrid.in\">hr@tigrid.in</a>\nLearn more about us at: <a href=\"https://www.tigrid.in\">www.tigrid.in</a></p>",
        "tags": [
            "Not Specified",
            "Content Creation",
            "Social Media Management",
            "Digital Marketing"
        ],
        "summary": "Creative Content Creator needed to produce engaging digital content, collaborate with teams, and enhance brand presence through social media and blogs."
    },
    {
        "job_title": "Technical Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26308",
        "location": "Technopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<h2>Polus Solutions (P) Ltd</h2>\n<p><strong>Address:</strong> 12B, Carnival Technopark, Technopark, Kazhakuttam, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a></p>\n<h3>Technical Analyst</h3>\n<p><strong>Closing Date:</strong> 06, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a></p>\n<h3>Brief Description</h3>\n<p>Polus is seeking innovative, experienced candidates to deliver post-implementation support and solutions to global customers. This role focuses on incident management, problem resolution, and ensuring customer success through timely technical support.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Serve as the first point of contact for customers.</li>\n<li>Provide <strong>Level 2 technical support</strong> and apply diagnostic techniques to resolve issues.</li>\n<li>Own issues end-to-end until resolution, escalating complex problems to Level 3 support.</li>\n<li>Adhere to SLAs and follow Service Management processes (Incident/Problem/Change/Release Management).</li>\n<li>Handle service requests and maintain operational efficiency.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>IT Service Management</strong> experience (Incident/Problem/Change/SR management).</li>\n<li>Proficiency in ticketing tools like <strong>ServiceNow</strong>, <strong>Jira</strong>.</li>\n<li>Strong knowledge of <strong>SQL/PL SQL</strong> and database fundamentals.</li>\n<li>Hands-on database monitoring experience.</li>\n<li>Basic understanding of <strong>Java/JEE</strong>.</li>\n<li>Analytical reasoning, lateral thinking, and excellent communication skills.</li>\n<li><strong>ITIL V3/V4</strong> certification is desirable.</li>\n<li>Willingness to work in <strong>rotational shifts (24/5)</strong>.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> Graduates in BE/BTech (Computer Science/related), MSC Computer Science, MCA, or equivalent.</li>\n<li><strong>Experience:</strong> 1-3 years in IT support.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Send your resume to <strong>careers@polussolutions.com</strong> with the subject line: <strong>Technical Analyst - [Your Name]</strong>.</p>",
        "tags": [
            "1-3 Years",
            "IT Service Management",
            "ServiceNow",
            "SQL/PL SQL"
        ],
        "summary": "Technical Analyst role requiring 1-3 years of IT support experience, focusing on Level 2 technical support, incident management, and database monitoring with skills in ServiceNow and SQL."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26307",
        "location": "Technopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<h2>Polus Solutions (P) Ltd</h2>\n<p><strong>Address:</strong> 12B, Carnival Technopark, Technopark, Kazhakuttam, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a>\n<strong>Closing Date:</strong> 06, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@polussolutions.com</p>\n<h3>Role Overview</h3>\n<p>Business Development teams are the cornerstone of any successful organisation. Polus is seeking driven, proactive, and self-motivated individuals to join our team and play a key role in expanding our business footprint.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Identify and engage potential clients through strategic outreach campaigns (cold calls, emails, LinkedIn).</li>\n<li>Research and qualify leads based on company goals, target industries, and ICP criteria.</li>\n<li>Coordinate meetings and discovery sessions for the US sales team.</li>\n<li>Maintain regular follow-ups to keep prospects engaged until handoff to the closing team.</li>\n<li>Track and manage outreach activities through CRM tools and ensure accurate data entry.</li>\n<li>Attend relevant virtual events to gather market insights and identify new lead opportunities.</li>\n<li>Provide weekly reports on pipeline activity, outreach metrics, and campaign effectiveness.</li>\n<li>Collaborate with the marketing team to refine messaging, outreach strategies, and target lists.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>2–5 years of Business Development experience</strong> in the IT industry.</li>\n<li>Bachelor’s degree in a relevant field.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Proven experience in cold calling, email and LinkedIn outreach, and appointment setting.</li>\n<li>Strong ability to research target markets, identify decision-makers, and qualify leads.</li>\n<li>Experience in requirement analysis and basic proposal coordination.</li>\n<li>Ability to coordinate meetings across time zones, especially for the US team.</li>\n<li>Highly organised, detail-oriented, and data-driven.</li>\n</ul>\n<h3>Key Skills</h3>\n<ul>\n<li><strong>Lead Generation &amp; Prospecting:</strong> Identify and connect with key decision-makers through multi-channel outreach.</li>\n<li><strong>Strategic Partnership Research:</strong> Build databases of potential business partners and initiate meaningful contact.</li>\n<li><strong>Appointment Setting:</strong> Book qualified meetings for the US sales team with relevant stakeholders.</li>\n<li><strong>CRM Management:</strong> Maintain up-to-date records of outreach and pipeline data.</li>\n<li><strong>Digital Marketing Support:</strong> Assist in improving the company’s social media presence and SEO efforts.</li>\n<li><strong>Event Intelligence:</strong> Attend and report insights from industry-related virtual events.</li>\n</ul>\n<h3>Work Details</h3>\n<ul>\n<li><strong>Work Timing:</strong> 4:00 PM to 12:00 AM IST (Hybrid)</li>\n<li><strong>Location:</strong> Hybrid – flexibility for remote and in-office work.</li>\n<li><strong>Reporting To:</strong> Business Development Manager / Head of Sales</li>\n</ul>\n<p><strong>Application Instructions:</strong> Send your resume to careers@polussolutions.com with the subject line: “Business Development Executive - [Your Name]”.</p>",
        "tags": [
            "2-5 Years",
            "Lead Generation",
            "CRM Management",
            "Digital Marketing Support"
        ],
        "summary": "Business Development Executive in IT industry with 2-5 years experience required for lead generation, appointment setting, and US market outreach. Hybrid role with US time zone alignment."
    },
    {
        "job_title": ".NET Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26306",
        "location": "Technopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<h2>Polus Solutions (P) Ltd</h2>\n<p>12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India , 695581\n<a href=\"https://www.polussolutions.com\">Company Website</a></p>\n<h3>.NET Developer</h3>\n<p><strong>Closing Date:</strong> 06, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a></p>\n<h4>About the Role</h4>\n<p>Polus Solutions is seeking a highly experienced <strong>.NET Developer</strong> with deep expertise in <strong>Microsoft SQL Server</strong> and enterprise-grade backend systems. This role requires strong technical leadership and hands-on development capabilities. Experience in the <strong>travel and booking domain</strong> is a strong plus.</p>\n<h4>Key Responsibilities</h4>\n<ul>\n<li>Design, develop, and maintain scalable and high-performance applications using <strong>.NET Core</strong> and <strong>C#</strong>.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Write clean, efficient, and testable code following best practices.</li>\n<li>Perform code reviews, debugging, and troubleshooting to ensure software quality.</li>\n<li>Work with databases (<strong>SQL Server</strong>, <strong>MySQL</strong>, or other RDBMS) to build efficient data-driven applications.</li>\n<li>Participate in the full software development life cycle (SDLC), from requirements gathering to deployment and support.</li>\n<li>Stay updated with the latest .NET ecosystem trends and recommend improvements where necessary.</li>\n</ul>\n<h4>Required Skills &amp; Qualifications</h4>\n<ul>\n<li><strong>3–6 years</strong> of professional experience in software development.</li>\n<li>Strong knowledge of <strong>.NET Core</strong> and <strong>C#</strong>.</li>\n<li>Good understanding of <strong>OOP concepts</strong>, design patterns, and best coding practices.</li>\n<li>Experience in <strong>Web API development</strong> and integration.</li>\n<li>Hands-on experience with <strong>Entity Framework / EF Core</strong>.</li>\n<li>Proficiency in <strong>SQL</strong> and working with relational databases.</li>\n<li>Familiarity with version control systems (e.g., <strong>Git</strong>).</li>\n</ul>\n<h4>Application Instructions</h4>\n<p>Send your resume to <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a> with the subject line: <strong>.NET Developer - [Your Name]</strong>.</p>",
        "tags": [
            "3–6 Years",
            ".NET Core",
            "C#",
            "SQL"
        ],
        "summary": "Polus Solutions seeks a .NET Developer with 3–6 years of experience in .NET Core, C#, and SQL for backend development and full SDLC participation."
    },
    {
        "job_title": "Associate Director – People & Program Management",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26305",
        "location": "Technopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\n<a href=\"https://www.polussolutions.com\">Visit Website</a></p>\n<p><strong>Associate Director – People &amp; Program Management</strong>\n<strong>Closing Date:</strong> 06, Jan 2026\n<strong>Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> ramya.a@polussolutions.com</p>\n<h3>About the Job</h3>\n<p>Polus Solutions is a values-led organization blending business strategy with a people-first culture. As we scale, we seek an <strong>Associate Director – People &amp; Program Management</strong> to strengthen delivery systems, leadership, and operational discipline.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Leadership &amp; People Development</strong></li>\n<li>Mentor PMs/Tech Leads to enhance execution and decision-making.</li>\n<li>Foster ownership, accountability, and proactive communication.</li>\n<li>Support leadership development and career growth for managers.</li>\n<li>\n<p>Inspire teams to adopt best practices and elevate performance.</p>\n</li>\n<li>\n<p><strong>Program &amp; Project Governance</strong></p>\n</li>\n<li>Oversee initiatives via structured reviews, dashboards, KPIs, and governance routines.</li>\n<li>Establish delivery frameworks, reporting mechanisms, and risk management.</li>\n<li>Improve predictability through milestone planning and issue resolution.</li>\n<li>\n<p>Standardize processes to uplift team maturity.</p>\n</li>\n<li>\n<p><strong>Operational Excellence &amp; Continuous Improvement</strong></p>\n</li>\n<li>Define KPIs for alignment, predictability, and accountability.</li>\n<li>Identify maturity gaps and implement performance-improvement initiatives.</li>\n<li>Promote structured execution, process discipline, and data-driven decisions.</li>\n<li>Foster a high-energy, results-oriented delivery culture.</li>\n</ol>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>10–15 years</strong> in technology, project, or program management.</li>\n<li>Proven leadership of managers and cross-functional teams.</li>\n<li>Strong SDLC, engineering practices, and project governance knowledge.</li>\n<li>High-energy, action-oriented leader with execution focus.</li>\n<li>Ability to influence senior teams without formal authority.</li>\n<li>Excellent prioritization, decision-making, stakeholder management, and communication skills.</li>\n</ul>\n<h3>Preferred Attributes</h3>\n<ul>\n<li>Influence without authority and uplift team maturity.</li>\n<li>Structured, strategic thinking with ownership mindset.</li>\n<li>Experience in governance models, KPIs, and delivery frameworks.</li>\n<li>Comfort working with technical teams and technology-driven decisions.</li>\n<li>Passion for developing leaders and building high-performing teams.</li>\n<li>Practical focus on actionable solutions over complex frameworks.</li>\n</ul>\n<h3>Why Join Us</h3>\n<ul>\n<li>Shape how delivery teams operate.</li>\n<li>Collaborate with Directors on company strategy.</li>\n<li>Autonomy to improve processes and team growth.</li>\n<li>Work in a culture valuing clarity, respect, and ownership.</li>\n<li>Impact team efficiency and delivery quality directly.</li>\n</ul>\n<p><strong>Apply at:</strong> ramya.a@polussolutions.com</p>",
        "tags": [
            "10–15 Years",
            "Project/Program Management",
            "Leadership Development",
            "SDLC/Engineering Practices"
        ],
        "summary": "Lead senior managers and teams to enhance delivery governance and operational excellence. Drive performance improvements through leadership development and process standardization."
    },
    {
        "job_title": "Junior Devops Technical Support Engineer (0.5 - 2 yrs)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/26304",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<p><strong>Company</strong>: REIZEND (P) Ltd\n<strong>Address</strong>: SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website</strong>: <a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a>\n<strong>Job Title</strong>: Junior DevOps Technical Support Engineer\n<strong>Experience Required</strong>: 0.5 - 2 Years\n<strong>Closing Date</strong>: 12, Feb 2026\n<strong>Published Date</strong>: 29, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>\n<p><strong>Salary Package</strong>: 4 - 6 LPA\n<strong>Work Location</strong>: Trivandrum (Work From Office)</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>proactive and highly skilled Technical Support Engineer</strong> to provide exceptional technical support for overseas projects. This role requires working in rotational shifts to ensure 24/7 availability, troubleshooting complex issues across cloud platforms, networking, application architectures, and DevOps toolchains. The ideal candidate should be self-motivated, collaborative, agile, and a continuous learner.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Provide technical support and troubleshoot issues related to <strong>Fargate, ECS, DynamoDB, BigQuery, SNS</strong>, etc.</li>\n<li>Analyze logs and metrics using <strong>CloudWatch, Prometheus, Grafana, Loki, Alert Manager, Splunk</strong>.</li>\n<li>Resolve networking challenges involving <strong>load balancers, API gateways, reverse proxies, ingress controllers, service-to-service communications</strong>.</li>\n<li>Address client-server communications, firewalls, and virtual machines.</li>\n<li>Collaborate with DevOps teams on <strong>Docker, Kubernetes, Jenkins, Ingress Controllers</strong>.</li>\n<li>Act as the first point of contact for technical queries and escalate issues when necessary.</li>\n<li>Liaise with development and operations teams to identify root causes and resolve incidents.</li>\n<li>Document troubleshooting steps and maintain a knowledge base for recurring issues.</li>\n<li>Collaborate on best practices for monitoring and incident response.</li>\n<li>Participate in shift handovers and provide timely updates on ongoing issues.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Cloud Platforms and Services</h4>\n<ul>\n<li>Hands-on experience with <strong>Fargate, ECS, DynamoDB, BigQuery, SNS</strong>.</li>\n</ul>\n<h4>Monitoring and Logging Tools</h4>\n<ul>\n<li>Proficiency in <strong>CloudWatch Logs, Loki, Splunk</strong>.</li>\n<li>Hands-on knowledge of <strong>Prometheus, Grafana, Alert Manager</strong>.</li>\n</ul>\n<h4>Networking and Security</h4>\n<ul>\n<li>Understanding of <strong>load balancers (ALB, NLB), API Gateways (AWS API Gateway, NGINX), reverse proxies (NGINX Ingress, Traefik), service-to-service communications (DNS, HTTP/HTTPS, gRPC), firewalls, security groups, IAM roles</strong>.</li>\n</ul>\n<h4>DevOps Toolchains</h4>\n<ul>\n<li>Proficiency with <strong>Docker, Kubernetes, Jenkins, GitHub Actions, ArgoCD, NGINX Ingress, Traefik</strong>.</li>\n</ul>\n<h4>Troubleshooting and Incident Management</h4>\n<ul>\n<li>Strong problem-solving skills for root cause analysis using logs, metrics, and system debugging.</li>\n</ul>\n<h4>Collaboration and Communication</h4>\n<ul>\n<li>Experience working with cross-functional teams (DevOps, development, operations).</li>\n<li>Proficiency in tools like <strong>Slack, JIRA, Confluence, Google Workspace</strong> for collaboration and issue tracking.</li>\n</ul>",
        "tags": [
            "0.5 - 2 Years",
            "Docker",
            "Kubernetes",
            "Jenkins"
        ],
        "summary": "Junior DevOps Technical Support Engineer with 0.5-2 years of experience in troubleshooting cloud platforms, networking, and DevOps toolchains. Requires hands-on skills in Docker, Kubernetes, and Jenkins for 24/7 support."
    },
    {
        "job_title": "Junior Business Development Executive",
        "company": "Srishti Innovative Educational Services (P) Ltd",
        "url": "https://technopark.org/job-details/26303",
        "location": "Technopark",
        "closing_date": "29 Jan 2026",
        "job_description": "<h2><strong>Junior Business Development Executive</strong></h2>\n<p><strong>Company</strong>: Srishti Innovative Educational Services (P) Ltd\n<strong>Location</strong>: 2C, 2nd Floor, Carnival Building, Technopark Phase 1, 695581\n<strong>Website</strong>: <a href=\"https://www.srishtis.com\">https://www.srishtis.com</a>\n<strong>Closing Date</strong>: 29, Jan 2026\n<strong>Job Published</strong>: 29, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:resumes@srishtis.com\">resumes@srishtis.com</a></p>\n<h3><strong>Role Overview</strong></h3>\n<ul>\n<li><strong>Learn and understand</strong> the company’s products and services.</li>\n<li><strong>Assist in identifying</strong> and reaching out to potential clients through calls, emails, and online platforms.</li>\n<li><strong>Support the marketing and sales team</strong> in lead generation and follow-ups.</li>\n<li><strong>Participate in networking activities</strong> and sales campaigns to gain exposure.</li>\n<li><strong>Maintain basic records</strong> of client interactions and follow-up status.</li>\n<li><strong>Help build and maintain</strong> positive relationships with existing clients.</li>\n<li><strong>Collect client feedback</strong> and share insights with the team.</li>\n<li><strong>Support the preparation</strong> of proposals, presentations, and sales documents.</li>\n<li><strong>Stay updated</strong> on market trends and competitor offerings.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Graduate or pursuing a degree in <strong>Marketing</strong>, <strong>Business Administration</strong>, or a related field.</li>\n<li>Strong interest in <strong>sales</strong>, <strong>business development</strong>, and <strong>client interaction</strong>.</li>\n<li>Good <strong>verbal and written communication skills</strong>.</li>\n<li>Willingness to learn and adapt in a <strong>fast-paced environment</strong>.</li>\n<li>Basic understanding of <strong>sales concepts</strong> (training will be provided).</li>\n<li><strong>Positive attitude</strong> with a <strong>goal-oriented mindset</strong>.</li>\n<li><strong>Presentable, professional</strong>, and <strong>confident personality</strong>.</li>\n<li>Ability to work well in a <strong>team</strong> and take guidance from seniors.</li>\n</ul>\n<h3><strong>Application</strong></h3>\n<p>Interested candidates must fill out the <a href=\"https://forms.gle/rpQJPfMDd3HX7ZAJA\">Google Form</a>.</p>",
        "tags": [
            "0-2 Years",
            "Business Development",
            "Sales",
            "Client Relationship Management"
        ],
        "summary": "Junior Business Development Executive role at Srishti Innovative Educational Services involves client outreach, lead generation, and supporting sales efforts. Requires a graduate with strong communication skills and a goal-oriented mindset."
    },
    {
        "job_title": "Accountant ( CA Pursuing )",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26302",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong></p>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a>\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Job Title: Accountant (CA Pursuing)</h3>\n<p><strong>Closing Date:</strong> 12, Feb 2026\n<strong>Job Published:</strong> 29, Dec 2025</p>\n<h4>Responsibilities:</h4>\n<ul>\n<li>Lead share issue procedures, including company valuation processes, preparation of projections, and statutory documents for stakeholders and ROC.</li>\n<li>Communicate with valuers to explain projections and detail the logic behind them.</li>\n<li>Prepare share issue offer documents, manage statutory meetings, resolutions, and ROC intimation.</li>\n<li>Develop realistic cash flow projections considering statutory requirements, payment prioritization, and receivables.</li>\n<li>Prepare budgets and analyze periodic performance against actual financial results.</li>\n</ul>\n<h4>Preferred Skills:</h4>\n<ul>\n<li><strong>Qualification:</strong> Cleared at least one group of CA IPCC.</li>\n<li><strong>Experience:</strong> 3 years of quality Articleship experience in a Chartered Accountants firm (no post-CA experience required).</li>\n<li>Confident in using Excel at an intermediate level.</li>\n<li>Ability to work independently and lead the finance team effectively.</li>\n<li>Strong attention to detail, analytical skills, and excellent verbal/written communication.</li>\n</ul>\n<h4>Salary:</h4>\n<p>5-6 LPA</p>\n<p><strong>Apply:</strong> Submit your updated resume to careers@shmsolutions.in</p>",
        "tags": [
            "3 Years",
            "CA",
            "Excel",
            "Financial Projections"
        ],
        "summary": "Lead share issue procedures and financial planning. Requires CA pursuit, Excel proficiency, and 3+ years of Articleship experience."
    },
    {
        "job_title": "Accountant ( CA Pursuing )",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/26301",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>REIZEND (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">Visit Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role</strong>: Accountant (CA Pursuing)\n<strong>Closing Date</strong>: 12, Feb 2026\n<strong>Published</strong>: 29, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a>\n<strong>Salary</strong>: 5-6 LPA</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Lead company share issue procedures, including valuation processes, projections, and statutory document preparation for stakeholders and ROC.</li>\n<li>Communicate with valuers to explain projections and detail the logic behind them.</li>\n<li>Prepare share issue offer documents, statutory meeting documentation, resolution passing, and ROC intimation.</li>\n<li>Develop realistic cash flow projections considering statutory requirements, payment prioritization, and receivables.</li>\n<li>Prepare budgets and analyze periodic financial performance against actual results.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Qualification</strong>: Cleared at least one group of CA IPCC.</li>\n<li><strong>Experience</strong>: 3 years of quality Articleship experience in a Chartered Accountants firm (no post-CA experience required).</li>\n<li>Confident in using Excel at an intermediate level.</li>\n<li>Ability to work independently and lead the finance team effectively.</li>\n<li>Strong attention to detail, analytical skills, and excellent verbal/written communication.</li>\n</ul>\n<h2>Contact Information</h2>\n<p>Submit your updated resume to <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a>.</p>",
        "tags": [
            "3 Years",
            "CA IPCC",
            "Excel",
            "Financial Projections"
        ],
        "summary": "Accountant (CA Pursuing) role requiring 3 years of Articleship experience and CA IPCC qualification to lead share issue procedures and financial planning."
    },
    {
        "job_title": "Hiring | Digital Marketing Intern (SEO)_Technopark/Infopark",
        "company": "Saasvaap Techies (P) Ltd",
        "url": "https://technopark.org/job-details/26299",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>About the Role</h2>\n<p>Saasvaap Techies (P) Ltd is seeking passionate and motivated <strong>Digital Marketing Interns (SEO)</strong> to join our team at Technopark/Infopark. This internship offers real-time industry exposure and an opportunity to build a strong digital marketing portfolio.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Execute SEO strategies and digital marketing campaigns</li>\n<li>Analyze website performance using tools like Google Analytics and Search Console</li>\n<li>Conduct keyword research and competitor analysis</li>\n<li>Collaborate on content marketing and social media initiatives</li>\n<li>Support PPC campaigns (preferred)</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>3–6 months experience</strong> in Digital Marketing/SEO</li>\n<li>Proficiency with <strong>Google Analytics, Search Console, SEMrush, Ahrefs</strong></li>\n<li>Basic knowledge of content marketing, social media, and PPC</li>\n<li>Strong analytical and communication skills</li>\n<li>Ability to thrive in a fast-paced environment</li>\n<li>Completed Digital Marketing courses/internships (preferred)</li>\n</ul>\n<h3>Company Info</h3>\n<ul>\n<li><strong>Location</strong>: Module No. B-11, B-12, 3rd Floor, Gayatri Building, Phase-I Campus, Technopark, Thiruvananthapuram, 695581</li>\n<li><strong>Website</strong>: <a href=\"http://www.saasvaap.com\">www.saasvaap.com</a></li>\n<li><strong>Application Deadline</strong>: 10, Jan 2026</li>\n<li><strong>Contact</strong>: <a href=\"mailto:careers@saasvaap.com\">careers@saasvaap.com</a></li>\n</ul>",
        "tags": [
            "3–6 Months",
            "Google Analytics",
            "SEMrush",
            "Ahrefs"
        ],
        "summary": "Seeking SEO-focused Digital Marketing Intern with 3–6 months experience in tools like Google Analytics and SEMrush for fast-paced, portfolio-building opportunities."
    },
    {
        "job_title": "BUSINESS DEVELOPMENT EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26298",
        "location": "Technopark",
        "closing_date": "02 Jan 2026",
        "job_description": "<h2><strong>Trainonex Solutions (P) Ltd</strong></h2>\n<p><strong>Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala - 695581</strong>\n<strong>Website:</strong> <a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<h3><strong>Business Development Executive</strong></h3>\n<p><strong>Closing Date:</strong> 02, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a motivated and dynamic <strong>Business Development Executive</strong> to join our team. The candidate will be responsible for identifying new business opportunities, building strong client relationships, and contributing to the company's growth.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Identify and approach potential vendors for business opportunities.</li>\n<li>Contact vendors via calls to explain company services.</li>\n<li>Build and maintain strong relationships with clients and vendors.</li>\n<li>Understand client requirements and offer suitable business solutions.</li>\n<li><strong>Eligibility:</strong> Any degree (freshers can apply).</li>\n<li><strong>Skills:</strong> Basic computer knowledge and proficiency in MS Office.</li>\n<li><strong>Lead Generation:</strong> Develop and implement strategies to attract potential clients and generate leads.</li>\n<li><strong>Relationship Management:</strong> Build and maintain strong relationships with clients and partners.</li>\n<li><strong>Note:</strong> Female candidates preferred. Basic pay: ₹12,000. Experience: 0-1 years. Office work only.</li>\n</ul>\n<h3><strong>What We Offer</strong></h3>\n<ul>\n<li>💰 <strong>Performance-Based Incentives:</strong> Earn rewards for your dedication and achievements.</li>\n<li>🎉 <strong>Fun Fridays:</strong> Engaging activities like team games and themed dress days.</li>\n<li>🎈 <strong>Special Occasion Celebrations:</strong> Celebrate milestones, birthdays, and achievements.</li>\n<li>🤝 <strong>Supportive Team Environment:</strong> Collaborate with passionate, career-focused colleagues.</li>\n<li>📈 <strong>Career Development:</strong> Access training and growth opportunities.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Strong communication and negotiation skills.</li>\n<li>Ability to build rapport and maintain long-term relationships.</li>\n<li>Goal-oriented, confident, and self-motivated.</li>\n<li>Basic understanding of sales and vendor management.</li>\n</ul>\n<p><strong>Application Note:</strong> Mention the subject line as <strong>'Application for Business Development Executive.'</strong></p>",
        "tags": [
            "0-1 Years",
            "Lead Generation",
            "Relationship Management",
            "Sales & Vendor Management"
        ],
        "summary": "A Business Development Executive role requiring 0-1 years of experience, focusing on lead generation, client relationships, and vendor management with performance-based incentives and career growth opportunities."
    },
    {
        "job_title": "Manager - Service Delivery and Infrastructure",
        "company": "Alamy Images India (P) Ltd",
        "url": "https://technopark.org/job-details/26297",
        "location": "Technopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<p><strong>Alamy Images India (P) Ltd</strong>\n<em>C-16, Gayatri Building, Technopark Campus, Thiruvanathapuram, 695581</em>\n<a href=\"http://www.alamy.com\">www.alamy.com</a></p>\n<p><strong>Manager - Service Delivery and Infrastructure</strong>\n<strong>Closing Date:</strong> 15, Jan 2026\n<strong>Published:</strong> 29, Dec 2025\n<strong>Contact:</strong> <a href=\"mailto:jobsindia@alamy.com\">jobsindia@alamy.com</a></p>\n<h3>Role Overview</h3>\n<p>The <strong>Manager - Service Delivery and Infrastructure</strong> will oversee Customer Support, Service Improvement, Service Operations, Service Transition, and Infrastructure Services teams in India. This role is a strategic enabler of service excellence:</p>\n<ul>\n<li><strong>Customer-Centricity:</strong> Incident leadership, ticket resolution, and trust safeguarding.</li>\n<li><strong>Operational Resilience:</strong> Monitoring, governance, and root cause analysis to reduce risk.</li>\n<li><strong>Efficiency &amp; Transparency:</strong> Reporting and process optimization for continuous improvement.</li>\n<li><strong>Proactive Improvement:</strong> Trend analysis to ensure long-term stability and prevent recurring issues.</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Manage Infrastructure Services teams to meet KPIs/SLAs for service requests, incident management, and IT resource allocation.</li>\n<li>Develop dashboards/reports on SLA compliance, ticket trends, and incident metrics; drive process optimization.</li>\n<li>Ensure IT systems, controls, policies, and procedures mitigate risks (e.g., IT security, GDPR).</li>\n<li>Oversee CAB processes, validate dependencies, and implement safe deployments with rollback strategies.</li>\n<li>Account for service quality, performance, and capacity planning for future growth.</li>\n<li>Drive internal/external service reviews for performance, improvements, and process alignment.</li>\n<li>Collaborate with teams to protect/improve services and resolve incidents.</li>\n<li>Act as a Technology ambassador, fostering cross-departmental communication.</li>\n<li>Lead service engineers in troubleshooting IT services (3rd line+).</li>\n<li>Coordinate with Product Delivery and Platform Teams to optimize alerting systems (AWS, databases, monitoring tools).</li>\n<li>Manage major incidents, bridging technical squads, service desk, and leadership.</li>\n<li>Maintain IT infrastructure (compute, storage, network, cloud, data centers).</li>\n<li>Perform ITSCM operations (backups, high availability, resiliency, 3rd party services).</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experienced leader with service excellence in fast-paced, multi-channel environments.</li>\n<li>High-level stakeholder management, communication, and service reporting in e-commerce.</li>\n<li>Delivery/customer-focused with team leadership/matrix management experience.</li>\n<li>2+ years as a Senior Leader in similar roles.</li>\n<li>Proficient in SLM/ITIL best practices.</li>\n<li>Strong IT/Infra security knowledge.</li>\n<li>Expertise in IT infrastructure (Windows, Linux, End User Compute).</li>\n<li>Experience with Office 365, Active Directory, Group Policies.</li>\n<li>Network management skills (routers, switches, firewalls).</li>\n<li>Proven experience with modern Service Desk platforms (Jira, ServiceNow, Freshservice, Zendesk).</li>\n<li>Integration of Service Desk with Product Delivery/Engineering teams for agile/DevOps workflows.</li>\n</ul>\n<h3>Desirable</h3>\n<ul>\n<li>ITIL/ITSM Certification</li>\n<li>AWS/Azure experience</li>\n<li>Scripting/automation skills</li>\n<li>Infrastructure budget management</li>\n<li>B2B digital/media/subscription services background</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://careers.pamediagroup.com/job-invite/669/\">ATS Link</a></p>",
        "tags": [
            "2+ Years",
            "ITIL/ITSM",
            "AWS/Azure",
            "Service Desk Platforms"
        ],
        "summary": "Manages service delivery, infrastructure, and customer support to ensure operational excellence. Leads teams to optimize IT processes and maintain service resilience."
    },
    {
        "job_title": "Data Analyst",
        "company": "Alamy Images India (P) Ltd",
        "url": "https://technopark.org/job-details/26296",
        "location": "Technopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<p><strong>Alamy Images India (P) Ltd</strong>\n<em>C-16, Gayatri Building, Technopark Campus, Thiruvanathapuram, 695581</em>\n<a href=\"http://www.alamy.com\">Visit Website</a></p>\n<p><strong>Closing Date:</strong> 15, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:jobsindia@la\">jobsindia@la</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a detail-oriented <strong>Data Analyst</strong> with approximately <strong>2 years of experience</strong>, strong proficiency in <strong>SQL</strong>, and hands-on expertise in <strong>Power BI</strong>. The role focuses on maintaining high-quality customer data, ensuring consistency and accuracy across systems, and supporting data-driven decision-making. The ideal candidate will also demonstrate the potential to design and set up scalable data processes as the organization grows.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Maintain and ensure consistency, accuracy, and completeness of customer data across systems.</li>\n<li>Track, validate, and regularly update customer data, including updates within <strong>Salesforce</strong>.</li>\n<li>Develop, maintain, and enhance dashboards and reports using <strong>Power BI</strong> to support business and sales insights.</li>\n<li>Write and optimize <strong>SQL</strong> queries for data extraction, validation, reconciliation, and analysis.</li>\n<li>Identify data quality issues and proactively recommend corrective actions and process improvements.</li>\n<li>Support the creation and setup of data processes, documentation, and basic data governance practices.</li>\n<li>Collaborate with sales and operations teams to understand data requirements and reporting needs.</li>\n<li>Assist in defining data standards, validation rules, and best practices for customer data management.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Mandatory:</strong> Minimum 1.5 - 3 years exposure as a Data Analyst or similar role.</li>\n<li>Strong proficiency in <strong>SQL</strong> for querying, validation, and analysis.</li>\n<li>Hands-on experience with <strong>Power BI</strong>, including dashboard creation and data modeling.</li>\n<li>Strong understanding of data quality concepts (accuracy, completeness, consistency).</li>\n<li>Analytical mindset with strong attention to detail.</li>\n<li>Ability to understand business processes and translate them into data requirements.</li>\n<li>Familiarity with documentation and process definition for data workflows.</li>\n<li>Basic understanding of <strong>ETL</strong> concepts and data pipelines.</li>\n<li>Exposure to <strong>Salesforce</strong> (Sales Cloud or similar) is preferred but not mandatory.</li>\n<li>Experience working with customer or sales data.</li>\n<li>Good communication skills to work effectively with non-technical stakeholders.</li>\n<li>Willingness to learn and grow into building scalable data processes.</li>\n<li>Proactive approach to identifying and resolving data issues.</li>\n<li>Strong ownership and accountability for data accuracy.</li>\n</ul>\n<p><strong>APPLY NOW</strong> using the following <a href=\"https://careers.pamediagroup.com/job-invite/673/673/\">ATS link</a>.</p>",
        "tags": [
            "1.5-3 Years",
            "SQL",
            "Power BI",
            "Salesforce"
        ],
        "summary": "A Data Analyst role requiring 1.5-3 years of experience, SQL, Power BI, and Salesforce expertise to manage customer data and support business insights."
    },
    {
        "job_title": "Senior React Developer",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/26295",
        "location": "Technopark",
        "closing_date": "29 Jan 2026",
        "job_description": "<h2>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</h2>\n<p><strong>Location:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus, Trivandrum 695581\n<strong>Website:</strong> <a href=\"https://www.ateamsoftsolutions.com\">https://www.ateamsoftsolutions.com</a></p>\n<h3>Senior React Developer</h3>\n<p><strong>Closing Date:</strong> 29, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> recruitment@ateamsoftsolutions.com\n<strong>Phone:</strong> +91 7907410058</p>\n<h3>Brief Description</h3>\n<p><strong>Software Developer Lead – React</strong></p>\n<p>Join ATeam InfoSoft Solutions, Technopark, and be part of a dynamic team building next-generation web applications. We’re seeking an experienced <strong>React Developer</strong> with strong expertise in modern front-end technologies to lead impactful projects.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Proven ability to lead a team of 4+ developers, project estimation &amp; delivery planning</li>\n<li>Design, develop, and deploy modern web applications using <strong>React.js</strong> and <strong>Next.js</strong></li>\n<li>Collaborate with product owners, designers, and backend teams to deliver seamless solutions</li>\n<li>Ensure performance, quality, and responsiveness of applications</li>\n<li>Conduct code reviews and maintain best practices</li>\n<li>Work with <strong>GraphQL</strong>, <strong>React Query</strong>, and <strong>WebSockets</strong> for scalable, real-time solutions</li>\n<li>Stay updated with emerging front-end technologies and industry trends</li>\n</ul>\n<h3>Required Technical Skills</h3>\n<ul>\n<li>Strong expertise in <strong>React.js</strong> and <strong>Next.js</strong> (SSR, SSG, API routes)</li>\n<li>Proficiency in <strong>JavaScript (ES6+)</strong>, <strong>HTML5</strong>, <strong>CSS3</strong>, <strong>Tailwind CSS</strong></li>\n<li>Experience with <strong>Redux</strong> or <strong>Zustand</strong> for state management</li>\n<li>Familiarity with <strong>GraphQL</strong> &amp; <strong>React Query</strong></li>\n<li>Hands-on experience with <strong>WebSockets</strong> &amp; real-time communication</li>\n<li>Solid knowledge of <strong>Webpack/Vite</strong> and <strong>Git</strong> workflow</li>\n<li>Practical experience with <strong>Firebase</strong> (Auth, Firestore, Messaging, Storage, etc.)</li>\n</ul>\n<h3>Apply Now</h3>\n<p><strong>Email:</strong> recruitment@ateamsoftsolutions.com\n<strong>Phone:</strong> +91 7907410058</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong experience in <strong>React.js</strong>, <strong>Next.js</strong>, <strong>Redux</strong> or <strong>Zustand</strong></li>\n<li>Expert in <strong>JavaScript (ES6+)</strong>, <strong>HTML5</strong>, <strong>CSS3</strong>, and <strong>Tailwind CSS</strong></li>\n<li>Deep understanding of component-based architecture</li>\n<li>Experience with <strong>GraphQL</strong>, <strong>React Query</strong>, and real-time communication (<strong>WebSockets</strong>)</li>\n<li>Familiar with tools like <strong>Webpack</strong>, <strong>Vite</strong>, and <strong>Git</strong></li>\n</ul>",
        "tags": [
            "6+ Years",
            "React.js",
            "Next.js",
            "Redux/Zustand"
        ],
        "summary": "Senior React Developer needed to lead a team and build next-gen web apps using React.js and Next.js. Requires 6+ years of experience and expertise in modern front-end technologies."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26294",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>SRS Global Technologies (P) Ltd</h2>\n<p><strong>Address:</strong> 1st Floor, Thejaswini Building, Technopark, Karyavattom PO, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://srsglobaltechnologies.com\">https://srsglobaltechnologies.com</a>\n<strong>Closing Date:</strong> 11, Jan 2026\n<strong>Job Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> hr@srswebsolutions.com</p>\n<h3>About SRS Web Solutions</h3>\n<p>SRS Web Solutions is a leading healthcare SaaS technology company specializing in digital healthcare documentation for the medical, dental, and veterinary industries. With over 3,000+ clients and 5 million patients served globally, we modernize practices by improving productivity and efficiency. Our senior developers have a collective 100,000 hours in customized healthcare and security programming. SRS is an Inc 5000 company ranked among the fastest-growing companies in the USA.</p>\n<h3>Job Summary</h3>\n<p>We seek a <strong>UI/UX Designer</strong> with hands-on experience in designing and converting layouts into clean HTML. Responsibilities include email templates, marketing landing pages, Figma-to-HTML conversion, and social media creatives, with basic WordPress backend exposure.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop HTML email templates for marketing and campaigns</li>\n<li>Create marketing landing pages and convert them into responsive HTML</li>\n<li>Convert Figma designs into pixel-perfect HTML/CSS</li>\n<li>Design social media ads and organic posts</li>\n<li>Ensure mobile responsiveness and cross-browser compatibility</li>\n<li>Perform basic WordPress backend edits (pages, content, layouts)</li>\n<li>Collaborate with marketing and development teams</li>\n<li>Maintain consistent UI/UX across all digital assets</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>3–4 years of experience in UI/UX and front-end design</li>\n<li>Strong knowledge of HTML5 &amp; CSS3</li>\n<li>Proven Figma-to-HTML conversion experience</li>\n<li>HTML email template design experience</li>\n<li>Understanding of marketing landing page UX &amp; conversion design</li>\n<li>Basic WordPress backend knowledge</li>\n<li>Social media creative experience</li>\n<li>Immediate joiners preferred; open to night shifts</li>\n</ul>",
        "tags": [
            "3–4 Years",
            "HTML5/CSS3",
            "Figma to HTML",
            "WordPress"
        ],
        "summary": "UI/UX Designer needed for Figma-to-HTML conversion, email templates, and landing pages. Requires 3-4 years of experience with HTML/CSS, WordPress, and social media design."
    },
    {
        "job_title": "QA Manager",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26293",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>SRS Global Technologies (P) Ltd</h2>\n<p><strong>Location</strong>: 1st Floor, Thejaswini Building, Technopark, Karyavattom PO, Thirivananthapuram, Kerala, 695581\n<strong>Website</strong>: <a href=\"https://srsglobaltechnologies.com\">https://srsglobaltechnologies.com</a>\n<strong>Closing Date</strong>: 11, Jan 2026\n<strong>Published</strong>: 29, Dec 2025\n<strong>Contact</strong>: <a href=\"mailto:hr@srswebsolutions.com\">hr@srswebsolutions.com</a></p>\n<h3>About SRS</h3>\n<p>SRS Web Solutions is a leading healthcare SaaS technology company specializing in digital healthcare documentation for medical, dental, and veterinary industries. With over 3,000+ clients and 5 million patients served globally, SRS modernizes practices through productivity improvements and efficiency gains. The company is an Inc 5000-ranked fastest-growing business in the USA, with senior developers contributing 100,000+ hours in healthcare and security programming.</p>\n<h3>Job Description</h3>\n<ul>\n<li>Design, develop, and execute manual/automated test cases using <strong>Selenium</strong>, <strong>Java</strong>, and <strong>Page Object Model (POM)</strong> frameworks.</li>\n<li>Build/maintain automation frameworks and integrate tests into <strong>CI/CD pipelines</strong> (Jenkins, GitHub).</li>\n<li>Conduct functional, regression, integration, and API testing using <strong>Postman</strong>, <strong>SwaggerUI</strong>, and RESTful API validation.</li>\n<li>Validate backend data with <strong>SQL queries</strong> and perform data-driven testing.</li>\n<li>Collaborate with cross-functional teams in <strong>Agile environments</strong> (Scrum, Sprint Planning) to ensure high-quality releases.</li>\n<li>Identify/document/track defects, provide QA reports, and test coverage metrics.</li>\n<li>Mentor junior QA engineers and drive process/framework improvements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Qualification</strong>: Bachelor’s in Engineering, Computer Science, or related field.</li>\n<li><strong>Experience</strong>: 3+ years in Manual/Automation Testing, proven Senior QA Engineer background.</li>\n<li><strong>Automation Tools</strong>: Selenium, TestNG, JUnit.</li>\n<li><strong>Programming</strong>: Java (hands-on experience).</li>\n<li><strong>Frameworks</strong>: POM, Data-Driven Testing.</li>\n<li><strong>CI/CD &amp; Version Control</strong>: Jenkins, GitHub, Git.</li>\n<li><strong>API Testing</strong>: Postman, SwaggerUI, RESTful API validation.</li>\n<li><strong>Databases</strong>: SQL (complex queries, joins, data validation).</li>\n<li><strong>Test Management</strong>: Jira, TestRail (or equivalent).</li>\n<li><strong>Agile Methodologies</strong>: Scrum, Sprint Planning, Retrospectives.</li>\n<li><strong>Other Skills</strong>: JSON handling, defect lifecycle management, communication, teamwork, multitasking under deadlines.</li>\n</ul>\n<p><strong>Immediate joiners preferred</strong>; candidates must be open to <strong>night shifts</strong>.</p>",
        "tags": [
            "3+ Years",
            "Selenium",
            "Java",
            "Jenkins"
        ],
        "summary": "QA Manager role requiring 3+ years in manual/automation testing with Selenium, Java, and CI/CD tools. Lead testing for healthcare SaaS solutions at a top-ranked company."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/26292",
        "location": "Technopark",
        "closing_date": "13 Jan 2026",
        "job_description": "<h2>QWY Software (P) Ltd</h2>\n<p><strong>Location:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581\n<strong>Industry:</strong> IT/ITES covering E-com, Logistics and Hyperlocal Delivery Services\n<strong>Role:</strong> UI/UX Designer\n<strong>Closing Date:</strong> 13, Jan 2026\n<strong>Published Date:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@qwysoft.com</p>\n<h3>Brief Description</h3>\n<p>Experience: 2 to 6 years</p>\n<p>We are seeking a dynamic <strong>UI/UX designer</strong> to optimize user experience (UX) and user interface (UI) design for our digital assets. You will ensure usability, usefulness, and exceptional visual design across all online elements. The ideal candidate demonstrates a passion for adaptive, creative solutions to design challenges while staying current with UX/UI best practices and trends.</p>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor's degree and <strong>minimum 2 years</strong> of UI/UX design experience for digital products/services.</li>\n<li>Professional portfolio showcasing web and mobile UI/UX work.</li>\n<li>Experience designing for iOS and Android platforms.</li>\n<li>Working knowledge of <strong>Sketch, InVision, Visio, Figma, Mobility UI, Design Systems</strong>, and <strong>Adobe Creative Suite</strong>.</li>\n<li>Ability to work independently and collaboratively.</li>\n<li>Excellent written/verbal communication skills.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Conduct user research, competitor analysis, and usability testing.</li>\n<li>Design user flows, wireframes, sitemaps, and interactive prototypes.</li>\n<li>Create user-centered interfaces for web/mobile applications (iOS, Android, responsive web).</li>\n<li>Enhance applications with new features aligned to UX patterns and backend constraints.</li>\n<li>Collaborate with developers for accurate design implementation.</li>\n<li>Partner with the Office Innovation Team on concept development and product prototypes.</li>\n<li>Engage stakeholders for data collection, design feedback, training, and UAT.</li>\n<li>Stay updated on design trends, usability principles, and front-end best practices.</li>\n<li>Demonstrate multi-tasking and time-management skills through prioritization.</li>\n</ul>\n<p><strong>Application Instructions:</strong> Interested candidates should email their CV to careers@qwysoft.com with the subject line \"UI/UX Designer\".</p>",
        "tags": [
            "2-6 Years",
            "Figma",
            "Adobe Creative Suite",
            "Design Systems"
        ],
        "summary": "Seeking a UI/UX designer with 2-6 years of experience to create user-centered digital experiences for web and mobile platforms using tools like Figma and Adobe Creative Suite."
    },
    {
        "job_title": "Java Developer/ Senior Java Developer",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26291",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>ECS Fin is an engineering enterprise specializing in process optimization. Our software solutions include:\n- Enterprise messaging management system\n- SWIFT certified transaction processing system\n- Post-trade processing application\n- Treasury management system</p>\n<p><strong>Job Title</strong>\nJava Developer / Senior Java Developer</p>\n<p><strong>Location</strong>\nTrivandrum</p>\n<p><strong>Experience</strong>\n1-3 Years</p>\n<p><strong>Preferred Skills</strong>\n- <strong>Must Have</strong>: 1+ year of Java experience\n- <strong>Required</strong>: Strong understanding of jQuery / HTML / CSS / JavaScript\n- <strong>Preferred</strong>: Knowledge of design patterns, Spring/Spring Boot\n- <strong>Preferred</strong>: ReactJS experience\n- <strong>Must Have</strong>: Ability to learn new technologies quickly\n- <strong>Preferred</strong>: Awareness of emerging technologies\n- <strong>Good to Have</strong>: Web Service experience (SOAP, REST)\n- <strong>Good to Have</strong>: Oracle PL/SQL knowledge and relational database understanding\n- <strong>Preferred</strong>: Strong communication skills</p>\n<p><strong>Contact Information</strong>\n- Email: <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a>\n- Website: <a href=\"https://www.ecsfin.com\">www.ecsfin.com</a>\n- Address: Module No. 422, 423, 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, 695581</p>",
        "tags": [
            "1-3 Years",
            "Java",
            "Spring/Spring Boot",
            "ReactJS"
        ],
        "summary": "ECS Fin seeks Java Developer/Senior Java Developer with 1-3 years experience in Java, Spring Boot, and ReactJS for Trivandrum-based role."
    },
    {
        "job_title": "Java Architect",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26290",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<h2>Job Posting: Java Architect</h2>\n<p><strong>Company</strong>: ECS BUSINESS SOLUTIONS (P) Ltd\n<strong>Location</strong>: Module No. 422, 423 and 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, Trivandrum, 695581\n<strong>Website</strong>: <a href=\"https://www.ecsfin.com\">https://www.ecsfin.com</a>\n<strong>Closing Date</strong>: 12 February 2026\n<strong>Published Date</strong>: 29 December 2025\n<strong>Contact Email</strong>: <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a></p>\n<h3>About the Company</h3>\n<p>ECS Fin is an engineering enterprise specializing in process optimization. Our software solutions include:\n- Enterprise messaging management system\n- SWIFT certified transaction processing system\n- Post-trade processing application\n- Treasury management system</p>\n<p>These solutions are utilized by financial institutions and corporations globally.</p>\n<h3>Role Overview</h3>\n<p>ECS Fin is seeking a <strong>Java Architect</strong> to join our team in Trivandrum.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop full-stack enterprise applications with expertise in Java and Spring Boot</li>\n<li>Lead large-scale codebase management using Maven and Git</li>\n<li>Implement Spring Cloud ecosystem components (Config Server, Eureka, Gateway)</li>\n<li>Design Kafka-based streaming architectures</li>\n<li>Integrate IAM systems like Keycloak for secure access control</li>\n<li>Utilize Apache Camel and workflow orchestration tools</li>\n<li>Ensure API governance and documentation via Swagger/OpenAPI</li>\n<li>Mentor technical teams and drive architecture discussions across distributed environments</li>\n<li>Engage with international clients to deliver secure, maintainable systems</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>8+ years</strong> of experience in enterprise application development</li>\n<li><strong>3+ years</strong> hands-on Spring/Spring Boot experience</li>\n<li>Proficiency in Maven and Git (mandatory)</li>\n<li>Strong knowledge of Spring Cloud microservices</li>\n<li>Familiarity with Keycloak or similar IAM systems</li>\n<li>Experience with Apache Camel and workflow tools</li>\n<li>Expertise in Kafka-based streaming systems</li>\n<li>API governance and documentation skills</li>\n<li>Excellent communication and international client engagement experience</li>\n</ul>\n<h3>Work Schedule</h3>\n<ul>\n<li>Shift timing: Afternoon to late night</li>\n</ul>\n<h3>Contact Information</h3>\n<p>For inquiries, email: <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a></p>",
        "tags": [
            "8+ Years",
            "Java",
            "Spring Boot",
            "Kafka"
        ],
        "summary": "ECS Fin seeks a Java Architect with 8+ years of experience in enterprise applications, Spring Boot, and Kafka. The role involves designing scalable systems and guiding international teams."
    },
    {
        "job_title": "Java Technical Lead",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26289",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<p><strong>ECS BUSINESS SOLUTIONS (P) Ltd</strong></p>\n<p><strong>Module No. 422, 423 and 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, 695581</strong></p>\n<p><strong>Website</strong>: <a href=\"https://www.ecsfin.com\">https://www.ecsfin.com</a></p>\n<p><strong>Job Title</strong>: Java Technical Lead\n<strong>Closing Date</strong>: 12, Feb 2026\n<strong>Job Published</strong>: 29, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a></p>\n<h3>About the Company</h3>\n<p>ECS Fin is an engineering enterprise specializing in process optimization. Our software solutions include:\n- Enterprise messaging management system\n- SWIFT certified transaction processing system\n- Post-trade processing application\n- Treasury management system</p>\n<p>These solutions are used globally by financial institutions and corporations.</p>\n<h3>Job Description</h3>\n<p>ECS Fin is seeking a <strong>Java Technical Lead</strong> for a position based in Trivandrum.</p>\n<h4>Responsibilities</h4>\n<ul>\n<li>Work in a shift starting in the afternoon and ending late night.</li>\n<li>Plan and lead code reviews.</li>\n<li>Propose technology solutions to project managers and clients.</li>\n<li>Stay updated on the latest technological advancements.</li>\n</ul>\n<h4>Preferred Skills</h4>\n<ul>\n<li>5–8 years of experience with <strong>Java</strong>, <strong>Spring Boot</strong>, and <strong>microservices architecture</strong>.</li>\n<li>Mandatory experience with <strong>Maven</strong> for project builds and <strong>Git/GitLab</strong> for CI/CD workflows.</li>\n<li>Strong hands-on experience in writing, deploying, and managing <strong>Spring-based REST APIs</strong>.</li>\n<li>Proficiency in <strong>JUnit</strong> and <strong>Mockito</strong> for unit testing.</li>\n<li><strong>Kafka</strong> experience for stream processing or asynchronous microservices.</li>\n<li>Experience in <strong>cloud-based environments</strong>.</li>\n<li>Knowledge of <strong>Oracle PL/SQL</strong> and relational databases.</li>\n<li>Strong debugging and troubleshooting expertise.</li>\n<li>Excellent communication skills.</li>\n</ul>\n<h4>Requirements</h4>\n<ul>\n<li><strong>5+ Years</strong> of professional experience.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume to <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Maven"
        ],
        "summary": "Java Technical Lead with 5+ years of experience in Spring Boot, microservices, and cloud environments. Requires expertise in code reviews and technology solution planning."
    },
    {
        "job_title": "Senior Python Developer- AI/ML",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/26288",
        "location": "Technopark",
        "closing_date": "30 Jan 2026",
        "job_description": "<h2>QWY Software (P) Ltd</h2>\n<p><strong>Address:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581</p>\n<p><strong>Industry:</strong> IT/ITES covering E-com, Logistics and Hyperlocal Delivery Services</p>\n<h3>Senior Python Developer - AI/ML</h3>\n<p><strong>Closing Date:</strong> 30, Jan 2026\n<strong>Published:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@qwysoft.com</p>\n<h3>Job Description</h3>\n<p>We are seeking a <strong>Senior Python Developer - AI/ML</strong> with <strong>5 to 8 years of experience</strong> in Python development.</p>\n<h4>Responsibilities:</h4>\n<ul>\n<li>Develop and maintain AI/ML-based applications using Python.</li>\n<li>Design, build, and deploy machine learning models and algorithms.</li>\n<li>Work with large datasets, data preprocessing, feature engineering, and model tuning.</li>\n<li>Integrate ML models into production-ready systems and applications.</li>\n<li>Collaborate with data scientists, engineers, and business teams to understand requirements and deliver solutions.</li>\n<li>Optimize and scale ML models for performance and accuracy.</li>\n<li>Stay updated with the latest AI/ML trends, tools, and technologies.</li>\n</ul>\n<h4>Preferred Skills:</h4>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science, Engineering, or related field.</li>\n<li><strong>5-8 years</strong> of professional experience in Python development.</li>\n<li>Strong understanding of machine learning algorithms (supervised/unsupervised, NLP, deep learning).</li>\n<li>Proficiency with ML libraries such as TensorFlow, Keras, PyTorch, Scikit-learn, etc.</li>\n<li>Experience with data manipulation tools like Pandas, NumPy.</li>\n<li>Experience in model evaluation, validation techniques, and deployment.</li>\n<li>Hands-on experience with APIs, Flask/Django for model deployment.</li>\n<li>Knowledge of cloud platforms (AWS, Azure, GCP) is a plus.</li>\n<li>Excellent problem-solving and communication skills.</li>\n</ul>\n<p><strong>Application Instructions:</strong>\nInterested candidates should share their updated resume to <strong>careers@qwysoft.com</strong> with the subject line: \"Application for Senior Python Developer - AI/ML\".</p>",
        "tags": [
            "5-8 Years",
            "Python",
            "TensorFlow",
            "PyTorch"
        ],
        "summary": "Senior Python Developer - AI/ML with 5-8 years of experience in building and deploying machine learning models using Python and frameworks like TensorFlow/PyTorch."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/26287",
        "location": "Technopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<p><strong>Company:</strong> QWY Software (P) Ltd\n<strong>Address:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581\n<strong>Industry:</strong> IT/ITES covering E-com, Logistics and Hyperlocal Delivery Services\n<strong>Job Title:</strong> Odoo Developer\n<strong>Closing Date:</strong> 16, Jan 2026\n<strong>Published Date:</strong> 29, Dec 2025\n<strong>Contact Email:</strong> careers@qwysoft.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a skilled and experienced <strong>Odoo Developer</strong> to join our team. The ideal candidate will be responsible for developing, customizing, and maintaining Odoo modules.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop, customize, and maintain Odoo modules</li>\n<li>Collaborate on functional areas like Sales, CRM, Accounts, and HR</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>Strong knowledge of:</strong> Odoo, Python, PostgreSQL, JSON, JavaScript, Linux, and Git</li>\n<li><strong>Experience with:</strong> Odoo versions 12, 13, 14, 15, 16</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with Git, Docker, or Linux environments</li>\n<li>Odoo Certification</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their updated CV to <strong>careers@qwysoft.com</strong> with the subject line \"Application for Odoo Developer\".</p>",
        "tags": [
            "3-5 Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Odoo Developer with 3-5 years of experience in Python, PostgreSQL, and Odoo module development. Requires expertise in Linux, Git, and functional knowledge of Sales/CRM/Accounts/HR."
    }
]