[
    {
        "job_title": "Data Science Freshers",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19500/157",
        "location": "Infopark",
        "closing_date": "08 Jul 2025",
        "job_description": "<h2>Data Science Fresher</h2>\n<ul>\n<li>Explain the predictive models to various business users and make recommendations to drive business strategy.</li>\n<li>Make recommendations to resolve application performance problems.</li>\n<li>Implement data processing methods and tools.</li>\n<li>Collaborate with product leaders, subject matter experts, and decision-makers to develop success criteria and optimize new products, features, policies, and models.</li>\n<li>Leverage your experience in analytics tools and scientific rigor to produce actionable insights.</li>\n<li>Distill and communicate key insights to senior management in verbal, visual, and written media.</li>\n<li>Together with the Co-op department lead, determine an appropriate data science problem statement and toolset to apply during the co-op term.</li>\n<li>Determine strengths and weaknesses of data science toolsets and procedures.</li>\n</ul>\n<p><strong>Qualification</strong></p>\n<ul>\n<li>Knowledge of Machine Learning concepts (cross-validation, regularization, boosting, bootstrapping) is a plus</li>\n<li>Working on a degree in Computer Science, or a related field, with project experience in data analysis</li>\n<li>Experience with big data technologies (Hadoop, Hive, MongoDB, Spark)</li>\n<li>Experience with statistical analysis and data mining using tools such as R, SAS, Matlab, Stata, or SPSS</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0 Years",
            "Machine Learning",
            "Data Analysis",
            "Big Data Technologies"
        ],
        "summary": "We are seeking a Data Science Fresher to explain predictive models, drive business strategy, and implement data processing methods. Collaborate with leaders to optimize products and communicate insights."
    },
    {
        "job_title": "Support Executive",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19501/157",
        "location": "Infopark",
        "closing_date": "08 Jul 2025",
        "job_description": "<h2>Support Executive</h2>\n<p>We are looking for a proactive and customer-focused Support Executive to join our team. The ideal candidate will be responsible for resolving customer queries, providing product and service information, and ensuring a high level of customer satisfaction. You will be the first point of contact for clients, ensuring issues are addressed promptly and effectively.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Respond to customer queries via phone, email, or chat in a timely and professional manner.</li>\n<li>Provide accurate information about products and services.</li>\n<li>Troubleshoot and resolve customer issues or escalate them to appropriate departments when necessary.</li>\n<li>Maintain records of customer interactions, feedback, and complaints.</li>\n<li>Follow up with customers to ensure issues are resolved satisfactorily.</li>\n<li>Work closely with internal teams (technical, sales, operations) to support customer needs.</li>\n<li>Identify trends in customer issues and provide feedback for process improvement.</li>\n<li>Adhere to support policies and performance metrics (SLAs, CSAT scores, etc.).</li>\n</ul>\n<p><strong>Qualifications &amp; Skills:</strong></p>\n<ul>\n<li>Bachelor's degree in any discipline (preferably in Business, IT, or a related field).</li>\n<li>Prior experience in customer support or a similar role is a plus.</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong problem-solving skills and a customer-oriented attitude.</li>\n<li>Ability to multitask and manage time effectively.</li>\n<li>Proficiency in using support tools, ticketing systems (e.g., Zendesk, Freshdesk), and the MS Office suite.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Familiarity with CRM systems or helpdesk software.</li>\n<li>Multilingual skills are an advantage.</li>\n<li>Experience working in a fast-paced environment or startups</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "1+ Years",
            "Customer Support",
            "Zendesk",
            "Communication Skills"
        ],
        "summary": "We need a Support Executive to resolve customer queries and provide product information. The ideal candidate is customer-focused and skilled in problem-solving and communication."
    },
    {
        "job_title": "Junior Geophysicist- Fiber-optic Sensing & AI (Fresher)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19502/157",
        "location": "Infopark",
        "closing_date": "08 Jul 2025",
        "job_description": "<h2>Junior Geophysicist - Fiber-optic Sensing &amp; AI (Fresher)</h2>\n<p>We are seeking a motivated Junior Geophysicist (recent graduate) to dive into projects involving Distributed Acoustic Sensing (DAS), fiber‑optic sensor data, and Python‑driven AI analysis. You’ll work closely with geophysicists, data scientists, and engineers to drive data‑centric insights and support field deployments.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Support data acquisition, preprocessing, and interpretation from fiber‑optic sensing systems (DAS/DTS).</li>\n<li>Analyze large time‑series datasets using Python (NumPy, Pandas, SciPy, Matplotlib).</li>\n<li>Collaborate with AI/ML experts to build models for signal classification, event detection, or anomaly identification.</li>\n<li>Participate in field activities, including deploying sensors, monitoring systems, and validating datasets.</li>\n<li>Document workflows, results, and technical insights clearly in reports or code comments.</li>\n</ul>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li>Bachelor's or Master's degree in Geophysics, Geoscience, Physics, Engineering, or related discipline.</li>\n<li>Fundamental understanding of seismic wave behavior and fiber‑optic sensing principles.</li>\n<li>Basic proficiency in Python and experience with data‑analysis libraries.</li>\n<li>Interest in machine learning—any exposure to scikit‑learn, TensorFlow, or PyTorch is a plus.</li>\n<li>Excellent analytical thinking, communication skills, and collaborative mindset.</li>\n</ul>\n<p><strong>Preferred (Nice-to-Have)</strong></p>\n<ul>\n<li>Experience with signal processing, time‑series analysis, or seismic inversion methods.</li>\n<li>Familiarity with version control systems (e.g., Git) and Jupyter notebooks.</li>\n<li>Willingness and physical ability to participate in occasional fieldwork and travel.</li>\n</ul>\n<p><strong>What You’ll Gain</strong></p>\n<ul>\n<li>Hands‑on experience at the intersection of geophysics, fiber‑optic sensing, and AI.</li>\n<li>Mentorship from industry professionals and cross‑disciplinary collaboration.</li>\n<li>Exposure to real‑world problems in energy, infrastructure, and environmental monitoring.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "Fresher",
            "Fiber-Optic Sensing",
            "Python",
            "AI/ML"
        ],
        "summary": "Seeking a Junior Geophysicist to work with fiber-optic sensing and AI. Responsibilities include data analysis, model building, and field activities related to geophysical projects."
    },
    {
        "job_title": "Freelance Video/Reels Editor, Freelance (Remote)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19503/157",
        "location": "Infopark",
        "closing_date": "08 Jul 2025",
        "job_description": "<h2>Freelance Video/Reels Editor (Remote)</h2>\n<p>We are seeking a creative and detail-oriented Freelance Video/Reels Editor to join our team. The ideal candidate will have experience editing short-form content for social media platforms such as Instagram Reels, YouTube Shorts, and Facebook. You should be able to transform raw footage into engaging and high-quality videos that align with our brand voice and visual style.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Edit and produce high-quality short-form videos (60–90 seconds) for platforms like Instagram Reels, Facebook, and YouTube Shorts.</li>\n<li>Add appropriate transitions, effects, subtitles, music, and sound effects to enhance viewer engagement.</li>\n<li>Understand and apply trends, viral formats, and platform-specific best practices.</li>\n<li>Collaborate with the content/marketing team to understand project requirements and timelines.</li>\n<li>Deliver final videos in multiple formats/resolutions when required.</li>\n<li>Revise videos promptly based on feedback.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Proven experience as a video editor with a strong portfolio of Reels or short-form content.</li>\n<li>Proficiency in video editing software such as Adobe Premiere Pro, Final Cut Pro, CapCut, or similar tools.</li>\n<li>Strong understanding of social media trends and editing techniques that drive engagement.</li>\n<li>Ability to meet tight deadlines and work independently.</li>\n<li>Good communication and time management skills.</li>\n<li>A keen eye for detail, storytelling, and visual aesthetics.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with motion graphics and basic animation.</li>\n<li>Familiarity with brand guidelines and content strategy.</li>\n<li>Knowledge of color grading and sound design basics.</li>\n</ul>\n<p><strong>Compensation:</strong></p>\n<p>Project-based or hourly (Negotiable based on experience and quality of work)</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "2+ Years",
            "Adobe Premiere Pro",
            "Social Media Trends",
            "Short-Form Content"
        ],
        "summary": "We are looking for a Freelance Video/Reels Editor to create engaging short-form videos for social media. The role involves editing, adding effects, and collaborating with the marketing team."
    },
    {
        "job_title": "Project Manager (Data & Analytics)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19511/157",
        "location": "Infopark",
        "closing_date": "08 Jul 2025",
        "job_description": "<h2>Project Manager (Data &amp; Analytics)</h2>\n<p>We are seeking a skilled Project Manager to spearhead data-driven projects across diverse business areas. You will manage data engineering, business intelligence, and analytics projects, partnering with both technical and business teams to deliver impactful solutions within set timelines and budgets.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead end-to-end project management for data and analytics initiatives.</li>\n<li>Define project scope, goals, deliverables, timelines, and resource plans.</li>\n<li>Collaborate closely with data engineers, data scientists, analysts, and business stakeholders.</li>\n<li>Proactively manage project risks, issues, and dependencies.</li>\n<li>Ensure quality assurance, timely reporting, and documentation throughout the project lifecycle.</li>\n<li>Communicate project status, updates, and escalations to leadership and stakeholders.</li>\n<li>Drive Agile/Scrum ceremonies and ensure timely sprint deliverables.</li>\n<li>Coordinate across cross-functional teams to ensure alignment with business objectives.</li>\n<li>Track KPIs, ROI, and business impact of analytics solutions.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Engineering, or a related field.</li>\n<li>PMP/Prince2 certification is a plus.</li>\n<li>7+ years of total experience with at least 3+ years in managing data analytics or data engineering projects.</li>\n<li>Strong understanding of data warehousing, ETL pipelines, data visualization, and analytics platforms.</li>\n<li>Hands-on experience with tools/technologies like SQL, Power BI/Tableau, Python/R (preferred), and cloud data platforms (AWS/GCP/Azure).</li>\n<li>Strong project management skills including planning, budgeting, and stakeholder management.</li>\n<li>Proficient in Agile/Scrum methodologies.</li>\n<li>Excellent problem-solving, communication, and leadership skills.</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul>\n<li>Experience working in a consulting or fast-paced environment.</li>\n<li>Preference for start-up experience.</li>\n<li>Familiarity with data governance, data quality, and compliance standards.</li>\n<li>Prior experience leading cross-border/global data projects.</li>\n</ul>\n<p>If you are interested, please send your resume to lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "7+ Years",
            "Data Analytics",
            "SQL",
            "Agile/Scrum"
        ],
        "summary": "Seeking a Project Manager for data and analytics projects, requiring 7+ years of experience and proficiency in Agile/Scrum. The role involves leading data initiatives and managing stakeholders."
    },
    {
        "job_title": "Business Development Manager",
        "company": "WORKSENT TECHNOLOGIES PVT LTD",
        "url": "https://infopark.in/company-jobs/details/19513/164",
        "location": "Infopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p><strong>Role:</strong> Business Development Manager</p>\n<p><strong>Location:</strong> Infopark, Kochi</p>\n<p><strong>Experience:</strong> 5+ years</p>\n<p><strong>Position Overview:</strong></p>\n<p>We are looking for a highly motivated and experienced Business Development Manager to join our team. This leadership role requires a strong background in international sales and a proven track record of driving revenue growth in global markets.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead and manage the sales team to ensure that sales targets are achieved, and revenue growth is maximized.</li>\n<li>Develop and implement effective sales strategies for international markets, with a focus on North America.</li>\n<li>Build and nurture relationships with key clients, focusing on long-term business success.</li>\n<li>Represent the company at international business events, conferences, and client meetings.</li>\n<li>Motivate, guide, and mentor the sales team, ensuring their professional growth and high performance.</li>\n<li>Monitor the performance of the sales team and make adjustments to sales strategies when necessary.</li>\n<li>Collaborate with marketing, services, and other departments to align sales strategies and improve customer satisfaction.</li>\n<li>Stay updated on market trends, competitor strategies, and customer feedback to refine and improve sales tactics.</li>\n</ul>\n<p><strong>Qualifications and Skills:</strong></p>\n<ul>\n<li>A minimum of 5+ years of experience in international sales, with a proven ability to manage and grow sales in global markets.</li>\n<li>Experience working in a product-based or service-based company.</li>\n<li>Hands-on experience in leading a sales team, driving motivation, and ensuring high performance.</li>\n<li>Demonstrated experience in dealing with North American customers and understanding their business environment.</li>\n<li>Strong communication, negotiation, and relationship-building skills.</li>\n<li>Ability to travel frequently and attend business events and client meetings globally.</li>\n<li>Candidates with US visa is highly preferred.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@worksent.com</p>",
        "tags": [
            "5+ Years",
            "International Sales",
            "Sales Strategy",
            "North America"
        ],
        "summary": "We are seeking a Business Development Manager to lead sales strategies in international markets. The role involves team leadership, client relationship management, and achieving revenue growth."
    },
    {
        "job_title": "WALK IN INTERVIEW",
        "company": "Vistas Global Intellect Private Limited",
        "url": "https://infopark.in/company-jobs/details/19520/492",
        "location": "Infopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Walk-In Interview - Vistas Global</h2>\n<p>Vistas Global is conducting walk-in interviews for multiple exciting roles across departments. If you're looking to be part of a dynamic and fast-growing team, we’d love to meet you.</p>\n<p><strong>Location:</strong> 4th Floor, Cloudscapes - Sunya EK Cyber Park, Info Park Phase II (SEZ), Kochi</p>\n<p><strong>Date:</strong> Thu 10-July-2025</p>\n<p><strong>Time:</strong> 10.30 AM to 4.00 PM</p>\n<p><strong>What to bring:</strong></p>\n<ul>\n<li>Updated resume</li>\n<li>Be ready for spot interviews</li>\n</ul>\n<p><strong>Open Positions:</strong></p>\n<ul>\n<li>Senior Engineer (Planning)</li>\n<li>Team Lead (Planning and Bulk Orders)</li>\n<li>Material Planning Engineer</li>\n<li>Quantity Survey Engineers</li>\n<li>Quantity Survey Engineers-Trainee</li>\n<li>Procurement Specialist Trainee (ERP)</li>\n<li>Procurement Analyst (ERP)</li>\n<li>Material Engineers</li>\n<li>Head of Inventory and Warehousing</li>\n<li>ERP Specialist-Master Data Admin</li>\n<li>ERP Administrator</li>\n<li>Head of Logistics</li>\n<li>Manager International Supply Chain</li>\n<li>Supply Chain Analyst</li>\n</ul>\n<p>Freshers and experienced candidates are welcome.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at yim.changkija@ariaholding.com</p>",
        "tags": [
            "Freshers",
            "ERP",
            "Supply Chain",
            "Procurement"
        ],
        "summary": "Vistas Global is holding walk-in interviews in Kochi for various positions. They seek both freshers and experienced candidates to join their dynamic team."
    },
    {
        "job_title": "AI/ML – Team Lead",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19504/85",
        "location": "Infopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>AI/ML – Team Lead</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nTechversant is seeking a highly skilled and experienced AI/ML Lead to lead the design and implementation of our artificial intelligence and machine learning solutions. The successful candidate will work closely with cross-functional teams to understand business requirements and develop scalable, efficient, and robust AI/ML systems.</p>\n<p><strong>Job Description</strong></p>\n<ul>\n<li>As a AI/ML Lead, you will need to build Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and generative models.</li>\n<li>To Define, design, and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Create demos and proofs of concept, develop AI/ML based products and services.</li>\n<li>Creating Functional and technical specifications for AI &amp; ML solutions.</li>\n<li>Follow SDLC process</li>\n<li>Advanced analytical knowledge of data and data conditioning</li>\n<li>Programming advanced computing and developing algorithms</li>\n<li>Developing software, data models and executing predictive analysis</li>\n<li>Design, develop, and implement generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements and develop innovative solutions.</li>\n<li>Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).</li>\n<li>Strong proficiency in SQL, NO SQL Databases.</li>\n<li>Experience in implementing and deploying AI\\ Machine Learning solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)</li>\n<li>Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.</li>\n<li>Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g. Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</li>\n</ul>\n<p><strong>What will make you stand out</strong></p>\n<ul>\n<li>Experience in production software engineering routines in DevOps/MLOps (e.g. Continuous Code Integration and Deployment).</li>\n<li>Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</li>\n</ul>\n<p><strong>Experience and Qualification:</strong></p>\n<ul>\n<li>B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "5+ Years",
            "Python",
            "AI/ML",
            "Tensorflow"
        ],
        "summary": "Techversant is looking for an AI/ML Team Lead to design and implement AI/ML solutions. The role involves working with cross-functional teams and developing scalable AI/ML systems."
    },
    {
        "job_title": "Software Engineer - AI/ML",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19505/85",
        "location": "Infopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>AI/ML Engineer</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p>Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence, etc.</p>\n<p><strong>What’s important to us:</strong>\nWe are seeking experienced AI/ML Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Job Description</strong></p>\n<ul>\n<li>As an AI/ML Engineer, you will be responsible for developing AI/ML Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and Generative AI models.</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Develop proofs of concept AI/ML based solutions and services and demonstrate them to Business.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Experience in implementing and deploying AI/ML solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest, etc.)</li>\n<li>Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.</li>\n<li>Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).</li>\n<li>Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g., Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g., Tensorflow, Pytorch).</li>\n<li>Experience in RDBMS, NoSQL, Big Data stores like Elastic, Cassandra, Hbase, Hive, HDFS, and Big Data technologies like Kafka, Apache Spark is a plus.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Knowledge in data visualization tools (Tableau, Power BI, etc.) and SQL.</li>\n<li>Excellent understanding of object-oriented concepts and Python.</li>\n<li>Experience in NLP models like BERT, Transformer architectures, etc.</li>\n<li>Experience in leveraging Computer Vision and OCR in document extraction use cases.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>What will make you stand out</strong></p>\n<ul>\n<li>Experience in production software engineering routines (e.g., Continuous Integration/Continuous Deployment).</li>\n<li>Experiences in cloud-based solutions (e.g., AWS, Azure, GCP).</li>\n<li>Experience working using Agile-based principles and tools.</li>\n<li>Familiarity with working on large data sets and distributed computing (e.g., Hive, Spark, Kafka, Airflow, Scala).</li>\n<li>Certification in any of the available cloud-based AI/ML technologies is a plus.</li>\n</ul>\n<p><strong>Experience and Qualification:</strong></p>\n<ul>\n<li>B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</li>\n<li>3+ years of relevant experience in AI/ML projects</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities, etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "3+ Years",
            "AI/ML",
            "Python",
            "Tensorflow"
        ],
        "summary": "Techversant is seeking an AI/ML Engineer to develop and implement AI/ML solutions. The role involves designing, developing, and deploying machine learning models and collaborating with cross-functional teams."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19506/85",
        "location": "Infopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant provides Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nWe are seeking experienced AI/ML Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Job Description</strong></p>\n<ul>\n<li>Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.</li>\n<li>Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs) and diffusion models for a range of use cases involving text, code, and multi-modal data.</li>\n<li>Build Scalable Recommendation Engines: Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.</li>\n<li>Cloud-Native ML Engineering: Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.</li>\n<li>End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.</li>\n<li>Collaborate Across Functions: Work with cross-functional teams including product managers, engineers, and data scientists to translate business goals into AI-powered solutions.</li>\n</ul>\n<p><strong>Core Requirements</strong></p>\n<ul>\n<li>Minimum 4 years of experience in building and deploying production-level ML/DL systems</li>\n<li>Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Strong understanding of transformer architectures and deep learning model design</li>\n<li>Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution</li>\n<li>Expertise in Python programming with a focus on:<ul>\n<li>Code optimization and profiling</li>\n<li>Multi-threading and multiprocessing</li>\n<li>Object-oriented programming and design principles</li>\n</ul>\n</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Technical Stack</strong></p>\n<ul>\n<li>Languages: Excellent understanding of object-oriented concepts and Python.</li>\n<li>ML/DL Frameworks:<ul>\n<li>Machine Learning: Scikit-learn, XGBoost, LightGBM</li>\n<li>Deep Learning: PyTorch, TensorFlow, Keras</li>\n<li>GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework</li>\n</ul>\n</li>\n<li>Cloud &amp; MLOps: AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes</li>\n<li>Data &amp; Compute: Apache Spark, BigQuery, RabbitMQ, S3, EC2</li>\n<li>Embedding Stores &amp; Vector Search: FAISS, Pinecone, ChromaDB</li>\n<li>Orchestration &amp; APIs: Apache Airflow, Docker Deployment, and FastAPI are a must</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li>Experience with multi-modal models combining text, vision, or audio</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct)</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure)</li>\n</ul>\n<p><strong>Education</strong></p>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field</li>\n<li>Equivalent practical experience in developing scalable AI solutions will also be considered</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "4+ Years",
            "Generative AI",
            "Python",
            "Cloud Native"
        ],
        "summary": "Techversant is hiring a Senior AI/ML Engineer to develop and deploy machine learning solutions. The role involves building and fine-tuning models, managing cloud deployments, and collaborating with cross-functional teams."
    },
    {
        "job_title": "Lead UX Engineer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19507/85",
        "location": "Infopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Lead UX Engineer</h2>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong></p>\n<p>We are seeking a highly skilled and experienced Lead UX Engineer to join our team. As the Lead UX Engineer, you will be responsible for guiding the design and development of high-quality, user-centric digital experiences. In this leadership role, you will collaborate closely with product managers, UX/UI designers, and engineering teams, ensuring the successful integration of design and technology. You will set the direction for user experience strategies and mentor a growing team of UX engineers to deliver seamless and innovative solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the end-to-end UX design process for web and mobile applications.</li>\n<li>Conduct user research, interviews, journey mapping, and storyboarding to understand user needs and behaviour.</li>\n<li>Develop and implement information architecture, wireframes, and prototypes to visualize design concepts.</li>\n<li>Create and maintain design systems to ensure consistency across platforms.</li>\n<li>Work collaboratively with product managers, developers, and other stakeholders to align design solutions with business goals.</li>\n<li>Utilize design thinking methodologies to solve complex user experience challenges.</li>\n<li>Ensure accessibility, usability, and UX best practices are integrated into designs.</li>\n<li>Drive innovation by staying up to date with the latest UX/UI trends, tools, and technologies.</li>\n<li>Effectively communicate design ideas and decisions through presentations and documentation.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>7+ years of experience in User Experience Design for enterprise applications.</li>\n<li>Strong knowledge of web and mobile UX principles and best practices.</li>\n<li>Advanced skills in user research, wireframing, prototyping, and usability testing.</li>\n<li>Proficiency in building and managing design systems.</li>\n<li>Highly creative and inquisitive, with the ability to multitask effectively.</li>\n<li>Strong verbal and written communication skills.</li>\n<li>Expertise in interaction design and user interface building.</li>\n<li>Certified Usability Expert (HFI) or equivalent certification is a plus.</li>\n<li>Experience in a fast-paced software development environment with the ability to meet aggressive deadlines</li>\n</ul>\n<p><strong>Technical Proficiency:</strong></p>\n<p>The ideal candidate should have hands-on experience with a wide range of design tools, including the Adobe CS5 Suite (XD, Photoshop, Illustrator), Figma, InVision, Axure RP, Balsamiq, OmniGraffle, and Sketch. Additionally, a strong understanding of front-end technologies such as HTML, CSS, Bootstrap, and other modern front-end frameworks is required to effectively collaborate with development teams.</p>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "7+ Years",
            "UX Design",
            "Wireframing",
            "Prototyping"
        ],
        "summary": "Seeking a Lead UX Engineer to guide the design of user-centric digital experiences. The role involves UX strategy, team mentorship, and collaboration with stakeholders."
    },
    {
        "job_title": "Lead React Native Developer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19508/85",
        "location": "Infopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Lead React Native Developer</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nAs a Lead- React Native Developer, you will lead the development and maintenance of our mobile applications using React Native. You will collaborate closely with cross-functional teams, including backend developers, to deliver high-quality, scalable, and user-friendly mobile solutions. The ideal candidate should have extensive experience in React Native development, possess a deep understanding of mobile application development best practices, and demonstrate leadership abilities to guide and mentor junior team members.</p>\n<p><strong>Job Description:</strong>\n- Lead the development and implementation of mobile applications using React Native.\n- Collaborate with cross-functional teams to gather and analyze project requirements.\n- Previous ownership of app development projects is required.\n- Develop automated tests to guarantee the product’s top-notch quality.\n- Stay updated with the latest advancements and changes in mobile platforms and technologies.\n- Provide technical supervision and support to mentor the team effectively.\n- Conduct code reviews to ensure adherence to coding standards, best practices, and maintain code quality.\n- Ensure the application is published and maintained in both the App Store and Google Play Store, adhering to their respective policies and guidelines.\n- Participate in agile development processes, including sprint planning, estimation, and retrospectives.</p>\n<p><strong>Preferred Skills:</strong>\n- 10+ years of experience in React Native Development, Minimum 3 yrs in Lead role.\n- Expert-level proficiency in JavaScript, TypeScript, and React Native framework.\n- Demonstrated hands-on experience in designing and developing applications using React Native, iOS and Android platforms.\n- Capability to plan the core architecture and iteratively enhance it as needed.\n- Strong analytical mindset to extract actionable insights from data.\n- Excellent Team management and communication skills.\n- Experience with RESTful APIs and integration of third-party libraries and APIs.\n- Possess a comprehensive understanding of React Native.\n- Capable of understanding the company’s business needs and adjusting or innovating the product accordingly.</p>\n<p><strong>What Company Offers:</strong>\nExcellent career growth opportunities and exposure to multiple technologies. Fixed weekday day schedule, meaning, you’ll have your weekends off! Family Medical Insurance. Unique leave benefits and encashment options based on performance. Long term growth opportunities. Fun family environment surrounded by experienced developers. Various internal employee rewards programs based on Performance. Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation. Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc. Company Sponsored International Tours</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "10+ Years",
            "React Native",
            "JavaScript",
            "RESTful APIs"
        ],
        "summary": "Techversant is seeking a Lead React Native Developer to lead mobile app development. The role involves mentorship, ensuring code quality, and integrating third-party APIs."
    },
    {
        "job_title": "Python Solution Architect",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19509/85",
        "location": "Infopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Python Solution Architect</h2>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong></p>\n<p>Techversant is seeking an experienced Solution Architect to design and implement scalable, high-performance AI-driven applications using the latest technologies in Python, cloud, and machine learning. The ideal candidate will have a strong background in Python development, excellent leadership skills, and a passion for mentoring and guiding team members.</p>\n<p><strong>Job Responsibilities</strong></p>\n<ul>\n<li>Architect and design end-to-end solutions using Python (Django/FastAPI/Flask), AI/ML models, and cloud-native technologies.</li>\n<li>Lead AI/ML-driven application development, including model deployment, data pipelines, and intelligent automation.</li>\n<li>Collaborate with data scientists, engineers, and product teams to integrate AI/ML models into scalable applications.</li>\n<li>Optimize system performance, ensuring scalability, cost efficiency, and security.</li>\n<li>Implement microservices architecture with APIs, containerization (Docker/Kubernetes), and event-driven design.</li>\n<li>Drive best DevOps practices with CI/CD pipelines, MLOps, Infrastructure as Code (Terraform, CloudFormation), and automated testing.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Python &amp; Full Stack: Django, FastAPI, Flask, React, Angular, or Vue.js.</li>\n<li>AI/ML &amp; Data Science: TensorFlow, PyTorch, Scikit-learn, NLP, Computer Vision, or MLOps.</li>\n<li>Cloud &amp; DevOps: AWS, Azure, or GCP with Kubernetes &amp; CI/CD.</li>\n<li>Big Data &amp; Databases: PostgreSQL, MongoDB, Redis, Snowflake, or Spark.</li>\n<li>Architecture &amp; Security: Microservices, API Gateway, Event-Driven Systems, and best security practices.</li>\n</ul>\n<p><strong>Ideal Experience Level:</strong></p>\n<ul>\n<li>10+ years in software development with strong Python expertise, including full-stack development.</li>\n<li>2+ years of experience as a Solution Architect, with demonstrated success in leading and delivering enterprise-level projects.</li>\n<li>Strong AI/ML experience, specifically in model deployment, data engineering, and cloud integration</li>\n</ul>\n<p><strong>Nice-to-Have Skills:</strong></p>\n<ul>\n<li>Hands-on experience with LLMs, Generative AI, or Reinforcement Learning.</li>\n<li>Expertise in GraphQL, Serverless (AWS Lambda, Firebase), and Edge AI.</li>\n<li>Experience with data engineering, real-time analytics, and feature stores.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<p>Excellent career growth opportunities and exposure to multiple technologies.\nFixed weekday day schedule, meaning, you’ll have your weekends off!\nFamily Medical Insurance.\nUnique leave benefits and encashment options based on performance.\nLong term growth opportunities.\nFun family environment surrounded by experienced developers.\nVarious internal employee rewards programs based on Performance.\nOpportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\nWork life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\nCompany Sponsored International Tours.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "10+ Years",
            "Python",
            "AI/ML",
            "Cloud"
        ],
        "summary": "Techversant is hiring a Python Solution Architect to design AI-driven applications. The role involves leading development, optimizing performance, and integrating AI/ML models into scalable applications."
    },
    {
        "job_title": "UI/UX Designer(2 -4 YEARS)",
        "company": "GALTech Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19516/189",
        "location": "Infopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>UI/UX Designer</h2>\n<p>We are seeking a UI/UX Designer to join our team and contribute to building the next generation of user interfaces. In this role, you will be responsible for designing, developing, and implementing high-quality, user-friendly interfaces for our products.</p>\n<p><strong>Roles and Responsibilities</strong></p>\n<ul>\n<li>Design, develop, and implement high-quality, user-friendly interfaces.</li>\n<li>Work closely with other team members to ensure that our interfaces align with business goals and meet user needs.</li>\n<li>Stay current with industry trends and best practices in front-end development.</li>\n<li>Collaborate with other teams to ensure our interfaces are integrated with other systems and components.</li>\n</ul>\n<p><strong>Skills and Requirements</strong></p>\n<ul>\n<li>2+ Years of experience in UI development.</li>\n<li>Strong understanding of HTML, CSS, JavaScript, and WordPress.</li>\n<li>Experience with React is an advantage.</li>\n<li>Experience with user interface design principles and best practices.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Maintain high standards of code quality and ensure compliance with industry best practices.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and collaboration skills.</li>\n</ul>\n<p><strong>Contacts</strong></p>\n<p>Email: hr@galtech.org\nCall: +91 6282845368</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@galtech.org</p>",
        "tags": [
            "2+ Years",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "summary": "Seeking a UI/UX Designer to design and develop user-friendly interfaces. Requires 2+ years of experience with HTML, CSS, and JavaScript."
    },
    {
        "job_title": "Business Development Intern",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/19524/296",
        "location": "Infopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Business Development Intern</h2>\n<p>Ready to launch your career in business development? Join GrapeLime Innovations PVT Ltd and grow with a passionate, innovative team!</p>\n<p>Outstanding performers during the internship will have a strong chance to be offered a permanent role.</p>\n<p><strong>Location:</strong> Infopark, Kakkanad</p>\n<p><strong>Work Days:</strong> Monday to Friday (5-day work week)</p>\n<p><strong>Eligibility:</strong> Graduates from 2022, 2023, or 2024 (BTech, MCA candidates please excuse)</p>\n<p><strong>What You'll Do:</strong></p>\n<ul>\n<li>Identify and engage new sales leads</li>\n<li>Pitch and promote our services to potential clients</li>\n<li>Collaborate with cross-functional teams</li>\n<li>Tackle challenges with creativity and confidence</li>\n<li>Manage time, prioritize tasks, and meet deadlines</li>\n</ul>\n<p><strong>What We’re Looking For:</strong></p>\n<ul>\n<li>Excellent communication skills – both verbal and written (a must)</li>\n<li>Creative mindset and strong problem-solving abilities</li>\n<li>Resilience under pressure and a drive to meet goals</li>\n<li>Superb organizational and time-management skills</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your updated CV to hr@grapelime.in</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@grapelime.in</p>",
        "tags": [
            "0 Years",
            "Business Development",
            "Communication Skills",
            "Time Management"
        ],
        "summary": "GrapeLime Innovations is seeking a Business Development Intern to identify leads and promote services. Graduates from 2022-2024 are eligible; send CV to hr@grapelime.in."
    },
    {
        "job_title": "Sales Manager IT Industry",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/19510/4",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Sales Manager - IT Industry</h2>\n<p><strong>Location:</strong> Kochi\n<strong>Department:</strong> Sales\n<strong>Job Type:</strong> Full-Time</p>\n<p><strong>Job Overview:</strong>\nWe are seeking a highly motivated and experienced Sales Manager with a proven track record in the IT industry. The ideal candidate will have a minimum of 7 years of experience, demonstrating success in crafting and implementing long-term sales strategies, managing the sales cycle, and converting leads into loyal clients. As a Sales Manager, you will be in charge of business growth and cultivating lasting client relationships.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Sales Strategy &amp; Planning:</strong></li>\n<li>Develop and implement long-term sales strategies tailored to the IT industry.</li>\n<li>Analyze market trends, competitor activities, and client needs to inform business strategy.</li>\n<li>\n<p>Identify new business opportunities and markets for growth.</p>\n</li>\n<li>\n<p><strong>Lead Conversion &amp; Management:</strong></p>\n</li>\n<li>Manage the entire sales process, from lead generation to closing deals.</li>\n<li>Implement effective lead conversion strategies to maximize customer acquisition.</li>\n<li>\n<p>Foster long-term relationships with clients, ensuring high levels of satisfaction and retention.</p>\n</li>\n<li>\n<p><strong>Client Relationship Management:</strong></p>\n</li>\n<li>Build and nurture strong, long-term client relationships.</li>\n<li>Serve as the main point of contact for key accounts, ensuring timely responses to client inquiries and concerns.</li>\n<li>\n<p>Work closely with clients to understand their needs and present tailored IT solutions.</p>\n</li>\n<li>\n<p><strong>Collaboration &amp; Communication:</strong></p>\n</li>\n<li>Collaborate with marketing, product development, and technical teams to align sales initiatives with company goals.</li>\n<li>\n<p>Communicate sales forecasts, performance reports, and strategic plans to senior management.</p>\n</li>\n<li>\n<p><strong>Sales Reporting &amp; Analytics:</strong></p>\n</li>\n<li>Prepare and present accurate sales reports, KPIs, and forecasts.</li>\n<li>Leverage CRM systems and data analytics tools to track sales performance and identify areas for improvement.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in business, Marketing, IT, or related field (master's is a plus).</li>\n<li>7+ years of sales experience, with at least 3 years in a managerial role within the IT industry.</li>\n<li>Proven track record in achieving and exceeding sales targets, particularly in lead conversion and strategy development.</li>\n<li>Strong understanding of IT products, solutions, and services.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at aswathi.asok@arttechgroup.com</p>",
        "tags": [
            "7+ Years",
            "Sales Strategy",
            "Lead Conversion",
            "Client Relationship Management"
        ],
        "summary": "Seeking an experienced Sales Manager for the IT industry in Kochi. Responsibilities include sales strategy, lead conversion, and client relationship management to drive business growth."
    },
    {
        "job_title": "Senior Accountant",
        "company": "TutorComp Infotech (I) Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/19526/44",
        "location": "Infopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Senior Accountant</h2>\n<p>We are seeking an experienced and proactive Senior Accountant to oversee our company’s day-to-day financial operations, compliance, and government liaison activities. The ideal candidate should have strong accounting knowledge, multitasking ability, and readiness to travel for official duties.</p>\n<p><strong>Experience</strong>: 3+ years</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Maintain accurate Books of Accounts</li>\n<li>Ensure compliance with government and statutory regulations</li>\n<li>Manage cash flow, bank transactions, and reconciliations</li>\n<li>Prepare monthly and yearly budgets, financial statements, and cost control reports</li>\n<li>Handle client payment tracking and invoicing (B2B)</li>\n<li>Verify employee and tutor salaries (Domestic &amp; Foreign)</li>\n<li>Manage petty cash, vouchers, payment invoices, and office purchases</li>\n<li>Handle Softex documentation and EDPMS (SEZ) filings</li>\n<li>Liaise with government departments and regulatory bodies</li>\n<li>Manage contracts, agreements, FIRC, CPA, MOU records</li>\n<li>Ensure timely payments for subscriptions, salaries, and statutory dues</li>\n<li>Coordinate with the CA team for audits, GST filing, TDS, and PT computation</li>\n<li>Maintain and manage loan accounts, assets, and stationery inventory</li>\n<li>Support management with custom financial reports as needed</li>\n</ul>\n<p><strong>Key Skills &amp; Requirements:</strong></p>\n<ul>\n<li>Solid knowledge of Financial &amp; Cost Accounting</li>\n<li>Proficiency in Tally ERP / Zoho Books (added advantage)</li>\n<li>Strong command of MS Office, especially Excel, Word, and PowerPoint</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Ability to multitask, solve problems, and adapt to regulatory changes</li>\n<li>Prior experience with statutory compliance, taxation, and internal audits</li>\n<li>Must be comfortable with field visits to government offices</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tutorcomp.com</p>",
        "tags": [
            "3+ Years",
            "Financial Accounting",
            "Tally ERP",
            "Statutory Compliance"
        ],
        "summary": "Seeking a Senior Accountant to manage financial operations and compliance. Requires strong accounting knowledge and experience with government regulations and financial reporting."
    },
    {
        "job_title": "Micro-Influencer Collaboration – Kochi",
        "company": "Bramma IT Solutions",
        "url": "https://infopark.in/company-jobs/details/19515/443",
        "location": "Infopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>Micro-Influencer Collaboration</h2>\n<p>KochiBramma IT, a fast-growing digital marketing agency, is seeking creative and engaging Micro-Influencers to collaborate on exciting campaigns and brand projects!</p>\n<p><strong>Who We're Looking For:</strong></p>\n<ul>\n<li>Kochi-based influencers with 1K–25K followers</li>\n<li>Active presence on Instagram, YouTube, or LinkedIn</li>\n<li>Passionate about tech, lifestyle, business, education, or startups</li>\n<li>Authentic, consistent, and love engaging with your community</li>\n</ul>\n<p><strong>What’s in it for you?</strong></p>\n<ul>\n<li>Paid collaborations</li>\n<li>Long-term brand association</li>\n<li>Exclusive access to digital marketing insights &amp; events</li>\n<li>Opportunity to grow your personal brand</li>\n</ul>\n<p><strong>Interested?</strong></p>\n<p>Drop us an email with your profile to bramma2.ppc@gmail.com with the subject “Micro-Influencer Collaboration – Kochi”</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at bramma2.ppc@gmail.com</p>",
        "tags": [
            "0 Years",
            "Instagram",
            "YouTube",
            "LinkedIn"
        ],
        "summary": "KochiBramma IT seeks Kochi-based micro-influencers with 1K–25K followers for collaborations. Ideal candidates are passionate about tech, lifestyle, or business and have an active social media presence."
    },
    {
        "job_title": "Shopify Developer",
        "company": "Apro IT Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19521/420",
        "location": "Infopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Shopify Developer</h2>\n<p>We are seeking an experienced Shopify Developer with a strong background in building, customizing, and optimizing Shopify stores. The ideal candidate will have 1-3 years of hands-on experience in Shopify development, including theme customization, app integrations, performance optimization, and backend functionality using Liquid, JavaScript, and APIs.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, customize, and maintain Shopify stores based on business requirements.</li>\n<li>Optimize website performance for better speed and SEO.</li>\n<li>Work with Shopify Liquid template language for theme modifications and customizations.</li>\n<li>Develop and integrate third-party Shopify apps and APIs.</li>\n<li>Troubleshoot and debug Shopify-related issues and implement fixes.</li>\n<li>Ensure the website is mobile-friendly and responsive.</li>\n<li>Implement UI/UX best practices for an enhanced user experience.</li>\n<li>Collaborate with designers, marketers, and other developers to improve store functionality.</li>\n<li>Stay updated with the latest Shopify features, apps, and best practices.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>1-3 years of experience in Shopify development.</li>\n<li>Strong proficiency in Shopify Liquid, JavaScript, HTML, CSS, and jQuery.</li>\n<li>Experience with Shopify API, custom app development, and third-party app integrations.</li>\n<li>Strong knowledge of Shopify Plus, payment gateways, and checkout customizations (if applicable).</li>\n<li>Understanding of SEO best practices and performance optimization for Shopify stores.</li>\n<li>Familiarity with version control tools like Git.</li>\n<li>Experience in Headless Commerce using Shopify APIs (preferred but not mandatory).</li>\n<li>Ability to work independently and meet project deadlines.</li>\n<li>Experience with React.js, Vue.js, or other frontend frameworks.</li>\n<li>Knowledge of Shopify Hydrogen and GraphQL.</li>\n<li>Understanding of Dropshipping &amp; Print-on-Demand (POD) models.</li>\n<li>Previous experience working with Agile methodologies.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@aproitsolutions.in</p>",
        "tags": [
            "1-3 Years",
            "Shopify Liquid",
            "JavaScript",
            "Shopify API"
        ],
        "summary": "We're hiring a Shopify Developer to build and optimize Shopify stores. Proficiency in Liquid, JavaScript, and APIs is a must."
    },
    {
        "job_title": "Front - End Engineer",
        "company": "YOUGotaGift Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19525/482",
        "location": "Infopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Front-End Engineer</h2>\n<p>We’re seeking a Front-End Engineer who’s not only adept at crafting stunning, user-centric interfaces but also possesses a can-do attitude, a strong sense of ownership and accountability, and a genuine curiosity for continuous learning. The ideal candidate should exhibit a keen interest in exploring innovative technologies and a passion for building exceptional user experiences.</p>\n<p><strong>Must-Have Skills</strong></p>\n<ul>\n<li>1-2 years of experience</li>\n<li>Strong proficiency in React.js, Next.js, HTML, CSS, and JavaScript.</li>\n<li>Proficiency in TypeScript.</li>\n<li>Understands the functioning of modern web applications.</li>\n<li>Strong passion for crafting detailed, innovative, and empathetic user interfaces, with a keen eye for pixel-perfect component implementation.</li>\n<li>Experience or knowledge of headless CMS platforms, specifically Strapi.</li>\n<li>Solid understanding of API integration (RESTful APIs, and ideally GraphQL).</li>\n<li>Experience with state management patterns and libraries (e.g., Redux, React Query/TanStack Query, or React Context API).</li>\n<li>Familiarity with testing frameworks (e.g., Jest, React Testing Library).</li>\n<li>Knowledge of version control systems, preferably Git.</li>\n<li>A strong sense of ownership and accountability for your work.</li>\n<li>A curious mind, always eager to learn new technologies and best practices.</li>\n</ul>\n<p><strong>Added Advantages</strong></p>\n<ul>\n<li>Knowledge of the following concepts: SPA (Single Page Applications), ES6+ features, application performance optimization (including lazy loading, code splitting, and web vitals), unit testing methodologies, responsive design principles, SEO best practices, email template development, web accessibility (WCAG standards), and cross-browser compatibility.</li>\n<li>Familiarity with modern build tools (e.g., Webpack, Vite).</li>\n<li>Basic understanding of deployment processes and CI/CD pipelines.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at techcareers@yougotagift.com</p>",
        "tags": [
            "1-2 Years",
            "React.js",
            "Next.js",
            "JavaScript"
        ],
        "summary": "Seeking a Front-End Engineer to build user-centric interfaces, proficient in React.js and Next.js. The candidate should also have a passion for learning and innovation."
    },
    {
        "job_title": "Quality Analyst",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/19498/182",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Quality Analyst</h2>\n<p>We are looking for a detail-oriented and proactive Quality Analyst (QA) to join our team. If you have a keen eye for identifying bugs, improving quality, and ensuring a seamless user experience, this role is perfect for you! You will collaborate with developers, project managers, and other stakeholders to deliver high-quality web applications and websites.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Test Planning &amp; Execution: Develop and maintain comprehensive test plans, test cases, and test scenarios to validate functionality and performance.</li>\n<li>Defect Analysis: Identify, document, and track defects, providing clear and actionable feedback for resolution.</li>\n<li>Cross-Browser &amp; Cross-Device Testing: Ensure website compatibility across multiple browsers (Chrome, Firefox, Edge, Safari) and devices (desktop, tablet, mobile).</li>\n<li>Regression &amp; Retesting: Verify that new updates do not break existing functionalities and maintain software stability.</li>\n<li>Test Documentation: Maintain test cases, test reports, and bug logs for effective tracking and future reference.</li>\n<li>Performance &amp; Security Testing: Conduct basic security and performance checks to ensure website stability, reliability and accessibility.</li>\n<li>API Testing: Utilize tools like Postman to validate API functionality, ensure response accuracy, and assess performance efficiency.</li>\n<li>Collaboration: Work closely with developers, designers, and project managers to enhance software quality and user experience.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications</strong></p>\n<ul>\n<li>1 to 3 years of experience in manual testing of web and mobile applications.</li>\n<li>Strong understanding of SDLC (Software Development Life Cycle) and STLC (Software Testing Life Cycle).</li>\n<li>Experience in writing test cases, executing test scripts, and reporting defects.</li>\n<li>Hands-on experience in API testing using Postman.</li>\n<li>Familiarity with bug tracking and test management tools such as JIRA, Asana, or similar platforms.</li>\n<li>Familiarity with cross-browser testing platforms</li>\n<li>Strong analytical and problem-solving skills with great attention to detail.</li>\n<li>Excellent communication and teamwork skills to collaborate effectively with cross-functional teams.</li>\n<li>Hands-on experience with automated testing tools</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@2hatslogic.com</p>",
        "tags": [
            "1-3 Years",
            "Manual Testing",
            "API Testing",
            "JIRA"
        ],
        "summary": "Seeking a Quality Analyst to ensure high-quality web applications. Responsibilities include test planning, defect analysis, and collaboration with cross-functional teams."
    },
    {
        "job_title": "Lead Generation Executive",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/19499/182",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Lead Generation Executive</h2>\n<p>We are looking for a proactive and driven Lead Generation Executive to support our sales team by identifying and qualifying high-quality leads. The ideal candidate will have prior experience in IT services or product sales, a strong understanding of B2B lead generation channels, and the ability to effectively engage potential clients through platforms like LinkedIn and other online sources.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Research and identify potential leads through LinkedIn, online directories, web tools, databases and other platforms.</li>\n<li>Qualify leads based on predefined criteria to ensure alignment with our service offerings.</li>\n<li>Collaborate closely with the sales team to understand target markets and ideal customer profiles.</li>\n<li>Manage and optimize lead generation campaigns to ensure a consistent flow of qualified leads.</li>\n<li>Stay up to date with industry trends, competitor activities, and emerging tools for lead generation.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>2–4 years of experience in lead generation or inside sales, preferably in IT services or products.</li>\n<li>Proficient in LinkedIn Sales Navigator, CRM systems, and other lead generation platforms</li>\n<li>Excellent communication and interpersonal skills</li>\n<li>Strong research and analytical capabilities with the ability to qualify prospects effectively</li>\n<li>Flexible and adaptive to evolving market trends and demands</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@2hatslogic.com</p>",
        "tags": [
            "2-4 Years",
            "Lead Generation",
            "LinkedIn Sales Navigator",
            "CRM Systems"
        ],
        "summary": "Seeking a Lead Generation Executive to identify and qualify high-quality leads. Requires experience in IT services, B2B lead generation, and proficiency with platforms like LinkedIn."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Wazeefa1 Technologies Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/19512/108",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p>Wazeefa1 Technologies, a leading IT company based in Infopark, Thrissur, is seeking a passionate Full Stack Developer to join our talented team. We specialize in web development, mobile applications, and digital solutions for businesses.</p>\n<p><strong>What You'll Do:</strong></p>\n<ul>\n<li>Develop and maintain modern web applications (Frontend &amp; Backend)</li>\n<li>Build responsive UIs using React.js and style them with Material UI or Tailwind CSS</li>\n<li>Implement state management using Redux</li>\n<li>Create backend APIs using Express.js</li>\n<li>Handle authentication securely using JWT</li>\n<li>Work with SQL databases (MongoDB knowledge is a plus)</li>\n<li>Integrate third-party APIs seamlessly</li>\n<li>Use Git for version control</li>\n<li>Bonus: Familiarity with Angular or PHP is an added advantage</li>\n</ul>\n<p><strong>What We Expect:</strong></p>\n<ul>\n<li>Minimum 1 year of experience in Full Stack Development.</li>\n<li>Strong knowledge of React, Redux, Express, SQL, and API integrations</li>\n<li>Good understanding of UI frameworks like Material UI or Tailwind CSS</li>\n<li>Strong debugging and problem-solving skills</li>\n<li>Team player with good communication skills</li>\n</ul>\n<p><strong>Job Type:</strong> Full-time</p>\n<p><strong>Pay:</strong> ₹20,000.00 - ₹30,000.00 per month</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at cvs@wazeefa.in</p>",
        "tags": [
            "1+ Years",
            "React",
            "Express",
            "SQL"
        ],
        "summary": "Wazeefa1 Technologies is hiring a Full Stack Developer to develop and maintain modern web applications. The role requires experience with React, Redux, Express, and SQL."
    },
    {
        "job_title": "Junior Recruiter",
        "company": "In-Tech Group India Private Limited",
        "url": "https://infopark.in/company-jobs/details/19527/397",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Junior Recruiter</h2>\n<p><strong>About in-tech:</strong></p>\n<p>For the past 20 years, in-tech has specialized in electronics and software. It is a dynamic and fast-growing engineering company headquartered in Munich, Germany, employing around 2350 employees globally across 20 project locations in 8 countries. in-tech develops innovative solutions for the automotive, Rail, and Aerospace sectors.</p>\n<p>A strategic partner of Infosys Ltd since 2024, in-tech became a 100% subsidiary. Our India-based locations bring together the best of Indian and European work cultures, creating a unique in-tech environment that promotes strong team spirit and a positive, collaborative workplace.</p>\n<p>Now part of Infosys, we’re expanding our capabilities to meet a growing range of digital engineering requirements. This includes close collaboration with Infosys teams on cutting-edge engineering projects.</p>\n<p>We’re currently inviting applications for the role of a junior recruiter as part of an increase in our India recruitment team. This opportunity is based out of our Kochi location, but offers both onsite with hybrid work options. If you’re passionate about joining a growing and dynamic team with a company with a positive culture and team spirit, we’d love to connect with you!</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work closely with our existing recruitment team in Kochi, supporting recruitment activities for applicants across India and the UK.</li>\n<li>Post job openings on relevant platforms and actively promote opportunities through various channels.</li>\n<li>Maintain accurate and up-to-date records of candidates in the applicant tracking systems.</li>\n<li>Review resumes and applications to identify qualified candidates and move them in the ATS system accordingly.</li>\n<li>Coordinate with candidates if required and clarify their doubts based on their needs.</li>\n<li>Work closely with our recruitment managers to develop and implement effective sourcing strategies to identify and attract high-quality candidates.</li>\n<li>Utilize various recruitment channels including job boards, social media, networking, and referrals.</li>\n<li>Work with our HR onboarding teams as required to support new applicants joining processes.</li>\n<li>Support on-premises or external recruitment events in Kerala.</li>\n<li>On-site training will be provided for progression of the role and to gain further experience.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<p>The ideal candidate would be a graduate with 1-2 years of proven work experience as a recruiter or in a similar role. In addition to this, you will need to meet the following requirements:</p>\n<ul>\n<li>Being well-structured and experienced with handling recruitment activities.</li>\n<li>IT literate, ability to use all Microsoft applications, together with adapting quickly to internal software systems operated internally within in-tech.</li>\n<li>Success Factors (SAP Tool) or knowledge with any Application Tracking System would be a plus.</li>\n<li>Enjoying repetitive, not overly complex tasks &amp; being satisfied on a mid-term level with such tasks.</li>\n<li>Must be an enthusiast with a go-for-it attitude.</li>\n<li>Ability to predict challenges and seek to proactively head-off obstacles.</li>\n<li>Strong communication and interpersonal skills to effectively interact with end-users and team members across our foreign locations, especially the UK.</li>\n<li>While the role would be flexible allowing you to work from home, you would be expected to attend our Kochi office at least once a week.</li>\n</ul>\n<p><strong>Apply with us</strong></p>\n<p>If you have the experience, team spirit, and are looking for a great place to work, then start your job with us.</p>\n<p>As part of our dedication to the diversity of our workforce, in-tech is committed to equal employment opportunity without regard for age, race, color, national origin, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity, or religion.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at india.talent@in-tech.com</p>",
        "tags": [
            "1-2 Years",
            "Recruitment",
            "ATS",
            "Communication Skills"
        ],
        "summary": "We are looking for a Junior Recruiter to join our team in Kochi. You will support recruitment activities and implement effective sourcing strategies."
    },
    {
        "job_title": "Senior HR Associate",
        "company": "In-Tech Group India Private Limited",
        "url": "https://infopark.in/company-jobs/details/19528/397",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Senior HR Associate</h2>\n<p><strong>About in-tech</strong></p>\n<p>For the past 20 years, in-tech has specialized in electronics and software. We are a dynamic, fast-growing engineering company headquartered in Munich, Germany, with around 2350 employees globally across 20 project locations in 8 countries. in-tech develops innovative solutions for the automotive, Rail, and Aerospace sectors.</p>\n<p>Since 2024, in-tech has been a strategic partner of Infosys Ltd, after becoming a 100% subsidiary.</p>\n<p><strong>Our India Location</strong></p>\n<p>Our India-based locations bring together the best of Indian and European work cultures, creating a unique in-tech environment that promotes strong team spirit and a positive, collaborative workplace.</p>\n<p>Now part of Infosys, we’re expanding our capabilities to meet a growing range of digital engineering requirements. This includes close collaboration with Infosys teams on cutting-edge engineering projects.</p>\n<p>We’re currently inviting applications for the role of a Senior HR Associate as part of an increase in our India HR team.</p>\n<p>This opportunity is based out of our Kochi location, but offers both onsite with hybrid work options. If you’re passionate about joining a growing and dynamic team with a company with a positive culture and team spirit, we’d love to connect with you!</p>\n<p><strong>Responsibilities</strong></p>\n<ol>\n<li>The role will report directly to the HR Manager in India, but will also require close collaboration with the HR, recruiting, and Immigration teams across India and UK.</li>\n<li>The role will focus heavily on supporting and improving the whole onboarding process to handle the current growth.</li>\n<li>Process all new starters and leavers, tracking status and managing the work flows.</li>\n<li>Support and process all new starter or leaver, including offer letters and all acceptance documentation as needed for a successful candidate onboarding process.</li>\n<li>Managing the required candidate checks for all new starters with external suppliers.</li>\n<li>Manage all necessary steps required for necessary onboardings into systems and client systems for hardware release.</li>\n<li>Monitor and update corporate employee health insurance for changes in employee data or new starters or leavers.</li>\n<li>Monitor and update employee data held in internal systems for employees in India and UK.</li>\n<li>Support and organise onboarding days for new starters.</li>\n<li>Support the UK immigration team with new applications and gathering data.</li>\n<li>Assist the HR team with any additional HR processes as required.</li>\n</ol>\n<p><strong>Requirements</strong></p>\n<ol>\n<li>The ideal candidate would be a graduate with minimum 5 years of proven work experience in HR administration processes or similar HR role.</li>\n<li>IT literate, must have excellent knowledge for all Microsoft applications, together with adapting quickly to internal software systems operated internally within in-tech .</li>\n<li>Experience with SAP (SuccessFactors) and Jira would be an advantage, but is not essential.</li>\n<li>Excellent communicator, in written and verbal English skills.</li>\n<li>You have an independent and proactive way of working.</li>\n<li>While the role would be flexible allowing you to work from home, you would be expected to attend our Kochi office at least once a week.</li>\n</ol>\n<p><strong>Apply with us</strong></p>\n<p>If you have the experience, team spirit, and are looking for a great place to work, then start your job with us.</p>\n<p>As part of our dedication to the diversity of our workforce, in-tech is committed to equal employment opportunity without regard for age, race, color, national origin, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity, or religion.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at india.talent@in-tech.com</p>",
        "tags": [
            "5+ Years",
            "HR Administration",
            "SAP SuccessFactors",
            "Jira"
        ],
        "summary": "We are seeking a Senior HR Associate to support onboarding processes and HR administration. This role involves collaborating with global teams and managing employee data."
    },
    {
        "job_title": "Digital Marketing Intern (Fresher)",
        "company": "QC Verify Private Limited",
        "url": "https://infopark.in/company-jobs/details/19519/257",
        "location": "Infopark",
        "closing_date": "08 Aug 2025",
        "job_description": "<h2>Digital Marketing Intern (Fresher)</h2>\n<p><strong>Location:</strong> </p>\n<p><strong>Employment Type:</strong> Internship Full-time</p>\n<p><strong>Duration:</strong> 3 months</p>\n<h3>About the Role:</h3>\n<p>We are seeking a motivated and enthusiastic Digital Marketing Intern to join our team. This internship offers an excellent opportunity to gain hands-on experience in various aspects of digital marketing.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in managing and updating.</li>\n<li>Support on-page and off-page SEO tasks (basic knowledge is enough)</li>\n<li>Create and manage content on LinkedIn – posts, newsletters, engagement tracking.</li>\n<li>BlogRider experience is a plus, not mandatory</li>\n<li>Conduct market research, competitor analysis, and industry trend reports.</li>\n<li>Monitor analytics and performance data to support campaign optimization.</li>\n<li>Work with design and technical teams as needed</li>\n</ul>\n<h3>Preferred Candidate Profile:</h3>\n<ul>\n<li><strong>Education:</strong> MBA / BBA / Postgraduate in Marketing, Communications, Business, or related field.</li>\n<li><strong>Experience:</strong> Fresher (0–1 year) – internship or academic project experience preferred.</li>\n<li><strong>Skills:</strong><ul>\n<li>Basic understanding of SEO, LinkedIn marketing, and website tools</li>\n<li>Familiarity with blog writing or coordination with writers (BlogRider experience is a plus)</li>\n<li>Good research and analytical skills</li>\n<li>Excellent verbal and written communication</li>\n<li>Passion for digital marketing and eagerness to learn</li>\n<li>Organized, detail-oriented, and proactive</li>\n<li>(Female candidates preferred)</li>\n</ul>\n</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates should send their resumes to hr@qcverify.com.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@qcverify.com</p>",
        "tags": [
            "0-1 Year",
            "SEO",
            "LinkedIn Marketing",
            "Market Research"
        ],
        "summary": "Seeking a motivated Digital Marketing Intern for a 3-month internship. Assist with SEO, LinkedIn content, and market research to gain hands-on experience."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Expeed Software Private Limited",
        "url": "https://infopark.in/company-jobs/details/19517/452",
        "location": "Infopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for a highly motivated and skilled Java Developer with a strong foundation in Java frameworks—preferably Micronaut, or alternatively Spring Boot. You will be responsible for designing, developing, and maintaining robust backend services with an emphasis on clean architecture, performance, and scalability. This role requires a proactive attitude, a strong sense of ownership, and the ability to work independently and efficiently in a fast-paced environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and implement backend services and APIs using Java (Micronaut preferred or Spring Boot).</li>\n<li>Write clean, maintainable, and well-documented code following best practices.</li>\n<li>Work independently to deliver features and troubleshoot complex issues.</li>\n<li>Integrate with relational databases using JPA/Hibernate.</li>\n<li>Design and optimize database schemas and queries for performance.</li>\n<li>Collaborate with front-end developers, DevOps engineers, and QA teams to ensure seamless integration and deployment.</li>\n<li>Contribute to system architecture, design discussions, and code reviews.</li>\n</ul>\n<p><strong>Must-Have Skills:</strong></p>\n<ul>\n<li>5+ years of hands-on experience in Java development.</li>\n<li>Strong understanding of Java frameworks – preferably Micronaut or alternatively Spring Boot.</li>\n<li>Solid experience with JPA/Hibernate and a strong grasp of ORM principles.</li>\n<li>Good understanding of relational databases (e.g., PostgreSQL, MySQL).</li>\n<li>Proven ability to work independently with minimal supervision.</li>\n<li>Familiarity with RESTful API design and implementation.</li>\n</ul>\n<p><strong>Nice-to-Have / Added Advantage:</strong></p>\n<ul>\n<li>Experience with Docker and Kubernetes for containerization and orchestration.</li>\n<li>Familiarity with CI/CD pipelines using tools like Jenkins, GitLab CI, GitHub Actions, etc.</li>\n<li>Exposure to cloud platforms such as AWS, GCP, or Azure.</li>\n<li>Understanding of application monitoring and logging tools.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@expeed.com</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Micronaut",
            "Spring Boot"
        ],
        "summary": "Seeking a Senior Java Developer to design and maintain backend services. Strong Java, Micronaut/SpringBoot, and API skills are essential for this role."
    },
    {
        "job_title": "Laravel Developer (5-7 years Experience)",
        "company": "9Commerce Technologies",
        "url": "https://infopark.in/company-jobs/details/19522/261",
        "location": "Infopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Laravel Developer</h2>\n<p><strong>Job Summary:</strong></p>\n<p>We are looking for a highly skilled and experienced Senior Laravel Developer to join our growing development team. The ideal candidate will have extensive experience with the Laravel framework, a deep understanding of PHP, and a proven track record of building robust and scalable web applications. This role requires a proactive individual who can lead projects, mentor junior developers, and drive the development of high-quality solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain web applications using the Laravel framework.</li>\n<li>Collaborate with cross-functional teams to gather and define requirements, design solutions, and implement new features.</li>\n<li>Optimize application performance and ensure scalability and security.</li>\n<li>Lead code reviews, provide constructive feedback, and enforce best practices.</li>\n<li>Mentor and support junior developers, fostering a culture of continuous learning and improvement.</li>\n<li>Troubleshoot, debug, and resolve software defects and issues.</li>\n<li>Maintain comprehensive documentation for all code and development processes.</li>\n<li>Stay up-to-date with the latest industry trends, technologies, and best practices to ensure our applications remain current and competitive.</li>\n<li>Contribute to the continuous improvement of development processes and methodologies.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field; or equivalent work experience.</li>\n<li>5-7 years of professional experience in software development with a focus on PHP and the Laravel framework.</li>\n<li>Strong understanding of object-oriented programming and design patterns.</li>\n<li>Experience with front-end technologies such as HTML5, CSS3, JavaScript, and related frameworks.</li>\n<li>Proficient understanding of code versioning tools such as Git.</li>\n<li>Experience with relational databases (e.g., MySQL, PostgreSQL) and non-relational databases (e.g., MongoDB).</li>\n<li>Familiarity with continuous integration and deployment (CI/CD) pipelines.</li>\n<li>Strong problem-solving skills and ability to troubleshoot complex issues.</li>\n<li>Excellent communication and teamwork skills.</li>\n<li>Experience with cloud platforms (e.g., AWS, Azure) is a plus.</li>\n<li>Knowledge of RESTful APIs and web services.</li>\n<li>Understanding of Agile methodologies and experience working in Agile teams.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience with other PHP frameworks such as Symfony.</li>\n<li>Knowledge of JavaScript frameworks/libraries like Node.js, Vue.js, React, or Angular.</li>\n<li>Familiarity with containerization technologies such as Docker and Kubernetes.</li>\n<li>Experience with test-driven development (TDD) and behavior-driven development (BDD).</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates should submit their resume and a cover letter detailing their relevant experience and why they are a good fit for this role to Hr@commerce9.io</p>\n<p><strong>Equal Opportunity Employer:</strong></p>\n<p>Commerce9 is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@commerce9.io</p>",
        "tags": [
            "5-7 Years",
            "Laravel",
            "PHP",
            "Git"
        ],
        "summary": "Join our team as a Senior Laravel Developer, building scalable web applications. You will lead projects, mentor juniors, and ensure code quality."
    },
    {
        "job_title": "Product Manager - B2B",
        "company": "YOUGotaGift Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19523/482",
        "location": "Infopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Product Manager - B2B</h2>\n<p><strong>Position Overview:</strong>\nAs a B2B Product Manager, you will be responsible for driving the development and success of our products. You will play a crucial role in defining the product strategy, managing the product life cycle, and collaborating with cross-functional teams to deliver solutions that meet the needs of our B2B customers. This role requires a combination of strategic thinking, market analysis, and hands-on execution to ensure the success of our B2B product offerings.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>Product Strategy</strong>\n- Develop and refine the B2B product strategy in alignment with overall business goals.\n- Conduct market research to identify industry trends, customer needs, and competitive landscape.\n- Define the target market and customer segments for B2B products in the gift card industry.</p>\n<p><strong>Product Development</strong>\n- Collaborate with cross-functional teams, including engineering, design, and marketing, to bring new B2B products to market.\n- Prioritize features, functionalities and customization options for gift card offerings based on customer requirements and market demand.\n- Engage with customers, internal stakeholders, and the tech team to document specific requirements.\n- Create a Product Requirements Document (PRD) outlining features, customization options, and compliance standards.\n- Implement features outlined in the PRD.\n- Work closely with development teams to ensure timely and successful product releases.</p>\n<p><strong>Product Lifecycle Management</strong>\n- Conceptualization : Define the vision and purpose of the gift card product.\n- Own the entire product lifecycle, from concept to end-of-life, ensuring the product meets market needs and achieves business objectives.\n- Monitor key performance indicators (KPIs) and gather customer feedback to iterate on product improvements.\n- Evaluate the product's maturity and market saturation</p>\n<p><strong>Customer &amp; Cross-Functional Collaboration:</strong>\n- Build and maintain strong relationships with key B2B customers, understanding their needs and incorporating feedback into product development.\n- Demonstrate a commitment to continuous improvement based on customer collaboration.\n- Work closely with sales, marketing, customer support, and other departments to ensure a cohesive and effective product strategy.\n- Communicate product updates and changes internally and externally.</p>\n<p><strong>Must Have:</strong>\n- Bachelor's degree in business, marketing, engineering, or related field; MBA is a plus.\n- Proven 3-5 years of experience as a Product Manager in a technology company, preferably on Gift Card/ Payments domain.\n- Strong understanding of B2B markets, customer needs, and industry trends.\n- Ability to prioritize and manage multiple projects simultaneously.\n- Experience with agile development methodologies is a plus.\n- Excellent documentation skills and expertise in writing PRDs. Knowledge of JIRA and Confluence.\n- Attentive and considerate team player.\n- Effective communication and collaboration skills.</p>\n<p><strong>Nice to have:</strong>\n- Experience working with digital gift card platforms or fintech solutions.\n- Knowledge of emerging trends in digital payments and loyalty programs.\n- Familiarity with data analytics and customer insights tools.\n- Understanding of RESTful APIs, JSON, and web service technologies.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at techcareers@yougotagift.com</p>",
        "tags": [
            "3-5 Years",
            "B2B Markets",
            "Product Development",
            "JIRA"
        ],
        "summary": "We are seeking a B2B Product Manager to define product strategy and manage the product lifecycle. The ideal candidate will collaborate with cross-functional teams to deliver B2B solutions."
    },
    {
        "job_title": "Creative Head",
        "company": "Dynamed Healthcare Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/19514/132",
        "location": "Infopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Creative Head</h2>\n<p><strong>Job Overview:</strong>\nWe are looking for a visionary Creative Head to lead our creative initiatives and drive brand engagement through innovative, strategic, and impactful storytelling. This role requires a blend of creativity, leadership, and a strong understanding of how to communicate meaningful messages to diverse audiences across various platforms.</p>\n<p><strong>Key Responsibilities:</strong>\n- Develop and lead creative strategies that align with the company’s brand and marketing goals.\n- Drive brand development initiatives across print, digital, video, and social media platforms.\n- Conceptualize and oversee the execution of multichannel campaigns that enhance visibility and engagement.\n- Lead a team of designers, writers, video producers, and other creative professionals.\n- Collaborate closely with marketing, digital, and business teams to deliver consistent and effective messaging.\n- Translate complex information into simple, clear, and emotionally compelling visual and written communication.\n- Monitor industry trends and leverage data-driven insights to continuously improve creative performance.\n- Ensure all content aligns with brand guidelines and maintains high standards of quality and compliance.</p>\n<p><strong>Required Skills:</strong>\n- <strong>Strong Creative Vision</strong> – Ability to conceptualize innovative ideas and deliver strategic brand narratives.\n- <strong>Strategic Thinking</strong> – Experience in aligning creative output with business and communication objectives.\n- <strong>Brand Development Expertise</strong> – Skilled in building, maintaining, and evolving brand identities.\n- <strong>Multichannel Campaign Execution</strong> – Proficient in planning and managing campaigns across digital, print, and video.\n- <strong>Leadership &amp; Team Management</strong> – Proven ability to lead and mentor creative teams in a fast-paced environment.\n- <strong>Strong Communication Skills</strong> – Capable of crafting messaging that resonates with diverse stakeholders.\n- <strong>Storytelling &amp; Content Creation</strong> – Adept at creating emotionally engaging content for awareness and engagement.\n- <strong>Design &amp; Visual Aesthetics</strong> – High proficiency in design tools (Adobe Creative Suite, Figma, etc.).\n- <strong>Collaboration with Cross-Functional Teams</strong> – Able to work seamlessly with internal stakeholders to execute ideas.\n- <strong>Data-Driven Creativity</strong> – Uses performance metrics and user insights to guide and optimize creative output.\n- <strong>Project &amp; Time Management</strong> – Excellent organizational skills and the ability to manage multiple projects simultaneously.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at anoop.rajan@dynamedhealth.com</p>",
        "tags": [
            "5+ Years",
            "Brand Development",
            "Adobe Creative Suite",
            "Team Management"
        ],
        "summary": "We seek a Creative Head to lead creative strategies and brand engagement. The role involves leading creative teams and ensuring consistent, effective messaging across platforms."
    },
    {
        "job_title": "Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21633",
        "location": "Technopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Customer Success Executive - Walk-In</h2>\n<p><strong>Way.Com India Pvt Ltd, Thiruvananthapuram</strong></p>\n<p><strong>Walk-In Date:</strong> July 14, 2025\n<strong>Time:</strong> 10:00 AM - 12:00 PM</p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<h3>Role Overview:</h3>\n<p>As a Customer Support Executive, you’ll be responsible for providing high-quality service to our customers, answering their questions, solving problems, and assisting with any inquiries they may have. You’ll be the first point of contact and play a key role in delivering an outstanding customer experience.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Responding to customer inquiries via phone, email, chat, or social media.</li>\n<li>Troubleshooting customer issues and providing solutions in a timely manner.</li>\n<li>Managing customer requests, including product inquiries, order status, and returns.</li>\n<li>Recording and updating customer information and feedback in our CRM system.</li>\n<li>Escalating complex issues to the appropriate team or department.</li>\n<li>Assisting with tracking customer satisfaction metrics and identifying areas of improvement.</li>\n<li>Ensuring all customer interactions are handled professionally and with care.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proven experience in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment</li>\n</ul>\n<h3>Walk-In Venue:</h3>\n<p><strong>Location:</strong> Trivandrum\n<strong>Experience:</strong> 0 - 2 years</p>\n<p>At Way.com, we are passionate about delivering the best customer service. We're looking for dynamic Customer Support Executives to join our team. You’ll be the face of our company, assisting customers with their inquiries, guiding them through product offerings, and providing exceptional support to ensure a seamless experience.</p>\n<h3>Walk-In Entry Pass</h3>\n<p>Candidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<h3>Mobile App</h3>\n<p>Click here to download the Mobile App for Android\nClick here to download the Mobile App for iOS</p>\n<p><strong>Website URL:</strong> vms.technopark.org\nClick here for the User Manual</p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "0-2 Years",
            "Customer Service",
            "Communication Skills",
            "Problem-solving"
        ],
        "summary": "Way.com is hiring a Customer Support Executive to provide excellent service, solve problems, and ensure customer satisfaction. This role requires strong communication and problem-solving skills."
    },
    {
        "job_title": "Accounts Payable (AP) Associate",
        "company": "Xpetize Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21632",
        "location": "Technopark",
        "closing_date": "08 Aug 2025",
        "job_description": "<h2>Accounts Payable (AP) Associate</h2>\n<p><strong>Xpetize Technology Solutions (P) Ltd</strong>\nA-10, TBIC, 4th Floor, Nila, Technopark, Kerala, Trivandrum, 695581\n<a href=\"http://www.xpetize.com\">http://www.xpetize.com</a></p>\n<p><strong>Closing Date:</strong> 08, Aug 2025\n<strong>Job Published:</strong> 08, July 2025\n<strong>Contact Email:</strong> careers@xpetize.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>1–2 years of experience in Accounts Payable and expense processing.</li>\n<li>Familiarity with Workday Financials (AP module) is highly preferred.</li>\n<li>Working knowledge of Concur or other expense management platforms.</li>\n<li>Strong understanding of invoice coding, cost centers, and routing logic.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li>1 to 3 years of experience</li>\n<li>Notice Period – Immediate to 15 days</li>\n<li>Work Location: Trivandrum - Technopark (Work From Office)</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Accounts Payable",
            "Workday Financials",
            "Concur"
        ],
        "summary": "Seeking an Accounts Payable Associate with 1-3 years of experience. Familiarity with Workday Financials and Concur is highly valued for this Trivandrum-based role."
    },
    {
        "job_title": "Social Media Marketing Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21631",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Social Media Marketing Manager</h2>\n<p><strong>Way.Com India Pvt Ltd</strong> is seeking an experienced and passionate Social Media Marketing Manager to lead and execute Way.com’s social media strategy. This role involves overseeing all social media initiatives, building brand awareness, growing a loyal community, and driving user engagement across various platforms. The Social Media Marketing Manager will work closely with the content, design, and digital marketing teams to ensure cohesive brand messaging and maximize the effectiveness of Way.com’s social media presence.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Strategy Development: Create and implement a comprehensive social media strategy that aligns with Way.com’s business goals and brand voice.</li>\n<li>Content Creation &amp; Curation: Drive content development for social media, ensuring it is engaging, on-brand, and optimized for each platform (Facebook, Instagram, X, LinkedIn, TikTok, etc.).</li>\n<li>Community Engagement: Foster positive relationships with our online community, engaging with followers, responding to inquiries, and managing online conversations.</li>\n<li>Brand Building: Increase brand awareness, engagement, and advocacy through social media channels.</li>\n<li>Analytics &amp; Reporting: Monitor and analyze social media metrics and performance to refine strategies and report on KPIs.</li>\n<li>Collaborations &amp; Partnerships: Identify and develop strategic partnerships with influencers, brands, and other third-party collaborators to enhance our social media reach and engagement.</li>\n<li>Trend Spotting: Stay ahead of social media trends, emerging platforms, and new technologies to maintain a competitive edge in the industry.</li>\n<li>Cross-functional Collaboration: Work with the content, design, product, and customer service teams to ensure seamless integration of social media efforts with broader marketing and business initiatives.</li>\n<li>Budget Management: Manage the marketing budget, ensuring that resources are allocated efficiently to meet goals.</li>\n<li>Crisis Management: Address any potential issues, negative feedback, or crises on social media in a timely and professional manner.</li>\n</ul>\n<p><strong>Qualifications/Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, or a related field (Master’s preferred).</li>\n<li>9+ years of experience in social media marketing, with a proven track record in leading social media campaigns and building brands.</li>\n<li>Strong understanding of social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.) and how to leverage them for business growth.</li>\n<li>Expertise in social media management tools (Hootsuite, Sprout Social, Buffer etc.) and analytics platforms (Google Analytics, Socialbakers, etc.).</li>\n<li>Excellent communication and leadership skills, with the ability to motivate and inspire a team.</li>\n<li>Strong creative and strategic thinking skills.</li>\n<li>In-depth knowledge of social media advertising and paid campaign strategies.</li>\n<li>Ability to work under pressure, manage multiple projects, and meet deadlines.</li>\n<li>A passion for staying on top of digital trends, social media innovations, and new technologies.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p><strong>Closing Date:</strong> 10, July 2025</p>",
        "tags": [
            "9+ Years",
            "Social Media Marketing",
            "Social Media Platforms",
            "Analytics Platforms"
        ],
        "summary": "We need a Social Media Marketing Manager to drive social media strategy, build brand awareness, and grow user engagement. The candidate should leverage social media and analytics tools."
    },
    {
        "job_title": "Support Executive",
        "company": "Advitech Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21630",
        "location": "Technopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>Support Executive</h2>\n<p>Advitech Technologies (P) Ltd is seeking a Support Executive to be the first point of contact for our users. You will help them resolve issues, answer queries, and optimize their experience with our platform and training customers. This role involves working closely with our Customer Success, Product, and Development teams to provide timely and accurate support. You will also be responsible for making sales demos if required. You should be willing to work on different time schedules based on the geographical locations of the customers.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Respond to customer inquiries via chat, email, and phone in a timely and professional manner.</li>\n<li>Troubleshoot technical issues and guide users through solutions.</li>\n<li>Monitor system performance and report any widespread issues to the technical team.</li>\n<li>Document user feedback and recurring issues to help improve our product.</li>\n<li>Maintain detailed records of customer interactions and support tickets.</li>\n<li>Contribute to knowledge base articles and FAQs.</li>\n<li>Assist in onboarding and training new users as needed.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>1-2 years of experience in a support or customer service role, preferably with a SaaS or tech company.</li>\n<li>Strong verbal and written communication skills in English.</li>\n<li>Freshers will also be considered based on their communication and training skills.</li>\n<li>Familiarity with MS office tools.</li>\n<li>Patience, empathy, and a passion for helping users succeed.</li>\n<li>Ability to multitask, prioritize, and manage time effectively.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Advitech Technologies (P) Ltd\nL 12(B), -1, Thejaswini, 695581\n<a href=\"https://advitech.in\">https://advitech.in</a>\nContact Email: info@advitech.in</p>\n<p><strong>Important Dates:</strong></p>\n<p>Closing Date: 20, July 2025\nJob Published: 08, July 2025</p>",
        "tags": [
            "1-2 Years",
            "Customer Support",
            "Troubleshooting",
            "Communication Skills"
        ],
        "summary": "Join Advitech as a Support Executive, providing crucial support to users, troubleshooting issues, and optimizing their platform experience. You will collaborate with various teams to ensure timely and accurate assistance."
    },
    {
        "job_title": "Business Analyst",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21629",
        "location": "Technopark",
        "closing_date": "22 Aug 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p>ECS Fin is seeking a Business Analyst to join our team. ECS Fin is an engineering enterprise specializing in process optimization. Our software solutions, including an enterprise messaging management system, a SWIFT certified transaction processing system, a post trade processing application, and a treasury management system, are used by Financial Institutions and Corporates worldwide.</p>\n<p><strong>Location:</strong> Trivandrum</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Writing BRDs and FSDs</li>\n<li>Solving complex functional issues</li>\n<li>Facilitating User training and Support UAT</li>\n<li>Strong Stakeholder Management</li>\n<li>Excellent communication skills</li>\n<li>Delivering projects and products using the appropriate agile project management methodology, learning &amp; iterating frequently</li>\n<li>Working with the Project Manager to define project expectations and translate these into user stories</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>1-3 years of experience</li>\n<li>Knowledge of Banking Domain is a plus</li>\n<li>Experience in International/Domestic Payments will be an added advantage</li>\n<li>Highly passionate about the profession and willingness to travel</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@ecsfin.com</p>\n<p>ECS BUSINESS SOLUTIONS (P) Ltd\nModule No. 422, 423 and 424, Nila Building. 4th Floor, Phase 1 Campus, Technopark., 695581\nhttps://www.ecsfin.com</p>",
        "tags": [
            "1-3 Years",
            "BRDs",
            "FSDs",
            "Agile"
        ],
        "summary": "ECS Fin is hiring a Business Analyst to work in Trivandrum. The role involves creating BRDs/FSDs, solving functional issues, and using agile methodologies to deliver projects."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21628",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p><strong>Way.Com India Pvt Ltd is seeking a results-driven Business Development Manager to join our energetic sales team.</strong></p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Role Overview:</strong></p>\n<p>If you thrive in fast-paced settings, excel at building strong relationships, and are driven by revenue growth through strategic multi-channel outreach—calls, emails, and digital engagement—this role is the perfect fit.</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Step into a world of innovation and endless potential.</li>\n<li>Be part of something meaningful – Join a dynamic, collaborative team that thrives on creativity and constantly challenges boundaries.</li>\n<li>Enjoy competitive rewards – Benefit from a comprehensive compensation and benefits package that values your contributions and achievements.</li>\n<li>Grow your career – We support your professional development with ongoing learning and growth opportunities.</li>\n<li>Make a real impact – Be a part of groundbreaking initiatives that influence the future of mobility and enhance daily life.</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<p>As a Business Development Manager, your responsibilities will include:</p>\n<ul>\n<li>Actively identifying and engaging potential clients through outbound calls, emails, and social platforms to qualify new business opportunities.</li>\n<li>Delivering compelling product presentations that clearly articulate the value and advantages of our solutions to prospective customers.</li>\n<li>Maintaining accurate and up-to-date customer data in the CRM system to ensure timely follow-ups and effective pipeline management.</li>\n<li>Consistently meeting or surpassing sales targets and performance benchmarks, directly contributing to the company’s growth.</li>\n<li>Fostering and maintaining strong relationships with existing clients to encourage repeat business and referrals.</li>\n<li>Creating comprehensive sales reports and forecasts for leadership to support strategic decisions and planning.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications</strong></p>\n<ul>\n<li>Proven experience in B2B sales, with a strong track record of achieving targets.</li>\n<li>5–8 years of sales experience; prior experience in the e-commerce sector is highly desirable.</li>\n<li>Exceptional written and verbal communication skills.</li>\n<li>Strong negotiation and relationship-building abilities.</li>\n<li>Self-motivated, goal-oriented, and capable of working independently with minimal supervision.</li>\n<li>Proficient in using CRM software (e.g., Zoho) and the Microsoft Office Suite.</li>\n<li>Resilient in the face of rejection, with the ability to maintain a positive attitude.</li>\n<li>A Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<p><strong>Location:</strong> Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>",
        "tags": [
            "5-8 Years",
            "B2B Sales",
            "CRM Software",
            "E-commerce"
        ],
        "summary": "Way.Com is looking for a Business Development Manager to drive revenue growth through strategic outreach and relationship building. The ideal candidate will have 5-8 years of B2B sales experience."
    },
    {
        "job_title": "Spanish Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21627",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Way.Com India Pvt Ltd</strong> is seeking a customer-focused and enthusiastic professional to join our team as a Spanish Customer Success Executive. In this role, you will be the primary point of contact for our Spanish-speaking customers, ensuring each interaction is handled with care, efficiency, and professionalism.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage both inbound and outbound calls, addressing customer inquiries, concerns, and complaints promptly and courteously.</li>\n<li>Provide compassionate and solution-focused support to guarantee a positive experience during every interaction.</li>\n<li>Recognize and prioritize complex issues, escalating them to the appropriate teams for swift and effective resolution.</li>\n<li>Accurately document all customer communications, keeping records current and comprehensive.</li>\n<li>Achieve or surpass monthly performance goals, including metrics related to customer satisfaction, first-call resolution, and overall productivity.</li>\n<li>Stay well-informed about company products and services to deliver precise and current information to customers.</li>\n<li>Work collaboratively with team members to build a positive, high-performing, and supportive work environment.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Fluent in both <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong <strong>interpersonal and communication skills</strong>, with a patient and empathetic approach.</li>\n<li>Ability to <strong>multitask</strong> and <strong>manage time efficiently</strong> in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p><strong>Address:</strong>\nWay Dot Com (P) Ltd\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583</p>",
        "tags": [
            "1+ Years",
            "Spanish Language",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "We are seeking a Spanish Customer Success Executive to support Spanish-speaking customers. The role involves managing communications, resolving issues, and ensuring customer satisfaction."
    },
    {
        "job_title": "Engineering Manager - Mobile",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21626",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Engineering Manager - Mobile</h2>\n<p>Way.com is seeking a highly motivated and experienced Engineering Manager to join our Mobile Engineering Team. In this role, you will play a key part in leading the development of innovative projects that power our automotive platform. This is a unique opportunity to work with cutting-edge technology and be part of a team that is shaping the future of mobility.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead a team of Android and iOS engineers in designing, building, shipping, and maintaining mobile app features focused on our automotive platform.</li>\n<li>Manage the development and successful delivery of complex, cross-functional projects in close collaboration with engineering teams and stakeholders across the USA and Canada.</li>\n<li>Contribute to project planning and scoping efforts while owning the execution and delivery of key engineering initiatives.</li>\n<li>Collaborate with teams across Product, Design, Science, Research, Data Science, Regulatory, and Marketing to align on objectives and deliverables.</li>\n<li>Mentor and coach team members, fostering their technical and professional development, and supporting their career growth.</li>\n<li>Provide technical leadership to the team. While you may not be writing code regularly, your deep technical expertise will guide architecture decisions and lead technical discussions.</li>\n<li>Make well-informed technical decisions, balancing trade-offs to ensure scalable and sustainable solutions.</li>\n<li>Champion engineering best practices, define performance metrics, and drive continuous process and operational improvements.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications &amp; Requirements:</strong></p>\n<ul>\n<li>A minimum of <strong>7+ years of experience</strong> in software engineering, including at least 2 years in a leadership or engineering management capacity</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or MCA</li>\n<li>Demonstrated experience in managing teams of <strong>Android and/or iOS engineers</strong></li>\n<li>Hands-on expertise in delivering <strong>consumer-facing mobile applications or the backend systems</strong> that support them</li>\n<li>Strong proficiency in <strong>Agile/Scrum development methodologies</strong>, with a solid understanding of iterative development and process optimization</li>\n<li>Exceptional communication, project management, and delegation skills, with a proven ability to deliver cross-functional projects from concept to launch</li>\n<li>Strong leadership and people management capabilities, with a focus on recognizing contributions, providing constructive feedback, and nurturing a culture of growth</li>\n<li>A collaborative, empathetic, and adaptable mindset, with openness to feedback and a commitment to continuous learning</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com</p>",
        "tags": [
            "7+ Years",
            "Android",
            "iOS",
            "Agile/Scrum"
        ],
        "summary": "We are looking for an Engineering Manager to lead our mobile engineering team. You will spearhead innovative projects, mentor engineers, and ensure top-quality software development."
    },
    {
        "job_title": "Linux DevOps Trainer - Contract",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21625",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Linux DevOps Trainer - Contract</h2>\n<p><strong>Engagement Type:</strong> Corporate Training Contract (B2B Partnership)</p>\n<p><strong>Client Team Size:</strong> 10 to 15 IT Engineers</p>\n<p><strong>Training Mode:</strong> Online (Live Instructor-Led Sessions)</p>\n<p><strong>Schedule:</strong> Monday to Friday, post 6:00 PM</p>\n<p><strong>Start Date:</strong> ASAP</p>\n<p><strong>End Date:</strong> As per agreed curriculum and learning objectives</p>\n<h3>Opportunity Overview</h3>\n<p>We are seeking an experienced Linux DevOps Trainer to conduct a hands-on, instructor-led training program tailored for a corporate team of 10–15 IT engineers. The training aims to build platform-agnostic DevOps capabilities through practical, real-world scenarios—fostering critical thinking, independent troubleshooting, and confidence in managing production environments.</p>\n<p>This role calls for a facilitator who can mentor engineers to operate effectively across systems, make decisions under pressure, and move beyond dependency on specific cloud platforms or rigid organizational silos.</p>\n<h3>Target Audience Profile</h3>\n<ul>\n<li><strong>Participants:</strong> Working IT professionals with 3 to 10+ years of experience</li>\n<li><strong>Backgrounds:</strong> Diverse technical expertise and domains</li>\n<li><strong>Learning Objectives:</strong> Strengthen skills in Linux, CI/CD, automation, monitoring, and DevOps best practices</li>\n<li><strong>Training Schedule:</strong> Weekday evenings post 6:00 PM (to accommodate work commitments)</li>\n<li><strong>Learning Environment:</strong> Lean, outcome-driven, and production-first</li>\n</ul>\n<h3>Core Curriculum Highlights</h3>\n<p><strong>Linux &amp; Scripting</strong></p>\n<ul>\n<li>Mastery of Linux command-line interface</li>\n<li>Understanding system architecture, permissions, and networking</li>\n<li>Shell scripting for automation</li>\n</ul>\n<p><strong>DevOps Foundations</strong></p>\n<ul>\n<li>Building and managing CI/CD pipelines using Jenkins, Git, and Maven</li>\n<li>Configuration management (preferably with Ansible)</li>\n<li>Web server setup and performance optimization (NGINX, Apache)</li>\n</ul>\n<p><strong>Monitoring &amp; Logging</strong></p>\n<ul>\n<li>Implementing and working with Prometheus, Grafana, and the ELK stack</li>\n<li>Designing workflows for incident detection and triage</li>\n</ul>\n<p><strong>Security &amp; Infrastructure</strong></p>\n<ul>\n<li>Fundamental system hardening techniques</li>\n<li>Adopting secure DevOps practices, independent of cloud vendors</li>\n</ul>\n<p><strong>Mindset &amp; Operational Readiness</strong></p>\n<ul>\n<li>Performing root cause analysis</li>\n<li>Effective prioritization under production pressures</li>\n<li>Cultivating self-reliant, production-focused problem-solving</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Preferred Technical Expertise</strong></p>\n<ul>\n<li>Proficient in Linux system administration, including RHEL, CentOS, and Ubuntu</li>\n<li>Hands-on experience with core DevOps tools such as Jenkins, Git, Docker, and Ansible</li>\n<li>Strong grasp of web infrastructure fundamentals, including NGINX, Apache, and content delivery networks (CDNs)</li>\n<li>Familiar with monitoring and logging tools like Prometheus, Grafana, and the ELK stack</li>\n<li>Exposure to automation scripting and security best practices</li>\n</ul>\n<p><strong>Trainer Profile Requirements</strong></p>\n<ul>\n<li>A minimum of 5 years of hands-on experience in Linux system administration and DevOps engineering</li>\n<li>Demonstrated success in delivering corporate training or mentoring technical teams</li>\n<li>Skilled at engaging professionals across various technical backgrounds and adapting training depth accordingly</li>\n<li>Excellent communication skills with the ability to explain concepts using real-world examples and practical troubleshooting scenarios</li>\n<li>Capable of fostering a production-first mindset and encouraging operational independence among participants</li>\n</ul>\n<h3>Desired Training Outcomes</h3>\n<ul>\n<li>Enable engineers to confidently diagnose, troubleshoot, and resolve issues independently, minimizing reliance on external teams</li>\n<li>Promote solution approaches that reduce dependency on cloud-native platforms</li>\n<li>Build a strong foundational understanding of DevOps principles that can be applied across any tech stack or vendor landscape</li>\n<li>Encourage a mindset shift from executing isolated tasks to taking ownership of complete systems and processes</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@way.com</p>",
        "tags": [
            "5+ Years",
            "Linux",
            "DevOps",
            "Jenkins"
        ],
        "summary": "We need a DevOps trainer to train 10-15 IT engineers. The trainer must have experience in Linux, DevOps, CI/CD, and automation."
    },
    {
        "job_title": "Technical lead - iOS",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21624",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>iOS Technical Lead</h2>\n<p><strong>About Us</strong></p>\n<p>We are a rapidly growing digital platform transforming the automotive services industry. Our comprehensive offerings include car washes, parking, EV charging, roadside assistance, and auto insurance—delivering a seamless and integrated experience across both web and mobile platforms. As we continue to expand, we’re seeking a skilled and passionate iOS Technical Lead to drive the next phase of innovation and growth within our iOS app ecosystem.</p>\n<p><strong>Role Overview</strong></p>\n<p>As the iOS Technical Lead, you will be instrumental in defining the architecture, design, and performance optimization of our iOS applications. This role blends strategic vision with hands-on development and involves close collaboration with cross-functional teams—including Product, Design, Backend, and QA—to build robust, scalable, and engaging mobile experiences. The ideal candidate will bring deep technical expertise, strong leadership skills, and a genuine passion for mentoring and team development.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Lead architectural planning, design, and development of iOS applications using Swift.</li>\n<li>Collaborate with Product and Design teams to translate business requirements into scalable and maintainable technical solutions.</li>\n<li>Ensure high performance, reliability, and responsiveness across a diverse range of iOS devices.</li>\n<li>Mentor and guide junior and mid-level iOS developers through code reviews, feedback, and skill-building.</li>\n<li>Maintain high standards of code quality, testing, and documentation throughout the development lifecycle.</li>\n<li>Work closely with backend and API teams to design and integrate scalable, efficient services.</li>\n<li>Drive ongoing improvements and innovation within the mobile technology stack.</li>\n<li>Take full ownership of features from ideation through development, release, and post-launch optimization.</li>\n<li>Stay up-to-date with the latest trends, best practices, and advancements in the iOS development ecosystem.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications</strong></p>\n<ul>\n<li>10+ years of experience in mobile application development, with a minimum of 6 years specializing in iOS development.</li>\n<li>Expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.</li>\n<li>Strong knowledge of RESTful APIs, JSON parsing, and third-party library integration.</li>\n<li>Experience in architecting complex mobile applications using modular design patterns (MVVM, MVI, MVP).</li>\n<li>Proficiency in CI/CD pipelines, automated testing, code reviews, and App Store deployment processes.</li>\n<li>Proven track record of leading teams and mentoring iOS developers.</li>\n<li>Familiarity with tools such as Firebase, Mixpanel, or similar analytics and crash reporting platforms.</li>\n<li>Understanding of web app ecosystems and cross-platform compatibility.</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Experience with Core Bluetooth, Core Location, or real-time services integration (e.g., EV or roadside assistance).</li>\n<li>Background in mobility, transportation, or automotive technology platforms.</li>\n<li>Familiarity with Kotlin Multiplatform or other cross-platform frameworks.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>careers@way.com</p>",
        "tags": [
            "10+ Years",
            "Swift",
            "RESTful APIs",
            "CI/CD"
        ],
        "summary": "We are seeking an iOS Technical Lead to drive innovation within our iOS app ecosystem. You will lead architecture, mentor developers, and ensure high-quality mobile experiences."
    },
    {
        "job_title": "Senior Android Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21623",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Senior Android Developer</h2>\n<p>Way.Com India Pvt Ltd is seeking a Senior Android Developer to design, build, and maintain robust Android applications. The ideal candidate will collaborate with cross-functional teams to define, design, and implement innovative features, ensuring applications perform efficiently and reliably.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, build, and maintain robust Android applications using <strong>Kotlin</strong> and <strong>Jetpack Compose</strong>.</li>\n<li>Work collaboratively with cross-functional teams to define, design, and implement innovative features.</li>\n<li>Ensure applications perform efficiently and reliably across a wide range of Android devices.</li>\n<li>Continuously improve application speed, scalability, and resource efficiency.</li>\n<li>Stay updated on the latest tools, trends, and best practices in Android development.</li>\n<li>Produce clean, well-structured, and testable code in line with Android development standards.</li>\n<li>Mentor junior developers and provide technical guidance to support team growth and collaboration.</li>\n<li>Efficiently troubleshoot, analyze, and resolve complex bugs and performance-related issues.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>A minimum of 5 years of hands-on experience in Android application development.</li>\n<li>Strong proficiency in <strong>Kotlin</strong>, with practical knowledge of <strong>Jetpack Compose</strong> for crafting modern user interfaces.</li>\n<li>In-depth understanding of Android architecture components such as <strong>ViewModel</strong>, <strong>LiveData</strong>, and <strong>Room</strong>.</li>\n<li>Proven ability to integrate and consume <strong>RESTful APIs</strong>, along with effective use of third-party libraries.</li>\n<li>Solid understanding of UI/UX best practices and Material Design principles, with the capability to build responsive and user-friendly interfaces.</li>\n<li>Proficient in development tools including <strong>Android Studio</strong>, <strong>Gradle</strong>, and other related environments.</li>\n<li>Experience with unit testing, including frameworks like <strong>JUnit</strong> and <strong>Mockito</strong>.</li>\n<li>Familiarity with <strong>CI/CD workflows</strong> and version control systems, particularly Git.</li>\n<li>Strong problem-solving skills and the ability to work both independently and within a collaborative team setting.</li>\n<li>Excellent communication skills, both written and verbal.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Practical experience with Kotlin Coroutines and Flows for handling asynchronous operations.</li>\n<li>Knowledge of Jetpack libraries such as Navigation, Paging, and WorkManager.</li>\n<li>Experience working with <strong>Firebase</strong> or other cloud-based backend platforms.</li>\n<li>Exposure to <strong>Kotlin Multiplatform Mobile (KMM)</strong> or experience developing cross-platform applications.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>",
        "tags": [
            "5+ Years",
            "Kotlin",
            "Jetpack Compose",
            "Android Development"
        ],
        "summary": "Seeking a Senior Android Developer to design and maintain Android applications using Kotlin and Jetpack Compose. Requires 5+ years of Android development experience."
    },
    {
        "job_title": "Junior QA Automation Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21622",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Junior QA Automation Engineer</h2>\n<p>Way.Com India Pvt Ltd is seeking a proactive and detail-focused Junior QA Automation Engineer with a strong background in Java and practical experience in test automation.</p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Interpret complex business requirements and transform them into effective, well-structured test strategies and cases.</li>\n<li>Collaborate closely with cross-functional teams.</li>\n<li>Handle tasks with initiative and a strong sense of ownership.</li>\n</ul>\n<p><strong>Key Requirements:</strong></p>\n<ul>\n<li>Proven ability to understand and analyze business requirements and translate them into structured test strategies and test cases.</li>\n<li>At least 2 years of hands-on experience in test automation using Java.</li>\n<li>Strong grasp of Core Java principles and practical application.</li>\n<li>Proficiency in using Selenium WebDriver for UI automation testing.</li>\n<li>Practical experience in API testing with Rest Assured.</li>\n<li>Excellent verbal and written communication skills to support effective collaboration with cross-functional teams.</li>\n<li>Demonstrated initiative and a strong sense of ownership in handling tasks.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li>2–3 years in QA and Test automation.</li>\n<li>Good hands-on experience in Core Java concepts.</li>\n<li>Experience with Selenium WebDriver.</li>\n<li>Exceptional problem-solving and analytical skills, with keen attention to detail.</li>\n</ul>\n<p><strong>Location:</strong></p>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>",
        "tags": [
            "2+ Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Way.Com is hiring a Junior QA Automation Engineer with Java and Selenium skills. The role involves test automation and collaboration within cross-functional teams."
    },
    {
        "job_title": "Senior IOS Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21621",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Senior iOS Developer</h2>\n<p>Way.Com India Pvt Ltd is seeking a Senior iOS Developer to design, build, and maintain high-performing iOS applications. The ideal candidate will possess a strong understanding of iOS development principles and a passion for creating exceptional user experiences.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, build, and maintain high-performing iOS applications using <strong>Swift</strong>, <strong>Objective-C</strong>, and <strong>SwiftUI</strong>.</li>\n<li>Develop scalable and maintainable architectures utilizing <strong>MVVM</strong> and <strong>MVC</strong> design patterns.</li>\n<li>Apply <strong>SOLID</strong> principles to promote clean, sustainable development and architectural integrity.</li>\n<li>Enhance app performance through effective memory management and advanced multithreading techniques.</li>\n<li>Build responsive, adaptive UIs using <strong>Auto Layout</strong> to ensure consistent user experiences across all iOS devices.</li>\n<li>Integrate and manage push notification systems to provide timely and personalized user alerts.</li>\n<li>Implement deep linking mechanisms to enable seamless navigation between app content and external sources.</li>\n<li>Conduct comprehensive code reviews, maintain high coding standards, and mentor junior team members to support skill development.</li>\n<li>Write and maintain reliable unit tests to safeguard app functionality and ensure ongoing stability.</li>\n<li>Utilize <strong>Apple Maps</strong> and <strong>Core Location</strong> frameworks to develop intuitive, location-based features.</li>\n<li>Integrate <strong>Firebase</strong> for real-time synchronization, crash reporting, and analytics tracking.</li>\n<li>Guarantee compliance with App Store policies and manage the end-to-end submission, review, and release process.</li>\n<li>Work closely with product managers, designers, and backend developers to deliver feature-rich, high-quality iOS applications.</li>\n<li>Maintain an efficient development workflow through version control tools like <strong>Git</strong>.</li>\n</ul>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li>Minimum of <strong>5 years of hands-on experience</strong> in <strong>iOS application development</strong>.</li>\n<li>Strong proficiency in <strong>Swift</strong> and <strong>Objective-C</strong>, with the ability to write clean, efficient, and maintainable code.</li>\n<li>In-depth understanding and practical experience with architectural patterns such as <strong>MVVM</strong> and <strong>MVC</strong>.</li>\n<li>Proven ability to apply <strong>SOLID principles</strong> to build scalable, modular, and testable codebases.</li>\n<li>Strong knowledge of memory management and multithreading for optimal application performance.</li>\n<li>Extensive experience in building user interfaces using <strong>SwiftUI</strong>, <strong>Auto Layout</strong>, and creating responsive, adaptive UIs.</li>\n<li>Proficient in implementing <strong>Push Notification frameworks</strong> and enabling deep linking to enhance user engagement and navigation.</li>\n<li>Hands-on experience with version control systems, particularly <strong>Git</strong>, for collaborative development and release workflows.</li>\n<li>Demonstrated ability to conduct thorough code reviews to ensure adherence to coding standards and best practices.</li>\n<li>Skilled in writing and maintaining unit tests to support application stability, performance, and reliability.</li>\n<li>Practical experience with <strong>Apple Maps</strong>, <strong>Core Location</strong>, and building location-based services.</li>\n<li>Familiarity with <strong>Firebase</strong>, including integration of analytics, crash reporting, and real-time data features.</li>\n<li>Solid understanding of <strong>App Store guidelines</strong> and experience managing the app submission and review process.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with <strong>Continuous Integration/Continuous Deployment (CI/CD)</strong> pipelines and tools.</li>\n<li>Working knowledge of <strong>Agile development methodologies</strong> and collaborative team practices.</li>\n<li>Strong analytical and problem-solving skills, with the ability to work independently and within a team.</li>\n<li>Experience in performance tuning and optimization of iOS applications for improved efficiency and user experience.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p><strong>Closing Date:</strong> 10, July 2025</p>",
        "tags": [
            "5+ Years",
            "Swift",
            "Objective-C",
            "Firebase"
        ],
        "summary": "Seeking a Senior iOS Developer to design and maintain high-performing iOS applications. Must have strong skills in Swift, Objective-C, and Firebase."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21620",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>\n<p><strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a></p>\n<p><strong>Closing Date:</strong> July 10, 2025</p>\n<p><strong>Job Published:</strong> July 08, 2025</p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain robust, scalable Java applications utilizing the <strong>Spring Boot</strong> framework.</li>\n<li>Collaborate with <strong>Product Owners</strong>, <strong>Solution Architects</strong>, and cross-functional teams to translate business needs into effective technical solutions.</li>\n<li>Build and integrate <strong>RESTful APIs</strong> to ensure seamless system communication and enhance application capabilities.</li>\n<li>Continuously refactor and optimize existing codebases to improve <strong>performance</strong>, <strong>scalability</strong>, and <strong>maintainability</strong>.</li>\n<li>Conduct detailed <strong>code reviews</strong>, uphold best coding practices, and mentor junior developers to support overall team growth.</li>\n<li>Stay updated with the latest tools, technologies, and best practices within the <strong>Java ecosystem</strong> to boost development efficiency.</li>\n<li>Proactively <strong>troubleshoot</strong>, identify, and resolve complex software bugs and performance issues to ensure a smooth user experience.</li>\n<li>Follow established <strong>development methodologies</strong>, coding standards, and organizational guidelines to deliver high-quality, reliable software solutions.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent professional experience).</li>\n<li>Minimum of <strong>5+ years</strong> of professional experience in <strong>Java development</strong>, with strong hands-on expertise in <strong>Spring Boot</strong> and <strong>MySQL</strong>.</li>\n<li>In-depth understanding of <strong>Java SE</strong> and <strong>Java EE</strong> concepts, including multithreading, design patterns, and JVM internals.</li>\n<li>Proven experience in <strong>RESTful API</strong> design, development, and integration.</li>\n<li>Proficient in working with <strong>MySQL</strong> or other relational databases, with the ability to write and optimize complex SQL queries.</li>\n<li>Hands-on experience with <strong>version control systems</strong>, particularly <strong>Git</strong>.</li>\n<li>Familiarity with <strong>Agile methodologies</strong> (e.g., Scrum, Kanban) and experience working in Agile development environments.</li>\n<li>Strong problem-solving, debugging, and analytical skills, capable of addressing complex technical challenges.</li>\n<li>Excellent written and verbal communication skills with the ability to thrive in a <strong>collaborative, team-oriented environment</strong>.</li>\n<li>Demonstrated ability to mentor junior developers and contribute technical leadership to development teams.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience working with <strong>microservices architecture</strong> and <strong>Docker</strong> containerization.</li>\n<li>Working knowledge of <strong>cloud platforms</strong>, such as <strong>AWS</strong> or <strong>Microsoft Azure</strong>.</li>\n<li>Familiarity with <strong>CI/CD pipelines</strong> and automation tools (e.g., Jenkins, GitLab CI).</li>\n<li>Experience with <strong>unit testing frameworks</strong>, such as <strong>JUnit</strong> or <strong>TestNG</strong>.</li>\n<li>Proven track record of building <strong>scalable, high-performance applications</strong> in production-grade environments.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Seeking a Senior Java Developer to design and maintain Java applications using Spring Boot and MySQL. This role involves API integration, code optimization, and mentoring junior developers."
    },
    {
        "job_title": ".NET Developer",
        "company": "Ibil Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21619",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>.NET Developer</h2>\n<p><strong>IBIL Solutions (P) Ltd</strong>\n1A First Floor, Carnival Building,\nPhase 1, Technopark, 695581\n<a href=\"https://www.ibilglobal.com\">https://www.ibilglobal.com</a></p>\n<p><strong>Contact Email:</strong> akash.deepu@ibilglobal.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are looking for a proactive and technically strong .NET Developer with at least 5 years of experience in building and maintaining robust applications using C# and .NET technologies. The ideal candidate should be well-versed in ASP.NET, Web API, and SQL Server, along with solid hands-on experience in Azure cloud services such as Azure Functions, Service Bus, Web Apps, and Cosmos DB.</p>\n<p>The role also involves working with Elasticsearch for data indexing and search capabilities, implementing unit testing using frameworks like NUnit/XUnit, and contributing actively in an Agile/Scrum environment.</p>\n<p><strong>Location:</strong> Trivandrum</p>\n<p><strong>Experience:</strong> 5+ Years</p>\n<p><strong>Closing Date:</strong> 31, July 2025</p>\n<p><strong>Job Published:</strong> 08, July 2025</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong proficiency in .NET and C# development</li>\n<li>Experience with ASP.NET and RESTful Web APIs</li>\n<li>Proficient in Microsoft Azure:</li>\n<li>Azure Functions</li>\n<li>Azure Service Bus</li>\n<li>Azure Web Apps</li>\n<li>Azure DevOps (for CI/CD)</li>\n<li>Cosmos DB</li>\n<li>Solid knowledge of MS SQL Server – schema design, complex queries, and performance tuning</li>\n<li>Experience integrating and working with Elasticsearch</li>\n<li>Hands-on with unit testing frameworks: NUnit / XUnit</li>\n<li>Familiarity with Agile/Scrum methodologies</li>\n</ul>",
        "tags": [
            "5+ Years",
            ".NET",
            "Azure",
            "C#"
        ],
        "summary": "IBIL Solutions is seeking a .NET Developer to build robust applications using .NET technologies. Proficiency in C#, ASP.NET, Web API, SQL Server, and Azure cloud services is required."
    },
    {
        "job_title": "Business Development Executive – ITES Sector",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21618",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Business Development Executive – ITES Sector</h2>\n<p><strong>PIT Solutions (P) Ltd</strong>\nModule No. 209-N, 9th Floor, Yamuna, SEZ IT Building,\nTechnopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<a href=\"http://www.pitsolutions.com\">http://www.pitsolutions.com</a></p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 08, July 2025\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<p><strong>Brief Description:</strong>\nExperience 5+ Years</p>\n<p><strong>Key Responsibilities:</strong>\n- Identify and pursue new business opportunities in target markets aligned with ITES offerings.\n- Build and maintain strong client relationships with key decision-makers and stakeholders.\n- Understand client needs and propose tailored IT-enabled solutions.\n- Develop and implement sales strategies to meet revenue and growth objectives.\n- Collaborate with internal teams (sales, marketing, product) for seamless execution.\n- Negotiate and close deals, ensuring favorable terms.\n- Monitor performance, track KPIs, and report on business development efforts.</p>\n<p><strong>Preferred Skills:</strong>\n- Candidate should have completed MBA in Marketing\n- Strong ability to drive sales and negotiate effectively across global markets.\n- Excellent communication and interpersonal skills.\n- Strategic thinker with strong problem-solving abilities.\n- Solid understanding of the ITES industry and market trends.\n- Proficient in CRM tools and data-driven decision-making.</p>",
        "tags": [
            "5+ Years",
            "ITES",
            "Sales",
            "CRM"
        ],
        "summary": "Seeking a Business Development Executive to drive growth within the ITES sector. The role involves identifying opportunities, building relationships, and implementing sales strategies."
    },
    {
        "job_title": "Graphic Designer",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/21617",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Graphic Designer</h2>\n<p>Klystron Technologies is seeking a creative and motivated Graphic Designer to join our team. This is an exciting opportunity for someone who is passionate about design and wants to gain hands-on experience in a real-world environment. You will work closely with our marketing and creative teams to produce engaging visual content for digital and print platforms.</p>\n<p><strong>Office Location:</strong> Office Nbr:2210, Yamuna Building, Technopark Phase-III, 695583</p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 08, July 2025</p>\n<p><strong>Contact Email:</strong> jobs.in@Klystronglobal.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Assist in designing graphics for social media, websites, email campaigns, and advertisements</li>\n<li>Support the creation of brochures, posters, presentations, and other marketing materials</li>\n<li>Contribute to brainstorming sessions and creative concepts</li>\n<li>Edit images and improve visual consistency across platforms</li>\n<li>Follow brand guidelines and design best practices</li>\n<li>Work on multiple projects simultaneously and meet deadlines</li>\n<li>Receive feedback and make necessary revisions</li>\n<li>Understanding of UI/UX design principles</li>\n</ul>\n<p><strong>Requirements/Preferred Skills:</strong></p>\n<ul>\n<li>Adobe Creative Suite (Photoshop, Illustrator, InDesign) and similar design tools</li>\n<li>A strong eye for aesthetics and detail</li>\n<li>Familiarity with current design trends and social media formats</li>\n<li>Excellent communication and teamwork skills</li>\n<li>A portfolio (even academic/personal work) showcasing design abilities</li>\n<li>Bachelor’s degree or currently pursuing a degree in Graphic Design, Fine Arts, or related field</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul>\n<li>Basic knowledge of video editing (e.g., Capcut, Adobe Premiere Pro, After Effects)</li>\n<li>Understanding of UI/UX design principles</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Adobe Creative Suite",
            "UI/UX Design",
            "Social Media"
        ],
        "summary": "Klystron Technologies is looking for a Graphic Designer to produce engaging content for digital and print. A strong portfolio and Adobe Creative Suite skills are needed."
    },
    {
        "job_title": "AI/ML Research Engineer (Job Code AIMLRE/52025/23)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/21616",
        "location": "Technopark",
        "closing_date": "22 Jul 2025",
        "job_description": "<h2>AI/ML Research Engineer</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking qualified Indian Citizens for the position of AI/ML Research Engineer on a contract basis for the Centre for Digital Transformation &amp; Innovation (CDTI). The application form is available at <a href=\"https://www.duk.ac.in/careers\">https://www.duk.ac.in/careers</a>.</p>\n<p><strong>Contact Email:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 22, July 2025</p>\n<p><strong>Job Published:</strong> 07, July 2025</p>\n<p><strong>Location:</strong>\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala , 695317\n<a href=\"https://duk.ac.in\">https://duk.ac.in</a></p>\n<p><strong>Job Code:</strong> AIMLRE/52025/23</p>\n<h3>Essential Qualifications:</h3>\n<ul>\n<li>M.Tech/MCA/MSc in Computer Science/Data Science/Statistics or equivalent degree from a recognized University/ Educational Institution with first-class.</li>\n</ul>\n<h3>Essential Experience:</h3>\n<ul>\n<li>Minimum 3 years of proven experience in AI/ML Modelling, eGovernance Projects, Data Science and Analytics in the industry/Govt/PSU.</li>\n</ul>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Collaborate with cross-functional teams to explore and develop AI opportunities.</li>\n<li>Create, test, and deploy cutting-edge AI/ML models for a variety of applications.</li>\n<li>Handling Python Libraries</li>\n<li>Conduct research to keep current on AI and machine learning breakthroughs.</li>\n<li>Optimize and fine-tune models for performance, scalability, and dependability.</li>\n<li>Document and communicate AI solutions to both technical and non-technical stakeholders.</li>\n</ul>\n<h3>Preferred Skills/Desirable Technical Skills:</h3>\n<ul>\n<li>Proficiency in Python libraries such as TensorFlow, PyTorch, scikit-learn, etc.</li>\n<li>Proficiency in statistical sampling methods, index numbers, and other statistical techniques for real-world applications.</li>\n<li>Experience in deploying AI/ML models using Flask or similar frameworks.</li>\n<li>Familiarity with SQL and vector databases for AI applications.</li>\n<li>Expertise in data preprocessing, analytics, and visualization tools like Tableau and Power BI.</li>\n<li>Knowledge of generative AI techniques and their practical applications.</li>\n<li>Optimization and fine-tuning of machine learning models for performance and scalability.</li>\n<li>Experience in documentation and communicating AI solutions to diverse audiences.</li>\n<li>Research experience to stay updated on the latest advancements in AI/ML.</li>\n<li>Knowledge of API integration for real-world AI/ML applications.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "AI/ML Modeling",
            "Python",
            "Data Science"
        ],
        "summary": "Seeking an AI/ML Research Engineer to develop and deploy AI models. Requires 3+ years of experience and proficiency in Python and data science."
    },
    {
        "job_title": "Research Engineer (App Dev) (Job Code READ/52025/23)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/21615",
        "location": "Technopark",
        "closing_date": "22 Jul 2025",
        "job_description": "<h2>Research Engineer (App Dev)</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> invites applications from qualified Indian Citizens for the post of Research Engineer (App Dev) on a contract basis for the Centre for Digital Transformation &amp; Innovation (CDTI).</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 22, July 2025</p>\n<p><strong>Job Code:</strong> READ/52025/23</p>\n<p><strong>Application Link:</strong> https://www.duk.ac.in/careers</p>\n<h3>Essential Qualifications:</h3>\n<ul>\n<li>M.Tech/MCA/MSc. Computer Science/Computational Science/Information Technology or equivalent degree from a recognized University/Educational Institution with first-class.</li>\n</ul>\n<h3>Essential Experience:</h3>\n<ul>\n<li>Minimum 3 years of Research and development experience in the IT industry/Govt/PSU.</li>\n</ul>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Design and develop standalone applications for various projects taken up by the Centre.</li>\n<li>Designing, testing, and implementing software components with the use of the PHP programming language job.</li>\n<li>Develop testing processes and execute them efficiently to improve the product.</li>\n</ul>\n<h3>Desirable Technical Skills:</h3>\n<ul>\n<li>PHP web frameworks such as Laravel / CodeIgniter, etc.</li>\n<li>Code versioning tools like CVS, SVN, Git, etc.</li>\n<li>Familiarity with SQL/NoSQL databases.</li>\n<li>Proficient in HTML, CSS, and JavaScript Scaling and tuning.</li>\n<li>Database applications, modeling, performance optimization, etc.</li>\n<li>Content Management Systems such as WordPress, Drupal, Joomla, etc.</li>\n<li>Knowledge in Graphic design software Scaling and tuning database applications, modeling, performance optimization, etc.</li>\n</ul>\n<p><strong>Address:</strong>\nKerala University of Digital Sciences, Innovation and Technology\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala , 695317\nhttps://duk.ac.in</p>",
        "tags": [
            "3+ Years",
            "PHP",
            "SQL/NoSQL",
            "JavaScript"
        ],
        "summary": "Seeking a Research Engineer to design and develop standalone applications using PHP and related technologies. Requires 3+ years R&D experience in the IT industry."
    },
    {
        "job_title": "Manager R&D (Job Code MRD/52025/23)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/21614",
        "location": "Technopark",
        "closing_date": "22 Jul 2025",
        "job_description": "<h2>Manager R&amp;D</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking a Manager R&amp;D for the Centre for Digital Transformation &amp; Innovation (CDTI). This is a contract-based position.</p>\n<p><strong>Contact Information:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 22 July 2025</p>\n<p><strong>Location:</strong>\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala, 695317</p>\n<p><strong>Website:</strong> https://duk.ac.in</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead and manage the project team.</li>\n<li>Identifying and developing new opportunities with clients.</li>\n<li>Lead the team and Supervise overall Development activities including Designing, code review, testing, and implementation of software components.</li>\n<li>Lead Research in the area of eGovernance and other areas.</li>\n<li>Provide guidance and solutions to the research team.</li>\n<li>Guiding the team through technical issues and challenges on the job.</li>\n</ul>\n<p><strong>Essential Qualifications:</strong></p>\n<ul>\n<li>M.Tech/MCA/MSc. Computer Science or equivalent degree from a recognized University/ Educational Institution with a first-class.</li>\n</ul>\n<p><strong>Essential Experience:</strong></p>\n<ul>\n<li>Minimum 8+ years of experience in Research and Development in e-Governance and Software Engineering.</li>\n</ul>\n<p><strong>Desirable Experience/Preferred Skills:</strong></p>\n<ul>\n<li>Familiarity with PHP Web frameworks</li>\n<li>Familiarity with Relational Database Management Systems (RDBMS) such as MySQL, PostgreSQL, etc.</li>\n</ul>\n<p><strong>Application Instructions:</strong>\nCandidates shall apply online through the Recruitment Portal. The guidelines for submission of applications are available in the recruitment portal.\nApplications shall be submitted online by 22 July 2025 at the latest. The application form is available at https://www.duk.ac.in/careers</p>",
        "tags": [
            "8+ Years",
            "R&D",
            "e-Governance",
            "Software Engineering"
        ],
        "summary": "Seeking a Manager R&D to lead research and development activities in e-Governance and software engineering. Requires 8+ years of experience and a relevant Master's degree."
    },
    {
        "job_title": "WordPress Developer - Immediate (Important WordPress Experience should be minimum 3+ Years)",
        "company": "Crayo Tech Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21613",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>WordPress Developer</h2>\n<p><strong>Crayo Tech Business Solutions (P) Ltd</strong> is looking for an experienced WordPress Developer to join their team at Kerala Startup Mission, Technopark Campus, Trivandrum.</p>\n<p><strong>Contact:</strong> careers@crayotech.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced WordPress Developer with a strong background in building and customizing WooCommerce-based e-commerce solutions. As a WordPress Developer, you will be responsible for designing, developing, and maintaining WordPress-powered websites and online stores that meet our clients' unique business requirements.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and implement custom WordPress themes and plugins to meet client needs</li>\n<li>Hands-on experience in building and customizing WooCommerce-based e-commerce solutions, including integrating payment gateways, managing product catalogs, and optimizing store performance</li>\n<li>Collaborate with cross-functional teams, including designers and business stakeholders, to understand requirements and translate them into technical solutions</li>\n<li>Ensure seamless integration of WooCommerce with other third-party plugins and services, such as CRM, ERP, and marketing automation tools</li>\n<li>Implement advanced WooCommerce features, including custom product types, subscription-based models, and complex order management</li>\n<li>Optimize WordPress and WooCommerce-based websites for performance, security, and scalability</li>\n<li>Troubleshoot and resolve complex technical issues, providing timely and effective solutions</li>\n<li>Participate in code reviews, testing, and deployment activities to ensure high-quality deliverables</li>\n<li>Stay up-to-date with the latest WordPress and WooCommerce trends, best practices, and industry advancements.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, or a related field</li>\n<li>3+ years of hands-on experience in WordPress development, with a strong focus on building and customizing WooCommerce-based e-commerce solutions</li>\n<li>Proficient in PHP, HTML, CSS, and JavaScript, with a deep understanding of WordPress and WooCommerce development best practices</li>\n<li>Expertise in integrating and customizing various payment gateways, such as Razorpay, Instamojo, PayPal, Stripe, and others</li>\n<li>Experience in managing product catalogs, creating custom product types, and implementing advanced WooCommerce features</li>\n<li>Ability to optimize WordPress and WooCommerce-based websites for performance, security, and search engine optimization (SEO)</li>\n</ul>\n<p>Email your resume to careers@crayotech.com with the Subject: \"WordPress Developer - Candidate Name\"</p>\n<p><strong>Closing Date:</strong> 31, July 2025</p>\n<p><strong>Job Published:</strong> 07, July 2025</p>",
        "tags": [
            "3+ Years",
            "WordPress",
            "WooCommerce",
            "PHP"
        ],
        "summary": "Crayo Tech is seeking a WordPress Developer to design, develop, and maintain WordPress and WooCommerce e-commerce solutions. The role involves theme/plugin development, payment gateway integration, and website optimization."
    },
    {
        "job_title": "HR & Admin Executive",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21612",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>HR &amp; Admin Executive</h2>\n<p><strong>SRS Global Technologies (P) Ltd</strong>\n1st Floor, Thejaswini Building,\nTechnopark, Karyavattom PO,\nThiruvananthapuram, Kerala - 695581\nhttps://srsglobaltechnologies.com</p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 07, July 2025\n<strong>Contact Email:</strong> hr@srswebsolutions.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Assist in recruitment, including job postings, applicant tracking, coordinating interviews, and onboarding freshers.</li>\n<li>Manage attendance and leave, maintain logs, process entries in HRIS/time-tracking systems.</li>\n<li>Handle vendor management: liaise with office services (cafeteria, stationery, training), track invoices, and support vendor contracts.</li>\n<li>Support employee engagement initiatives: organize events, recognition programs, surveys, and onboarding activities.</li>\n<li>Perform day-to-day admin and operations: maintain personnel records, assist with HR documentation, support payroll and benefits coordination.</li>\n<li>Oversee email drafting: prepare HR communications such as interview schedules, policy updates, reminders.</li>\n<li>Manage purchases: procure office supplies, track expenses, coordinate with vendors and finance teams.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong organizational &amp; multitasking ability to manage attendance tracking, vendor coordination, documentation, and procurements simultaneously.</li>\n<li>Effective verbal and written interaction with candidates, vendors, employees, and management.</li>\n<li>Resolve admin, vendor, or employee issues efficiently.</li>\n<li>Clear, professional correspondence tailored to various internal and external stakeholders.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Recruitment",
            "Vendor Management",
            "HRIS"
        ],
        "summary": "Seeking a HR & Admin Executive to assist in recruitment, manage attendance, and handle vendor management. Supports employee engagement and day-to-day administrative operations."
    },
    {
        "job_title": "iOS Technical Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21611",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>iOS Technical Lead</h2>\n<p>Way.Com India Pvt Ltd is seeking an experienced and passionate iOS Technical Lead to drive the next phase of growth and innovation within our iOS app ecosystem. We are a rapidly growing digital platform transforming the automotive services industry, offering users a unified and seamless experience across web and mobile platforms.</p>\n<p><strong>Role Overview</strong></p>\n<p>As the iOS Technical Lead, you will be responsible for leading the architecture, design, development, and optimization of our iOS applications. This is a strategic and hands-on role where you will work closely with cross-functional teams—including Product, Design, Backend, and QA—to deliver high-performing, scalable, and engaging mobile experiences. Strong technical expertise, combined with leadership and mentoring capabilities, is essential for success in this role.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Lead the architecture, design, and development of our iOS applications using Swift.</li>\n<li>Collaborate with Product and Design teams to translate business requirements into scalable technical solutions.</li>\n<li>Ensure optimal app performance, quality, and responsiveness across a wide range of iOS devices.</li>\n<li>Mentor and guide junior and mid-level iOS developers, conducting code reviews and fostering professional growth.</li>\n<li>Maintain high standards in code quality, testing, and documentation throughout the development lifecycle.</li>\n<li>Work closely with backend and API teams to design and integrate scalable services.</li>\n<li>Drive technical innovation and continuous improvement within the mobile development stack.</li>\n<li>Own the end-to-end delivery of new features and performance enhancements.</li>\n<li>Stay abreast of the latest iOS trends, best practices, and platform updates.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications</strong></p>\n<ul>\n<li>10+ years of experience in mobile application development, with a minimum of 6 years specializing in iOS development.</li>\n<li>Expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.</li>\n<li>Strong knowledge of RESTful APIs, JSON parsing, and third-party library integration.</li>\n<li>Experience in architecting complex mobile applications using modular design patterns (MVVM, MVI, MVP).</li>\n<li>Proficiency in CI/CD pipelines, automated testing, code reviews, and App Store deployment processes.</li>\n<li>Proven track record of leading teams and mentoring iOS developers.</li>\n<li>Familiarity with tools such as Firebase, Mixpanel, or similar analytics and crash reporting platforms.</li>\n<li>Understanding of web app ecosystems and cross-platform compatibility.</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Experience with Core Bluetooth, Core Location, or real-time services integration (e.g., EV or roadside assistance).</li>\n<li>Background in mobility, transportation, or automotive technology platforms.</li>\n<li>Familiarity with Kotlin Multiplatform or other cross-platform frameworks.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>careers@way.com</p>\n<p>Way Dot Com (P) Ltd\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com</p>",
        "tags": [
            "10+ Years",
            "Swift",
            "iOS Development",
            "RESTful APIs"
        ],
        "summary": "Way.com is seeking an iOS Technical Lead to spearhead the development and optimization of iOS applications. This role involves architecture, team leadership, and collaboration to deliver high-performing mobile experiences."
    },
    {
        "job_title": "Engineering Manager - Mobile",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21610",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Engineering Manager - Mobile</h2>\n<p>Way.com is seeking a highly motivated and experienced Engineering Manager to join our Mobile Engineering Team. In this role, you will lead the development of innovative projects powering our automotive platform. This is a unique opportunity to work with cutting-edge technology and shape the future of mobility.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead a team of Android and iOS engineers in designing, building, shipping, and maintaining mobile app features for our automotive platform.</li>\n<li>Manage the development and successful delivery of complex, cross-functional projects in close collaboration with engineering teams and stakeholders across the USA and Canada.</li>\n<li>Contribute to project planning and scoping efforts while owning the execution and delivery of key engineering initiatives.</li>\n<li>Collaborate with teams across Product, Design, Science, Research, Data Science, Regulatory, and Marketing to align on objectives and deliverables.</li>\n<li>Mentor and coach team members, fostering their technical and professional development, and supporting their career growth.</li>\n<li>Provide technical leadership to the team. Your deep technical expertise will guide architecture decisions and lead technical discussions.</li>\n<li>Make well-informed technical decisions, balancing trade-offs to ensure scalable and sustainable solutions.</li>\n<li>Champion engineering best practices, define performance metrics, and drive continuous process and operational improvements.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications &amp; Requirements:</strong></p>\n<ul>\n<li>A minimum of <strong>7+ years of experience</strong> in software engineering, including at least 2 years in a leadership or engineering management capacity.</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or MCA.</li>\n<li>Demonstrated experience in managing teams of <strong>Android and/or iOS engineers</strong>.</li>\n<li>Hands-on expertise in delivering <strong>consumer-facing mobile applications or the backend systems</strong> that support them.</li>\n<li>Strong proficiency in <strong>Agile/Scrum development methodologies</strong>, with a solid understanding of iterative development and process optimization.</li>\n<li>Exceptional communication, project management, and delegation skills, with a proven ability to deliver cross-functional projects from concept to launch.</li>\n<li>Strong leadership and people management capabilities, with a focus on recognizing contributions, providing constructive feedback, and nurturing a culture of growth.</li>\n<li>A collaborative, empathetic, and adaptable mindset, with openness to feedback and a commitment to continuous learning.</li>\n</ul>\n<p>Contact Email: careers@way.com</p>",
        "tags": [
            "7+ Years",
            "Mobile Applications",
            "Android",
            "iOS"
        ],
        "summary": "Way.com is hiring an Engineering Manager to lead their Mobile Engineering Team. The ideal candidate will have experience leading Android and iOS engineers, and delivering consumer-facing mobile applications."
    },
    {
        "job_title": "Full Stack Developer – Java | Spring Boot | React",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/21609",
        "location": "Technopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p><strong>Valoriz Digital (P) Ltd</strong>\nT5, 7th Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.valoriz.com\">http://www.valoriz.com</a></p>\n<p><strong>Closing Date:</strong> 14, July 2025\n<strong>Job Published:</strong> 07, July 2025\n<strong>Contact Email:</strong> smitha.suja.varghese@valoriz.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>Full stack engineer to design and build Web based software solutions. Capable to learn, adaptable and can mentor on new technologies. Work with architects/product owners to develop technology solutions. Develop software applications leveraging state of the art web technologies and frameworks. Work with a high performing agile team using the latest tools for rapid development, continuous integration, and deployment. Ensure user experience, availability, scalability, responsiveness, and security software quality standards are achieved.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong in Web technologies (SpringBoot, ReactJS, HTML, CSS, MongoDB) with full stack development experience.</li>\n<li>Must have <strong>2 + years</strong> of experience in software development. [ 2 Yrs in Springboot and React - Mandatory]</li>\n<li>Experience in software design and engineering of REST-based web services.</li>\n<li>Experience in <strong>Agile</strong> development methodologies.</li>\n<li>Experience working with source control like <strong>GIT</strong> and build tools like maven, gradle etc.</li>\n<li>Experience in the <strong>e-commerce/retail domain</strong> is an added advantage.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "SpringBoot",
            "ReactJS",
            "REST"
        ],
        "summary": "We are seeking a Full Stack Developer to design and build web solutions. The ideal candidate will have experience with SpringBoot, React, and RESTful services."
    },
    {
        "job_title": "Sales Development Representative",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/21608",
        "location": "Technopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Sales Development Representative</h2>\n<p><strong>Valoriz Digital (P) Ltd</strong>\nT5, 7th Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.valoriz.com\">http://www.valoriz.com</a></p>\n<p><strong>Closing Date:</strong> 14, July 2025\n<strong>Job Published:</strong> 07, July 2025\n<strong>Contact Email:</strong> careers@valoriz.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Understand our service offerings, eCommerce solutions, and accelerator portfolio.</li>\n<li>Generate leads through inbound and outbound efforts—LinkedIn, emails, calls—and engage decision-makers (including C-level) across target organizations.</li>\n<li>Maintain active follow-up with leads to nurture relationships and build interest.</li>\n<li>Collaborate with senior leadership to refine sales strategies, build partnerships, and drive pipeline growth.</li>\n<li>Track performance via sales reports/dashboards and work toward achieving monthly/quarterly targets.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proven track record of success as an SDR in a B2B technology firm.</li>\n<li>2 - 3 years of experience in selling enterprise solutions to CxOs/ Heads of Department.</li>\n<li>Prior experience in lead generation through cold/warm calling in developed markets.</li>\n<li>Should have strong interpersonal and communication skills.</li>\n<li>A bonus would be previous tech industry experience or experience in sales development in digital commerce/ eCommerce space.</li>\n<li>Experience in identifying and nurturing partnership opportunities to support business growth.</li>\n<li>Strong track record in acquiring new clients and expanding business through strategic collaborations.</li>\n<li>Female candidates preferred.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "Lead Generation",
            "B2B Sales",
            "eCommerce"
        ],
        "summary": "Valoriz Digital is seeking a Sales Development Representative to generate leads and build relationships. The ideal candidate will have experience in selling enterprise solutions."
    },
    {
        "job_title": "Lead-AI Engineer/Data Analyst",
        "company": "Appfabs Innovation (P) Ltd",
        "url": "https://technopark.org/job-details/21607",
        "location": "Technopark",
        "closing_date": "21 Aug 2025",
        "job_description": "<h2>Lead AI Engineer/Data Analyst</h2>\n<p><strong>Appfabs Innovation (P) Ltd</strong> is seeking a versatile and highly skilled Lead Data Analyst / AI Engineer to join our innovative team. In this unique role, you will combine the strengths of a data scientist with the capabilities of an AI engineer, diving deep into data, extracting meaningful insights, and building and deploying cutting-edge Machine Learning, Deep Learning, and Generative AI models. You will play a crucial role in transforming raw data into strategic assets and intelligent applications.</p>\n<p><strong>Location:</strong> Appfabs Innovation, Thiruvananthapuram\n<strong>Open Positions:</strong> 3\n<strong>Employment Type:</strong> Full Time</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Data Analysis &amp; Insight Generation:</strong></li>\n<li>Perform in-depth Exploratory Data Analysis (EDA) to identify trends, patterns, and anomalies in complex datasets.</li>\n<li>Clean, transform, and prepare data from various sources for analysis and model development.</li>\n<li>Apply statistical methods and hypothesis testing to validate findings and support data-driven decision-making.</li>\n<li>Create compelling and interactive BI dashboards (e.g., Power BI, Tableau) to visualize data insights and communicate findings to stakeholders.</li>\n<li><strong>Machine Learning &amp; Deep Learning Model Development:</strong></li>\n<li>Design, build, train, and evaluate Machine Learning models (e.g., regression, classification, clustering) to solve specific business problems.</li>\n<li>Develop and optimize Deep Learning models, including CNNs for computer vision tasks and Transformers for Natural Language Processing (NLP).</li>\n<li>Implement feature engineering techniques to enhance model performance.</li>\n<li><strong>Generative AI Implementation:</strong></li>\n<li>Explore and experiment with Large Language Models (LLMs) and other Generative AI techniques.</li>\n<li>Implement and fine-tune LLMs for specific use cases (e.g., text generation, summarization, Q&amp;A).</li>\n<li>Develop and integrate Retrieval Augmented Generation (RAG) systems using vector databases and embedding models.</li>\n<li>Apply Prompt Engineering best practices to optimize LLM interactions.</li>\n<li>Contribute to the development of Agentic AI systems that leverage multiple tools and models.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li><strong>Data Science &amp; Analytics:</strong></li>\n<li>Strong proficiency in Python and its data science libraries (Pandas, NumPy, Scikit-learn, Matplotlib, Seaborn).</li>\n<li>Proven experience with Exploratory Data Analysis (EDA) and statistical analysis.</li>\n<li>Hands-on experience developing BI Dashboards using tools like Power BI or Tableau.</li>\n<li>Understanding of data warehousing and data lake concepts.</li>\n<li><strong>Machine Learning:</strong></li>\n<li>Solid understanding of various ML algorithms (e.g., Regression, Classification, Clustering, Tree-based models).</li>\n<li>Experience with model evaluation, validation, and hyperparameter tuning.</li>\n<li><strong>Deep Learning:</strong></li>\n<li>Proficiency with Deep Learning frameworks such as TensorFlow, Keras, or PyTorch.</li>\n<li>Experience with CNNs (Convolutional Neural Networks) and computer vision concepts (e.g., OpenCV, object detection).</li>\n<li>Familiarity with Transformer architectures for NLP tasks.</li>\n<li><strong>Generative AI:</strong></li>\n<li>Practical experience with Large Language Models (LLMs).</li>\n<li>Understanding and application of RAG (Retrieval Augmented Generation) systems.</li>\n<li>Experience with Fine-tuning LLMs and Prompt Engineering.</li>\n<li>Familiarity with frameworks like LangChain or LlamaIndex.</li>\n<li><strong>Problem-Solving:</strong> Excellent analytical and problem-solving skills with a strong ability to approach complex data challenges.</li>\n</ul>\n<p><strong>Good to Have:</strong></p>\n<ul>\n<li>Experience with cloud-based AI/ML services (e.g., Azure ML, AWS SageMaker, Google Cloud AI Platform).</li>\n<li>Familiarity with MLOps principles and tools (e.g., MLflow, DVC, CI/CD for models).</li>\n<li>Experience with big data technologies (e.g., Apache Spark).</li>\n</ul>\n<p><strong>Educational Qualification:</strong></p>\n<p>Bachelor’s or Master's degree in Computer Science, Information Technology, or a related field (or equivalent experience).</p>\n<p><strong>Contact:</strong>\nInterested candidates, please share your resume with us at careers@appfabs.in. Please mention the position you are applying for in the subject line.</p>\n<p>Appfabs Innovation (P) Ltd\nModules No. 11, Gayathri Building, Phase I, Technopark Campus, Thiruvanthapuram , 695581\nhttps://www.appfabs.ca</p>",
        "tags": [
            "6-10 Years",
            "Generative AI",
            "Python",
            "Deep Learning"
        ],
        "summary": "Appfabs Innovation is hiring a Lead AI Engineer/Data Analyst. The role involves data analysis, machine learning, and generative AI model development."
    },
    {
        "job_title": "BUSINESS DEVELOPMENT EXECUTIVE",
        "company": "Awdar Software Solutions Llp",
        "url": "https://technopark.org/job-details/21606",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>BUSINESS DEVELOPMENT EXECUTIVE</h2>\n<p><strong>AWDAR SOFTWARE SOLUTIONS LLP</strong>\nModule No 2301, 3rd Floor, Yamuna Building, Technopark Phase 3, Trivandrum, 695583\nhttps://ainexit.com</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 07, July 2025\n<strong>Contact Email:</strong> hr@awdar-solutions.com</p>\n<p><strong>Job Description:</strong>\nWe are looking for a proactive and results-driven Business Development Executive to help us expand our global client base. This role is ideal for someone with a passion for sales, strong communication skills, and the ability to build lasting client relationships. You will be responsible for developing and executing sales strategies to achieve company revenue goals, managing the sales pipeline, tracking progress, and providing regular reports to management.</p>\n<p><strong>Responsibilities:</strong>\n- Develop and execute sales strategies to achieve company revenue goals.\n- Manage the sales pipeline and track progress.\n- Build and maintain lasting client relationships.\n- Provide regular reports to management.</p>\n<p><strong>Qualifications:</strong>\n- <strong>Experience:</strong> Minimum 3 years is mandatory.\n- Bachelor’s degree in Business Administration, Marketing, or a related field. A Master’s degree is a plus.\n- Strong understanding of IT Services (web development, mobile apps, cloud services, data sciences.)\n- Experience in international sales and client acquisition.\n- Adept at building and maintaining long-term relationships with a diverse set of stakeholders.\n- Relevant certifications in Sales, Data Center Product Sales, and Soft Skills are considered an added advantage.\n- Familiarity with CRM tools and sales tracking systems.\n- Experienced in report creation, strategic planning, and market data analysis.\n- Self-motivated and able to work independently.\n- Excellent verbal and written communication skills.</p>\n<p>Interested in joining our team? Upload your applications at https://ainexit.com/careers</p>",
        "tags": [
            "3+ Years",
            "Sales",
            "IT Services",
            "CRM"
        ],
        "summary": "AWDAR is seeking a Business Development Executive to expand its global client base and achieve revenue goals. Requires 3+ years' experience and expertise in IT services sales."
    },
    {
        "job_title": "HR Intern",
        "company": "Akira Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21605",
        "location": "Technopark",
        "closing_date": "01 Aug 2025",
        "job_description": "<h2>HR Intern</h2>\n<p><strong>Akira Software Solutions (P) Ltd</strong> is offering a 6-month internship for individuals seeking hands-on experience in Human Resource Management.</p>\n<p><strong>Contact:</strong> hr@akiraplc.com</p>\n<p><strong>Location:</strong> Technopark, Trivandrum</p>\n<p><strong>Duration:</strong> 6 Months</p>\n<p><strong>Stipend:</strong> Unpaid</p>\n<p><strong>Closing Date:</strong> 01, Aug 2025</p>\n<h3>About the Internship:</h3>\n<p>This internship provides real-time exposure to core HR functions in a dynamic IT environment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in end-to-end recruitment processes: sourcing, screening, shortlisting, and scheduling.</li>\n<li>Support employee onboarding and documentation.</li>\n<li>Help organize and execute employee engagement activities.</li>\n<li>Maintain and update HR records and databases.</li>\n<li>Assist in preparing HR reports, memos, and letters.</li>\n<li>Participate in policy drafting and compliance tracking.</li>\n<li>Provide support in day-to-day HR operations.</li>\n</ul>\n<p><strong>Subject:</strong> \"Application for Human Resource Intern\"</p>\n<p><em>N.B: Applications without the specified subject line will not be considered.</em></p>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Good communication and interpersonal skills</li>\n<li>Basic knowledge of recruitment and HR concepts</li>\n<li>Proficiency in MS Office (Word, Excel, PowerPoint)</li>\n<li>Ability to multitask and maintain confidentiality</li>\n<li>Strong organizational and time-management abilities</li>\n<li>Positive attitude and eagerness to learn</li>\n</ul>\n<h3>Who Can Apply:</h3>\n<ul>\n<li>Recent graduates or students pursuing a degree/diploma in HR, Business Administration, or related fields</li>\n<li>Candidates looking to build a career in Human Resources</li>\n<li>Available to work full-time for 6 months onsite at our Technopark office</li>\n</ul>\n<h3>What You'll Gain:</h3>\n<ul>\n<li>Certificate of Completion</li>\n<li>Hands-on experience in a real-time corporate HR setup</li>\n<li>Mentorship from experienced HR professionals</li>\n<li>Networking and team collaboration skills</li>\n</ul>",
        "tags": [
            "No experience required",
            "Recruitment",
            "Onboarding",
            "Employee Engagement"
        ],
        "summary": "Akira Software Solutions is seeking a Human Resources Intern for a 6-month onsite program. This unpaid internship offers hands-on experience in core HR functions."
    },
    {
        "job_title": "Python",
        "company": "Akira Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21604",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Python Trainer</h2>\n<p><strong>Akira Software Solutions (P) Ltd</strong>\nModule No. 432 - 435, 4th Floor,\nNila Building, Technopark, 695581\nhttp://www.akiraplc.com</p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 07, July 2025\n<strong>Contact Email:</strong> hr@akiraplc.com</p>\n<p>We are looking for an enthusiastic and skilled Python Trainer with at least 1 year of hands-on experience in teaching or professional development using Python. The ideal candidate should have a passion for mentoring students, a solid grasp of Python programming concepts, and the ability to deliver structured, practical training sessions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Deliver engaging and hands-on Python training sessions to students or professionals (beginner to intermediate level)</li>\n<li>Create and maintain training materials, assignments, and assessments</li>\n<li>Guide students through practical projects and real-world problem solving</li>\n<li>Provide individual mentorship and track student progress</li>\n<li>Stay updated with the latest trends in Python and related technologies</li>\n</ul>\n<p><strong>Preferred Skills &amp; Requirements:</strong></p>\n<ul>\n<li>Strong proficiency in core Python (OOP, data types, loops, functions, modules, etc.)</li>\n<li>Experience with file handling, error handling, and regular expressions</li>\n<li>Knowledge of Python libraries such as pandas, matplotlib, or tkinter (a plus)</li>\n<li>Familiarity with basic database operations using SQLite or MySQL</li>\n<li>Exposure to web development frameworks like Flask or Django is a bonus</li>\n<li>Good communication and presentation skills</li>\n<li>Ability to design and explain real-world mini-projects</li>\n<li>Any previous training experience is highly preferred</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field (preferred)</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Python",
            "Training",
            "Mentoring"
        ],
        "summary": "Akira Software Solutions is seeking a Python Trainer. Responsibilities include delivering training sessions, creating materials, and mentoring students in Python programming."
    },
    {
        "job_title": "Videographer",
        "company": "Stackmod Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/21603",
        "location": "Technopark",
        "closing_date": "07 Aug 2025",
        "job_description": "<h2>Videographer</h2>\n<p><strong>Stackmod Innovations (P) Ltd</strong>\nAce-22, 5th Floor, CDAC Building, Technopark Phase 1 Campus, Thiruvananthapuram , 695581\n<a href=\"https://www.stackmod.io\">https://www.stackmod.io</a></p>\n<p><strong>Closing Date:</strong> 07, Aug 2025\n<strong>Job Published:</strong> 07, July 2025\n<strong>Contact Email:</strong> hr@stackmod.io</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a creative and passionate videographer to join our team. The ideal candidate will be responsible for capturing high-quality video content and contributing to creative projects. This role is perfect for individuals with a keen eye for detail, storytelling ability, and a desire to grow in the field of video production.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Plan and shoot for various projects, including promotional videos, events, and social media.</li>\n<li>Operate and maintain video equipment, such as cameras, lighting, and audio gear.</li>\n<li>Collaborate with the creative team to develop video concepts and storyboards.</li>\n<li>Ensure all footage aligns with brand guidelines and project objectives.</li>\n<li>Manage and organize video files, maintaining a clear archive system.</li>\n<li>Stay updated with industry trends and techniques to produce innovative and engaging content.</li>\n</ul>\n<p><strong>Key Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree or diploma in Film Production, Media, Communications, or a related field (preferred but not mandatory).</li>\n<li>Freshers or up to 2 years of experience in videography or video production.</li>\n<li>Basic understanding of camera operations, lighting, and audio equipment.</li>\n<li>Strong storytelling skills and a creative mindset.</li>\n<li>Ability to work both independently and as part of a team.</li>\n<li>Strong attention to detail and a commitment to delivering high-quality work.</li>\n<li>Knowledge of social media platforms and video content trends is a plus.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience in creating content for digital platforms such as YouTube, Instagram, or TikTok.</li>\n<li>Basic graphic design skills.</li>\n<li>Portfolio or demo reel showcasing previous video projects.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Competitive salary and benefits package.</li>\n<li>Opportunity to work on diverse and exciting projects.</li>\n<li>Learning and growth opportunities in a dynamic team.</li>\n<li>Access to modern equipment and resources.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates can send their updated resume and portfolio/demo reel to hr@stackmod.io with the subject line \"Application for Videographer.\"</p>",
        "tags": [
            "0-2 Years",
            "Video Production",
            "Storytelling",
            "Video Equipment"
        ],
        "summary": "Stackmod Innovations is looking for a Videographer to capture high-quality video content. The role involves planning shoots, operating equipment, and collaborating on creative projects."
    },
    {
        "job_title": "Lead - Finance and Accounting",
        "company": "Experion Technologies (I) (P) Ltd",
        "url": "https://technopark.org/job-details/21602",
        "location": "Technopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Lead - Finance and Accounting</h2>\n<p><strong>Experion Technologies (I) (P) Ltd</strong></p>\n<p>407, 4th Floor, Thejaswini, Technopark Campus,\nThiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.experionglobal.com\">http://www.experionglobal.com</a></p>\n<p><strong>Contact Email:</strong> sandra.paul@experionglobal.com</p>\n<p><strong>Closing Date:</strong> 14, July 2025\n<strong>Job Published:</strong> 07, July 2025</p>\n<p><strong>Location:</strong> Kochi/TVM</p>\n<p><strong>Brief Description:</strong></p>\n<p>Skills – Mandatory:\n- Chartered accountant experience from CA Firms or Industry</p>\n<p>Skills - Primary:\n- Financial Statements\n- Standalone Statements\n- Statutory compliance\n- Return filing\n- Tax Audit\n- Book reviews\n- Tally ERP 9</p>\n<p>Skills - Good to have:\n- Revenue working\n- Tally ERP 9</p>\n<p><strong>Qualification:</strong>\n- CA Passed</p>\n<p><strong>Total Experience:</strong> 3-5 years\n<strong>Relevant Experience:</strong> 3+ years</p>\n<p><strong>Job Description / Duties and Responsibilities:</strong></p>\n<ul>\n<li>Preparation of financial statements, cashflow, notes to accounts, for the monthly MIS.</li>\n<li>Oversee the preparation of financial statements, manage month-end and year-end closing processes, and ensure accurate and timely reporting to management and stakeholders.</li>\n<li>Periodic review of the books accounts of all Experion Group entities.</li>\n<li>Processing payroll of Experion Group entities in India, Australia and recording entries in books.</li>\n<li>Compiling the project salary cost of all Delivery Units and sharing with the Project Management Team.</li>\n<li>Ensuring timely statutory compliances including filing the periodic returns, review of ascertained liability, with respect to GST, TDS, Income Tax, FEMA etc.</li>\n<li>Handling statutory audit with other team members.</li>\n<li>Handling tax audit, transfer pricing audit by coordinating with the consultants for timely filing of the Forms.</li>\n<li>Handling periodic ISO audits.</li>\n<li>Coordinate with the Consultants in the Regions for timely book closure, filing of returns for applicable statutory compliances.</li>\n<li>Revenue computation of projects and reconcile the same with the Project Management Team.</li>\n<li>Preparation of workings for Invoicing from Experion India to the Subsidiary companies on a monthly basis</li>\n<li>Ensuring timely export bill regularization with Bank by coordinating with the concerned Team members.</li>\n<li>Bank reconciliation and sharing the weekly fund position with the Management</li>\n<li>Fixed Fee Revenue Computation, finalization and reconciliation with touchbase</li>\n<li>T&amp;M Revenue Computation and Unbilled Revenue Compilation for MIS and reconciliation with touchbase</li>\n<li>Verification of Investment proof of employees in the HRMS system for employees opted under Old Tax Regime</li>\n<li>Preparation of any adhoc reports as may be requirement by the Management</li>\n<li>Any other tasks that may be assigned from time to time.</li>\n<li>Adhere to the Information Security Management policies and procedures.</li>\n</ul>\n<p><strong>Job Specification / Skills and Competencies</strong></p>\n<p>Skills and Qualifications:\n- <strong>Financial Expertise:</strong> Strong understanding of accounting principles, financial reporting, budgeting, and financial analysis.\n- <strong>Analytical Skills:</strong> Ability to analyze complex financial data, identify trends, and develop actionable insights.\n- <strong>Communication Skills:</strong> Excellent written and verbal communication skills to effectively convey financial information to various stakeholders.\n- <strong>Leadership Skills:</strong> Ability to lead, motivate, and develop a team of finance professionals.\n- <strong>Problem-Solving Skills:</strong> Ability to identify and resolve financial issues, manage risks, and develop creative solutions.\n- <strong>Technical Skills:</strong> Proficiency in accounting software, financial modeling tools, and Microsoft Office Suite</p>\n<p><strong>Preferred Skills</strong></p>\n<p>Skills – Mandatory:\n- Chartered accountant experience from CA Firms or Industry</p>\n<p>Skills - Primary:\n- Financial Statements\n- Standalone Statements\n- Statutory compliance\n- Return filing\n- Tax Audit\n- Book reviews\n- Tally ERP 9</p>\n<p>Skills - Good to have:\n- Revenue working\n- Tally ERP 9</p>\n<p><strong>Qualification:</strong>\n- CA Passed</p>",
        "tags": [
            "3+ Years",
            "Financial Statements",
            "Statutory Compliance",
            "Tax Audit"
        ],
        "summary": "We are seeking a Lead in Finance and Accounting to manage financial reporting, ensure compliance, and provide financial insights. The role involves leading audits and supporting financial operations."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/21601",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p><strong>Alzone Software (P) Ltd</strong> is seeking a Business Development Manager to drive business growth in Digital Transformation Technologies.</p>\n<p><strong>Location:</strong> Trivandrum (Work From Office)\n<strong>Shift:</strong> Normal</p>\n<h3>Job Summary</h3>\n<p>We are seeking an experienced Business Development Manager with expertise in Digital Transformation Technologies, including Data Analytics, AI Platforms, and Web Development Services. The role focuses on driving business growth, building strong client relationships, and managing international sales in industries such as Supply Chain/Logistics, Pharma/Healthcare, and Banking/Finance.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Business Development: Formulate strategies to identify and secure new business opportunities in the Digital Transformation domain.</li>\n<li>Client Engagement: Build and maintain relationships with CXOs, acting as a trusted advisor for IT consulting and digital transformation solutions.</li>\n<li>Revenue Generation: Drive consistent revenue growth, meeting and exceeding sales targets with a proven track record of high-value deals.</li>\n<li>Sales Execution: Manage the complete sales cycle, including lead generation, proposal development, and contract negotiations.</li>\n<li>Market Insights: Conduct research to identify market trends, competitive landscape, and new business opportunities.</li>\n<li>Collaboration: Partner with internal teams to deliver tailored client solutions and align with organizational goals.</li>\n<li>Negotiation: Lead high-value contract negotiations, ensuring mutually beneficial agreements.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Education: Bachelor’s degree in Computer Science/IT (MBA preferred).</li>\n<li>Experience: 4+ years in IT/Software business development, focusing on Digital Transformation and Web Development Services.</li>\n<li>Revenue Generation History: Proven ability to deliver measurable revenue growth, supported by a verifiable record of successful deals and their impact on organizational growth.</li>\n<li>International Sales: Expertise in global markets, with a strong network of CXO-level contacts and experience navigating diverse business environments.</li>\n<li>Industry Expertise: In-depth understanding of Supply Chain/Logistics, Pharma/Healthcare, and Banking/Finance verticals.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume to careers@alzonesoftware.com with the subject line: \"Application for Business Development Manager.\"</p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 07, July 2025</p>\n<p><strong>Contact Email:</strong> careers@alzonesoftware.com</p>\n<p><strong>Address:</strong>\nAlzone Software (P) Ltd\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\nhttp://www.alzonesoftware.com</p>",
        "tags": [
            "4+ Years",
            "Digital Transformation",
            "Web Development Services",
            "Data Analytics",
            "AI Platforms"
        ],
        "summary": "Alzone Software is looking for a Business Development Manager to drive business growth in Digital Transformation. The role involves building client relationships and managing international sales."
    },
    {
        "job_title": "RPA Developer (Power Automate-Desktop and power app)",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/21600",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>RPA Developer (Power Automate - Desktop and Power App)</h2>\n<p><strong>Alzone Software (P) Ltd</strong>\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\n<a href=\"http://www.alzonesoftware.com\">http://www.alzonesoftware.com</a></p>\n<p><strong>Location:</strong> Trivandrum\n<strong>Experience:</strong> 2+ years\n<strong>Notice period:</strong> Immediate or one month\n<strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 07, July 2025</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Power Automate – Cloud Flows</strong></li>\n<li>Design, build, and maintain automated cloud workflows using Power Automate.</li>\n<li>Create approval processes, data syncs, and email/task automation using connectors like Outlook, SharePoint, Excel, Teams, Planner, and SQL.</li>\n<li>Use condition controls, expressions, loops, and error handling to ensure robust automation.</li>\n<li>\n<p>Integrate Power Automate with Power Apps and Microsoft 365 services.</p>\n</li>\n<li>\n<p><strong>Power Automate Desktop (PAD – RPA)</strong></p>\n</li>\n<li>Develop desktop automation (attended/unattended) using PAD.</li>\n<li>Automate manual, repetitive desktop tasks involving Excel, legacy apps, PDFs, browsers, or desktop software.</li>\n<li>Implement UI automation, web scraping, and error handling techniques.</li>\n<li>\n<p>Use input/output variables, subflows, and scripting for advanced logic.</p>\n</li>\n<li>\n<p><strong>Power Apps – Canvas Apps</strong></p>\n</li>\n<li>Design and build Canvas apps using Power Fx formulas, galleries, collections, and controls.</li>\n<li>Connect to data sources like SharePoint, Excel, Dataverse, or SQL Server.</li>\n<li>Implement dynamic forms, filtering, sorting, search, and offline capability (if needed).</li>\n<li>\n<p>Ensure good user experience (UX) with responsive layouts and intuitive navigation.</p>\n</li>\n<li>\n<p><strong>Data Integration &amp; Business Logic</strong></p>\n</li>\n<li>Work with Microsoft Dataverse, SharePoint Lists, or Excel Tables to manage app/flow data.</li>\n<li>Configure business rules, validations, and dynamic behavior in apps and flows.</li>\n<li>\n<p>Implement role-based access control and data visibility using Power Apps/Automate permissions.</p>\n</li>\n<li>\n<p><strong>Collaboration &amp; Project Delivery</strong></p>\n</li>\n<li>Work directly with stakeholders or business teams to gather requirements and provide demos.</li>\n<li>Translate business processes into technical flow diagrams and working apps/flows.</li>\n<li>Document app designs, flow logic, and provide basic user guides or support material.</li>\n<li>Provide maintenance and troubleshooting for existing automations and apps.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Automation:</strong> Power Automate Cloud, Power Automate Desktop</li>\n<li><strong>App Development:</strong> Power Apps (Canvas), Power Fx</li>\n<li><strong>Data Sources:</strong> SharePoint, Excel, Dataverse, SQL, OneDrive</li>\n<li><strong>Other Skills:</strong> REST APIs, JSON, Office 365 integration</li>\n<li><strong>Soft Skills:</strong> Problem-solving, stakeholder communication, documentation</li>\n</ul>\n<p><strong>Contact:</strong>\n📧 Interested? Share your resume with careers@alzonesoftware.com using the subject line: \"Application for RPA-Power Automate Position\".</p>",
        "tags": [
            "2+ Years",
            "Power Automate",
            "Power Apps",
            "Dataverse"
        ],
        "summary": "Alzone Software is seeking an RPA Developer to design and build automated workflows and apps using the Microsoft Power Platform. This role involves creating solutions using Power Automate, Power Apps, and related technologies."
    },
    {
        "job_title": "Data Architect/Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21599",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Data Architect/Manager</h2>\n<p><strong>Way.com</strong> is seeking a highly skilled and driven Data Architect/Manager to join our dynamic team. This role offers a unique blend of deep technical involvement and leadership responsibility—perfect for a candidate eager to shape both the technical vision and strategic roadmap of our data architecture initiatives.</p>\n<p><strong>About Way</strong></p>\n<p>Way is redefining car ownership. As the leading Auto Super App, we help millions of drivers across the United States save on car expenses—ranging from insurance and parking to maintenance and roadside assistance. Our enterprise solutions extend these benefits to cities, fleets, and major organizations nationwide.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p>As our Data Architect/Manager, you will:</p>\n<ul>\n<li>Lead the design, implementation, and maintenance of robust and scalable database models, schemas, and overall data infrastructure.</li>\n<li>Manage and mentor a team of data engineers, analysts, and key stakeholders, promoting a culture of technical excellence and collaboration.</li>\n<li>Translate business needs into technical solutions by working cross-functionally with product, engineering, design, and other teams.</li>\n<li>Evaluate, select, and manage database technologies and tools aligned with the organization's evolving data strategy.</li>\n<li>Monitor system performance, data lifecycle, and integrity, ensuring reliability, scalability, and efficiency.</li>\n<li>Enforce data governance standards and ensure compliance with relevant privacy laws and data protection regulations.</li>\n<li>Provide strategic guidance for data-driven initiatives, supporting executive-level decision-making through a well-architected data foundation.</li>\n<li>Drive cross-functional data initiatives, championing best practices across departments.</li>\n<li>Communicate project progress, risks, and roadblocks to leadership, and proactively resolve issues to ensure successful execution.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, Data Science, or a related discipline.</li>\n<li>Over 8 years of professional experience in database development, data modeling, and data architecture.</li>\n<li>Proven track record of leading teams or managing technical projects successfully.</li>\n<li>Relevant certifications such as CDMP, TOGAF, or similar are highly regarded.</li>\n<li>Strong foundational knowledge of RDBMS concepts, with hands-on experience in both relational and NoSQL databases.</li>\n<li>Experience in the Networking or Security domain is a plus.</li>\n<li>Practical experience in consuming APIs and designing multi-tenant database systems.</li>\n<li>Proficiency with technologies like Oracle, MySQL, Cassandra, Talend, ETL tools, Hadoop, etc.</li>\n<li>Solid understanding of database security, compliance requirements, and regulatory standards.</li>\n</ul>\n<p><strong>Skills Required</strong></p>\n<ul>\n<li>Strong leadership and team management abilities, with a focus on motivating, mentoring, and growing high-performing technical teams.</li>\n<li>Excellent analytical thinking and problem-solving skills.</li>\n<li>Effective communication skills, capable of clearly conveying complex technical ideas to both technical and non-technical audiences.</li>\n<li>High attention to detail to ensure accuracy, performance, and data security in system architecture.</li>\n<li>Ability to manage competing priorities, balance technical work with leadership responsibilities, and consistently deliver results on time.</li>\n<li>Strong project and stakeholder management skills with a focus on achieving measurable business impact.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>careers@way.com</p>",
        "tags": [
            "8+ Years",
            "Data Architecture",
            "Database Development",
            "Team Management"
        ],
        "summary": "Way.com is hiring a Data Architect/Manager to lead data initiatives and manage a team. The role involves designing data infrastructure, ensuring data governance, and driving data-driven decisions."
    },
    {
        "job_title": "Linux DevOps Trainer - contract",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21598",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Linux DevOps Trainer (Contract)</h2>\n<p><strong>Way.Com India Pvt Ltd</strong> is seeking an experienced Linux DevOps Trainer to lead a hands-on, instructor-led training program for a corporate group of 10-15 IT engineers. The training focuses on developing platform-agnostic DevOps expertise through practical, real-world scenarios, encouraging critical thinking and independent troubleshooting.</p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<h3>Target Audience Profile</h3>\n<ul>\n<li>Participants: IT professionals with 3 to 10+ years of industry experience</li>\n<li>Backgrounds: A mix of technical domains and specializations</li>\n<li>Learning Goals: Enhance capabilities in Linux, CI/CD, automation, monitoring, and DevOps best practices</li>\n<li>Schedule: Weekday evenings after 6:00 PM</li>\n<li>Training Style: Lean, outcome-focused, and grounded in real-world production needs</li>\n</ul>\n<h3>Core Curriculum Overview</h3>\n<p><strong>Linux &amp; Scripting</strong></p>\n<ul>\n<li>Deep proficiency in the Linux command-line interface</li>\n<li>Grasp of system architecture, permissions, and networking fundamentals</li>\n<li>Shell scripting for task automation</li>\n</ul>\n<p><strong>DevOps Foundations</strong></p>\n<ul>\n<li>Designing and managing CI/CD pipelines with tools like Jenkins, Git, and Maven</li>\n<li>Configuration management using tools such as Ansible</li>\n<li>Web server setup and tuning for performance (NGINX, Apache)</li>\n</ul>\n<p><strong>Monitoring &amp; Logging</strong></p>\n<ul>\n<li>Implementation and use of Prometheus, Grafana, and the ELK stack</li>\n<li>Developing workflows for incident detection, alerting, and triage</li>\n</ul>\n<p><strong>Security &amp; Infrastructure</strong></p>\n<ul>\n<li>Basic system hardening techniques</li>\n<li>Practicing secure DevOps principles, independent of any specific cloud platform</li>\n</ul>\n<p><strong>Mindset &amp; Operational Readiness</strong></p>\n<ul>\n<li>Conducting root cause analysis under real-world conditions</li>\n<li>Managing priorities during production incidents</li>\n<li>Fostering self-reliant, solution-oriented thinking for high-stakes environments</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in Linux system administration (RHEL, CentOS, Ubuntu)</li>\n<li>Hands-on experience with DevOps tools: Jenkins, Git, Docker, and Ansible</li>\n<li>Solid understanding of web infrastructure fundamentals, including NGINX, Apache, and content delivery networks (CDNs)</li>\n<li>Familiarity with monitoring and logging tools such as Prometheus, Grafana, and the ELK stack</li>\n<li>Exposure to security best practices and scripting for automation</li>\n</ul>\n<h3>Trainer Profile Requirements</h3>\n<ul>\n<li>Minimum of 5 years of practical experience in Linux system administration and DevOps engineering</li>\n<li>Proven track record in delivering corporate training or mentoring technical teams</li>\n<li>Adept at engaging professionals from varied technical backgrounds and tailoring content depth accordingly</li>\n<li>Excellent communication skills with the ability to convey concepts through real-world scenarios and practical troubleshooting</li>\n<li>Capable of instilling a production-first mindset and promoting operational independence among participants</li>\n</ul>\n<h3>Desired Training Outcomes</h3>\n<ul>\n<li>Equip engineers with the skills to independently diagnose, troubleshoot, and resolve issues without relying on other teams</li>\n<li>Encourage solutions that minimize dependency on cloud-native platforms</li>\n<li>Establish a strong foundational understanding of DevOps practices applicable across any technology stack or vendor ecosystem</li>\n<li>Foster a mindset evolution—from executing isolated tasks to taking ownership of end-to-end systems</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Linux",
            "DevOps",
            "Jenkins"
        ],
        "summary": "We are looking for a Linux DevOps Trainer to lead hands-on training. The role focuses on building platform-agnostic DevOps expertise for IT engineers."
    },
    {
        "job_title": "Spanish Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21597",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>\n<p><strong>Website:</strong> http://www.way.com</p>\n<p><strong>Closing Date:</strong> July 09, 2025</p>\n<p><strong>Job Published:</strong> July 07, 2025</p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage both inbound and outbound calls, addressing customer queries, issues, and complaints promptly and professionally.</li>\n<li>Provide compassionate, solution-focused assistance to ensure a positive experience for every customer interaction.</li>\n<li>Recognize, prioritize, and escalate complex concerns to relevant departments for swift and effective resolution.</li>\n<li>Maintain accurate and comprehensive records of all customer interactions.</li>\n<li>Achieve or surpass monthly performance goals, including customer satisfaction, first-call resolution, and productivity standards.</li>\n<li>Stay well-informed about the company’s products and services to offer precise and current information.</li>\n<li>Work collaboratively with team members to build a supportive and results-driven work environment.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Fluent in both <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong <strong>interpersonal and communication skills</strong>, with a patient and empathetic approach.</li>\n<li>Ability to <strong>multitask</strong> and <strong>manage time efficiently</strong> in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Customer Service",
            "Spanish Language",
            "Communication Skills"
        ],
        "summary": "We are looking for a Spanish Customer Success Executive to handle customer inquiries, resolve issues, and ensure satisfaction. Fluency in Spanish and English is required."
    },
    {
        "job_title": "Python Solution Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21596",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Python Solution Architect</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is a Global Technology Services and Solutions Company with over 15 years of experience, providing high-quality end-to-end IT Solutions and Services to clients globally. We specialize in Digital Transformation and offer expertise in various technologies, including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, and Business Intelligence.</p>\n<p><strong>Job Description:</strong></p>\n<p>As a Python Solution Architect, you will lead the development and implementation of solutions using Python, ensuring the product's top-notch quality through automated tests. You'll collaborate with cross-functional teams to gather and analyze project requirements. Must be able to provide technical supervision and support to mentor the team effectively. You will stay updated with the latest advancements in Python technologies.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the development and implementation of solutions using Python.</li>\n<li>Collaborate with cross-functional teams to gather and analyze project requirements.</li>\n<li>Previous ownership of app development projects is required.</li>\n<li>Develop automated tests to guarantee the product’s top-notch quality.</li>\n<li>Stay updated with the latest advancements and changes in Python technologies.</li>\n<li>Provide technical supervision and support to mentor the team effectively.</li>\n<li>Conduct code reviews to ensure adherence to coding standards, best practices, and maintain code quality.</li>\n<li>Participate in agile development processes, including sprint planning, estimation, and retrospectives.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>10+ years of experience in Python Development, Minimum 3 yrs in Lead role.</li>\n<li>Expert-level proficiency in Python.</li>\n<li>Capability to plan the core architecture and iteratively enhance it as needed.</li>\n<li>Strong analytical mindset to extract actionable insights from data.</li>\n<li>Excellent Team management and communication skills.</li>\n<li>Experience with RESTful APIs and integration of third-party libraries and APIs.</li>\n<li>Possess a comprehensive understanding of Python.</li>\n<li>Capable of understanding the company’s business needs and adjusting or innovating the product accordingly.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@techversantinfotech.com</li>\n<li>Website: http://www.techversantinfotech.com</li>\n<li>Address: Techversant Infotech (P) Ltd, Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Python",
            "RESTful APIs",
            "Team Management"
        ],
        "summary": "Techversant Infotech is seeking a Python Solution Architect to lead development and mentor teams. The role involves creating high-quality solutions and collaborating with cross-functional teams."
    },
    {
        "job_title": "Junior QA Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21595",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Junior QA Engineer</h2>\n<p>Way.Com India Pvt Ltd is looking for a Junior QA Engineer to join our team at Technopark Phase-III, Thiruvananthapuram.</p>\n<p><strong>Key Requirements:</strong></p>\n<ul>\n<li>Demonstrated ability to comprehend and analyze business requirements, translating them into well-defined test strategies and test cases.</li>\n<li>Minimum of <strong>2 years</strong> of hands-on experience in test automation using Java.</li>\n<li>Solid understanding of <strong>Core Java concepts</strong> with proven practical experience.</li>\n<li>Proficient in using <strong>Selenium WebDriver</strong> for performing UI automation testing.</li>\n<li>Hands-on experience with <strong>API testing using Rest Assured</strong>.</li>\n<li>Strong verbal and written communication skills to facilitate effective collaboration across teams.</li>\n<li>Proactive mindset with a strong sense of responsibility and ownership of tasks.</li>\n<li>Excellent analytical and <strong>problem-solving abilities</strong>, with keen attention to detail.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li>Has <strong>2–3 years</strong> in QA and Test automation.</li>\n<li>Good hands-on experience in Core Java concepts</li>\n<li>Experience with <strong>Selenium WebDriver</strong></li>\n</ul>\n<p><strong>Contact Information:</strong>\nEmail: careers@way.com</p>\n<p><strong>Closing Date:</strong> 09, July 2025</p>",
        "tags": [
            "2+ Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "We are seeking a Junior QA Engineer with 2+ years of Java test automation experience. Proficiency in Selenium WebDriver and Rest Assured is expected."
    },
    {
        "job_title": "Lead React Native Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21594",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Lead React Native Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a Lead React Native Developer to lead the development and maintenance of our mobile applications. You will collaborate with cross-functional teams to deliver high-quality, scalable, and user-friendly mobile solutions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the development and implementation of mobile applications using React Native.</li>\n<li>Collaborate with cross-functional teams to gather and analyze project requirements.</li>\n<li>Previous ownership of app development projects is required.</li>\n<li>Develop automated tests to guarantee the product’s top-notch quality.</li>\n<li>Stay updated with the latest advancements and changes in mobile platforms and technologies.</li>\n<li>Provide technical supervision and support to mentor the team effectively.</li>\n<li>Conduct code reviews to ensure adherence to coding standards, best practices, and maintain code quality.</li>\n<li>Ensure the application is published and maintained in both the App Store and Google Play Store, adhering to their respective policies and guideline.</li>\n<li>Participate in agile development processes, including sprint planning, estimation, and retrospectives.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>10+ years of experience in React Native Development, Minimum 3 yrs in Lead role.</li>\n<li>Expert-level proficiency in JavaScript, TypeScript, and React Native framework.</li>\n<li>Demonstrated hands-on experience in designing and developing applications using React Native, iOS and Android platforms.</li>\n<li>Capability to plan the core architecture and iteratively enhance it as needed.</li>\n<li>Strong analytical mindset to extract actionable insights from data.</li>\n<li>Excellent Team management and communication skills.</li>\n<li>Experience with RESTful APIs and integration of third-party libraries and APIs.</li>\n<li>Possess a comprehensive understanding of React Native.</li>\n<li>Capable of understanding the company’s business needs and adjusting or innovating the product accordingly.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 11, July 2025</p>",
        "tags": [
            "10+ Years",
            "React Native",
            "JavaScript",
            "TypeScript"
        ],
        "summary": "Techversant Infotech is hiring a Lead React Native Developer to develop and maintain mobile applications. The role involves leading development, mentoring teams, and ensuring code quality."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21593",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p><strong>Way.Com India Pvt Ltd</strong> is looking for a goal-oriented Business Development Manager to become a key part of our high-energy sales team. If you excel in dynamic environments, have a knack for relationship building, and are passionate about driving revenue through strategic multi-channel outreach—including calls, emails, and digital engagement—this opportunity is for you.</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Enter a world of innovation and limitless possibilities.</li>\n<li>Be part of something meaningful – Join a vibrant, collaborative team that thrives on innovation and is constantly pushing the limits.</li>\n<li>Get rewarded competitively – We offer a robust compensation and benefits package that recognizes your contributions and success.</li>\n<li>Advance your career – We invest in your professional journey through ongoing learning and development opportunities.</li>\n<li>Create real-world impact – Contribute to groundbreaking projects that shape the future of mobility and improve everyday lives.</li>\n</ul>\n<p><strong>Key Responsibilities</strong></p>\n<p>As a Business Development Manager, you will:</p>\n<ul>\n<li>Proactively seek out and engage with potential clients via outbound calls, emails, and social platforms to qualify new business opportunities.</li>\n<li>Deliver engaging product presentations, effectively communicating the value and benefits of our offerings to prospective customers.</li>\n<li>Keep customer data updated and accurate in the CRM system, ensuring timely follow-ups and strong pipeline management.</li>\n<li>Consistently achieve or exceed sales goals and performance metrics, contributing directly to business growth.</li>\n<li>Build and nurture lasting relationships with existing clients, encouraging repeat business and referrals.</li>\n<li>Prepare detailed sales reports and forecasts for the leadership team to support strategic planning and decision-making.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications</strong></p>\n<ul>\n<li>Proven experience in B2B sales, with a strong track record of achieving targets.</li>\n<li>5–8 years of sales experience; prior experience in the e-commerce sector is highly desirable.</li>\n<li>Exceptional written and verbal communication skills.</li>\n<li>Strong negotiation and relationship-building abilities.</li>\n<li>Self-motivated, goal-oriented, and capable of working independently with minimal supervision.</li>\n<li>Proficient in using CRM software (e.g., Zoho) and the Microsoft Office Suite.</li>\n<li>Resilient in the face of rejection, with the ability to maintain a positive attitude.</li>\n<li>A Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Way.Com India Pvt Ltd\n4th Floor, Yamuna, Technopark Phase-III,\nThiruvananthapuram, 695583\nWebsite: http://www.way.com\nContact Email: careers@way.com</p>",
        "tags": [
            "5-8 Years",
            "B2B Sales",
            "CRM Software",
            "E-commerce"
        ],
        "summary": "Way.Com is seeking a Business Development Manager to drive revenue through multi-channel outreach and build lasting client relationships. The role involves achieving sales goals, presenting products, and managing client data."
    },
    {
        "job_title": "Lead UX Engineer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21592",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Lead UX Engineer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a highly skilled and experienced Lead UX Engineer to guide the design and development of user-centric digital experiences. In this leadership role, you will collaborate with product managers, UX/UI designers, and engineering teams, ensuring the successful integration of design and technology. You will set the direction for user experience strategies and mentor a growing team of UX engineers.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the end-to-end UX design process for web and mobile applications.</li>\n<li>Conduct user research, interviews, journey mapping, and storyboarding to understand user needs and behavior.</li>\n<li>Develop and implement information architecture, wireframes, and prototypes to visualize design concepts.</li>\n<li>Create and maintain design systems to ensure consistency across platforms.</li>\n<li>Work collaboratively with product managers, developers, and other stakeholders to align design solutions with business goals.</li>\n<li>Utilize design thinking methodologies to solve complex user experience challenges.</li>\n<li>Ensure accessibility, usability, and UX best practices are integrated into designs.</li>\n<li>Drive innovation by staying up to date with the latest UX/UI trends, tools, and technologies.</li>\n<li>Effectively communicate design ideas and decisions through presentations and documentation.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>7+ years of experience in User Experience Design for enterprise applications.</li>\n<li>Strong knowledge of web and mobile UX principles and best practices.</li>\n<li>Advanced skills in user research, wireframing, prototyping, and usability testing.</li>\n<li>Proficiency in building and managing design systems.</li>\n<li>Highly creative and inquisitive, with the ability to multitask effectively.</li>\n<li>Strong verbal and written communication skills.</li>\n<li>Expertise in interaction design and user interface building.</li>\n<li>Certified Usability Expert (HFI) or equivalent certification is a plus.</li>\n<li>Experience in a fast-paced software development environment with the ability to meet aggressive deadlines</li>\n</ul>\n<p><strong>Technical Proficiency:</strong></p>\n<p>The ideal candidate should have hands-on experience with design tools like Adobe CS5 Suite (XD, Photoshop, Illustrator), Figma, InVision, Axure RP, Balsamiq, OmniGraffle, and Sketch. A strong understanding of front-end technologies such as HTML, CSS, Bootstrap, and modern front-end frameworks is required.</p>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options.</li>\n<li>Long-term growth opportunities.</li>\n<li>Fun family environment.</li>\n<li>Various internal employee rewards programs.</li>\n<li>Opportunities for various other Bonus programs.</li>\n<li>Work-life Balance - flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@techversantinfotech.com</li>\n<li><strong>Website:</strong> http://www.techversantinfotech.com</li>\n<li><strong>Address:</strong> Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581</li>\n</ul>",
        "tags": [
            "7+ Years",
            "UX Design",
            "Figma",
            "User Research"
        ],
        "summary": "Techversant Infotech is seeking a Lead UX Engineer to guide user-centric design. The role involves leading UX design, user research, and collaboration with development teams."
    },
    {
        "job_title": "Senior iOS Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21591",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Senior iOS Developer</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583</p>\n<p><strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a></p>\n<p><strong>Closing Date:</strong> 09, July 2025</p>\n<p><strong>Job Published:</strong> 07, July 2025</p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain robust iOS applications using <strong>Swift</strong>, <strong>Objective-C</strong>, and <strong>SwiftUI</strong>.</li>\n<li>Architect scalable and maintainable solutions leveraging <strong>MVVM</strong> and <strong>MVC</strong> design patterns.</li>\n<li>Apply <strong>SOLID principles</strong> to ensure clean code structure and maintainable architecture.</li>\n<li>Optimize application performance through efficient memory usage and advanced multithreading techniques.</li>\n<li>Build adaptive and responsive user interfaces using <strong>Auto Layout</strong> for consistency across all iOS devices.</li>\n<li>Integrate and manage push notification services to deliver timely, personalized alerts to users.</li>\n<li>Implement deep linking capabilities to support seamless navigation between in-app content and external sources.</li>\n<li>Perform thorough code reviews, uphold high coding standards, and provide mentorship to junior developers.</li>\n<li>Develop and maintain unit tests to ensure application reliability and stability.</li>\n<li>Utilize <strong>Core Location</strong> and <strong>Apple Maps</strong> frameworks to create intuitive, location-aware features.</li>\n<li>Integrate <strong>Firebase</strong> for real-time data synchronization, crash analytics, and performance tracking.</li>\n<li>Ensure compliance with App Store guidelines and manage the entire submission, review, and release lifecycle.</li>\n<li>Collaborate effectively with product managers, designers, and backend teams to deliver feature-rich, high-quality apps.</li>\n<li>Maintain a streamlined development process using version control tools such as <strong>Git</strong>.</li>\n</ul>\n<h3>Required Qualifications:</h3>\n<ul>\n<li>Minimum of <strong>5 years of hands-on experience</strong> in <strong>iOS application development</strong>.</li>\n<li>Strong proficiency in <strong>Swift</strong> and <strong>Objective-C</strong>, with the ability to write clean, efficient, and maintainable code.</li>\n<li>In-depth understanding and practical experience with architectural patterns such as <strong>MVVM</strong> and <strong>MVC</strong>.</li>\n<li>Proven ability to apply <strong>SOLID principles</strong> to build scalable, modular, and testable codebases.</li>\n<li>Strong knowledge of <strong>memory management</strong> and <strong>multithreading</strong> for optimal application performance.</li>\n<li>Extensive experience in building user interfaces using <strong>SwiftUI</strong>, <strong>Auto Layout</strong>, and creating responsive, adaptive UIs.</li>\n<li>Proficient in implementing <strong>Push Notification frameworks</strong> and enabling <strong>deep linking</strong> to enhance user engagement and navigation.</li>\n<li>Hands-on experience with version control systems, particularly <strong>Git</strong>, for collaborative development and release workflows.</li>\n<li>Demonstrated ability to conduct thorough <strong>code reviews</strong> to ensure adherence to coding standards and best practices.</li>\n<li>Skilled in writing and maintaining <strong>unit tests</strong> to support application stability, performance, and reliability.</li>\n<li>Practical experience with <strong>Apple Maps</strong>, <strong>Core Location</strong>, and building location-based services.</li>\n<li>Familiarity with <strong>Firebase</strong>, including integration of analytics, crash reporting, and real-time data features.</li>\n<li>Solid understanding of <strong>App Store guidelines</strong> and experience managing the app submission and review process.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience with <strong>Continuous Integration/Continuous Deployment (CI/CD)</strong> pipelines and tools.</li>\n<li>Working knowledge of <strong>Agile development methodologies</strong> and collaborative team practices.</li>\n<li>Strong analytical and problem-solving skills, with the ability to work independently and within a team.</li>\n<li>Experience in performance tuning and optimization of iOS applications for improved efficiency and user experience.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Swift",
            "Objective-C",
            "Firebase"
        ],
        "summary": "We are seeking a Senior iOS Developer with extensive experience in Swift and Objective-C. The role involves designing, developing, and maintaining high-quality iOS applications."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21590",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p>Way Dot Com (P) Ltd\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583</p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 09, July 2025\n<strong>Job Published:</strong> 07, July 2025</p>\n<h3>Brief Description</h3>\n<p><strong>Key Technical Expertise:</strong></p>\n<ul>\n<li>Strong proficiency in Java programming language</li>\n<li>Extensive experience with the Spring Boot framework</li>\n<li>Skilled in managing and optimizing MySQL databases</li>\n<li>Proficient in designing and developing RESTful APIs</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain scalable and high-performing Java applications using the <strong>Spring Boot</strong> framework.</li>\n<li>Collaborate closely with Product Owners, Solution Architects, and cross-functional teams to translate business requirements into effective technical solutions.</li>\n<li>Create and integrate <strong>RESTful APIs</strong> to facilitate efficient system communication and enhance application capabilities.</li>\n<li>Continuously refactor and improve existing codebases to optimize performance, scalability, and long-term maintainability.</li>\n<li>Perform detailed code reviews, uphold best coding practices, and mentor junior developers to foster professional growth within the team.</li>\n<li>Stay updated with the latest tools, technologies, and best practices within the Java ecosystem to drive innovation and efficiency.</li>\n<li>Identify and troubleshoot complex software issues to ensure system reliability and a seamless end-user experience.</li>\n<li>Follow established development methodologies, coding standards, and company guidelines to deliver high-quality software solutions.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Innovative Projects: Work on cutting-edge technology solutions that make a real-world impact.</li>\n<li>Collaborative Culture: Join a team that values knowledge-sharing, mentorship, and continuous improvement.</li>\n<li>Career Growth: Take advantage of ample learning opportunities, structured growth paths, and leadership development.</li>\n<li>Recognition &amp; Rewards: Be part of an organization that values your contributions and celebrates your successes.</li>\n<li>Stability &amp; Vision: Join a future-focused company backed by a strong leadership team and a clear long-term vision.</li>\n<li>Be part of something meaningful—grow your career while helping us build world-class software solutions.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent professional experience).</li>\n<li>Minimum of <strong>5+ years</strong> of professional experience in <strong>Java development</strong>, with strong hands-on expertise in <strong>Spring Boot</strong> and <strong>MySQL</strong>.</li>\n<li>In-depth understanding of <strong>Java SE</strong> and <strong>Java EE</strong> concepts, including multithreading, design patterns, and JVM internals.</li>\n<li>Proven experience in <strong>RESTful API</strong> design, development, and integration.</li>\n<li>Proficient in working with <strong>MySQL</strong> or other relational databases, with the ability to write and optimize complex SQL queries.</li>\n<li>Hands-on experience with version control systems, particularly <strong>Git</strong>.</li>\n<li>Familiarity with <strong>Agile methodologies</strong> (e.g., Scrum, Kanban) and experience working in Agile development environments.</li>\n<li>Strong problem-solving, debugging, and analytical skills, capable of addressing complex technical challenges.</li>\n<li>Excellent written and verbal communication skills with the ability to thrive in a collaborative, team-oriented environment.</li>\n<li>Demonstrated ability to mentor junior developers and contribute technical leadership to development teams.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience working with <strong>microservices architecture</strong> and <strong>Docker</strong> containerization.</li>\n<li>Working knowledge of <strong>cloud platforms</strong>, such as <strong>AWS</strong> or <strong>Microsoft Azure</strong>.</li>\n<li>Familiarity with <strong>CI/CD pipelines</strong> and automation tools (e.g., Jenkins, GitLab CI).</li>\n<li>Experience with <strong>unit testing frameworks</strong>, such as <strong>JUnit</strong> or <strong>TestNG</strong>.</li>\n<li>Proven track record of building scalable, high-performance applications in production-grade environments.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Seeking a Senior Java Developer to design and maintain scalable applications using Spring Boot and MySQL. The role involves API integration, code reviews, and team mentorship."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21589",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Senior AI/ML Engineer to develop and drive new business opportunities internationally. The ideal candidate will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. They offer expertise and consultation in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence, etc.</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.</li>\n<li>Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs) and diffusion models for a range of use cases involving text, code, and multi-modal data.</li>\n<li>Build Scalable Recommendation Engines: Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.</li>\n<li>Cloud-Native ML Engineering: Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.</li>\n<li>End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.</li>\n<li>Collaborate Across Functions: Work with cross-functional teams including product managers, engineers, and data scientists to translate business goals into AI-powered solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 4 years of experience in building and deploying production-level ML/DL systems.</li>\n<li>Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders.</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Strong understanding of transformer architectures and deep learning model design.</li>\n<li>Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution.</li>\n<li>Expertise in Python programming with a focus on:<ul>\n<li>Code optimization and profiling</li>\n<li>Multi-threading and multiprocessing</li>\n<li>Object-oriented programming and design principles</li>\n</ul>\n</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices.</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Technical Stack:</strong></p>\n<ul>\n<li>Languages: Excellent understanding of object-oriented concepts and Python.</li>\n<li>ML/DL Frameworks:<ul>\n<li>Machine Learning: Scikit-learn, XGBoost, LightGBM</li>\n<li>Deep Learning: PyTorch, TensorFlow, Keras</li>\n<li>GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework</li>\n</ul>\n</li>\n<li>Cloud &amp; MLOps: AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes</li>\n<li>Data &amp; Compute: Apache Spark, BigQuery, RabbitMQ, S3, EC2</li>\n<li>Embedding Stores &amp; Vector Search: FAISS, Pinecone, ChromaDB</li>\n<li>Orchestration &amp; APIs: Apache Airflow, Docker Deployment, and FastAPI are a must</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with multi-modal models combining text, vision, or audio</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct)</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure)</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field</li>\n<li>Equivalent practical experience in developing scalable AI solutions will also be considered</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> careers@techversantinfotech.com</li>\n<li><strong>Website:</strong> http://www.techversantinfotech.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 07, July 2025</p>\n<p><strong>Location:</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581</p>",
        "tags": [
            "4+ Years",
            "Python",
            "ML/DL Systems",
            "Generative AI"
        ],
        "summary": "Techversant is hiring a Senior AI/ML Engineer to develop AI solutions and drive new business. The role involves building and deploying machine learning systems and collaborating with cross-functional teams."
    },
    {
        "job_title": "Senior Android Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21588",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Senior Android Developer</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p>Way Dot Com (P) Ltd\n4th Floor, Yamuna, Technopark Phase-III,\nThiruvananthapuram, 695583\nhttp://www.way.com</p>\n<p><strong>Closing Date:</strong> 09, July 2025\n<strong>Job Published:</strong> 07, July 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain high-quality Android applications using <strong>Kotlin</strong> and <strong>Jetpack Compose</strong>.</li>\n<li>Collaborate closely with cross-functional teams to conceptualize, design, and deliver innovative features.</li>\n<li>Ensure seamless performance and reliability of applications across a diverse range of Android devices.</li>\n<li>Continuously optimize application speed, scalability, and overall resource utilization.</li>\n<li>Stay current with emerging tools, frameworks, and industry best practices in Android development.</li>\n<li>Write clean, structured, and testable code that aligns with modern Android development standards.</li>\n<li>Guide and mentor junior developers, fostering a culture of learning, collaboration, and technical excellence.</li>\n<li>Proactively identify, analyze, and resolve complex bugs and performance issues to maintain a smooth user experience.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li><strong>Innovative Culture:</strong> Work in an environment that encourages creativity, experimentation, and continuous learning.</li>\n<li><strong>Modern Tech Stack:</strong> Build with the latest technologies like Kotlin and Jetpack Compose, and stay ahead in the fast-evolving Android ecosystem.</li>\n<li><strong>Collaborative Team:</strong> Be part of a passionate and supportive team that values knowledge sharing and growth.</li>\n<li><strong>Impactful Work:</strong> Contribute to projects that reach and influence thousands of users across varied Android platforms.</li>\n<li><strong>Growth Opportunities:</strong> Enjoy access to mentorship and learning resources, to help you advance in your role.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Minimum <strong>5 years of professional experience</strong> in Android application development.</li>\n<li>Proficiency in Kotlin, with practical expertise in <strong>Jetpack Compose</strong> for building modern UIs.</li>\n<li>Strong understanding of <strong>Android architecture components</strong> including <strong>ViewModel</strong>, <strong>LiveData</strong>, <strong>Room</strong>, etc.</li>\n<li>Proven experience in integrating and consuming <strong>RESTful APIs</strong> and utilizing <strong>third-party libraries</strong> effectively.</li>\n<li>Solid grasp of <strong>UI/UX design principles</strong> and <strong>Material Design</strong> guidelines, with the ability to create intuitive and responsive user interfaces.</li>\n<li>Proficient in using <strong>Android Studio</strong>, <strong>Gradle</strong>, and related development tools.</li>\n<li>Experience with <strong>unit testing</strong> and familiarity with frameworks such as <strong>JUnit</strong> and <strong>Mockito</strong>.</li>\n<li>Knowledge of <strong>CI/CD pipelines</strong> and experience with <strong>version control systems</strong>, particularly <strong>Git</strong>.</li>\n<li>Demonstrated <strong>problem-solving abilities</strong> and the capability to work independently as well as collaboratively in a team environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Hands-on experience with <strong>Kotlin Coroutines</strong> and <strong>Flows</strong> for managing asynchronous tasks.</li>\n<li>Familiarity with <strong>Android Jetpack libraries</strong> such as <strong>Navigation</strong>, <strong>Paging</strong>, and <strong>WorkManager</strong>.</li>\n<li>Experience with <strong>Firebase</strong> or other cloud-based backend services.</li>\n<li>Exposure to <strong>Kotlin Multiplatform Mobile (KMM)</strong> or experience in developing <strong>cross-platform applications</strong>.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Kotlin",
            "Jetpack Compose",
            "Android Architecture Components"
        ],
        "summary": "We are looking for a Senior Android Developer to design, develop, and maintain high-quality Android applications using Kotlin and Jetpack Compose. You will collaborate with cross-functional teams to deliver innovative features."
    },
    {
        "job_title": "SEO And Digital Marketing Specialist",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/21587",
        "location": "Technopark",
        "closing_date": "23 Jul 2025",
        "job_description": "<h2>SEO And Digital Marketing Specialist</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong>\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala\nIndia, 695 581\n<a href=\"http://www.prayananimation.com\">http://www.prayananimation.com</a></p>\n<p><strong>Brief Description:</strong>\nAt Vinu’s Tattoo Studio, we’re not just about ink — we’re about art, stories, and identity. As one of the most creative and fast-growing tattoo studios in Kerala, we’re seeking a passionate SEO &amp; Digital Marketing Specialist to take our digital presence to the next level. If you're a results-driven digital marketer with a creative edge and a love for unique brands, this is your chance to work in a vibrant and artistic environment.</p>\n<p><strong>Key Responsibilities:</strong>\n- Perform keyword research and competitor analysis tailored to the tattoo and lifestyle industry.\n- Implement on-page SEO strategies including meta tags, structured data, headings, image optimization, and internal linking.\n- Conduct technical SEO audits to ensure fast loading speeds, mobile optimization, and proper site indexing.\n- Create and maintain a strong content strategy, including blog posts, tattoo care guides, artist portfolios, and service pages.\n- Build high-quality backlinks and manage off-page SEO to improve visibility and authority.\n- Manage and optimize our social media channels to increase visibility and engagement.\n- Improve website conversion rates through layout optimization and A/B testing.\n- Assist with visual content creation using tools like Canva, Photoshop, or Illustrator.\n- Capture and edit video content from tattoo sessions, events, and studio life to enhance social media and YouTube presence.\n- Stay updated on SEO and digital trends, especially those relevant to creative and personal services.\n- Collaborate with tattoo artists, photographers, and content creators to align visual and written content with SEO goals.\n- Optimize website layout and content for conversion rate improvement and user engagement.\n- Assist in managing social media channels, ensuring content is on-brand, engaging, and SEO-aligned.\n- Graphic design skills are a plus – you may support with creating eye-catching social media creatives, website banners, or promotional material.</p>\n<p><strong>Requirements:</strong>\n- Minimum 1 years of proven experience in SEO and digital marketing.\n- Strong creative and analytical skills.\n- Experience in the tattoo, beauty, art, or lifestyle industry is a major plus.\n- Basic proficiency in graphic design tools like Photoshop, Illustrator, Canva, etc., is highly desirable.\n- Excellent communication skills and the ability to work both independently and collaboratively.</p>\n<p><strong>How to Apply:</strong>\nTo join our growing creative team, please send your resume and a link to your portfolio or previous digital marketing work to:\n📧 vinutattootvm@gmail.com\n📞 8848776316</p>\n<p>Email Subject: Resume – “SEO and Digital Marketing Specialist – Vinu’s Tattoo Studio”</p>\n<p><strong>Closing Date:</strong> 23, July 2025\n<strong>Job Published:</strong> 07, July 2025</p>",
        "tags": [
            "1+ Years",
            "SEO",
            "Digital Marketing",
            "Social Media"
        ],
        "summary": "Vinu's Tattoo Studio is seeking an SEO & Digital Marketing Specialist to elevate their online presence. The role involves SEO implementation, content strategy, and social media management."
    },
    {
        "job_title": "Software Engineer - AI/ML",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21586",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>AI/ML Software Engineer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced AI/ML Engineer to develop AI/ML solutions and drive new business opportunities internationally. The role involves designing, developing, and implementing AI/ML solutions based on deep learning, reinforcement learning, computer vision, NLP, and generative AI models.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop AI/ML Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and Generative AI models.</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Develop proofs of concept AI/ML based solutions and services and demonstrate them to Business.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Implement and deploy AI/ML solutions using various models (CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest, etc.).</li>\n<li>Specialize in at least one AI/ML stack, frameworks, and tools like MxNET and Tensorflow.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</li>\n<li>3+ years of relevant experience in AI/ML projects</li>\n<li>Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).</li>\n<li>Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g., Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g., Tensorflow, Pytorch).</li>\n<li>Experience in RDBMS, NoSQL, Big Data stores like Elastic, Cassandra, Hbase, Hive, HDFS, and Big Data technologies like Kafka, Apache Spark is a plus.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Knowledge in data visualization tools (Tableau, Power BI, etc.) and SQL.</li>\n<li>Excellent understanding of object-oriented concepts and Python.</li>\n<li>Experience in NLP models like BERT, Transformer architectures, etc.</li>\n<li>Experience in leveraging Computer Vision and OCR in document extraction use cases.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience in production software engineering routines (e.g., Continuous Integration/Continuous Deployment).</li>\n<li>Experiences in cloud-based solutions (e.g., AWS, Azure, GCP).</li>\n<li>Experience working using Agile-based principles and tools.</li>\n<li>Familiarity with working on large data sets and distributed computing (e.g., Hive, Spark, Kafka, Airflow, Scala).</li>\n<li>Certification in any of the available cloud-based AI/ML technologies is a plus.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to the business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities, etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Company:</strong> Techversant Infotech (P) Ltd</li>\n<li><strong>Address:</strong> Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581</li>\n<li><strong>Website:</strong> http://www.techversantinfotech.com</li>\n<li><strong>Contact Email:</strong> careers@techversantinfotech.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 07, July 2025</p>",
        "tags": [
            "3+ Years",
            "AI/ML",
            "Python",
            "Tensorflow"
        ],
        "summary": "Techversant Infotech is looking for an AI/ML Engineer to develop AI/ML solutions. The role involves designing and implementing machine learning models and collaborating with cross-functional teams."
    },
    {
        "job_title": "AI/ML – Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21585",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>AI/ML Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a highly skilled and experienced AI/ML Lead to lead the design and implementation of our artificial intelligence and machine learning solutions. The successful candidate will work closely with cross-functional teams to understand business requirements and develop scalable, efficient, and robust AI/ML systems.</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p>Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption. We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Build Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and generative models.</li>\n<li>Define, design, and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Create demos and proofs of concept, develop AI/ML-based products and services.</li>\n<li>Creating Functional and technical specifications for AI &amp; ML solutions.</li>\n<li>Follow SDLC process</li>\n<li>Advanced analytical knowledge of data and data conditioning</li>\n<li>Programming advanced computing and developing algorithms</li>\n<li>Developing software, data models, and executing predictive analysis</li>\n<li>Design, develop, and implement generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n</ul>\n<p><strong>Skills and Experience:</strong></p>\n<ul>\n<li>Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).</li>\n<li>Strong proficiency in SQL, NO SQL Databases.</li>\n<li>Experience in implementing and deploying AI\\ Machine Learning solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)</li>\n<li>Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.</li>\n<li>Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g. Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience in production software engineering routines in DevOps/MLOps (e.g. Continuous Code Integration and Deployment).</li>\n<li>Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</li>\n</ul>\n<p><strong>Experience and Qualification:</strong></p>\n<ul>\n<li>B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 07, July 2025</p>\n<p><strong>Company Information:</strong>\nTechversant Infotech (P) Ltd\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "3+ Years",
            "Python",
            "AI/ML",
            "Deep Learning"
        ],
        "summary": "Techversant Infotech is seeking an AI/ML Team Lead to design and implement AI/ML solutions. The role involves developing and deploying AI/ML models and collaborating with cross-functional teams."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Kawika Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21584",
        "location": "Technopark",
        "closing_date": "05 Aug 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Kawika Technologies (P) Ltd</strong>\nACE 20, 5th Floor, CDAC Building, Technopark, 695581\nhttp://www.kawikatechnologies.com</p>\n<p><strong>Contact Email:</strong> hr@kawikatechnologies.com</p>\n<p><strong>Brief Description:</strong>\n- Identify and generate new business opportunities through research and networking.\n- Build and maintain strong relationships with international clients.\n- Develop strategies to expand business in global markets.\n- Manage the complete sales cycle, from lead generation to closure.\n- Collaborate with internal teams to align offerings with client needs.\n- Maintain accurate records of business development activities and sales forecasts.</p>\n<p><strong>Preferred Skills:</strong>\n- Experience: 0-1 years in a service-based IT company.\n- Proven track record in handling international clients.\n- Excellent English communication skills, both verbal and written.\n- Strong understanding of IT services and global business dynamics.\n- Exceptional interpersonal and negotiation skills.</p>\n<p><strong>Closing Date:</strong> 05, Aug 2025\n<strong>Job Published:</strong> 07, July 2025</p>",
        "tags": [
            "0-1 Years",
            "International Clients",
            "Business Development",
            "IT Services"
        ],
        "summary": "Seeking a Business Development Executive to identify opportunities, build client relationships, and expand business in global markets. The role involves managing sales cycles and collaborating with internal teams."
    },
    {
        "job_title": "Flutter Developer",
        "company": "Kawika Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21583",
        "location": "Technopark",
        "closing_date": "05 Aug 2025",
        "job_description": "<h2>Flutter Developer</h2>\n<p><strong>Kawika Technologies (P) Ltd</strong>\nACE 20, 5th Floor, CDAC Building, Technopark, 695581\nhttp://www.kawikatechnologies.com</p>\n<p><strong>Closing Date:</strong> 05, Aug 2025\n<strong>Job Published:</strong> 07, July 2025\n<strong>Contact Email:</strong> hr@kawikatechnologies.com</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a talented Flutter Developer to join our dynamic team. In this role, you will be responsible for designing and building applications for mobile platforms. You will work closely with cross-functional teams to define, design, and ship new features.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain mobile applications using Flutter.</li>\n<li>Collaborate with UI/UX designers to implement beautiful and responsive interfaces.</li>\n<li>Write clean, maintainable, and efficient code.</li>\n<li>Troubleshoot and debug applications.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Proven knowledge with Flutter and Dart.</li>\n<li>Strong understanding of mobile app development principles.</li>\n<li>Familiarity with RESTful APIs and third-party libraries.</li>\n<li>Knowledge with version control (Git).</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>1+ years of experience.</li>\n<li>Knowledge of native development (Android/iOS) is a plus.</li>\n<li>Understanding of CI/CD processes.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Flutter",
            "Dart",
            "RESTful APIs"
        ],
        "summary": "Kawika Technologies is looking for a Flutter Developer to design and build mobile applications. The role involves collaborating with teams and writing efficient code."
    },
    {
        "job_title": "SEO Specialist",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/21582",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>SEO Specialist</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong>\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala\nIndia, 695 581\n<a href=\"http://www.prayananimation.com\">http://www.prayananimation.com</a></p>\n<p><strong>Contact Email:</strong> vinutattootvm@gmail.com</p>\n<p><strong>Brief Description:</strong>\nAt Vinu’s Tattoo Studio, we’re not just about ink — we’re about art, stories, and identity. As one of the most creative and fast-growing tattoo studios in Kerala, we’re seeking a passionate SEO &amp; Digital Marketing Specialist to take our digital presence to the next level. If you're a results-driven digital marketer with a creative edge and a love for unique brands, this is your chance to work in a vibrant and artistic environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Perform keyword research and competitor analysis tailored to the tattoo and lifestyle industry.</li>\n<li>Implement on-page SEO strategies including meta tags, structured data, headings, image optimization, and internal linking.</li>\n<li>Conduct technical SEO audits to ensure fast loading speeds, mobile optimization, and proper site indexing.</li>\n<li>Create and maintain a strong content strategy, including blog posts, tattoo care guides, artist portfolios, and service pages.</li>\n<li>Build high-quality backlinks and manage off-page SEO to improve visibility and authority.</li>\n<li>Manage and optimize our social media channels to increase visibility and engagement.</li>\n<li>Improve website conversion rates through layout optimization and A/B testing.</li>\n<li>Assist with visual content creation using tools like Canva, Photoshop, or Illustrator.</li>\n<li>Capture and edit video content from tattoo sessions, events, and studio life to enhance social media and YouTube presence.</li>\n<li>Stay updated on SEO and digital trends, especially those relevant to creative and personal services.</li>\n<li>Collaborate with tattoo artists, photographers, and content creators to align visual and written content with SEO goals.</li>\n<li>Optimize website layout and content for conversion rate improvement and user engagement.</li>\n<li>Assist in managing social media channels, ensuring content is on-brand, engaging, and SEO-aligned.</li>\n<li>Graphic design skills are a plus – you may support with creating eye-catching social media creatives, website banners, or promotional material.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Minimum 1 years of proven experience in SEO and digital marketing.</li>\n<li>Strong creative and analytical skills.</li>\n<li>Experience in the tattoo, beauty, art, or lifestyle industry is a major plus.</li>\n<li>Basic proficiency in graphic design tools like Photoshop, Illustrator, Canva, etc., is highly desirable.</li>\n<li>Excellent communication skills and the ability to work both independently and collaboratively.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>To join our growing creative team, please send your resume and a link to your portfolio or previous digital marketing work to:\n📧 vinutattootvm@gmail.com\n📞 8848776316</p>\n<p>Email Subject: Resume – “SEO Specialist – Vinu’s Tattoo Studio”</p>\n<p>Closing Date: 21, July 2025\nJob Published: 07, July 2025</p>",
        "tags": [
            "1+ Years",
            "SEO",
            "Digital Marketing",
            "Social Media"
        ],
        "summary": "Vinu's Tattoo Studio seeks an SEO & Digital Marketing Specialist to enhance their online presence. Responsibilities include SEO strategies, content creation, and social media management to boost engagement."
    }
]