[
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21972/312",
        "location": "Infopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p><strong>Company:</strong> 2Base Technologies</p>\n<p>We are seeking a high-performing, self-driven <strong>Senior Business Development Executive</strong> to join our team. In this role, you will drive revenue by generating leads, building client relationships, and managing the full sales cycle for IT services and digital solutions. If you thrive in a consultative sales environment with a passion for technology and business growth, this is your opportunity!</p>\n<p><strong>Responsibilities</strong>\n- Identify and generate qualified leads via outbound channels, referrals, and market research.\n- Drive new business opportunities for web, mobile, and enterprise software development services.\n- Manage the complete sales cycle: lead qualification, client communication, requirement analysis, proposal preparation, pricing, negotiation, and closure.\n- Propose tailored IT/digital transformation solutions aligned with client business objectives.\n- Build relationships with Founders, CXOs, and Product Owners.\n- Collaborate with delivery, design, and marketing teams to craft proposals and presentations.\n- Maintain CRM records and provide sales forecasts/reports.\n- Represent the company at networking events and client meetings.\n- Meet/exceed monthly/quarterly revenue targets.</p>\n<p><strong>Requirements</strong>\n- Bachelor’s degree or equivalent in education/experience (BSc IT/CS, BCA, B-Tech IT/CS/EC, MBA, CS/IT Diploma).\n- <strong>2-5 years</strong> of B2B sales experience in IT/digital solutions.\n- Proven ability to manage sales pipelines and close deals independently.\n- Strong knowledge of software development services (web/mobile apps, SaaS, enterprise solutions).\n- Experience with international clients preferred.\n- Proficiency in CRM tools (Zoho, HubSpot, Salesforce) and outbound sales tools (LinkedIn Sales Navigator).\n- Excellent communication, negotiation, and presentation skills.\n- Ability to work autonomously with ownership of sales targets.\n- Strategic thinking to address client pain points and position solutions.</p>\n<p><strong>Contact:</strong> Share your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-5 Years",
            "B2B Sales",
            "IT Services",
            "CRM Systems"
        ],
        "summary": "Senior Business Development Executive driving IT services sales, managing end-to-end sales cycle, and building client relationships. Requires 2-5 years B2B sales experience, CRM proficiency, and tech industry knowledge."
    },
    {
        "job_title": "Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21973/312",
        "location": "Infopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<p><strong>Business Analyst</strong></p>\n<p>The Business Analyst plays a key role in ensuring requirements are clearly understood, accurately documented, and traceable throughout the software development lifecycle. This role focuses on translating business and functional inputs into structured, standardized documentation that supports effective development, testing, and delivery. Working closely with business analysts, design teams, and technical stakeholders, the role ensures consistency, clarity, and alignment across all requirement artifacts.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Create Software Requirement Specifications (SRS) based on inputs from Core Business Analysts, stakeholder discussions, and requirement walkthroughs</li>\n<li>Prepare Business Requirement Documents (BRD) using approved templates while ensuring business intent and system behavior are clearly documented</li>\n<li>Participate in requirement discussions to understand business objectives, functional flows, dependencies, and assumptions before documentation</li>\n<li>Analyze requirements to identify gaps, ambiguities, and inconsistencies, and work with Core BAs to resolve them</li>\n<li>Document functional flows, business rules, and acceptance criteria where applicable to support development and QA teams</li>\n<li>Document wireframes, UI flows, validations, and UI specifications in collaboration with design and product teams</li>\n<li>Maintain change logs, version history, and document updates throughout the project lifecycle</li>\n<li>Create and manage traceability matrices linking business, functional, and technical requirements</li>\n<li>Maintain cross-references across BRD, SRS, UI, API, and related documentation</li>\n<li>Ensure documentation consistency, completeness, and alignment with approved scope and delivery timelines</li>\n<li>Ensure accurate and timely PMS updates with structured documentation details</li>\n<li>Support development, QA, UAT, and audit processes through clear, traceable, and up-to-date documentation</li>\n<li>Assist in requirement reviews, walkthroughs, and validation sessions with internal and client stakeholders</li>\n</ul>\n<h2>Requirements</h2>\n<h3>Required Skills and Experience</h3>\n<ul>\n<li>1 to 4 years of experience in Business Analysis documentation or related roles</li>\n<li>Strong experience in BRD and SRS creation</li>\n<li>Hands-on experience with documentation templates, standards, and version control</li>\n<li>Ability to document UI wireframes and functional flows clearly</li>\n<li>Working knowledge of APIs and system integrations for documentation purposes</li>\n<li>Experience with project management systems and documentation tools</li>\n<li>Strong attention to detail and ability to manage multiple documents in parallel</li>\n<li>Excellent written communication and stakeholder coordination skills</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field</li>\n<li>1 to 4 years of experience as a Business Analyst or Product Analyst</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong></p>",
        "tags": [
            "1-4 Years",
            "BRD/SRS Documentation",
            "UI Wireframes & Functional Flows",
            "APIs & System Integrations"
        ],
        "summary": "Translates business requirements into structured documentation for software development. Ensures clarity, traceability, and alignment across teams."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21974/312",
        "location": "Infopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Senior Business Analyst</h2>\n<p>At 2Base, we are rebuilding the Business Analyst function into a world-class, product-minded, clarity-driven team. This role is <strong>not</strong> a documentation role, <strong>not</strong> a screen updater role, and <strong>not</strong> a support role. This is a <strong>core Business Analyst</strong> position responsible for functional modeling, system reasoning, requirement clarity, and building the foundation for correct development.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.</li>\n<li>Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.</li>\n<li>Convert ambiguous client inputs into structured, logical, and actionable functional understanding.</li>\n<li>Break large features into modules, workflows, components, and clear dependencies.</li>\n<li>Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.</li>\n<li>Translate business processes into functional logic that development teams can execute.</li>\n<li>Decompose requirements into use-case flows, system behaviors, edge cases, alternate paths, validation rules, and dependencies.</li>\n<li>Prepare high-quality documentation, including BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API requirement specs, and acceptance criteria.</li>\n<li>Ensure all documentation is clear, logical, structured, testable, and ready for developers and QA to use.</li>\n<li>Collaborate closely with developers, architects, QA, and product owners to validate feasibility and align understanding.</li>\n<li>Ensure QA teams can derive test cases effectively from your functional logic and acceptance criteria.</li>\n<li>Communicate confidently with clients, handle requirement discussions smoothly, and clarify misunderstandings immediately.</li>\n<li>Push back politely on unclear or changing requirements and ensure final decisions are documented properly.</li>\n<li>Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover to development.</li>\n<li>Own the entire requirement lifecycle from discovery to development readiness with high accountability.</li>\n<li>Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>Minimum 4+ years</strong> of core Business Analyst experience with strong analytical and system-level thinking.</li>\n<li>Ability to break down complex requirements into clear components, workflows, and functional logic.</li>\n<li>Excellent verbal and written communication with confidence in client interactions and clarifications.</li>\n<li>Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria with high clarity.</li>\n<li>Ability to challenge assumptions politely, ask the right questions, and ensure zero ambiguity.</li>\n<li>Strong collaboration experience with development, QA, architects, and cross-functional teams.</li>\n<li>Understanding of API behaviors, integrations, data flows, and multi-module system interactions.</li>\n<li>Ability to run requirement discussions, workshops, and independently lead discovery sessions.</li>\n<li>Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.</li>\n<li>Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.</li>\n<li><strong>Not suitable for UI-only thinkers, passive communicators, template-based writers, or those relying on AI for answers.</strong></li>\n<li>Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, Business, or related field</li>\n<li>4 to 8 years of experience as a Business Analyst or Product Analyst</li>\n<li>Experience in SaaS or scalable product environments</li>\n<li>Exposure to AI/Automation, integrations, or multi-module systems</li>\n<li>Ability to run independent client workshops</li>\n<li>Must have independently handled requirement ownership for at least one full project lifecycle</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "SaaS",
            "APIs",
            "BRD/FRD/SRS"
        ],
        "summary": "Senior Business Analyst role at 2Base focuses on functional modeling, system reasoning, and requirement clarity. Drives cross-team alignment and ensures testable, developer-ready outputs with zero rework."
    },
    {
        "job_title": "Sr.DevSecOps Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21975/312",
        "location": "Infopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Senior DevSecOps Engineer</h2>\n<p>We are seeking a <strong>Senior DevSecOps Engineer</strong> to lead cybersecurity, infrastructure automation, and DevSecOps practices as we transition to a secure, scalable, and modern engineering environment. This role will strengthen 2Base’s security posture, modernize pipelines, and foster a secure-by-design culture.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define, implement, and enforce security standards, policies, and best practices across cloud and on-prem environments.</li>\n<li>Conduct security risk assessments, vulnerability scans, penetration testing, and mitigation plans.</li>\n<li>Architect and enhance secure CI/CD pipelines with automated compliance and governance checkpoints.</li>\n<li>Promote a \"Security First\" culture, ensuring secure design and development practices.</li>\n<li>Monitor, detect, investigate, and respond to security threats, incidents, breaches, and anomalies.</li>\n<li>Develop Infrastructure-as-Code practices using Terraform, Ansible, and automation frameworks.</li>\n<li>Design secure cloud architectures on AWS, Azure, or GCP for scalable, compliant deployments.</li>\n<li>Build and secure containerized environments with Docker and Kubernetes using enforced security baselines.</li>\n<li>Implement secure monitoring, logging, SIEM, and alerting systems for infrastructure and applications.</li>\n<li>Improve system reliability, scalability, performance, and fault tolerance across critical workloads.</li>\n<li>Mentor DevOps engineers in secure development, automation, and operational excellence.</li>\n<li>Lead technical strategy, tool selection, process improvements, and DevSecOps roadmap execution.</li>\n<li>Collaborate with BA, PM, and Engineering teams to align security, performance, and delivery goals.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>4–8 years in DevOps, Cloud, or Infrastructure engineering with security exposure.</li>\n<li>Hands-on CI/CD tools: Jenkins, GitLab CI, GitHub Actions.</li>\n<li>Strong expertise in AWS, Azure, or GCP with secure architecture focus.</li>\n<li>Proficiency in Infrastructure-as-Code (Terraform, Ansible).</li>\n<li>Experience securing Docker and Kubernetes environments.</li>\n<li>Networking knowledge: LAN/WAN, firewalls, VPN, load balancers.</li>\n<li>Familiarity with security frameworks (OWASP, NIST, CIS Benchmarks).</li>\n<li>Monitoring/logging tools: Prometheus, Grafana, ELK, CloudWatch, SIEM.</li>\n<li>Scripting skills: Python, Bash, Shell.</li>\n<li>Excellent troubleshooting, analytical, and problem-solving abilities.</li>\n<li>Strong communication and collaboration skills to influence engineering teams.</li>\n</ul>\n<p><strong>Contact</strong>: Email your resume to <a href=\"mailto:careers@2basetechnologies.com\">careers@2basetechnologies.com</a>.</p>",
        "tags": [
            "4–8 Years",
            "Terraform",
            "Ansible",
            "AWS"
        ],
        "summary": "Lead cybersecurity and DevSecOps practices, modernize secure pipelines, and mentor teams to ensure scalable, compliant infrastructure."
    },
    {
        "job_title": "Graphic Designer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21976/312",
        "location": "Infopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Graphic Designer</h2>\n<p>We are seeking a <strong>Creative Designer</strong> who demonstrates strong visual thinking, originality, and full ownership of their work. The ideal candidate will stay connected to marketing and design trends, think beyond briefs, and deliver high-quality visuals that enhance brand identity and audience engagement. You will collaborate with Marketing, Creative, and Development teams to produce impactful digital and offline design assets.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design engaging and high-quality creatives for branding, marketing, and promotional use</li>\n<li>Create marketing assets (brochures, flyers, posters, social media creatives, website visuals, presentations, email campaigns)</li>\n<li>Conceptualize ideas and translate them into clear visual communication</li>\n<li>Own design deliverables from concept to final output</li>\n<li>Ensure visual consistency across brand touchpoints using brand guidelines</li>\n<li>Manage multiple creative projects in parallel while meeting timelines</li>\n<li>Collaborate with Marketing teams, Creative Leads, and Project Managers on updates and revisions</li>\n<li>Stay updated on design, branding, marketing trends, and creative tools</li>\n<li>Use modern design tools to support ideation while maintaining originality and brand alignment</li>\n<li>Maintain organized design files, versions, and documentation</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Diploma or Bachelor’s Degree in Graphic Design, Visual Arts, or related field</li>\n<li><strong>2 to 4 years</strong> of professional experience in a creative or design role</li>\n<li>Strong proficiency in Adobe Photoshop, Illustrator, InDesign, Premiere Pro, and After Effects</li>\n<li>Working knowledge of MS Office tools (PowerPoint, Word)</li>\n<li>Basic understanding of HTML and CSS</li>\n<li>Strong typography skills and layout/design principles</li>\n<li>High attention to detail and visual judgment</li>\n<li>Strong verbal and written communication skills</li>\n</ul>\n<h3>Creativity, Ownership, and Mindset</h3>\n<ul>\n<li>Demonstrate quick, creative thinking and ownership of assigned work</li>\n<li>Self-discipline in reviewing work before submission</li>\n<li>Ability to accept feedback and iterate efficiently</li>\n<li>Confidence in presenting and explaining design concepts</li>\n<li>Willingness to think beyond briefs and suggest innovative ideas</li>\n</ul>\n<h3>Portfolio Requirement</h3>\n<ul>\n<li>A strong portfolio is mandatory, showcasing branding, marketing creatives, and originality</li>\n<li>Candidates must explain design intent, approach, and execution</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li><strong>2 to 4 years</strong> of relevant industry experience</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Growth-driven environment with opportunities to lead, innovate, and upskill</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <a href=\"mailto:careers@2basetechnologies.com\">careers@2basetechnologies.com</a></p>",
        "tags": [
            "2-4 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Adobe InDesign"
        ],
        "summary": "Creative Designer needed to create brand-aligned visuals and collaborate across teams. Requires 2-4 years of experience and expertise in Adobe design tools."
    },
    {
        "job_title": "Scrum Master (AI-Agile Facilitator)",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/21956/387",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Scrum Master (AI-Agile Facilitator)</h2>\n<p><strong>Work Mode:</strong> Remote\n<strong>Working Time:</strong> Qatar Time\n<strong>Notice Period:</strong> Immediate\n<strong>Work Type:</strong> 12 months extendable contract\n<strong>Experience:</strong> 8+ years</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Facilitates Agile delivery using <strong>Scrum</strong>, <strong>Kanban</strong>, or <strong>SAFe</strong> frameworks.</li>\n<li>Expertise in <strong>Jira/Confluence</strong> or <strong>Azure DevOps</strong>, specifically configuring dashboards for velocity tracking.</li>\n<li>Manages high-velocity, <strong>AI-assisted sprint execution</strong>.</li>\n<li>Adapts velocity tracking to <strong>AI-accelerated development models</strong>.</li>\n<li>Removes blockers related to <strong>AI usage</strong> and <strong>prompt quality</strong>.</li>\n<li>Ensures rapid stakeholder feedback and <strong>continuous validation</strong>.</li>\n</ul>\n<h3>Contact:</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@alignminds.com</strong>.</p>",
        "tags": [
            "8+ Years",
            "Jira/Confluence",
            "Azure DevOps",
            "AI"
        ],
        "summary": "Seeking a Scrum Master with 8+ years of experience to lead AI-assisted Agile sprints using Jira/Confluence or Azure DevOps. Requires expertise in velocity tracking and stakeholder feedback for high-velocity AI development."
    },
    {
        "job_title": "SharePoint Developer (AI-Augmented)",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/21957/387",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>SharePoint Developer (AI-Augmented)</strong></p>\n<p><strong>Work Mode:</strong> Remote\n<strong>Working Time:</strong> Qatar Time\n<strong>Notice Period:</strong> Immediate\n<strong>Work Type:</strong> 12 months extendable contract\n<strong>Experience:</strong> 3+ years</p>\n<ul>\n<li>Develops Microsoft 365 and SharePoint solutions using <strong>SPFx</strong> and <strong>React</strong></li>\n<li>Builds custom web parts, workflows, and document libraries</li>\n<li>Integrates SharePoint with external systems using <strong>Microsoft Graph APIs</strong></li>\n<li>Implements governance, permissions, and compliance controls</li>\n<li>Uses <strong>AI</strong> and <strong>Copilot</strong> to automate workflows, provisioning, and content classification</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@alignminds.com</strong>.</p>",
        "tags": [
            "3+ Years",
            "SPFx",
            "React",
            "Microsoft Graph APIs"
        ],
        "summary": "A SharePoint Developer role requiring 3+ years of experience to develop Microsoft 365 solutions using SPFx, React, and AI automation for workflow integration and governance."
    },
    {
        "job_title": "Oracle APEX Developer (AI-Enhanced)",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/21958/387",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Role Overview</h2>\n<p><strong>Oracle APEX Developer (AI-Enhanced)</strong></p>\n<p><strong>Work Mode:</strong> Remote\n<strong>Working Time:</strong> Qatar Time\n<strong>Notice Period:</strong> Immediate\n<strong>Work Type:</strong> 12 months extendable contract\n<strong>Experience:</strong> 3+ years</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develops data-centric Oracle APEX applications with strong SQL and PL/SQL logic</li>\n<li>Manages APEX workspaces, shared components, and UI theming</li>\n<li>Builds and consumes REST APIs using ORDS</li>\n<li>Implements security, authentication, and row-level data access</li>\n<li>Uses AI tools to design schemas, generate PL/SQL, refactor legacy code, and automate testing</li>\n</ul>\n<h3>Contact Information</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@alignminds.com</strong>.</p>",
        "tags": [
            "3+ Years",
            "Oracle APEX",
            "SQL/PL/SQL",
            "REST APIs"
        ],
        "summary": "Oracle APEX Developer (AI-Enhanced) with 3+ years experience in data-centric applications, REST APIs, and AI-driven code automation. Remote role in Qatar requiring immediate availability."
    },
    {
        "job_title": "Solution Architect (Technology-Agnostic)",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/21959/387",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Solution Architect (Technology-Agnostic)</h2>\n<p><strong>Work Mode:</strong> Remote\n<strong>Working Time:</strong> Qatar Time\n<strong>Notice Period:</strong> Immediate\n<strong>Work Type:</strong> 12 months extendable contract\n<strong>Experience:</strong> 8+ years</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Defines enterprise architecture across frontend, backend, and databases</li>\n<li>Establishes security, compliance, and identity standards</li>\n<li>Designs integration strategies across <strong>Oracle</strong>, <strong>React</strong>, <strong>SharePoint</strong>, and <strong>APIs</strong></li>\n<li>Oversees cloud and DevOps architecture across multi-cloud environments</li>\n<li>Sets AI governance, architectural guardrails, and toolchain standards</li>\n</ul>\n<h3>Contact</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@alignminds.com</strong>.</p>",
        "tags": [
            "8+ Years",
            "Oracle",
            "React",
            "SharePoint"
        ],
        "summary": "A Solution Architect with 8+ years of experience is needed to design enterprise architecture, integration strategies, and AI governance across multi-cloud environments."
    },
    {
        "job_title": "Full Stack Developer (AI-Enhanced)",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/21960/387",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Full Stack Developer (AI-Enhanced)</h2>\n<p><strong>Work Mode:</strong> Remote\n<strong>Working Time:</strong> Qatar Time\n<strong>Notice Period:</strong> Immediate\n<strong>Work Type:</strong> 12 months extendable contract\n<strong>Experience:</strong> 3+ years</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Builds modern web applications using <strong>React</strong>, <strong>TypeScript</strong>, and <strong>Next.js</strong></li>\n<li>Designs scalable frontend architecture with efficient state management (<strong>Zustand</strong>, <strong>Redux Toolkit</strong>, <strong>TanStack Query</strong>)</li>\n<li>Develops high-performance, responsive UIs with <strong>Tailwind CSS</strong>, <strong>Material UI</strong>, or <strong>Headless UI</strong></li>\n<li>Optimizes applications for <strong>Core Web Vitals</strong>, <strong>code splitting</strong>, and <strong>lazy loading</strong></li>\n<li>Uses AI-assisted development tools (<strong>v0</strong>, <strong>Bolt.new</strong>, <strong>Windsurf</strong>) to rapidly generate and iterate on UI components</li>\n<li>Applies <strong>semantic prompting</strong> to define complex UI behavior and state transitions</li>\n<li>Leverages AI for testing, code review, and accessibility audits (<strong>Vitest</strong>, <strong>Cypress</strong>, <strong>A11y checks</strong>)</li>\n<li>Collaborates with product and design teams to translate ideas into production-ready experiences</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@alignminds.com</strong></p>",
        "tags": [
            "3+ Years",
            "React",
            "TypeScript",
            "Next.js"
        ],
        "summary": "Full Stack Developer (AI-Enhanced) with 3+ years of experience in React, TypeScript, and Next.js. Remote role with extendable contract, focusing on AI-assisted development and modern web applications."
    },
    {
        "job_title": "Customer Relationship Manager (CRM)",
        "company": "Mashuptech",
        "url": "https://infopark.in/company-jobs/details/21977/360",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p>MashupTech is seeking a <strong>Customer Relationship Manager (Female)</strong> to manage and nurture long-term relationships with domestic and international clients. The ideal candidate will demonstrate strong communication skills, professionalism, and the ability to independently handle client interactions.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Serve as the primary point of contact for assigned clients</li>\n<li>Manage client communication via calls, emails, WhatsApp, and virtual meetings</li>\n<li>Build and maintain strong, long-term customer relationships</li>\n<li>Understand client needs and coordinate with internal technical teams</li>\n<li>Ensure smooth onboarding and ongoing client support</li>\n<li>Handle client concerns, feedback, and escalations professionally</li>\n<li>Maintain accurate client records and prepare periodic reports</li>\n</ul>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>Minimum 3–5 years</strong> of experience in Customer Relationship Management</li>\n<li>Experience handling international or premium clients</li>\n<li>Excellent English communication skills (verbal &amp; written)</li>\n<li>Strong interpersonal and relationship-building skills</li>\n<li>Ability to multitask and manage multiple clients efficiently</li>\n<li>Experience in IT services/software industry is an added advantage</li>\n</ul>\n<h2>Candidate Eligibility</h2>\n<ul>\n<li><strong>Strictly open to FEMALE candidates only</strong></li>\n<li>Prior experience with overseas clients (Middle East, Europe, US) is a plus</li>\n<li>Professional, confident, and customer-centric personality</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Competitive salary based on experience</li>\n<li>Performance-based incentives</li>\n<li>Career growth opportunities</li>\n<li>Supportive and professional work culture</li>\n<li>Exposure to international clients and projects</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Interested female candidates should send their resume to: <strong>career@mashuptech.in</strong> with the subject line: <strong>Application – Customer Relationship Manager</strong>.</p>",
        "tags": [
            "3–5 Years",
            "Customer Relationship Management",
            "International Client Handling",
            "IT Services/Software Industry"
        ],
        "summary": "MashupTech seeks a Female CRM Manager with 3–5 years of experience to manage international clients. Requires strong communication and relationship-building skills in an IT/services environment."
    },
    {
        "job_title": "SAP Executive / SAP Consultant",
        "company": "Mashuptech",
        "url": "https://infopark.in/company-jobs/details/21978/360",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>Company:</strong> MashupTech\n<strong>Location:</strong> Infopark Phase 1, Kochi\n<strong>Employment Type:</strong> Full-time\n<strong>Experience Required:</strong> Minimum 2–5 Years\n<strong>Eligibility:</strong> Female Candidates Only</p>\n<h3>Job Description</h3>\n<p>MashupTech is hiring a skilled <strong>SAP Executive / SAP Consultant (Female)</strong> to support, implement, and manage SAP-based business processes for domestic and international clients. The ideal candidate should have hands-on SAP experience and the ability to work closely with clients and internal teams.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Handle SAP implementation, configuration, and support activities</li>\n<li>Work on SAP modules such as <strong>FICO / MM / SD / HCM</strong> (based on expertise)</li>\n<li>Understand business requirements and translate them into SAP solutions</li>\n<li>Coordinate with functional and technical teams</li>\n<li>Provide end-user support, training, and documentation</li>\n<li>Troubleshoot issues and ensure system stability</li>\n<li>Support enhancements, upgrades, and process improvements</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>2–5 years of hands-on experience in SAP</li>\n<li>Strong knowledge in at least one SAP module (<strong>FICO / MM / SD / HCM</strong>)</li>\n<li>Good understanding of business processes and ERP workflows</li>\n<li>Excellent communication skills (English – verbal &amp; written)</li>\n<li>Ability to work independently and in a team environment</li>\n<li>SAP certification is an added advantage</li>\n</ul>\n<h3>Candidate Eligibility</h3>\n<ul>\n<li>This position is strictly open to <strong>FEMALE candidates only</strong></li>\n<li>Experience with international clients/projects is a plus</li>\n<li>Professional, analytical, and solution-oriented mindset</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary based on experience</li>\n<li>Performance-based incentives</li>\n<li>Career growth and SAP upskilling opportunities</li>\n<li>Supportive and professional work culture</li>\n<li>Exposure to enterprise-level SAP projects</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested <strong>female candidates only</strong> may send their resume to: <strong>career@mashuptech.in</strong>\n<strong>Email Subject:</strong> Application – SAP Executive</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>career@mashuptech.in</strong>.</p>",
        "tags": [
            "2–5 Years",
            "SAP FICO",
            "SAP MM",
            "SAP SD"
        ],
        "summary": "SAP Executive/Consultant (Female) with 2-5 years of experience in SAP modules (FICO/MM/SD/HCM) to implement and manage SAP solutions for clients."
    },
    {
        "job_title": "OPERATIONS COORDINATOR:",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21954/95",
        "location": "Infopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>OPERATIONS COORDINATOR</h2>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Ensure strict adherence to time/duty schedules and company policies</li>\n<li>Plan, coordinate, and direct all computer-data related activities</li>\n<li>Generate and distribute accurate, timely management reports</li>\n<li>Develop MIS documentation for smooth operations and system maintenance</li>\n<li>Perform periodic data analysis to generate reports</li>\n<li>Take orders and assign to clients as per requirements</li>\n<li>Handle customer returns/complaints and resolve technical issues</li>\n<li>Maintain proper dress code, floor discipline, and professionalism</li>\n<li>Safeguard company-provided properties</li>\n<li>Adapt to changes in job descriptions as processes evolve</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Strong organizational and analytical skills</li>\n<li>Proficiency in data management and reporting</li>\n<li>Customer service orientation</li>\n<li>Technical problem-solving abilities</li>\n<li>Commitment to company policies and procedures</li>\n</ul>\n<h3>Contact:</h3>\n<p>Share your updated resume at <strong>jobs@aabasoft.in</strong> if this aligns with your career goals.</p>",
        "tags": [
            "Not Specified",
            "Data Analysis",
            "MIS Documentation",
            "Technical Solutions"
        ],
        "summary": "Coordinates computer-data operations, generates reports, and resolves technical issues. Requires adherence to company policies and procedures."
    },
    {
        "job_title": "Business Development Interns – College Students",
        "company": "Zoiteckh Informations Solutions",
        "url": "https://infopark.in/company-jobs/details/21966/466",
        "location": "Infopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>Business Development Interns – College Students</h2>\n<h3>Duration</h3>\n<ul>\n<li>6 Months</li>\n</ul>\n<h3>Eligibility</h3>\n<ul>\n<li>Open to final-year students &amp; fresh graduates</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>Good communication skills</strong></li>\n<li><strong>Willingness to learn</strong></li>\n<li><strong>Basic knowledge of data entry &amp; reporting</strong></li>\n<li><strong>Basic knowledge of Excel</strong></li>\n<li><strong>Basic computer skills</strong></li>\n</ul>\n<h3>Application</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@zoiteckh.com</strong>.</p>",
        "tags": [
            "0-1 Years",
            "Communication Skills",
            "Excel",
            "Data Entry & Reporting"
        ],
        "summary": "Business Development Interns for college students seeking hands-on experience in data entry, reporting, and client communication. Ideal for final-year students and fresh graduates with basic Excel and computer skills."
    },
    {
        "job_title": "Business Development Intern – Aspiring BD Candidates",
        "company": "Zoiteckh Informations Solutions",
        "url": "https://infopark.in/company-jobs/details/21967/466",
        "location": "Infopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>Business Development Intern – Aspiring BD Candidates</h2>\n<p><strong>Duration:</strong> 6 Months</p>\n<h3>Basic Skills Required:</h3>\n<ul>\n<li>Strong interest in Business Development</li>\n<li>Basic understanding of lead generation &amp; market research</li>\n<li>Good communication skills</li>\n<li>Proactive and self-motivated attitude</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@zoiteckh.com</strong>.</p>",
        "tags": [
            "Internship",
            "Business Development",
            "Lead Generation",
            "Market Research"
        ],
        "summary": "6-month Business Development Intern role requiring proactive candidates with BD interest, lead generation, and communication skills. Apply at careers@zoiteckh.com."
    },
    {
        "job_title": "L1/L2 System Support",
        "company": "SupportHub360",
        "url": "https://infopark.in/company-jobs/details/21955/374",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>L1/L2 System Support</h2>\n<h3>Responsibilities</h3>\n<ul>\n<li>Expertise in <strong>Office365</strong> management and administration</li>\n<li>Expertise in <strong>SharePoint</strong> administration and <strong>Azure Active Directory</strong> management</li>\n<li>Support and administration of <strong>Windows 10</strong>, <strong>Windows 11</strong>, and <strong>Microsoft Windows Server</strong> operating systems</li>\n<li>Proficiency in using <strong>ticketing tools</strong> and <strong>remote management (RMM) tools</strong></li>\n<li>Knowledge of <strong>backup technologies</strong> and <strong>antivirus system configuration/monitoring</strong></li>\n<li>Familiarity with <strong>networking tools (Unifi)</strong> and <strong>phone systems (PBX)</strong></li>\n<li>Experience in <strong>domain management</strong></li>\n<li>Excellent communication skills required</li>\n</ul>\n<h3>Contact</h3>\n<p>For consideration, submit your updated resume to <strong>careers@supporthub360.com.au</strong></p>",
        "tags": [
            "Not Specified",
            "Office365",
            "SharePoint",
            "Azure Active Directory"
        ],
        "summary": "L1/L2 System Support role requiring expertise in Office365, SharePoint, and Azure AD administration, along with Windows systems and ticketing tools. Responsibilities include managing backups, antivirus, networking, and phone systems with strong communication skills."
    },
    {
        "job_title": "Junior Business Development Executive",
        "company": "Orestes Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21968/390",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<p><strong>Junior Business Development Executive</strong></p>\n<p>We are seeking an energetic <strong>Junior Business Development Executive (MBA Fresher)</strong> to support our sales and growth initiatives. The role involves assisting in lead generation, client coordination, and business development activities.</p>\n<p><strong>Key Responsibilities:</strong>\n- Identify potential customers in the domestic market and generate new business opportunities through calls, emails, online research, and other lead-generation activities.\n- Communicate with prospective clients to explain <strong>IT and digital services</strong> (e.g., web development, software solutions, mobile applications, digital marketing) professionally.\n- Understand basic client requirements, gather information, and coordinate with internal sales/technical teams to propose solutions.\n- Follow up with leads to build relationships and advance prospects through the sales process.\n- Support senior executives in preparing proposals, quotations, and presentations.\n- Maintain accurate records of leads, interactions, and sales progress using <strong>CRM tools</strong> or spreadsheets.\n- Collaborate with marketing, technical, and delivery teams for seamless client handling.\n- Achieve lead generation/sales targets while improving communication and negotiation skills.\n- Stay updated on market trends, competitor offerings, and customer expectations.</p>\n<p><strong>Skills &amp; Abilities:</strong>\n- Strong communication skills for professional client interactions via phone/email.\n- Interest in business development, sales, and IT/digital services with a willingness to learn.\n- Basic proficiency in <strong>MS Office</strong> and email for reporting and data management.\n- Interpersonal skills to build trust with clients and teams.\n- Self-motivated, target-oriented, and capable of working independently or in teams.\n- Problem-solving ability to address client needs and support solutions.\n- Time management to handle multiple tasks efficiently.</p>\n<p><strong>Contact:</strong>\n- Email: <a href=\"mailto:aswathy@orestestech.com\">aswathy@orestestech.com</a> or <a href=\"mailto:aswathy@orestestech.com\">aswathy@orestestech.com</a>\n- Phone: <a href=\"tel:8089671177\">8089671177</a></p>",
        "tags": [
            "0-2 Years",
            "IT/Digital Services",
            "CRM Tools",
            "Sales & Client Management"
        ],
        "summary": "Junior Business Development Executive to generate leads, coordinate clients, and support sales teams in IT/digital services. Requires strong communication and CRM skills."
    },
    {
        "job_title": "Telecaller",
        "company": "Orestes Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21969/390",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Telecaller (Fresher)</h2>\n<p>We are seeking an enthusiastic Telecaller to manage outbound/inbound calls, explain services to customers, and generate leads.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Handle <strong>inbound/outbound calls</strong> professionally, courteously, and confidently.</li>\n<li><strong>Communicate company products/services</strong> clearly to prospective and existing customers.</li>\n<li>Understand customer needs and provide solutions aligned with company guidelines.</li>\n<li>Address customer queries, concerns, and objections effectively.</li>\n<li>Follow up with interested customers to support <strong>lead generation and conversion</strong>.</li>\n<li>Maintain accurate records of calls, customer details, and follow-up status.</li>\n<li>Meet daily/weekly/monthly calling and performance targets.</li>\n<li>Escalate complex issues to relevant teams.</li>\n<li>Coordinate with internal teams for smooth customer handling.</li>\n<li>Adhere to company policies, processes, and quality standards.</li>\n<li>Continuously improve communication skills and product knowledge via training.</li>\n</ul>\n<h3>Eligibility:</h3>\n<ul>\n<li><strong>Freshers welcome</strong>; prior telecalling/customer service experience is a plus.</li>\n<li>Strong <strong>verbal communication skills</strong> for confident customer interaction.</li>\n<li>Basic <strong>computer literacy</strong> for updating call records and reports.</li>\n<li>Excellent <strong>listening skills</strong> to understand customer requirements.</li>\n<li>Positive attitude, self-motivation, and willingness to learn.</li>\n<li>Ability to thrive in a <strong>target-driven, fast-paced environment</strong>.</li>\n<li>Strong <strong>time management</strong> and multitasking capabilities.</li>\n</ul>\n<h3>Contact:</h3>\n<ul>\n<li>Email resumes to <strong>aswathy@orestestech.com</strong>.</li>\n<li>For inquiries, call <strong>8089671177</strong>.</li>\n</ul>",
        "tags": [
            "Freshers Welcome",
            "Verbal Communication",
            "Customer Service",
            "Call Handling"
        ],
        "summary": "Seeking a Telecaller to manage inbound/outbound calls, generate leads, and provide customer support. Requires strong communication skills and a target-driven attitude."
    },
    {
        "job_title": "Content Writer",
        "company": "Planet Media India ( PMIN Agency Pvt.Ltd.)",
        "url": "https://infopark.in/company-jobs/details/21961/266",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Key Responsibilities:</h2>\n<ul>\n<li>Contribute to content strategies across all platforms and generate ideas to increase customer engagement</li>\n<li>Manage the execution of all editorial content across the House of Wellness platforms that translates to audience engagement and brand promotion</li>\n<li>Proactive content ideation and planning</li>\n<li>Measure the results of editorial activity and audience engagement, providing regular insights and actionable recommendations for future direction</li>\n<li>Collaborate and manage external teams of content creators, publishers, and producers to edit, proofread, and improve content</li>\n<li>Work with internal and external teams to ensure timely completion and that all work is delivered to brief and objectives</li>\n<li>Develop and manage the Content Coordinator to ensure efficient delivery</li>\n<li>Assist in the ideation of integrated production</li>\n<li>Schedule content across all social media platforms and eDM’s as necessary</li>\n<li>Scheduling and optimising content across all social media platforms and eDM’s as necessary</li>\n</ul>\n<h2>About You:</h2>\n<ul>\n<li>Previous experience working in agency, publishers highly regarded</li>\n<li>Management experience - mentor one direct report</li>\n<li>Bachelor’s degree in marketing or related field</li>\n<li>2+ years’ experience in the media industry</li>\n<li>Proficiency with Microsoft Excel, PowerPoint, Google Analytics, and social media analytics</li>\n<li>Data driven and highly analytical</li>\n<li>Experience in SEO blogs and social media</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@planetmedia.in</strong></p>",
        "tags": [
            "2+ Years",
            "SEO",
            "Google Analytics",
            "Microsoft Excel/PowerPoint"
        ],
        "summary": "Content Writer needed to manage cross-platform content strategies, collaborate with teams, and optimize engagement using SEO and analytics tools."
    },
    {
        "job_title": "Manual QA Engineer (Azure Cloud)",
        "company": "SE-Mentor Solutions",
        "url": "https://infopark.in/company-jobs/details/21970/483",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Manual QA Engineer (Azure Cloud)</strong></p>\n<p>Are you a Quality Assurance professional with deep expertise in the Azure ecosystem? We are seeking a <strong>Manual QA Engineer</strong> with strong experience in the <strong>Azure Cloud Platform</strong> for a project in <strong>Bangalore</strong>.</p>\n<h3>Key Requirements:</h3>\n<ul>\n<li><strong>Manual Testing Excellence</strong>: 4+ years in functional, regression, and UAT testing.</li>\n<li><strong>Azure DevOps Native</strong>: Proficiency in <strong>Azure Test Plans</strong> and <strong>Azure Boards</strong>.</li>\n<li><strong>Cloud Knowledge</strong>: Familiarity with <strong>Azure Portal</strong> and core cloud services (Storage, SQL).</li>\n</ul>\n<h3>Additional Details:</h3>\n<ul>\n<li><strong>Notice Period</strong>: Immediate to 30 Days</li>\n<li><strong>Location</strong>: Hoodi, Bangalore</li>\n</ul>\n<p>If this aligns with your career goals, share your updated resume at <strong>careers@se-mentor.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "Azure Test Plans",
            "Azure Boards",
            "Azure Portal"
        ],
        "summary": "Manual QA Engineer with 4+ years in Azure Cloud testing, focusing on functional, regression, and UAT testing using Azure DevOps tools. Based in Bangalore with immediate to 30-day notice period."
    },
    {
        "job_title": "Node js Developer",
        "company": "Planet Media India ( PMIN Agency Pvt.Ltd.)",
        "url": "https://infopark.in/company-jobs/details/21971/266",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p>**Node.js Developer</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design, develop, and maintain scalable, high-performance backend services using Node.js.</li>\n<li>Architect, develop, and document RESTful APIs following industry best practices.</li>\n<li>Lead, mentor, and manage a team of backend developers to ensure timely and high-quality deliveries.</li>\n<li>Take ownership of backend system architecture, security, scalability, and performance optimization.</li>\n<li>Conduct regular code reviews and enforce coding standards and best practices.</li>\n<li>Collaborate with product managers, frontend teams, and stakeholders to translate business requirements into technical solutions.</li>\n<li>Optimize applications for speed, scalability, reliability, and maintainability.</li>\n<li>Manage and integrate third-party services (payment gateways, SMS, email, analytics tools).</li>\n<li>Troubleshoot production issues and guide the team during critical incidents.</li>\n<li>Participate in sprint planning, effort estimations, and technical decision-making.</li>\n<li>Ensure proper documentation of systems, APIs, and development processes.</li>\n<li>Implement monitoring, logging, and alerting mechanisms for system stability.</li>\n</ul>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>Minimum 5+ years</strong> of experience in backend development with strong expertise in Node.js.</li>\n<li>Proven experience leading and mentoring development teams.</li>\n<li>Strong knowledge of JavaScript (ES6+), asynchronous programming, and event-driven architecture.</li>\n<li>Experience in building RESTful APIs using frameworks like Express.js, NestJS, or Fastify.</li>\n<li>Hands-on experience with databases: MySQL, PostgreSQL, MongoDB, or similar.</li>\n<li>Experience with caching systems like Redis.</li>\n<li>Strong understanding of API security, authentication (JWT, OAuth), and data protection.</li>\n<li>Experience with cloud platforms (AWS/Azure/GCP) and deployment pipelines.</li>\n<li>Knowledge of containerization tools (Docker) and CI/CD pipelines.</li>\n<li>Familiarity with microservices architecture and message queues (RabbitMQ/Kafka is a plus).</li>\n<li>Strong debugging, problem-solving, and performance optimization skills.</li>\n<li>Experience working in Agile/Scrum environments.</li>\n</ul>\n<h2>Contact</h2>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@planetmedia.in</strong>.</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "JavaScript (ES6+)",
            "RESTful APIs"
        ],
        "summary": "Experienced Node.js Team Lead with 5+ years leading backend development teams to design scalable systems and mentor developers."
    },
    {
        "job_title": "MSSQL Developer",
        "company": "Nymbl",
        "url": "https://infopark.in/company-jobs/details/21979/323",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Job Title:</strong> MSSQL Developer\n<strong>Location:</strong> KOCHI\n<strong>Experience:</strong> 3–5 years\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Job Summary</h3>\n<p>We are seeking a skilled MSSQL Developer to design, develop, optimize, and maintain SQL Server databases. The ideal candidate will collaborate closely with application developers and business teams to ensure optimal performance, data integrity, and scalability.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Write, optimize, and maintain complex SQL queries</li>\n<li>Design, develop, and manage stored procedures, views, functions, and triggers</li>\n<li>Conduct data analysis and validation, and produce required reports</li>\n<li>Perform query performance tuning using execution plans, indexing, and profiling</li>\n<li>Ensure data integrity, security, backup, and recovery strategies</li>\n<li>Troubleshoot production issues and provide timely resolutions</li>\n<li>Support database deployments, migrations, and upgrades</li>\n<li>Document database designs, processes, and standards</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong experience with MSSQL Server (2016/2019/2022/2025)</li>\n<li>Expertise in T-SQL, indexing, query optimization, and performance tuning</li>\n<li>Hands-on experience with stored procedures, functions, triggers</li>\n<li>Knowledge of normalization, relational database design, and data modeling</li>\n<li>Experience with SQL Server Agent jobs, backups, restores</li>\n<li>Understanding of transactions, locks, deadlocks, and isolation levels</li>\n<li>Excellent analytical and problem-solving skills</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Exposure to Azure SQL / SQL Managed Instance</li>\n<li>Knowledge of ETL processes and data warehousing concepts</li>\n<li>Familiarity with version control tools like Azure DevOps</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@benymbl.co</strong>.</p>",
        "tags": [
            "3–5 Years",
            "MSSQL Server",
            "T-SQL",
            "Query Optimization"
        ],
        "summary": "Seeking an experienced MSSQL Developer to design, optimize, and maintain databases. Requires 3–5 years of experience with T-SQL and database performance tuning."
    },
    {
        "job_title": "Immediate Opening for Senior Sales Executive -Oracle Fusion Sales",
        "company": "Aspire Systems Digital Private Limited",
        "url": "https://infopark.in/company-jobs/details/21964/36",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Role Overview</h2>\n<p>We are seeking a dynamic and results-driven Sales Professional to lead our US market sales initiatives for <strong>Oracle Fusion ERP Offerings</strong>. This is a pure hunter role suited for a highly independent individual contributor who thrives in <strong>outbound B2B sales</strong>, <strong>lead generation</strong>, and <strong>deal closure</strong> with mid-market and enterprise customers.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Generate new business opportunities in the US geography through proactive outreach and networking.</li>\n<li>Manage the complete sales cycle: prospecting, qualification, first-level solution pitch, proposal creation, negotiation, and closure.</li>\n<li>For candidates not handling full closures, take ownership of cold calling, lead generation, appointment setting, and first-level opportunity qualification, handing over qualified opportunities to senior sales or closure teams.</li>\n<li>Build and maintain strong relationships with CXOs, Directors, and senior IT leaders.</li>\n<li>Work closely with presales and delivery teams to create winning proposals and solution decks.</li>\n<li>Maintain an active pipeline and accurate forecasting using CRM.</li>\n<li>Achieve quarterly and annual sales targets.</li>\n<li>Conduct market research to understand client challenges, competitive landscape, and Oracle Fusion technology trends to perform <strong>Value Selling</strong>.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>Location</strong>: Chennai, Bangalore (Hybrid)</li>\n<li><strong>Work Timings</strong>: Aligned to the respective US Time zone</li>\n<li><strong>Experience</strong>: 5-8 years</li>\n<li><strong>Industry</strong>: IT Services / Software Services</li>\n<li><strong>Role Type</strong>: Individual Contributor | Hunter Role</li>\n<li>Experience in IT services sales with strong exposure to US clients.</li>\n<li>3–5+ years of relevant experience in selling Oracle Fusion ERP offerings.</li>\n<li>Proven track record in hunting and closing deals in the US market.</li>\n<li>Excellent communication, presentation, and negotiation skills.</li>\n<li>Ability to work independently with minimal supervision.</li>\n<li>Comfortable working with cross-functional and distributed teams.</li>\n<li>Strong US network or prior experience working with US customers.</li>\n<li>Experience in consultative selling.</li>\n<li>Ability to manage time-zone alignment with US clients.</li>\n<li>Bachelor’s degree required; MBA is an advantage.</li>\n</ul>\n<h3>Contact Information</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>malavika.sabu@aspiresys.com</strong>.</p>",
        "tags": [
            "5-8 Years",
            "Oracle Fusion ERP",
            "US B2B Sales",
            "Cold Calling/Lead Generation"
        ],
        "summary": "Senior Sales Executive in a hunter role for Oracle Fusion ERP in the US market, requiring 5-8 years of experience in B2B sales, lead generation, and deal closure with enterprise clients."
    },
    {
        "job_title": "Immediate Opening for Senior Sales Executive -Salesforce Service Sales",
        "company": "Aspire Systems Digital Private Limited",
        "url": "https://infopark.in/company-jobs/details/21965/36",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Senior Sales Executive - Salesforce Service Sales</h2>\n<p><strong>Location:</strong> Chennai (Hybrid)\n<strong>Work Timings:</strong> Aligned to US Time Zones</p>\n<h3>Role Overview</h3>\n<p>We seek a dynamic, target-driven professional to lead sales efforts in the US market. The ideal candidate will generate leads, pursue opportunities, and close deals with mid-size and enterprise customers. Experience in Salesforce consulting, B2B enterprise selling, and familiarity with lead generation tools are advantageous.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Generate new business opportunities in the US through proactive outreach and networking.</li>\n<li>Manage the full sales cycle: prospecting, qualification, solution pitch, proposal creation, negotiation, and closure.</li>\n<li>Build relationships with CXOs, Directors, and senior IT leaders.</li>\n<li>Collaborate with presales and delivery teams to create proposals and solution decks.</li>\n<li>Maintain an active pipeline and accurate forecasting using CRM.</li>\n<li>Achieve quarterly and annual sales targets.</li>\n<li>Conduct market research on client challenges, competitive landscape, and Salesforce trends for value selling.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>Experience:</strong> 5–8 years (3–5 years in Salesforce services sales; 3–5 years in outbound B2B sales/lead generation).</li>\n<li>Proven track record in closing US market deals.</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li>Ability to work independently and with cross-functional/distributed teams.</li>\n<li>US network or prior US client experience.</li>\n<li>Consultative selling expertise.</li>\n<li>Time-zone alignment with US clients.</li>\n<li>Bachelor’s degree required; MBA preferred.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>Keerthana.jayaraj@aspiresys.com</strong>.</p>",
        "tags": [
            "5-8 Years",
            "Salesforce",
            "B2B Sales",
            "US Market"
        ],
        "summary": "Senior Sales Executive for Salesforce services in the US, requiring 5-8 years of experience in B2B sales and consultative selling."
    },
    {
        "job_title": "Product Support Analyst",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27470",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Reflections Info Systems (P) Ltd</h2>\n<p><strong>Address:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Job Title:</strong> Product Support Analyst\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Published Date:</strong> 08, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Introduction</h3>\n<p>We are seeking candidates with <strong>1+ years of experience</strong> for this role. The position requires availability in a <strong>24×7 shift environment</strong>.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Provide first-level technical support for SAS products via email, phone, or ticketing systems.</li>\n<li>Troubleshoot and resolve issues related to installation, configuration, and usage of SAS applications.</li>\n<li>Escalate complex issues to senior support engineers or development teams when necessary.</li>\n<li>Document solutions, FAQs, and best practices to improve knowledge base and customer self-service.</li>\n<li>Collaborate with cross-functional teams (development, QA, consulting) to resolve customer concerns.</li>\n<li>Assist in monitoring product performance and reporting recurring issues.</li>\n<li>Ensure timely resolution of support cases while maintaining high customer satisfaction.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong>\n- 6 months – 1 year of experience in SAS product support or related technical support role.\n- Basic understanding of SAS software (Base SAS, SAS Enterprise Guide, SAS Visual Analytics, or other SAS modules).\n- Familiarity with SQL, data management concepts, and statistical tools.\n- Strong problem-solving and analytical skills.\n- Excellent communication skills (written and verbal).\n- Ability to work independently and in a team environment.\n- Bachelor’s degree in Computer Science, Information Technology, Statistics, or related field.</p>\n<p><strong>Secondary Skills:</strong>\n- Exposure to Linux/Windows server environments.\n- Knowledge of scripting languages (Python, R, or Shell scripting).\n- Experience with ticketing systems (ServiceNow, JIRA, or similar).\n- Understanding of data analytics and reporting concepts.</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates should forward detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are conducted via the official website, LinkedIn, or the HR email id. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "1+ Years",
            "SAS",
            "SQL",
            "Linux/Windows"
        ],
        "summary": "A Product Support Analyst role requiring 1+ years of SAS product support experience, focusing on technical troubleshooting, customer collaboration, and knowledge base development."
    },
    {
        "job_title": "IBM Sterling OMS Solution Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27469",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Reflections Info Systems (P) Ltd</h2>\n<p><strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Job Published</strong>: 08, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Introduction</h3>\n<p>We are seeking candidates with <strong>8+ years</strong> of experience for the role of <strong>IBM Sterling OMS Solution Architect</strong>.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Define solution architecture and detailed technical design for IBM Sterling OMS initiatives.</li>\n<li>Lead and mentor development teams in designing, coding, customizing, and deploying Sterling OMS solutions.</li>\n<li>Translate functional requirements into scalable, resilient, and maintainable Sterling OMS architecture.</li>\n<li>Oversee end-to-end development (design, development, deployment, debugging, documentation) for IBM OMS.</li>\n<li>Ensure OMS enhancements meet performance, scalability, and security standards aligned with stakeholder KPIs.</li>\n<li>Manage technical requirements for Sterling OMS (v10.0), including configurations, APIs, workflows, and database extensions.</li>\n<li>Estimate effort, cost, dependencies, and timelines for new features and architectural components.</li>\n<li>Provide architectural governance and conduct design/code reviews for best practices.</li>\n<li>Lead integration architecture involving OMS and external systems (WMS, ERP, Commerce, TMS, Inventory).</li>\n<li>Guide OMS implementation efforts (SL, BT, or custom setups) and enforce best practices.</li>\n<li>Collaborate with cross-functional IT teams across logistics, order orchestration, and fulfillment applications.</li>\n<li>Drive secure, scalable, cloud-ready OMS development aligned with Agile methodologies.</li>\n<li>Contribute to continuous improvements via automation, reusable components, and standardized technical artifacts.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills</strong>:\n- <strong>8+ years</strong> of IT experience with hands-on architecture/solution design for IBM Sterling OMS.\n- Advanced Java development expertise.\n- Advanced IBM Sterling Order Management System (configurations, customizations, workflows, SDF, DB extensions, APIs).\n- Strong DB2/Oracle database experience (performance tuning, indexing, complex queries).\n- Proficiency in XML, JSON, and integration patterns (MQ, WebServices, REST APIs).\n- Linux/Unix environment experience (Intermediate/Advanced).\n- Hands-on exposure to GCP (GKE, Artifact Registry, Compute Engine) or equivalent cloud platforms.\n- Strong Git and modern DevOps practices.</p>\n<p><strong>Secondary Skills</strong>:\n- Integration experience with Sterling OMS, MQ, WebServices, and cloud-native components.\n- Kubernetes/Docker for OMS deployment/troubleshooting.\n- CI/CD pipelines (GitHub Actions, Jenkins, or similar tools).\n- Strong soft skills: self-learning, collaboration, planning, and organization.</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates should send detailed resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does <strong>not</strong> charge any fees for job applications. All communications are via official website, LinkedIn, or the HR email id. Report any suspicious activity to <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "8+ Years",
            "IBM Sterling OMS",
            "Java",
            "GCP"
        ],
        "summary": "Lead design and delivery of IBM Sterling OMS solutions, mentor teams, and ensure integration with external systems. Requires 8+ years of experience in architecture, Java, and cloud platforms like GCP."
    },
    {
        "job_title": "Senior Software Engineer - Java",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27468",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a></p>\n<p><strong>Senior Software Engineer - Java</strong>\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Published:</strong> 08, Feb 2026\n<strong>Contact:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Introduction</h3>\n<p>We are seeking candidates with <strong>4+ years</strong> of experience in software development.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Collaborate with team leads to deliver assigned tasks</li>\n<li>Provide technical guidance/coaching to team members</li>\n<li>Translate business requirements into technical specifications</li>\n<li>Design client-side and server-side architecture</li>\n<li>Conduct high/low-level design for functional requirements</li>\n<li>Create proofs of concept/demos based on client needs</li>\n<li>Ensure application responsiveness and performance</li>\n<li>Develop unit/integration tests</li>\n<li>Implement security/data protection settings</li>\n<li>Write technical documentation</li>\n<li>Stay updated on industry trends and share knowledge</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong>\n- Bachelor’s in Engineering/Technology or MCA\n- 4+ years of software development experience\n- Expertise in Java/JavaScript, Spring Boot/React JS, RDBMS/NoSQL (e.g., MongoDB)\n- Code reviews and Pull Request merges\n- Full-stack development (backend/frontend) and DevOps tasks\n- Proficiency in HTML/CSS, JavaScript, XML, jQuery\n- Knowledge of Java/Python/C#, Angular/React/Node.js\n- Familiarity with MySQL/Cassandra, Apache, UI/UX design\n- Experience with IDEs, Git, Jenkins, Maven, Gradle</p>\n<p><strong>Secondary Skills:</strong>\n- Backend system integration\n- Enterprise-level software development\n- Open-source software experience\n- Enterprise security configurations\n- Exceptional problem-solving\n- Excellent communication (business-to-technical translation)\n- Organizational contributions (hiring, mentoring, team building)\n- Testing frameworks (JUnit, Jest, JMeter, Selenium)</p>\n<h3>Application Instructions</h3>\n<p>Send resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC. <strong>Warning:</strong> No payment is required for jobs at Reflections. All communications are via official channels only.</p>",
        "tags": [
            "4+ Years",
            "Java",
            "Spring Boot",
            "React JS"
        ],
        "summary": "Senior Software Engineer - Java role requiring 4+ years of experience in enterprise software development for retail, with expertise in Java/Spring Boot and full-stack capabilities."
    },
    {
        "job_title": "Software Engineer - Java",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27467",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Reflections Info Systems (P) Ltd</h2>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Published Date:</strong> 08, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Introduction</h3>\n<p>We are seeking candidates with <strong>2+ years of experience</strong> in software development.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Collaborate with team leads to deliver assigned tasks and provide technical guidance/coaching</li>\n<li>Translate business requirements into technical specifications</li>\n<li>Analyze impacts of planned work on existing systems</li>\n<li>Design client-side and server-side architecture</li>\n<li>Create high-level and low-level designs for functional requirements</li>\n<li>Develop proofs of concept/demos based on client needs</li>\n<li>Ensure application responsiveness and performance</li>\n<li>Write unit/integration tests and security configurations</li>\n<li>Document technical processes</li>\n<li>Stay updated on industry trends and share knowledge</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong>\n- Bachelor’s/Master’s in Engineering/Technology or Computer Applications\n- 2+ years of software development experience\n- Expertise in Java/JavaScript, Spring Boot/React JS, RDBMS/NoSQL databases (e.g., MongoDB)\n- Code review and Git proficiency\n- Full-stack development capabilities (backend/frontend)\n- DevOps knowledge\n- Front-end skills: HTML/CSS, JavaScript, XML, jQuery\n- Back-end skills: Java/Python/C#, Angular/React/Node.js\n- Database/web server experience (MySQL, Cassandra, Apache)</p>\n<p><strong>Secondary Skills:</strong>\n- Backend system integration\n- Enterprise-level software development\n- Open-source software experience\n- Enterprise security configurations\n- Problem-solving and communication skills\n- Business requirement translation and timeline management\n- Organizational contributions (hiring, mentoring)\n- Testing frameworks: JUnit, Jest, JMeter, Selenium</p>\n<h3>Application Instructions</h3>\n<p>Submit resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current/expected CTC. <strong>Warning:</strong> No payments are requested for jobs at Reflections. All communications occur via official channels. Report suspicious activity to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "2+ Years",
            "Java",
            "Spring Boot",
            "React JS"
        ],
        "summary": "A Software Engineer role at Reflections Info Systems requires 2+ years of experience in Java-based enterprise software development for the retail industry, with full-stack capabilities and DevOps knowledge."
    },
    {
        "job_title": "Senior Data Engineer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27466",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsinfos.com\">Reflections Global</a>\n<strong>Job Title:</strong> Senior Data Engineer\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Published Date:</strong> 08, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking candidates with <strong>5+ years</strong> of experience for this role. Key requirements include:\n- Strong understanding of data warehousing concepts and best practices.\n- Proficiency in <strong>Python</strong> and <strong>SQL</strong> for data manipulation and query optimization.\n- Working knowledge of <strong>ETL</strong> and data platforms with <strong>SAP</strong> data (SAP as the source for OLAP).\n- Knowledge of <strong>Snowflake</strong> architecture, features, and best practices.\n- Ability to design and implement data solutions using Snowflake.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Design and develop high-performance data pipelines for live query access.</li>\n<li>Develop analytical data models with SAP data using <strong>AtScale</strong> semantic layer.</li>\n<li>Collaborate with the data team to integrate with existing infrastructure and tools.</li>\n<li>Monitor and troubleshoot pipelines to ensure data quality, consistency, and timely delivery.</li>\n<li>Translate stakeholder requirements into technical solutions.</li>\n<li>Optimize SQL queries and pipelines for performance.</li>\n<li>Implement data governance, security, and compliance practices in Snowflake databases.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>3+ years as a Data Engineer with Snowflake experience.</li>\n<li>Familiarity with cloud platforms (<strong>AWS</strong>, <strong>Azure</strong>, <strong>GCP</strong>).</li>\n<li>Experience with <strong>ETL</strong>, <strong>data integration</strong>, and pipeline development in Snowflake/SAP.</li>\n<li>Agile methodologies and <strong>Git</strong> version control.</li>\n<li>Strong problem-solving and communication skills.</li>\n</ul>\n<h3><strong>Secondary Skills</strong></h3>\n<ul>\n<li>Data governance and security practices.</li>\n<li>Adaptability to modern technologies.</li>\n<li>Team collaboration and analytical skills.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Forward resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details. <strong>Important:</strong> Reflections does not charge fees for job applications. All communications are via official email or LinkedIn. Report any suspicious activity to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Python",
            "SQL",
            "Snowflake"
        ],
        "summary": "Senior Data Engineer role requiring 5+ years of experience in designing Snowflake-based data pipelines, SAP integration, and optimizing SQL queries. Focus on data governance and cloud platforms."
    },
    {
        "job_title": "Regional Sales Manager – GCC (Software Sales)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27465",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2><strong>Job Title</strong>: Regional Sales Manager – GCC (Software Sales)</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: Thiruvananthapuram, Kerala, India\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">Reflections Global</a>\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 08, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a dynamic <strong>Regional Sales Manager (RSM)</strong> to lead and expand our software business operations across the <strong>Gulf Cooperation Council (GCC)</strong> region, including Saudi Arabia, UAE, Qatar, Kuwait, Bahrain, and Oman. The RSM will drive sustainable revenue growth, build long-term client relationships, and position our enterprise software solutions as a trusted choice for digital transformation in key industries such as <strong>Banking, Financial Services, Telecom, Retail, and Government</strong>. This role demands a proven track record in <strong>enterprise B2B software sales</strong>, strong leadership, and deep understanding of regional market dynamics and regulatory landscapes.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Develop and execute comprehensive regional sales strategies to meet/exceed software and services revenue targets (software solutions, SaaS, licensing, digital transformation).</li>\n<li>Identify and secure new enterprise clients while nurturing long-term relationships with key accounts and CXO-level stakeholders.</li>\n<li>Manage the end-to-end enterprise sales cycle — from prospecting, RFPs, proposals, and negotiations to deal closure.</li>\n<li>Ensure timely revenue collection and follow-up with existing accounts while driving upselling and cross-selling opportunities.</li>\n<li>Drive and expand the partner ecosystem by establishing relationships with system integrators, VARs, and channel partners across GCC.</li>\n<li>Ensure compliance with regional regulatory requirements (e.g., public tenders, data residency norms, SaaS/cloud compliance).</li>\n<li>Collaborate cross-functionally with Pre-Sales, Delivery, Product, Marketing, and Partner Management teams to ensure client satisfaction and solution alignment.</li>\n<li>Represent the company at regional trade events, summits, and conferences to enhance brand visibility and thought leadership.</li>\n<li>Provide accurate sales forecasts, pipeline insights, and market intelligence to senior management.</li>\n</ul>\n<h3><strong>Travel Requirements</strong></h3>\n<ul>\n<li>Travel is required across GCC as and when necessary for client meetings, partner engagements, and industry events.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Bachelor’s degree in Business, Computer Science, Engineering, or related field; MBA preferred.</li>\n<li><strong>5–8 years of enterprise software sales experience</strong>, including <strong>5+ years in a regional leadership capacity</strong> within GCC.</li>\n<li>Proven success in selling <strong>SaaS, cloud platforms, and enterprise solutions</strong> to large/mid-sized clients.</li>\n<li>Deep understanding of <strong>GCC market regulations, tendering processes, and enterprise procurement frameworks</strong>.</li>\n<li>Established network of enterprise clients and partners in key markets (especially KSA, Qatar, and UAE).</li>\n<li>Excellent <strong>communication, negotiation, and presentation skills</strong>.</li>\n<li>Strong <strong>soft skills</strong> – resilience, adaptability, cross-cultural negotiation, and leadership under pressure.</li>\n<li>Fluency in <strong>English and Arabic</strong> is mandatory.</li>\n<li>Must hold a <strong>valid GCC residency</strong> and <strong>driving license</strong>.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does <strong>not</strong> charge any fees for job applications. Fraudsters may falsely promise jobs; contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> for clarifications.</p>",
        "tags": [
            "5+ Years",
            "SaaS",
            "Cloud Platforms",
            "Enterprise Solutions"
        ],
        "summary": "Lead GCC software sales for enterprise clients, driving revenue growth and digital transformation. Requires 5+ years of regional sales experience in SaaS/cloud solutions."
    },
    {
        "job_title": "Senior QA Automation Engineer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27464",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">Reflections Global</a>\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 08, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Responsibilities</h3>\n<ul>\n<li><strong>Automation Delivery &amp; Ownership</strong></li>\n<li>Own and drive automation for critical business and customer journeys</li>\n<li>Identify, prioritize, and implement automation opportunities to reduce manual regression effort</li>\n<li>Ensure automation coverage, reliability, and execution speed meet delivery expectations</li>\n<li>\n<p>Act as a hands-on automation lead within delivery squads</p>\n</li>\n<li>\n<p><strong>Hands-On Automation Engineering</strong></p>\n</li>\n<li>Design, develop, and maintain automated test suites using <strong>Playwright with TypeScript</strong></li>\n<li>Own and evolve the automation framework, including reusable components and utilities</li>\n<li>Implement and maintain CI/CD integration for automated tests</li>\n<li>Execute tests across browsers and environments using cloud platforms (e.g., LambdaTest)</li>\n<li>\n<p>Apply strong engineering practices including version control, code reviews, and automation standards</p>\n</li>\n<li>\n<p><strong>API &amp; Integration Testing</strong></p>\n</li>\n<li>Design and automate API tests using <strong>Postman</strong> and <strong>Playwright</strong></li>\n<li>Validate integrations, data accuracy, and business rules across systems</li>\n<li>\n<p>Support contract and integration testing approaches</p>\n</li>\n<li>\n<p><strong>Performance &amp; Non-Functional Testing</strong></p>\n</li>\n<li>Design and execute performance, load, and stress tests using <strong>K6</strong> (or <strong>JMeter</strong>)</li>\n<li>Analyze performance results and highlight risks or regressions</li>\n<li>\n<p>Support performance monitoring and reporting via dashboards (e.g., Grafana)</p>\n</li>\n<li>\n<p><strong>Manual &amp; Exploratory Testing</strong></p>\n</li>\n<li>Perform targeted manual testing for complex, high-risk, or exploratory scenarios</li>\n<li>Validate end-to-end workflows and edge cases not suitable for automation</li>\n<li>\n<p>Support usability and experience-focused testing</p>\n</li>\n<li>\n<p><strong>Defect &amp; Quality Management</strong></p>\n</li>\n<li>Log, track, and validate defects using <strong>Jira</strong></li>\n<li>Participate in defect triage and collaborate with engineering teams</li>\n<li>\n<p>Use defect trends and automation insights to improve test coverage and quality</p>\n</li>\n<li>\n<p><strong>Test Management, Data &amp; Reporting</strong></p>\n</li>\n<li>Maintain test cases and automation artifacts in <strong>XRAY</strong> (Test Management) or equivalent tools</li>\n<li>Manage test data and environment readiness for automated testing</li>\n<li>Provide clear reporting on automation progress, coverage, and quality risks to the QA Manager</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience &amp; Profile</strong></li>\n<li>5–8 years of experience in QA / Quality Engineering with strong automation focus</li>\n<li>Proven hands-on experience testing web-based and API-driven systems</li>\n<li>Strong experience in Agile delivery environments</li>\n<li>\n<p>Comfortable owning automation delivery end-to-end while collaborating across teams</p>\n</li>\n<li>\n<p><strong>Technical Skills</strong></p>\n</li>\n<li><strong>Test automation using Playwright + TypeScript</strong></li>\n<li><strong>Automation framework design and maintenance</strong></li>\n<li><strong>API testing</strong> (Postman, Playwright, or similar)</li>\n<li><strong>Performance testing</strong> using K6 or JMeter</li>\n<li><strong>CI/CD pipelines</strong> and version control (Git)</li>\n<li><strong>Cloud-based cross-browser testing platforms</strong></li>\n<li>\n<p><strong>Test management and defect tracking tools</strong> (XRAY, Jira)</p>\n</li>\n<li>\n<p><strong>Professional Attributes</strong></p>\n</li>\n<li>Strong hands-on technical mindset</li>\n<li>Proactive, accountable, and delivery-focused</li>\n<li>High attention to detail and quality</li>\n<li>Ability to work independently and within cross-functional teams</li>\n<li>Clear and practical communication of technical issues and risks</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li><strong>AI-Enabled Testing &amp; Quality Innovation</strong></li>\n<li>Evaluate and adopt AI-assisted testing tools to improve test coverage, speed, and defect detection</li>\n<li>Leverage AI for test case generation, maintenance, and regression optimization</li>\n<li>Use AI-driven insights to identify high-risk areas, flaky tests, and automation gaps</li>\n<li>Experiment with AI support for exploratory testing, test data generation, and failure analysis</li>\n<li>Collaborate with the QA Manager to responsibly introduce AI into testing practices</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details. <strong>Important Note</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are through the official website, LinkedIn, or the HR email. For clarifications, contact <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "5–8 Years",
            "Playwright + TypeScript",
            "API testing (Postman)",
            "Performance testing (K6/JMeter)"
        ],
        "summary": "Senior QA Automation Engineer role requiring 5–8 years of experience in automation with Playwright, API testing, and performance testing. Focus on Agile delivery, CI/CD, and AI-driven quality innovation."
    },
    {
        "job_title": "Cloud Architect - Bangalore – WFO (3 days a week)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27463",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Job Posting: Cloud Architect - Bangalore – WFO (3 days a week)</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published</strong>: 08, Feb 2026\n<strong>Contact</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Brief Description</h3>\n<p>As a Cloud Architect, you will join the Engineering team to build high-quality enterprise software for the retail industry. Responsibilities include:</p>\n<ul>\n<li>Creating and managing cloud strategies</li>\n<li>Evaluating cloud applications, hardware, and software</li>\n<li>Building/maintaining CI/CD pipelines</li>\n<li>Designing monitoring/alerts for production/non-production deployments</li>\n<li>Implementing Blue-Green deployments for zero downtime</li>\n<li>Performing emergency hot fixes and security patching</li>\n<li>Hardening computing/networking infrastructure</li>\n<li>Planning disaster recovery and executing DR tests</li>\n<li>Automating database backups/restores</li>\n<li>Applying DevOps best practices for cost-effective operations</li>\n<li>Monitoring production systems for outages/performance issues</li>\n<li>Ensuring annual VAPT execution and infrastructure security</li>\n<li>Providing performance appraisal inputs</li>\n<li>Staying updated on evolving DevOps practices</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills</strong>:\n- Jenkins, Azure DevOps, or BitBucket Pipelines expertise\n- Docker/Kubernetes containerization/orchestration\n- GitHub/BitBucket/GitLab SCM proficiency\n- Security hardening (CIS benchmarks, IDS/IPS, antivirus)\n- Multi-data center infrastructure management\n- Expertise in at least 2 public clouds\n- Certification in 1 public cloud system</p>\n<p><strong>Secondary Skills</strong>:\n- 7+ years DevOps experience (software product companies preferred)\n- Engineering/Computer Applications graduate/postgraduate\n- Retail industry familiarity\n- Multi-cloud provider expertise (Azure, AWS, etc.)\n- Focus on complex, multi-region, high-availability systems</p>\n<h3>Certifications</h3>\n<ul>\n<li>Certified Information Security Manager (CISM®)</li>\n<li>AWS Certified Solution Architect</li>\n<li>GCP Certified Cloud Architect</li>\n<li>Microsoft Azure Solutions Architect Expert</li>\n</ul>\n<p><strong>Application</strong>: Email resume to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current/expected CTC. <strong>Important</strong>: No payments are requested for jobs. All communications occur via official website/LinkedIn or the HR email above. Report suspicious activity to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "7+ Years",
            "Jenkins",
            "Docker",
            "Kubernetes"
        ],
        "summary": "Cloud Architect in Bangalore focusing on DevOps, cloud strategies, and security. Requires 7+ years, Jenkins, Docker, and Kubernetes expertise."
    },
    {
        "job_title": "Graphic Designer (Motion Graphics)",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27462",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Overview</h2>\n<p><strong>Globcom Solutions (P) Ltd</strong>\nModule 2502, 5th Floor, Yamuna Building\nTechnopark Phase -3, Thiruvananthapuram, 695583\n<a href=\"http://www.globcomsolution.com\">Visit Website</a></p>\n<h2>Job Summary</h2>\n<p>We are seeking a skilled and creative <strong>Graphic Designer (Motion Graphics)</strong> with <strong>minimum 2 years of professional experience</strong> to join our team. The ideal candidate will possess a strong design portfolio, excellent visual aesthetics, and the ability to create engaging, brand-consistent designs for both digital and print platforms.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Create high-quality visual assets including social media creatives, marketing materials, websites, banners, flyers, logos, and print collaterals.</li>\n<li>Design and develop motion graphics for digital platforms as required.</li>\n<li>Collaborate with internal teams to conceptualize and execute designs based on project requirements and brand guidelines.</li>\n<li>Prepare design drafts, mockups, and concepts for review and feedback.</li>\n<li>Ensure visual consistency and brand alignment across all platforms and deliverables.</li>\n<li>Work closely with UI/UX designers, content teams, and developers to enhance user experience.</li>\n<li>Maintain and organize design assets, source files, and follow version control best practices.</li>\n<li>Adapt and optimize designs for web, mobile, and print formats.</li>\n<li>Stay updated with the latest design trends, tools, and industry best practices.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Minimum 2 years</strong> of proven experience in graphic design or a related field.</li>\n<li>Proficiency in <strong>Adobe Photoshop</strong>, <strong>Adobe Illustrator</strong>, <strong>Canva</strong>, and other relevant design tools.</li>\n<li><strong>Motion graphics experience</strong> is mandatory.</li>\n<li>Strong portfolio showcasing diverse creative design and motion work.</li>\n<li>Solid understanding of design principles (layout, typography, color theory, visual hierarchy).</li>\n<li>Ability to work independently and collaboratively in a team environment.</li>\n<li>Strong communication, presentation, and time-management skills.</li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Email:</strong> <a href=\"mailto:rajesh@globcomsolution.com\">rajesh@globcomsolution.com</a>\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 07, Feb 2026</p>",
        "tags": [
            "2+ Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Motion Graphics"
        ],
        "summary": "Creative Graphic Designer with 2+ years of motion graphics experience. Collaborates across teams to produce brand-consistent digital/print designs."
    },
    {
        "job_title": "HR Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/27461",
        "location": "Technopark",
        "closing_date": "20 Mar 2026",
        "job_description": "<h2>HR Trainee at ZenturioTech (P) Ltd</h2>\n<p><strong>Location:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://zenturiotech.com\">https://zenturiotech.com</a>\n<strong>Closing Date:</strong> 20, Mar 2026\n<strong>Published:</strong> 07, Feb 2026\n<strong>Contact Email:</strong> admin@zenturiotech.com</p>\n<h3>Duration</h3>\n<ul>\n<li><strong>3 Months (Unpaid Internship)</strong></li>\n<li><strong>Onsite:</strong> Technopark, Trivandrum</li>\n<li><strong>Certificate:</strong> Provided upon successful completion</li>\n</ul>\n<h3>Job Summary</h3>\n<p>We are seeking a motivated HR Trainee to support our people operations. This role offers hands-on learning for candidates aiming to build a career in Human Resources.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Support recruitment activities and assist in resume screening and shortlisting</li>\n<li>Coordinate interviews and scheduling</li>\n<li>Assist with employee engagement initiatives</li>\n<li>Support daily HR operations and workflows</li>\n<li>Help with internal coordination and HR communication</li>\n<li>Handle routine HR support tasks</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong communication and organizational skills</li>\n<li>Basic understanding of HR processes</li>\n<li>Proactive mindset and strong work ethic</li>\n<li>Willingness to learn and work in a team</li>\n</ul>",
        "tags": [
            "Entry Level",
            "Communication",
            "Organizational Skills",
            "HR Processes"
        ],
        "summary": "3-month unpaid HR internship offering hands-on experience in recruitment, employee engagement, and HR operations. Supports daily HR tasks and develops foundational HR skills."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/27460",
        "location": "Technopark",
        "closing_date": "20 Mar 2026",
        "job_description": "<p><strong>ZenturioTech (P) Ltd</strong></p>\n<p><strong>Location:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://zenturiotech.com\">zenturiotech.com</a>\n<strong>Closing Date:</strong> 20, Mar 2026\n<strong>Published Date:</strong> 07, Feb 2026\n<strong>Contact Email:</strong> admin@zenturiotech.com</p>\n<h3><strong>Brief Description</strong></h3>\n<p>Are you ambitious, driven, and excited about building something from the ground up? We are a fast-growing startup seeking a <strong>Business Development Executive</strong> who can turn conversations into customers and ideas into revenue. If you’re a LinkedIn-savvy professional with a passion for sales and growth, this is your chance to be part of an early-stage journey with real impact.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Build and manage global connections using LinkedIn and other digital platforms</li>\n<li>Handle the complete sales cycle – from prospecting and outreach to closing deals</li>\n<li>Generate and qualify leads through digital and networking channels</li>\n<li>Create persuasive pitches and proposals for potential clients</li>\n<li>Explore and open new markets and partnership opportunities</li>\n<li>Work closely with founders and core team to support business strategy</li>\n<li>Maintain CRM records and track sales performance</li>\n<li>Take initiative and contribute ideas for business growth</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Strong communication and negotiation skills</li>\n<li>Proven experience or strong interest in sales and business development</li>\n<li>Skilled in LinkedIn lead generation and digital outreach</li>\n<li>Self-motivated with a go-getter attitude</li>\n<li>Comfortable working in a fast-paced startup environment</li>\n<li>Good organizational and time-management skills</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Passion for startups, growth, and learning</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "LinkedIn Lead Generation",
            "Sales Strategy",
            "CRM Management"
        ],
        "summary": "Drive business growth through sales and partnerships at a fast-paced startup. Requires digital outreach, market expansion, and strategic collaboration."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27459",
        "location": "Technopark",
        "closing_date": "11 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Trainonex Solutions (P) Ltd</strong>\nGround Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala - 695581\n<a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<h2>Job Title</h2>\n<p><strong>Walk-In Interview for TELESALES EXECUTIVE</strong></p>\n<h2>Walk-In Details</h2>\n<ul>\n<li><strong>Date</strong>: 11th February 2026</li>\n<li><strong>Time</strong>: 10:30 AM to 12:30 PM</li>\n<li><strong>Job Published</strong>: 7th February 2026</li>\n<li><strong>Contact Email</strong>: trainonexsolutions.hr@gmail.com</li>\n</ul>\n<h2>Brief Description</h2>\n<p>We are seeking an energetic and confident <strong>Telesales Executive</strong> to join our growing team. This role is ideal for individuals passionate about sales and customer interaction. Responsibilities include:\n- Making outbound calls to potential and existing customers\n- Promoting products/services professionally\n- Explaining product features, pricing, and benefits\n- Handling customer queries and providing accurate information\n- Following up on leads and maintaining records\n- Building strong customer relationships</p>\n<h2>Requirements</h2>\n<ul>\n<li><strong>Experience</strong>: 0–1 year (Freshers welcome)</li>\n<li>Immediate joiners preferred</li>\n<li>Open to male and female candidates</li>\n<li><strong>Fluency in Malayalam required</strong></li>\n<li>Willingness to work from the office</li>\n</ul>\n<h2>Compensation</h2>\n<ul>\n<li><strong>Basic Pay</strong>: ₹14,000–₹20,000/month</li>\n<li>Performance-based incentives</li>\n</ul>\n<h2>Application Instructions</h2>\n<ul>\n<li>Email subject line: \"Telesales Executive\"</li>\n<li>Apply for Technopark entry pass via <a href=\"http://vms.technopark.org\">vms.technopark.org</a> or mobile app (Android/<a href=\"https://example.com\">iOS</a>)</li>\n<li>Entry pass sent to mobile/email; show softcopy at Technopark gates</li>\n<li>Non-smartphone users can print pass using 5-digit OTP at kiosks</li>\n<li>Original certificates required for verification</li>\n</ul>\n<h2>Venue</h2>\n<p><strong>Technopark Phase 1, Carnival Building, Ground Floor, Kazhakuttam, Trivandrum - 695581</strong></p>",
        "tags": [
            "0-1 Years",
            "Malayalam",
            "Telesales",
            "Customer Relationship Management"
        ],
        "summary": "Trainonex Solutions seeks a Telesales Executive (0-1 years) with Malayalam fluency. Responsibilities include outbound calls, customer engagement, and sales promotion."
    },
    {
        "job_title": "Technical Support Executive (Male Candidates Only)",
        "company": "Breeze Brain Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27458",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Breeze Brain Technologies (P) Ltd</strong>\nModule 20, SBC, 2nd Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"https://www.breezebrain.com\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p><strong>Technical Support Executive (Male Candidates Only)</strong></p>\n<h2>Application Deadline</h2>\n<p><strong>Closing Date:</strong> 10 Feb 2026\n<strong>Job Published:</strong> 07 Feb 2026</p>\n<h2>Contact</h2>\n<p>📧 Email: <a href=\"mailto:careers@breezebrain.com\">careers@breezebrain.com</a></p>\n<h2>Job Overview</h2>\n<p>Breeze Brain Technologies Pvt Ltd is seeking a dynamic and enthusiastic <strong>Technical Support Executive</strong> to join our growing team. You will serve as the primary point of contact for customers facing technical and software-related issues, delivering prompt and effective support. This role requires strong communication skills, a problem-solving mindset, and a willingness to travel for field assignments.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li><strong>Customer Interaction:</strong> Communicate with customers to understand and diagnose technical/software issues.</li>\n<li><strong>Issue Resolution:</strong> Provide timely solutions and ensure customer satisfaction.</li>\n<li><strong>Collaboration:</strong> Work with internal teams to resolve complex or escalated issues.</li>\n<li><strong>Documentation:</strong> Accurately document all customer interactions, issues, and resolutions for future reference and quality assurance.</li>\n<li><strong>Field Support:</strong> Conduct onsite visits to provide hands-on technical assistance when needed.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Experience:</strong> 2-4 years in technical support or a similar customer-facing technical role.</li>\n<li><strong>Languages:</strong> Excellent verbal and written communication in <strong>Tamil, Malayalam</strong>, and <strong>English</strong>.</li>\n<li><strong>Education:</strong> Graduate degree in <strong>Computer Science, Information Technology</strong>, or related disciplines.</li>\n<li><strong>Personality:</strong> Young, energetic, and enthusiastic <strong>male candidates</strong> preferred.</li>\n<li><strong>Travel:</strong> Willingness and ability to travel for onsite technical support.</li>\n<li><strong>License:</strong> Valid driving license required.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates who meet the above criteria should email their resume to <strong>careers@breezebrain.com</strong> with the subject line: <strong>“Job Application - Technical Support Executive”</strong></p>\n<p>⚠️ Note: Applications with a different subject line will not be considered.</p>",
        "tags": [
            "2-4 Years",
            "Technical Support",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "Breeze Brain Technologies seeks a Technical Support Executive with 2-4 years experience to resolve technical issues and provide onsite support. Requires multilingual communication skills and a valid driving license."
    },
    {
        "job_title": "Channel Journalist Intern",
        "company": "Sree Anand Travel & Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27457",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>SREE ANAND TRAVEL &amp; TECHNOLOGIES (P) Ltd</strong></p>\n<p><strong>Address:</strong> SBC-12, Basement Floor 2, Thejaswini Building, Techno Park Campus, Karyavattom (PO), Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.anandtravel.com\">www.anandtravel.com</a>\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 07, Feb 2026\n<strong>Contact Email:</strong> anandtravel40@gmail.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Channel Journalist Intern</strong> to join our newsroom team. The ideal candidate will possess strong journalistic instincts, excellent on-camera presence, and the ability to deliver news stories with clarity, credibility, and impact. This role combines <strong>reporting, anchoring, and editorial collaboration</strong> to ensure our channel delivers trusted and engaging content.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Present live and recorded news bulletins with professionalism and authority.</li>\n<li>Conduct interviews with guests, experts, and public figures.</li>\n<li>Collaborate with producers and reporters to shape editorial direction.</li>\n<li>Research, write, and edit scripts for news segments.</li>\n<li>Uphold journalistic integrity and adhere to ethical reporting standards.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>Strong verbal communication and public speaking skills.</li>\n<li>Ability to remain composed under pressure and during live broadcasts.</li>\n<li>Deep knowledge of current affairs, politics, business, and social issues.</li>\n<li>Bachelor’s degree in Journalism, Mass Communication, or related field preferred.</li>\n<li>Fluency in English; regional language skills are an advantage.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary and benefits package.</li>\n<li>Opportunity to work with a leading media channel.</li>\n<li>Professional growth and training in broadcast journalism.</li>\n<li>A dynamic and collaborative newsroom environment.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>To apply, please send your resume and a brief cover letter outlining your interest and relevant experience to <strong>anandtravel40@gmail.com</strong>.</p>",
        "tags": [
            "0-1 Years",
            "Journalism",
            "Broadcast",
            "Communication"
        ],
        "summary": "Channel Journalist Intern needed for live news delivery, interviews, and editorial collaboration. Offers training and growth in a dynamic media environment."
    },
    {
        "job_title": "Business Presentation Specialist",
        "company": "Sentorus Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27456",
        "location": "Technopark",
        "closing_date": "21 Feb 2026",
        "job_description": "<p><strong>Sentorus Business Solutions (P) Ltd</strong>\n<strong>AMSTOR HOUSE, FIRST FLOOR, TECHNOPARK CAMPUS PHASE 1, 695581</strong>\n<a href=\"https://www.sentorus.io\">Visit Website</a></p>\n<p><strong>Job Title</strong>: Business Presentation Specialist\n<strong>Closing Date</strong>: 21 Feb 2026\n<strong>Published Date</strong>: 7 Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@sentorus.io\">careers@sentorus.io</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a skilled <strong>Business Presentation Specialist</strong> with <strong>1–5 years of experience</strong> in creating high-quality corporate presentations and business documents. The role demands a strong design sense, structured thinking, and the ability to translate business content into clear, visually compelling narratives.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop professional, high-impact business presentations and pitch decks</li>\n<li>Create and format corporate documents (proposals, reports, brochures, executive summaries)</li>\n<li>Ensure consistency in branding, layout, formatting, and visual quality across all deliverables</li>\n<li>Convert complex data and content into clear, visually engaging presentations</li>\n<li>Collaborate with internal teams and stakeholders to understand requirements and timelines</li>\n<li>Review, enhance, and standardize existing presentations for clarity and effectiveness</li>\n<li>Manage multiple assignments while meeting quality standards and deadlines</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>1–5 years</strong> of experience in business presentation design or document production</li>\n<li>Strong proficiency in <strong>Microsoft PowerPoint</strong> and related document tools</li>\n<li>Excellent understanding of <strong>layout, typography, and visual hierarchy</strong></li>\n<li>Strong communication and content-structuring skills</li>\n<li>High attention to detail with a quality-focused approach</li>\n<li>Ability to work independently and within cross-functional teams</li>\n<li>Willingness to work in consecutive night shifts and flexible schedules, as required</li>\n</ul>\n<h3>Compensation &amp; Benefits</h3>\n<ul>\n<li>Salary: As per industry standards, based on experience</li>\n<li>Exposure to diverse, business-critical projects</li>\n<li>Opportunity to grow in a structured, professional work environment</li>\n</ul>\n<h3>Why Join Sentorus?</h3>\n<ul>\n<li>Be part of a collaborative and growth-oriented organization</li>\n<li>Work on high-visibility corporate and client-facing presentations</li>\n</ul>\n<p><strong>Application Instructions</strong>: Interested candidates may forward their detailed resumes to <a href=\"mailto:careers@sentorus.io\">careers@sentorus.io</a> along with their notice period, current and expected CTC details.</p>",
        "tags": [
            "1–5 Years",
            "Microsoft PowerPoint",
            "Layout & Typography",
            "Visual Hierarchy"
        ],
        "summary": "Business Presentation Specialist creates high-quality corporate presentations and documents. Requires 1–5 years of experience in design and strong PowerPoint skills."
    },
    {
        "job_title": "PHP Intern (AI-Augmented Development)",
        "company": "Timesworld Media And Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27455",
        "location": "Technopark",
        "closing_date": "07 Mar 2026",
        "job_description": "<h2><strong>Company Information</strong></h2>\n<p><strong>Timesworld Media and Technology Solutions (P) Ltd</strong>\nOffice 2305, Yamuna Building\nTechnopark Phase-III Campus,\nTrivandrum, Kerala , 695583\n<a href=\"https://www.timesworld.com\">Visit Website</a></p>\n<h2><strong>Job Title</strong></h2>\n<p>PHP Intern (AI-Augmented Development)</p>\n<h2><strong>Closing Date</strong></h2>\n<p>07, Mar 2026</p>\n<h2><strong>Published Date</strong></h2>\n<p>07, Feb 2026</p>\n<h2><strong>Contact Information</strong></h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:hr.tvm@timesworld.com\">hr.tvm@timesworld.com</a></li>\n<li><strong>Application Link</strong>: <a href=\"https://www.timesworld.com/careers/phpintern-ai-aug-dev\">Apply Here</a></li>\n</ul>\n<h2><strong>Brief Description</strong></h2>\n<p>We are seeking a tech-savvy PHP Intern who is eager to bridge the gap between traditional backend development and modern AI workflows. This role is designed for a forward-thinking recent graduate who not only wants to learn robust PHP coding but is also passionate about using Prompt Engineering and AI tools to accelerate development and solve complex problems. You will work alongside experienced developers to build scalable applications while helping us pioneer AI-integrated engineering workflows.</p>\n<h2><strong>Key Responsibilities</strong></h2>\n<h3><strong>Core Development &amp; Learning</strong></h3>\n<ul>\n<li>Code Assistance: Write clean, basic PHP scripts and assist in maintaining server-side logic under the guidance of senior mentors.</li>\n<li>Documentation: Create technical documentation optimized for both human understanding and AI-assisted context (LLM-friendly docs).</li>\n<li>Testing &amp; Maintenance: Assist in troubleshooting bugs and performing unit tests to ensure application reliability.</li>\n<li>Lifecycle Participation: Engage in all phases of the development lifecycle, from initial brainstorming to deployment.</li>\n</ul>\n<h3><strong>AI &amp; Prompt Engineering Integration</strong></h3>\n<ul>\n<li>AI-Assisted Coding: Actively use AI tools (e.g., Claude, Antigravity, GitHub Copilot, ChatGPT) to generate boilerplate code, refactor functions, and explain complex logic.</li>\n<li>Prompt Optimization: Experiment with and refine prompts to ensure AI-generated code meets our security and style standards.</li>\n<li>Automation: Help the team identify routine tasks that can be automated through AI or smart scripts to improve overall productivity.</li>\n</ul>\n<h3><strong>Innovation &amp; Knowledge Sharing</strong></h3>\n<ul>\n<li>Trend Tracking: Stay updated on the latest PHP features and emerging AI/LLM trends.</li>\n<li>Collaborative Learning: Participate in code reviews and share \"prompting tips\" with the team to foster an AI-first culture.</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<ul>\n<li><strong>Education</strong>: Recently completed a Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li><strong>Technical Skills</strong>:</li>\n<li>PHP Basics: Foundational knowledge of PHP syntax, variables, loops, and basic database interactions (MySQL).</li>\n<li>Web Fundamentals: Familiarity with HTML, CSS, and JavaScript.</li>\n<li>AI Interest: High proficiency in using AI chat interfaces and a strong curiosity about Prompt Engineering techniques.</li>\n<li><strong>Preferred Skills</strong>:</li>\n<li>Frameworks &amp; Modern Tooling (A Plus): Basic exposure to the Laravel framework, understanding of Git for version control, exposure to API concepts (REST).</li>\n<li><strong>Soft Skills</strong>:</li>\n<li>Critical Thinking: Ability to verify and debug AI-generated code rather than following it blindly.</li>\n<li>Communication: Strong verbal and written communication skills to explain logic and collaborate on prompts.</li>\n<li>Adaptability: A \"fast-learner\" mindset ready to pivot as AI tools evolve.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "PHP",
            "Laravel",
            "AI/LLM"
        ],
        "summary": "A PHP Intern role integrating AI tools and prompt engineering, ideal for a recent graduate to learn backend development while pioneering AI-augmented workflows."
    },
    {
        "job_title": "Senior Software Engineer - Java",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27454",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Job Title</strong>: Senior Software Engineer - Java\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Job Overview</strong></h3>\n<p>We are seeking a <strong>Senior Software Engineer (SSE)</strong> with hands-on experience in <strong>Java</strong> and <strong>Microservices-based application development</strong>.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Design, develop, and maintain Java-based microservices applications.</li>\n<li>Build and consume RESTful APIs for internal/external integrations.</li>\n<li>Implement business logic using <strong>Spring Boot / Spring Framework</strong>.</li>\n<li>Ensure high-quality code via unit/integration testing and code reviews.</li>\n<li>Collaborate with Dev Leads, Architects, and QA teams for end-to-end feature delivery.</li>\n<li>Troubleshoot, debug, and resolve application issues.</li>\n<li>Optimize application performance, scalability, and reliability.</li>\n<li>Follow best practices for coding, security, and documentation.</li>\n<li>Participate in Agile ceremonies (sprint planning, stand-ups, retrospectives).</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<h4><strong>Primary Skills</strong></h4>\n<ul>\n<li>Bachelor’s in Engineering/Technology (4 years) or Master’s in Computer Applications (2 years).</li>\n<li><strong>4+ years</strong> of software development experience.</li>\n<li>Expertise in <strong>Java</strong>, <strong>Spring Boot/Node.js</strong>, <strong>React/Angular</strong>, and <strong>RDBMS/NoSQL databases</strong>.</li>\n<li>Proficiency in front-end languages (HTML, CSS, JavaScript, AngularJS).</li>\n<li>Ability to perform code reviews and merge pull requests.</li>\n<li>Full-stack development skills (backend + UI).</li>\n<li>Familiarity with <strong>DevOps tasks</strong>, <strong>RDBMS/NoSQL databases</strong>, <strong>Apache web servers</strong>, and <strong>UI/UX design</strong>.</li>\n<li>Experience with IDEs, <strong>Git</strong>, <strong>Jenkins</strong>, <strong>Maven</strong>, <strong>Gradle</strong>.</li>\n<li>Backend integration and enterprise-level software development.</li>\n<li>Open-source software expertise and enterprise-scale system security understanding.</li>\n<li>Strong problem-solving and communication skills.</li>\n<li>Business requirement translation and timeline management.</li>\n<li>Contributions to hiring, training, mentoring, and team-building.</li>\n<li>Testing frameworks: <strong>JUnit</strong>, <strong>Jest</strong>, <strong>JMeter</strong>, <strong>Selenium</strong>.</li>\n</ul>\n<h4><strong>Secondary Skills</strong></h4>\n<ul>\n<li><strong>Docker/Kubernetes</strong> for containerized deployments.</li>\n<li><strong>AWS/Azure/GCP</strong> cloud platforms.</li>\n<li><strong>CI/CD pipelines</strong> (Jenkins, GitHub Actions, GitLab CI).</li>\n<li>Messaging systems: <strong>Kafka/RabbitMQ</strong>.</li>\n<li><strong>SQL/NoSQL databases</strong>.</li>\n<li>Application security (OAuth2, JWT, TLS).</li>\n<li>Logging/monitoring tools: <strong>ELK</strong>, <strong>Prometheus</strong>, <strong>Grafana</strong>, <strong>CloudWatch</strong>.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Forward resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does <strong>not</strong> charge any fees for job applications. All communications are via official website, LinkedIn, or the HR email above. Report suspicious activity to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "4+ Years",
            "Java",
            "Spring Boot",
            "Microservices"
        ],
        "summary": "Senior Software Engineer - Java role requiring 4+ years of experience in microservices, Spring Boot, and full-stack development. Focus on enterprise-level Java applications with Agile collaboration and DevOps practices."
    },
    {
        "job_title": "Java lead",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27453",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Company Info</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p>Java Lead</p>\n<h2>Closing Date</h2>\n<p>13, Feb 2026</p>\n<h2>Job Published</h2>\n<p>06, Feb 2026</p>\n<h2>Contact</h2>\n<p>📧 <strong>Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h2>Brief Description</h2>\n<p>We are seeking a <strong>Development Lead (Dev Lead / Technical Lead)</strong> with strong hands-on experience in <strong>Java</strong> and <strong>Microservices</strong> to lead a team of developers in designing, developing, and delivering high-quality, scalable applications. The role requires a balance of coding, technical decision-making, and team mentorship.</p>\n<h2>Job Description</h2>\n<ul>\n<li>Create, design, and implement layouts for new and existing software solutions.</li>\n<li>Lead a team of engineers and ensure high-quality software delivery.</li>\n<li>Take ownership of design responsibilities and ensure approachability for team members.</li>\n<li>Translate client business requirements into technical specifications.</li>\n<li>Identify impacts of planned work on existing functionality.</li>\n<li>Plan, estimate, and conduct code reviews for quality assurance.</li>\n<li>Monitor technical debt and manage it at acceptable levels.</li>\n<li>Lead client interactions from a technical perspective.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Primary Skills</h3>\n<ul>\n<li><strong>7+ years</strong> of industry experience, with <strong>2+ years</strong> in a lead role for enterprise-scale applications.</li>\n<li><strong>Bachelor's in Engineering/Technology</strong> (4-year) or <strong>Master's in Computer Applications</strong> (2-year).</li>\n<li><strong>6+ years</strong> of software development experience.</li>\n<li>Expertise in <strong>Java</strong>, <strong>Spring Boot/Node JS</strong>, <strong>React JS/Angular JS</strong>, and <strong>RDBMS/NoSQL databases</strong>.</li>\n<li>Proficiency in front-end technologies (HTML, CSS, JavaScript, AngularJS).</li>\n<li>Conduct code reviews and adopt best practices.</li>\n<li>Lead backend/UI code delivery and ensure DevOps execution.</li>\n<li>Maintain logging/monitoring in production environments.</li>\n<li>Exceptional problem-solving and communication skills.</li>\n<li>Translate client requirements into software specifications.</li>\n<li>Create technical documentation (flowcharts, diagrams, etc.).</li>\n<li>Experience with <strong>OMS products for retail</strong> is advantageous.</li>\n<li>Ability to estimate requirements and lead technical client discussions.</li>\n<li>Conduct POCs/demos and provide team feedback.</li>\n<li>Manage hiring, training, mentoring, and team-building.</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Participate in daily scrums and proactively address risks.</li>\n<li>Own non-functional requirements (performance, security, i18n/l10n).</li>\n<li>Lead agile teams with two-week iteration cadences.</li>\n<li>Collaborate with stakeholders to socialize designs/ideas.</li>\n<li>Self-motivated with minimal supervision.</li>\n</ul>\n<h2>Certifications</h2>\n<ul>\n<li><strong>Oracle Certified Java Professional</strong></li>\n<li><strong>Spring Certified Professional</strong></li>\n<li><strong>NoSQL/Cassandra/MongoDB Certification</strong></li>\n<li><strong>GCP, AWS, Azure Certification</strong> (Mandatory)</li>\n<li><strong>Retail OMS/Supply Chain Product Certifications</strong></li>\n</ul>\n<h2>Important Notice</h2>\n<ul>\n<li>Submit resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC.</li>\n<li><strong>Warning</strong>: Reflections does <strong>not</strong> charge fees for jobs. All communications are via official website/LinkedIn or <strong>Careers@reflectionsinfos.com</strong>.</li>\n</ul>\n<h2>Fraud Alert</h2>\n<ul>\n<li>Report suspicious activity to <strong>Careers@reflectionsinfos.com</strong>.</li>\n</ul>",
        "tags": [
            "7+ Years",
            "Java",
            "Spring Boot",
            "React JS"
        ],
        "summary": "Lead Java development for scalable applications, managing teams and client interactions. Requires 7+ years experience in enterprise software with expertise in Java, Spring Boot, and React."
    },
    {
        "job_title": "Solution Architect - Java",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27452",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date</strong>: 13 February 2026\n<strong>Published Date</strong>: 6 February 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced <strong>Solution Architect</strong> with hands-on expertise in <strong>Java</strong> and <strong>Microservices architecture</strong> to design and lead enterprise application solutions.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design and define end-to-end solution architecture for enterprise applications using Java and Microservices.</li>\n<li>Lead architecture discussions, technical design reviews, and solution blueprints.</li>\n<li>Drive microservices-based application design, including service decomposition, API contracts, and integration patterns.</li>\n<li>Define and govern RESTful API standards and service-to-service communication.</li>\n<li>Collaborate with product owners, business stakeholders, and development teams to translate requirements into technical solutions.</li>\n<li>Provide technical leadership and mentorship to development teams.</li>\n<li>Ensure solutions meet non-functional requirements (scalability, performance, availability, security).</li>\n<li>Review code, architecture artifacts, and enforce best practices.</li>\n<li>Support DevOps, CI/CD strategy, and cloud-native adoption.</li>\n<li>Identify technical risks and propose mitigation strategies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>10+ years</strong> of industry experience, including <strong>3+ years</strong> in an Architect or similar role.</li>\n<li><strong>Bachelor’s/Master’s</strong> in Engineering/Technology or Computer Applications.</li>\n<li><strong>6+ years</strong> of software development experience.</li>\n<li>Expertise in <strong>Java</strong>, <strong>Spring Boot</strong>, <strong>React JS/Angular JS</strong>, and <strong>RDBMS/NoSQL databases</strong>.</li>\n<li>Strong front-end skills (HTML, CSS, JavaScript, AngularJS).</li>\n<li>Proficiency in code reviews, DevOps execution, and logging/monitoring.</li>\n<li>Exceptional problem-solving and communication skills.</li>\n<li>Ability to translate business requirements into technical solutions.</li>\n<li>Experience with <strong>OMS products for retail</strong> and <strong>retail OMS/Supply Chain certifications</strong>.</li>\n<li>Leadership in technical discussions, client demos, and team performance feedback.</li>\n<li>Contributions to hiring, training, and team-building initiatives.</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Docker/Kubernetes for containerized deployments.</li>\n<li>Cloud platforms (AWS, Azure, GCP).</li>\n<li>CI/CD pipelines (Jenkins, GitHub Actions, GitLab CI).</li>\n<li>Messaging systems (Kafka/RabbitMQ).</li>\n<li>SQL/NoSQL databases.</li>\n</ul>\n<h3>Basic Knowledge</h3>\n<ul>\n<li>Application security (OAuth2, JWT, TLS).</li>\n<li>Logging/monitoring tools (ELK, Prometheus, Grafana, CloudWatch).</li>\n</ul>\n<h3>Important Notice</h3>\n<ul>\n<li>Submit resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details.</li>\n<li><strong>Warning</strong>: Reflections Info Systems does not charge fees for job applications. All communications are via official channels. Contact <strong>Careers@reflectionsinfos.com</strong> for clarifications.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Java",
            "Spring Boot",
            "Microservices"
        ],
        "summary": "A Solution Architect with Java and Microservices expertise is needed to lead technical design, mentor teams, and ensure enterprise application scalability and security."
    },
    {
        "job_title": "Senior .NET Developer – Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27451",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Senior .NET Developer – Azure</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Closing Date</strong>: 13th February 2026\n<strong>Published</strong>: 6th February 2026\n<strong>Contact</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Senior .NET Developer</strong> with <strong>8+ years</strong> of experience in <strong>.NET Core</strong> and <strong>Microsoft Azure</strong> to design, develop, and maintain scalable, high-performance enterprise applications. This role demands strong technical ownership, architectural depth, and effective collaboration within an <strong>Agile/Scrum</strong> environment.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, enhance, document, and maintain applications using <strong>.NET Core 6/8+, C#, REST APIs</strong>, and <strong>MS SQL Server</strong></li>\n<li>Build and maintain <strong>cloud-native solutions on Microsoft Azure</strong></li>\n<li>Develop and consume <strong>RESTful APIs</strong> and integrate with third-party systems</li>\n<li>Implement <strong>Microservices</strong> and <strong>SOA-based architectures</strong></li>\n<li>Apply <strong>Clean Architecture, DDD, and CQRS</strong> patterns for scalable solutions</li>\n<li>Participate in <strong>Agile/Scrum ceremonies</strong>, sprint planning, and <strong>Jira-based tracking</strong></li>\n<li>Troubleshoot, debug, and optimize applications with a focus on <strong>performance, reliability, and security</strong></li>\n<li>Write <strong>clean, reusable, testable, and efficient code</strong></li>\n<li>Support <strong>CI/CD pipelines</strong> and deployment processes</li>\n<li>Collaborate with cross-functional teams and provide <strong>technical guidance and mentorship</strong></li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Backend &amp; Core Technologies</h4>\n<ul>\n<li><strong>C#, .NET Core 6/8+</strong></li>\n<li><strong>Entity Framework / EF Core</strong></li>\n<li><strong>REST API development &amp; API integrations</strong></li>\n<li><strong>MS SQL Server</strong> (complex queries, stored procedures, views/functions)</li>\n</ul>\n<h4>Azure Cloud</h4>\n<ul>\n<li><strong>Azure Functions &amp; Durable Functions</strong></li>\n<li><strong>Azure Messaging Services</strong> (Service Bus, Event Grid, Storage Queues)</li>\n<li><strong>Azure Storage (Blob Storage)</strong></li>\n<li><strong>Azure Key Vault</strong></li>\n<li><strong>Azure SQL Database</strong></li>\n</ul>\n<h4>Architecture &amp; Design</h4>\n<ul>\n<li><strong>Microservices &amp; SOA</strong></li>\n<li><strong>Domain-Driven Design (DDD)</strong></li>\n<li><strong>Clean Architecture</strong></li>\n<li><strong>CQRS patterns/frameworks</strong></li>\n</ul>\n<h4>Testing &amp; Quality</h4>\n<ul>\n<li><strong>Unit testing frameworks</strong> (xUnit / MSTest)</li>\n<li><strong>Problem-solving, debugging, and analytical skills</strong></li>\n<li><strong>Communication and documentation skills</strong></li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li><strong>Front-end frameworks</strong>: Angular / React</li>\n<li><strong>Azure API Management (APIM)</strong></li>\n<li><strong>Containerization &amp; Orchestration</strong>: Docker, AKS / Kubernetes</li>\n<li><strong>Azure DevOps</strong>: CI/CD pipelines (Classic &amp; YAML)</li>\n<li><strong>Application Monitoring &amp; Support</strong>: Application Insights, Azure Monitor</li>\n<li><strong>Azure Data Factory (ADF)</strong></li>\n<li><strong>Azure Logic Apps</strong></li>\n<li><strong>Application support and operational monitoring</strong></li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li><strong>Strong interpersonal and communication skills</strong></li>\n<li>Ability to work <strong>independently</strong> and take <strong>end-to-end ownership</strong></li>\n<li>Proven ability to <strong>collaborate across teams</strong></li>\n<li>Willingness to <strong>mentor junior developers</strong></li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details. <strong>Important</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are via official website, LinkedIn, or the HR email id. For clarifications, contact <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Microsoft Azure",
            "C#"
        ],
        "summary": "Senior .NET Developer with Azure expertise to design and maintain scalable applications. Requires 8+ years experience in .NET Core and cloud-native solutions."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27450",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>14+ years seasoned Technical Delivery Manager</strong> to oversee the successful delivery of complex technical projects and solutions. The ideal candidate will have a strong technology background, exceptional project management skills, and the ability to collaborate with cross-functional teams. This role requires end-to-end ownership of project delivery, ensuring alignment with business goals, managing stakeholder expectations, and driving technical excellence.</p>\n<h3>Responsibilities</h3>\n<p><strong>Project Delivery Management</strong>:\n- Oversee planning, execution, and delivery of multiple technical projects.\n- Manage project scope, timelines, budgets, risks, and quality.\n- Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n<p><strong>Team Leadership</strong>:\n- Lead and mentor cross-functional technical teams, fostering collaboration and innovation.\n- Conduct regular performance reviews and provide growth opportunities for team members.</p>\n<p><strong>Stakeholder Engagement</strong>:\n- Act as a bridge between technical teams, business stakeholders, and clients.\n- Communicate project status, risks, and solutions effectively to all stakeholders.</p>\n<p><strong>Technical Expertise</strong>:\n- Collaborate with architects and engineers to define technical solutions.\n- Provide input on architecture, design, and implementation strategies.</p>\n<p><strong>Process Improvement</strong>:\n- Identify opportunities to improve project delivery processes and tools.\n- Implement best practices in software development and delivery.</p>\n<p><strong>Risk and Issue Management</strong>:\n- Proactively identify project risks and develop mitigation strategies.\n- Resolve technical and operational challenges in a timely manner.</p>\n<p><strong>Customer Focus</strong>:\n- Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</p>\n<h3>Preferred Skills</h3>\n<p><strong>Experience</strong>:\n- 14+ years in technology delivery roles, including hands-on development and leadership responsibilities.\n- Proven experience in delivering large-scale, complex projects with diverse teams.\n- Manage P&amp;L for a portfolio of accounts, ensuring revenue growth and profitability.\n- Plan and manage team ramp-ups and ramp-downs using pyramid planning, external hiring, and internal sourcing.\n- Drive account management activities including financial tracking, invoice collection, margin improvements, and resource planning.\n- Build strong client relationships through regular interactions, QBRs, and on-site visits.\n- Support account mining by identifying new opportunities, preparing proposals, and influencing stakeholders to grow the business.</p>\n<p><strong>Technical Expertise</strong>:\n- Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.\n- Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</p>\n<p><strong>Project Management</strong>:\n- Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.\n- Certification such as PMP, CSM, or equivalent is an advantage.</p>\n<p><strong>Leadership and Communication</strong>:\n- Excellent team leadership, people management, and conflict resolution skills.\n- Strong communication, presentation, and negotiation abilities.</p>\n<p><strong>Education</strong>:\n- Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</p>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Experience in managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices and frameworks.</li>\n<li>Strong business acumen with the ability to align technical goals with business strategy.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does not charge any fees for job applications. Fraudsters may falsely claim to represent the company. All official communications are sent through the official HR email id. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "14+ Years",
            "Agile/Scrum",
            "Cloud Technologies (AWS, Azure, GCP)",
            "Project Management (PMP, CSM)"
        ],
        "summary": "A 14+ year seasoned Technical Delivery Manager is needed to lead complex projects, manage cross-functional teams, and ensure technical excellence while aligning with business goals."
    },
    {
        "job_title": "Solution Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27449",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Job Published:</strong> 06, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Solution Architect</strong> to support the design and delivery of scalable, secure, and high-performing technology solutions for our clients. This role combines hands-on technical expertise with strong architectural thinking. You will collaborate with senior architects, delivery teams, and stakeholders to understand business needs, create robust solution designs, and ensure successful implementation across multiple projects.</p>\n<h3>Responsibilities</h3>\n<h4>Architecture &amp; Design</h4>\n<ul>\n<li>Assist in creating solution architectures, high-level designs, and technical diagrams.</li>\n<li>Contribute to the development and evolution of technical strategies for assigned services or projects.</li>\n<li>Evaluate new technologies, tools, and frameworks for potential use in client solutions.</li>\n<li>Support and contribute to proof-of-concepts, prototypes, and feasibility assessments.</li>\n</ul>\n<h4>Collaboration &amp; Delivery</h4>\n<ul>\n<li>Work closely with development teams to ensure adherence to architectural standards and design principles.</li>\n<li>Participate in code reviews, technical design sessions, and agile ceremonies.</li>\n<li>Collaborate with multidisciplinary teams (policy, product, engineering, QA) to ensure user-centric designs.</li>\n<li>Assist in defining how we build and operate open-source, cloud-first solutions at scale.</li>\n</ul>\n<h4>Governance &amp; Stakeholder Engagement</h4>\n<ul>\n<li>Work with both technical and non-technical stakeholders to clarify requirements and support technology decisions.</li>\n<li>Communicate architectural vision and solution rationale clearly across teams.</li>\n<li>Identify deeper underlying problems and contribute to broader digital transformation initiatives.</li>\n<li>Support profession-based activities such as defining architecture standards, guidelines, and best practices.</li>\n<li>Contribute actively to communities of practice to strengthen awareness, inclusivity, and technical excellence.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Technical Skills</h4>\n<ul>\n<li>Solid understanding of software development principles and system design concepts.</li>\n<li>Hands-on experience with at least one programming language (Java, Python, C#, or similar).</li>\n<li>Practical knowledge across the web stack—from frontend technologies to backend, cloud, infrastructure, and networking.</li>\n<li>Experience with cloud-first architectures (AWS, Azure, or GCP) and designing solutions that leverage cloud-native capabilities.</li>\n<li>Knowledge of databases, integration patterns, APIs, and microservices.</li>\n<li>Familiarity with open-source technologies and modern development practices.</li>\n</ul>\n<h4>Professional Skills</h4>\n<ul>\n<li>Experience working with technical teams in an agile delivery environment.</li>\n<li>Ability to work collaboratively with stakeholders to reach agreement on technical decisions.</li>\n<li>Strong analytical and problem-solving skills, with the ability to identify broader architectural implications beyond immediate issues.</li>\n<li>Excellent communication skills with the ability to simplify complex technical concepts for different audiences.</li>\n</ul>\n<h3>Certifications &amp; Education</h3>\n<ul>\n<li>Bachelor’s degree in computer science, Software Engineering, or related technical field.</li>\n</ul>\n<h3>Application Process</h3>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are conducted through official channels (website or LinkedIn). For clarification, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "Not Specified",
            "Java",
            "AWS",
            "Microservices"
        ],
        "summary": "Solution Architect role requiring technical expertise in cloud and system design, collaborating with teams to deliver scalable solutions."
    },
    {
        "job_title": "Cloud Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27448",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2><strong>Job Posting: Cloud Infrastructure Architect</strong></h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking an experienced <strong>Cloud and Infrastructure Architect</strong> to lead enterprise-wide infrastructure strategy and implementation across public cloud platforms and on-premise data center technologies. This role requires an expert who can drive cloud adoption strategies, hybrid infrastructure design, seamless migration execution, and infrastructure security governance while aligning technical solutions with broader business and IT goals.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Lead the development and execution of enterprise infrastructure strategies for public cloud, private cloud, and on-premise data centers.</li>\n<li>Drive cloud adoption and migration programs, including assessments, migration planning, execution governance, and post-migration optimization.</li>\n<li>Architect robust solutions across compute, storage, networking, virtualization, and enterprise security best standards.</li>\n<li>Provide thought leadership and decision-making guidance on public cloud services, data center technologies, and emerging infrastructure trends.</li>\n<li>Design and enforce strong infrastructure security practices, governance frameworks, and compliance adherence (e.g., GDPR, PCI DSS, HIPAA).</li>\n<li>Collaborate with enterprise architecture, security, DevOps, application, and network teams to ensure cohesive infrastructure delivery.</li>\n<li>Drive continuous improvement initiatives aimed at infrastructure scalability, automation, performance, and cost optimization.</li>\n<li>Support pre-sales activities, including RFP/RFI responses, solution design, cost estimations, and client workshops.</li>\n<li>Evaluate and manage partnerships with cloud providers, OEMs, and technology vendors to validate solution feasibility, strengthen service capabilities, and drive aligned GTM.</li>\n<li>Develop and maintain technical documentation, accelerators, frameworks, and solution blueprints.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li><strong>15+ years</strong> of professional experience in IT infrastructure design, implementation, and operations, including <strong>5+ years</strong> focused on cloud and data center architecture.</li>\n<li>Proven track record in enterprise cloud migration projects, hybrid cloud strategy execution, and digital transformation initiatives.</li>\n<li>Strong expertise in public cloud platforms, designing solutions using native services for compute, storage, networking, identity, security, and automation.</li>\n<li>Strong background in data center technologies, including virtualization (VMware, Hyper-V), storage systems, network architecture, and infrastructure security.</li>\n<li>Solid knowledge of containerization and orchestration (Docker, Kubernetes/OpenShift) supporting infrastructure modernization.</li>\n<li>Strong understanding of IaC and automation tools such as Terraform, Ansible, CloudFormation, ARM Templates.</li>\n<li>Demonstrated expertise in security architecture and compliance, including identity management, network segmentation, and data protection.</li>\n<li>Strong consulting and client engagement capabilities, assessments, solution presentations, and executive discussions.</li>\n<li>Experience with enterprise monitoring, logging, and observability tools (Splunk, Prometheus, Grafana, New Relic).</li>\n<li>Strong analytical skills with experience in cost assessment, TCO analysis, and infrastructure optimization for cloud and data centers.</li>\n<li>Good experience in pre-sales, solution design, RFP responses, and deal support.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are conducted through the official website or LinkedIn. For any clarification or alerts, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "15+ Years",
            "Cloud Platforms",
            "Infrastructure as Code",
            "Security Compliance"
        ],
        "summary": "Lead enterprise cloud and on-premise infrastructure strategies with 15+ years of experience in cloud architecture, security governance, and hybrid migration. Expertise in public cloud platforms and automation tools."
    },
    {
        "job_title": "Senior DotNet Developer + Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27447",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Senior DotNet Developer + Azure</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>\n<strong>Working Hours</strong>: 12:00 PM - 9:00 PM</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, enhance, document, and maintain robust applications using <strong>.NET Core 6/8+</strong>, <strong>C#</strong>, <strong>REST APIs</strong>, <strong>T-SQL</strong>, and modern <strong>JavaScript/jQuery</strong></li>\n<li>Integrate and support third-party APIs and external services</li>\n<li>Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack</li>\n<li>Identify, prioritize, and execute tasks throughout the <strong>Software Development Life Cycle (SDLC)</strong></li>\n<li>Participate in <strong>Agile/Scrum ceremonies</strong> and manage tasks using <strong>Jira</strong></li>\n<li>Understand technical priorities, architectural dependencies, risks, and implementation challenges</li>\n<li>Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>8+ years</strong> of hands-on development experience with:</li>\n<li><strong>C#</strong>, <strong>.NET Core 6/8+</strong>, <strong>Entity Framework / EF Core</strong></li>\n<li><strong>JavaScript</strong>, <strong>jQuery</strong>, <strong>REST APIs</strong></li>\n<li><strong>MS SQL Server</strong> expertise (Complex SQL queries, Stored Procedures, Views, Functions, Packages, Cursors, Tables, Object Types)</li>\n<li>Unit testing with <strong>XUnit</strong>, <strong>MSTest</strong></li>\n<li>Software design patterns, system architecture, and scalable solution design</li>\n<li>Leadership through clear communication, technical mentorship, and ownership</li>\n<li>Problem-solving and debugging capabilities</li>\n<li>Writing reusable, testable, and efficient code</li>\n<li>Developing frameworks and shared libraries for large-scale applications</li>\n<li>Excellent technical documentation, communication, and leadership skills</li>\n<li><strong>Microservices</strong> and <strong>Service-Oriented Architecture (SOA)</strong></li>\n<li><strong>API Integrations</strong></li>\n</ul>\n<h3>Azure Cloud Services (2+ years)</h3>\n<ul>\n<li><strong>Azure Functions</strong>, <strong>Azure Durable Functions</strong></li>\n<li><strong>Azure Service Bus</strong>, <strong>Event Grid</strong>, <strong>Storage Queues</strong></li>\n<li><strong>Blob Storage</strong>, <strong>Azure Key Vault</strong>, <strong>SQL Azure</strong></li>\n<li><strong>Application Insights</strong>, <strong>Azure Monitoring</strong></li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Familiarity with <strong>AngularJS</strong>, <strong>ReactJS</strong>, and other front-end frameworks</li>\n<li>Experience with <strong>Azure API Management (APIM)</strong></li>\n<li>Knowledge of <strong>Azure Containerization</strong> and <strong>Orchestration</strong> (e.g., <strong>AKS/Kubernetes</strong>)</li>\n<li>Experience with <strong>Azure Data Factory (ADF)</strong> and <strong>Logic Apps</strong></li>\n<li>Exposure to <strong>Application Support</strong> and operational monitoring</li>\n<li><strong>Azure DevOps</strong> - CI/CD pipelines (<strong>Classic / YAML</strong>)</li>\n</ul>\n<h3>Application Process</h3>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are conducted through the official website or LinkedIn. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "C#",
            "Azure"
        ],
        "summary": "Senior DotNet Developer with Azure expertise required for designing scalable applications, leading teams, and integrating cloud services. Requires 8+ years of experience in .NET, C#, and Azure ecosystems."
    },
    {
        "job_title": "Manual QA Engineer (Azure Cloud)",
        "company": "Se-Mentor Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27446",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Company:</strong> SE-Mentor Solutions (P) Ltd\n<strong>Address:</strong> 2nd Floor, Gayathri Building, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.se-mentor.com\">http://www.se-mentor.com</a>\n<strong>Job Title:</strong> Manual QA Engineer (Azure Cloud)\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 06, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@se-mentor.com\">careers@se-mentor.com</a></p>\n<h3>Overview</h3>\n<p>Are you a Quality Assurance pro who knows the Azure ecosystem inside out? We’re looking for a <strong>Manual QA Engineer</strong> with very sound exposure in <strong>Azure Cloud Platform</strong> for our project opening in <strong>Bangalore</strong>.</p>\n<h3>Key Details</h3>\n<ul>\n<li><strong>Notice Period:</strong> Immediate to 30 Days</li>\n<li><strong>Location:</strong> Hoodi, Bangalore</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Manual Testing Excellence:</strong> 4+ years in functional, regression, and UAT testing.</li>\n<li><strong>Azure DevOps Native:</strong> Proficient in <strong>Azure Test Plans</strong> and <strong>Azure Boards</strong>.</li>\n<li><strong>Cloud Knowledge:</strong> Familiarity with <strong>Azure Portal</strong> and basic cloud services (Storage, SQL).</li>\n</ul>\n<h3>Contact</h3>\n<p>For inquiries, reach out to <a href=\"mailto:careers@se-mentor.com\">careers@se-mentor.com</a>.</p>",
        "tags": [
            "4+ Years",
            "Manual Testing",
            "Azure Test Plans",
            "Azure Cloud"
        ],
        "summary": "Manual QA Engineer with 4+ years of Azure Cloud testing experience required for a Bangalore-based project. Proficiency in Azure Test Plans and functional testing is essential."
    },
    {
        "job_title": "Senior Software Engineer - Calypso",
        "company": "Naga Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27445",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Company</strong>: Naga Info Solutions (P) Ltd\n<strong>Location</strong>: Dubai\n<strong>Contact Email</strong>: <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a>\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Job Published</strong>: 06, Feb 2026</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Senior Software Engineer (Calypso)</strong> to join our client project in Dubai. The role involves <strong>end-to-end Calypso implementation, integration, and support</strong> across front, middle, and back-office systems, with strong exposure to <strong>trading and risk management platforms</strong>.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Implement, configure, and maintain Calypso systems across asset classes</li>\n<li>Handle front-to-back implementations including <strong>Risk Management (ERS – Limits &amp; VaR)</strong></li>\n<li>Develop and customize Calypso components using <strong>Java</strong></li>\n<li>Manage integrations with <strong>trade capture</strong> and <strong>market data systems</strong></li>\n<li>Troubleshoot application, server, and integration issues</li>\n<li>Support system analysis, enhancements, and production issues</li>\n<li>Collaborate with cross-functional teams and drive technical solutions</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Technical Skills</h4>\n<ul>\n<li><strong>Strong hands-on experience with Calypso</strong> (minimum version V15.2)</li>\n<li>In-depth knowledge of Calypso architecture, APIs, modules, and data model</li>\n<li><strong>Java development experience</strong> (Java 1.7+) – OOPS, Collections, Multithreading</li>\n<li><strong>Oracle PL/SQL experience</strong></li>\n<li>Application servers: <strong>JBoss</strong></li>\n<li>Build tools: <strong>Gradle</strong></li>\n<li>Experience with <strong>Open API integration patterns</strong></li>\n<li>Integration with <strong>Bloomberg (SAPI), Reuters, TOMS, Deal Tracker</strong></li>\n<li>Strong troubleshooting skills at application, network, and server levels</li>\n</ul>\n<h4>Functional Skills</h4>\n<ul>\n<li><strong>Fixed Income, Money Market, FX, Interest Rate &amp; Credit Derivatives</strong></li>\n<li><strong>Credit &amp; Market Risk</strong> (ERS limits, VaR setup)</li>\n<li><strong>Official P&amp;L and Accounting setup</strong> in Calypso</li>\n<li><strong>Curve and Market Data configuration</strong></li>\n<li><strong>Front office and workstation setup</strong></li>\n<li><strong>Back-office operations</strong>: settlements, transfers, static data, messaging</li>\n<li><strong>Position configuration and lifecycle management</strong></li>\n</ul>\n<h4>Good to Have</h4>\n<ul>\n<li>Experience across multiple Calypso implementations</li>\n<li>Strong understanding of trading platforms and financial markets</li>\n<li>Excellent communication and stakeholder-management skills</li>\n<li>Ability to work independently and drive initiatives end-to-end</li>\n</ul>\n<h3>Apply</h3>\n<p>Interested candidates may send their CVs to <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a>.</p>",
        "tags": [
            "7–10 Years",
            "Calypso",
            "Java",
            "Oracle PL/SQL"
        ],
        "summary": "Senior Software Engineer (Calypso) in Dubai with 7-10 years of experience in financial systems implementation, Java development, and risk management platforms."
    },
    {
        "job_title": "PROJECT MANAGER",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/27444",
        "location": "Technopark",
        "closing_date": "02 Mar 2026",
        "job_description": "<p><strong>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</strong></p>\n<p><strong>Location:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"https://www.ateamsoftsolutions.com\">https://www.ateamsoftsolutions.com</a>\n<strong>Job Title:</strong> Project Manager\n<strong>Closing Date:</strong> 02, Mar 2026\n<strong>Published Date:</strong> 06, Feb 2026\n<strong>Contact Email:</strong> recruitment@ateamsoftsolutions.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Project Manager / Project Lead</strong> with strong experience in the <strong>Hospital Information System (HIS)</strong> domain. The ideal candidate should have managed IT healthcare projects and understand hospital workflows and HIS modules. <strong>Middle East project experience</strong> is an added advantage.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead and manage IT projects in the <strong>HIS (Hospital Information System)</strong> domain.</li>\n<li>Coordinate with internal teams, clients, and stakeholders for smooth project delivery.</li>\n<li>Understand HIS requirements and support implementation activities.</li>\n<li>Track tasks, project progress, and reporting using <strong>Jira</strong>.</li>\n<li>Ensure project milestones are completed on time.</li>\n<li>Handle client communication, documentation, and issue resolution.</li>\n<li>Identify risks and ensure quality project execution.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>6+ years</strong> of experience as a Project Manager / Lead in IT projects.</li>\n<li>Strong domain knowledge in <strong>Hospital Information Systems (HIS)</strong>.</li>\n<li>Experience working with healthcare clients and hospital processes.</li>\n<li>Hands-on experience with <strong>Jira</strong>.</li>\n<li>Good communication and leadership skills.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Middle East</strong> project experience in healthcare/HIS domain.</li>\n<li>Experience working with hospital departments such as OPD, IPD, Billing, Pharmacy, Lab, EMR, etc.</li>\n<li>Exposure to HIS implementation, migration, and integration with other hospital systems.</li>\n<li>Knowledge of healthcare standards and compliance is a plus.</li>\n</ul>",
        "tags": [
            "6+ Years",
            "Hospital Information Systems (HIS)",
            "Jira",
            "Healthcare Project Management"
        ],
        "summary": "Lead IT projects in the Hospital Information System domain with 6+ years of experience. Manage healthcare clients and ensure project delivery using Jira."
    },
    {
        "job_title": "Product Engineer - SAS DMS",
        "company": "Naga Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27443",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<p><strong>Company</strong>: Naga Info Solutions (P) Ltd\n<strong>Address</strong>: Module No 2505, 5th Floor, Yamuna Building, Technopark Phase III, 695583\n<strong>Website</strong>: <a href=\"http://www.nagainfo.com\">http://www.nagainfo.com</a></p>\n<p><strong>Job Title</strong>: Product Engineer - SAS DMS\n<strong>Closing Date</strong>: 20, Feb 2026\n<strong>Published Date</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are hiring an experienced <strong>Product Engineer - SAS DMS</strong> for our client project based in <strong>Chennai</strong>. This is a <strong>techno-functional Developer-Admin role</strong> in the banking domain, ideal for professionals with strong experience in <strong>SaaS-based platforms</strong>, <strong>Document Management Systems (DMS)</strong>, and <strong>Virtual Account Banking (VAB)</strong>. The role offers <strong>end-to-end ownership of modules</strong> in a product-driven environment with a <strong>competitive salary package</strong>.</p>\n<h3><strong>Location</strong></h3>\n<p>Chennai</p>\n<h3><strong>Experience Required</strong></h3>\n<ul>\n<li><strong>5+ years</strong> of relevant experience in <strong>Banking or Financial Services</strong></li>\n</ul>\n<h3><strong>Role Highlights</strong></h3>\n<ul>\n<li>Opportunity to work on <strong>enterprise-scale banking products</strong></li>\n<li><strong>Hands-on role</strong> covering both development and administration</li>\n<li>Strong exposure to <strong>SAS DMS</strong> and <strong>Virtual Account Banking (VAB)</strong></li>\n<li><strong>Ownership of application modules</strong> from requirements to production</li>\n<li><strong>Collaborative, product-focused</strong>, and <strong>SaaS-driven environment</strong></li>\n<li><strong>Competitive salary package</strong> and long-term growth potential</li>\n</ul>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Design, develop, configure, and support <strong>SAS DMS (Document/Design Management System)</strong> modules</li>\n<li>Work on <strong>Virtual Account Banking (VAB)</strong> features, enhancements, and support</li>\n<li>Act as a <strong>Developer–Admin</strong>, managing development and administrative activities</li>\n<li>Own and manage <strong>DMS and VAB modules end-to-end</strong>, including requirement analysis and implementation</li>\n<li>Build and maintain <strong>API integrations</strong> with internal systems and third-party platforms</li>\n<li>Develop and support <strong>event-driven processing using Kafka</strong></li>\n<li>Collaborate with <strong>product, business, and banking stakeholders</strong> to deliver scalable solutions</li>\n<li>Ensure <strong>performance, security, availability</strong>, and compliance of <strong>SaaS applications</strong></li>\n<li>Troubleshoot production issues, perform <strong>root cause analysis</strong>, and implement permanent fixes</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<h4><strong>Required</strong></h4>\n<ul>\n<li><strong>5+ years</strong> of experience in the <strong>Banking / Financial Services</strong> domain</li>\n<li>Strong experience with <strong>SaaS-based application development</strong></li>\n<li>Hands-on expertise in <strong>DMS (Document/Design Management Systems)</strong></li>\n<li>Experience working with <strong>Virtual Account Banking (VAB)</strong> solutions</li>\n<li>Strong knowledge of <strong>API integrations (REST/SOAP)</strong></li>\n<li>Working experience with <strong>Kafka</strong> and <strong>event-driven architectures</strong></li>\n<li>Good understanding of <strong>techno-functional banking workflows</strong></li>\n<li>Ability to work independently and take <strong>end-to-end ownership</strong></li>\n</ul>\n<h4><strong>Good to Have</strong></h4>\n<ul>\n<li>Experience in <strong>product-based</strong> or <strong>platform-driven environments</strong></li>\n<li>Strong analytical and <strong>problem-solving skills</strong></li>\n<li>Excellent <strong>communication</strong> and <strong>stakeholder management</strong> abilities</li>\n</ul>\n<h3><strong>How to Apply</strong></h3>\n<p>Interested candidates may send their CVs to <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a></p>",
        "tags": [
            "5+ Years",
            "SAS DMS",
            "Virtual Account Banking (VAB)",
            "API Integrations (REST/SOAP)"
        ],
        "summary": "A techno-functional Product Engineer role in banking, requiring 5+ years of experience with SAS DMS, Virtual Account Banking, and SaaS platforms. Focus on end-to-end ownership of modules and API integrations in a product-driven environment."
    },
    {
        "job_title": "Software Engineer - FinIQ",
        "company": "Naga Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27442",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<p><strong>Company</strong>: Naga Info Solutions (P) Ltd\n<strong>Location</strong>: Dubai\n<strong>Website</strong>: <a href=\"http://www.nagainfo.com\">http://www.nagainfo.com</a>\n<strong>Closing Date</strong>: 20, Feb 2026\n<strong>Job Published</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a></p>\n<p><strong>Brief Description</strong>\nWe are seeking an experienced <strong>Software Engineer</strong> with hands-on expertise in the <strong>FinIQ Wealth Management Suite</strong> for a client project. The role involves front-to-back system implementation, trade lifecycle management, and integration with banking/trading platforms in a dynamic financial services environment.</p>\n<p><strong>Role Highlights</strong>\n- End-to-end FinIQ Wealth Management implementations\n- Exposure to global banking, asset management, and trading platforms\n- High-impact role in a fast-paced financial services/fintech environment\n- Collaborative work culture with ownership and visibility\n- Hands-on API integrations and event-driven systems</p>\n<p><strong>Key Responsibilities</strong>\n- Implement and support front-to-back FinIQ Wealth Management solutions\n- Manage the complete trade lifecycle\n- Deliver end-to-end system implementations using FinIQ\n- Perform API integrations with internal/external systems\n- Collaborate with business/technical teams during implementation\n- Ensure coding, security, testing, and documentation standards\n- Support Agile delivery models for stable system releases</p>\n<p><strong>Preferred Skills</strong>\n- <strong>Mandatory</strong>: 5–6+ years FinIQ implementation experience\n- Strong FinIQ architecture/module expertise\n- Proficiency in SQL/SQL-based databases\n- Solid understanding of asset management and investment banking\n- Experience with trading platforms/systems (Advent, SAXO, SWIFT, Bloomberg, Reuters)\n- Knowledge of protocols: FIX, EMSX, TSOX\n- Event-driven systems experience\n- Agile environment experience</p>\n<p><strong>Good to Have</strong>\n- Banking/FinTech domain experience\n- Business analysis in trading/wealth management platforms\n- Technology benchmarking and best practices\n- Focus on quality/scalability\n- Excellent communication/stakeholder management</p>\n<p><strong>How to Apply</strong>\nSend CVs to <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a></p>",
        "tags": [
            "5–6+ Years",
            "FinIQ",
            "SQL",
            "Asset Management"
        ],
        "summary": "Experienced Software Engineer needed for FinIQ Wealth Management implementations in Dubai. Requires 5–6+ years of FinIQ experience and expertise in financial systems integration."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/27441",
        "location": "Technopark",
        "closing_date": "15 Feb 2026",
        "job_description": "<h2>Upcommune Business Network (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 22, -2 , Thejaswini Building, Technopark, Thiruvananthapuram , 695581\n<strong>Website:</strong> <a href=\"https://www.upcommune.net\">https://www.upcommune.net</a>\n<strong>Closing Date:</strong> 15, Feb 2026\n<strong>Job Published:</strong> 06, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:mail@upcommune.net\">mail@upcommune.net</a></p>\n<h3>Job Description</h3>\n<ul>\n<li>Plan and implement integrated digital marketing strategies to support overall business objectives.</li>\n<li>Identify key corporate customer segments and design targeted marketing campaigns to drive strong results.</li>\n<li>Develop and manage B2B marketing initiatives across <strong>SEO</strong>, <strong>SEM</strong>, email marketing, display advertising, and paid social channels.</li>\n<li>Build, refine, and optimize lead generation funnels, marketing automation processes, and lead-nurturing journeys.</li>\n<li>Execute and optimize performance marketing campaigns on <strong>Google Ads</strong>, LinkedIn, and programmatic platforms to improve lead quality and ROI.</li>\n<li>Enhance website user experience and conversion flows while maintaining SEO best practices across all content.</li>\n<li>Oversee and expand ECS Fin’s digital presence on LinkedIn, Twitter, and other relevant platforms.</li>\n<li>Monitor emerging digital marketing trends, tools, and market developments, and recommend strategic improvements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Graphic designer with experience in <strong>0 -1 year</strong>.</li>\n<li>Familiarity with design software such as <strong>Illustrator</strong>, <strong>Photoshop</strong>.</li>\n<li>Ability to think creatively and develop new design concepts, graphics, and layouts.</li>\n<li>Strong communication skills to present ideas effectively.</li>\n<li>Excellent graphic design skills with a strong portfolio.</li>\n<li><strong>PPT design knowledge</strong> is an advantage.</li>\n</ul>\n<p><strong>Note:</strong> Kindly mention the post name in the subject line.\n<strong>Location:</strong> Technopark, Thiruvananthapuram.</p>",
        "tags": [
            "0-1 Year",
            "SEO",
            "SEM",
            "Google Ads"
        ],
        "summary": "Plan integrated digital marketing strategies, manage B2B campaigns, and optimize Google Ads to drive lead generation and ROI."
    },
    {
        "job_title": "Business Development Executive (BDE) – IT Services / Custom ERP Solutions",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/27440",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</h2>\n<p><strong>Location:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"https://www.ateamsoftsolutions.com\">www.ateamsoftsolutions.com</a></p>\n<h3>Walk-In Interview Details</h3>\n<p><strong>Role:</strong> Business Development Executive (BDE) – IT Services / Custom ERP Solutions\n<strong>Date:</strong> 09 February 2026\n<strong>Time:</strong> 10:00 AM – 4:00 PM\n<strong>Published:</strong> 06 February 2026\n<strong>Contact:</strong> recruitment@ateamsoftsolutions.com | +91 7907410058</p>\n<h3>Role Overview</h3>\n<p>We seek a dynamic Business Development Executive with <strong>2+ years in IT Services Sales</strong>, prioritizing experience in the <strong>Middle East</strong> or <strong>USA markets</strong>. This outbound sales role focuses on selling <strong>custom ERP solutions</strong> to mid-sized businesses (100+ employees), requiring cold calling and engagement with senior decision-makers.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Generate leads via cold calling and outbound outreach</li>\n<li>Sell <strong>custom-built ERP solutions</strong> (not off-the-shelf)</li>\n<li>Engage CTOs, CIOs, COOs, and Operations Heads</li>\n<li>Propose tailored ERP solutions based on client workflows</li>\n<li>Manage full sales cycle from lead to closure</li>\n<li>Coordinate with technical teams for solution alignment</li>\n<li>Maintain CRM updates and pipeline tracking</li>\n<li>Focus on <strong>Middle East/USA markets</strong></li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>2+ years</strong> in IT Services Sales</li>\n<li>Proven experience selling <strong>custom ERP solutions</strong></li>\n<li><strong>Cold calling</strong> as primary lead generation</li>\n<li>Strong communication (8/10+)</li>\n<li><strong>Middle East/USA market exposure</strong></li>\n<li>Comfort engaging senior leadership</li>\n</ul>\n<h3>Profiles Not Considered</h3>\n<ul>\n<li>Candidates with <strong>India-only experience</strong></li>\n<li>Candidates relying solely on inbound leads</li>\n</ul>\n<h3>Walk-In Venue</h3>\n<p><strong>Address:</strong> 2nd Level, Thejaswini Building, Technopark, Trivandrum, Kerala, India\n<strong>Entry Pass Requirements:</strong>\n- Apply via <a href=\"vms.technopark.org\">Technopark VMS</a> (mobile app or web)\n- Entry pass sent to registered mobile/email\n- Show softcopy on device or print hardcopy with 5-digit OTP\n- Original certificates verified at entry gate</p>\n<p><strong>Apply Now:</strong> Share resume, full name, and contact number via WhatsApp or email to recruitment@ateamsoftsolutions.com</p>",
        "tags": [
            "2+ Years",
            "Custom ERP Solutions",
            "Cold Calling",
            "Middle East/USA Market Exposure"
        ],
        "summary": "Outbound Business Development Executive for IT Services/Custom ERP Solutions with 2+ years of experience in Middle East/USA markets. Requires cold calling and senior stakeholder engagement."
    },
    {
        "job_title": "Tele caller / Counselor - Female",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/27439",
        "location": "Technopark",
        "closing_date": "15 Feb 2026",
        "job_description": "<p><strong>Upcommune Business Network (P) Ltd</strong></p>\n<p><strong>Address:</strong> SBC 22, -2, Thejaswini Building, Technopark, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"https://www.upcommune.net\">https://www.upcommune.net</a>\n<strong>Contact Email:</strong> mail@upcommune.net</p>\n<p><strong>Job Title:</strong> Tele Caller / Counselor - Female\n<strong>Closing Date:</strong> 15, Feb 2026\n<strong>Published Date:</strong> 06, Feb 2026\n<strong>Location:</strong> Technopark &amp; Thiruvananthapuram</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Make outbound calls to customers.</li>\n<li>Promote products and services using a prepared script.</li>\n<li>Answer customer inquiries and address concerns.</li>\n<li>Achieve sales targets and report on call activities.</li>\n<li>Maintain accurate records of customer interactions.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Plus two &amp; Above or equivalent.</li>\n<li>Strong customer service and sales skills.</li>\n<li>Ability to handle rejection and stay positive.</li>\n<li>Experience in telecalling or sales is a plus.</li>\n<li>Coordinating with team.</li>\n<li>Good Communication in English, Tamil / Telugu / Hindi.</li>\n</ul>\n<p><strong>Note:</strong> Kindly mention the post name in the subject line of your application.</p>",
        "tags": [
            "Fresh Graduates",
            "Customer Service",
            "Sales Skills",
            "Multilingual Communication"
        ],
        "summary": "Outbound telecaller role requiring customer service, sales skills, and multilingual communication to promote products and meet targets."
    },
    {
        "job_title": "HR MANAGER",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27438",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Trainonex Solutions (P) Ltd</strong>\nGround Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<h2>Job Title</h2>\n<p><strong>HR Manager</strong></p>\n<h2>Closing Date</h2>\n<p>09, Feb 2026</p>\n<h2>Job Published</h2>\n<p>06, Feb 2026</p>\n<h2>Contact Information</h2>\n<p><strong>Email:</strong> <a href=\"mailto:trainonexsolutions.hr@gmail.com\">trainonexsolutions.hr@gmail.com</a></p>\n<h2>Job Overview</h2>\n<p>We are seeking a proactive and organized <strong>HR Manager</strong> to join our expanding team. This role is ideal for freshers or those aspiring to build a career in Human Resources. The successful candidate should be confident, detail-oriented, and capable of managing basic HR operations, employee coordination, and recruitment monitoring.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Oversee end-to-end recruitment processes (sourcing, resume screening, interview coordination, and candidate selection)</li>\n<li>Serve as the primary HR contact for employees and candidates, resolving queries professionally and promptly</li>\n<li>Manage onboarding and induction programs for new hires</li>\n<li>Ensure compliance with company policies and employment regulations</li>\n<li>Handle daily HR administrative tasks and support office coordination</li>\n<li>Maintain HR reports, attendance records, and documentation</li>\n<li>Demonstrate strong payroll management skills (salary processing, attendance tracking, and payroll accuracy)</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li><strong>Experience:</strong> 0–1 year (freshers welcome)</li>\n<li><strong>Gender:</strong> Female candidates preferred</li>\n<li><strong>Availability:</strong> Immediate joiners preferred</li>\n<li><strong>Skills:</strong> Excellent communication, basic MS Office proficiency, documentation knowledge, office attendance required</li>\n<li><strong>Salary:</strong> ₹14,000 – ₹18,000 per month</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Submit your application with the subject line: <strong>“HR Manager Application”</strong></p>",
        "tags": [
            "0-1 Year",
            "MS Office",
            "Communication Skills",
            "Payroll Management"
        ],
        "summary": "Seeking an HR Manager with 0-1 year experience to manage recruitment, onboarding, and payroll. Salary: ₹14,000–₹18,000/month."
    },
    {
        "job_title": "Flutter Developer Trainee",
        "company": "Seqato Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27437",
        "location": "Technopark",
        "closing_date": "06 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>SEQATO Software Solutions (P) Ltd</strong>\nLevel-1, Nila Building, Technopark Campus, 695581\n<a href=\"http://www.seqato.com\">http://www.seqato.com</a></p>\n<h2>Job Details</h2>\n<p><strong>Position</strong>: Flutter Developer Trainee\n<strong>Closing Date</strong>: 06, Mar 2026\n<strong>Published</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:opportunities@seqato.com\">opportunities@seqato.com</a></p>\n<h2>Brief Description</h2>\n<p>We are seeking a <strong>Flutter Developer – Trainee</strong> passionate about mobile application development and eager to learn cross-platform technologies. This role is ideal for fresh graduates with basic knowledge of Flutter and Dart, willing to grow in a real-world development environment.</p>\n<h2>Roles and Responsibilities</h2>\n<ul>\n<li>Assist in developing cross-platform mobile applications using the Flutter framework.</li>\n<li>Work on UI implementation using Flutter widgets under senior developer guidance.</li>\n<li>Support API integration and application data handling.</li>\n<li>Collaborate with design systems and component libraries for consistency.</li>\n<li>Optimize performance and resolve bugs to enhance app quality.</li>\n<li>Participate in sprint planning, daily standups, and retrospectives.</li>\n<li>Engage in code reviews, testing, debugging, and documentation.</li>\n<li>Learn and follow best practices in mobile app development.</li>\n<li>Collaborate with teams to understand requirements and deliver tasks on time.</li>\n</ul>\n<h2>Required Skills</h2>\n<ul>\n<li>Basic Flutter and Dart programming knowledge.</li>\n<li>Understanding of OOP concepts and Flutter widgets/layouts/navigation.</li>\n<li>Familiarity with UI/UX basics, REST APIs, JSON data handling, and state management (Provider/Bloc).</li>\n<li>Git/version control basics.</li>\n<li>Problem-solving and analytical skills.</li>\n<li>Strong interest in mobile development.</li>\n</ul>\n<h2>Qualification and Experience</h2>\n<ul>\n<li>Any graduate (B.E/B.Tech/BCA/MCA/B.Sc/M.Sc or equivalent).</li>\n<li>Freshers eligible; candidates with internships, academic projects, or GitHub portfolios preferred.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Academic/personal Flutter projects.</li>\n<li>Firebase services familiarity.</li>\n<li>Android (Java/Kotlin) or iOS (Swift) fundamentals.</li>\n<li>UI/UX design tools (Figma, Adobe XD).</li>\n<li>Widget/integration testing basics.</li>\n<li>CI/CD concepts.</li>\n<li>App analytics tools.</li>\n<li>Responsive design principles.</li>\n<li>Agile development understanding.</li>\n</ul>\n<h2>Preferred Candidate Profile</h2>\n<ul>\n<li>Willingness to learn new technologies.</li>\n<li>Team collaboration and communication skills.</li>\n<li>Self-motivated with proactive learning attitude.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Flutter",
            "Dart",
            "Git"
        ],
        "summary": "Seeking a Flutter Developer Trainee with basic Flutter/Dart knowledge to assist in cross-platform app development and learn in a real-world environment. Fresh graduates with eagerness to learn and collaborate in agile teams are encouraged to apply."
    },
    {
        "job_title": "AI/ML Developer Trainee",
        "company": "Seqato Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27436",
        "location": "Technopark",
        "closing_date": "06 Mar 2026",
        "job_description": "<h2><strong>AI/ML Developer Trainee</strong></h2>\n<p><strong>Company:</strong> SEQATO Software Solutions (P) Ltd\n<strong>Location:</strong> Level-1, Nila Building, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"http://www.seqato.com\">http://www.seqato.com</a>\n<strong>Closing Date:</strong> 06 Mar 2026\n<strong>Published Date:</strong> 06 Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:opportunities@seqato.com\">opportunities@seqato.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a motivated <strong>AI/ML Developer – Trainee</strong> with foundational knowledge in machine learning and a passion for data-driven problem-solving. This role is ideal for fresh graduates or entry-level candidates eager to gain hands-on experience in real-world AI/ML projects.</p>\n<h3><strong>Roles and Responsibilities</strong></h3>\n<ul>\n<li>Assist in developing, training, and evaluating machine learning models under senior guidance.</li>\n<li>Work with structured/unstructured data for preprocessing, cleaning, and feature engineering.</li>\n<li>Implement basic ML algorithms (linear regression, classification, decision trees).</li>\n<li>Support experimentation and model validation using <strong>Jupyter Notebooks</strong>.</li>\n<li>Participate in code reviews and team discussions to improve code quality.</li>\n<li>Learn ML ops best practices for deployment, versioning, and monitoring.</li>\n<li>Collaborate in agile/sprint ceremonies (standups, planning, retrospectives).</li>\n<li>Perform data analysis and visualization using libraries like <strong>Matplotlib</strong> and <strong>Seaborn</strong>.</li>\n<li>Document workflows, experiments, and results clearly.</li>\n<li>Collaborate with the team to understand project requirements and deliver tasks.</li>\n</ul>\n<h3><strong>Required Skills</strong></h3>\n<ul>\n<li>Basic understanding of statistics and linear algebra.</li>\n<li>Strong programming and algorithm fundamentals.</li>\n<li>Knowledge of ML algorithms (linear regression, decision trees, classification).</li>\n<li>Hands-on Python experience for data analysis and ML tasks.</li>\n<li>Familiarity with <strong>pandas</strong>, <strong>NumPy</strong>, and <strong>scikit-learn</strong>.</li>\n<li>Experience with <strong>Jupyter Notebooks</strong>.</li>\n<li>Data visualization skills using <strong>Matplotlib</strong> or <strong>Seaborn</strong>.</li>\n<li>Understanding of model evaluation metrics and ML workflows.</li>\n</ul>\n<h3><strong>Qualification and Experience</strong></h3>\n<ul>\n<li>Graduate in Computer Science, Data Science, AI/ML, or related fields.</li>\n<li><strong>Freshers are eligible</strong>.</li>\n<li>Preference for candidates with projects, internships, or GitHub profiles.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Exposure to deep learning frameworks (<strong>TensorFlow</strong>, <strong>PyTorch</strong>).</li>\n<li>Academic/internship projects in AI/ML.</li>\n<li>Familiarity with deep learning concepts (CNNs, RNNs).</li>\n<li>Basic SQL or data handling knowledge.</li>\n<li>Git version control awareness.</li>\n<li>Data preprocessing and feature engineering techniques.</li>\n<li>Interest in AI/ML trends.</li>\n</ul>\n<h3><strong>Candidate Profile</strong></h3>\n<ul>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Willingness to learn new technologies.</li>\n<li>Good communication and teamwork abilities.</li>\n</ul>\n<p><strong>Application Instructions:</strong> Send your updated CV to <strong>opportunities@seqato.com</strong> with the subject line <strong>SEQ_AI/ML Developer Trainee</strong>.</p>",
        "tags": [
            "Freshers (0 Years)",
            "Python",
            "scikit-learn",
            "Jupyter Notebooks"
        ],
        "summary": "Entry-level AI/ML Developer Trainee role for freshers to assist in model development, data preprocessing, and algorithm implementation using Python and scikit-learn."
    },
    {
        "job_title": "Junior Product Support Executive",
        "company": "Needstreet Web Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27435",
        "location": "Technopark",
        "closing_date": "06 Mar 2026",
        "job_description": "<h2>NeedStreet Web Technologies (P) Ltd</h2>\n<p><strong>Location:</strong> Padmanabham, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.continuouscare.io\">http://www.continuouscare.io</a>\n<strong>Closing Date:</strong> 06, Mar 2026\n<strong>Job Published:</strong> 06, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:jobs@needstreet.com\">jobs@needstreet.com</a></p>\n<h3>Brief Description</h3>\n<p>We're seeking enthusiastic individuals who grew up with technology and are passionate about helping others succeed with it. If you're someone who naturally becomes the \"go-to tech person\" among friends and family, enjoys explaining how things work, and gets satisfaction from solving puzzles—this role could be perfect for you.</p>\n<h3>What You'll Do</h3>\n<ul>\n<li>Be the friendly voice that helps healthcare providers and their teams make the most of our platform</li>\n<li>Investigate and resolve questions about product features through conversations, emails, and support tickets</li>\n<li>Create helpful content—write support articles, record tutorial videos, and build guides that make complex features easy to understand</li>\n<li>Work alongside our product and technical teams to understand customer needs and improve our platform</li>\n<li>Learn the ins and outs of digital healthcare technology, including how clinics, hospitals, and healthcare providers use our tools</li>\n</ul>\n<h3>What We're Looking For</h3>\n<ul>\n<li><strong>Digital fluency:</strong> You're comfortable navigating apps (mobile and web), exploring new features without hesitation, and learning software quickly</li>\n<li><strong>Communication skills:</strong> You can explain technical concepts in simple terms, both in writing and conversation. You enjoy teaching others and have patience when someone doesn't understand something the first time</li>\n<li><strong>Problem-solving mindset:</strong> When something doesn't work, you enjoy figuring out why. You ask good questions and think through possibilities systematically</li>\n<li><strong>Curiosity:</strong> You genuinely want to understand how things work and aren't satisfied with surface-level knowledge</li>\n<li><strong>Customer empathy:</strong> You care about making people's experience better and take pride in helping them succeed</li>\n<li><strong>Self-motivation:</strong> You don't wait to be told what to do—you see what needs attention and take initiative</li>\n<li><strong>Adaptability:</strong> You're comfortable with change and can switch between different types of tasks throughout the day</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Comfortable creating and editing content (articles, documents, presentations)</li>\n<li>Experience making videos or screen recordings (even casual ones for friends/social media)</li>\n<li>Good attention to detail—you notice when something is off</li>\n<li>Basic understanding of how databases, APIs, or web services work (not mandatory, but helpful)</li>\n<li>Interest in healthcare, wellness, or making a social impact</li>\n</ul>\n<h3>What You'll Gain</h3>\n<ul>\n<li>Deep knowledge of B2B SaaS operations and healthcare technology</li>\n<li>Hands-on experience with product support, customer success, and technical communication</li>\n<li>Mentorship from experienced team members who will invest in your growth</li>\n<li>Exposure to real-world problem-solving with a global user base</li>\n<li>A foundation for growth into product management, customer success, or technical roles</li>\n</ul>\n<h3>Why ContinuousCare?</h3>\n<p>You'll work at the intersection of healthcare and technology, supporting a platform that genuinely improves patient care and healthcare delivery. We value fresh perspectives, encourage learning, and believe great attitudes and genuine curiosity matter more than prior experience.</p>\n<p><strong>To apply</strong>, email your resume and a brief note about yourself to: <a href=\"mailto:jobs@needstreet.com\">jobs@needstreet.com</a>\n<strong>Note:</strong> This role requires you to work from the office. <strong>Location – Technopark, Trivandrum</strong>.</p>",
        "tags": [
            "No Experience Required",
            "Digital Healthcare Technology",
            "Technical Communication",
            "B2B SaaS Operations"
        ],
        "summary": "Junior Product Support Executive role in healthcare tech; requires digital fluency and communication skills. Offers B2B SaaS experience and mentorship in product support."
    },
    {
        "job_title": "Web Developer & SEO Specialist (2+ Years Exp.)",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27434",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<p><strong>Globcom Solutions (P) Ltd</strong>\n<strong>Module 2502, 5th Floor, Yamuna Building</strong>\n<strong>Technopark Phase -3, Thiruvananthapuram, 695583</strong>\n<strong><a href=\"http://www.globcomsolution.com\">Company Website</a></strong></p>\n<p><strong>Job Title</strong>: Web Developer &amp; SEO Specialist (2+ Years Exp.)\n<strong>Closing Date</strong>: 20, Feb 2026\n<strong>Published Date</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:rajesh@globcomsolution.com\">rajesh@globcomsolution.com</a></p>\n<p><strong>Brief Description</strong>\nWe (International brand developing Agency) are hiring a multi-talented professional to manage our website development and digital growth. You will be responsible for building a fast, functional site and ensuring it ranks at the top of search results.</p>\n<p><strong>Key Responsibilities</strong>\n- <strong>Web Dev</strong>: Build and maintain responsive websites with clean code and fast load times.\n- <strong>SEO</strong>: Execute technical audits, keyword research, and on-page optimization.\n- <strong>Marketing</strong>: Manage paid ad campaigns (Google/Meta) and track ROI.\n- <strong>Analytics</strong>: Monitor site health and traffic using GA4 and Search Console.</p>\n<p><strong>Preferred Skills &amp; Requirements</strong>\n- <strong>Experience</strong>: Minimum 2 years in a dual Developer/Digital Marketer role.\n- <strong>Tech Stack</strong>: Proficient in WordPress/PHP, HTML, CSS, and JavaScript.\n- <strong>Marketing Tools</strong>: Hands-on experience with SEMrush, Meta Ads Manager, and GTM.\n- <strong>Portfolio</strong>: Must show live websites you’ve built and successfully ranked.\n- <strong>Location</strong>: Phase 3, Technopark</p>\n<p><strong>Application</strong>: Send your CV to <a href=\"mailto:rajesh@globcomsolution.com\">rajesh@globcomsolution.com</a></p>",
        "tags": [
            "2+ Years",
            "WordPress/PHP",
            "SEO",
            "Google Analytics"
        ],
        "summary": "Seeking a Web Developer & SEO Specialist with 2+ years of experience in dual Developer/Digital Marketer roles. Requires expertise in WordPress/PHP, SEO, and Google Analytics for website development and digital growth."
    },
    {
        "job_title": "Junior QA Engineer - Manual + Automation",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27433",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a motivated <strong>Junior QA Engineer</strong> with <strong>1–2 years</strong> of experience in <strong>manual</strong> and <strong>automation testing</strong> of web and mobile applications. The ideal candidate will have a strong foundation in manual testing techniques such as functional, regression, sanity, and exploratory testing, along with practical exposure to test automation using tools like <strong>Selenium</strong>, <strong>Playwright</strong>, <strong>Cypress</strong>, or similar frameworks.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Hands-on experience testing web applications and mobile apps</li>\n<li>Strong understanding of manual testing (functional, regression, sanity, exploratory)</li>\n<li>Practical experience in test automation (Selenium / Playwright / Cypress or similar)</li>\n<li>Ability to design test cases from requirements and identify edge cases</li>\n<li>Defect logging, tracking, and validation using <strong>Jira</strong> or equivalent</li>\n<li>Ability to analyze failures and distinguish between automation issues and product defects</li>\n<li>Exposure to logging, monitoring, and production issue validation</li>\n<li>Willingness to learn and adapt to evolving QA practices, tools, and processes</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Working knowledge of at least one programming language (Java / JavaScript / TypeScript / Python)</li>\n<li>Basic knowledge of <strong>Git/version control</strong></li>\n<li>Familiarity with cross-browser and cross-device testing</li>\n<li>Exposure to API testing (<strong>Postman</strong>, REST basics)</li>\n<li>Understanding of <strong>SDLC</strong>, <strong>STLC</strong>, and <strong>Agile/Scrum</strong> processes</li>\n</ul>\n<h2>Nice to Have</h2>\n<ul>\n<li>Database testing knowledge (basic SQL queries, data validation, CRUD operations)</li>\n<li>Exposure to <strong>CI/CD pipelines</strong> (Jenkins, GitHub Actions, GitLab CI)</li>\n<li>Familiarity with test management tools (TestRail or similar)</li>\n<li>Basic understanding of performance, security, or accessibility testing</li>\n</ul>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Application Details</h2>\n<ul>\n<li><strong>Work Arrangement</strong>: On-site</li>\n<li><strong>Employment Type</strong>: Full-time</li>\n<li><strong>Experience</strong>: 1–2 years</li>\n<li><strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/junior-qa-engineer\">https://waydot.greythr.com/hire/jobs/junior-qa-engineer</a></li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Selenium",
            "Playwright",
            "Cypress"
        ],
        "summary": "Junior QA Engineer with 1-2 years of experience in manual and automation testing for web and mobile apps. Focus on functional testing, automation frameworks, and defect tracking at a leading US automotive super app."
    },
    {
        "job_title": "Operations Executive - Event Parking",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27432",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking an experienced <strong>Operations Executive - Event Parking</strong> with experience in Operations management and process optimization.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Manage daily operations in the Event Parking vertical.</li>\n<li>Ensure operational efficiency and effectiveness.</li>\n<li>Oversee various operational processes and improve them.</li>\n<li>Coordinate with different teams and stakeholders to achieve operational goals.</li>\n<li>Deliver excellent customer service to our clients.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>MBA in any discipline</strong> (Operations/Analytics preferred)</li>\n<li><strong>Minimum 1 - 2 years of prior experience</strong> in a related field</li>\n<li>Proficiency in <strong>Excel</strong> and handling data sets</li>\n<li>Strong attention to detail with the ability to spot and correct inconsistencies</li>\n<li>Process-driven and capable of suggesting improvements where needed</li>\n<li>Problem-solving mindset with ownership of outcomes</li>\n<li>Strong communication skills for coordination across teams</li>\n<li>Flexibility to work evenings/weekends as per business requirements</li>\n</ul>\n<h3>Why Work With Us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/operations-executive-event-parking\">https://waydot.greythr.com/hire/jobs/operations-executive-event-parking</a></p>\n<p><strong>Contact Email</strong>: careers@way.com</p>",
        "tags": [
            "1-2 Years",
            "MBA (Operations/Analytics)",
            "Excel",
            "Process Optimization"
        ],
        "summary": "Operations Executive - Event Parking role requires 1-2 years of experience, MBA, and Excel skills to manage event parking operations and improve processes in a dynamic automotive tech environment."
    },
    {
        "job_title": "Sales Expert",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27431",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Sales Expert</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking dynamic, customer-focused <strong>Sales Experts</strong> to join our <strong>Refinance Team</strong>. In this role, you will be the voice of our product — engaging directly with customers, understanding their needs, and helping them choose the best refinance solutions. This is a <strong>B2C sales role</strong>, where communication skills, persuasion, and a passion for sales will make all the difference.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Engage with potential customers through <strong>inbound and outbound calls, emails, and chats</strong>.</li>\n<li>Clearly explain refinance products, features, and benefits to customers.</li>\n<li>Build <strong>trust and rapport</strong> with customers to convert inquiries into successful sales.</li>\n<li>Consistently <strong>achieve individual and team sales targets</strong>.</li>\n<li>Maintain accurate records of customer interactions and transactions in <strong>CRM systems</strong>.</li>\n<li>Collaborate with <strong>Customer Support, Product, and Marketing teams</strong> to ensure a smooth post-sale experience.</li>\n<li>Stay updated on <strong>product knowledge, process updates, and industry trends</strong>.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s or Master’s degree in any discipline (preferably Business or Engineering).</li>\n<li><strong>2–5 years of experience</strong> in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and <strong>experience with CRM tools</strong>.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/sales-expert\">https://waydot.greythr.com/hire/jobs/sales-expert</a></li>\n</ul>",
        "tags": [
            "2–5 Years",
            "B2C Sales",
            "CRM Tools",
            "Financial Products"
        ],
        "summary": "Dynamic Sales Expert role in a B2C refinance team, requiring 2–5 years of sales experience and strong communication skills. Join a top auto super app with growth opportunities."
    },
    {
        "job_title": "Operations Executive - Way+",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27430",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Way+ Operations Executive</h2>\n<p><strong>Company:</strong> Way.com India Pvt Ltd\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> WFO role\n<strong>Closing Date:</strong> 08, Feb 2026\n<strong>Published Date:</strong> 06, Feb 2026\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions like auto insurance, EV charging, and parking. Leveraging AI and data analytics, we deliver personalized, innovative services. Recognized by Bloomberg and Andreessen Horowitz, we’re redefining car ownership.</p>\n<h3>Role Overview</h3>\n<p>You will be pivotal in launching new programs, training customer service managers, and managing program success within the Way+ vertical. Responsibilities include monitoring SLAs, addressing customer escalations, and ensuring partner satisfaction. You’ll act as a knowledge expert, staying updated on product changes and supporting teams with operational needs.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li><strong>Program Launch &amp; Management:</strong> Assist in launching programs, monitor performance, and adjust strategies for success.</li>\n<li><strong>Training and Development:</strong> Provide coaching and feedback to enhance team performance.</li>\n<li><strong>Customer Engagement:</strong> Resolve complex customer issues, evaluate interactions for quality assurance, and promote program initiatives.</li>\n<li><strong>Performance Management:</strong> Track metrics, report to management, and identify process improvements.</li>\n<li><strong>Training:</strong> Develop materials and sessions for staff and partners.</li>\n<li><strong>Program Reporting:</strong> Analyze reports to assess performance and prepare insights for management.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> Minimum of 3 years in quality control, customer engagement, or related fields.</li>\n<li><strong>Skills:</strong> Strong organizational and multitasking abilities, problem-solving, communication, and proficiency in Excel and program management tools.</li>\n<li><strong>Flexibility:</strong> Adapt to last-minute changes and partner requirements with a proactive mindset.</li>\n</ul>\n<h3>Why Work With Us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Impact 10+ million users with innovative solutions.</li>\n<li>Dynamic, fast-paced culture with clear career growth.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/operations-executive-way\">https://waydot.greythr.com/hire/jobs/operations-executive-way</a></p>",
        "tags": [
            "3+ Years",
            "Excel",
            "Program Management",
            "Customer Engagement"
        ],
        "summary": "Operations Executive role at Way.com involves program management, customer engagement, and performance tracking. Requires 3+ years experience in quality control or related fields with strong organizational skills."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27429",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title</strong>: Spanish Customer Success Executive\n<strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a <strong>Spanish Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our Spanish-speaking clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction</strong>: Manage inbound and outbound calls, delivering prompt and effective resolutions to customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence</strong>: Provide empathetic, professional support to ensure a positive customer experience in every interaction.</li>\n<li><strong>Issue Escalation</strong>: Identify, prioritize, and escalate complex cases to the appropriate departments for swift resolution.</li>\n<li><strong>Documentation</strong>: Maintain accurate records of customer interactions and keep databases up to date.</li>\n<li><strong>Performance Goals</strong>: Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge</strong>: Stay informed on company products and services to provide customers with accurate and up-to-date information.</li>\n<li><strong>Team Collaboration</strong>: Work closely with colleagues to foster a supportive, collaborative, and high-performing work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Fluency in <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong interpersonal and communication skills, with a patient and empathetic approach.</li>\n<li>Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email</strong>: careers@way.com\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\">https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</a></p>",
        "tags": [
            "2-4 Years",
            "Spanish",
            "Customer Service",
            "Bilingual Communication"
        ],
        "summary": "Seeking a bilingual Spanish Customer Success Executive to provide top-tier support via phone, ensuring customer satisfaction and driving service excellence in a dynamic tech environment."
    },
    {
        "job_title": "Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27427",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powers every mile for over 10 million customers, from auto insurance and parking to EV charging. Leveraging AI, machine learning, and data analytics, we deliver personalized solutions. Ranked 48th on Andreessen Horowitz’s Marketplace list and recognized as the top Product in Insurance by UnitQ.</p>\n<h2>Job Title</h2>\n<p><strong>Customer Success Executive</strong></p>\n<h2>Work Arrangement</h2>\n<p><strong>On-site</strong></p>\n<h2>Employment Type</h2>\n<p><strong>Full-time</strong></p>\n<h2>Role Overview</h2>\n<p>We seek a dynamic, customer-focused individual for a <strong>Customer Success Executive</strong> role in our voice process. Responsibilities include:\n- Addressing customer queries via <strong>phone, email, chat, and social media</strong>.\n- Troubleshooting and resolving concerns efficiently.\n- Handling inquiries related to <strong>products, orders, returns, and general support</strong>.\n- Maintaining accurate <strong>customer records and feedback</strong> in CRM systems.\n- Escalating complex issues to internal teams.\n- Contributing to <strong>customer satisfaction metrics</strong> and suggesting improvements.\n- Ensuring professionalism, empathy, and a customer-first attitude in all interactions.</p>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>2-5 years</strong> of customer service or similar role experience.</li>\n<li>Excellent verbal/written communication.</li>\n<li>Calm under pressure with problem-solving skills.</li>\n<li>CRM system knowledge (preferred).</li>\n<li>Team collaboration and a passion for helping others.</li>\n</ul>\n<h2>Why Join Us?</h2>\n<ul>\n<li>Work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with innovative solutions.</li>\n<li>Dynamic, fast-paced, tech-driven culture.</li>\n<li>Clear career growth in a rapidly scaling company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact &amp; Apply</h2>\n<ul>\n<li><strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a></li>\n</ul>\n<h2>Location</h2>\n<p>4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>\n<h2>Closing Date</h2>\n<p>08, Feb 2026</p>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Customer Service",
            "Problem-Solving"
        ],
        "summary": "Customer Success Executive at Way.com's US automotive super app, handling multichannel support with 2-5 years of customer service experience. Full-time on-site role offering growth in a tech-driven environment."
    },
    {
        "job_title": "SEO Team Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27426",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Team Lead - SEO</p>\n<h2>Experience</h2>\n<p>9 - 11 years</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a highly skilled <strong>Team Lead, SEO</strong> to spearhead our organic growth initiatives and enhance our search engine presence. In this leadership role, you will drive the development and execution of comprehensive SEO strategies, manage a team of SEO specialists, and collaborate cross-functionally to optimize our digital footprint. If you have a deep understanding of search algorithms, technical SEO, and content strategy, along with a passion for driving results, we want to hear from you!</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies</strong> – Define and implement a robust SEO roadmap, ensuring alignment with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team</strong> – Manage a team of SEO professionals, fostering a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO</strong> – Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management</strong> – Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making</strong> – Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration</strong> – Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization</strong> – Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis</strong> – Conduct SEO audits, monitor competitor strategies, and identify new opportunities to stay ahead in the industry.</li>\n<li><strong>SEO Performance Reporting</strong> – Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data to make data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li>Understanding of PPC advertising and its relationship with organic search.</li>\n<li>Experience working in a high-growth startup or fast-paced environment.</li>\n<li>Familiarity with social media marketing and its impact on SEO.</li>\n<li>Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Apply Now</h2>\n<p><a href=\"https://waydot.greythr.com/hire/jobs/seo-team-lead\">Apply Here</a></p>\n<h2>Contact</h2>\n<p>Email: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "9-11 Years",
            "Technical SEO",
            "Content Strategy",
            "SEO Tools"
        ],
        "summary": "Lead SEO team to develop and execute strategies, optimize technical and content SEO, and drive organic growth for a top US auto app."
    },
    {
        "job_title": "Lead - QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27425",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Job Details</h2>\n<p><strong>Company</strong>: Way.com India Pvt Ltd\n<strong>Location</strong>: Trivandrum\n<strong>Job Type</strong>: WFO role\n<strong>Closing Date</strong>: 08, Feb 2026\n<strong>Published Date</strong>: 06, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, EV charging, parking, and more. Leveraging AI, machine learning, and data analytics, we deliver personalized experiences. Recognized by Bloomberg and Andreessen Horowitz, we’re redefining car ownership.</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>QA Lead</strong> to drive quality assurance across projects and releases. The ideal candidate balances hands-on automation expertise, manual testing knowledge, and leadership skills. Responsibilities include defining test strategies, mentoring teams, ensuring test coverage, and acting as a quality gatekeeper.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead QA activities across projects and release cycles</li>\n<li>Define and maintain test strategies, plans, and automation frameworks</li>\n<li>Contribute to automation scripting and framework improvements</li>\n<li>Mentor junior QA engineers and contractors</li>\n<li>Ensure functional, regression, integration, and sanity testing</li>\n<li>Collaborate with Product, Engineering, and DevOps teams</li>\n<li>Own defect lifecycle management (tracking, prioritization, root cause analysis)</li>\n<li>Ensure quality gates are met before production deployments</li>\n<li>Track QA metrics and provide stakeholder reports</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Automation Skills (Mandatory)</h4>\n<ul>\n<li>Hands-on experience with <strong>Selenium, Playwright, or Cypress</strong></li>\n<li>Proficiency in <strong>Java, JavaScript, or TypeScript</strong></li>\n<li>Framework design/maintenance experience</li>\n<li>CI/CD integration (<strong>Jenkins, GitHub Actions, GitLab CI</strong>)</li>\n<li>API testing (<strong>Postman, REST Assured</strong>)</li>\n<li>Version control (<strong>Git</strong>)</li>\n</ul>\n<h4>Manual Testing Skills</h4>\n<ul>\n<li>SDLC/STLC and Agile methodology expertise</li>\n<li>Test case design, execution, and maintenance</li>\n<li>Exploratory testing and edge-case validation</li>\n<li>Defect tracking tools (<strong>JIRA</strong>)</li>\n</ul>\n<h4>Nice to Have</h4>\n<ul>\n<li>Performance testing (<strong>JMeter</strong>)</li>\n<li>Mobile automation (<strong>Appium</strong>)</li>\n<li>Cloud platforms (<strong>AWS, Azure, GCP</strong>)</li>\n<li>Test reporting tools (<strong>Allure, ReportPortal</strong>)</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Leadership and team management</li>\n<li>Clear communication with technical/non-technical stakeholders</li>\n<li>Ownership and accountability</li>\n<li>Problem-solving and attention to detail</li>\n</ul>\n<h3>Experience Requirements</h3>\n<ul>\n<li><strong>5+ years</strong> in Software Quality Assurance</li>\n<li><strong>2+ years</strong> in a Lead/Senior QA role</li>\n<li>Hands-on manual and automation testing experience</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work for the #1 auto super app in the US</li>\n<li>Impact 10+ million users</li>\n<li>Dynamic, innovation-driven culture</li>\n<li>Career growth in a scaling tech company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/qa-lead\">QA Lead Application</a></p>",
        "tags": [
            "5+ Years",
            "Selenium",
            "Java",
            "Jenkins"
        ],
        "summary": "Lead QA efforts for a top US automotive app, requiring automation expertise and leadership. 5+ years experience in QA with 2+ years in a lead role."
    },
    {
        "job_title": "Email Marketing - Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27424",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2><strong>Email Marketing Specialist</strong></h2>\n<p><strong>Company</strong>: Way.com India Pvt Ltd\n<strong>Location</strong>: Trivandrum\n<strong>Type</strong>: WFO role\n<strong>Contact</strong>: careers@way.com\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/email-marketing-specialist\">https://waydot.greythr.com/hire/jobs/email-marketing-specialist</a></p>\n<h3><strong>About Way.com</strong></h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, EV charging, parking, and more. Recognized by Bloomberg and ranked #48 on Andreessen Horowitz’s fastest-growing companies list, we leverage AI and data analytics to redefine car ownership.</p>\n<h3><strong>Role Overview</strong></h3>\n<p>We seek a <strong>B2C Product Email Marketing Specialist</strong> to lead email strategy, automation, and customer engagement initiatives. The ideal candidate will drive growth through Klaviyo-powered workflows, data-driven segmentation, and cross-functional collaboration.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li><strong>Strategy &amp; Execution</strong>: Design and implement email campaigns to boost engagement, retention, and conversions.</li>\n<li><strong>Automation &amp; Flows</strong>: Build and optimize Klaviyo workflows (welcome series, abandoned cart, post-purchase) for lifecycle marketing.</li>\n<li><strong>Segmentation</strong>: Develop personalized campaigns using user behavior and transactional data.</li>\n<li><strong>Optimization</strong>: Conduct A/B tests on subject lines, content, and send times to enhance performance.</li>\n<li><strong>Collaboration</strong>: Partner with product, design, and content teams to align email creatives with brand and product goals.</li>\n<li><strong>Analytics</strong>: Monitor ROI, conversion rates, and churn, providing actionable insights.</li>\n<li><strong>Compliance</strong>: Ensure adherence to GDPR, CCPA, and CAN-SPAM regulations.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>2–4 years in B2C email marketing (digital products, e-commerce, or SaaS).</li>\n<li><strong>Klaviyo Expertise</strong>: Hands-on experience with automated campaigns, segmentation, and reporting.</li>\n<li><strong>Lifecycle Marketing</strong>: Proficiency in customer journey mapping and trigger-based strategies.</li>\n<li><strong>Technical Skills</strong>: HTML/CSS for email development and troubleshooting.</li>\n<li><strong>Data-Driven Approach</strong>: Google Analytics, UTM tracking, and performance analysis.</li>\n<li><strong>Copywriting</strong>: Crafting conversion-focused email content.</li>\n<li><strong>Testing Mindset</strong>: Experience with A/B testing and experimentation.</li>\n<li><strong>Communication</strong>: Strong cross-functional collaboration skills.</li>\n</ul>\n<h3><strong>Why Join Us?</strong></h3>\n<ul>\n<li>Work for the #1 auto super app in the US, impacting 10+ million users.</li>\n<li>Dynamic, innovation-driven culture with clear career growth paths.</li>\n<li>Competitive compensation and opportunities in a fast-scaling tech company.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "Klaviyo",
            "HTML/CSS",
            "Google Analytics"
        ],
        "summary": "B2C Email Marketing Specialist needed to design and optimize automated campaigns using Klaviyo, driving engagement and retention for a leading US auto super app."
    },
    {
        "job_title": "Manual Testing - QA Contract",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27423",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About the Company</h2>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, EV charging, parking, and more. Recognized as the top Product in Insurance by UnitQ and ranked 48th on Andreessen Horowitz’s Marketplace list, we leverage AI, machine learning, and data analytics to transform car ownership.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a <strong>QA Engineer - Manual Testing</strong> to validate requirements, identify defects, and ensure high-quality releases across web and mobile platforms.</p>\n<h2>Location &amp; Type</h2>\n<ul>\n<li><strong>Location</strong>: Trivandrum</li>\n<li><strong>Type</strong>: Contract</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Analyze requirements and translate them into comprehensive test scenarios and edge cases.</li>\n<li>Perform functional, regression, sanity, exploratory, and UAT support testing.</li>\n<li>Validate integrations and workflows involving multiple systems and APIs.</li>\n<li>Identify, log, and track defects with clear reproduction steps and impact analysis.</li>\n<li>Collaborate with developers to validate fixes and confirm root causes.</li>\n<li>Participate in sprint ceremonies and release planning.</li>\n<li>Validate production issues and support post-release verification.</li>\n<li>Ensure test coverage across browsers, devices, and environments.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>3–5 years</strong> of hands-on experience in manual testing.</li>\n<li>Strong testing of web applications and mobile apps.</li>\n<li>Solid understanding of SDLC, STLC, and Agile/Scrum.</li>\n<li>Experience with API testing (REST APIs, Postman, request/response validation).</li>\n<li>Cross-browser and cross-device testing expertise.</li>\n<li>Validation of production issues, logs, and monitoring outputs.</li>\n<li>Ability to write clear test scenarios and defect reports.</li>\n<li>Hands-on experience with Jira or similar defect tracking tools.</li>\n<li>Basic SQL knowledge for database testing and data validation.</li>\n<li>Strong analytical and troubleshooting skills.</li>\n</ul>\n<h2>Good to Have</h2>\n<ul>\n<li>Exposure to automation testing (script understanding/debugging).</li>\n<li>Experience with TestRail or similar test management tools.</li>\n<li>CI/CD workflow familiarity.</li>\n<li>Basic performance/security testing knowledge.</li>\n<li>Experience in fast-paced/high-availability systems.</li>\n</ul>\n<h2>Why Work With Us?</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Impact 10+ million users.</li>\n<li>Dynamic, innovation-driven culture.</li>\n<li>Clear career growth in a scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email</strong>: careers@way.com\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/manual-qa-contract\">Application Link</a></p>",
        "tags": [
            "3–5 Years",
            "Manual Testing",
            "API Testing (REST/Postman)",
            "Jira"
        ],
        "summary": "QA Engineer - Manual Testing role validating web/mobile platforms with 3-5 years experience in testing, SDLC, and API tools like Jira."
    },
    {
        "job_title": "Market Research Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27422",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Way.com</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We’re seeking an India-based <strong>Market Research Specialist</strong> to support data-driven decision-making across product, marketing, and growth. This role focuses on conducting research and online surveys to help develop Way segmentation, identify customer value of Way offerings, and provide core research for the content marketing team.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Design and execute qualitative and quantitative market research studies (surveys, interviews, desk research, competitive analysis).</li>\n<li>Analyze customer behavior, market trends, and competitive landscapes to inform product messaging.</li>\n<li>Partner with content marketing, B2C, and B2B teams to scope research questions and deliver actionable insights.</li>\n<li>Synthesize findings into reports, presentations, and summaries.</li>\n<li>Support ad hoc research for new markets, segments, or product initiatives.</li>\n<li>Implement Conjoint studies to determine the rank and value of the 11 Way+ benefits.</li>\n<li>Research product gaps and market white spaces/competitive intelligence.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>4-7 years</strong> of hands-on experience in market research, consumer insights, or related roles.</li>\n<li>Bachelor’s degree required; MBA or postgraduate degree preferred.</li>\n<li>Experience in primary and secondary research.</li>\n<li>Strong analytical skills to translate data into insights.</li>\n<li>Comfort working with cross-functional/global teams.</li>\n<li>Highly organized, detail-oriented, and capable of managing multiple projects.</li>\n<li>Clear written and verbal communication skills.</li>\n</ul>\n<h3>Why this Role is Special</h3>\n<ul>\n<li>Influence real product/business decisions with research-backed insights.</li>\n<li>Exposure to global markets and cross-functional leadership.</li>\n<li>High-ownership role with growth potential into senior insights/strategy positions.</li>\n</ul>\n<h3>Why Work with Us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact 10+ million users with meaningful work.</li>\n<li>Dynamic, innovation-driven culture in a fast-paced environment.</li>\n<li>Clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/market-research-specialist\">https://waydot.greythr.com/hire/jobs/market-research-specialist</a></p>",
        "tags": [
            "4-7 Years",
            "Market Research",
            "Consumer Insights",
            "Data Analytics"
        ],
        "summary": "Way.com seeks a Market Research Specialist to drive data-informed decisions through market research and analysis. The role involves collaborating with cross-functional teams to shape product and marketing strategies."
    },
    {
        "job_title": "Web Developer (PHP)",
        "company": "Estrrado Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27421",
        "location": "Technopark",
        "closing_date": "06 Mar 2026",
        "job_description": "<h2>Company Overview</h2>\n<p>Estrrado Technology Solutions (P) Ltd is a fast-growing, product-based company specializing in a multi-organization ERP and CRM platform for the education sector. Our solutions streamline operations, improve collaboration, and manage multiple campuses efficiently, with a focus on usability, scalability, and innovation.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a <strong>Web Developer (PHP)</strong> with <strong>2+ years of experience</strong>, primarily focused on website development for the Marketing team. This role involves building, customizing, and maintaining high-quality, conversion-focused websites to support marketing campaigns and brand initiatives.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and maintain websites for marketing campaigns, landing pages, and corporate websites.</li>\n<li>Collaborate with Marketing and Design teams to implement UI/UX designs, mockups, and wireframes.</li>\n<li>Build dynamic, responsive websites using PHP and related web technologies.</li>\n<li>Write clean, structured, and reusable code following web development best practices.</li>\n<li>Optimize websites for performance, SEO readiness, responsiveness, and security.</li>\n<li>Troubleshoot, test, and maintain existing websites and databases.</li>\n<li>Ensure cross-browser compatibility and mobile responsiveness.</li>\n<li>Improve and enhance existing websites based on marketing and business requirements.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong proficiency in <strong>PHP, HTML, CSS, JavaScript/jQuery</strong>.</li>\n<li>Hands-on experience with the <strong>Laravel framework</strong>.</li>\n<li>Good knowledge of <strong>MySQL</strong>, database design, and query optimization.</li>\n<li>Experience with version control systems (<strong>Git</strong>).</li>\n<li>Solid understanding of web architecture, <strong>REST APIs</strong>, and web services.</li>\n<li>Strong debugging and problem-solving skills.</li>\n</ul>\n<h3>Preferred Candidate Profile</h3>\n<ul>\n<li>Experience developing websites for clients outside India.</li>\n<li>Agency setup experience handling multiple client websites.</li>\n<li>Ability to deliver quality work with fast turnaround timelines.</li>\n</ul>\n<h3>How to Apply</h3>\n<ul>\n<li>Apply via <strong>Career Estrrado</strong> or send your resume to <strong>career@estrrado.com</strong> with the subject line: <strong>Web Developer (PHP)</strong>.</li>\n</ul>\n<h3>Contact Information</h3>\n<ul>\n<li><strong>Location</strong>: Techno Park, Trivandrum</li>\n<li><strong>Email</strong>: career@estrrado.com</li>\n<li><strong>Website</strong>: <a href=\"http://www.estrrado.com\">www.estrrado.com</a></li>\n</ul>",
        "tags": [
            "2+ Years",
            "PHP",
            "Laravel",
            "MySQL"
        ],
        "summary": "A PHP Web Developer role at Estrrado Technology Solutions, requiring 2+ years of experience in building marketing-focused websites using PHP and Laravel, with collaboration across design and marketing teams."
    },
    {
        "job_title": "Sales Development Representative - Way+",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27420",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Way.com</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a motivated and disciplined <strong>Sales Development Representative (SDR)</strong> based in India to support our <strong>Way+</strong> sales organization. This role is responsible for <strong>outbound and inbound prospecting</strong>, qualifying automotive service businesses, and setting high-quality meetings for Account Executives. This is not a script-reading role. Successful SDRs will understand the value proposition, think critically about fit, and act as trusted first-touch representatives of the Way+ brand.</p>\n<h2>Roles and Responsibilities</h2>\n<ul>\n<li>Conduct outbound prospecting via phone, email, and CRM-based workflows</li>\n<li>Qualify inbound leads from demos, long-form calls, and partner referrals</li>\n<li>Identify decision-makers and understand shop ownership structures</li>\n<li>Clearly articulate Way+ value propositions to US-based auto service businesses</li>\n<li>Schedule qualified meetings for Account Executives</li>\n<li>Maintain accurate activity tracking in CRM and dialer tools</li>\n<li>Meet or exceed weekly activity, qualification, and meeting targets</li>\n<li>Collaborate closely with US-based SDR leadership and AEs</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>1–3 years of experience in B2B sales, SDR, or lead qualification roles</li>\n<li>Prior experience selling or prospecting into US markets strongly preferred</li>\n<li>Strong spoken and written English communication skills</li>\n<li>Comfortable speaking with US business owners and operators</li>\n<li>Coachable, process-oriented, and metrics-driven</li>\n<li>Able to handle objections and navigate longer conversations</li>\n<li>Familiarity with CRM systems and sales dialers is a plus</li>\n</ul>\n<h2>Quota and Compensation Structure</h2>\n<ul>\n<li>Monthly quota based on number of shops listed</li>\n<li>Commission paid per completed and approved listing</li>\n<li>Base salary aligned to India market for junior SDR roles</li>\n<li>Total compensation lower than Way+ SDR roles due to narrower scope and deal complexity</li>\n</ul>\n<h2>Why you will love working with us?</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/sales-development-representative-way\">https://waydot.greythr.com/hire/jobs/sales-development-representative-way</a></p>",
        "tags": [
            "1–3 Years",
            "B2B Sales",
            "CRM Systems",
            "US Market Prospecting"
        ],
        "summary": "A Sales Development Representative (SDR) role at Way.com, supporting US auto service businesses through outbound/inbound prospecting. Opportunity to join a top automotive super app with growth and innovation-driven culture."
    },
    {
        "job_title": "Sales Development Representative - Repair and Maintenance",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27419",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Way.com India Pvt Ltd</h2>\n<p><strong>Position</strong>: Sales Development Representative - Repair and Maintenance\n<strong>Location</strong>: Trivandrum\n<strong>Type</strong>: Full-time/WFO role\n<strong>Closing Date</strong>: 08, Feb 2026\n<strong>Contact Email</strong>: careers@way.com</p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions ranging from auto insurance and parking to EV charging. Leveraging AI, machine learning, and data analytics, we deliver personalized, innovative solutions for car ownership. Recognized by Bloomberg and ranked #48 on Andreessen Horowitz’s fastest-growing companies list, we empower car ownership to be easier, affordable, and rewarding.</p>\n<h3>Role Overview</h3>\n<p>We seek an SDR to support our Repair &amp; Maintenance (R&amp;M) marketplace by contacting auto repair shops and onboarding them to Way.com. This performance-driven role has a monthly quota for shop listings, with commission-based compensation and defined productivity targets. The SDR will focus on high-volume outreach, qualification, and guiding shops through the listing process.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Call auto repair shops/service centers to offer listings on Way.com</li>\n<li>Explain marketplace visibility benefits and consumer demand</li>\n<li>Address questions, handle objections, and collect business information</li>\n<li>Guide shops through onboarding steps</li>\n<li>Maintain CRM data on activity and listings</li>\n<li>Meet/exceed monthly shop-listing quotas</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>0–2 years in sales, inside sales, or phone-based roles</li>\n<li>Strong verbal English communication</li>\n<li>Comfortable engaging US-based small business owners</li>\n<li>High call volume tolerance and work ethic</li>\n<li>Coachable, process-oriented mindset</li>\n<li>Prior SDR experience (helpful but not required)</li>\n</ul>\n<h3>Quota and Compensation</h3>\n<ul>\n<li>Monthly quota based on shops listed</li>\n<li>Commission per completed/approved listing</li>\n<li>Base salary aligned with India market for junior SDR roles</li>\n<li>Total compensation lower than Way+ SDR roles due to narrower scope</li>\n</ul>\n<h3>Why Work With Us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US</li>\n<li>Impact 10+ million users</li>\n<li>Dynamic, innovation-driven culture</li>\n<li>Clear career growth in a scaling tech company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/sales-development-representative-rm\">https://waydot.greythr.com/hire/jobs/sales-development-representative-rm</a></p>",
        "tags": [
            "0–2 Years",
            "Sales Development",
            "Customer Relationship Management (CRM)",
            "Outbound Sales"
        ],
        "summary": "Supports Repair & Maintenance marketplace by contacting auto repair shops for listings. Commission-based role with growth opportunities at a leading auto super app."
    },
    {
        "job_title": "Manager - Accounts Payable",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27418",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Manager - Accounts Payable</h2>\n<p><strong>Company</strong>: Way.com — America’s dominant automotive super app, serving 10+ million customers with AI-driven solutions for car ownership.</p>\n<p><strong>Location</strong>: Trivandrum\n<strong>Type</strong>: Full-time / Work From Office\n<strong>Closing Date</strong>: 08, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/accounts-payable-ap-manager\">https://waydot.greythr.com/hire/jobs/accounts-payable-ap-manager</a></p>\n<h3>Role Overview</h3>\n<p>Lead and scale the Accounts Payable function, ensuring accuracy, compliance, and efficiency in vendor payments. Partner with cross-functional teams to strengthen financial controls, drive automation, and build a high-performing AP team.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>AP Operations &amp; Financial Control</strong></li>\n<li>Own end-to-end AP operations (invoice processing, vendor payments, reconciliations, month-end close).</li>\n<li>Manage high-value/high-volume payables across vendors, geographies, and business units.</li>\n<li>\n<p>Ensure compliance with GST, TDS, withholding tax, and statutory requirements.</p>\n</li>\n<li>\n<p><strong>Team Leadership &amp; Performance</strong></p>\n</li>\n<li>Lead a team of ~5 AP professionals; set performance metrics (TAT, accuracy, compliance).</li>\n<li>Foster a culture of ownership, quality, and continuous improvement.</li>\n<li>\n<p>Ensure cross-training and operational continuity.</p>\n</li>\n<li>\n<p><strong>Vendor &amp; Stakeholder Management</strong></p>\n</li>\n<li>Resolve payment disputes, reconciliation gaps, and vendor escalations.</li>\n<li>\n<p>Collaborate with Procurement, Legal, Treasury, and Business teams for seamless operations.</p>\n</li>\n<li>\n<p><strong>Process Excellence &amp; Automation</strong></p>\n</li>\n<li>Identify inefficiencies and drive automation initiatives for AP systems and workflows.</li>\n<li>\n<p>Standardize approval flows, documentation, and audit trails.</p>\n</li>\n<li>\n<p><strong>Reporting, Audit &amp; Governance</strong></p>\n</li>\n<li>Own AP ageing, accruals, and month-end closure accuracy.</li>\n<li>Support audits with documentation and compliance.</li>\n<li>Provide insights on payables, working capital, and risk areas.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Must-Have</strong></li>\n<li>8–10 years in Finance with deep AP expertise.</li>\n<li>Qualified CA / ICWA / CFA.</li>\n<li>Proven experience managing large AP volumes and high-value payables.</li>\n<li>Hands-on team leadership (~5 people).</li>\n<li>Strong GST/TDS compliance and statutory payment knowledge.</li>\n<li>\n<p>Experience in AP automation and process improvements.</p>\n</li>\n<li>\n<p><strong>Nice-to-Have</strong></p>\n</li>\n<li>High-growth/multi-entity business experience.</li>\n<li>ERP systems (SAP, Oracle, NetSuite) exposure.</li>\n<li>Shared services or global payables experience.</li>\n</ul>\n<h3>Why Work With Us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Impact 10+ million users with innovative solutions.</li>\n<li>Dynamic, innovation-driven culture with clear career growth.</li>\n<li>Competitive compensation in a rapidly scaling tech company.</li>\n</ul>",
        "tags": [
            "8–10 Years",
            "Accounts Payable",
            "GST/TDS Compliance",
            "ERP Systems (SAP/Oracle)"
        ],
        "summary": "Lead AP operations, manage a team, and drive automation for a top US auto super app. Ensure compliance, vendor relations, and process improvements in a fast-paced environment."
    },
    {
        "job_title": "Java - Full Stack Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27417",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Way.com</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Details</h2>\n<p><strong>Position</strong>: Full Stack Developer - Java\n<strong>Location</strong>: Trivandrum\n<strong>Type</strong>: Full-time/WFO role\n<strong>Closing Date</strong>: 08,Feb 2026\n<strong>Contact Email</strong>: careers@way.com</p>\n<h2>Role Overview</h2>\n<p>We are seeking a Full Stack Developer focusing on Java and Angular to handle the entire software development lifecycle, building scalable web applications with expertise in both client-side and server-side logic.</p>\n<h2>Roles and Responsibilities</h2>\n<ul>\n<li>Developing and maintaining web applications using Java (preferably Spring Boot) for the backend and Angular for the frontend</li>\n<li>Collaborating with various teams</li>\n<li>Designing RESTful APIs</li>\n<li>Writing clean and efficient code</li>\n<li>Debugging applications and participating in code reviews</li>\n<li>Optimizing application performance</li>\n<li>Staying updated on technologies</li>\n<li>Engaging in Agile/Scrum development</li>\n</ul>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li>Bachelor’s degree in a relevant field</li>\n<li>Proven experience as a Full Stack Developer (typically 6+ years)</li>\n<li>Strong backend expertise in Java/J2EE</li>\n<li>Experience with frameworks such as Spring and Spring Boot</li>\n<li>Frontend experience with Angular, TypeScript, JavaScript, HTML5, and CSS3</li>\n<li>Experience working with both SQL and NoSQL databases</li>\n<li>Understanding of RESTful APIs</li>\n<li>Familiarity with Git, CI/CD pipelines, and Agile methodologies</li>\n<li>Strong problem-solving skills</li>\n<li>Good communication skills</li>\n<li>Ability to work effectively in a team</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience with cloud platforms</li>\n<li>Testing frameworks (JUnit, Jasmine)</li>\n<li>Knowledge of microservices architecture</li>\n<li>Solid working experience in Java and J2EE development</li>\n<li>Solid understanding of collections frameworks</li>\n<li>Working experience in developing web services using HTTP REST/JSON and SOAP</li>\n<li>Working experience in MySQL and RDBMS</li>\n<li>Object-oriented and service-oriented design concepts</li>\n<li>Experience with Angular Framework, JavaScript, and CSS</li>\n<li>Detailed knowledge of browser DOM with direct manipulation</li>\n<li>Hands-on experience with unit testing and continuous integration environments</li>\n<li>Excellent communication skills</li>\n<li>Ability to work in a dynamic, semi-structured environment</li>\n<li>Experience with agile development methodology</li>\n<li>Collaborate with product managers, designers, and developers to create intuitive user experiences</li>\n<li>Optimize application performance and ensure scalability</li>\n<li>Write clean, maintainable, and testable code</li>\n<li>Participate in code reviews</li>\n<li>Troubleshoot and resolve issues promptly</li>\n<li>Stay updated with industry trends and technologies</li>\n</ul>\n<h2>Why Work With Us?</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US</li>\n<li>Impact across 10+ million users</li>\n<li>Dynamic, fast-paced, innovation-driven culture</li>\n<li>Clear career growth pathways</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/full-stack-developer\">https://waydot.greythr.com/hire/jobs/full-stack-developer</a></p>",
        "tags": [
            "6+ Years",
            "Java",
            "Spring Boot",
            "Angular"
        ],
        "summary": "Seeking a Full Stack Developer with 6+ years of experience in Java and Angular to build scalable web applications. Opportunity to work on a leading automotive super app with a dynamic tech environment."
    },
    {
        "job_title": "Director - Integrated Marketing",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27416",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Way.com</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Position Overview</h2>\n<p><strong>Director - Integrated Marketing</strong>\n- <strong>Location</strong>: Trivandrum\n- <strong>Type</strong>: Full-time/WFO role\n- <strong>Closing Date</strong>: 08, Feb 2026\n- <strong>Published</strong>: 06, Feb 2026\n- <strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>\n<h2>Role Overview</h2>\n<p>We’re seeking a senior marketing leader to helm the India-based non-paid marketing engine. This role drives awareness, SEO, AI search (LLM/GEO), and organic growth, collaborating with agencies and in-house teams. It’s a player-coach position for a strategist who can scale brands, command agencies, and execute with precision.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Lead brand growth with a focus on SEO, LLM/GEO, and social media, collaborating with content/UGC teams.</li>\n<li>Act as the central hub for external agencies: set direction, review output, enforce timelines, and elevate standards.</li>\n<li>Orchestrate execution between internal marketing teams and global leadership.</li>\n<li>Build quarterly roadmaps, weekly execution plans, and track KPIs for success.</li>\n<li>Personally audit strategy, content, SEO, and AI search visibility for quality.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>10–15+ years</strong> in marketing (agency + in-house leadership roles).</li>\n<li>Deep expertise in SEO, content, and brand strategy.</li>\n<li>Proven track record of scaling brands nationally/globally.</li>\n<li>Experience growing organic traffic and page rankings for national brands.</li>\n<li>Decisive, structured, and comfortable leading senior agency partners.</li>\n</ul>\n<h2>Why This Role Is Special</h2>\n<ul>\n<li>Direct access to global marketing leadership.</li>\n<li>Authority to shape organic and brand growth strategies.</li>\n<li>High-impact role in a fast-scaling global business.</li>\n</ul>\n<h2>Why Join Us?</h2>\n<ul>\n<li>Work for the #1 Auto Super app in the US.</li>\n<li>Impact 10+ million users with innovative solutions.</li>\n<li>Dynamic, fast-paced, innovation-driven culture.</li>\n<li>Clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/director-integrated-marketing\">https://waydot.greythr.com/hire/jobs/director-integrated-marketing</a></p>",
        "tags": [
            "10–15+ Years",
            "SEO",
            "LLM/GEO",
            "Content Marketing"
        ],
        "summary": "Lead integrated marketing for a global auto app, focusing on SEO, AI search, and organic growth. Drive brand strategy and collaborate with agencies for scalable results."
    },
    {
        "job_title": "Lead - Graphic Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27415",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Role Overview</strong>\nWe’re hiring a <strong>Lead Marketing Designer</strong> to work closely with the marketing and design leadership to shape how Way.com shows up visually, consistently, and at scale. This is not a pixel-pushing role. The marketing design team has already:\n- Delivered high-impact digital and physical campaigns\n- Established brand guidelines and rules across the organization\n- Built and scaled brand asset systems\n- Supported marketing for multiple new product launches\n- Designed for both B2C customers and B2B partners\n- Played a key role in trade shows and partner-facing initiatives\n- Contributed to deep customer impact and revenue through conversion</p>\n<p><strong>Key Responsibilities</strong>\n- Lead visual design across: marketing campaigns, brand initiatives, social and performance ads, web, and product-led marketing\n- Translate business and marketing goals into clear, high-impact visual stories\n- Own design quality end-to-end, from concept to final delivery\n- Collaborate with marketing, content, growth, and product teams\n- Maintain and evolve brand consistency while pushing creative boundaries\n- Mentor junior designers and raise the overall bar of the team\n- Manage multiple projects without compromising quality or timelines</p>\n<p><strong>Preferred Skills</strong>\n- 4–6 years of experience in graphic/marketing design\n- Strong portfolio that shows thinking, not just visuals\n- Expert-level proficiency in <strong>Figma</strong> and <strong>Adobe Creative Suite</strong>\n- Ability to leverage <strong>AI</strong> for: faster concept generation, campaign variations at scale, improving speed without compromising brand quality\n- Train juniors on AI usage in ideation and design execution\n- Experience designing for digital-first brands and fast-moving teams\n- Ability to take feedback, push back when needed, and defend design decisions\n- Comfort with ambiguity and rapid iteration\n- High ownership mindset</p>\n<p><strong>Bonus Skills</strong>\n- Motion, video, or basic animation skills\n- Understanding of performance marketing creatives\n- Experience in startup or high-growth environments</p>\n<p><strong>Why This Role Matters</strong>\nDesign at Way.com is a growth lever, not a support function. You’ll work on marketing design that scales:\n- Our large-scale app and web product\n- Marketing for recent product initiatives (B2B - SaaS, B2C)\n- Brand initiatives and more</p>\n<p><strong>Why You’ll Love It</strong>\n- Opportunity to work for the #1 Auto Super app in the US\n- Impact 10+ million users\n- Dynamic, fast-paced, innovation-driven culture\n- Clear career growth in a rapidly scaling tech company\n- Competitive compensation</p>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-graphic-designer\">https://waydot.greythr.com/hire/jobs/lead-graphic-designer</a>\n<strong>Contact Email</strong>: careers@way.com\n<strong>Closing Date</strong>: 08, Feb 2026</p>",
        "tags": [
            "4-6 Years",
            "Figma",
            "Adobe Creative Suite",
            "AI"
        ],
        "summary": "Lead Graphic Designer to shape Way.com's visual identity and marketing strategy. Requires 4-6 years of experience with Figma, Adobe Creative Suite, and AI proficiency."
    },
    {
        "job_title": "Customer Success - QC",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27414",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Closing Date:</strong> 08 Feb 2026\n<strong>Job Published:</strong> 06 Feb 2026\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-qc\">https://waydot.greythr.com/hire/jobs/customer-success-qc</a></p>\n<h3>Role Overview</h3>\n<p>The <strong>Customer Success QC Specialist (Mid–Senior Level)</strong> is responsible for owning the quality assurance framework for customer interactions across all support channels. This role ensures high standards of communication, accuracy, and customer experience while driving continuous improvement initiatives across the Customer Success and Support teams. The specialist acts as a quality gatekeeper and a partner to training, operations, and product teams.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Quality Assurance Leadership</strong></li>\n<li>Conduct detailed audits of customer interactions (email, chat, phone, tickets) using advanced QA scorecards.</li>\n<li>Identify quality gaps at agent, process, and system levels.</li>\n<li>Lead calibrations with internal QA teams and external partners.</li>\n<li>\n<p>Maintain and evolve quality frameworks and rubrics for CS/support functions.</p>\n</li>\n<li>\n<p><strong>Coaching &amp; Skill Development</strong></p>\n</li>\n<li>Provide structured, actionable feedback to support executives and customer success specialists.</li>\n<li>Work closely with L&amp;D and Ops to implement coaching plans and refresher training.</li>\n<li>\n<p>Conduct communication etiquette, tone, and product knowledge sessions when required.</p>\n</li>\n<li>\n<p><strong>Process &amp; Compliance Ownership</strong></p>\n</li>\n<li>Ensure consistency in SOPs, escalation workflows, and service guidelines.</li>\n<li>Identify recurring defects and lead root-cause analysis (RCA).</li>\n<li>Recommend process improvements to reduce errors, improve FCR, and increase CSAT.</li>\n<li>\n<p>Ensure compliance with customer data privacy and operational standards.</p>\n</li>\n<li>\n<p><strong>Insights, Reporting &amp; Stakeholder Management</strong></p>\n</li>\n<li>Create weekly, monthly, and quarterly quality dashboards for leadership review.</li>\n<li>Present trends on CX gaps, agent performance, and customer sentiment insights.</li>\n<li>Partner with Product, CS Ops, and Support teams to improve workflows and customer journey experience.</li>\n<li>\n<p>Track impact of implemented improvements and coaching cycles.</p>\n</li>\n<li>\n<p><strong>Tools &amp; Systems</strong></p>\n</li>\n<li>Experience with Zendesk, Freshdesk, Salesforce, Intercom, or similar platforms.</li>\n<li>Ability to work with QA tools, knowledge bases, reporting dashboards, and analytics platforms.</li>\n<li>Manage and continuously update QA documentation, SOPs, and knowledge articles.</li>\n</ol>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>5–8 years</strong> of experience in Customer Success, Customer Support QA/QC, or CX Quality roles.</li>\n<li>Strong expertise in customer interaction evaluation and quality frameworks.</li>\n<li>Excellent written and verbal communication skills with strong attention to detail.</li>\n<li>Ability to diagnose behavioural, technical, and communication issues.</li>\n<li>Experience running calibrations, RCAs, and process improvement initiatives.</li>\n<li>Strong analytical skills with experience in quality reporting and dashboards.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Exposure to SaaS support environments or global customer bases.</li>\n<li>Experience coaching support teams at scale.</li>\n<li>Knowledge of metrics such as CSAT, FCR, NPS, QA accuracy, AHT, and SLA adherence.</li>\n<li>Experience handling multilingual or culturally diverse customer interactions.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "QA/QC",
            "Customer Success",
            "Zendesk"
        ],
        "summary": "Customer Success QC Specialist ensures quality in customer interactions, driving improvements and collaborating with teams at Way.com, a leading auto super app with 10+ million users."
    },
    {
        "job_title": "Product Designer - Senior",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27413",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Senior Product Designer\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We’re hiring a Senior Product Designer to independently own complex product areas and ship high-quality experiences. Over the past year, <strong>Way.com</strong> shipped multiple new products and verticals where senior designers played a key role in turning ambiguity into shipped outcomes. This role exists due to expanding product scope. You’ll own end-to-end design for key flows and modules, work closely with PMs and Engineers, and partner with design leadership to raise quality and consistency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Work on live, revenue-impacting products across consumer and SaaS, where UX decisions affect adoption and retention</li>\n<li>Drive design from discovery to delivery for assigned areas</li>\n<li>Translate requirements into clear flows and UI</li>\n<li>Collaborate cross-functionally</li>\n<li>Contribute to critiques and standards</li>\n<li>Maintain the design system</li>\n<li>Proactively improve UX quality</li>\n<li>Operate as a high-ownership contributor with growing strategic influence</li>\n</ul>\n<p><strong>This role is not pixel-pushing, passive support, or throw-it-over-the-wall design.</strong></p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>3–5 years of experience</li>\n<li>Strong portfolio</li>\n<li>Ability to independently ship work end-to-end</li>\n<li>Comfortable with ambiguity</li>\n<li>Experience in research and iteration</li>\n<li>Strong with modern design tools</li>\n<li>Ability to communicate decisions clearly</li>\n<li>Move fast and take ownership</li>\n</ul>\n<h3>Why This Role Matters</h3>\n<ul>\n<li><strong>Way.com</strong> is scaling fast</li>\n<li>Designers work on products with direct revenue impact</li>\n<li>Strong ownership and visibility</li>\n<li>Clear path toward Lead responsibility</li>\n<li>Opportunity to deepen impact, sharpen ownership, and grow through real work</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong></li>\n<li>Opportunity to make a meaningful impact across 10+ million users</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/senior-product-designer\">Senior Product Designer Application</a>\n<strong>Contact Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "3–5 Years",
            "Product Design",
            "UX/UI Design",
            "User Research"
        ],
        "summary": "Senior Product Designer at Way.com, the #1 US auto super app, to lead end-to-end design for high-impact consumer and SaaS products with 3–5 years of experience in UX/UI and user research."
    },
    {
        "job_title": "Product Designer - Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/27412",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We’re seeking a <strong>Lead Product Designer</strong> to own end-to-end product experiences, raise design standards, and drive outcomes—not just deliver screens. You’ll lead as the design authority for core products, collaborating directly with Product, Engineering, Growth, and Leadership. Report to the <strong>Head of Design</strong>. Apply if you’re a Lead or Senior Designer ready to elevate your career.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>End-to-end product design for key verticals.</li>\n<li>Define UX strategy, drive research, and ship high-quality flows/UI with speed.</li>\n<li>Elevate visual/UI standards across the product ecosystem.</li>\n<li>Influence product roadmaps using data, customer insights, and business context.</li>\n<li>Align cross-functionally, simplify ambiguity, and ensure design isn’t skipped.</li>\n<li>Own lean, effective design workflows.</li>\n<li>Mentor junior designers, provide critique, guide hiring, and shape team culture.</li>\n<li>Evolve Way.com’s design system for scalability.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>7–10+ years</strong> of product design experience, with <strong>3+ years</strong> in a lead/senior-lead role.</li>\n<li>Strong portfolio showcasing complex problem-solving, consumer app work, and high-quality UI.</li>\n<li>Proven ability to drive outcomes, not just outputs.</li>\n<li>Comfort with fast-paced environments, ambiguity, and data-driven decisions.</li>\n<li>Experience in discovery, research, prototyping, and iterative testing.</li>\n<li>Expertise in <strong>Figma</strong> and modern design tools.</li>\n<li>Strong communication: direct, clear, and decisive.</li>\n<li>Ability to influence product, engineering, and leadership without compromising clarity.</li>\n<li>Bias for action: move fast, ship, and iterate.</li>\n</ul>\n<h3>Why You’ll Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with meaningful solutions.</li>\n<li>Dynamic, innovation-driven culture in a fast-paced environment.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-product-designer\">Link</a>\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "7–10+ Years",
            "Figma",
            "Design Systems",
            "Data-Driven Design"
        ],
        "summary": "Lead Product Designer to drive end-to-end product experiences for Way.com, the #1 US auto super app, impacting 10+ million users through innovative design and cross-functional collaboration."
    }
]