[
    {
        "job_title": "Sales Engineer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/22483",
        "location": "Technopark",
        "closing_date": "07 Aug 2025",
        "job_description": "<h2>Sales Engineer</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong>\nModule L1A, Level -1, Thejaswini, Technopark, Trivandrum\nand\n2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581\n<a href=\"http://www.techvantagesystems.com\">http://www.techvantagesystems.com</a></p>\n<p><strong>Closing Date:</strong> 07, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025\n<strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<p>At Techvantage.ai, we’re building the future of enterprise workflows using Agentic AI—autonomous AI agents that revolutionize how businesses operate. We help enterprise clients work smarter, faster, and at scale through data-driven automation. If you’re passionate about cutting-edge AI and have the drive to scale growth, this is your chance to be part of something transformational.</p>\n<p>We are seeking a motivated and goal-oriented Sales Engineer to join our team. The ideal candidate will have 0 to 3 years of experience in sales or customer-facing roles and a passion for achieving sales targets. Candidates with experience in the BFSI (Banking, Financial Services, and Insurance) domain will be given preference.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Identify and engage prospective customers through calls, emails, or field visits</li>\n<li>Promote and sell company products/services to potential clients</li>\n<li>Understand client requirements and provide appropriate solutions</li>\n<li>Develop and maintain strong customer relationships</li>\n<li>Prepare and present proposals, quotations, and necessary documentation</li>\n<li>Work towards achieving monthly and quarterly sales targets</li>\n<li>Coordinate with internal teams to ensure timely delivery and support</li>\n<li>Maintain accurate records of sales activities and client interactions</li>\n<li>Stay updated on industry trends, product developments, and competitor activity</li>\n</ul>\n<p><strong>Qualifications &amp; Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, Finance, or a related field</li>\n<li>0–3 years of experience in sales, marketing, or customer service roles</li>\n<li>Strong communication and interpersonal skills</li>\n<li>Confident in handling objections and closing sales</li>\n<li>Proficiency in MS Office (Word, Excel, PowerPoint)</li>\n<li>Willingness to travel or conduct client visits, as needed</li>\n<li>Experience in the BFSI domain is an added advantage</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul>\n<li>Internship or project experience in sales or financial services</li>\n<li>Familiarity with CRM systems or lead management tools</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Structured training and onboarding</li>\n<li>Fixed salary plus performance-based incentives</li>\n<li>Opportunity for rapid career progression</li>\n<li>Dynamic and collaborative work environment</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "Sales",
            "BFSI Domain",
            "Customer Relationship"
        ],
        "summary": "Techvantage Systems is looking for a Sales Engineer to drive growth using AI. The role involves customer engagement, achieving sales targets, and providing tailored solutions."
    },
    {
        "job_title": "Analyst - Operations",
        "company": "Press Ganey Associates India (P) Ltd",
        "url": "https://technopark.org/job-details/22481",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>Analyst - Operations Walk-In</h2>\n<p><strong>Walk-In Date:</strong> August 11, 2025\n<strong>Time:</strong> 09:00:00 to 12:00:00</p>\n<p><strong>Location:</strong> Press Ganey Associates India (P) Ltd, Level 4 (L1), Thejaswani, Phase 1, Technopark Campus, Trivandrum, 695581</p>\n<p><strong>Contact Email:</strong> hr-pgindia@pressganey.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>As an Analyst in Operations, you will be responsible for configuring the platform, refining sentiments, and generating reports, ensuring accurate data acquisition and high-quality standards.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Configure the platform to ensure accurate acquisition and reporting of experience data.</li>\n<li>Review and refine sentiments generated by the platform's NLP engine.</li>\n<li>Collect, process, and analyze data from various sources to generate management reports.</li>\n<li>Responsible for survey design updates and managing translations for accurate data collection.</li>\n<li>Fulfill client requests promptly, maintaining high-quality standards.</li>\n<li>Should be adaptable and open to working in different shifts.</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>0 - 2 Years</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proficiency in Excel, including advanced functions; experience with other data visualization tools is a plus.</li>\n<li>Strong analytical skills, attention to detail.</li>\n</ul>\n<p><strong>Minimum Qualification Required:</strong></p>\n<ul>\n<li>Bachelor’s degree in any discipline.</li>\n</ul>\n<p><strong>Walk-In Venue:</strong></p>\n<p>Press Ganey Associates India Private Limited\nTechnopark: Phase -1, L4, Ground Floor (Level-1), Thejaswini, Trivandrum - 695581, Kerala, India</p>\n<p><strong>Walk-In Entry Pass:</strong></p>\n<p>Candidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.\nCandidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong></p>\n<ul>\n<li><a href=\"Mobile AppClick\">Click here to download the Mobile App for Android</a></li>\n<li><a href=\"Mobile AppClick\">Click here to download the Mobile App for iOS</a></li>\n</ul>\n<p><strong>Website URL:</strong></p>\n<ul>\n<li><a href=\"vms.technopark.org\">vms.technopark.org</a></li>\n<li><a href=\"vms.technopark.org\">Click here for the User Manual</a></li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "0-2 Years",
            "Excel",
            "Data Analysis",
            "NLP"
        ],
        "summary": "Seeking an Analyst for Operations to configure platforms, refine sentiments, and generate reports. The role involves data analysis, client requests, and shift work."
    },
    {
        "job_title": "Senior Golang Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/22480",
        "location": "Technopark",
        "closing_date": "28 Aug 2025",
        "job_description": "<h2>Senior Golang Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a Senior Golang Developer to join our growing team. We are a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to clients across the globe for more than 16 years.</p>\n<p><strong>About Techversant:</strong>\nTechversant provides Technology services in key areas such as Digital Transformation, understanding evolving industrial scenarios, investment priorities, and technology disruption. We offer expertise in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, and Business Intelligence.</p>\n<p><strong>Job Description:</strong>\n- Work closely with team members to support their use of the platform to deliver complete solutions to customers.\n- Participate in all phases of an agile development cycle – plan, design, implement, review, test, deploy, document, and training.\n- Troubleshoot and resolve customer issues.\n- Strive to make continuous improvement.\n- Architect highly scalable, highly available systems with minimal guidance.\n- Translate business requirements into scalable and extensible design.\n- Mentor junior engineers on design, coding, and troubleshooting.\n- Practice and advocate Agile processes in the team.</p>\n<p><strong>Preferred Skills:</strong>\n- A minimum of 3 years having hands-on experience using GoLang\n- Deep understanding of RDBMS\n- Ability to instill and enforce best practices around web development.\n- A sense of urgency and ownership over the product\n- Great attitude towards work and people\n- Strong working knowledge in Golang\n- Working experience with any of the GoLang Web framework\n- Strong design skills, awareness of design and architectural patterns\n- Good understanding of data structures and algorithms\n- Excellent analytical and problem-solving skills\n- Ability to work in a fast-paced service environment.\n- Experience in technical mentorship/coaching is highly desirable.\n- Excellent written and verbal communication</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p><strong>Contact Information:</strong>\n- Email: careers@techversantinfotech.com\n- Website: http://www.techversantinfotech.com</p>\n<p>Closing Date: 28, Aug 2025\nJob Published: 04, Aug 2025</p>",
        "tags": [
            "3+ Years",
            "Golang",
            "RDBMS",
            "Agile"
        ],
        "summary": "Techversant Infotech is looking for a Senior Golang Developer. The role involves designing scalable systems and mentoring junior engineers within an agile environment."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22478",
        "location": "Technopark",
        "closing_date": "05 Aug 2025",
        "job_description": "<h2>Telesales Executive - Walk-In Interview</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong> is seeking a motivated and dynamic Telesales Executive to join our team.</p>\n<p><strong>Walk-In Details:</strong></p>\n<ul>\n<li><strong>Date:</strong> August 5, 2025</li>\n<li><strong>Time:</strong> 10:30 AM - 12:30 PM</li>\n<li><strong>Location:</strong> 1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581</li>\n</ul>\n<p><strong>Job Overview:</strong></p>\n<p>You will be responsible for driving sales over the phone and maintaining excellent customer relationships. The goal is to contribute to the company's growth by acquiring customers and developing business opportunities. You will be expected to identify potential clients, qualify leads, and close deals.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Conduct sales activities over the phone.</li>\n<li>Maintain good customer relationships.</li>\n<li>Identify potential clients and qualify leads.</li>\n<li>Close deals to achieve sales targets.</li>\n<li>Develop business opportunities to contribute to company growth.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li><strong>Experience:</strong> 0-1 years required; Freshers are encouraged to apply.</li>\n<li><strong>Gender:</strong> Male and Female candidates preferred.</li>\n<li><strong>Language:</strong> Fluency in Malayalam is preferred.</li>\n<li><strong>Skills:</strong><ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>\n</li>\n<li>Immediate joiners are needed.</li>\n<li>Work from office opportunity.</li>\n</ul>\n<p><strong>Walk-In Entry Pass:</strong></p>\n<p>Candidates must apply for an entry pass to Technopark Campus to attend the Walk-In interview via the mobile app or web browser. The entry pass will be sent to the registered mobile number/e-mail ID.</p>\n<ul>\n<li><strong>Mobile App:</strong><ul>\n<li><a href=\"link\">Click here to download the Mobile App for Android</a></li>\n<li><a href=\"link\">Click here to download the Mobile App for iOS</a></li>\n</ul>\n</li>\n<li><strong>Website URL:</strong><ul>\n<li><a href=\"vms.technopark.org\">vms.technopark.org</a></li>\n<li><a href=\"link\">Click here for the User Manual</a></li>\n</ul>\n</li>\n</ul>\n<p>Candidates without a smartphone can print a hard copy of the entry pass from self-operating Kiosks at the Reception Building near TECHNOPARK Main Gate using the OTP received via SMS/e-mail.</p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> trainonexsolutions.hr@gmail.com</li>\n<li><strong>Website:</strong> <a href=\"http://www.trainonexsolutions.in/\">www.trainonexsolutions.in</a></li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Communication",
            "Customer Interaction"
        ],
        "summary": "Join Trainonex Solutions as a Telesales Executive to drive sales and build customer relationships. Immediate joiners with strong communication skills are encouraged to apply."
    },
    {
        "job_title": "Regional Manager - Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22477",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Regional Manager - Operations</h2>\n<p><strong>Way.Com India Pvt Ltd</strong> is seeking a highly driven and dynamic Regional Manager - Operations to oversee operations, drive sales growth, and enhance vendor relationships in our expanding vertical. This role requires a strategic thinker with strong operational expertise, the ability to manage and mentor teams, and a passion for delivering exceptional customer experiences. The ideal candidate thrives in a fast-paced, startup environment, can work independently, and is motivated to innovate and improve processes continuously.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Regional Management:</strong> Handle assigned region(s), ensuring consistent sales growth and maintaining detailed historical data.</li>\n<li><strong>Sales &amp; Marketing Coordination:</strong> Collaborate with marketing teams to align campaigns with operational objectives and maintain comprehensive records.</li>\n<li><strong>Team Leadership &amp; Training:</strong> Manage, mentor, and train team members to improve their performance and help them become the best version of themselves.</li>\n<li><strong>Vendor Relationship Management:</strong> Maintain regular engagement with vendors to strengthen relationships and build trust.</li>\n<li><strong>Strategic Growth &amp; Innovation:</strong> Work with team leads to drive vertical growth, develop innovative ideas to boost long-term sales, and enhance customer experience.</li>\n<li><strong>Escalation Handling:</strong> Act as the primary point of contact for escalations, ensuring quick resolution while constantly improving knowledge and processes.</li>\n<li><strong>Continuous Improvement:</strong> Demonstrate an ongoing commitment to process enhancement, problem-solving, and personal development.</li>\n</ul>\n<p><strong>Work Hours:</strong>\nThis is a startup environment with a growing vertical, and flexibility is key. The role requires the ability to work night shifts and occasionally weekends, if necessary, to meet operational needs.</p>\n<p><strong>Qualifications &amp; Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in any discipline.</li>\n<li>Minimum of 3 years of experience in Operations or a related field.</li>\n<li>Excellent communication skills, both written and verbal.</li>\n<li>Strong cold-calling abilities to engage new, churned, or hesitant customers.</li>\n<li>Highly organized with strong team collaboration skills.</li>\n<li>Proficiency in Google Workspace, Excel, and internal ticketing systems.</li>\n<li>A solution-oriented approach and initiative to think outside the box.</li>\n<li>Ability to work independently, handle real-time issues, and remain calm under pressure.</li>\n<li>Strong analytical mindset with a natural inclination to ask \"why\" and dig deeper.</li>\n<li>Willingness to upskill continuously to positively impact performance.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p><strong>Apply here:</strong> https://waydot.greythr.com/hire/jobs/regional-manager-operations</p>",
        "tags": [
            "3+ Years",
            "Operations",
            "Communication Skills",
            "Google Workspace"
        ],
        "summary": "We are looking for a Regional Manager to oversee operations, drive growth and improve vendor relationships. The role involves team leadership, strategic innovation, and continuous process improvement."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/22475",
        "location": "Technopark",
        "closing_date": "07 Aug 2025",
        "job_description": "<h2>Digital Marketing Executive - Walk-In Interview</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong> is seeking a creative and enthusiastic Junior Digital Marketing Executive to support the execution of our digital marketing strategies. This is a walk-in interview opportunity.</p>\n<p><strong>Walk-In Details:</strong></p>\n<ul>\n<li><strong>Date:</strong> August 6, 2025 - August 7, 2025</li>\n<li><strong>Time:</strong> 10:30 AM - 12:30 PM</li>\n<li><strong>Venue:</strong>\n    Upcommune Business Network Pvt Ltd\n    Forth Floor\n    Gayatri Building\n    Technopark - 695582\n    TVM</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<ul>\n<li><strong>Email:</strong> mail@upcommune.net</li>\n<li><strong>Phone:</strong> +91 9074882688</li>\n<li><strong>Website:</strong> <a href=\"https://www.upcommune.net\">https://www.upcommune.net</a></li>\n<li><strong>Address:</strong> SBC 22, -2 , Thejaswini Building, Technopark, Thiruvananthapuram , 695581</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Assist in the development and execution of digital marketing campaigns across various platforms (social media, email, content marketing).</li>\n<li>Manage and update social media accounts (Facebook, Instagram, LinkedIn), engaging with followers.</li>\n<li>Create and schedule content for social media platforms.</li>\n<li>Assist in creating blog posts, website content, and promotional materials.</li>\n<li>Support SEO strategies through keyword research and website content optimization.</li>\n<li>Monitor and report on campaign performance using tools like Google Analytics, Google Ads, and social media insights.</li>\n<li>Assist in managing online ad campaigns (Google Ads, Facebook Ads) under guidance.</li>\n<li>Collaborate with design and development teams to create engaging digital content.</li>\n<li>Stay updated with the latest digital marketing trends and tools.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business, Communication, or a related field.</li>\n<li>Basic understanding of digital marketing concepts and tools (SEO, SEM, social media, email marketing).</li>\n<li>Experience with social media management and content creation.</li>\n<li>Familiarity with Google Analytics, Google Ads, and other marketing tools is a plus.</li>\n<li>Strong written and verbal communication skills.</li>\n<li>Creative thinking and attention to detail.</li>\n<li>Ability to work collaboratively in a team environment.</li>\n<li>Self-motivated, eager to learn, and adapt to new challenges.</li>\n</ul>\n<p><strong>Walk-In Entry Pass:</strong></p>\n<p>Candidates need to apply for an entry pass to Technopark Campus via the mobile app/web browser.</p>\n<ul>\n<li><strong>Website URL:</strong> vms.technopark.org</li>\n<li><strong>Mobile App (Android):</strong> <a href=\"Insert Android App Link Here\">Click here to download</a></li>\n<li><strong>Mobile App (iOS):</strong> <a href=\"Insert iOS App Link Here\">Click here to download</a></li>\n</ul>\n<p>Candidates without smartphones can print a hard copy of the entry pass from kiosks at the Reception Building near the TECHNOPARK Main Gate using the OTP received via SMS/email.</p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p>Interested candidates should send their resume and a cover letter detailing their relevant experience to Mail@upcommune.net.</p>",
        "tags": [
            "Entry Level",
            "Digital Marketing",
            "Social Media",
            "Content Creation"
        ],
        "summary": "Upcommune is looking for a Junior Digital Marketing Executive to help with digital marketing strategies. The role involves social media, content creation, and campaign analysis."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/22474",
        "location": "Technopark",
        "closing_date": "07 Aug 2025",
        "job_description": "<h2>Business Development Executive - Walk-In</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong> is seeking a talented Business Development Executive to join our dynamic Sales and Marketing team. This role is pivotal in identifying new business opportunities, converting leads into clients, and devising effective marketing strategies to foster business growth.</p>\n<p><strong>Walk-In Details:</strong></p>\n<ul>\n<li><strong>Date:</strong> August 6, 2025 - August 7, 2025</li>\n<li><strong>Time:</strong> 10:30 AM - 12:30 PM</li>\n<li><strong>Venue:</strong>\n    Upcommune Business Network Pvt Ltd\n    Forth Floor\n    Gayatri Building\n    Technopark - 695582\n    TVM</li>\n</ul>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Identify and pursue new business opportunities through networking, cold calling, and other lead generation techniques.</li>\n<li>Develop and maintain strong relationships with prospective clients and key stakeholders.</li>\n<li>Collaborate with the marketing team to create compelling campaigns that align with client needs and drive revenue.</li>\n<li>Analyze market trends and competitor activities to ensure the company remains competitive in the marketplace.</li>\n<li>Prepare and deliver pitches and presentations to potential clients, showcasing the company's products/services and value proposition.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proven experience in sales and business development, preferably in a related industry.</li>\n<li>Ability to work independently and as part of a team, with a proactive approach to problem-solving.</li>\n<li>Degree/ Diploma, Marketing, or a related field is preferred.</li>\n<li>Opportunity to work in a dynamic and innovative environment.</li>\n<li>Competitive salary and performance-based incentives.</li>\n<li>Career growth opportunities within the company.</li>\n</ul>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<ul>\n<li>Mobile App: <a href=\"https://www.upcommune.net\">Android</a>, <a href=\"https://www.upcommune.net\">iOS</a></li>\n<li>Website URL: <a href=\"http://vms.technopark.org/\">vms.technopark.org</a></li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong>\n*   Email: <a href=\"mailto:mail@upcommune.net\">mail@upcommune.net</a>\n*   Phone: +91 9074882688\n*   Address:\n    Upcommune Business Network (P) Ltd\n    SBC 22, -2, Thejaswini Building, Technopark\n    Thiruvananthapuram, 695581\n    <a href=\"https://www.upcommune.net\">https://www.upcommune.net</a></p>",
        "tags": [
            "1+ Year",
            "Business Development",
            "Sales",
            "Digital Marketing"
        ],
        "summary": "Upcommune is hiring a Business Development Executive to identify opportunities and convert leads. The role involves creating marketing strategies and maintaining client relationships to drive revenue."
    },
    {
        "job_title": "Front End Developer",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/22473",
        "location": "Technopark",
        "closing_date": "22 Aug 2025",
        "job_description": "<h2>Front End Developer</h2>\n<p><strong>Cloud Nautical Solutions India Pvt Ltd</strong>\nModule No.K12, 2nd Floor, Kabani Building\nTechnocity, Phase 4 Technopark\nTrivandrum, Kerala, India, 695317\n<a href=\"https://www.cloudnautical.com\">https://www.cloudnautical.com</a></p>\n<p><strong>Closing Date:</strong> 22, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025\n<strong>Contact Email:</strong> <a href=\"careers@cloudnautical.com\">careers@cloudnautical.com</a></p>\n<p><strong>Brief Description:</strong>\nLooking for a frontend engineer with 3-5 years of experience to join our team. The ideal candidate will have experience in building complex web applications using ReactJS, Typescript and other front-end technologies.</p>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>3-5 years of experience in frontend development.</li>\n<li>Strong proficiency in ReactJS, Typescript, HTML5, Tailwind CSS, Form Handlers (React hook form, zod / yup, zustand).</li>\n<li>Experience with Git control systems and Agile development methodologies.</li>\n<li>In-depth knowledge of JavaScript, CSS, HTML, and front-end languages.</li>\n<li>Experience with user interface design.</li>\n<li>Good project management skill</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Complete understanding of ReactJS and its main fundamentals</li>\n<li>Expert knowledge of JavaScript, CSS, HTML and related web technologies</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "ReactJS",
            "Typescript",
            "Tailwind CSS"
        ],
        "summary": "Cloud Nautical is seeking a Frontend Developer to build complex web applications. Proficiency in ReactJS, Typescript, and related technologies is required."
    },
    {
        "job_title": "Digital Marketing Executive (1–2 Years Experience)",
        "company": "Innure Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/22472",
        "location": "Technopark",
        "closing_date": "09 Aug 2025",
        "job_description": "<h2>Digital Marketing Executive</h2>\n<p><strong>Innure Infotech (P) Ltd</strong>\nModule No-14, 4th Floor, Nila Building, Technopark Campus, Trivandrum, 695581\n<a href=\"http://www.innure.com\">http://www.innure.com</a></p>\n<p><strong>Contact Email:</strong> info@scalevel.in</p>\n<p>We’re looking for a motivated Digital Marketing Executive with 1–2 years of hands-on experience to join our growing marketing team. You’ll play a key role in executing result-driven campaigns, handling social media, SEO, email marketing, and paid ads to generate leads and improve brand visibility.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Plan and execute digital marketing strategies in Google</li>\n<li>Manage and grow social media channels with regular posting and engagement</li>\n<li>Create, send, and analyze email campaigns using tools like Mailchimp or Zoho</li>\n<li>Track and report performance metrics (CTR, CPC, ROAS, etc.)</li>\n<li>Coordinate with content, design, and sales teams for campaign alignment</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>1–2 years of experience in digital marketing</li>\n<li>Good understanding of Google Ads</li>\n<li>Experience with digital tools like Google Analytics, SEMrush, Canva, Meta Business Suite, wordpress</li>\n<li>Strong communication and copywriting skills</li>\n<li>Bachelor’s degree in Marketing, Business, or related field</li>\n</ul>\n<p><strong>Preferred Skills (Bonus):</strong></p>\n<ul>\n<li>Experience in automation tools (HubSpot, Zoho, etc.)</li>\n<li>Basic knowledge of HTML/CSS</li>\n<li>Ability to handle ad budgeting and campaign scaling</li>\n</ul>\n<p><strong>Closing Date:</strong> 09, Aug 2025</p>\n<p><strong>Job Published:</strong> 04, Aug 2025</p>",
        "tags": [
            "1-2 Years",
            "Google Ads",
            "Social Media",
            "Google Analytics"
        ],
        "summary": "Seeking a Digital Marketing Executive to execute campaigns, manage social media, and improve brand visibility. Requires 1-2 years of experience and skills in SEO, email marketing, and paid ads."
    },
    {
        "job_title": "Java Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/22471",
        "location": "Technopark",
        "closing_date": "28 Aug 2025",
        "job_description": "<h2>Java Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Java Team Lead to manage our Java development team. As a Global Technology Services and Solutions Company, we provide high-quality end-to-end IT Solutions and Services to our clients across the globe for more than 16 years. We specialize in areas like Digital Transformation and offer expertise in multiple technology domains including Java, .NET, Python and more.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Leading and managing the Java development team.</li>\n<li>Design, development, and maintenance of Java-based software solutions.</li>\n<li>Design, Development, and Delivery of large-scale Web Applications.</li>\n<li>Code optimization and static code analysis.</li>\n<li>Understanding complex business requirements.</li>\n<li>Solving problems and creating solutions independently.</li>\n<li>Addressing systems integration, compatibility, and multiple platforms issues.</li>\n<li>Communicating with clients to understand technical requirements.</li>\n<li>Presenting technical solutions and system design.</li>\n<li>Analyzing business requirements and preparing work breakdown structures.</li>\n<li>Providing technical estimates.</li>\n<li>Providing visibility and updates on the progress of activities and tasks.</li>\n<li>Escalating issues in a timely manner.</li>\n<li>Maintaining a cohesive team spirit.</li>\n<li>Acting as a lead contributor on assigned projects.</li>\n<li>Instructing, assigning, directing, and checking the work of other developers.</li>\n<li>Conducting peer reviews on code quality.</li>\n<li>Ensuring Information Security.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>6+ years of experience as a Senior Java Developer and 2 years in a Lead Role.</li>\n<li>In-depth knowledge of Java and Spring frameworks (Core/MVC/Spring Boot etc.).</li>\n<li>Proficient knowledge and experience in Webservices (REST/SOAP).</li>\n<li>Strong knowledge in writing stored procedures and SQL queries.</li>\n<li>Experience in modeling databases based on business requirements.</li>\n<li>Strong knowledge in Data Analysis.</li>\n<li>Proficiency in Angular or similar frontend frameworks.</li>\n<li>Working experience with GIT and Artefactory.</li>\n<li>Knowledge of DevOps, Test Driven Development and CI/CD pipelines.</li>\n<li>Experience with deployment to Cloud Services.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various Bonus programs.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@techversantinfotech.com</li>\n<li>Website: http://www.techversantinfotech.com</li>\n</ul>",
        "tags": [
            "6+ Years",
            "Java",
            "Spring Framework",
            "Webservices"
        ],
        "summary": "Techversant Infotech is looking for a Java Team Lead to manage Java development, ensure code quality, and communicate with clients. The role requires strong Java, Spring, and Web services experience."
    },
    {
        "job_title": "Design Strategist and UX Researcher",
        "company": "Marvelloux Apps (P) Ltd",
        "url": "https://technopark.org/job-details/22470",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Design Strategist and UX Researcher</h2>\n<p><strong>Marvelloux Apps (P) Ltd</strong>\nGround Floor, Gayatri Building, Technopark Phase I, Trivandrum, 695581\n<a href=\"http://www.marvelloux.com\">http://www.marvelloux.com</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025\n<strong>Contact Email:</strong> hr@marvelloux.com</p>\n<p><strong>Brief Description</strong></p>\n<p><strong>1. Project Planning &amp; Execution:</strong>\n- Oversee the full project lifecycle, including planning, execution, and delivery of UI/UX projects.\n- Define project goals, deliverables, timelines, and success criteria in collaboration with stakeholders.\n- Manage project scope and mitigate scope creep through proactive communication.</p>\n<p><strong>2. Team Management &amp; Coordination:</strong>\n- Lead cross-functional teams, including designers, developers, and testers, ensuring seamless collaboration.\n- Assign tasks, set priorities, and monitor progress to ensure timely delivery.\n- Provide clear instructions and feedback to team members to maintain alignment with project objectives.</p>\n<p><strong>3. Client Interaction:</strong>\n- Act as the main point of contact for clients, ensuring their vision is translated into actionable project plans.\n- Conduct regular status updates, gather feedback, and manage client expectations.\n- Present project deliverables, including prototypes and final designs, to clients.</p>\n<p><strong>4. Quality Assurance &amp; Usability:</strong>\n- Ensure all project outputs align with UI/UX best practices and meet usability standards.\n- Facilitate user testing sessions and incorporate feedback into design iterations.\n- Maintain consistency across designs in line with brand guidelines and user needs.</p>\n<p><strong>5. Risk &amp; Budget Management:</strong>\n- Identify risks early and develop contingency plans to address them.\n- Manage project budgets, ensuring cost efficiency while maintaining quality.</p>\n<p><strong>6. Continuous Improvement:</strong>\n- Analyze project performance and implement process improvements for future initiatives.\n- Stay updated with the latest trends and tools in UI/UX design and project management.</p>\n<p><strong>Required Qualifications:</strong>\n- Bachelor’s degree in Design, Project Management, Computer Science, or related fields.\n- 1–2 years of experience managing UI/UX or digital design projects.\n- Proven experience with project management methodologies (Agile, Scrum, or Waterfall).\n- Familiarity with design tools such as Figma, Sketch, or Adobe XD.\n- Proficiency in project management tools like Jira, Asana, Trello, or similar platforms.</p>\n<p><strong>Preferred Skills/Mandatory Requirements:</strong>\n- Strong understanding of UI/UX principles and user-centered design processes is a must.\n- Excellent communication and interpersonal skills for team collaboration and client interaction.\n- Stakeholder Management</p>",
        "tags": [
            "1-2 Years",
            "UI/UX",
            "Figma",
            "Project Management"
        ],
        "summary": "Seeking a Design Strategist and UX Researcher to oversee UI/UX projects, lead cross-functional teams, and ensure quality through user-centered design processes. The role involves client interaction, risk management, and continuous improvement."
    },
    {
        "job_title": "DotNet Senior Software Engineer",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/22469",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>.Net Senior Software Engineer</h2>\n<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong>\n14th FLOOR, CARNIVAL TECHNOPARK, TECHNOPARK CAMPUS, KARIYAVATTOM P.O., TRIVANDRUM , 695581\n<a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<p><strong>Contact Email:</strong> vidhya.r@muthoot.com</p>\n<p><strong>Location:</strong> Technopark Phase-1, Trivandrum, Kerala\n<strong>Experience:</strong> 5 to 12 years\n<strong>Mode:</strong> Work from Office\n<strong>Role:</strong> Permanent\n<strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Overall experience in .Net 5-12 years.</li>\n<li>Minimum 4 years’ experience in ASP .Net/ C# Development.</li>\n<li>Development of web/window applications using the .NET programming components.</li>\n<li>Experience in Angular will be added advantages.</li>\n<li>Able to handle and mentor 2-3 members in a Team.</li>\n<li>Customizing current applications in line with changing business requirements.</li>\n<li>The candidate is responsible for completing analysis, design, coding, and implementation phases of software development life cycle in scheduled time frame.</li>\n<li>Should interact with superiors and business users for capturing requirements.</li>\n</ul>\n<p><strong>Skill Sets:</strong></p>\n<ul>\n<li>Experience in ASP.NET, C#, VB.NET/ JavaScript, jQuery, VBScript, HTML, XML and Ajax</li>\n<li>ADO.NET/SQL Server</li>\n<li>Angular is preferable.</li>\n<li>MVC/MVC/WCF/WPF/Design patterns/LINQ/Lambda expressions are desirable.</li>\n<li>Experience in SQL scripting, stored procedures, functions</li>\n<li>Must have used in Source &amp; Configuration Management using Git/SVN</li>\n<li>Experience in API integrations (Consuming APIs &amp; Libraries) is preferred.</li>\n<li>Experience in Cloud Development will be added advantages.</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\nDotNet, MVC, C#, Webforms, Web API, SQL scripting, stored procedures.</p>",
        "tags": [
            "5-12 Years",
            ".NET",
            "C#",
            "SQL Server"
        ],
        "summary": "Seeking a .Net Senior Software Engineer to develop and customize web/window applications. The role involves leading a team and requires strong experience with ASP.NET and C#."
    },
    {
        "job_title": "Java Senior Software Engineer",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/22468",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Java Senior Software Engineer</h2>\n<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong>\n14th FLOOR, CARNIVAL TECHNOPARK, TECHNOPARK CAMPUS, KARIYAVATTOM P.O., TRIVANDRUM , 695581\n<a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<p><strong>Contact Email:</strong> vidhya.r@muthoot.com</p>\n<p><strong>Location:</strong> Technopark Phase-1, Trivandrum, Kerala\n<strong>Experience:</strong> 5 to 12 years\n<strong>Mode:</strong> Work from Office\n<strong>Role:</strong> Permanent</p>\n<p><strong>Description:</strong></p>\n<ul>\n<li>Overall experience in Java – 5-12 years</li>\n<li>Minimum 5 years’ experience in Java Development</li>\n<li>Knowledge on developing stored procedures and developing complex sql queries in MSSQL</li>\n<li>Experienced in working Agile projects using agile tools &amp; continuous integration, hands-on experience on Spring Framework, Spring Boot.</li>\n<li>Must have used in Source &amp; Configuration Management using Git/SVN</li>\n<li>Experience in using ORM such as Hibernate on MySQL/SQL Server/Oracle DB is a bonus</li>\n<li>Must have experience in unit testing &amp; using tools along with JSON/XML</li>\n<li>Linux knowledge is a bonus</li>\n<li>Experience in third-party integrations (Consuming APIs &amp; Libraries) is preferred</li>\n<li>Experience in using code quality tools such as Cobertura is a bonus</li>\n<li>Angular 7 experience is a plus</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\nJava, Springboot, Microservices, Database Stored procedures, SQL.</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025</p>",
        "tags": [
            "5-12 Years",
            "Java",
            "Spring Boot",
            "SQL"
        ],
        "summary": "Seeking a Java Senior Software Engineer with 5-12 years of experience for a permanent, office-based role in Trivandrum. The role involves Java development, Spring Boot, and database stored procedures."
    },
    {
        "job_title": "DotNet Technical Architect",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/22467",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>.Net Technical Architect</h2>\n<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong>\n14th FLOOR, CARNIVAL TECHNOPARK, TECHNOPARK CAMPUS, KARIYAVATTOM P.O., TRIVANDRUM, 695581\n<a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025\n<strong>Contact Email:</strong> vidhya.r@muthoot.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Provide technical guidance to a team of developers in developing features in an enterprise .Net application serving end users through angular web-based application.</li>\n<li>Overall experience in .Net 20-23 years with a minimum of 20 years of experience as a tech lead.</li>\n<li>Customizing current applications in line with changing business requirements.</li>\n<li>Experienced in Technical Design &amp; creating design documents.</li>\n<li>Must have experience in using MySQL/MS SQL Server.</li>\n<li>Must have experience in ASP.NET, C#, VB.NET/ JavaScript, jQuery, VBScript, HTML, XML, Ajax and Angular.</li>\n<li>MVC/MVC/WCF/WPF/Design patterns/LINQ/Lambda expressions.</li>\n<li>Experience in SQL scripting, stored procedures, functions.</li>\n<li>Must have used in Source &amp; Configuration Management using Git/SVN.</li>\n<li>Experience in API integrations (Consuming APIs &amp; Libraries) is preferred.</li>\n<li>Experience in Cloud Development will be added advantages.</li>\n<li>Able to handle and mentor 5-8 tech team members.</li>\n<li>Should interact with superiors and business users for capturing requirements.</li>\n<li>Should be able to work on multiple projects with multiple deadlines.</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\nDotNet, MVC, C#, Webforms, Web API, SQL, stored procedures, hands-on coding part, Team handling.</p>",
        "tags": [
            "20+ Years",
            ".NET",
            "C#",
            "Angular",
            "SQL"
        ],
        "summary": "Seeking a .Net Technical Architect to guide a development team and customize applications. Requires 20+ years of .Net experience, expertise in C#, Angular, and SQL."
    },
    {
        "job_title": "PHP Development",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/22466",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Web Developer</h2>\n<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong>\n14th FLOOR, CARNIVAL TECHNOPARK, TECHNOPARK CAMPUS, KARIYAVATTOM P.O., TRIVANDRUM , 695581\n<a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<p><strong>Contact Email:</strong> vidhya.r@muthoot.com</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a skilled Web Developer with strong expertise in PHP backend development, WordPress CMS, and working knowledge of Node.js. The ideal candidate should also be open to working with modern front-end frameworks such as React or Angular based on project requirements.</p>\n<p><strong>Experience Required:</strong> 2 to 4 Years\n<strong>Mode:</strong> Work from Office\n<strong>Location:</strong> Technopark, Trivandrum</p>\n<h3>Objectives of this role</h3>\n<ul>\n<li>Build and maintain robust backend systems using PHP and Node.js</li>\n<li>Develop and manage content-rich websites and applications using WordPress CMS</li>\n<li>Collaborate with front-end teams (React or Angular) for seamless integration</li>\n<li>Ensure scalability, security, and performance of all web solutions</li>\n</ul>\n<h3>Job Description</h3>\n<p>As a Web Developer, you will be responsible for building and maintaining high-performing, scalable web applications. You will handle backend development using PHP, custom WordPress implementations, and Node.js APIs, while collaborating closely with frontend developers and designers. You will play a key role in integrating third-party services, managing CMS content, and improving existing systems with new features based on business goals and user needs.</p>\n<h3>Required Skills and Qualifications</h3>\n<ul>\n<li>Strong experience in PHP backend development (3+ years)</li>\n<li>Hands-on experience with WordPress CMS, including theme and plugin customization</li>\n<li>Working knowledge of Node.js for backend API development</li>\n<li>Familiarity with React or Angular for front-end collaboration</li>\n<li>Understanding of RESTful APIs and third-party service integration</li>\n<li>Proficiency in HTML5, CSS3, JavaScript, Bootstrap, and jQuery</li>\n<li>Experience with version control tools like Git and Gitea</li>\n<li>Strong debugging, optimization, and performance tuning skills</li>\n<li>Excellent problem-solving and communication abilities</li>\n</ul>\n<h3>Preferred Skills and Qualifications</h3>\n<ul>\n<li>Experience in headless WordPress or CMS integrations</li>\n<li>Willingness to learn new tools, frameworks, and technologies</li>\n<li>Professional certification in PHP, WordPress, or full-stack development is a plus</li>\n<li>Strong knowledge of PHP backend and Wordpress CMS also with Node JS or React or Angular.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "PHP",
            "WordPress",
            "Node.js"
        ],
        "summary": "Seeking a Web Developer to build and maintain scalable web applications using PHP, WordPress, and Node.js. The role involves backend development, CMS management, and collaboration with front-end teams."
    },
    {
        "job_title": "Java Full Stack Development",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/22465",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Java Full Stack Developer</h2>\n<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong>\n14th Floor, Carnival Technopark, Technopark Campus, Kariyavattom P.O., Trivandrum, 695581\n<a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025\n<strong>Contact Email:</strong> vidhya.r@muthoot.com</p>\n<p><strong>Brief Description:</strong> Full Stack Java</p>\n<p><strong>Experience Required:</strong> 5 to 12 Years\n<strong>Notice Period:</strong> Immediate to 30 days\n<strong>Mode:</strong> Work from Office\n<strong>Location:</strong> Trivandrum</p>\n<h3>Objectives of this role</h3>\n<ul>\n<li>Work across the full stack, building highly scalable distributed solutions that enable positive user experiences and measurable business growth.</li>\n<li>Develop new features and infrastructure in support of rapidly emerging business and project requirements.</li>\n<li>Assume leadership of new projects, from conceptualization to deployment.</li>\n<li>Ensure application performance, uptime, and scale, and maintain high standards for code quality and application design.</li>\n</ul>\n<h3>Job Description</h3>\n<ul>\n<li>At least 5 to 12 years of hands-on work experience as a Full Stack Developer (Java, Angular).</li>\n<li>Requirement analysis, design, and implementation of complex systems.</li>\n<li>Application Development: Hands-on experience of Java, Spring Boot, Hibernate, REST API, Microservices, JavaScript, Angular, and NgRx.</li>\n<li>UI Development: Build responsive, efficient, re-usable web applications.</li>\n<li>Hands-on experience on any Cloud Platform (GCP/AWS) and knowledge of Dockers, Kubernetes. Experience on MSSQL/MySQL/Oracle/MongoDB.</li>\n<li>Collaborate with business teams/Client independently and work with architects &amp; subsystem teams to identify the right designs.</li>\n<li>Collaborate with offshore teams following Agile development methodology such as planning, reviews, retrospectives, and daily status reporting.</li>\n<li>Responsible for building and setting best practices, defining processes to ensure that the best possible product/solution is being delivered.</li>\n</ul>\n<h3>Required Skills and Qualifications</h3>\n<ul>\n<li>At least 5 to 12 years of experience in building large-scale software applications.</li>\n<li>Experience in building web applications.</li>\n<li>Experience in designing and integrating RESTful APIs.</li>\n<li>Knowledge of Java, Angular, NgRx, and JavaScript.</li>\n<li>Excellent debugging and optimization skills.</li>\n<li>Experience in unit/integration testing.</li>\n</ul>\n<h3>Preferred Skills and Qualifications</h3>\n<ul>\n<li>Bachelor’s degree (or equivalent) in computer science, information technology, or engineering.</li>\n<li>Interest in learning new tools, languages, workflows, and philosophies.</li>\n<li>Professional certification.</li>\n</ul>\n<p><strong>Preferred Skills:</strong> Java, Angular</p>",
        "tags": [
            "5-12 Years",
            "Java",
            "Angular",
            "REST API"
        ],
        "summary": "Seeking a Java Full Stack Developer to build scalable solutions and lead projects. Must have strong experience with Java, Angular, and cloud platforms."
    },
    {
        "job_title": "Motion Graphic Designer",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22464",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Motion Graphic Designer</h2>\n<p><strong>Globcom Solutions (P) Ltd</strong>\nModule 2502, 5th floor, Yamuna Building\nTechnopark Phase -3, Thiruvananthapuram, 695583\nhttp://www.globcomsolution.com</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025\n<strong>Contact Email:</strong> rajesh@globcomsolution.com</p>\n<h3>Role Overview:</h3>\n<p>We are looking for a highly creative Motion Graphic Designer with 5 to 10 years of professional experience in crafting dynamic visual content for digital platforms. The ideal candidate should have expert-level skills in Adobe Photoshop, Illustrator, Premiere Pro, After Effects, and other motion design tools.</p>\n<p>This role requires a designer who can take complex ideas and transform them into visually appealing motion graphics, animations, explainer videos, and short-form content. The candidate should be passionate about visual storytelling and capable of producing high-quality content within tight deadlines, while collaborating closely with marketing, product, and design teams.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Create engaging motion graphics for marketing videos, product demos, social media, brand campaigns, and presentations.</li>\n<li>Design and animate assets including logos, typography, icons, transitions, and infographics.</li>\n<li>Collaborate with graphic designers, copywriters, and developers to bring concepts to life.</li>\n<li>Edit and assemble raw footage into polished video content when required.</li>\n<li>Manage multiple projects simultaneously while maintaining creative quality and meeting deadlines.</li>\n<li>Stay updated on industry trends, animation techniques, and emerging design tools.</li>\n<li>Ensure brand consistency and visual appeal across all animated content.</li>\n<li>Prepare and deliver project files in various formats as required for different platforms (web, mobile, social).</li>\n</ul>\n<h3>Preferred Skills/Requirements:</h3>\n<ul>\n<li>5 to 10 years of hands-on experience in motion graphics and video editing.</li>\n<li>Proficiency in Adobe After Effects, Premiere Pro, Photoshop, Illustrator, and related tools.</li>\n<li>Strong portfolio showcasing motion design, video work, and visual storytelling.</li>\n<li>Excellent understanding of animation principles, timing, pacing, and transitions.</li>\n<li>Ability to edit audio and sync visuals for a seamless viewer experience.</li>\n<li>Strong sense of visual composition, color, typography, and layout.</li>\n<li>Experience with storyboard creation, script breakdowns, and video production workflows.</li>\n<li>Bonus: Experience with 3D tools like Cinema 4D, Blender, or sound design tools.</li>\n<li>Strong communication skills and a proactive attitude toward creative challenges.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume, portfolio link, and a brief cover letter to rajesh@globcomsolution.com</p>\n<p><strong>Location:</strong> Technopark, TVM</p>",
        "tags": [
            "5-10 Years",
            "Adobe After Effects",
            "Premiere Pro",
            "Motion Graphics"
        ],
        "summary": "Globcom Solutions is seeking a Motion Graphic Designer to create dynamic visual content. The role involves crafting engaging animations and videos, collaborating with teams to meet deadlines."
    },
    {
        "job_title": "SEM - Digital Marketing Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22462",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>SEM - Digital Marketing Manager</h2>\n<p>We’re seeking a <strong>results-driven, data-savvy SEM Specialist</strong> to take ownership of our paid search strategy and execution. In this role, you will play a pivotal part in boosting online visibility, attracting high-quality traffic, and driving revenue growth for our online booking platform. You’ll lead impactful search campaigns across platforms such as Google Ads and Bing Ads, while partnering with internal teams to ensure brand consistency and alignment across all paid media efforts.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design and implement end-to-end SEM strategies focused on increasing search visibility, driving high-intent traffic, and optimizing conversion performance.</li>\n<li>Conduct thorough keyword research to identify strategic, user-aligned search terms that align with business goals and campaign objectives.</li>\n<li>Manage and fine-tune paid search campaigns across Google Ads, Bing Ads, and other platforms to maximize efficiency, scalability, and ROI.</li>\n<li>Analyze performance data using tools like Google Analytics, transforming insights into strategic actions that enhance campaign outcomes.</li>\n<li>Deliver regular, data-driven performance reports with clear insights and recommendations for ongoing campaign refinement.</li>\n<li>Collaborate with cross-functional teams—including content, design, and development—to ensure that ad copy, visuals, and landing pages are cohesive, effective, and on-brand.</li>\n<li>Stay informed on evolving SEM trends, algorithm changes, and platform innovations, applying industry best practices to maintain a competitive advantage.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, or a related field.</li>\n<li>Minimum of 6 years of experience in search engine marketing, preferably within an e-commerce or online booking environment.</li>\n<li>Demonstrated track record of success in planning, executing, and optimizing SEM campaigns across multiple platforms.</li>\n<li>Strong analytical skills with the ability to interpret complex data and translate insights into actionable strategies.</li>\n<li>Prior experience working in the US market, with proven success managing monthly SEM budgets of $100,000 or more.</li>\n<li>Excellent communication and interpersonal skills, with the ability to clearly present campaign performance and insights to internal stakeholders.</li>\n<li>Proficiency in Google Ads and Bing Ads platforms.</li>\n<li>Google Ads Certification is preferred.</li>\n</ul>\n<p>Apply here: https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>\n<p>Contact Email: careers@way.com</p>",
        "tags": [
            "6+ Years",
            "Google Ads",
            "Bing Ads",
            "Google Analytics"
        ],
        "summary": "We are looking for a SEM - Digital Marketing Manager to own our paid search strategy. The candidate will be responsible for boosting online visibility and driving revenue growth."
    },
    {
        "job_title": "Specialist - Email Marketing",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22461",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Specialist - Email Marketing</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Apply here:</strong> https://waydot.greythr.com/hire/jobs/senior-product-email-marketing-specialist-b2c/</p>\n<p><strong>Responsibilities:</strong></p>\n<p><strong>Customer-Centric Campaigns</strong></p>\n<ul>\n<li>Identify customer pain points and develop innovative strategies to enhance the overall user experience.</li>\n<li>Design and deploy targeted email campaigns informed by real-time customer feedback and behavioral data.</li>\n<li>Monitor campaign performance with an emphasis on audience segmentation, list hygiene, and automation accuracy.</li>\n<li>Implement anomaly detection protocols to safeguard email deliverability and ensure system reliability.</li>\n</ul>\n<p><strong>Personalization at Scale</strong></p>\n<ul>\n<li>Leverage marketing automation platforms, user behavior analytics, and machine learning to deliver personalized, scalable email experiences.</li>\n</ul>\n<p><strong>Experimentation &amp; Optimization</strong></p>\n<ul>\n<li>Execute ongoing A/B testing to optimize subject lines, content, CTAs, and design for maximum impact.</li>\n<li>Analyze campaign data to uncover trends, generate insights, and inform broader marketing strategies across teams.</li>\n</ul>\n<p><strong>Data-Driven Growth</strong></p>\n<ul>\n<li>Drive measurable results across key performance metrics including Marketing Qualified Leads (MQLs), Sales Qualified Opportunities (SQOs), pipeline progression, and revenue impact.</li>\n<li>Deliver regular performance reports and continuously iterate on strategies to exceed KPIs and meet business objectives.</li>\n</ul>\n<p><strong>Cross-Functional Collaboration</strong></p>\n<ul>\n<li>Work closely with senior stakeholders across product, engineering, compliance, marketing, and partnerships to align on strategic goals.</li>\n<li>Ensure email marketing efforts integrate seamlessly with broader product launches, technical rollouts, and go-to-market plans.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li><strong>Experience:</strong> 10–15 years of hands-on experience in email marketing, including 3+ years in a leadership capacity.</li>\n<li>Demonstrated success in designing and executing large-scale, data-driven email marketing strategies.</li>\n</ul>\n<p><strong>Technical Expertise:</strong></p>\n<ul>\n<li>Deep knowledge of email technologies, including webhooks, APIs, and ETL pipelines.</li>\n<li>Proven ability to communicate and manage technical requirements in collaboration with Product, Engineering, and Data Science teams.</li>\n</ul>\n<p><strong>Analytical Strengths:</strong></p>\n<ul>\n<li>Advanced analytical capabilities to identify data trends and generate actionable insights for ongoing campaign optimization.</li>\n<li>Skilled in leading experimentation roadmaps that deliver measurable performance improvements.</li>\n</ul>\n<p><strong>Industry Knowledge:</strong></p>\n<ul>\n<li>Strong grasp of the email marketing ecosystem, including deliverability best practices, compliance with global privacy regulations (e.g., GDPR, US Privacy laws), and growth marketing principles such as attribution and incrementality.</li>\n</ul>\n<p><strong>Leadership Qualities:</strong></p>\n<ul>\n<li>A proactive, self-motivated leader capable of driving both strategic initiatives and hands-on execution with minimal supervision.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li><strong>Competitive Compensation:</strong> An industry-leading rewards and benefits package.</li>\n<li><strong>Career Advancement:</strong> A high-impact role with the opportunity to lead and scale a global email marketing function.</li>\n<li><strong>Prestige &amp; Purpose:</strong> Collaborate with one of the most respected names in the US startup ecosystem, making a tangible impact on business outcomes.</li>\n</ul>",
        "tags": [
            "10-15 Years",
            "Email Marketing",
            "Data-Driven Strategies",
            "Marketing Automation"
        ],
        "summary": "Seeking an Email Marketing Specialist to drive customer-centric campaigns and personalization at scale. This role requires 10+ years of experience and a deep understanding of email technologies."
    },
    {
        "job_title": "Architect/Manager - Data",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22460",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Data Architect/Manager</h2>\n<p>Way.com is seeking a highly skilled and driven Data Architect/Manager to join our dynamic team. This role blends technical proficiency with strategic leadership, ideal for someone passionate about shaping data architecture initiatives.</p>\n<p><strong>About Way</strong></p>\n<p>Way.com is revolutionizing car ownership as the nation’s leading Auto Super App, helping millions of drivers save on insurance, parking, maintenance, and roadside assistance. Our enterprise solutions also deliver value to cities, fleets, and major organizations nationwide.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p>As a Data Architect/Manager, you will:</p>\n<ul>\n<li>Design, implement, and maintain scalable, resilient database models, schemas, and data infrastructure.</li>\n<li>Lead and mentor a high-performing team of data engineers, analysts, and stakeholders.</li>\n<li>Collaborate with product, engineering, design, and business teams to convert needs into data solutions.</li>\n<li>Evaluate, select, and manage database technologies and tools aligned with the company’s data strategy.</li>\n<li>Monitor system performance and manage the full data lifecycle to ensure reliability and efficiency.</li>\n<li>Enforce robust data governance practices and ensure compliance with privacy regulations.</li>\n<li>Provide strategic guidance for data initiatives that support executive decision-making.</li>\n<li>Promote best practices and lead organization-wide data efforts.</li>\n<li>Keep leadership informed on progress, potential risks, and proactively address issues.</li>\n</ul>\n<p><strong>Preferred Skills and Qualifications</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, Data Science, or a related field.</li>\n<li><strong>8+ years</strong> of professional experience in database development, data modeling, and architectural design.</li>\n<li>Demonstrated success in managing teams or leading complex technical projects.</li>\n<li>Relevant certifications such as CDMP, TOGAF, or equivalent are highly desirable.</li>\n<li>Strong foundation in RDBMS principles, with hands-on experience in relational and NoSQL databases.</li>\n<li>Experience in the Networking or Security domain is a plus.</li>\n<li>Practical expertise in API consumption and multi-tenant database design.</li>\n<li>Proficiency in tools and technologies such as Oracle, MySQL, Cassandra, Talend, ETL tools, Hadoop, and more.</li>\n<li>In-depth knowledge of database security, compliance practices, and regulatory frameworks.</li>\n</ul>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li>Proven leadership and team management capabilities with a focus on mentoring and team growth.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication skills with the ability to convey complex technical concepts.</li>\n<li>Exceptional attention to detail to maintain high standards in performance and security.</li>\n<li>Ability to balance leadership duties with technical execution while managing competing priorities.</li>\n<li>Effective project and stakeholder management skills, focused on achieving measurable business outcomes.</li>\n</ul>\n<p>Apply here: https://waydot.greythr.com/hire/jobs/data-architectmanager</p>\n<p>Contact Email: careers@way.com</p>",
        "tags": [
            "8+ Years",
            "Data Modeling",
            "Database Development",
            "Data Architecture"
        ],
        "summary": "We are seeking a Data Architect/Manager to design and maintain data infrastructure and lead data initiatives. The ideal candidate will have 8+ years of experience and strong leadership skills."
    },
    {
        "job_title": "Spanish Customer Success - Executive role",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22459",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Spanish Customer Success - Executive</h2>\n<p>Way.Com India Pvt Ltd is seeking a Spanish Customer Success Executive to join our team in Thiruvananthapuram. This role involves managing customer interactions and providing exceptional support to ensure customer satisfaction.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage inbound and outbound customer calls with a high level of professionalism, addressing inquiries, concerns, and complaints in a prompt and courteous manner.</li>\n<li>Provide empathetic, solution-focused support to ensure a positive customer experience and maintain high satisfaction levels.</li>\n<li>Identify and escalate complex or unresolved issues to relevant internal teams for timely and effective resolution.</li>\n<li>Properly document all customer interactions in internal systems, ensuring records are clear, organized, and comprehensive.</li>\n<li>Consistently achieve or exceed performance targets, including customer satisfaction, first-call resolution, and productivity metrics.</li>\n<li>Maintain up-to-date knowledge of company products and services to offer reliable, relevant, and helpful guidance to customers.</li>\n<li>Collaborate with team members to support a positive, goal-oriented work environment focused on shared success and continuous improvement.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Fluent in both Spanish and English (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong interpersonal and communication skills, with a patient and empathetic approach.</li>\n<li>Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@way.com</li>\n<li>Apply here: https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Spanish Language",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "We are looking for a Spanish Customer Success Executive. Responsibilities include managing customer calls and providing support in a fast-paced environment."
    },
    {
        "job_title": "Campaign Manager - Social Media",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22458",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Campaign Manager - Social Media</h2>\n<p><strong>Way.com is seeking a strategic, creative, and forward-thinking Social Media Marketing Manager to lead and elevate our presence across all major social platforms.</strong></p>\n<p>In this high-impact leadership role, you will be responsible for driving brand awareness, strengthening community engagement, and boosting user interaction. You’ll work closely with content, design, and digital marketing teams to deliver a cohesive and results-driven social media strategy that embodies our brand and supports overall business growth.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute a comprehensive social media strategy that aligns with Way.com’s brand voice and business objectives, ensuring consistency and innovation across channels.</li>\n<li>Oversee the planning, creation, and scheduling of tailored content for platforms including Instagram, Facebook, X (Twitter), LinkedIn, TikTok, and others to drive engagement and visibility.</li>\n<li>Cultivate a strong and interactive digital community by engaging with followers, responding to comments and messages, and maintaining a consistent and positive brand tone.</li>\n<li>Enhance brand awareness and loyalty through creative social campaigns that foster community interaction and encourage user advocacy.</li>\n<li>Track, analyze, and report on performance metrics; use insights to refine strategy and optimize campaigns for reach, engagement, and ROI.</li>\n<li>Identify and manage relationships with influencers, creators, and strategic partners to expand brand reach and engagement.</li>\n<li>Stay informed on emerging platform features, trends, and tools, ensuring our strategy remains fresh, relevant, and competitive.</li>\n<li>Work closely with product, content, customer support, and design teams to align messaging and amplify integrated marketing initiatives.</li>\n<li>Manage the social media budget effectively, making data-driven decisions to allocate spend for maximum impact.</li>\n<li>Monitor brand mentions across platforms, respond to feedback, and address issues in real time to protect and enhance Way.com’s public image.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, or a related field (Master’s degree is a plus).</li>\n<li>A minimum of 9 years of experience in social media marketing, with a proven track record in executing successful campaigns and growing brand presence.</li>\n<li>Deep understanding of all major social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.) and their role in business development.</li>\n<li>Proficiency in social media management tools (e.g., Hootsuite, Sprout Social, Buffer) and analytics tools (e.g., Google Analytics, Socialbakers).</li>\n<li>Exceptional communication and leadership skills with the ability to inspire and guide a team.</li>\n<li>Strong creative acumen combined with strategic thinking capabilities.</li>\n<li>Expertise in paid social media strategies and advertising techniques.</li>\n<li>Ability to manage multiple projects efficiently under tight deadlines.</li>\n<li>A passion for digital innovation and staying up to date with evolving social media trends and technologies.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Way Dot Com (P) Ltd\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com\nContact Email: careers@way.com</p>\n<p>Apply here : https://waydot.greythr.com/hire/jobs/manager-social-media-marketing</p>",
        "tags": [
            "9+ Years",
            "Social Media Marketing",
            "Social Media Management Tools",
            "Strategic Planning"
        ],
        "summary": "Way.com is seeking a Social Media Marketing Manager to lead their social media presence, drive brand awareness, and boost user interaction. The role involves strategic planning, content oversight, and community management across multiple platforms."
    },
    {
        "job_title": "Business Development - Executive role",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22457",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p>We are seeking a strategic and results-driven Business Development Executive to join our dynamic sales team. If you are passionate about cultivating client relationships and accelerating business growth through creative outreach strategies, this is your opportunity to drive meaningful impact.</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Innovate &amp; Lead – Be part of a visionary team reshaping mobility with smart, tech-enabled solutions.</li>\n<li>Collaborate &amp; Create – Work in an open, idea-driven culture that embraces innovation and bold thinking.</li>\n<li>Performance-Based Rewards – Receive a competitive compensation package with attractive performance incentives.</li>\n<li>Professional Development – Benefit from structured training programs, mentorship, and clear career progression.</li>\n<li>Make a Difference – Contribute to scalable, customer-centric solutions that transform everyday mobility.</li>\n</ul>\n<p><strong>Key Responsibilities</strong></p>\n<p>As a Business Development Executive, you will:</p>\n<ul>\n<li>Proactively source and engage potential clients through cold calling, targeted email campaigns, and professional networking on social media platforms.</li>\n<li>Deliver persuasive pitches and business proposals that clearly articulate the value proposition and ROI of our offerings to key decision-makers.</li>\n<li>Maintain detailed and accurate CRM records to support pipeline management, timely follow-ups, and sales transparency.</li>\n<li>Achieve and surpass sales targets and KPIs, directly contributing to revenue growth and market expansion.</li>\n<li>Foster long-term client relationships to encourage loyalty, repeat business, and referrals.</li>\n<li>Prepare and present regular sales performance reports, providing actionable insights to support strategic planning and decision-making.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Proven experience in B2B sales with a strong track record of meeting or exceeding targets.</li>\n<li>5–8 years of sales experience, with prior exposure to the e-commerce sector being a significant plus.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong negotiation and relationship management capabilities.</li>\n<li>Self-motivated, goal-driven, and able to work independently with minimal supervision.</li>\n<li>Proficiency in CRM software (e.g., Zoho) and Microsoft Office Suite.</li>\n<li>Resilient and positive in the face of rejection, with a strong ability to bounce back.</li>\n<li>Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li>Email: careers@way.com</li>\n<li>Apply here: https://waydot.greythr.com/hire/jobs/business-development-manager</li>\n<li>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583</li>\n<li>http://www.way.com</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "B2B Sales",
            "CRM Software",
            "E-commerce"
        ],
        "summary": "We're seeking a Business Development Executive to drive growth through client relationships and outreach. The role involves achieving sales targets, managing client relations, and providing strategic insights."
    },
    {
        "job_title": "Business Operations - Executive role",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22456",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Business Operations Executive</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Location:</strong> Thiruvananthapuram, India</p>\n<p>We are seeking a detail-oriented and proactive Business Operations Executive to drive the efficient functioning of our Airport Parking operations. This role ensures service excellence, maintains operational accuracy, and fosters effective coordination with internal teams and external partners. The ideal candidate is adaptable, organized, and thrives in a dynamic environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage daily operations within the Airport Parking vertical, ensuring seamless execution and high service quality.</li>\n<li>Continuously monitor workflows to detect and address operational challenges, promptly escalating critical issues to ensure minimal disruption and business continuity.</li>\n<li>Maintain and update operational trackers and documentation with accuracy, supporting timely and reliable reporting.</li>\n<li>Collaborate with cross-functional teams to align operational activities with overarching business objectives and strengthen interdepartmental synergy.</li>\n<li>Serve as a point of contact for vendors and external stakeholders, ensuring clear communication, prompt issue resolution, and thorough record-keeping.</li>\n<li>Contribute to a superior customer experience by supporting the delivery of consistent, high-quality services.</li>\n<li>Assist with ad-hoc operational requirements and be available for support during night and weekend shifts, as needed.</li>\n</ul>\n<p><strong>Preferred Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Strong verbal and written communication skills with the ability to interact effectively across teams and stakeholders</li>\n<li>Excellent organizational and multitasking capabilities, with a demonstrated ability to manage competing priorities</li>\n<li>High attention to detail and a proactive, solution-oriented approach to problem-solving</li>\n<li>Analytical mindset with the ability to interpret basic data and identify trends</li>\n<li>Proficiency in Microsoft Excel (intermediate to advanced level) is mandatory</li>\n<li>Collaborative team player with the ability to work independently when required</li>\n<li>Willingness to work night shifts and weekends, based on business needs.</li>\n<li>Adaptability and eagerness to learn in a dynamic environment</li>\n<li>Prior experience in business operations or the automotive industry is a plus, though not required.</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 18, Sept 2025</p>\n<p><strong>Apply here:</strong> https://waydot.greythr.com/hire/jobs/business-operations-executive</p>",
        "tags": [
            "Entry Level",
            "Business Operations",
            "Microsoft Excel",
            "Communication Skills"
        ],
        "summary": "Seeking a detail-oriented Business Operations Executive for Airport Parking operations. This role focuses on ensuring service excellence and coordinating with internal teams and external partners."
    },
    {
        "job_title": "Specialist - Content QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22455",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Content QA Specialist</h2>\n<p>Way.Com India Pvt Ltd is seeking a detail-oriented and quality-obsessed Content QA Specialist to join our content team. In this role, you will be the final line of defense, ensuring every piece of content is accurate, SEO-optimized, compliant, and aligned with credibility and trust standards before publication.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>Content Integrity Reviews</strong></p>\n<ul>\n<li>Manually audit articles, blogs, and landing pages for grammar, tone, clarity, and consistency with brand voice and style guidelines.</li>\n<li>Identify and address awkward phrasing, factual errors, and formatting inconsistencies to maintain editorial excellence.</li>\n</ul>\n<p><strong>SEO &amp; Content Quality Assessment</strong></p>\n<ul>\n<li>Validate on-page SEO elements such as meta tags, headers, internal links, and keyword usage for effectiveness and compliance.</li>\n<li>Assess content depth, user value, and relevance, flagging content that lacks utility or actionable insights.</li>\n</ul>\n<p><strong>AI-Generated &amp; Plagiarism Detection</strong></p>\n<ul>\n<li>Use manual techniques and automated tools to identify AI-generated or machine-written content.</li>\n<li>Run plagiarism checks to ensure originality and protect brand reputation.</li>\n</ul>\n<p><strong>EEAT Compliance Verification</strong></p>\n<ul>\n<li>Verify author credentials and vet the reliability of cited sources.</li>\n<li>Ensure content showcases expertise, proper attribution, and fact-based, trustworthy information, especially for YMYL (Your Money Your Life) content.</li>\n</ul>\n<p><strong>Quality Assurance &amp; Continuous Improvement</strong></p>\n<ul>\n<li>Maintain and refine QA checklists and review standards to align with evolving industry best practices.</li>\n<li>Provide constructive feedback to writers and editors, fostering a culture of continuous improvement and editorial excellence.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements</strong></p>\n<ul>\n<li>Minimum of 2 years of experience in content quality assurance, editing, or SEO</li>\n<li>Exceptional manual editing skills with strong attention to detail</li>\n<li>Solid understanding of SEO fundamentals and Google’s content quality guidelines</li>\n<li>Proven ability to identify AI-generated content and assess it for human readability</li>\n<li>Proficient in using tools such as Grammarly, Copyscape, Copyleaks, Originality.ai, or similar alternatives</li>\n<li>Skilled at identifying low-value or thin content and providing actionable improvement recommendations</li>\n<li>Comfortable operating in a high-volume, fast-paced content production environment</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Educational or professional background in journalism, digital marketing, or technical writing</li>\n<li>Experience working with content management systems like WordPress</li>\n<li>Familiarity with structured data, Yoast SEO plugin, and content scoring tools</li>\n<li>Understanding of content compliance processes and fact-checking workflows</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>careers@way.com</p>\n<p><strong>Apply Here</strong></p>\n<p>https://waydot.greythr.com/hire/jobs/content-qa-specialist</p>",
        "tags": [
            "2+ Years",
            "SEO",
            "Content Quality Assurance",
            "EEAT"
        ],
        "summary": "Way.Com is looking for a Content QA Specialist to ensure content accuracy, SEO optimization and compliance. The role involves manual reviews, AI detection, and maintaining quality standards."
    },
    {
        "job_title": "Senior QA Automation Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22454",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p>Way Dot Com (P) Ltd is seeking a proactive and detail-oriented Senior QA Automation Engineer with expertise in Java-based automation testing. The ideal candidate will have 5+ years of experience in designing and maintaining robust test automation frameworks.</p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Apply here:</strong> https://waydot.greythr.com/hire/jobs/senior-qa-engineer</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Translate complex business requirements into effective test strategies and create comprehensive test plans.</li>\n<li>Design, build, and maintain reusable and scalable test automation frameworks using Java.</li>\n<li>Collaborate closely with product managers, developers, and QA peers to ensure quality is embedded throughout the SDLC (Software Development Life Cycle).</li>\n<li>Perform thorough end-to-end functional testing, ensuring broad coverage, high reliability, and alignment with business goals.</li>\n<li>Develop and execute automation scripts for both web and API layers using Selenium WebDriver and Rest Assured.</li>\n<li>Integrate automated tests into CI/CD pipelines (e.g., Jenkins) to enable continuous testing and accelerate release cycles.</li>\n<li>Monitor, troubleshoot, and optimize test executions, ensuring quick and reliable feedback during development cycles.</li>\n<li>Maintain high standards in test case design, automation code quality, and overall QA documentation.</li>\n<li>Analyze test results, identify defects, and work closely with development teams to ensure efficient resolution.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>5+ years of experience in test automation using Java.</li>\n<li>Strong knowledge of Core Java, including object-oriented principles, exception handling, multi-threading, and file handling.</li>\n<li>Proficiency in Java Collections (Lists, Sets, Maps, Queues) and solid understanding of data structures and algorithms.</li>\n<li>Hands-on experience with Selenium WebDriver, including dynamic element handling, custom wait strategies, and cross-browser compatibility.</li>\n<li>Proficient in REST API testing using Rest Assured, covering request modeling, authentication, and API validation.</li>\n<li>Experience with Jenkins or similar CI/CD tools for test suite integration and automation pipeline maintenance.</li>\n<li>Familiarity with load and performance testing tools such as JMeter, K6, or Locust, with the ability to identify performance bottlenecks and suggest improvements.</li>\n<li>Strong attention to detail, excellent problem-solving skills, and the ability to work independently or collaboratively in a fast-paced environment.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Seeking a Senior QA Automation Engineer to design and maintain automation frameworks. Requires expertise in Java, Selenium, and REST API testing to ensure high-quality software delivery."
    },
    {
        "job_title": "Tech Lead - iOS",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22453",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Tech Lead - iOS</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p>Apply here: <a href=\"https://waydot.greythr.com/hire/jobs/ios-technical-lead\">https://waydot.greythr.com/hire/jobs/ios-technical-lead</a></p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>iOS Application Development: Lead the end-to-end development of high-performance iOS applications using Swift, ensuring a scalable architecture and writing clean, maintainable code.</li>\n<li>Cross-Functional Collaboration: Work closely with Product and Design teams to translate business requirements into intuitive, user-centric technical solutions.</li>\n<li>Performance Optimization: Optimize application performance, responsiveness, and stability across a range of iOS devices and operating system versions.</li>\n<li>Mentorship and Code Quality: Provide guidance and mentorship to junior and mid-level iOS developers through code reviews, technical leadership, and adherence to best practices.</li>\n<li>Testing and Documentation: Maintain high coding standards through unit testing, detailed documentation, and strict adherence to clean code principles.</li>\n<li>Backend Integration: Partner with backend/API teams to design and implement seamless, scalable system integrations.</li>\n<li>Innovation and Process Improvement: Champion continuous improvement by refining mobile development processes and contributing to evolving engineering standards.</li>\n<li>Feature Ownership: Take full ownership of features, overseeing all phases from conception and development to deployment, monitoring, and performance optimization.</li>\n<li>Ongoing Learning and Development: Stay informed about the latest trends, tools, and technologies in the iOS development ecosystem to ensure modern and forward-thinking solutions.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>10+ years of experience in mobile app development, including 6+ years focused on iOS development.</li>\n<li>Deep expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.</li>\n<li>Strong understanding of RESTful APIs, JSON parsing, and integration of third-party libraries.</li>\n<li>Skilled in architecting complex mobile apps using modular design patterns such as MVVM, MVI, or MVP.</li>\n<li>Proficient in CI/CD workflows, automated testing, code review processes, and App Store deployments.</li>\n<li>Demonstrated leadership in team management and mentoring iOS developers.</li>\n<li>Experienced with tools like Firebase, Mixpanel, or equivalent analytics and crash reporting platforms.</li>\n<li>Solid understanding of web application ecosystems and cross-platform compatibility challenges.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Hands-on experience with Core Bluetooth, Core Location, or real-time service integrations (e.g., EV or roadside assistance).</li>\n<li>Background in mobility, transportation, or automotive tech platforms.</li>\n<li>Familiarity with Kotlin Multiplatform or other cross-platform development frameworks.</li>\n</ul>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com</p>",
        "tags": [
            "10+ Years",
            "Swift",
            "iOS Development",
            "RESTful APIs"
        ],
        "summary": "Seeking a Tech Lead - iOS to lead high-performance iOS application development and mentor junior developers. Requires 10+ years of experience and deep expertise in Swift, UIKit, and SwiftUI."
    },
    {
        "job_title": "Senior Engineer - Java",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22452",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Senior Engineer - Java</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p>Apply here: <a href=\"https://waydot.greythr.com/hire/jobs/senior-java-developer\">https://waydot.greythr.com/hire/jobs/senior-java-developer</a></p>\n<p><strong>Contact Email:</strong> <a href=\"careers@way.com\">careers@way.com</a></p>\n<p><strong>Closing Date:</strong> 18, Sept 2025\n<strong>Job Published:</strong> 04, Aug 2025</p>\n<p><strong>Key Technical Expertise:</strong> Java, Spring Boot, MySQL, RESTful API Development</p>\n<p><strong>Core Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain high-performance applications using Java and the Spring Boot framework.</li>\n<li>Collaborate with cross-functional teams, including Product Owners and Solution Architects, to transform business needs into scalable technical solutions.</li>\n<li>Develop and integrate RESTful APIs for seamless system interaction and enhanced application capabilities.</li>\n<li>Modernize legacy systems by refactoring code to boost performance, scalability, and long-term maintainability.</li>\n<li>Lead code reviews and mentor junior developers, promoting coding best practices and a culture of continuous learning.</li>\n<li>Stay updated with emerging trends in the Java ecosystem to encourage innovation in development strategies.</li>\n<li>Troubleshoot and resolve complex issues to ensure system reliability and a superior user experience.</li>\n<li>Follow coding standards and organizational guidelines to deliver secure, robust, and maintainable software solutions.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent professional experience).</li>\n<li>Minimum of 5+ years of professional experience in Java development, with strong hands-on expertise in Spring Boot and MySQL.</li>\n<li>In-depth understanding of Java SE and Java EE concepts, including multithreading, design patterns, and JVM internals.</li>\n<li>Proven experience in RESTful API design, development, and integration.</li>\n<li>Proficient in working with MySQL or other relational databases, with the ability to write and optimize complex SQL queries.</li>\n<li>Hands-on experience with version control systems, particularly Git.</li>\n<li>Familiarity with Agile methodologies (e.g., Scrum, Kanban) and experience working in Agile development environments.</li>\n<li>Strong problem-solving, debugging, and analytical skills, capable of addressing complex technical challenges.</li>\n<li>Excellent written and verbal communication skills with the ability to thrive in a collaborative, team-oriented environment.</li>\n<li>Demonstrated ability to mentor junior developers and contribute technical leadership to development teams.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience working with microservices architecture and Docker containerization.</li>\n<li>Working knowledge of cloud platforms, such as AWS or Microsoft Azure.</li>\n<li>Familiarity with CI/CD pipelines and automation tools (e.g., Jenkins, GitLab CI).</li>\n<li>Experience with unit testing frameworks, such as JUnit or TestNG.</li>\n<li>Proven track record of building scalable, high-performance applications in production-grade environments.</li>\n</ul>\n<p>Apply here: <a href=\"https://waydot.greythr.com/hire/jobs/senior-java-developer\">https://waydot.greythr.com/hire/jobs/senior-java-developer</a></p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL",
            "RESTful API"
        ],
        "summary": "Seeking a Senior Java Engineer to design and maintain high-performance applications. Requires 5+ years of experience with Java, Spring Boot, and RESTful APIs."
    },
    {
        "job_title": "Senior Director - HR Operations",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22451",
        "location": "Technopark",
        "closing_date": "18 Sep 2025",
        "job_description": "<h2>Senior Director - HR Operations</h2>\n<p>Way.Com India Pvt Ltd is seeking a highly experienced and data-driven Senior Director to lead and scale end-to-end HR operational excellence across the organization. The role is responsible for ensuring seamless delivery of all core HR functions, including talent acquisition, onboarding, payroll, HR systems, compliance, benefits administration, and performance management.</p>\n<p>The ideal candidate will have a strong track record of delivering tangible outcomes, experience leveraging AI and automation tools in HR, and thrives in fast-paced, tech-enabled, high-growth environments.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Operational Leadership:</strong></li>\n<li>Oversee and optimize end-to-end HR operations across the employee lifecycle: hiring, onboarding, employee records, payroll, benefits, exit processes, and compliance.</li>\n<li>Develop and implement efficient, tech-enabled HR processes to ensure accuracy, timeliness, and compliance.</li>\n<li>\n<p>Lead and drive adoption of HR technologies, including AI-based tools for recruitment, employee experience, and operational analytics.</p>\n</li>\n<li>\n<p><strong>Data-Driven HR Strategy:</strong></p>\n</li>\n<li>Build a robust HR analytics function that provides real-time dashboards and insights to support business decisions.</li>\n<li>Track and report KPIs across HR verticals: hiring efficiency, payroll accuracy, attrition, engagement scores, performance ratings, etc.</li>\n<li>\n<p>Drive predictive and prescriptive analytics to improve workforce planning, retention, and productivity.</p>\n</li>\n<li>\n<p><strong>Performance &amp; People Management:</strong></p>\n</li>\n<li>Partner with business and HR leadership to streamline and manage the performance management cycle, including OKRs, appraisals, feedback mechanisms, and talent calibration.</li>\n<li>\n<p>Ensure fair, consistent, and timely execution of performance-related processes.</p>\n</li>\n<li>\n<p><strong>Compliance, Risk &amp; Governance:</strong></p>\n</li>\n<li>Ensure HR policies, practices, and documentation comply with applicable employment laws and regulatory standards.</li>\n<li>\n<p>Oversee audits, risk assessments, and policy updates across all HR operations.</p>\n</li>\n<li>\n<p><strong>Team &amp; Stakeholder Management:</strong></p>\n</li>\n<li>Build and lead a high-performing HR operations team.</li>\n<li>Collaborate cross-functionally with Finance, IT, and Legal for process alignment, shared services, and employee experience.</li>\n<li>Be a trusted advisor to the leadership team on operational HR matters.</li>\n</ul>\n<p><strong>Qualifications &amp; Experience:</strong></p>\n<ul>\n<li>15+ years of progressive HR experience, with at least 5+ years in a leadership role overseeing HR operations</li>\n<li>Prior experience in product or technology companies with fast-paced, high-growth environments</li>\n<li>Strong hands-on expertise in HR technology platforms (HRIS, ATS, payroll systems) and AI-enabled tools for recruitment, employee service, or performance management</li>\n<li>Proven experience in delivering data-driven results across HR functions</li>\n<li>Demonstrated ability to scale HR operations, build shared services models, and drive automation and process excellence</li>\n<li>Strong understanding of compliance and labor laws across regions (India/US/global preferred)</li>\n<li>Excellent leadership, project management, and communication skills</li>\n</ul>\n<p><strong>Preferred Attributes:</strong></p>\n<ul>\n<li>Experience working in global or distributed teams</li>\n<li>Certification in HR Analytics, AI in HR, Six Sigma, or SHRM/SPHR preferred</li>\n<li>Proficiency in tools like Power BI, Tableau, Workday, Darwinbox, SAP SuccessFactors, or other HRMS tools</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Opportunity to shape and scale the HR backbone of a rapidly growing product company</li>\n<li>A culture that values innovation, transparency, impact, and data-driven decision-making</li>\n<li>Competitive compensation, equity options, and leadership influence at a strategic level</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p><strong>Closing Date:</strong> 18, Sept 2025</p>",
        "tags": [
            "5+ Years",
            "HR Technology Platforms",
            "AI-enabled Tools",
            "HR Analytics"
        ],
        "summary": "Seeking a Senior Director - HR Operations to lead HR functions, drive HR strategy using data, and ensure compliance. The role involves optimizing HR processes and leading a high-performing team."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22450",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p><strong>Alzone Software (P) Ltd</strong>\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\n<a href=\"http://www.alzonesoftware.com\">http://www.alzonesoftware.com</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025\n<strong>Contact Email:</strong> careers@alzonesoftware.com</p>\n<p><strong>Location:</strong> Trivandrum (Work From Office)\n<strong>Shift:</strong> Normal</p>\n<h3>Job Summary</h3>\n<p>We are seeking an experienced Business Development Manager with expertise in Digital Transformation Technologies, including Data Analytics, AI Platforms, and Web Development Services. The role focuses on driving business growth, building strong client relationships, and managing international sales in industries such as Supply Chain/Logistics, Pharma/Healthcare, and Banking/Finance.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Business Development:</strong> Formulate strategies to identify and secure new business opportunities in the Digital Transformation domain.</li>\n<li><strong>Client Engagement:</strong> Build and maintain relationships with CXOs, acting as a trusted advisor for IT consulting and digital transformation solutions.</li>\n<li><strong>Revenue Generation:</strong> Drive consistent revenue growth, meeting and exceeding sales targets with a proven track record of high-value deals.</li>\n<li><strong>Sales Execution:</strong> Manage the complete sales cycle, including lead generation, proposal development, and contract negotiations.</li>\n<li><strong>Market Insights:</strong> Conduct research to identify market trends, competitive landscape, and new business opportunities.</li>\n<li><strong>Collaboration:</strong> Partner with internal teams to deliver tailored client solutions and align with organizational goals.</li>\n<li><strong>Negotiation:</strong> Lead high-value contract negotiations, ensuring mutually beneficial agreements.</li>\n</ul>\n<h3>Preferred Skills/Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> Bachelor’s degree in Computer Science/IT (MBA preferred).</li>\n<li><strong>Experience:</strong> 4+ years in IT/Software business development, focusing on Digital Transformation and Web Development Services.</li>\n<li><strong>Revenue Generation History:</strong> Proven ability to deliver measurable revenue growth, supported by a verifiable record of successful deals and their impact on organizational growth.</li>\n<li><strong>International Sales:</strong> Expertise in global markets, with a strong network of CXO-level contacts and experience navigating diverse business environments.</li>\n<li><strong>Industry Expertise:</strong> In-depth understanding of Supply Chain/Logistics, Pharma/Healthcare, and Banking/Finance verticals.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume to careers@alzonesoftware.com with the subject line: \"Application for Business Development Manager.\"</p>",
        "tags": [
            "4+ Years",
            "Digital Transformation",
            "Web Development",
            "Data Analytics"
        ],
        "summary": "Alzone Software is seeking a Business Development Manager to drive growth in digital transformation. The role involves client engagement, revenue generation, and international sales across key industries."
    },
    {
        "job_title": "UiPath- RPA Developer",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22449",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>UiPath RPA Developer</h2>\n<p><strong>Alzone Software (P) Ltd</strong>\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\n<a href=\"http://www.alzonesoftware.com\">http://www.alzonesoftware.com</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025\n<strong>Contact Email:</strong> careers@alzonesoftware.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced UiPath RPA Developer to join our team. The ideal candidate will have a solid background in developing automation solutions using UiPath, along with strong analytical skills to enhance operational efficiency through automation. This role includes designing, implementing, and maintaining automation workflows, collaborating with stakeholders, and optimizing processes to support business growth.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Automation Development:</strong> Design, develop, and implement automation workflows using UiPath to streamline business operations.</li>\n<li><strong>Solution Design:</strong> Collaborate with business analysts and stakeholders to understand business requirements and convert them into effective technical solutions.</li>\n<li><strong>Process Optimization:</strong> Identify and recommend areas for automation to improve efficiency, reduce errors, and enhance productivity.</li>\n<li><strong>Testing &amp; Debugging:</strong> Perform thorough testing and debugging of automation solutions to ensure they meet quality standards and function correctly.</li>\n<li><strong>Documentation:</strong> Create and maintain comprehensive documentation for automation processes, including workflows, technical specifications, and user guides.</li>\n<li><strong>Support &amp; Maintenance:</strong> Provide ongoing support and maintenance for deployed automation solutions, troubleshoot issues, and implement updates as needed.</li>\n</ul>\n<h3>Preferred Skills/Requirements:</h3>\n<ol>\n<li><strong>Education:</strong> Bachelor’s degree in computer science, Information Technology, Engineering, or a related field.</li>\n<li><strong>Experience:</strong> Proven 3+ years experience in developing RPA solutions, specifically with UiPath</li>\n<li><strong>Technical Skills:</strong><ul>\n<li>Proficiency in UiPath for automation design and development.</li>\n<li>Strong understanding of RPA principles and best practices.</li>\n<li>Familiarity with database management and SQL.</li>\n<li>Experience in scripting languages such as Python or JavaScript is a plus.</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong><ul>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Ability to manage multiple projects and work independently.</li>\n</ul>\n</li>\n</ol>\n<p>Interested candidates share your updated resume to careers@alzonesoftware.com with the subject line \"RPA Developer-Uipath.\"</p>",
        "tags": [
            "3+ Years",
            "UiPath",
            "RPA",
            "Automation"
        ],
        "summary": "Alzone Software is looking for a UiPath RPA Developer. The role involves designing, implementing, and maintaining automation workflows to improve operational efficiency."
    },
    {
        "job_title": "Business Analyst [3+ years]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22448",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Alzone Software (P) Ltd - Business Analyst</h2>\n<p><strong>Location:</strong> Trivandrum (Work from Office)\n<strong>Experience:</strong> Minimum 3+ years\n<strong>Contact:</strong> careers@alzonesoftware.com</p>\n<h3>Job Overview:</h3>\n<p>We are seeking an experienced Business Analyst to join our team in Trivandrum. The ideal candidate will collaborate with stakeholders to gather, analyze, and document business requirements, translating them into functional specifications for the technology teams. You will play a key role in designing solutions, improving business processes, and ensuring successful project execution.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Requirement Gathering &amp; Analysis:</strong></li>\n<li>Work closely with business stakeholders to understand their needs, objectives, and pain points.</li>\n<li>Elicit, document, and analyze business requirements, workflows, and processes.</li>\n<li>\n<p>Translate business needs into clear, concise functional specifications for the development team.</p>\n</li>\n<li>\n<p><strong>Solution Design &amp; Implementation:</strong></p>\n</li>\n<li>Collaborate with technology teams to propose practical and innovative solutions.</li>\n<li>Ensure alignment of solutions with organizational strategy and technological capabilities.</li>\n<li>\n<p>Assist in defining project scope, objectives, and deliverables.</p>\n</li>\n<li>\n<p><strong>Stakeholder Communication:</strong></p>\n</li>\n<li>Act as a bridge between business teams and technical teams.</li>\n<li>Present findings, recommendations, and project updates to key stakeholders.</li>\n<li>\n<p>Simplify complex technical concepts for non-technical audiences.</p>\n</li>\n<li>\n<p><strong>Documentation &amp; Quality Assurance:</strong></p>\n</li>\n<li>Create detailed documentation, including business requirements, process flows, use cases, and user stories.</li>\n<li>Ensure accuracy and maintenance of project documentation.</li>\n<li>\n<p>Support system testing, user acceptance testing, and solution validation.</p>\n</li>\n<li>\n<p><strong>Process Improvement &amp; Risk Management:</strong></p>\n</li>\n<li>Identify areas for process optimization and efficiency enhancement.</li>\n<li>Recommend and assist in implementing process improvements.</li>\n<li>Monitor project progress, identify risks, and suggest mitigation strategies.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Business Administration, Information Technology, or a related field (Master’s degree is a plus).</li>\n<li>Minimum 3+ years of relevant experience as a Business Analyst.</li>\n<li>Strong analytical, problem-solving, and critical-thinking skills.</li>\n<li>Excellent communication and stakeholder management abilities.</li>\n<li>Proficiency in requirement gathering techniques, process modeling, and documentation.</li>\n<li>Familiarity with project management methodologies and the software development lifecycle (SDLC).</li>\n<li>Experience with tools like JIRA, Confluence, Microsoft Visio, etc.</li>\n<li>Business Analysis certification (CBAP, CCBA) is a plus.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>If you are interested, please send your updated CV to careers@alzonesoftware.com with the subject line \"Business Analyst\".</p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 04, Aug 2025</p>\n<p><strong>Company Address:</strong>\nAlzone Software (P) Ltd\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\nhttp://www.alzonesoftware.com</p>",
        "tags": [
            "3+ Years",
            "Business Analysis",
            "JIRA",
            "Stakeholder Management"
        ],
        "summary": "Alzone Software is looking for a Business Analyst to gather requirements, design solutions, and improve processes. The candidate will act as a bridge between business and technical teams."
    },
    {
        "job_title": "Solution Architect [5+ years]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22447",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Alzone Software (P) Ltd - Solution Architect</h2>\n<p><strong>Location:</strong> Trivandrum</p>\n<p><strong>Contact:</strong> careers@alzonesoftware.com</p>\n<p><strong>About the Role:</strong></p>\n<p>As a Solution Architect at Alzone Software, you will be a technical authority and expert in all projects, providing strategic guidance and ensuring the successful implementation of software solutions. You will design robust and scalable architectures, collaborate with stakeholders and development teams, drive the adoption of best practices, ensure architectural consistency, and mentor team members to deliver high-quality solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and communicate comprehensive solution architectures for complex software projects.</li>\n<li>Provide expert guidance on selecting appropriate technologies, frameworks, and tools for full stack development.</li>\n<li>Serve as a subject matter expert on full stack development, guiding and mentoring development teams.</li>\n<li>Conduct code reviews and offer technical guidance.</li>\n<li>Stay abreast of emerging trends and advancements in full stack development technologies.</li>\n<li>Conduct thorough evaluations of new technologies and tools.</li>\n<li>Collaborate with cross-functional teams to gather requirements and clarify technical needs.</li>\n<li>Communicate technical concepts effectively to both technical and non-technical stakeholders.</li>\n<li>Analyze and optimize the performance of software solutions.</li>\n<li>Implement best practices for security, reliability, and fault tolerance.</li>\n<li>Create and maintain technical documentation, including architectural diagrams and coding guidelines.</li>\n<li>Establish and enforce development standards and best practices.</li>\n<li>Drive innovation and continuous improvement within the development process.</li>\n<li>Participate in the organization's architectural community.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor's degree in computer science, software engineering, or a related field (Master's preferred).</li>\n<li>Proven experience as a Full Stack Developer or Solution Architect.</li>\n<li>Deep knowledge of full stack development technologies such as JavaScript, HTML/CSS, Node.js, React, Angular.</li>\n<li>Experience with back-end technologies, including databases (SQL and NoSQL), server-side frameworks (e.g., Express, Django, Laravel), and RESTful APIs.</li>\n<li>Strong understanding of cloud technologies such as AWS, Azure, or Google Cloud Platform.</li>\n<li>Expertise in software architectural patterns, design principles, and best practices.</li>\n<li>Familiarity with Agile methodologies and DevOps practices.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Effective communication and collaboration skills.</li>\n<li>Strong leadership and mentoring abilities.</li>\n<li>Continuous learning mindset.</li>\n</ul>\n<p><strong>Contact Information</strong>\nACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581</p>\n<p><strong>Website:</strong> http://www.alzonesoftware.com</p>\n<p><strong>To Apply:</strong>\nShare your resume with careers@alzonesoftware.com using the subject line: \"Application for Solution Architect\".</p>",
        "tags": [
            "5+ Years",
            "Full Stack Development",
            "Cloud Technologies",
            "JavaScript"
        ],
        "summary": "Alzone Software is seeking a Solution Architect to provide technical leadership and ensure successful software implementation. The role involves designing architectures, mentoring teams, and optimizing performance."
    },
    {
        "job_title": "SALES TEAM LEADER",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22446",
        "location": "Technopark",
        "closing_date": "05 Aug 2025",
        "job_description": "<h2>Sales Team Leader</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA , 695581\nwww.trainonexsolutions.in</p>\n<p><strong>Closing Date:</strong> 05, Aug 2025\n<strong>Job Published:</strong> 03, Aug 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are looking for a Sales Team Leader who is responsible for developing the sales team, coordinating sales operations, and implementing sales techniques that allow the business to meet and surpass its sales targets consistently.</p>\n<p>The role will involve mentoring members of their sales team, setting targets, assigning sales training, and building sales plans. It is mainly focused on B2B &amp; B2C sales operations.</p>\n<p><strong>Opportunity:</strong></p>\n<ul>\n<li>Work from office</li>\n<li>Immediate Joiners needed</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>1-2 years required</li>\n</ul>\n<p><strong>Basic Pay:</strong></p>\n<ul>\n<li>20000</li>\n</ul>\n<p><strong>Preferences:</strong></p>\n<ul>\n<li>Male and Female Candidates Preferred</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Developing sales strategies</li>\n<li>Motivate team members</li>\n<li>Managing a team</li>\n<li>Prepare sales reports</li>\n<li>Analyzing sales performance</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Sales Strategies",
            "Team Management",
            "B2B Sales"
        ],
        "summary": "We are seeking a Sales Team Leader to develop sales strategies, mentor the team, and coordinate sales operations, focusing on B2B and B2C sales. Immediate joiners are needed for this work-from-office role."
    },
    {
        "job_title": "Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22445",
        "location": "Technopark",
        "closing_date": "09 Aug 2025",
        "job_description": "<h2>Customer Success Executive - Walk-In Interview</h2>\n<p><strong>Way.Com India Pvt Ltd is hiring!</strong></p>\n<p><strong>Walk-In Details:</strong>\n- <strong>Date:</strong> August 9, 2025\n- <strong>Time:</strong> 10:00 AM to 12:30 PM\n- <strong>Location:</strong> Trivandrum</p>\n<p><strong>Role Overview:</strong></p>\n<p>As a Customer Support Executive, you’ll be responsible for providing high-quality service to our customers, answering their questions, solving problems, and assisting with any inquiries they may have. You’ll be the first point of contact and play a key role in delivering an outstanding customer experience.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Responding to customer inquiries via phone, email, chat, or social media.</li>\n<li>Troubleshooting customer issues and providing solutions in a timely manner.</li>\n<li>Managing customer requests, including product inquiries, order status, and returns.</li>\n<li>Recording and updating customer information and feedback in our CRM system.</li>\n<li>Escalating complex issues to the appropriate team or department.</li>\n<li>Assisting with tracking customer satisfaction metrics and identifying areas of improvement</li>\n<li>Ensuring all customer interactions are handled professionally and with care.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proven experience in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<p>At Way.com, we are passionate about delivering the best customer service. We're looking for dynamic Customer Support Executives to join our team. You’ll be the face of our company, assisting customers with their inquiries, guiding them through product offerings, and providing exceptional support to ensure a seamless experience.</p>\n<p>Candidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Walk-In Entry Pass</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\n- <a href=\"Click here to download the Mobile App for Android\">Click here to download the Mobile App for Android</a>\n- <a href=\"Click here to download the Mobile App for iOS\">Click here to download the Mobile App for iOS</a></p>\n<p><strong>Website URL:</strong>\n- <a href=\"vms.technopark.org\">vms.technopark.org</a>\n- <a href=\"vms.technopark.org\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong>\n- <strong>Email:</strong> careers@way.com\n- <strong>Address:</strong> Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>\n<p><strong>Apply here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a></p>",
        "tags": [
            "0-2 Years",
            "Customer Service",
            "Communication Skills",
            "CRM Systems"
        ],
        "summary": "Way.com is seeking a Customer Support Executive to deliver exceptional customer service and resolve inquiries. The role involves troubleshooting, managing requests, and ensuring customer satisfaction using CRM systems."
    },
    {
        "job_title": "Content Creator",
        "company": "Innure Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/22444",
        "location": "Technopark",
        "closing_date": "08 Aug 2025",
        "job_description": "<h2>Content Creator</h2>\n<p><strong>Innure Infotech (P) Ltd</strong>\nModule No-14, 4th Floor, Nila Building, Technopark Campus, Trivandrum, 695581\n<a href=\"http://www.innure.com\">http://www.innure.com</a></p>\n<p><strong>Closing Date:</strong> 08, Aug 2025\n<strong>Job Published:</strong> 03, Aug 2025\n<strong>Contact Email:</strong> info@scalevel.in</p>\n<p><strong>Brief Description</strong>\nScaleVel is a fast-growing edtech and digital solutions company based in Technopark, Kerala. They offer AI-powered learning programs, job-simulation internships, SaaS tools, and business growth solutions across India and the UAE.</p>\n<p>Now they’re looking for a creative content genius to join their core team and shape the voice, tone, and story behind their digital presence.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Write clear, compelling, and creative content for:<ul>\n<li>Social media (Instagram, LinkedIn, YouTube, etc.)</li>\n<li>Website landing pages, blog posts, and ad copies</li>\n<li>WhatsApp &amp; email campaigns</li>\n<li>Product descriptions and video scripts</li>\n</ul>\n</li>\n<li>Collaborate with designers and marketing teams to deliver high-converting campaigns.</li>\n<li>Research trends and competitor content to keep ScaleVel relevant and engaging.</li>\n<li>Proofread and edit content for grammar, clarity, tone, and brand consistency.</li>\n<li>Occasionally script AI chatbot or assistant conversations.</li>\n</ul>\n<p><strong>Who You Are</strong></p>\n<ul>\n<li>1–3 years of experience in content writing, copywriting, or digital marketing.</li>\n<li>Excellent written English (Malayalam/Hindi skills are a bonus).</li>\n<li>A creative thinker with a strong understanding of content strategy and storytelling.</li>\n<li>Comfortable working with tools like Canva, Google Docs, Notion, and scheduling platforms.</li>\n<li>Basic knowledge of SEO, hashtags, and social media best practices is preferred.</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Content Writing",
            "Social Media",
            "SEO"
        ],
        "summary": "ScaleVel is seeking a Content Creator to develop engaging content across various digital platforms. The ideal candidate will have 1-3 years of experience and a strong understanding of content strategy."
    },
    {
        "job_title": "Inside Sales Executive",
        "company": "Innure Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/22443",
        "location": "Technopark",
        "closing_date": "09 Aug 2025",
        "job_description": "<h2>Inside Sales Executive</h2>\n<p><strong>Innure Infotech (P) Ltd</strong>\nModule No-14, 4th Floor, Nila Building, Technopark Campus, Trivandrum, 695581\n<a href=\"http://www.innure.com\">http://www.innure.com</a></p>\n<p><strong>Closing Date:</strong> 09, Aug 2025\n<strong>Job Published:</strong> 03, Aug 2025\n<strong>Contact Email:</strong> info@scalevel.in</p>\n<p><strong>Brief Description:</strong>\nScaleVel Learning is a future-focused edtech and digital services company based in Technopark, Kerala. They offer job-simulation internships, AI-driven upskilling programs, and powerful SaaS products that help students, job seekers, and professionals gain real-world experience and skills. Their AI sales agent, LearnWorks™ platform, and personalized mentorship model have helped hundreds accelerate their careers.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Call, message, and follow up with leads generated via marketing campaigns, WhatsApp, and our website.</li>\n<li>Qualify prospects and guide them to the right program or solution.</li>\n<li>Maintain daily activity logs, sales pipeline, and progress reports in our CRM.</li>\n<li>Assist in demos, presentations, and offer walkthroughs when needed.</li>\n<li>Meet or exceed weekly and monthly sales targets.</li>\n</ul>\n<p><strong>What We're Looking For:</strong></p>\n<ul>\n<li>1–3 years of inside sales experience, preferably in edtech or SaaS.</li>\n<li>Excellent verbal and written communication in English and Malayalam.</li>\n<li>Strong listening, empathy, and objection-handling skills.</li>\n<li>Familiarity with tools like Zoho CRM, WhatsApp Business, Google Sheets, or similar.</li>\n<li>A self-starter who thrives in a target-driven environment.</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Inside Sales",
            "CRM",
            "EdTech",
            "Communication Skills"
        ],
        "summary": "ScaleVel Learning is seeking an Inside Sales Executive to manage leads and drive sales of their edtech solutions. The ideal candidate will have experience with CRM and strong communication skills."
    },
    {
        "job_title": "Telecaller cum Customer Support Executive",
        "company": "Techstas Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22442",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Techstas Info Solutions (P) Ltd - Telecaller cum Customer Support Executive</h2>\n<p><strong>Location:</strong> Module 9, -2 Floor, Thejaswini Building, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.techstas.com\">http://www.techstas.com</a>\n<strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 02, Aug 2025\n<strong>Contact Email:</strong> career@techstas.com</p>\n<h3>Brief Description</h3>\n<p>Techstas Info Solutions is seeking a proactive and customer-focused Telecaller cum Customer Support Executive. The ideal candidate will manage inbound and outbound calls, handle customer inquiries, and ensure excellent customer experience. This role involves lead generation and contributing to sales growth through effective communication.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Make outbound calls to potential customers and handle inbound queries effectively.</li>\n<li>Provide prompt and courteous customer support and issue resolution.</li>\n<li>Generate leads through phone calls and assist in converting them to customers.</li>\n<li>Understand customer requirements and suggest suitable products or services.</li>\n<li>Maintain detailed and accurate records of customer interactions in the CRM system.</li>\n<li>Coordinate with internal teams to ensure customer satisfaction and follow-ups.</li>\n<li>Achieve daily/weekly/monthly sales targets as assigned.</li>\n</ul>\n<h3>Preferred Skills/Requirements</h3>\n<ul>\n<li>Proficiency in Hindi and Tamil (spoken) is mandatory.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Customer-centric attitude and problem-solving approach.</li>\n<li>Ability to work under pressure in a fast-paced environment.</li>\n<li>Basic knowledge of CRM tools/software.</li>\n<li>Goal-oriented mindset with the ability to meet sales targets.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Prior experience in telecalling, customer support, or inside sales.</li>\n<li>Familiarity with using call center software or CRM systems.</li>\n<li>Ability to communicate in additional regional languages is an advantage.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Attractive salary package with incentives and bonuses.</li>\n<li>Opportunity to work in a supportive and collaborative environment.</li>\n<li>On-the-job training and development.</li>\n<li>Growth opportunities within the organization.</li>\n<li>Recognition for high performers.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume to career@techstas.com with the subject line: Application for Telecaller cum Customer Support Executive</p>",
        "tags": [
            "1+ Years",
            "Telecalling",
            "Customer Support",
            "CRM"
        ],
        "summary": "Techstas Info Solutions is hiring a Telecaller cum Customer Support Executive. The role involves managing calls, handling customer inquiries, lead generation and contributing to sales."
    },
    {
        "job_title": "Digital Marketing Specialist",
        "company": "Techstas Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22441",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Digital Marketing Specialist</h2>\n<p><strong>Techstas Info Solutions (P) Ltd</strong> is seeking a skilled and creative Digital Marketing Specialist to join our growing team. The ideal candidate is both analytical and imaginative, capable of crafting and executing digital campaigns that drive customer engagement, improve brand visibility, and generate measurable business growth.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, plan, and execute integrated digital marketing campaigns across channels like social media, email, SEO/SEM, and display advertising.</li>\n<li>Manage and optimize paid ad campaigns on platforms such as Google Ads, Facebook Ads, and LinkedIn Ads to drive ROI.</li>\n<li>Create engaging and original content for blogs, articles, email newsletters, landing pages, and social media.</li>\n<li>Track, analyze, and report on campaign performance using Google Analytics and other digital tools.</li>\n<li>Provide data-driven insights and strategies to improve performance and conversions.</li>\n<li>Work closely with the design, sales, and product teams to align marketing strategies with business objectives.</li>\n<li>Stay updated on the latest digital trends, tools, and best practices.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>3+ years of proven experience in digital marketing roles with hands-on campaign management.</li>\n<li>Strong knowledge of digital marketing platforms, including Google Ads, Facebook/Meta Ads, and email marketing tools.</li>\n<li>Proficiency in SEO, SEM, content marketing, and social media marketing.</li>\n<li>Excellent analytical and problem-solving skills to interpret data and optimize campaigns.</li>\n<li>Strong written and verbal communication skills and the ability to collaborate across teams.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Hands-on experience with tools like Google Analytics, SEMrush, Ahrefs, or HubSpot.</li>\n<li>Familiarity with CMS platforms (e.g., WordPress) and marketing automation tools.</li>\n<li>Relevant certifications such as Google Ads, HubSpot Inbound Marketing, etc.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Competitive salary and performance incentives</li>\n<li>Opportunity to work with a dynamic and tech-driven company</li>\n<li>Supportive and collaborative team environment</li>\n<li>Access to professional development and career growth programs</li>\n<li>Exposure to cutting-edge digital tools and marketing trends</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your updated resume and portfolio (if any) to career@techstas.com with the subject line: Application for Digital Marketing Specialist</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> career@techstas.com</li>\n<li><strong>Website:</strong> http://www.techstas.com</li>\n<li><strong>Address:</strong> Techstas Info Solutions (P) Ltd, Module 9, -2 Floor, Thejaswini Building, Technopark, Thiruvananthapuram, Kerala , 695581</li>\n<li><strong>Closing Date:</strong> 31, Aug 2025</li>\n<li><strong>Job Published:</strong> 02, Aug 2025</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Google Ads",
            "SEO/SEM",
            "Social Media Marketing"
        ],
        "summary": "Techstas is looking for a Digital Marketing Specialist to execute digital campaigns and drive customer engagement. The role requires expertise in digital marketing platforms, SEO/SEM, and analytics."
    },
    {
        "job_title": "Laravel API Developer",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22440",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Laravel API Developer</h2>\n<p><strong>Globcom Solutions (P) Ltd</strong>\nModule 2502, 5th floor, Yamuna Building\nTechnopark Phase -3, Thiruvananthapuram, 695583\n<a href=\"http://www.globcomsolution.com\">http://www.globcomsolution.com</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 02, Aug 2025\n<strong>Contact Email:</strong> <a href=\"mailto:rajesh@globcomsolution.com\">rajesh@globcomsolution.com</a></p>\n<h3>Role Overview:</h3>\n<p>We are looking for a skilled Laravel API Developer with 3 to 5 years of experience, who is passionate about backend development and has strong capabilities in handling API-driven projects. The ideal candidate should have hands-on experience working with mobile apps (Flutter or React) and be comfortable managing email delivery, debugging email suspension issues, and working in cloud-based environments like AWS or VPS.</p>\n<p>This role requires someone who is not only technically sound but also has the ability to lead and manage teams, communicate effectively, and contribute to a collaborative development environment using GitHub and other tools.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design and develop RESTful APIs using Laravel for mobile and web applications.</li>\n<li>Debug and manage email handling issues including suspension, spam triggers, and deliverability improvements.</li>\n<li>Collaborate with frontend/mobile teams (Flutter/React) to integrate backend services.</li>\n<li>Manage server environments including AWS Cloud and VPS-based hosting.</li>\n<li>Monitor, optimize, and scale backend systems for performance and security.</li>\n<li>Work with GitHub for version control, code collaboration, and CI/CD integration.</li>\n<li>Lead or coordinate a team of developers when necessary and ensure timely project delivery.</li>\n<li>Write clean, well-documented, and testable code following best practices.</li>\n<li>Maintain and improve existing APIs and backend infrastructure.</li>\n<li>Troubleshoot production issues, logs, and implement long-term fixes.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>3 to 5 years of hands-on experience in Laravel API development.</li>\n<li>Strong understanding of email systems (SMTP, Mailgun, SES, etc.) and debugging suspension or bounce issues.</li>\n<li>Experience working with Flutter or React-based mobile apps (integrating APIs, push notifications, etc.).</li>\n<li>Good knowledge of AWS services (EC2, S3, RDS, etc.) or VPS environments.</li>\n<li>Proficiency in Git/GitHub workflows and managing collaborative repositories.</li>\n<li>Excellent debugging, troubleshooting, and performance tuning skills.</li>\n<li>Strong understanding of RESTful APIs, authentication (JWT, OAuth), and database design (MySQL/PostgreSQL).</li>\n<li>Bonus: Experience with team management, task delegation, and agile workflows.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume and a brief cover letter to <a href=\"mailto:rajesh@globcomsolution.com\">rajesh@globcomsolution.com</a></p>\n<p><strong>Location:</strong> Technopark, TVM</p>",
        "tags": [
            "3-5 Years",
            "Laravel",
            "RESTful APIs",
            "AWS"
        ],
        "summary": "Globcom Solutions is seeking a Laravel API Developer to design and develop RESTful APIs and manage backend systems. The role involves collaborating with mobile teams and troubleshooting email issues."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22439",
        "location": "Technopark",
        "closing_date": "04 Aug 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong> is seeking a motivated and dynamic Telesales Executive to join our team.</p>\n<p><strong>Location:</strong> 1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA , 695581</p>\n<p><strong>Website:</strong> www.trainonexsolutions.in</p>\n<p><strong>Closing Date:</strong> 04, Aug 2025</p>\n<p><strong>Job Published:</strong> 02, Aug 2025</p>\n<p><strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Brief Description:</strong>\nYou will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li>Experience: 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Have fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\n- Customer interaction\n- Communication\n- Time management</p>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Communication",
            "Customer Interaction"
        ],
        "summary": "Join Trainonex Solutions as a Telesales Executive! Responsible for driving sales, nurturing customer relationships, and expanding the business through effective communication and lead qualification."
    },
    {
        "job_title": "Unity Developer",
        "company": "Technocil (P) Ltd",
        "url": "https://technopark.org/job-details/22438",
        "location": "Technopark",
        "closing_date": "16 Sep 2025",
        "job_description": "<h2>Unity Developer</h2>\n<p><strong>Technocil (P) Ltd</strong> is seeking a skilled and passionate Unity Developer to join our team. The ideal candidate will have experience in developing high-quality interactive applications, games, or simulations using Unity3D. You will work closely with designers, artists, and other developers to bring creative visions to life.</p>\n<p><strong>Contact:</strong> hr@technocil.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and optimize VR/AR applications using Unity and C#.</li>\n<li>Work with Meta Quest, HoloLens, WebXR, and other VR/AR platforms to create seamless user experiences.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>2+ years of experience in Unity development, focusing on VR/AR applications.</li>\n<li>Strong proficiency in C# and object-oriented programming.</li>\n<li>Hands-on experience with Meta Quest, HoloLens, and WebXR development.</li>\n<li>Expertise in VR SDKs (Oculus SDK, OpenXR, SteamVR) and AR SDKs (ARKit, ARCore, Vuforia).</li>\n<li>Experience in UI/UX design for VR/AR, including gesture-based and hand-tracking interactions.</li>\n<li>Strong understanding of 3D graphics, shaders, physics, and rendering optimization.</li>\n<li>Ability to integrate APIs, plugins, and third-party libraries into Unity applications.</li>\n</ul>\n<p><strong>Closing Date:</strong> 16, Sept 2025\n<strong>Job Published:</strong> 02, Aug 2025</p>\n<p>http://www.technocil.com\n2806 Module, 8th Floor, Yamuna, Phase -III, Technopark, 695583</p>",
        "tags": [
            "2+ Years",
            "Unity",
            "VR/AR",
            "C#"
        ],
        "summary": "We are looking for a Unity Developer to develop and optimize VR/AR applications. The candidate should have experience with Unity, C#, and VR/AR platforms."
    }
]