[
    {
        "job_title": "React JS Training Freshers Welcome",
        "company": "Relaxplzz Technologies",
        "url": "https://technopark.org/job-details/23044",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>React JS Training for Freshers</h2>\n<p><strong>RELAXPLZZ TECHNOLOGIES</strong> is offering a 100-day training program for freshers to gain hands-on experience with React JS. This is an excellent opportunity to learn and work on real-time projects with our development team.</p>\n<p><strong>Location:</strong> Technopark Phase I, Trivandrum\n<strong>Duration:</strong> 3 months</p>\n<p><strong>Who Can Apply:</strong> 2024 &amp; 2025 passed out or graduating students</p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor's or Master's degree in Computer Science, Software Engineering, Information Technology, or a related field.</li>\n<li>Basic knowledge of HTML, CSS, and JavaScript.</li>\n<li>Familiarity with React JS is a plus.</li>\n<li>Eagerness to learn and grow in web development.</li>\n<li>Strong analytical mindset to extract actionable insights from data.</li>\n<li>Excellent Team management and communication skills.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication skills and ability to work collaboratively in a team environment.</li>\n<li>Practical experience with React JS and modern web development tools.</li>\n<li>Mentorship and exposure to industry best practices.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your resume to hr@relaxplzz.com</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: hr@relaxplzz.com</li>\n<li>Address: RELAXPLZZ TECHNOLOGIES2G3B, -2, Thejaswini, Technopark phase I, Kazhakkoottam, Thiruvananthapuram, Kerala, 695581</li>\n<li>Website: https://relaxplzz.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 30, Aug 2025\n<strong>Job Published:</strong> 23, Aug 2025</p>",
        "tags": [
            "Freshers",
            "React JS",
            "HTML",
            "CSS"
        ],
        "summary": "RELAXPLZZ TECHNOLOGIES is offering a 100-day React JS training program for freshers. Gain hands-on experience with real-time projects and mentorship in Technopark, Trivandrum."
    },
    {
        "job_title": "Lead - Finance & Accounts",
        "company": "Experion Technologies (I) (P) Ltd",
        "url": "https://technopark.org/job-details/23042",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Lead - Finance &amp; Accounts</h2>\n<p><strong>Experion Technologies (I) (P) Ltd</strong>\n407, 4th Floor, Thejaswini, Technopark Campus,\nThiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.experionglobal.com\">http://www.experionglobal.com</a></p>\n<p><strong>Closing Date:</strong> 29, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> sandra.paul@experionglobal.com</p>\n<p><strong>Skills:</strong> Financial Expertise</p>\n<p><strong>Qualification:</strong> CA Intermediate</p>\n<p><strong>Total Experience:</strong> 5+ years\n<strong>Relevant Experience:</strong> 5+ years\n<strong>Work Location:</strong> Trivandrum/Kochi</p>\n<p><strong>Job Description / Duties and Responsibilities:</strong></p>\n<ul>\n<li>Assist in preparation of monthly MIS and financial statements.</li>\n<li>Assist in audits and book closure half yearly.</li>\n<li>Assist in preparation of data for filing Tax returns.</li>\n<li>Recording of expenses in the foreign subsidiaries.</li>\n<li>Monthly GST computation and return filing. Provide quarterly data to the foreign consultants to for filing GST / VAT returns of Group entities.</li>\n<li>Preparation of GST annual return &amp; reconciliation.</li>\n<li>Preparation and submission of GST refund application- addressing queries related to refund application.</li>\n<li>Monthly TDS Reconciliation and compilation (Non Salary).</li>\n<li>TDS Return Filing ( Quarterly- Non salary ).</li>\n<li>Support in meeting compliances with RBI/FEMA.</li>\n<li>Support to prepare data for the Monthly Stock Statement Submission with Bank.</li>\n<li>Verification and payment to vendors, updation of payment entries in books.</li>\n<li>Preparation and upkeep of Depreciation Schedule workings, prepaid expense tracking, passing appropriate entries in books.</li>\n<li>Coordination with Delivery Units / PMO to clarify queries related to MIS.</li>\n<li>Addressing other ad hoc requirements, reports as and when required.</li>\n<li>Adhere to the Information Security Management policies and procedures.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Financial Statements, Audits, Accounts, Taxation</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Financial Statements",
            "Audits",
            "Taxation"
        ],
        "summary": "Seeking a Lead in Finance & Accounts to assist with financial statement preparation, audits, and tax return filing. Requires 5+ years of experience and a CA Intermediate qualification."
    },
    {
        "job_title": "Senior SEO Analyst",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23041",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Senior SEO Analyst</h2>\n<p><strong>SRS Global Technologies (P) Ltd</strong>\n1 level Floor, Thejaswini Building, Technopark, Karyavattom PO, Thirivananthapuram, Kerala, 695581\nhttps://srsglobaltechnologies.com</p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> hr@srswebsolutions.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute comprehensive SEO strategies to drive qualified traffic, improve keyword rankings, and boost conversions.</li>\n<li>Perform on-page, off-page, and technical SEO audits with actionable recommendations.</li>\n<li>Conduct keyword research, competitor benchmarking, and SERP analysis to identify growth opportunities.</li>\n<li>Optimize large-scale content (blogs, news articles, press releases, and case studies) for search engines and user intent.</li>\n<li>Implement structured data/schema markup, optimize crawl budget, and resolve indexation issues.</li>\n<li>Manage local SEO for directory-style websites (Yelp-like platforms), including citation management, NAP consistency, and business listings optimization.</li>\n<li>Collaborate with editorial and product teams to ensure SEO best practices are integrated into content creation and publishing workflows.</li>\n<li>Plan and execute link acquisition strategies to improve domain authority.</li>\n<li>Manage and optimize paid search campaigns (Google Ads, Bing, LinkedIn Ads) as needed for performance marketing alignment.</li>\n<li>Drive App Store Optimization (ASO) strategies for mobile apps, including keyword optimization, metadata updates, A/B testing of creatives, and tracking app rankings.</li>\n<li>Monitor website analytics and search performance via Google Analytics, GA4, Google Search Console, SEMrush, Ahrefs, Screaming Frog and other SEO tools.</li>\n<li>Prepare monthly SEO performance dashboards and communicate insights to stakeholders.</li>\n<li>Collaborate with developers to ensure technical SEO requirements are implemented during website or app development.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>3–5 years of proven experience in SEO</li>\n<li>Hands-on experience with news/media websites (content-heavy SEO, index management, canonicalization).</li>\n<li>Knowledge of directory websites (local SEO, structured listings, reviews optimization) is a strong plus.</li>\n<li>Experience in App Store Optimization (ASO) for iOS and Android apps is an advantage.</li>\n<li>Strong technical SEO skills: site architecture, Core Web Vitals, mobile-first indexing, schema markup, log file analysis.</li>\n<li>Proficiency in SEO and analytics tools: Google Analytics, GA4, Search Console, SEMrush, Ahrefs, Moz, Screaming Frog, GTMetrix.</li>\n<li>Familiarity with CMS platforms like WordPress, HubSpot, Drupal, or equivalent.</li>\n<li>Knowledge of HTML, CSS, and JavaScript fundamentals for SEO troubleshooting.</li>\n<li>Strong analytical mindset with the ability to interpret data and provide insights.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "SEO",
            "Google Analytics",
            "App Store Optimization"
        ],
        "summary": "Seeking a Senior SEO Analyst to develop and execute SEO strategies, conduct audits, and optimize content. The role involves technical SEO, ASO, and managing analytics using tools like Google Analytics and SEMrush."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/23040",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p><strong>iBoson Innovations (P) Ltd</strong> is an AI-first product company specializing in cutting-edge technologies. We are looking for a highly skilled and proactive experienced Java Developer to join our dynamic team. We are building new product lines and are looking for passionate team members.</p>\n<p>As a Senior Java Developer, you will be responsible for designing, developing, and deploying scalable backend solutions and services using Java, Spring Boot, and Microservices architecture. You will collaborate closely with cross-functional teams to deliver high-quality software solutions while ensuring best practices in coding, testing, and deployment.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design, develop, and maintain Java-based applications</li>\n<li>Write clean, maintainable, and efficient code</li>\n<li>Participate in code reviews and mentor junior developers</li>\n<li>Collaborate with cross-functional teams to define and implement new features</li>\n<li>Troubleshoot and resolve complex technical issues</li>\n<li>Contribute to architectural decisions and technical documentation</li>\n<li>Ensure application performance, quality, and responsiveness</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>5+ years of professional Java development experience</li>\n<li>Strong knowledge of Spring Framework (Spring Boot, Spring MVC, Spring Data)</li>\n<li>Experience with RESTful API design and implementation</li>\n<li>Proficiency in database technologies (SQL, NoSQL)</li>\n<li>Experience with build tools like Maven or Gradle</li>\n<li>Understanding of microservices architecture</li>\n<li>Knowledge of containerization (Docker, Kubernetes)</li>\n<li>Experience with version control systems (Git)</li>\n<li>Experience with reactive programming (Project Reactor, RxJava)</li>\n<li>Knowledge of cloud platforms (AWS, Azure, GCP)</li>\n<li>Experience with messaging systems (Kafka, RabbitMQ)</li>\n<li>Familiarity with CI/CD pipelines</li>\n<li>Understanding of security best practices</li>\n<li>Experience with testing frameworks (JUnit, Mockito)</li>\n<li>Bachelor's degree in Computer Science, Engineering, or related field (or equivalent practical experience)</li>\n</ul>\n<p>If you are someone who takes full ownership of responsibilities, embraces challenges, and delivers results in a fast-paced, time-oriented environment without pressure, we’d love to hear from you!</p>\n<p><strong>Contact Information</strong></p>\n<p>Apply now by submitting your resume and portfolio to career@ibosoninnov.com.</p>\n<p><strong>Company Information</strong>\niBoson Innovations (P) Ltd\nACE 1, 3rd Floor, CDAC Building,\nTechnopark Campus, Kazhakootam\nThiruvananthapuram, 695581\nhttp://www.iboson.io</p>\n<p>Closing Date: 29, Aug 2025\nJob Published: 22, Aug 2025</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Microservices"
        ],
        "summary": "iBoson Innovations is seeking a Senior Java Developer to design and develop scalable backend solutions. The role involves using Java, Spring Boot, and Microservices architecture within cross-functional teams."
    },
    {
        "job_title": "Senior QA Manager",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/23039",
        "location": "Technopark",
        "closing_date": "01 Sep 2025",
        "job_description": "<h2>Senior QA Manager</h2>\n<p><strong>Picky Assist Pvt Ltd</strong> (Kerala Startup Mission)\nT-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<p><strong>Closing Date:</strong> 01, Sept 2025\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> careers@pickyassist.com</p>\n<h3>Role Summary</h3>\n<p>As QA Manager, you will play a pivotal role in ensuring the quality and performance of our software products. This position is ideal for someone with a strong QA background who is ready to step into a leadership role. You’ll be responsible for defining QA strategies, mentoring QA team members, implementing automation, and collaborating closely with cross-functional teams.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead the QA team (manual and automation testers) and oversee day-to-day testing activities.</li>\n<li>Define and implement QA processes, test strategies, and test plans for product features and releases.</li>\n<li>Collaborate with Product, Development, and DevOps teams to ensure high-quality delivery.</li>\n<li>Review requirements and provide test estimates and feedback on testability.</li>\n<li>Drive test automation initiatives and identify opportunities to improve testing efficiency.</li>\n<li>Monitor, document, and communicate testing progress, quality metrics, and risk assessments.</li>\n<li>Conduct root cause analysis of production issues and implement preventive measures.</li>\n<li>Foster a culture of continuous learning and improvement within the QA team.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related discipline.</li>\n<li>3+ years of experience in software quality assurance.</li>\n<li>Minimum 1 year experience leading QA efforts or managing a small QA team.</li>\n<li>Hands-on experience in both manual and automated testing.</li>\n<li>Knowledge of test automation tools like Selenium, Cypress, or similar.</li>\n<li>Experience with bug tracking and test management tools (e.g., Jira, TestRail).</li>\n<li>Familiarity with Agile/Scrum development processes.</li>\n<li>Strong communication, collaboration, and problem-solving skills.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary and performance incentives</li>\n<li>Opportunity to lead and grow your own QA team</li>\n<li>Flexible work hours and hybrid/remote work options</li>\n<li>Health benefits and wellness initiatives</li>\n<li>A fast-paced, collaborative, and supportive work culture</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your CV to careers@pickyassist.com or WhatsApp <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in a product-based or SaaS company environment.</li>\n<li>Skilled in performing Manual Testing as well as Security Testing</li>\n<li>Exposure to API testing tools like Postman or RestAssured.</li>\n<li>Familiarity with CI/CD pipelines (e.g., Jenkins, GitHub Actions).</li>\n<li>Knowledge of performance testing tools (e.g., JMeter) is a plus.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Test Automation",
            "Selenium",
            "Jira"
        ],
        "summary": "We are seeking a QA Manager to lead our QA team, define QA strategies, and implement automation. The ideal candidate will ensure high-quality software delivery through collaboration and continuous improvement."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/23038",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Prayan Animation Studio (P) Ltd</strong> is seeking a dynamic and results-driven Business Development Executive to join our team. This role offers a fantastic opportunity to contribute to the expansion of a leading animation studio.</p>\n<p><strong>Location:</strong>\nE-12, Tejaswini-1, Technopark,\nTrivandrum, Kerala\nIndia, 695 581\n<a href=\"http://www.prayananimation.com\">http://www.prayananimation.com</a></p>\n<p><strong>Contact Email:</strong> jobs@prayananimation.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Research and identify potential clients in industries such as entertainment, advertising, education, gaming, and others that require animation and creative services.</li>\n<li>Use a variety of strategies to attract new clients, including cold calling, networking, attending industry events, and leveraging social media.</li>\n<li>Build and maintain strong, long-lasting relationships with clients.</li>\n<li>Serve as the main point of contact for client communications, addressing inquiries and ensuring timely responses to client needs.</li>\n<li>Collaborate with the creative and production teams to ensure client requirements are met with the highest standards.</li>\n<li>Develop and maintain a pipeline of potential leads and clients.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li><strong>Education:</strong> MBA in Marketing or a related field</li>\n<li><strong>Experience:</strong> 2-3 years of experience in business development, client management, preferably within the animation, media, or related industries.</li>\n<li>Strong understanding of client relationship management.</li>\n<li>Excellent communication skills, both written and verbal.</li>\n<li>Proficient in Microsoft Excel and CRM tools.</li>\n<li>Ability to work independently and in a team environment.</li>\n<li>Self-motivated, results-driven, and passionate about delivering exceptional client service.</li>\n<li>Strong problem-solving skills and the ability to think creatively.</li>\n</ul>\n<p><strong>Job Type:</strong> Full-time</p>\n<p><strong>Schedule:</strong> Day shift</p>\n<p><strong>Location Requirement:</strong>\nTrivandrum, Kerala: Reliably commute or planning to relocate before starting work.</p>\n<p><strong>Expected Start Date:</strong> Immediate Joining.</p>\n<p><strong>How to Apply:</strong></p>\n<p>To apply, please submit your resume and a link to your online portfolio highlighting your best work to jobs@prayananimation.com. Please put the mail subject as Resume – \"Business Development Executive\".</p>\n<p><strong>Closing Date:</strong> 29, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>",
        "tags": [
            "2-3 Years",
            "Business Development",
            "Client Relationship Management",
            "CRM Tools"
        ],
        "summary": "Prayan Animation Studio is hiring a Business Development Executive. The role involves client acquisition, relationship management, and driving business growth within the animation industry."
    },
    {
        "job_title": "Jr. System Administrator",
        "company": "Mobatia Technology (P) Ltd",
        "url": "https://technopark.org/job-details/23037",
        "location": "Technopark",
        "closing_date": "24 Aug 2025",
        "job_description": "<h2>Junior System Administrator</h2>\n<p><strong>Mobatia Technology (P) Ltd</strong></p>\n<p>1F, Carnival Technopark, Technopark, Trivandrum, Kerala, India, 695581</p>\n<p><a href=\"http://www.mobatia.com\">http://www.mobatia.com</a></p>\n<p><strong>Closing Date:</strong> 24, Aug 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Contact Email:</strong> jobs@moabtia.in</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are looking for a Junior System Administrator with 0 to 1 year of experience, preferably someone who can join immediately. The ideal candidate should have hands-on experience in basic networking, system monitoring, and a foundational understanding of DevOps practices.</p>\n<p>Candidates residing in Trivandrum are preferred.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Good understanding of networking fundamentals (DNS, DHCP, LAN/WAN, IP configuration, etc.)</li>\n<li>Experience with Linux/Unix system administration</li>\n<li>Basic knowledge of DevOps tools such as Git, Docker, CI/CD pipelines</li>\n<li>Familiarity with system monitoring tools and basic scripting</li>\n<li>Ability to troubleshoot hardware, software, and network issues</li>\n<li>Knowledge of cloud platforms (AWS/Azure/GCP) is a plus</li>\n<li>Strong communication and documentation skills</li>\n<li>Automate routine tasks using Shell, Bash, or Python scripting</li>\n<li>Willingness to learn and grow in a fast-paced environment</li>\n<li>Perform system upgrades, patch management, and security hardening</li>\n</ul>",
        "tags": [
            "0-1 Year",
            "Linux/Unix",
            "Networking",
            "DevOps"
        ],
        "summary": "Mobatia Technology is seeking a Junior System Administrator to manage systems and networks. The role involves troubleshooting, automation, and learning new technologies in a fast-paced setting."
    },
    {
        "job_title": "Google Ads Specialist (  1 year experience * )",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23036",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Google Ads Specialist - Walk-In</h2>\n<p><strong>HoneyKode Technologies (P) Ltd</strong>\nD-2 Module, 6th floor, Bhavani Building, Technopark Campus, 695581\nhttp://www.honeykode.com</p>\n<p><strong>Walk-In Date:</strong> 29, Aug 2025 - 29, Aug 2025\n<strong>Time:</strong> 11:30:00 to 15:04:00\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> nandu@honeykode.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Plan, create, and manage Google Ads campaigns (Search, Display, Video, Shopping).</li>\n<li>Conduct keyword research and competitor analysis to improve campaign performance.</li>\n<li>Monitor campaign budgets, performance metrics, and optimize bids accordingly.</li>\n<li>Write compelling ad copy and test different creatives.</li>\n<li>Provide regular performance reports with actionable insights.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 1 year of experience in Google Ads campaign management.</li>\n<li>Strong understanding of PPC concepts, keyword targeting, and audience segmentation.</li>\n<li>Knowledge of Google Analytics and conversion tracking.</li>\n<li>Ability to analyze data and make performance-based decisions.</li>\n<li>Google Ads Certification (preferred but not mandatory).</li>\n</ul>\n<p>We are looking for a Google Ads Specialist with at least 1 year of hands-on experience in managing and optimizing ad campaigns. The ideal candidate should be results-driven, analytical, and able to create strategies that maximize ROI.</p>\n<p><strong>Walk In Venue:</strong></p>\n<p>HoneyKode Technologies Pvt Ltd\n6th Floor | Bhavani | Technopark | Trivandrum\nDate: 29/08/2025 Time: 11am Contact Person: Max - 9746450771</p>\n<p><strong>Documents Required:</strong></p>\n<ul>\n<li>Updated Resume</li>\n<li>Government-issued ID (Aadhaar/PAN/Driving License)</li>\n<li>Educational Certificates (original &amp; photocopies)</li>\n<li>Experience Certificates (if any)</li>\n</ul>\n<p><strong>Walk-In Entry Pass:</strong></p>\n<p>Candidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus. Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p>Mobile App:\nClick here to download the Mobile App for Android\nClick here to download the Mobile App for iOS</p>\n<p>Website URL:\nvms.technopark.org\nClick here for the User Manual</p>\n<p>Note: Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "1+ Years",
            "Google Ads",
            "PPC",
            "Google Analytics"
        ],
        "summary": "HoneyKode Technologies is holding a walk-in interview for a Google Ads Specialist. Candidates should have experience managing Google Ads campaigns and be able to maximize ROI."
    },
    {
        "job_title": "Senior Software Engineer- React.js",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/23035",
        "location": "Technopark",
        "closing_date": "27 Aug 2025",
        "job_description": "<h2>Senior Software Engineer - React.js</h2>\n<p><strong>Lean Transitions Solutions (LTS)</strong> is seeking a skilled React.js Engineer to join our dynamic development team. LTS, headquartered in the United Kingdom, is an ISO 9001:2015 certified company that advocates Industry 4.0.</p>\n<p>We deliver Lean Industry 4.0 software solutions and Leadership 4.0 solutions for world-class organizations across the globe, including Fortune 500 companies. Our global locations include India, Germany, Poland, the United States, UAE, Jordan, and Mexico.</p>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for a React.js Engineer with <strong>2-5 years of experience</strong>. You will be responsible for building and optimizing user-facing applications while collaborating with backend developers, designers, and other stakeholders.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, optimise, and maintain scalable React.js applications.</li>\n<li>Work with Next.js for server-side rendering (SSR), static site generation (SSG), and API routes.</li>\n<li>Implement state management solutions using Redux, Zustand, or Context API.</li>\n<li>Ensure the performance, quality, and responsiveness of applications.</li>\n<li>Integrate RESTful and GraphQL APIs into React applications.</li>\n<li>Utilise modern UI frameworks like Tailwind CSS, Material-UI (MUI), ShadCN UI, and Chakra UI for responsive design.</li>\n<li>Write reusable components and maintainable code with best practices.</li>\n<li>Collaborate with backend teams to define API requirements and optimise frontend-backend communication.</li>\n<li>Work with build tools like Webpack, Vite, and Babel for application bundling and optimisation.</li>\n<li>Implement authentication and authorisation using JWT, OAuth, Firebase, or NextAuth.js.</li>\n<li>Conduct code reviews, write unit tests (Jest, React Testing Library), and ensure high code quality.</li>\n<li>Stay up to date with the latest trends in React ecosystem and frontend development.</li>\n<li>Troubleshoot, debug, and enhance existing code to improve application performance.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong proficiency in JavaScript (ES6+), TypeScript.</li>\n<li>Expertise in React.js and Next.js.</li>\n<li>Experience with state management libraries: Redux (Redux Toolkit), Zustand, Context API.</li>\n<li>Familiarity with CSS frameworks: Tailwind CSS, Material-UI (MUI), Chakra UI.</li>\n<li>Experience integrating APIs (REST, GraphQL).</li>\n<li>Knowledge of authentication and authorisation (OAuth, Firebase, NextAuth.js).</li>\n<li>Proficiency in build tools like Webpack, Vite, Babel.</li>\n<li>Testing experience with Jest, React Testing Library.</li>\n<li>Version control using Git and GitHub/GitLab.</li>\n<li>Understanding of performance optimization and debugging in React applications.</li>\n</ul>\n<p><strong>Good to Have:</strong></p>\n<ul>\n<li>Experience with serverless functions (AWS, Vercel, Netlify).</li>\n<li>Familiarity with CI/CD pipelines for automated deployments.</li>\n<li>Basic knowledge of Node.js and backend integration.</li>\n<li>Hands-on experience with React Query or SWR for data fetching.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line “Senior Software Engineer-React.js” and include the following information in the email content:</p>\n<ul>\n<li>Current CTC:</li>\n<li>Expected CTC:</li>\n<li>Notice Period:</li>\n<li>Current Location:</li>\n<li>Total Relevant Experience:</li>\n<li>Willingness to work at office:</li>\n</ul>\n<p><strong>Address:</strong>\nLean Transition Solutions\nBasement Floor, Periyar Building, Technopark Phase -1\nTrivandrum, 695581\nhttp://www.LeanTransitionSolutions.com</p>\n<p><strong>Closing Date:</strong> 27, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>",
        "tags": [
            "2-5 Years",
            "React.js",
            "Next.js",
            "JavaScript",
            "Redux"
        ],
        "summary": "Lean Transition Solutions is hiring a Senior Software Engineer with React.js experience. The role involves developing user-facing applications and collaborating with cross-functional teams to deliver high-quality solutions."
    },
    {
        "job_title": "Senior Software Developer- NodeJS",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/23034",
        "location": "Technopark",
        "closing_date": "27 Aug 2025",
        "job_description": "<h2>Senior Software Developer - NodeJS</h2>\n<p><strong>Lean Transitions Solutions (LTS)</strong></p>\n<p>Lean Transitions Solutions Ltd (LTS), founded over a decade ago with headquarters in the United Kingdom, is an ISO 9001:2015 certified company that advocates Industry 4.0. LTS delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions for various world-class organizations, including Fortune 500 companies, with global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico. LTS prides itself on a company culture nurturing core values – Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<p><strong>Address:</strong> Lean Transition Solutions, Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Website:</strong> http://www.LeanTransitionSolutions.com</p>\n<p><strong>About the Role:</strong></p>\n<p>We are seeking a talented Backend Node.js Engineer with 2-5 years of experience and a strong background in NestJS. The ideal candidate will be a hands-on developer responsible for designing, developing, and deploying robust, scalable, and secure server-side applications. You will work closely with product managers, designers, and other engineers to build our core services and APIs.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>API Development:</strong> Design, build, and maintain high-performance RESTful APIs using Node.js and the NestJS framework.</li>\n<li><strong>Database Management:</strong> Work with relational and NoSQL databases, including PostgreSQL, MySQL, and MongoDB, to design schemas, optimize queries, and ensure data integrity.</li>\n<li><strong>Server-Side Logic:</strong> Develop and implement efficient server-side logic and business processes.</li>\n<li><strong>System Integration:</strong> Integrate applications with third-party services and APIs.</li>\n<li><strong>Testing:</strong> Write and maintain unit, integration, and end-to-end tests to ensure code quality and reliability.</li>\n<li><strong>Deployment:</strong> Assist with application deployment, monitoring, and troubleshooting in production environments.</li>\n<li><strong>Collaboration:</strong> Work effectively within an Agile team, participating in stand-ups, sprint planning, and code reviews.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Experience:</strong> 2-5 years of professional experience in backend development.</li>\n<li><strong>Node.js &amp; NestJS:</strong> Proven experience building applications with Node.js and a solid understanding of the NestJS framework.</li>\n<li><strong>Databases:</strong> Hands-on experience with at least two of the following databases: PostgreSQL, MySQL, and MongoDB.</li>\n<li><strong>Version Control:</strong> Strong proficiency with Git and collaborative workflows.</li>\n<li><strong>Problem-Solving:</strong> Excellent analytical and problem-solving skills with a keen eye for detail.</li>\n<li><strong>Communication:</strong> Strong verbal and written communication skills.</li>\n<li><strong>Team Player:</strong> Ability to work collaboratively in a fast-paced, team-oriented environment.</li>\n</ul>\n<p><strong>Additional Skills (Preferable):</strong></p>\n<ul>\n<li>Experience with deployment platforms like Vercel, AWS, or GCP.</li>\n<li>Knowledge of containerization technologies (e.g., Docker, Kubernetes).</li>\n<li>Experience with GraphQL.</li>\n<li>Familiarity with CI/CD pipelines.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line “Senior Software Developer- NodeJS” and include the following information in the email content:</p>\n<ul>\n<li>Current CTC:</li>\n<li>Expected CTC:</li>\n<li>Notice Period:</li>\n<li>Current Location:</li>\n<li>Total Relevant Experience:</li>\n<li>Willingness to work at office:</li>\n</ul>\n<p><strong>Closing Date:</strong> 27, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>",
        "tags": [
            "2-5 Years",
            "Node.js",
            "NestJS",
            "Databases"
        ],
        "summary": "Lean Transition Solutions is hiring a Senior Software Developer - NodeJS to design, develop, and deploy server-side applications. The role requires 2-5 years of experience with Node.js, NestJS, and databases."
    },
    {
        "job_title": "Developer – Full Stack",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23033",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Full Stack Developer to lead the technical direction of an agile team. The ideal candidate will have a strong background in both front-end and back-end development, with a focus on modern, scalable architectures.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the technical direction of a full stack agile team, providing mentoring, guidance, and senior-level support across the SDLC.</li>\n<li>Design and implement modern, scalable architectures that span multiple microservices and domains.</li>\n<li>Drive best practices in agile engineering, including testing, code quality, observability, and continuous delivery.</li>\n<li>Work collaboratively with the Product Manager and stakeholders to translate business needs into technical solutions that deliver value.</li>\n<li>Champion architectural evolution toward a modular, API-driven ecosystem, supporting growth and innovation.</li>\n<li>Collaborate with Engineering Managers and Tech Leads to align on technical approaches and ensure reusability and scalability across the platform.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Must-Have:</strong></p>\n<ul>\n<li>Strong hands-on experience with Vue.js, React, or AngularJS for front-end development</li>\n<li>Deep knowledge of JavaScript/ECMAScript and CSS</li>\n<li>Proficiency with unit and integration testing using Vitest, Jest, Enzyme, or React Testing Library</li>\n<li>Backend experience in PHP using Laravel or Symfony</li>\n<li>Demonstrated experience building new distributed architectures across multiple services or microservices</li>\n<li>Solid grasp of architectural patterns like Clean Architecture, SOLID, DDD, and CQRS</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul>\n<li>Backend development with NestJS and Node.js, especially in microservice-based environments</li>\n<li>Experience with Nuxt.js and TypeScript</li>\n<li>Proficient with containerisation tools (Docker, Kubernetes)</li>\n<li>Familiar with AWS services such as Lambda, SQS, SNS</li>\n<li>Exposure to CI/CD tooling such as GitHub Actions, NuGet, NPM</li>\n<li>Experience with NoSQL databases and Web Analytics platforms</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>CSS3 styling frameworks (SASS/LESS) and HTML5</li>\n<li>Contributions to open-source projects or active involvement in the software community</li>\n<li>Prior experience leading modernisation or architecture transition projects</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please Note:</strong> Reflections Info Systems never seeks payment for job opportunities. All communications are through the official website or LinkedIn, and employment-related emails are sent via the official HR email address. Contact careers@reflectionsinfos.com for any clarification/alerts.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "7+ Years",
            "Vue.js",
            "React",
            "Laravel"
        ],
        "summary": "Reflections Info Systems is looking for a Full Stack Developer to lead a technical agile team. The candidate will design scalable architectures, drive best practices, and translate business needs into solutions."
    },
    {
        "job_title": "SAP BW Consultant",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23032",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>SAP BW Consultant</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking an experienced SAP BW Consultant to join our team. </p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 29, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with <strong>8+ years</strong> of experience for this role.</p>\n<h3>Job Description</h3>\n<p>We are seeking an experienced SAP BW Consultant with a strong background in ABAP development, ECC extractors, and SAP HANA. The ideal candidate will have experience in designing, developing, and implementing SAP BW solutions and BI reporting, along with a sound understanding of data warehousing concepts and dimensional modelling.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Understand existing design and implementation BW data models (InfoProviders, DSO/ADSOs, CompositeProviders, MultiProviders, InfoCubes)</li>\n<li>Document BW transformation rules, BEX formulas, and maintain documentation</li>\n<li>Work with standard and custom ECC extractors (e.g., extractors 2LIS<em>, 0FI</em>, 0CO*).</li>\n<li>Debug and troubleshoot data extraction and load issues.</li>\n<li>Document ABAP routines in BW transformations</li>\n</ul>\n<h3>Certifications:</h3>\n<ul>\n<li>SAP certification or relevant SAP certifications are desirable but not mandatory.</li>\n</ul>\n<h3>Preferred Skills/Primary Skills:</h3>\n<ul>\n<li><strong>7+ years</strong> of hands-on SAP BW development and support experience.</li>\n<li>Proficiency in SAP ABAP skills</li>\n<li>Proven experience with ECC extractors (standard &amp; custom) across SD, MM, FI, CO modules.</li>\n<li>Strong understanding of SAP data dictionary objects, modules, and integration with other SAP modules.</li>\n<li>Strong knowledge of data extraction, transformation, and loading (ETL) processes.</li>\n<li>Experience with Process Chain, scheduling, and monitoring</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Good analytical and problem-solving skills, with attention to detail.</li>\n<li>Effective communication and interpersonal skills to collaborate with cross-functional teams.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job opportunities. Be cautious of fraudulent job offers. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            "SAP BW",
            "ABAP",
            "ECC Extractors"
        ],
        "summary": "Reflections Info Systems is looking for an SAP BW Consultant with 8+ years of experience. The role involves designing, developing, and implementing SAP BW solutions and BI reporting."
    },
    {
        "job_title": "Presales Specialist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23031",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Presales Specialist</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a Presales Specialist with <strong>5 to 8 years</strong> of experience in IT presales. The ideal candidate will possess excellent communication skills, experience in writing proposals for IT organizations, organizing ideas, and coordinating with sales and practice teams. A basic understanding of technology to comprehend technical solutions is essential, along with proficiency in both spoken and written English.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage the complete Bid Management Process, collaborating with the team.</li>\n<li>Write Proposals/Capability decks end-to-end.</li>\n<li>Deliver presentations and demonstrations to prospective and current clients.</li>\n<li>Liaise with product/service development teams to gain in-depth knowledge and relate it to customers, providing feedback on user behavior and potential changes.</li>\n<li>Help the sales team reach targets.</li>\n<li>Conduct industry research, including competitor and market research.</li>\n<li>Consider new markets or clients based on product/service knowledge and user understanding.</li>\n<li>Hold kick-off and debrief meetings.</li>\n<li>Act as a point of contact for prospects.</li>\n<li>Provide Marketing Support by creating Case Studies, White Papers, etc.</li>\n<li>Prepare estimations based on previous examples.</li>\n<li>Utilize Basic Business Analysis experience to prepare documents like BRD.</li>\n<li>Apply Basic Technical knowledge to understand RFP/Requirements and suggest the best technology choices.</li>\n<li>Facilitate partner connect and collaboration.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Ability to write quality proposals.</li>\n<li>Leadership and communication skills.</li>\n<li>Presentation skills.</li>\n<li>Interest in and understanding of the IT industry.</li>\n<li>Research skills to stay updated on industry developments.</li>\n<li>Influencing and negotiation skills.</li>\n<li>Aptitude for time management and organization.</li>\n<li>Problem-solving ability.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Basic Technical Knowledge and awareness of new trends.</li>\n<li>Experience working in standard CRM.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>Reflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers. Contact careers@reflectionsinfos.com for any clarifications.</p>\n<p><strong>Address:</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581</p>\n<p><strong>Website:</strong>\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "5-8 Years",
            "Proposals",
            "Bid Management",
            "CRM"
        ],
        "summary": "Reflections Info Systems is hiring a Presales Specialist to manage bids, create proposals, and present solutions to clients. The role requires experience in IT presales and excellent communication skills."
    },
    {
        "job_title": "Senior SQA",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23030",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Senior SQA</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is looking for a Senior Software Quality Assurance (SQA) professional with 5+ years of experience and a proven track record in software quality assurance, process improvement, and compliance audits.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Guide and support project and support teams in adhering to organizational quality and infosec processes, policies, and best practices.</li>\n<li>Conduct periodic audits and reviews, including Internal Audits, SDLC work product reviews, and Configuration Audits to ensure compliance with defined processes.</li>\n<li>Track and follow up on non-conformities identified during audits and reviews, ensuring timely closure and corrective action.</li>\n<li>Facilitate root cause analysis for process gaps, defects, or audit findings, and collaborate with teams to identify and implement preventive and corrective measures.</li>\n<li>Collect, validate, and analyze quality and process metrics across projects and departments, and initiate process improvements.</li>\n<li>Drive quality initiatives and organization-wide process improvement programs.</li>\n<li>Assist teams in identifying, documenting, and tracking project-level risks and issues, ensuring they are reviewed and managed appropriately.</li>\n<li>Actively participate in key project meetings, including initiation, retrospectives, risk/issue reviews, and closure meetings.</li>\n<li>Support awareness and training initiatives, including sessions on quality management systems, information security, and compliance standards to build organizational capability and compliance culture.</li>\n</ul>\n<p><strong>Certifications (Preferred):</strong></p>\n<ul>\n<li>Internal auditor certified (QMS/ISMS)</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul>\n<li>Hands-on experience in conducting Internal Quality Audits (IQA), SDLC Work Product Reviews, and Configuration Management (CM) Audits</li>\n<li>Knowledge of Quality and Security standards such as ISO 9001, ISO 27001</li>\n<li>Skilled in quality analysis techniques like Fishbone (Ishikawa) Diagrams, and Pareto Analysis</li>\n<li>Good understanding of Agile, Waterfall, and Hybrid SDLC methodologies</li>\n<li>Proficient in collecting, validating, analyzing, and reporting quality and performance metrics</li>\n<li>Experience in conducting Root Cause Analysis (RCA) and driving Corrective and Preventive Actions (CAPA)</li>\n<li>Ability to define, standardize, and continuously improve organizational processes, templates, and guidelines</li>\n<li>Good Team player, Interpersonal and Problem-solving skills</li>\n<li>Attention to detail and presentation skills</li>\n<li>Working knowledge in tools - GitHub, JIRA, Redmine, Trello, Basecamp etc.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Note:</strong> Reflections Info Systems does not seek payment for job opportunities. Contact careers@reflectionsinfos.com for any clarification.</p>",
        "tags": [
            "5+ Years",
            "ISO 9001",
            "Root Cause Analysis",
            "Internal Quality Audits"
        ],
        "summary": "Seeking a Senior SQA to ensure quality standards, conduct audits, and drive process improvements. Requires 5+ years experience in software quality assurance and compliance."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23029",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 29, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p>We are looking for candidates with 14+ years of experience for the Delivery Manager role.</p>\n<p><strong>Responsibilities:</strong></p>\n<p><strong>Project Delivery Management:</strong></p>\n<ul>\n<li>Oversee the planning, execution, and delivery of multiple technical projects.</li>\n<li>Manage project scope, timelines, budgets, risks, and quality.</li>\n<li>Ensure adherence to Agile/Waterfall methodologies as per project requirements.</li>\n</ul>\n<p><strong>Team Leadership:</strong></p>\n<ul>\n<li>Lead and mentor cross-functional technical teams, fostering collaboration and innovation.</li>\n<li>Conduct regular performance reviews and provide growth opportunities for team members.</li>\n</ul>\n<p><strong>Stakeholder Engagement:</strong></p>\n<ul>\n<li>Act as a bridge between technical teams, business stakeholders, and clients.</li>\n<li>Communicate project status, risks, and solutions effectively to all stakeholders.</li>\n</ul>\n<p><strong>Technical Expertise:</strong></p>\n<ul>\n<li>Collaborate with architects and engineers to define technical solutions.</li>\n<li>Provide input on architecture, design, and implementation strategies.</li>\n</ul>\n<p><strong>Process Improvement:</strong></p>\n<ul>\n<li>Identify opportunities to improve project delivery processes and tools.</li>\n<li>Implement best practices in software development and delivery.</li>\n</ul>\n<p><strong>Risk and Issue Management:</strong></p>\n<ul>\n<li>Proactively identify project risks and develop mitigation strategies.</li>\n<li>Resolve technical and operational challenges in a timely manner.</li>\n</ul>\n<p><strong>Customer Focus:</strong></p>\n<ul>\n<li>Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li>14 years of experience in technology delivery roles, including hands-on development and leadership responsibilities.</li>\n<li>Proven experience in delivering large-scale, complex projects with diverse teams.</li>\n<li>Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.</li>\n<li>Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</li>\n<li>Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.</li>\n<li>Certification such as PMP, CSM, or equivalent is an advantage.</li>\n<li>Excellent team leadership, people management, and conflict resolution skills.</li>\n<li>Strong communication, presentation, and negotiation abilities.</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please Note:</strong> Reflections Info Systems does not seek payment for job opportunities. Contact is only made through the official website or LinkedIn, and all employment-related emails are sent via the official HR email ID. For any clarification/alerts, contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "14+ Years",
            "Agile",
            "Cloud Technologies",
            "Project Management"
        ],
        "summary": "Seeking a Delivery Manager to oversee technical project delivery and lead cross-functional teams. Requires 14+ years experience, strong leadership, and expertise in Agile and cloud technologies."
    },
    {
        "job_title": "Senior .Net Lead",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23028",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Senior .Net Lead</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong></p>\n<p>9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581</p>\n<p><a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 29, Aug 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are looking for candidates with 8+ years of experience in the IT industry and with strong .Net/.Net Core/Azure Cloud Service/Azure DevOps skills. This is a client-facing role; hence, strong communication skills are essential. The resource should be hands-on, with experience in coding and Azure.</p>\n<p><strong>Working hours:</strong> 8 hours (12 PM - 9 PM)</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop, enhance, document, and maintain application features in .Net Core 5/6+, C#, /REST API/T-SQL, and AngularJS/React JS</li>\n<li>Application Support &amp; API Integrations with third-party solutions/services</li>\n<li>Understand technical project priorities, implementation dependencies, risks, and issues</li>\n<li>Participate in and develop code as part of a unified development group, working the whole technological stack</li>\n<li>Identify, prioritize, and execute tasks in the software development life cycle</li>\n<li>Work with the team to define, design, and deliver new features</li>\n<li>Broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum model, Jira models.</li>\n<li>Effective communication skill, technical documentation, leadership, and ownership quality</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>.NET Core 6/8+</li>\n<li>C#</li>\n<li>Azure Functions/Durable,</li>\n<li>Azure Messaging service (Service Bus, Event Grid, Storage Queues),</li>\n<li>Azure Storage account - Blob,</li>\n<li>DDD / Clean Architecture</li>\n<li>REST API</li>\n<li>Entity Framework / EF Core</li>\n<li>MS SQL Server</li>\n<li>CQRS - Framework</li>\n<li>Microservices &amp; SOA Architecture</li>\n<li>API Integration</li>\n<li>Azure Monitoring (App Insights, Azure Monitor)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Front-End Frameworks: Angular/React JS</li>\n<li>Azure DevOps (CI/CD Pipelines)</li>\n<li>Azure API Management (APIM)</li>\n<li>Azure Containerization &amp; Orchestration</li>\n<li>Azure Data Factory (ADF)</li>\n<li>Azure Logic Apps</li>\n<li>Application Support &amp; Monitoring</li>\n<li>Unit Testing Frameworks</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current, and expected CTC details.</p>\n<p><strong>Fraud Alert:</strong></p>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn, and all employment-related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Azure",
            "C#",
            "REST API"
        ],
        "summary": "Reflections Info Systems is seeking a Senior .Net Lead with 8+ years of experience. This role involves developing and maintaining application features in .Net Core and Azure, requiring strong communication skills."
    },
    {
        "job_title": "Data Engineering - Project Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23027",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Data Engineering - Project Manager</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Data Engineering Project Manager to lead the end-to-end delivery of data platform, AI, BI, and analytics projects. The ideal candidate will have 13+ years of IT experience with a strong background in managing data-related projects and leading cross-functional teams.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Own the end-to-end delivery of data platform, AI, BI, and analytics projects, ensuring alignment with business objectives and stakeholder expectations.</li>\n<li>Develop and maintain comprehensive project plans, roadmaps, and timelines for data ingestion, transformation, governance, AI/ML models, and analytics deliverables.</li>\n<li>Lead cross-functional teams including data engineers, data scientists, BI analysts, architects, and business stakeholders to deliver high-quality, scalable solutions on time and within budget.</li>\n<li>Define, prioritize, and manage product and project backlogs covering data pipelines, data quality, governance, AI services, and BI dashboards or reporting tools.</li>\n<li>Collaborate closely with business units to capture and translate requirements into actionable user stories and acceptance criteria for data and analytics solutions.</li>\n<li>Oversee BI and analytics area including dashboard development, embedded analytics, self-service BI enablement, and ad hoc reporting capabilities.</li>\n<li>Ensure data quality, lineage, security, and compliance requirements are integrated throughout the project lifecycle, in collaboration with governance and security teams.</li>\n<li>Coordinate UAT, performance testing, and user training to ensure adoption and successful rollout of data and analytics products.</li>\n<li>Act as the primary point of contact for all project stakeholders, providing regular status updates, managing risks and issues, and escalating as necessary.</li>\n<li>Facilitate agile ceremonies such as sprint planning, backlog grooming, demos, and retrospectives, fostering a culture of continuous improvement.</li>\n<li>Drive post-deployment monitoring and optimization of data and BI solutions to meet evolving business needs and performance standards.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Overall 13+ Years of Experience in IT with 6+ years of experience as a Technical Product Manager, Technical Program Manager, or Delivery Lead.</li>\n<li>Hands-on development experience in data engineering, including data pipelines, ETL processes, and data integration workflows</li>\n<li>Proven track record managing data engineering, analytics, or AI/ML projects end to end</li>\n<li>Solid understanding of modern data architecture: data lakes, warehouses, pipelines, ETL/ELT, governance, and AI tooling</li>\n<li>Hands-on familiarity with cloud platforms (e.g., Azure, AWS, GCP) and DataOps/MLOps practices</li>\n<li>Strong knowledge of Agile methodologies, sprint planning, and backlog grooming</li>\n<li>Excellent communication and stakeholder management skills, including working with senior execs and technical leads</li>\n<li>Background in computer science, engineering, data science, or analytics</li>\n<li>Experience or Solid Understanding with data engineering tools and services in AWS, Azure &amp; GCP</li>\n<li>Exposure or Solid Understanding of BI, Analytics, LLMs, RAG, prompt engineering, or agent-based AI systems</li>\n<li>Experience leading cross-functional teams in matrixed environments</li>\n<li>Certifications: PMP, CSM, SAFe, or equivalent are a plus</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Note:</strong> Reflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers. Contact careers@reflectionsinfos.com for any clarifications.</p>\n<p>Closing Date: 29, Aug 2025\nJob Published: 22, Aug 2025</p>",
        "tags": [
            "13+ Years",
            "Data Engineering",
            "Agile",
            "Cloud Platforms"
        ],
        "summary": "Seeking a Data Engineering Project Manager to lead data platform, AI, and BI projects. Requires 13+ years of IT experience and expertise in data architecture and cloud platforms."
    },
    {
        "job_title": "Junior Advocate – Legal Support (Full-Time)",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/23026",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Junior Advocate – Legal Support (Full-Time)</h2>\n<p><strong>IGNOSI ENTERPRISES</strong>\nGround Floor, Tejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.ignosi.in\">http://www.ignosi.in</a></p>\n<p><strong>Closing Date:</strong> 30, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> hr@ignosi.co.in</p>\n<p>We are a leading banking software provider seeking a Junior Advocate (Full-Time) to strengthen our legal support team. The selected candidate will handle legal matters for the company and extend support to our banking customers through our Loan Management System (LMS).</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Draft and prepare contracts, agreements, and legal documents.</li>\n<li>Manage due process support for banking customers, including:<ul>\n<li>Drafting due letters from advocate.</li>\n<li>Handling one-time settlement (OTS) options.</li>\n<li>Reminder management for repayments.</li>\n<li>Legal follow-ups when required.</li>\n</ul>\n</li>\n<li>Provide legal advisory and compliance support for both the company and Ignosi customers.</li>\n<li>Work with the technical team to automate manual legal processes and customize our LMS software accordingly.</li>\n<li>Maintain proper documentation and ensure all legal operations are efficient and compliant.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Bachelor’s Degree in Law (LLB).</li>\n<li>Enrolled as an advocate with the Bar Council.</li>\n<li>0–2 years of experience (Freshers with good drafting skills may also apply).</li>\n<li>Knowledge of contracts, debt recovery, and financial compliance preferred.</li>\n<li>Strong drafting, communication, and negotiation skills.</li>\n<li>Interest in legal-tech integration will be an added advantage.</li>\n</ul>\n<p><strong>Compensation:</strong></p>\n<ul>\n<li>Salary: ₹18,000 per month (Full-Time).</li>\n<li>Opportunities for growth in legal-tech and banking law specialization.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Legal Drafting",
            "Debt Recovery",
            "Financial Compliance"
        ],
        "summary": "Ignosi Enterprises is hiring a Junior Advocate to provide legal support for the company and its banking customers. Responsibilities include drafting legal documents, managing due process, and ensuring compliance."
    },
    {
        "job_title": "DevOps Engineer (Software Deployment) (Job Code: DOESD/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23025",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>DevOps Engineer (Software Deployment)</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking a DevOps Engineer to support software deployment activities. This is a contract-based position for one year, focusing on research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Support client team in deployment activities in SDC after UAT completion.</li>\n<li>Monitor application performance and availability post-deployment.</li>\n<li>Support BA/PM in all successful deployment activities.</li>\n<li>Manage Continuous Integration / Continuous Delivery (CICD), DevOps, and System Administration.</li>\n</ul>\n<p><strong>Essential Qualifications and Experience:</strong></p>\n<ul>\n<li>B.Tech./BE or M.Tech/ME or M.Sc. in Computer Science/IT, MCA with at least 60% marks.</li>\n<li>Minimum 3 years of experience in Industry as DevOps engineer.</li>\n<li>Experience in at least one IT project in DevOps &amp; Cloud monitoring in Govt./Enterprises set-up.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>Knowledge on Cloud security (setting up NACLs, SGs).</li>\n<li>Experience in any cloud computing environment like AWS/Azure.</li>\n<li>Knowledge of Kubernetes deployment and maintenance along with Docker.</li>\n<li>Experience in CodeCommit/Repo, git maintenance, system monitoring, and resource usage optimizations.</li>\n<li>Knowledge of DevOps best practices related to software application lifecycle/release processes.</li>\n<li>Experience with modern DevOps fundamentals, tools, and techniques.</li>\n<li>Docker Container Management.</li>\n<li>Excellent written and oral communication skills.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Candidates shall apply online through the Recruitment Portal. The guidelines for submission are available in the portal. Applications shall be submitted online latest on 04.09.2025 through the application form available at https://www.duk.ac.in/careers.</p>\n<p><strong>University Address:</strong></p>\n<p>Kerala University of Digital Sciences, Innovation and Technology\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala, 695317\nhttps://duk.ac.in</p>",
        "tags": [
            "3+ Years",
            "DevOps",
            "Cloud Computing",
            "Kubernetes"
        ],
        "summary": "Seeking a DevOps Engineer for deployment support and system administration. Requires 3+ years of experience and expertise in cloud environments and CI/CD."
    },
    {
        "job_title": "Technical Project Manager (Application Development)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23023",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Technical Project Manager (Application Development)</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Technical Project Manager to lead the end-to-end execution of custom application development and integration projects. The ideal candidate will have a strong technical foundation and project delivery expertise, driving complex initiatives from discovery through production rollout.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage end-to-end delivery of custom software development and integration projects using Java, .NET, and related technologies.</li>\n<li>Create and maintain project plans, define timelines, identify dependencies, and track progress.</li>\n<li>Coordinate with cross-functional teams including developers, QA, UI/UX, and DevOps to ensure smooth execution.</li>\n<li>Oversee all stages of the SDLC: requirements finalization, development, integration, testing (unit, system, UAT, NFR), and deployment.</li>\n<li>Work closely with architects and leads to ensure alignment with technical direction and design.</li>\n<li>Identify and manage risks, scope changes, and schedule adjustments proactively.</li>\n<li>Serve as the primary point of contact for clients and stakeholders, providing regular updates and resolving issues.</li>\n<li>Ensure quality and timely delivery through effective team coordination and clear communication.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>13+ years of overall IT experience, with 4–6 years of Technical Project Management experience.</li>\n<li>Strong understanding of custom application development on Java/.NET stacks.</li>\n<li>Experience managing backend/API development, integration using tools like Apache Camel, IBM Integration Stack, and database interactions (Oracle, SQL Server).</li>\n<li>Experience with client-side development using React/Angular and deployment on cloud platforms (AWS, Azure).</li>\n<li>Familiarity with Microservices architecture, CI/CD pipelines, and DevOps practices.</li>\n<li>Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li>Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.</li>\n<li>Tools: Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</li>\n<li>Experience managing globally distributed teams.</li>\n<li>Strong understanding of enterprise-level integrations and technology ecosystems.</li>\n<li>Excellent communication and stakeholder engagement capabilities.</li>\n<li>Strong leadership, problem-solving, and organizational skills.</li>\n<li>Ability to articulate technical topics to both technical and non-technical audiences.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please note:</strong> Reflections Info Systems never seeks payment for jobs. Contact careers@reflectionsinfos.com for any clarifications.</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Java",
            "Project Management"
        ],
        "summary": "Seeking a Technical Project Manager with 13+ years of experience to lead custom application development projects. Proficiency in .NET, Java, and project management methodologies is crucial for success."
    },
    {
        "job_title": "Machine Learning Engineer / Data Scientist",
        "company": "Shellsquare Softwares (P) Ltd",
        "url": "https://technopark.org/job-details/23022",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Machine Learning Engineer / Data Scientist</h2>\n<p><strong>ShellSquare Softwares (P) Ltd</strong>\n1st floor, Periyar Building, Technopark Phase I, Kerala, 695581\n<a href=\"http://www.shellsquare.com\">http://www.shellsquare.com</a></p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> careers@shellsquare.com</p>\n<h3>About the Role</h3>\n<p>We are looking for a skilled and motivated Machine Learning Engineer / Data Scientist to join our team. The ideal candidate should have a strong foundation in machine learning and deep learning, with experience in building end-to-end ML pipelines and hybrid modeling approaches that incorporate both physics-based simulations and data-driven insights. You will work on high-impact projects involving time series forecasting, predictive modeling, and system simulation to support data-driven decision-making.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, train, and evaluate machine learning and deep learning models for regression, classification, and forecasting tasks.</li>\n<li>Build and maintain end-to-end ML pipelines, including data ingestion, preprocessing, feature engineering, model training, validation, and deployment.</li>\n<li>Develop physics-informed or hybrid models by combining domain knowledge with machine learning approaches to simulate and predict system behaviors.</li>\n<li>Implement and optimize time series forecasting models using statistical techniques, classical ML, and deep learning architectures (e.g., LSTM, Transformer).</li>\n<li>Collaborate with cross-functional teams to translate business needs into machine learning solutions.</li>\n<li>Monitor and refine model performance post-deployment to ensure robust, scalable outcomes.</li>\n</ul>\n<h3>Key Skills Required</h3>\n<ul>\n<li>Strong knowledge of Machine Learning and Deep Learning algorithms and their applications.</li>\n<li>Proven experience in building and deploying end-to-end ML pipelines.</li>\n<li>Hands-on experience in physics-based modeling or hybrid approaches combining physical models with data-driven techniques.</li>\n<li>Solid understanding of time series forecasting using statistical (ARIMA, ETS), machine learning (XGBoost, RF), and deep learning (RNN, LSTM, Temporal CNN) methods.</li>\n<li>Experience designing regression and classification models for real-world problems.</li>\n<li>Proficiency in Python, and libraries like TensorFlow / PyTorch, scikit-learn, pandas, NumPy, statsmodels, etc.</li>\n<li>Strong problem-solving mindset and ability to work with minimal supervision.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Time series forecasting, Python, Machine Learning and Deep Learning</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Machine Learning",
            "Deep Learning",
            "Python",
            "Time Series Forecasting"
        ],
        "summary": "ShellSquare Softwares is seeking a Machine Learning Engineer / Data Scientist. The role involves building ML pipelines, developing hybrid models, and implementing time series forecasting solutions."
    },
    {
        "job_title": "Data Scientist",
        "company": "Shellsquare Softwares (P) Ltd",
        "url": "https://technopark.org/job-details/23021",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Data Scientist</h2>\n<p><strong>ShellSquare Softwares (P) Ltd</strong> is seeking a talented Data Scientist to join our team.</p>\n<p><strong>Location:</strong> 1st floor, Periyar Building, Technopark Phase I, Kerala, 695581</p>\n<p><strong>Website:</strong> <a href=\"http://www.shellsquare.com\">http://www.shellsquare.com</a></p>\n<p><strong>Closing Date:</strong> 22, Sept 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Contact Email:</strong> <a href=\"mailto:careers@shellsquare.com\">careers@shellsquare.com</a></p>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for a Generative AI Expert with strong knowledge in Retrieval-Augmented Generation (RAG) and machine learning/deep learning (ML/DL). You will work on building intelligent systems that combine large language models (LLMs) with document retrieval to generate accurate and context-aware responses.</p>\n<p>Your role will involve developing and improving ML/DL models, fine-tuning LLMs, and integrating retrieval systems using vector databases. You’ll collaborate with cross-functional teams to build real-world AI solutions that make use of both unstructured data (like PDFs and web pages) and structured sources.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, build, and optimize RAG pipelines for document-level and multi-turn QA systems.</li>\n<li>Fine-tune or prompt-tune foundation models (LLMs) for domain-specific tasks.</li>\n<li>Develop and deploy ML/DL models to support NLP/NLU tasks like summarization, classification, and retrieval scoring.</li>\n<li>Integrate vector databases, semantic search tools, and embedding models for high-performance document retrieval.</li>\n<li>Work with unstructured and semi-structured data sources (PDFs, HTML, JSON, SQL, etc.).</li>\n<li>Collaborate with data engineers, ML engineers, and product teams to build end-to-end generative AI solutions.</li>\n<li>Monitor performance, latency, and relevance metrics; iterate on retrieval and generation models.</li>\n<li>Implement prompt engineering strategies and hybrid approaches (rule-based + neural) to enhance model reliability.</li>\n<li>Contribute to research and innovation in applied generative AI, and stay up-to-date with the latest in LLM, RAG, and MLOps ecosystems.</li>\n</ul>\n<p><strong>Key Skills Required:</strong></p>\n<ul>\n<li>Strong experience with RAG architectures and hybrid retrieval systems.</li>\n<li>Solid hands-on knowledge of LLMs (e.g., GPT, Mistral, LLaMA, Claude, DeepSeek, etc.) and embedding models (e.g., SBERT, OpenAI, HuggingFace models).</li>\n<li>Proficiency in machine learning / deep learning using PyTorch, TensorFlow, Hugging Face Transformers, etc.</li>\n<li>Experience with vector databases (e.g., FAISS, Weaviate, Pinecone, Qdrant).</li>\n<li>Experience in text chunking, retrieval scoring, prompt tuning, or LoRA/PEFT methods.</li>\n<li>Strong background in NLP, information retrieval, and knowledge graphs is a plus.</li>\n<li>Comfortable with Python and associated data science stacks (Pandas, NumPy, Scikit-learn).</li>\n<li>Experience working with real-world messy data (PDF parsing, OCR, HTML scraping, etc.)</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p>LLM, RAG, ML/DL</p>",
        "tags": [
            "3+ Years",
            "RAG",
            "LLM",
            "ML/DL"
        ],
        "summary": "ShellSquare Softwares is seeking a Data Scientist expert in Generative AI and RAG. The role involves building intelligent systems and improving ML/DL models."
    },
    {
        "job_title": "TECHNICAL SALES SPECIALIST (Hospital Management S/W)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23020",
        "location": "Technopark",
        "closing_date": "06 Oct 2025",
        "job_description": "<h2>Technical Sales Specialist (Hospital Management S/W)</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong> is seeking a Technical Sales Specialist to drive sales and marketing initiatives for our Hospital Management Software (HMS) solutions. This role is crucial in expanding our reach within the healthcare domain.</p>\n<p><strong>Contact:</strong> careers@shmsolutions.in</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute a strategic sales plan to meet company targets and accelerate business growth in the healthcare software sector.</li>\n<li>Identify and engage with new prospects, including hospitals, clinics, diagnostic centers, and healthcare networks.</li>\n<li>Maintain and deepen relationships with key clients by understanding their operational needs and offering tailored HMS solutions.</li>\n<li>Design and manage integrated marketing campaigns in line with the company’s GTM strategy.</li>\n<li>Conduct regular market research and competitor analysis to ensure strategic positioning and adapt to healthcare market needs.</li>\n<li>Create compelling marketing content, including brochures, case studies, and presentations, maintaining brand consistency.</li>\n<li>Collaborate with internal teams (product, sales, and support) to align messaging and improve customer engagement.</li>\n<li>Analyze campaign performance, ROI, and make data-driven decisions to improve effectiveness.</li>\n<li>Stay updated on healthcare trends, software innovations, and regulatory guidelines affecting hospital IT systems.</li>\n<li>Represent the company at industry events, conferences, and webinars to strengthen brand visibility.</li>\n</ul>\n<p><strong>Required Qualifications &amp; Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Healthcare IT, or related field (MBA preferred).</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li>Fluent in Hindi and English – must be able to communicate confidently with clients in Hindi-speaking regions.</li>\n<li>Familiarity with Hospital Management Systems (HMS), EMR/EHR solutions, or healthcare IT workflows is a strong advantage.</li>\n<li>Ability to create effective marketing materials and sales presentations.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Self-driven, target-oriented</li>\n<li>Capable of working independently.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Experience in handling client demos and product presentations.</li>\n<li>Ability to travel as needed for client meetings, demos, and events.</li>\n</ul>\n<p><strong>Salary Package:</strong> 6-12 LPA</p>\n<p><strong>Closing Date:</strong> 06, Oct 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>",
        "tags": [
            "0-5 Years",
            "Hospital Management Systems",
            "Sales",
            "Marketing"
        ],
        "summary": "Seeking a Technical Sales & Marketing Specialist for Hospital Management Software (HMS) solutions. The role involves strategic sales planning, client relationship management, and marketing campaign execution to expand market reach."
    },
    {
        "job_title": "Junior Designers UI/UX (Exp:1- 2yrs)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23019",
        "location": "Technopark",
        "closing_date": "06 Oct 2025",
        "job_description": "<h2>Junior Designers UI/UX</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building\nTechnopark Phase 1, 695581\nhttps://shmsolutions.in</p>\n<p><strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a Junior Designer with 1–2 years of experience to join our product and development team. You will contribute to designing user interfaces and experiences for web and mobile healthcare applications, including AI-powered tools. Talented freshers with strong portfolios may also be considered.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Create UI designs and interactive prototypes using Figma</li>\n<li>Collaborate with product and engineering teams to transform concepts into working designs</li>\n<li>Design user-centric workflows for AI-based applications</li>\n<li>Use basic HTML/CSS knowledge for quick design reviews or mockups</li>\n<li>Contribute to branding, marketing creatives, and internal documentation design</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong proficiency in Figma and understanding of UI/UX principles</li>\n<li>Basic working knowledge of HTML/CSS</li>\n<li>Exposure to or interest in designing for AI-driven applications</li>\n<li>High attention to detail and ability to adapt designs based on feedback</li>\n<li>Good communication skills and a collaborative mindset</li>\n</ul>\n<p><strong>Preferred Experience:</strong></p>\n<ul>\n<li>1–2 years of design experience (Preferred)</li>\n<li>Exceptional freshers with a strong design portfolio may also be considered.</li>\n</ul>\n<p><strong>Salary Package:</strong> 3.5 to 4.8 LPA</p>",
        "tags": [
            "1-2 Years",
            "Figma",
            "UI/UX",
            "HTML/CSS"
        ],
        "summary": "SMARTHMS & SOLUTIONS is looking for a Junior Designer to create UI/UX for web and mobile healthcare applications. The role involves collaboration, prototyping, and designing user-centric workflows."
    },
    {
        "job_title": "QA Engineer (API Testing) (Job Code: QAE/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23018",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>QA Engineer (API Testing)</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong></p>\n<p><strong>Location:</strong> Technopark Phase-IV Campus (Technocity), Mangalappuram, Thonnakkal PO, Trivandrum, Kerala, 695317</p>\n<p><strong>Website:</strong> <a href=\"https://duk.ac.in\">https://duk.ac.in</a></p>\n<p><strong>Job Code:</strong> QAE/082025/478</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Contact Email:</strong> recruitments@duk.ac.in</p>\n<p><strong>Brief Description:</strong>\nKerala University of Digital Sciences, Innovation and Technology invites applications from qualified Indian Citizens for appointment to the post of QA Engineer on a contract basis for one year for research/consultancy/development and training activities under the Kerala Blockchain Academy University initiative (<a href=\"https://kba.ai/\">https://kba.ai/</a>).</p>\n<p>Candidates shall apply online through the Recruitment Portal. The guidelines for the submission of applications are available in the portal.</p>\n<p>Applications shall be submitted online no later than 04.09.2025. The application form is available at <a href=\"https://www.duk.ac.in/careers\">https://www.duk.ac.in/careers</a></p>\n<p><strong>Essential Qualification:</strong></p>\n<ul>\n<li>B.Tech./BE or M.Tech/ME or M.Sc. in Computer Science/IT, MCA with at least 60% marks.</li>\n<li>Minimum two years of experience in IT/Government sector/PSU in Software Quality Assurance Domain.</li>\n</ul>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Strong knowledge of software QA methodologies, tools, and processes.</li>\n<li>Good knowledge of test metrics, defect tracking, test cycles, etc.</li>\n<li>Experience in writing clear, concise, and comprehensive test plans and test cases.</li>\n<li>Hands-on experience with both white box and black box testing.</li>\n<li>Hands-on experience with automated testing tools.</li>\n<li>Experience working in an Agile/Scrum development process.</li>\n<li>Experience with performance and/or security testing is a plus.</li>\n<li>Stay up-to-date with the latest web technologies and trends.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Candidates with relevant Certifications will be given a preference.</li>\n<li>Experience in automation testing will be an added advantage.</li>\n<li>Maintain all test reports (for different types of testing) for the services and related APIs required for successful deployment integrated into client applications in line with the development team of DUK.</li>\n<li>Ensure all modules pass quality benchmarks before they are handed over for User Acceptance Testing (UAT).</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>Direct Project Management responsibility of a full project development life cycle.</li>\n<li>Experience in leading Web application development teams is preferable.</li>\n<li>Knowledge about the importance of automated tests, both unit and Integration tests.</li>\n<li>Knowledge of CI/CD will be an added advantage.</li>\n<li>Excellent written and oral communication skills.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "API Testing",
            "Automated Testing",
            "Agile/Scrum"
        ],
        "summary": "Kerala University seeks a QA Engineer with 2+ years of experience to ensure software quality through comprehensive testing. The role involves API testing and working within Agile/Scrum."
    },
    {
        "job_title": "Strategic Implementation Manager: (Freshers/2024/2025 Passouts)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23017",
        "location": "Technopark",
        "closing_date": "06 Oct 2025",
        "job_description": "<h2>Strategic Implementation Manager</h2>\n<p>SMARTHMS &amp; SOLUTIONS (P) Ltd is looking for a smart, high-potential fresher to join their Implementation Team. This is an excellent opportunity to build a career in healthcare technology delivery. You will learn their healthcare ERP product, understand hospital workflows, and assist in onboarding and training new implementation engineers under the guidance of senior team members.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Participate in structured training to learn healthcare ERP modules (Billing, Lab, EMR, etc.)</li>\n<li>Understand hospital workflows and compliance standards such as NABH</li>\n<li>Shadow senior team members during client implementations</li>\n<li>Maintain and update onboarding materials, SOPs, templates, and checklists</li>\n<li>Assist in creating and improving training content (slides, videos, FAQs)</li>\n<li>Document challenges, feedback, and resolutions from field projects</li>\n<li>Support onboarding and internal training for new engineers</li>\n<li>Conduct mock demos and sandbox configurations for practice sessions</li>\n<li>Track training progress using structured checklists</li>\n<li>Learn technical deployment basics and data preparation steps</li>\n<li>Collaborate with project managers and client-side stakeholders</li>\n<li>Participate in team retrospectives and identify process improvement areas</li>\n</ul>\n<p><strong>Preferred Skills/Qualification:</strong></p>\n<ul>\n<li>Recent graduate in Engineering, IT, Business or Life Sciences</li>\n<li>Strong logical reasoning and fast learning ability</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Attention to detail and proactive documentation habits</li>\n<li>Eagerness to learn healthcare processes and ERP delivery</li>\n</ul>\n<p><strong>Good-to-Have:</strong></p>\n<ul>\n<li>Exposure to ERP or enterprise systems through internships or projects</li>\n<li>Basic understanding of hospital operations</li>\n<li>Proficiency in MS Office or Google Suite</li>\n</ul>\n<p><strong>Salary:</strong> 8 LPA</p>\n<p><strong>Contact Information:</strong>\ncareers@shmsolutions.in</p>\n<p><strong>Address:</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581</p>\n<p><strong>Website:</strong>\nhttps://shmsolutions.in</p>\n<p><strong>Closing Date:</strong> 06, Oct 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>",
        "tags": [
            "Freshers",
            "ERP",
            "Healthcare",
            "Training"
        ],
        "summary": "Join SMARTHMS & SOLUTIONS as a Strategic Implementation Manager. Learn healthcare ERP, assist in onboarding, and contribute to healthcare technology delivery with 8 LPA salary."
    },
    {
        "job_title": "Student Mentor for Online Classes (Females Only)",
        "company": "Doubtbox Edutainment (P) Ltd",
        "url": "https://technopark.org/job-details/23016",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Student Mentor for Online Classes (Females Only)</h2>\n<p>Doubtbox Edutainment (P) Ltd is seeking a Student Mentor to support students in our online classes. Doubtbox is a prominent Personalised LIVE Learning platform catering to students of classes 1-12 under CBSE/ICSE/State Boards. The platform is dedicated to transforming learning into an engaging and enjoyable experience. </p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Providing guidance and support to students in academic, personal, and career development.</li>\n<li>Helping students set goals and create action plans to achieve them.</li>\n<li>Offering advice on study techniques, time management, and effective learning strategies.</li>\n<li>Assisting students in navigating academic programs, resources, and opportunities.</li>\n<li>Serving as a role model and providing motivation for students to succeed.</li>\n<li>Addressing student's concerns, challenges, and questions related to their education.</li>\n<li>Monitoring student's progress and academic performance.</li>\n<li>Creating a supportive and inclusive environment for students to thrive.</li>\n<li>Collaborating with other faculty members and staff to promote student success.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Communication Skills: Ability to listen actively and communicate effectively with students to provide guidance and support.</li>\n<li>Capacity to understand and empathize with student's challenges, concerns, and emotions.</li>\n<li>Patience: Willingness to support students at their own pace and assist them through difficulties.</li>\n<li>Problem-Solving: Skill to help students identify solutions to academic and personal challenges they may encounter.</li>\n<li>Organizational Skills: Capability to assist students in developing effective study habits, time management, and goal-setting skills.</li>\n<li>Adaptability: Flexibility to adjust mentoring approaches based on individual student needs and circumstances.</li>\n<li>Motivational Skills: Ability to inspire and encourage students to reach their full potential.</li>\n<li>Strong reporting skills with knowledge in Word, Excel, and PowerPoint presentation.</li>\n<li>Graduates in Science or Mathematics preferred.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Doubtbox Edutainment (P) Ltd</li>\n<li>1st Floor, Nila Building, Technopark, Trivandrum, 695581</li>\n<li>Website: http://www.doubtbox.com</li>\n<li>Contact Email: hr@doubtbox.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>",
        "tags": [
            "0 Years",
            "Communication Skills",
            "Problem-Solving",
            "Reporting Skills"
        ],
        "summary": "Doubtbox is hiring a Student Mentor to guide students in academic and personal growth. The role involves offering advice, monitoring progress, and fostering a supportive learning environment."
    },
    {
        "job_title": "PMO Executive",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/23015",
        "location": "Technopark",
        "closing_date": "27 Aug 2025",
        "job_description": "<h2>PMO Executive</h2>\n<p>Lean Transitions Solutions (LTS) is seeking a detail-oriented and proactive PMO Executive to support our project management by ensuring governance, process standardisation, JIRA administration, and reporting. The ideal candidate will act as a bridge between project teams and leadership, driving visibility, compliance, and continuous improvement across the organisation.</p>\n<p><strong>About Lean Transition Solutions:</strong></p>\n<p>Founded over a decade ago with headquarters in the United Kingdom, LTS is an ISO 9001:2015 certified company advocating Industry 4.0. LTS delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions for various world-class organisations across the globe, including Fortune 500 companies, with global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico. LTS upholds a company culture that nurtures core values – Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>Project Management Support &amp; Governance</strong></p>\n<ul>\n<li>Standardise project management processes, templates, and reporting across all projects.</li>\n<li>Ensure adherence to organisational methodologies (Agile, Scrum, Kanban).</li>\n<li>Track project status, risks, dependencies, and escalate issues proactively.</li>\n<li>Support PMs and BAs with consolidated project portfolio reporting.</li>\n</ul>\n<p><strong>JIRA Administration &amp; Management</strong></p>\n<ul>\n<li>Own and manage JIRA setup, workflows, permissions, and configurations.</li>\n<li>Create and maintain project boards, sprint templates, and dashboards.</li>\n<li>Ensure timely and accurate updates from PMs, BAs, and Development teams.</li>\n<li>Generate reports including burn-down charts, velocity, SLA tracking, and portfolio views.</li>\n</ul>\n<p><strong>Reporting &amp; Communication</strong></p>\n<ul>\n<li>Prepare weekly/monthly consolidated project status reports for leadership teams in India &amp; UK.</li>\n<li>Publish dashboards and updates to maintain transparency across projects.</li>\n<li>Provide delivery insights to support Sales &amp; Strategic teams for client commitments.</li>\n</ul>\n<p><strong>Process Improvement &amp; Compliance</strong></p>\n<ul>\n<li>Continuously improve project tracking tools and methods.</li>\n<li>Ensure data accuracy in project management systems for audit and compliance.</li>\n<li>Support risk and change management processes.</li>\n</ul>\n<p><strong>Training &amp; Enablement</strong></p>\n<ul>\n<li>Train PMs, BAs, and team members on JIRA and PMO processes.</li>\n<li>Act as the first point of contact for tool-related queries and support.</li>\n<li>Promote best practices in project tracking, documentation, and communication.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>2–4 years of experience in PMO / Project Coordination / JIRA Administration.</li>\n<li>Strong knowledge of Agile methodologies (Scrum, Kanban) and project governance.</li>\n<li>Hands-on experience with JIRA administration, dashboards, and reporting.</li>\n<li>Proficiency in MS Excel, PowerPoint, and reporting tools.</li>\n<li>Excellent communication and presentation skills.</li>\n<li>Strong organisational skills with attention to detail.</li>\n<li>Ability to manage multiple priorities and meet deadlines.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line \"PMO Executive\" and include the following information in the email content:</p>\n<ul>\n<li>Current CTC:</li>\n<li>Expected CTC:</li>\n<li>Notice Period:</li>\n<li>Current Location:</li>\n<li>Total Relevant Experience:</li>\n<li>Willingness to work at office:</li>\n</ul>\n<p><strong>Company Address:</strong></p>\n<p>Lean Transitions Solutions\nBasement Floor, Periyar Building, Technopark Phase -1\nTrivandrum, 695581\nhttp://www.LeanTransitionSolutions.com</p>",
        "tags": [
            "2-4 Years",
            "JIRA Administration",
            "Agile",
            "Project Management"
        ],
        "summary": "LTS is hiring a PMO Executive to standardise project processes, manage JIRA, and provide reporting. The role requires 2-4 years of PMO or project coordination experience and agile methodologies knowledge."
    },
    {
        "job_title": "Backend Developer (PHP/Java) (Job Code BD/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23014",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Backend Developer (PHP/Java)</h2>\n<p>Kerala University of Digital Sciences, Innovation and Technology is seeking a Backend Developer to join our team on a contract basis for one year. You will be working on research/consultancy/development and training activities under the Kerala Blockchain Academy University initiative (https://kba.ai/).</p>\n<p><strong>Contact Information:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Support the project team in conducting technical feasibility studies of departmental applications proposed for integration.</li>\n<li>Study and report on peak usage times and areas of optimization in service delivery for identified department services.</li>\n<li>Support the project team to perform system studies for API feasibility, including compatibility with the architecture/framework.</li>\n<li>Identify and list possible API endpoints for application submission, status retrieval, and other integration needs.</li>\n<li>Support BA and collaborate with clients, departments, and TSPs to gather, document, and analyze business and technical requirements for API development and integration.</li>\n<li>Collaborate with engineering/development teams in departments to deploy scalable, secure, and reliable services.</li>\n<li>Support BA/PM in all documentation and other activities listed towards integration of services into the client project.</li>\n</ul>\n<p><strong>Essential Qualification and Experience:</strong></p>\n<ul>\n<li>B.Tech./BE or M.Tech/ME or M.Sc. in Computer Science/IT, MCA with at least 60% marks.</li>\n<li>Minimum 4-year relevant experience in a reputed Organization/Institution as Full stack development.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>Experiences with modern software build pipeline tools.</li>\n<li>Familiarity with common approaches of CI/CD in cloud environments including docker.</li>\n<li>Good Hands-on experience in Full-Stack/ Backend-PHP/Java development preferably in an agile environment.</li>\n<li>Extensive experience with delivering software solutions in PHP/Java.</li>\n<li>Experience in Test Driven Development.</li>\n<li>Solid foundation in writing unit tests and code refactoring.</li>\n<li>Strong knowledge in Symphony/Laravel/Spring boot or similar framework.</li>\n<li>Excellent written and oral communication skills.</li>\n</ul>\n<p><strong>Application Details:</strong></p>\n<p>Candidates shall apply online through the Recruitment Portal. The guidelines for submission are available in the portal. Applications shall be submitted online latest on 04.09.2025. The application form is available at https://www.duk.ac.in/careers</p>",
        "tags": [
            "4+ Years",
            "PHP",
            "Java",
            "API Development"
        ],
        "summary": "Seeking a Backend Developer with 4+ years of experience in PHP/Java to support integration projects. Responsibilities include API development, collaboration with teams, and ensuring scalable services."
    },
    {
        "job_title": "Business Analyst/Project Manager (Job Code BAPM/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23013",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Business Analyst/Project Manager</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking a highly motivated and experienced Business Analyst/Project Manager to join our team on a contract basis for one year. This role will contribute to research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative (https://kba.ai/).</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Project Design and Business / Govt. Process Reengineering.</li>\n<li>Requirement Analysis and Redesign of existing systems.</li>\n<li>Provide overall direction and completion of projects ensuring consistency with strategy, commitments and goals.</li>\n<li>Provide delivery oversight, ensuring all projects meet quality and client satisfaction.</li>\n<li>Contribute to feature prioritization discussions with the Product Management team/Client.</li>\n<li>Maintain all project plans and ensure compliance to time-frame and collaborate with stakeholders for all implementation process.</li>\n<li>Submit required documentation for KSITM's approval for successful solution deployment.</li>\n<li>Maintain detailed documentation for deployment procedures, architecture, and system configurations.</li>\n<li>Conduct technical feasibility studies of departmental applications proposed for integration.</li>\n<li>Assess the impact of changes in departmental policies/workflows and recommend system adaptations with KSITM support.</li>\n<li>Collaborate with KSITM, DUK, departments, and TSPs to gather, document, and analyze business and technical requirements, API development, and integration.</li>\n<li>Identify and communicate bottlenecks to KSITM's Project Manager related to interdepartmental cooperation, technical limitations, or data issues.</li>\n<li>Troubleshoot and conduct root cause analysis for deployment or integration issues with the development team.</li>\n<li>Analyze and document services, application forms, process flows, and endpoints of each application.</li>\n<li>Provide weekly progress status reports to KSITM, highlighting achievements, issues, and action items.</li>\n</ul>\n<p><strong>Essential Qualifications and Experience:</strong></p>\n<ul>\n<li>B.Tech./BE or M.Tech/ME or M.Sc. in Computer Science/IT, MCA or MBA with at least 60% marks.</li>\n<li>Minimum 4-year relevant experience in a reputed Organization/Institution as Project Manager/Business Analyst in e-Governance/Software Development.</li>\n<li>Experience with Scrum and Agile tools</li>\n<li>Good understanding of technologies running behind the project.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>Direct Project Management responsibility of a full project development life cycle</li>\n<li>Experience in leading Web application development teams is preferable.</li>\n<li>Knowledge about the importance of automated tests, both unit and Integration tests</li>\n<li>Knowledge of CI/CD will be an added advantage</li>\n<li>Excellent written and oral communication skills</li>\n</ul>\n<p><strong>University Address:</strong>\nKerala University of Digital Sciences, Innovation and Technology\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala , 695317\nhttps://duk.ac.in/careers</p>",
        "tags": [
            "4+ Years",
            "Project Management",
            "Business Analysis",
            "Agile"
        ],
        "summary": "Seeking a Business Analyst/Project Manager to drive projects under the Kerala Blockchain Academy. Requires 4+ years of experience, proficiency in project management, and strong analytical skills."
    },
    {
        "job_title": "ACADEMIC COUNSELLOR'S /TELE CALLING EXECUTIVES (Female Fresher/Experienced Candidates)",
        "company": "Doubtbox Edutainment (P) Ltd",
        "url": "https://technopark.org/job-details/23012",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Academic Counsellor/Tele Calling Executive</h2>\n<p><strong>Doubtbox Edutainment (P) Ltd</strong></p>\n<p>Doubtbox is a prominent Personalised LIVE Learning platform catering to students of classes 1-12 under CBSE/ICSE/State Boards. The platform transforms learning into an engaging and enjoyable experience, emphasizing personalized LIVE Online Teaching tailored to each student's learning styles.</p>\n<p><strong>Contact:</strong> hr@doubtbox.com</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Conduct outbound calls to potential or existing customers (generally parents of Class 1-12 students).</li>\n<li>Work from the Technopark, Thiruvananthapuram office.</li>\n<li>Introduce products/services, explain features, and highlight benefits to students and parents.</li>\n<li>Follow company scripts and adapt them to engage customers effectively.</li>\n<li>Identify and qualify sales leads by understanding customer needs.</li>\n<li>Maintain accurate records of customer interactions and update databases.</li>\n<li>Address customer inquiries, resolve complaints, and provide solutions.</li>\n<li>Collaborate with the sales team to meet targets.</li>\n<li>Stay updated on product knowledge and industry trends.</li>\n<li>Meet or exceed daily, weekly, and monthly performance targets.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor's degree in any stream.</li>\n<li>Experience in telemarketing, sales, or customer service is advantageous.</li>\n<li>Excellent communication skills (verbal and written).</li>\n<li>Strong persuasion and negotiation skills.</li>\n<li>Ability to work in a fast-paced environment and handle multiple tasks.</li>\n<li>Good organizational skills with attention to detail.</li>\n<li>Proficiency in basic computer applications, including MS Office and CRM software.</li>\n<li>Positive attitude, resilience, and ability to handle rejection professionally.</li>\n<li>Willingness to work flexible hours, including evenings and weekends.</li>\n</ul>\n<h3>Educational Qualifications:</h3>\n<ul>\n<li>Bachelor's Degree in any Stream</li>\n</ul>",
        "tags": [
            "Fresher",
            "Telemarketing",
            "CRM",
            "Sales"
        ],
        "summary": "Join Doubtbox as an Academic Counsellor/Tele Calling Executive, engaging with parents and students to promote personalized learning solutions. This role requires excellent communication skills and a drive to meet sales targets."
    },
    {
        "job_title": "Asst Manager (Administration) (Job Code AMA/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23011",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Assistant Manager (Administration)</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking an Assistant Manager (Administration) to join their team on a contract basis for one year.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Office Administration:</strong><ul>\n<li>Oversee day-to-day administrative operations to ensure smooth functioning.</li>\n<li>Manage office supplies, equipment, and maintenance.</li>\n<li>Ensure compliance with organization policies and procedures.</li>\n</ul>\n</li>\n<li><strong>Facility Management:</strong><ul>\n<li>Coordinate with vendors for maintenance services.</li>\n<li>Monitor cleanliness, safety, and hygiene standards.</li>\n<li>Supervise repair and maintenance of office infrastructure.</li>\n</ul>\n</li>\n<li><strong>Vendor and Contract Management:</strong><ul>\n<li>Liaise with service providers and negotiate contracts.</li>\n<li>Monitor vendor performance and ensure service level agreements are met.</li>\n<li>Maintain records of contracts, invoices, and payments.</li>\n</ul>\n</li>\n<li><strong>Travel and Accommodation Arrangements:</strong><ul>\n<li>Handle travel bookings, itineraries, and hotel accommodations for staff.</li>\n<li>Ensure cost-effective and timely travel arrangements.</li>\n</ul>\n</li>\n<li><strong>Document and Record Management:</strong><ul>\n<li>Maintain proper filing systems for confidential and critical documents.</li>\n<li>Ensure secure storage and easy retrieval of administrative records.</li>\n</ul>\n</li>\n<li><strong>Budgeting and Cost Control:</strong><ul>\n<li>Assist in preparing the administrative budget.</li>\n<li>Monitor and control expenses within approved limits.</li>\n</ul>\n</li>\n<li><strong>Compliance and Audit Support:</strong><ul>\n<li>Ensure adherence to statutory regulations and internal policies.</li>\n</ul>\n</li>\n<li><strong>Coordination and Communication:</strong><ul>\n<li>Serve as a liaison between departments and management for administrative needs.</li>\n<li>Coordinate company events, meetings, and staff welfare activities.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li><strong>Essential:</strong><ul>\n<li>MBA (HR &amp; Marketing)</li>\n<li>At least 7 years of experience in relevant fields</li>\n</ul>\n</li>\n<li><strong>Desirable:</strong><ul>\n<li>Managing administration functions which encompasses travel management, facility management, public relations, vendor management.</li>\n<li>Proficient in directing activities in coordination with inter departments for ensuring smooth business operations</li>\n</ul>\n</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul>\n<li>Office Administration</li>\n<li>Vendor Management</li>\n<li>Contract Management</li>\n<li>Budgeting</li>\n<li>Coordination</li>\n<li>Communication</li>\n</ul>\n<p><strong>Application Details:</strong></p>\n<ul>\n<li>Apply online through the Recruitment Portal.</li>\n<li>Application form: https://www.duk.ac.in/careers</li>\n<li>Closing Date: 04, Sept 2025</li>\n</ul>",
        "tags": [
            "7+ Years",
            "Office Administration",
            "Vendor Management",
            "Contract Management"
        ],
        "summary": "Seeking an Assistant Manager to oversee administrative functions including vendor management, travel arrangements, and budgeting. Requires MBA (HR & Marketing) and 7+ years of experience."
    },
    {
        "job_title": "R&D Engineer (Projects) (Job Code RDEP/082025/478",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23010",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>R&amp;D Engineer (Projects)</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> invites applications from qualified Indian Citizens for appointment to the following posts on a contract basis for one year for the research/consultancy/development and training activities under the Kerala Blockchain Academy University initiative (https://kba.ai/).</p>\n<p><strong>Job Code:</strong> RDEP/082025/478\n<strong>Closing Date:</strong> 04, Sept 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Contact Email:</strong> recruitments@duk.ac.in</p>\n<p><strong>Location:</strong>\nKerala University of Digital Sciences, Innovation and Technology\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala, 695317\nhttps://duk.ac.in</p>\n<p><strong>How to Apply:</strong>\nCandidates shall apply online through the Recruitment Portal. The guidelines for the submission of applications are available in the portal. Applications shall be submitted online latest on 04.09.2025. The application form is available at https://www.duk.ac.in/careers</p>\n<h3>Essential Qualification</h3>\n<ul>\n<li>B.Tech./BE or M.Sc. in Computer Science/IT or MCA with at least 60% marks.</li>\n<li>At least one year of development experience in full stack web applications.</li>\n</ul>\n<h3>Job Description</h3>\n<ul>\n<li>Developing applications using Javascript/Nodejs/Next .js, JSON, Web Services, in Unix and Windows environments.</li>\n<li>Developing mobile applications</li>\n<li>Database development interactions with PostgreSQL/MySQL/MongoDB databases.</li>\n</ul>\n<h3>Preferred Skills/Desirable Experience</h3>\n<ul>\n<li>Working knowledge in developing web applications and REST APIs using Go/Javascript frameworks</li>\n<li>Working knowledge of PostgreSQL/MySQL/MongoDB databases</li>\n</ul>",
        "tags": [
            "1+ Years",
            "JavaScript",
            "PostgreSQL",
            "Node.js"
        ],
        "summary": "Kerala University seeks an R&D Engineer to develop web and mobile applications. The role involves full-stack development and database interactions using Javascript, Node.js, and PostgreSQL."
    },
    {
        "job_title": "Digital Marketing Specialist (Job Code: DMS/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23009",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Digital Marketing Specialist</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking a Digital Marketing Specialist to join their team on a contract basis for one year. This role focuses on research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop, execute, and manage multi-channel digital marketing campaigns.</li>\n<li>Drive online traffic and engagement using SEO, SEM, and social media strategies.</li>\n<li>Analyze campaign performance using Google Analytics, Tag Manager, and other tools.</li>\n<li>Optimize landing pages and lead funnels to improve conversion rates.</li>\n<li>Coordinate with design, sales, and content teams for integrated campaign execution.</li>\n<li>Maintain and grow social media presence and oversee content planning.</li>\n<li>Conduct A/B testing, keyword research, competitor benchmarking, and market analysis.</li>\n<li>Strategize and implement high-impact paid advertising on platforms like Google Ads, Meta, YouTube, and LinkedIn.</li>\n<li>Monitor and report KPIs like CTR, CPC, CPA, ROI, and conversion rates.</li>\n</ul>\n<p><strong>Essential Qualifications and Experience:</strong></p>\n<ul>\n<li>MBA in Digital Marketing.</li>\n<li>Professional diploma in SEO &amp; Digital Marketing.</li>\n<li>Minimum 3 years of relevant experience in digital marketing including SEO, social media, paid campaigns, and analytics.</li>\n<li>Proficiency in tools such as Google Analytics, Google Ads, Tag Manager, WordPress, Canva, SEMrush, Clarity, etc.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>Google and Meta (Facebook/Instagram) Ads</li>\n<li>YouTube and LinkedIn advertising</li>\n<li>CRM and WhatsApp Automation</li>\n<li>Experience with campaign tracking and analytics tools</li>\n</ul>\n<p><strong>How to Apply:</strong>\nCandidates shall apply online through the Recruitment Portal. The guidelines for the submission of applications are available in the portal. Applications shall be submitted online latest on 04.09.2025. The application form is available at https://www.duk.ac.in/careers</p>",
        "tags": [
            "3+ Years",
            "Google Analytics",
            "SEO",
            "Google Ads",
            "Social Media"
        ],
        "summary": "Seeking a Digital Marketing Specialist to develop and execute digital marketing campaigns. The role requires expertise in SEO, SEM, social media, and analytics tools."
    },
    {
        "job_title": "Design Lead – Motion & Visual Media (Job Code DLMVM/082025/478",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23008",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Design Lead – Motion &amp; Visual Media</h2>\n<p>Kerala University of Digital Sciences, Innovation and Technology is seeking a Design Lead to join their team on a contract basis for one year. This role involves creating high-quality designs, animations, and videos, with a focus on AI-enhanced content creation.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Job Code:</strong> DLMVM/082025/478</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Brief Description:</strong>\nKerala University of Digital Sciences, Innovation and Technology invites applications from qualified Indian Citizens for appointment to the following posts on a contract basis for one year for the research/consultancy/development and training activities under the Kerala Blockchain Academy University initiative (https://kba.ai/).\nCandidates shall apply online through the Recruitment Portal. The guidelines for the submission of applications are available in the portal. Applications shall be submitted online latest on 04.09.2025. The application form is available at https://www.duk.ac.in/careers</p>\n<p><strong>Essential Qualification and Experience:</strong>\n- Degree/Advanced Diploma in Multimedia and Animation\n- At least 15 years of experience in relevant fields</p>\n<p><strong>Job Description:</strong></p>\n<p><strong>Design &amp; Branding</strong>\n- Create clean and user-friendly UI designs for web and mobile interfaces using tools like Figma and Adobe XD.\n- Design high-quality print materials such as brochures, catalogues, coffee table books, calendars, newspaper ads, promotional creatives, and certificate templates.</p>\n<p><strong>2D Animation &amp; Video Production</strong>\n- Develop animated content from scriptwriting and storyboarding to asset creation, animation, and final post-production.\n- Produce YouTube Shorts, promotional videos, and explainer content for e-learning and social media platforms.\n- Handle video and audio editing, syncing, and sound design using Adobe Premiere, After Effects, and Audition.</p>\n<p><strong>AI-Enhanced Content Creation</strong>\n- Utilize generative AI tools for image creation, video generation, voice synthesis, and music production.\n- Work with AI platforms such as ChatGPT, Adobe Firefly, Runway ML, Midjourney, HeyGen, Leonardo AI, Copy AI, DeepSeek, and similar tools to create engaging, multilingual, and innovative content.</p>\n<p><strong>Preferred Skills/Desirable Experience:</strong>\n- Experience working in the education, publishing, or technology sector.\n- Knowledge of HTML/CSS for basic web customization.\n- Familiarity with localization and multilingual content creation.</p>",
        "tags": [
            "15+ Years",
            "AI",
            "Multimedia",
            "Animation"
        ],
        "summary": "Seeking a Design Lead with extensive experience in multimedia and AI-driven content creation. This role involves design, animation, and video production for web, mobile, and print media."
    },
    {
        "job_title": "Senior R&D Engineer (Web3 & Devops) (Job Code SRDEWD/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23007",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Senior R&amp;D Engineer (Web3 &amp; Devops)</h2>\n<p>Kerala University of Digital Sciences, Innovation and Technology is seeking a Senior R&amp;D Engineer (Web3 &amp; Devops) to work on a contract basis for one year, contributing to research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Knowledge on Cloud security</li>\n<li>Knowledge in cloud computing environment like AWS/Azure</li>\n<li>Knowledge of Kubernetes deployment and maintenance along with Docker</li>\n<li>Experience in CodeCommit/Repo, git maintenance, system monitoring, and resource usage optimizations</li>\n<li>Knowledge of DevOps best practices as these relate to software application lifecycle/release processes</li>\n<li>Experience with modern DevOps fundamentals, tools, and techniques</li>\n<li>Docker Container Management</li>\n<li>Excellent written and oral communication skills</li>\n<li>Familiarity with common approaches to CI/CD in cloud environments, including Docker.</li>\n<li>Working knowledge of GIT and collaborative development practices (e.g., pull requests, feature branches)</li>\n</ul>\n<p><strong>Essential Qualification and Experience:</strong></p>\n<ul>\n<li>B.Tech./BE or M.Tech/ME or M.Sc. in Computer Science/IT or MCA with at least 60% marks.</li>\n<li>Minimum two years experience in IT industry/Government Sector/ PSU/State or Central Universities.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>At least 1 year of experience in setting up private blockchains networks using kubernetes in production setup.</li>\n<li>Should have worked in at least one IT project in DevOps &amp; Kubernetes in Govt/University/ Enterprises set-up</li>\n<li>Certification in Kubernetes (CKA)</li>\n<li>Should have in depth Knowledge in Hyperledger Fabric and Besu.</li>\n<li>Candidates with relevant Certifications will be given a preference</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Candidates shall apply online through the Recruitment Portal. The guidelines for the submission of applications are available in the portal. Applications shall be submitted online latest on 04.09.2025. The application form is available at https://www.duk.ac.in/careers</p>\n<p><strong>Important Dates:</strong></p>\n<ul>\n<li><strong>Closing Date:</strong> 04, Sept 2025</li>\n<li><strong>Job Published:</strong> 22, Aug 2025</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Kubernetes",
            "Docker",
            "DevOps"
        ],
        "summary": "Seeking a Senior R&D Engineer for Web3 & DevOps roles, requiring 2+ years of experience. The role involves cloud security, Kubernetes, Docker, and DevOps best practices."
    },
    {
        "job_title": "Senior R&D Engineer (Web3 & UI) (Job Code: SRDEWUI/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23006",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Senior R&amp;D Engineer (Web3 &amp; UI)</h2>\n<p>Kerala University of Digital Sciences, Innovation and Technology is seeking a Senior R&amp;D Engineer (Web3 &amp; UI) to join their team on a contract basis for one year. The role involves research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Collaborating with the project and content team to create websites.</li>\n<li>Building reusable components.</li>\n<li>Translating designs and wireframes into high-quality code.</li>\n<li>Researching, designing, and developing user interfaces for decentralized apps, protocols, and tools.</li>\n<li>Building responsive and intuitive Web3 front-ends with modern frameworks (e.g., React, NextJs).</li>\n<li>Integrating blockchain technologies such as smart contracts and wallets (e.g., MetaMask, WalletConnect) into the UI layer.</li>\n<li>Collaborating with designers, backend engineers, and blockchain developers to deliver seamless user experiences.</li>\n<li>Exploring and implementing new patterns for identity, privacy, and usability in a decentralized context.</li>\n<li>Contributing to technical research papers, documentation, and open-source projects.</li>\n<li>Staying current on industry trends in both Web3 and front-end engineering.</li>\n</ul>\n<p><strong>Essential Qualifications:</strong></p>\n<ul>\n<li>B.Tech./BE or M.Tech/ME or M.Sc. in Computer Science/IT or MCA with at least 60% marks.</li>\n<li>Minimum two years experience in IT industry/Government Sector/ PSU/State or Central Universities.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>At least two years of experience in developing production-grade front-end applications with hands-on exposure.</li>\n<li>At least two years of experience in integrating Web3 wallets in Frontend applications.</li>\n<li>Exposure to Web3 Technologies.</li>\n<li>Knowledge about public and private blockchain networks.</li>\n<li>Familiarity with design systems (e.g., MUI, Tailwind) and accessibility standards.</li>\n</ul>\n<p><strong>Application Details:</strong></p>\n<ul>\n<li>Apply online through the Recruitment Portal.</li>\n<li>Application form available at <a href=\"https://www.duk.ac.in/careers\">https://www.duk.ac.in/careers</a></li>\n<li><strong>Closing Date:</strong> 04, Sept 2025</li>\n<li><strong>Job Published:</strong> 22, Aug 2025</li>\n</ul>\n<p><strong>Location:</strong>\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala , 695317\n<a href=\"https://duk.ac.in\">https://duk.ac.in</a></p>",
        "tags": [
            "2+ Years",
            "Web3",
            "React",
            "UI Development"
        ],
        "summary": "Seeking a Senior R&D Engineer for Web3 and UI development, integrating blockchain technologies and building decentralized applications. Requires 2+ years of experience and expertise in front-end frameworks."
    },
    {
        "job_title": "Senior R&D Engineer (Web3 & AI) (Job Code: SRDE/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23005",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Senior R&amp;D Engineer (Web3 &amp; AI)</h2>\n<p>Kerala University of Digital Sciences, Innovation and Technology is seeking a Senior R&amp;D Engineer to contribute to research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative (https://kba.ai/). This is a contract-based position for one year.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design and prototype decentralized systems integrating AI/ML models.</li>\n<li>Evaluate emerging technologies in blockchain (e.g., L2 solutions, ZKPs, smart contracts) and AI (e.g., LLMs, RAG).</li>\n<li>Collaborate with cross-functional teams to deliver proof-of-concept and production-ready solutions.</li>\n<li>Contribute to the architecture and implementation of AI-enhanced decentralized platforms, tools, and infrastructure.</li>\n<li>Write clean, maintainable, and well-documented code and research reports.</li>\n<li>Participate in open-source initiatives and technical community engagement related to Web3 and AI.</li>\n<li>Stay updated on the latest industry trends, academic research, and ecosystem advancements.</li>\n</ul>\n<p><strong>Essential Qualifications:</strong></p>\n<ul>\n<li>B.Tech./BE or M.Tech/ME or M.Sc. in Computer Science/IT or MCA with at least 60% marks.</li>\n<li>Minimum two years experience in IT industry/Government Sector/ PSU/State or Central Universities</li>\n</ul>\n<p><strong>Desirable Experience/Preferred Skills:</strong></p>\n<ul>\n<li>At least two years of experience in blockchain technology.</li>\n<li>At least one year of experience in Developing Gen AI/ Machine Learning models with hands-on exposure.</li>\n<li>At least one year of exposure to leveraging AI models into real-world/research opportunities.</li>\n<li>At least two years of experience as full stack developer in Go/NodeJS/Python frameworks</li>\n<li>Deep understanding of decentralized systems, smart contracts, and cryptographic protocols.</li>\n<li>Familiarity with Web3 tools such as IPFS, Ethereum, Polygon, or others.</li>\n</ul>\n<p><strong>Application Details:</strong></p>\n<ul>\n<li>Apply online through the Recruitment Portal.</li>\n<li>Application form available at https://www.duk.ac.in/careers</li>\n<li>Last date to apply: 04.09.2025.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Web3",
            "AI/ML",
            "Blockchain"
        ],
        "summary": "Seeking a Senior R&D Engineer for Web3 & AI projects. Requires 2+ years of IT experience and expertise in blockchain and AI technologies."
    },
    {
        "job_title": "Research Scientist (Projects) (Job Code: RSP/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23004",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Research Scientist (Projects)</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking a Research Scientist to join their team on a contract basis for one year. This role involves working on research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Website:</strong> https://www.duk.ac.in/careers</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain backend applications with microservices architecture.</li>\n<li>Implement best practices for security, scalability, and performance optimization.</li>\n<li>Build reusable components.</li>\n<li>Code implementation using Web services, Web APIs, REST services, HTML, and CSS.</li>\n<li>Develop RESTful APIs and integrate third-party services.</li>\n<li>Database management using MongoDB, PostgreSQL, and MySQL.</li>\n<li>Translate designs and wireframes into high-quality code.</li>\n<li>Development support, maintenance, and implementation of complex project modules.</li>\n<li>Familiarity with CI/CD in cloud environments, including Docker.</li>\n<li>Familiarity with Kubernetes in cloud environments.</li>\n<li>Working knowledge of Git and collaborative development practices.</li>\n</ul>\n<p><strong>Essential Qualifications:</strong></p>\n<ul>\n<li>B.Tech./BE or M.Tech/ME or M.Sc. in Computer Science/IT or MCA with at least 60% marks.</li>\n<li>Minimum 4 years experience in IT industry/Government Sector/ PSU/State or Central Universities.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>At Least 3 years experience in developing Backend systems using Blockchain (Public/Private chains) and Modern technologies in production Environment.</li>\n<li>At least 3 years of development experience in Go and Javascript.</li>\n<li>Knowledge about Web3 wallets and its integration in the backend.</li>\n<li>Experience in frameworks like Go Gin/Fiber.</li>\n<li>Experience in CI/CD &amp; Kubernetes will be an added advantage.</li>\n<li>Excellent written and oral communication skills.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Backend Development",
            "RESTful APIs",
            "Blockchain"
        ],
        "summary": "Seeking a Research Scientist to design, develop, and maintain backend applications, focusing on blockchain technologies. The role requires experience with RESTful APIs and database management."
    },
    {
        "job_title": "Research Scientist(AI) (Job Code RSAI/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23003",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Research Scientist (AI)</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking a Research Scientist (AI) to join their team on a contract basis for one year. This role involves research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Conduct research to stay up-to-date with the latest advances in AI and allied areas.</li>\n<li>Collaborate with cross-functional teams to explore and develop AI opportunities.</li>\n<li>Conduct feasibility studies, develop PoCs, and work with development teams to build functional prototypes.</li>\n<li>Provide technical direction and support during the implementation phase.</li>\n<li>Prepare clear documentation and effectively communicate AI solutions to both technical and non-technical stakeholders.</li>\n<li>Design, develop, and deliver internal training programs, workshops, or seminars.</li>\n<li>Mentor junior researchers, interns, or team members to foster a collaborative and innovative research culture.</li>\n</ul>\n<p><strong>Essential Qualifications &amp; Experience:</strong></p>\n<ul>\n<li>Ph.D in Computer Science and Engineering / Information Technology / Electronics and Communication Engineering / Electrical and Electronics Engineering from a recognized University/Educational Institution.</li>\n<li>A minimum of two years of working experience in the IT industry/Government Sector/ PSU/ State or Central Universities as a Research Engineer / Research and Development Engineer.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>Good publication records, research papers published in well-known journals or top conferences and contributions in research communities/open-source domains.</li>\n<li>Experience in preparing project proposals for diverse funding agencies and government departments.</li>\n<li>Proficiency in machine learning algorithms and deep learning / generative AI architectures, including large language/visual language models and allied technologies.</li>\n<li>Strong communication and presentation abilities required to communicate difficult technological concepts.</li>\n<li>Good programming knowledge in Python with hands-on experience with open-source machine learning /deep learning libraries such as sklearn, pandas, numpy, tensorflow, pytorch.</li>\n<li>Hands-on experience working with Linux operating systems, server machines, and server GPU configurations for training and finetuning deep learning models.</li>\n</ul>\n<p><strong>Application Details:</strong></p>\n<p>Candidates shall apply online through the Recruitment Portal. The guidelines for the submission of applications are available in the portal. Applications shall be submitted online latest on 04.09.2025. The application form is available at https://www.duk.ac.in/careers.</p>\n<p><strong>University Address:</strong></p>\n<p>Kerala University of Digital Sciences, Innovation and Technology\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala , 695317\nhttps://duk.ac.in</p>",
        "tags": [
            "2+ Years",
            "AI",
            "Python",
            "Deep Learning"
        ],
        "summary": "Seeking a Research Scientist (AI) with a Ph.D. and two years of experience. The role involves AI research, collaboration, and technical support for the Kerala Blockchain Academy."
    },
    {
        "job_title": "Research Scientist(Business Analysis) (Job Code RSBA/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23002",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Research Scientist (Business Analysis)</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> is seeking a Research Scientist (Business Analysis) to join their team on a contract basis for one year. This role involves working on research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Essential Qualification and Experience:</strong></p>\n<ul>\n<li>M.Tech/ME or M.Sc. in Computer Science/IT or MCA with at least 60% marks.</li>\n<li>Minimum four years experience in IT industry/Government Sector/ PSU/State or Central Universities in relevant field.</li>\n</ul>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Collaborate with business stakeholders to understand objectives, processes, and requirements.</li>\n<li>Analyze and document business requirements, workflows, and functional specifications.</li>\n<li>Translate business needs into clear technical specifications for developers and IT teams.</li>\n<li>Work closely with project managers, developers, QA teams, and end-users to ensure solutions meet expectations.</li>\n<li>Participate in the design and implementation of technology solutions that improve efficiency and effectiveness.</li>\n<li>Facilitate meetings, workshops, and presentations to share findings and solutions.</li>\n<li>Conduct impact assessments and feasibility studies for new initiatives.</li>\n<li>Assist in system testing, user acceptance testing (UAT), and deployment planning.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>Lead as the Senior Business Analyst for core projects.</li>\n<li>Experience in Agile workflows.</li>\n<li>Experience in long-term product strategies, conducted market analysis, and identified product-market fit to align with business objectives and growth opportunities.</li>\n</ul>\n<p><strong>Application Details:</strong>\nCandidates shall apply online through the Recruitment Portal. Guidelines for submission are available in the portal. The application form is available at https://www.duk.ac.in/careers. Applications must be submitted online by 04.09.2025.</p>\n<p><strong>University Address:</strong>\nKerala University of Digital Sciences, Innovation and Technology\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala , 695317\nhttps://duk.ac.in</p>",
        "tags": [
            "4+ Years",
            "Business Analysis",
            "Agile",
            "Technical Specifications"
        ],
        "summary": "Kerala University seeks a Research Scientist with a strong IT background to analyze business needs and translate them into technical specifications. The role involves collaboration and participation in technology solution design."
    },
    {
        "job_title": "Senior Research Scientist(Blockchain & Web3 Projects) (Job Code SRS/082025/478)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23001",
        "location": "Technopark",
        "closing_date": "04 Sep 2025",
        "job_description": "<h2>Senior Research Scientist (Blockchain &amp; Web3 Projects)</h2>\n<p>Kerala University of Digital Sciences, Innovation and Technology is seeking a Senior Research Scientist for Blockchain &amp; Web3 Projects. This is a contract-based position for one year, focusing on research, consultancy, development, and training activities under the Kerala Blockchain Academy University initiative.</p>\n<p><strong>Contact:</strong> recruitments@duk.ac.in</p>\n<p><strong>Closing Date:</strong> 04, Sept 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead and manage blockchain projects from conception through deployment across public and private blockchain infrastructures.</li>\n<li>Conduct in-depth blockchain research to evaluate emerging technologies, use cases, and innovations.</li>\n<li>Design and implement capacity-building initiatives, including workshops and training sessions.</li>\n<li>Prepare and submit detailed proposals, white papers, and technical documentation.</li>\n<li>Lead the team and supervise overall development activities, including design, code review, testing, and software implementation.</li>\n<li>Delegate work and assignments to team members.</li>\n<li>Collaborate with the team to identify and resolve technical issues.</li>\n<li>Analyze user needs and identify suitable applications.</li>\n<li>Lead research initiatives in Ethereum and other public blockchain networks.</li>\n<li>Define end goals for the team.</li>\n<li>Guide the team through technical challenges and complex tasks.</li>\n</ul>\n<p><strong>Essential Qualification and Experience:</strong></p>\n<ul>\n<li>M.Tech/ME or M.Sc. in Computer Science/IT or MCA with at least 60% marks.</li>\n<li>Minimum 6 years of experience in the IT Industry/Government Sector/ PSU/State or Central Universities, in Blockchain Development/Research.</li>\n</ul>\n<p><strong>Preferred Skills/Desirable Experience:</strong></p>\n<ul>\n<li>At least five years of experience in Public &amp; private Blockchain.</li>\n<li>At least 3 years of experience in Blockchain Project Management/Research activities (Blockchain)/Experience in building or leading capacity-building initiatives or tech-driven knowledge platforms.</li>\n<li>Exposure to national or international collaborations, proposal writing, and coordination of tech-focused events or initiatives.</li>\n</ul>\n<p><strong>Application:</strong></p>\n<p>Candidates shall apply online through the Recruitment Portal. Guidelines for submission are available in the portal. The application form is available at <a href=\"https://www.duk.ac.in/careers\">https://www.duk.ac.in/careers</a>.</p>\n<p><strong>Address:</strong>\nKerala University of Digital Sciences, Innovation and Technology\nTechnopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala , 695317\n<a href=\"https://duk.ac.in\">https://duk.ac.in</a></p>",
        "tags": [
            "6+ Years",
            "Blockchain Development",
            "Ethereum",
            "Project Management"
        ],
        "summary": "Seeking a Senior Research Scientist to lead blockchain projects and research at Kerala University. The role involves managing projects, conducting research, and leading a development team."
    },
    {
        "job_title": "UiPath- RPA Developer [ 3+ Years]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/23000",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>UiPath RPA Developer</h2>\n<p><strong>Alzone Software (P) Ltd</strong> is seeking an experienced UiPath RPA Developer to enhance operational efficiency through automation. The ideal candidate will design, implement, and maintain automation workflows, collaborating with stakeholders and optimizing processes to support business growth.</p>\n<p><strong>Contact:</strong> careers@alzonesoftware.com</p>\n<p><strong>Location:</strong> ACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581. http://www.alzonesoftware.com</p>\n<p><strong>Closing Date:</strong> 29, Aug 2025</p>\n<p><strong>Job Published:</strong> 22, Aug 2025</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Automation Development:</strong> Design, develop, and implement automation workflows using UiPath to streamline business operations.</li>\n<li><strong>Solution Design:</strong> Collaborate with business analysts and stakeholders to understand business requirements and convert them into effective technical solutions.</li>\n<li><strong>Process Optimization:</strong> Identify and recommend areas for automation to improve efficiency, reduce errors, and enhance productivity.</li>\n<li><strong>Testing &amp; Debugging:</strong> Perform thorough testing and debugging of automation solutions to ensure they meet quality standards and function correctly.</li>\n<li><strong>Documentation:</strong> Create and maintain comprehensive documentation for automation processes, including workflows, technical specifications, and user guides.</li>\n<li><strong>Support &amp; Maintenance:</strong> Provide ongoing support and maintenance for deployed automation solutions, troubleshoot issues, and implement updates as needed.</li>\n</ul>\n<h3>Preferred Skills/Requirements:</h3>\n<ol>\n<li><strong>Education:</strong> Bachelor’s degree in computer science, Information Technology, Engineering, or a related field.</li>\n<li><strong>Experience:</strong> Proven 3+ years experience in developing RPA solutions, specifically with UiPath.</li>\n<li><strong>Technical Skills:</strong><ul>\n<li>Proficiency in UiPath for automation design and development.</li>\n<li>Strong understanding of RPA principles and best practices.</li>\n<li>Familiarity with database management and SQL.</li>\n<li>Experience in scripting languages such as Python or JavaScript is a plus.</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong><ul>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Ability to manage multiple projects and work independently.</li>\n</ul>\n</li>\n</ol>\n<p>Interested candidates should share your updated resume to careers@alzonesoftware.com with the subject line \"RPA Developer-Uipath.\"</p>",
        "tags": [
            "3+ Years",
            "UiPath",
            "RPA",
            "Automation"
        ],
        "summary": "Alzone Software is looking for a UiPath RPA Developer to design and implement automation workflows. The role involves optimizing processes and providing ongoing support for automation solutions."
    },
    {
        "job_title": "RPA Developer (Power Automate-Desktop and power app)",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22999",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>RPA Developer (Power Automate - Desktop and Power App)</h2>\n<p><strong>Company:</strong> Alzone Software (P) Ltd\n<strong>Location:</strong> ACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\n<strong>Website:</strong> http://www.alzonesoftware.com\n<strong>Closing Date:</strong> 29, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Power Automate – Cloud Flows</strong></li>\n<li>Design, build, and maintain automated cloud workflows using Power Automate.</li>\n<li>Create approval processes, data syncs, and email/task automation using connectors like Outlook, SharePoint, Excel, Teams, Planner, and SQL.</li>\n<li>Use condition controls, expressions, loops, and error handling to ensure robust automation.</li>\n<li>Integrate Power Automate with Power Apps and Microsoft 365 services.</li>\n<li><strong>Power Automate Desktop (PAD – RPA)</strong></li>\n<li>Develop desktop automation (attended/unattended) using PAD.</li>\n<li>Automate manual, repetitive desktop tasks involving Excel, legacy apps, PDFs, browsers, or desktop software.</li>\n<li>Implement UI automation, web scraping, and error handling techniques.</li>\n<li>Use input/output variables, subflows, and scripting for advanced logic.</li>\n<li><strong>Power Apps – Canvas Apps</strong></li>\n<li>Design and build Canvas apps using Power Fx formulas, galleries, collections, and controls.</li>\n<li>Connect to data sources like SharePoint, Excel, Dataverse, or SQL Server.</li>\n<li>Implement dynamic forms, filtering, sorting, search, and offline capability (if needed).</li>\n<li>Ensure good user experience (UX) with responsive layouts and intuitive navigation.</li>\n<li><strong>Data Integration &amp; Business Logic</strong></li>\n<li>Work with Microsoft Dataverse, SharePoint Lists, or Excel Tables to manage app/flow data.</li>\n<li>Configure business rules, validations, and dynamic behavior in apps and flows.</li>\n<li>Implement role-based access control and data visibility using Power Apps/Automate permissions.</li>\n<li><strong>Collaboration &amp; Project Delivery</strong></li>\n<li>Work directly with stakeholders or business teams to gather requirements and provide demos.</li>\n<li>Translate business processes into technical flow diagrams and working apps/flows.</li>\n<li>Document app designs, flow logic, and provide basic user guides or support material.</li>\n<li>Provide maintenance and troubleshooting for existing automations and apps.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Automation:</strong> Power Automate Cloud, Power Automate Desktop</li>\n<li><strong>App Development:</strong> Power Apps (Canvas), Power Fx</li>\n<li><strong>Data Sources:</strong> SharePoint, Excel, Dataverse, SQL, OneDrive</li>\n<li><strong>Other Skills:</strong> REST APIs, JSON, Office 365 integration</li>\n<li><strong>Soft Skills:</strong> Problem-solving, stakeholder communication, documentation</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>📧 Interested? Share your resume with careers@alzonesoftware.com using the subject line: \"Application for RPA-Power Automate Position\".</p>",
        "tags": [
            "Unspecified Experience",
            "Power Automate",
            "Power Apps",
            "RPA"
        ],
        "summary": "Alzone Software is seeking an RPA Developer to design, build, and maintain automated workflows using Power Automate and Power Apps. Responsibilities include developing desktop automations, integrating data, and collaborating with stakeholders."
    },
    {
        "job_title": "Business Analyst [ 4 years and above]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22998",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p>Alzone Software (P) Ltd is seeking an experienced Business Analyst to join our team in Trivandrum.</p>\n<p><strong>Contact:</strong> careers@alzonesoftware.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Requirement Gathering &amp; Analysis:</strong></li>\n<li>Work closely with business stakeholders to understand their needs, objectives, and pain points.</li>\n<li>Elicit, document, and analyze business requirements, workflows, and processes.</li>\n<li>\n<p>Translate business needs into clear, concise functional specifications for the development team.</p>\n</li>\n<li>\n<p><strong>Solution Design &amp; Implementation:</strong></p>\n</li>\n<li>Collaborate with technology teams to propose practical and innovative solutions.</li>\n<li>Ensure alignment of solutions with organizational strategy and technological capabilities.</li>\n<li>\n<p>Assist in defining project scope, objectives, and deliverables.</p>\n</li>\n<li>\n<p><strong>Stakeholder Communication:</strong></p>\n</li>\n<li>Act as a bridge between business teams and technical teams.</li>\n<li>Present findings, recommendations, and project updates to key stakeholders.</li>\n<li>\n<p>Simplify complex technical concepts for non-technical audiences.</p>\n</li>\n<li>\n<p><strong>Documentation &amp; Quality Assurance:</strong></p>\n</li>\n<li>Create detailed documentation, including business requirements, process flows, use cases, and user stories.</li>\n<li>Ensure accuracy and maintenance of project documentation.</li>\n<li>\n<p>Support system testing, user acceptance testing, and solution validation.</p>\n</li>\n<li>\n<p><strong>Process Improvement &amp; Risk Management:</strong></p>\n</li>\n<li>Identify areas for process optimization and efficiency enhancement.</li>\n<li>Recommend and assist in implementing process improvements.</li>\n<li>Monitor project progress, identify risks, and suggest mitigation strategies.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business Administration, Information Technology, or a related field (Master’s degree is a plus).</li>\n<li>Minimum 4 years and above of relevant experience as a Business Analyst.</li>\n<li>Strong analytical, problem-solving, and critical-thinking skills.</li>\n<li>Excellent communication and stakeholder management abilities.</li>\n<li>Proficiency in requirement gathering techniques, process modeling, and documentation.</li>\n<li>Familiarity with project management methodologies and the software development lifecycle (SDLC).</li>\n<li>Experience with tools like JIRA, Confluence, Microsoft Visio, etc.</li>\n<li>Business Analysis certification (CBAP, CCBA) is a plus.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>If you are interested, please send your updated CV to careers@alzonesoftware.com with the subject line \"Business Analyst\".</p>\n<p>Join us and be a part of a dynamic team driving business success!</p>\n<p><strong>Contact Information:</strong></p>\n<p>Alzone Software (P) Ltd\nACE 04, 3rd Floor, CDAC Building, Technopark Campus,\nKerala, India, 695581\nhttp://www.alzonesoftware.com</p>",
        "tags": [
            "4+ Years",
            "Business Analysis",
            "JIRA",
            "Confluence"
        ],
        "summary": "Alzone Software is hiring a Business Analyst to gather requirements and design solutions. The role involves stakeholder communication, documentation, and process improvement to drive business success."
    },
    {
        "job_title": "Business Development Manager [ 5 Years and above]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22997",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p><strong>Alzone Software (P) Ltd</strong> is seeking a Business Development Manager with 5+ years of experience to drive business growth in Digital Transformation Technologies.</p>\n<p><strong>Location:</strong> Trivandrum (Work From Office)\n<strong>Shift:</strong> Normal</p>\n<h3>Job Summary</h3>\n<p>We are seeking an experienced Business Development Manager with expertise in Digital Transformation Technologies, including Data Analytics, AI Platforms, and Web Development Services. The role focuses on driving business growth, building strong client relationships, and managing international sales in industries such as Supply Chain/Logistics, Pharma/Healthcare, and Banking/Finance.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Business Development: Formulate strategies to identify and secure new business opportunities in the Digital Transformation domain.</li>\n<li>Client Engagement: Build and maintain relationships with CXOs, acting as a trusted advisor for IT consulting and digital transformation solutions.</li>\n<li>Revenue Generation: Drive consistent revenue growth, meeting and exceeding sales targets with a proven track record of high-value deals.</li>\n<li>Sales Execution: Manage the complete sales cycle, including lead generation, proposal development, and contract negotiations.</li>\n<li>Market Insights: Conduct research to identify market trends, competitive landscape, and new business opportunities.</li>\n<li>Collaboration: Partner with internal teams to deliver tailored client solutions and align with organizational goals.</li>\n<li>Negotiation: Lead high-value contract negotiations, ensuring mutually beneficial agreements.</li>\n</ul>\n<h3>Preferred Skills/Qualifications</h3>\n<ul>\n<li>Education: Bachelor’s degree in Computer Science/IT (MBA preferred).</li>\n<li>Experience: 5+ years in IT/Software business development, focusing on Digital Transformation and Web Development Services.</li>\n<li>Revenue Generation History: Proven ability to deliver measurable revenue growth, supported by a verifiable record of successful deals and their impact on organizational growth.</li>\n<li>International Sales: Expertise in global markets, with a strong network of CXO-level contacts and experience navigating diverse business environments.</li>\n<li>Industry Expertise: In-depth understanding of Supply Chain/Logistics, Pharma/Healthcare, and Banking/Finance verticals</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@alzonesoftware.com</p>\n<p><strong>How to Apply:</strong>\nSend your resume to careers@alzonesoftware.com with the subject line: \"Application for Business Development Manager.\"</p>\n<p><strong>Closing Date:</strong> 29, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>",
        "tags": [
            "5+ Years",
            "Digital Transformation",
            "Web Development",
            "Data Analytics"
        ],
        "summary": "Alzone Software is hiring a Business Development Manager to drive growth in digital transformation, focusing on client relationships and international sales. The ideal candidate will generate revenue and provide IT consulting."
    },
    {
        "job_title": "Sales & Marketing Intern [ MBA Fresher ]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/22996",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>Sales &amp; Marketing Intern</h2>\n<p><strong>Alzone Software (P) Ltd</strong> is seeking energetic and driven Sales &amp; Marketing Interns to join our team.</p>\n<p><strong>Location:</strong> Technopark, Trivandrum\n<strong>Duration:</strong> 3 Months\n<strong>Work Mode:</strong> Offline\n<strong>Stipend:</strong> Unpaid (Performance-based conversion to full-time with salary based role)\n<strong>Eligibility:</strong> Only for pass-out candidates (Candidates from Kerala preferred)</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Cold calling and lead generation</li>\n<li>Assisting in sales and marketing strategies</li>\n<li>Managing and growing social media presence</li>\n<li>Supporting campaign planning and execution</li>\n<li>Maintaining CRM and client databases</li>\n<li>Collaborating with internal teams for content and strategy development</li>\n<li>Participating in brainstorming and team meetings</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong verbal and written communication skills</li>\n<li>Basic understanding of digital marketing and social media platforms (LinkedIn, Instagram, etc.)</li>\n<li>Proficiency in MS Office tools</li>\n<li>Ability to work independently and handle multiple tasks</li>\n<li>Passion for sales, marketing, and client engagement</li>\n<li>Energetic, proactive, and a quick learner</li>\n<li>Familiarity with market research and competitor analysis is a plus</li>\n</ul>\n<p>Successful interns may be offered a <strong>full-time salaried role</strong> based on performance after the internship.</p>\n<p><strong>How to Apply:</strong>\nInterested candidates can send their updated CVs to careers@alzonesoftware.com\n<strong>Subject Line:</strong> Application for Sales and Marketing Intern – [Your Name]</p>\n<p><strong>Contact Email:</strong> careers@alzonesoftware.com\n<strong>Closing Date:</strong> 29, Aug 2025</p>",
        "tags": [
            "MBA Fresher",
            "Digital Marketing",
            "Social Media",
            "CRM Management"
        ],
        "summary": "Alzone Software is looking for a Sales & Marketing Intern to assist in lead generation, social media growth, and campaign execution. This offline internship in Trivandrum may convert to a full-time role."
    },
    {
        "job_title": "Angular.js Developer: Immediate Joiners Preferred",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/22995",
        "location": "Technopark",
        "closing_date": "29 Aug 2025",
        "job_description": "<h2>iBoson Innovations - Angular.js Developer</h2>\n<p><strong>Location:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.iboson.io\">http://www.iboson.io</a></p>\n<p><strong>About iBoson Innovations:</strong>\nAt iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to create next-generation solutions. We are expanding our team and looking for skilled Frontend Developers to join us.</p>\n<p><strong>Job Description:</strong>\nWe are seeking a skilled Frontend Developer with strong expertise in Angular, React, or Vue.js, along with solid knowledge of JavaScript, HTML, and CSS. A good understanding of responsive web design and SEO best practices is essential. The ideal candidate should be comfortable building user interfaces that work seamlessly across various devices and screen sizes.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Build and maintain responsive, interactive web interfaces using HTML5, CSS3, JavaScript, Angular, React, and Vue.js.</li>\n<li>Collaborate with backend developers to integrate RESTful APIs and ensure robust application performance.</li>\n<li>Implement UI/UX designs with a focus on accessibility, cross-browser compatibility, and mobile-first principles.</li>\n<li>Write clean, scalable, and well-documented code adhering to industry standards.</li>\n<li>Optimize web applications for speed, scalability, and SEO best practices.</li>\n<li>Troubleshoot and resolve complex frontend issues to enhance functionality and user satisfaction.</li>\n<li>Stay updated with the latest web development trends and technologies.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 5 years of professional experience in frontend development.</li>\n<li>Strong proficiency in JavaScript (ES6+), HTML5, and CSS3.</li>\n<li>Proven expertise in Angular.js, React.js, and Vue.js for developing dynamic, component-based applications.</li>\n<li>Understanding of SEO principles and how to apply them to web applications.</li>\n<li>Experience in creating user-friendly, accessible, and performant websites.</li>\n<li>Experience with responsive and adaptive design techniques.</li>\n<li>Proficiency with Git for version control and collaborative development.</li>\n<li>Solid understanding of web performance optimization and debugging tools (e.g., Chrome DevTools).</li>\n<li>Excellent problem-solving skills and ability to work in a fast-paced, collaborative environment.</li>\n<li>Experience with testing frameworks such as Jest and Mocha.</li>\n</ul>\n<p><strong>Nice to Have / Added Advantage:</strong></p>\n<ul>\n<li>Experience with Tailwind CSS or Bootstrap.</li>\n<li>Knowledge of WebGL or 3D-related frameworks like Three.js.</li>\n<li>Familiarity with CSS preprocessors (e.g., SASS, LESS) or CSS-in-JS (e.g., styled-components).</li>\n<li>Knowledge of TypeScript for type-safe JavaScript development.</li>\n<li>Exposure to UI/UX tools (e.g., Figma) for design collaboration.</li>\n</ul>\n<p>Be part of a team that thrives on innovation and problem-solving. At iBoson, you’ll work with emerging AR &amp; AI technologies, contribute to impactful projects, and grow in a collaborative and tech-driven environment. If you're ready to take on exciting challenges, we’d love to hear from you!</p>\n<p><strong>Contact:</strong>\ncareer@ibosoninnov.com</p>\n<p><strong>Closing Date:</strong> 29, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025</p>",
        "tags": [
            "5+ Years",
            "Angular.js",
            "JavaScript",
            "HTML5"
        ],
        "summary": "iBoson Innovations is seeking an Angular.js Developer to build interactive web interfaces. The role involves collaborating with backend developers and optimizing web applications for performance and SEO."
    },
    {
        "job_title": "QA Engineer",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/22994",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>QA Engineer</h2>\n<p><strong>Cloud Nautical Solutions India Pvt Ltd</strong>\nModule No.K12 ,2nd Floor,Kabani Building\nTechnocity , Phase 4 Technopark\nTrivandrum, Kerala , India , 695317\n<a href=\"https://www.cloudnautical.com\">https://www.cloudnautical.com</a></p>\n<p><strong>Closing Date:</strong> 19, Sept 2025\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> careers@cloudnautical.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Creation of test designs, test processes, test cases, and test data.</li>\n<li>Carry out testing as per the defined procedures.</li>\n<li>Develop and maintain test scripts and automation frameworks for regression testing.</li>\n<li>Report defects and track their resolution throughout the testing process.</li>\n<li>Participate in sprint planning meetings to provide input on testing efforts and timelines.</li>\n<li>Reporting Bugs by Tools.</li>\n<li>Verifying bugs and updating the status.</li>\n<li>Functional Testing &amp; Regression Testing.</li>\n<li>Write release notes.</li>\n<li>Experience in Selenium (with Javascript) and Playwright (Javascript or Typescript) automation tool.</li>\n<li>Experience in API testing using Postman</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proven experience in manual testing of web or mobile applications</li>\n<li>Knowledge of software development life cycle (SDLC) and agile methodologies</li>\n<li>Excellent knowledge in Software development and Test life cycle activities</li>\n<li>Working knowledge of test techniques and compatibility with various software programs</li>\n<li>Good organizational skills and detail-oriented mindset</li>\n<li>Experience in API testing</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Selenium",
            "Playwright",
            "API Testing"
        ],
        "summary": "Cloud Nautical Solutions is seeking a QA Engineer to create and execute test strategies. The role involves manual and automated testing, bug reporting, and collaboration within agile teams."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22993",
        "location": "Technopark",
        "closing_date": "23 Aug 2025",
        "job_description": "<h2>Telesales Executive - Walk-In Interview</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\nwww.trainonexsolutions.in</p>\n<p><strong>Walk-In Date:</strong> August 23, 2025\n<strong>Time:</strong> 10:30 AM - 12:30 PM\n<strong>Job Published:</strong> August 22, 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for handling sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li>Experience: 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Have fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\n- Customer interaction\n- Communication\n- Time management</p>\n<p><strong>Walk-In Venue:</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1,\nTECHNOPARK CAMPUS PHASE 1,\nTRIVANDRUM, KERALA, 695581</p>\n<h3>Walk-In Entry Pass</h3>\n<p>Candidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App</strong>\n- Click here to download the Mobile App for Android\n- Click here to download the Mobile App for iOS</p>\n<p><strong>Website URL</strong>\nvms.technopark.org\n- Click here for the User Manual</p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Communication",
            "Customer Interaction"
        ],
        "summary": "Trainonex Solutions is hiring a Telesales Executive to drive sales and build customer relationships. This role involves identifying leads, closing deals, and requires fluency in Malayalam."
    },
    {
        "job_title": "Learning & Development Specialist",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22992",
        "location": "Technopark",
        "closing_date": "25 Aug 2025",
        "job_description": "<h2>Learning &amp; Development Specialist</h2>\n<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\n<a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a></p>\n<p><strong>Closing Date:</strong> 25, Aug 2025\n<strong>Job Published:</strong> 22, Aug 2025\n<strong>Contact Email:</strong> careers@polussolutions.com</p>\n<h3>About Polus:</h3>\n<p>At Polus Solutions, we empower our teams through continuous learning and development. We design and deliver impactful learning programs to enhance skills, knowledge, and performance across the organization.</p>\n<h3>Role Description:</h3>\n<p>We are seeking a Learning &amp; Development Specialist to design, deliver, and manage training programs that help employees build critical skills and improve performance. This role requires collaboration with managers, subject matter experts, and the L&amp;D team to ensure learning programs are effective, measurable, and aligned with business goals.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design and deliver training programs (technical, functional, and soft skills) aligned with organizational goals.</li>\n<li>Conduct training needs analysis and identify skill gaps across teams.</li>\n<li>Develop training materials, including presentations, handouts, e-learning modules, and assessment tools.</li>\n<li>Coordinate and manage the end-to-end training process, including scheduling, logistics, and participant communication.</li>\n<li>Administer post-training assessments and analyze results to measure effectiveness.</li>\n<li>Collaborate with managers to monitor on-the-job application of learned skills.</li>\n<li>Maintain and update the training tracker and generate reports on learning outcomes, participation, and impact.</li>\n<li>Support employee development initiatives, onboarding programs, and learning campaigns.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in HR, Business Administration, Education, or related field.</li>\n<li>2-4 years of experience in corporate learning, training, or talent development.</li>\n<li>Strong instructional design and facilitation skills.</li>\n<li>Familiarity with LMS platforms and learning technologies.</li>\n<li>Excellent communication, presentation, and interpersonal skills.</li>\n<li>Strong organizational skills and ability to manage multiple programs simultaneously.</li>\n<li>Experience in technical or software development training.</li>\n<li>Knowledge of learning measurement methods (Kirkpatrick Model, assessments, ROI).</li>\n<li>Project management experience in L&amp;D initiatives.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume to careers@polussolutions.com. Please include “Learning &amp; Development Specialist - [Your Name]” in the subject line.</p>",
        "tags": [
            "2-4 Years",
            "Instructional Design",
            "LMS Platforms",
            "Training Programs"
        ],
        "summary": "Polus Solutions is looking for a Learning & Development Specialist to create and manage training programs. The role involves designing training, assessing needs, and collaborating with managers to enhance employee skills."
    },
    {
        "job_title": "Walk In Drive - Genrobotic Innovations Private Limited",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/22990",
        "location": "Technopark",
        "closing_date": "23 Aug 2025",
        "job_description": "<h2>Walk-In Drive - Genrobotic Innovations Private Limited</h2>\n<p><strong>Genrobotic Innovations</strong> is hiring passionate and talented individuals for multiple roles. This is an excellent opportunity to work in a dynamic environment where technology meets purpose.</p>\n<p><strong>Walk-In Interview Details:</strong>\n- <strong>Date:</strong> August 23, 2025 (Saturday)\n- <strong>Time:</strong> 9:30 AM - 12:00 PM\n- <strong>Location:</strong> Genrobotics, 4th floor, CDAC Building, Technopark Phase1, Trivandrum.</p>\n<p><strong>Open Positions:</strong></p>\n<ul>\n<li>Mechanical Design Intern</li>\n<li>Control System Intern</li>\n<li>HR Intern (Training &amp; Development)</li>\n<li>HR Recruiter Intern</li>\n<li>Service Engineer Intern</li>\n<li>Documentation Intern</li>\n<li>Operation Assistant</li>\n<li>Marketing Associate Intern</li>\n<li>Content Writer Intern</li>\n<li>Client Relations Intern</li>\n<li>Mechanical Design Engineer (1-2 Years)</li>\n<li>Mechatronics Intern</li>\n<li>Graphic and UI/UX Design Intern</li>\n<li>Project Associate Intern</li>\n</ul>\n<p><strong>Preferred Skills and Qualifications:</strong></p>\n<p>| Position                       | Qualification                        | Skills Required                                                                 |\n| ------------------------------ | ------------------------------------ | ------------------------------------------------------------------------------- |\n| Mechanical Design Intern       | B.Tech - Mechanical Engineering      | Designing Skill, Material Identification                                        |\n| Control System Intern          | B.Tech - Electrical Engineering / Robotics | MATLAB, ROS                                                                     |\n| HR Intern (Training &amp; Development) | MBA - HR                             | Good Communication &amp; Interpersonal Skills, &amp; Proactiveness                      |\n| HR Recruiter Intern            | MBA - HR                             | Communication &amp; Interpersonal Skills, Proficiency in Hindi                      |\n| Service Engineer Intern        | Diploma / B.Tech - EEE                 | MATLAB                                                                          |\n| Documentation Intern           | Any Degree                           | Proficiency In Excel                                                              |\n| Operation Assistant            | Any Degree                           | Proficiency In Excel, Communication                                             |\n| Marketing Associate Intern     | Any Degree                           | Communication, Research Skill                                                     |\n| Content Writer Intern          | BA / MA Literature                   | Creative Content Writing, Storytelling, Research Skill                             |\n| Client Relations Intern        | Any Degree                           | Communication, Proficiency in English &amp; Hindi                                   |\n| Mechanical Design Engineer     | B.Tech - Mechanical Engineering      | Solidworks, Theoretical Skills                                                    |\n| Mechatronics Intern            | B.Tech - Mechatronics                | Programming Skills, Understanding of Sensors &amp; Actuators                          |\n| Graphic and UI/UX Design Intern | Any Degree                           | Figma, Adobe Creative Suite (Photoshop, Illustrator, XD)                         |\n| Project Associate Intern       | MBA                                  | Good Communication &amp; Interpersonal Skills, Proficiency in project management software |</p>\n<p><strong>What to Bring:</strong>\n- Calculator (for written test)\n- Hard copies of your Resume, Portfolio (if available), and Educational Certificates</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates must apply for an entry pass to Technopark Campus via the mobile app or web browser. The entry pass will be sent to the registered mobile number/email ID. A soft copy of the pass can be shown on your gadgets at the Technopark Entrance Gate. Candidates without a smartphone can print a hard copy of the entry pass from the self-operating Kiosks at the Reception Building near the TECHNOPARK Main Gate using the OTP received via SMS/email.</p>\n<ul>\n<li><strong>Mobile App:</strong></li>\n<li><a href=\"https://play.google.com/store/apps/details?id=com.technopark.vms\">Android App</a></li>\n<li><a href=\"https://apps.apple.com/in/app/technopark-vms/id1537551007\">iOS App</a></li>\n<li><strong>Website URL:</strong> <a href=\"http://vms.technopark.org/\">vms.technopark.org</a></li>\n<li><a href=\"http://vms.technopark.org/assets/pdf/Visitor%20Management%20System%20User%20Manual.pdf\">User Manual</a></li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong>\n- <strong>Email:</strong> career@genrobotics.org\n- <strong>Phone:</strong> 9778691972\n- <strong>Website:</strong> <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a>\n- <strong>Address:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581</p>\n<p><strong>Register Now:</strong> <a href=\"https://example.com/registration\">Click here to Register</a></p>\n<p>Be part of something impactful. Let's build the future together!</p>",
        "tags": [
            "1-2 Years",
            "MATLAB",
            "Solidworks",
            "Communication"
        ],
        "summary": "Genrobotics is hiring for multiple intern and engineer positions at their Trivandrum office. They're holding a walk-in interview on August 23, 2025."
    },
    {
        "job_title": "Python Django Developers",
        "company": "Ainsurtech (P) Ltd",
        "url": "https://technopark.org/job-details/22989",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Python Django Developers</h2>\n<p><strong>AInsurtech Private Limited</strong></p>\n<p>Module #2705, Yamuna Building, Phase III, Technopark, 695583\n<a href=\"https://www.ainsurtek.com\">https://www.ainsurtek.com</a></p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking Python Django Developers with experience in the following areas:</p>\n<ul>\n<li>Python (Django)</li>\n<li>PostgreSQL</li>\n<li>Familiarity with RESTful API development</li>\n<li>HTML, CSS</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>6 months - 2 years hands-on experience</li>\n<li>Location: Trivandrum</li>\n<li>Knowledge is an added advantage</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Email: hr@ainsurtek.com</p>\n<p><strong>Important Dates:</strong></p>\n<ul>\n<li>Job Published: August 21, 2025</li>\n<li>Closing Date: September 22, 2025</li>\n</ul>",
        "tags": [
            "6 months-2 Years",
            "Python",
            "Django",
            "PostgreSQL"
        ],
        "summary": "AInsurtech is seeking Python Django Developers. The role involves Python, Django, PostgreSQL, RESTful API development, HTML, and CSS, with 6 months to 2 years of experience."
    },
    {
        "job_title": ".NET Developers",
        "company": "Ainsurtech (P) Ltd",
        "url": "https://technopark.org/job-details/22988",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>.NET Developers</h2>\n<p><strong>AInsurtech Private Limited</strong>\nModule #2705, Yamuna Building, Phase III, Technopark, 695583\n<a href=\"https://www.ainsurtek.com\">https://www.ainsurtek.com</a></p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 21, Aug 2025</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Net Core</li>\n<li>MySQL/Oracle/MS SQL</li>\n<li>Nice to have experience in Web API Development, HTML, CSS, JavaScript</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>6 months - 2 years hands-on experience</li>\n</ul>\n<p><strong>Location:</strong> Trivandrum</p>\n<p><strong>Contact Email:</strong> hr@ainsurtek.com</p>",
        "tags": [
            "6 months-2 Years",
            ".NET Core",
            "MySQL",
            "Web API"
        ],
        "summary": "AInsurtech is seeking a .NET Developer with 6 months to 2 years of experience. The role involves Net Core development and database management, located in Trivandrum."
    },
    {
        "job_title": "UI Developer",
        "company": "Twinsway Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22986",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>UI Developer</h2>\n<p><strong>Twinsway Technologies (P) Ltd</strong>\nNila Building, Module No 643 6th Floor, Technopark Phase 1, Kazhakootam, 695581\n<a href=\"http://www.twinsway.com\">http://www.twinsway.com</a></p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 21, Aug 2025\n<strong>Contact Email:</strong> hr@twinsway.in</p>\n<p>We are looking for a UI Developer to join our team at Twinsway Technologies, Technopark, Trivandrum. The ideal candidate should have strong expertise in front-end technologies and the ability to work on both web and mobile applications.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Developing and maintaining web applications using React and JavaScript</li>\n<li>Work on mobile applications using React Native</li>\n<li>Ensuring responsive design and cross-platform compatibility</li>\n<li>Collaborating with designers and backend developers to deliver user-friendly solutions</li>\n<li>Ability to self-learn and adapt to new requirements</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proficiency in React Native, JavaScript, React, HTML, and CSS.</li>\n<li>Knowledge in Angular and Phaser.js will be an added advantage.</li>\n<li>Strong problem-solving and debugging skills</li>\n</ul>\n<h1>ImmediateJoinersPreferred</h1>",
        "tags": [
            "2-3 Years",
            "React Native",
            "React",
            "JavaScript"
        ],
        "summary": "Twinsway Technologies is seeking a UI Developer with expertise in front-end technologies for web and mobile applications. Proficiency in React Native, JavaScript, and React is preferred."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/22985",
        "location": "Technopark",
        "closing_date": "24 Aug 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Picky Assist Pvt Ltd (Kerala Startup Mission)</strong>\nT-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<p><strong>Contact:</strong> careers@pickyassist.com</p>\n<p><strong>Closing Date:</strong> 24, Aug 2025\n<strong>Job Published:</strong> 21, Aug 2025</p>\n<p><strong>Job Type:</strong> Full Time - On-Site</p>\n<p><strong>Salary:</strong> ₹20,000/month (Basic Salary + Incentive) for MBA graduates of 2024 and 2025\n<em>(Salary will depend on work experience and interview performance for candidates with a minimum of 1 year of experience in sales. MBA is not mandatory in that case)</em></p>\n<p><strong>Number of Vacancies:</strong> 5</p>\n<p><strong>Location:</strong> Edapazhanji, Trivandrum</p>\n<p><strong>Work Timings:</strong> 10 am to 06 pm, Monday to Saturday</p>\n<p>Preference will be given to candidates based in Trivandrum or those willing to relocate.</p>\n<h3>Responsibilities and Duties</h3>\n<ul>\n<li>Dealing with clients all over the world</li>\n<li>Finding New Prospective (Generating Leads can be found everywhere from small shops to big MNCs)</li>\n<li>Fixing Appointment (Online Meeting)</li>\n<li>Preparing Customised Presentations (Solutions)</li>\n<li>Giving Demo (Google Meet, Zoom)</li>\n<li>Participating in Seminars &amp; Exhibitions (Networking)</li>\n<li>Closing Sales &amp; Generating Revenue (Numbers matter)</li>\n<li>Follow up with Customers (Never Quit)</li>\n<li>First Level Training (After Sales)</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>A bit of background and understanding of how technology works in a business</li>\n<li>Must have completed MBA (BBA/B Tech with MBA candidates can also apply)</li>\n<li>Good Communication Skills (Fluency in English Mandatory)</li>\n<li>Preference to candidates knowing any international languages</li>\n<li>Ability to Convince No to Yes</li>\n<li>Preference to candidates with a minimum of 1 year of experience in sales</li>\n<li>Freshers with Go-Getting Attitude Can also apply</li>\n<li>Willingness to learn every day</li>\n<li>All candidates must be fluent in English and the Local Language</li>\n<li>Preference will be given to candidates who can communicate in any foreign language</li>\n<li>Linguistic Skills</li>\n</ul>\n<h3>What We Offer:</h3>\n<p>Our company provides a positive working environment with personal and professional growth opportunities. We guarantee a future-proof job and a commitment to annual salary increments based on performance. We believe in recognizing the hard work of our employees and offer numerous opportunities for career progression.</p>\n<p>If you are passionate about business development, sales, and technology and want to be part of a team that strives for excellence, we would love to hear from you.</p>\n<h3>How to Apply</h3>\n<p>Send your CV to careers@pickyassist.com or WhatsApp <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></p>\n<h3>Benefits</h3>\n<ul>\n<li>Mobile &amp; Data Allowance</li>\n<li>Sales Incentive based on performance</li>\n<li>Flexible Shift Timings</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Business Development",
            "Sales",
            "Communication Skills"
        ],
        "summary": "Picky Assist is hiring a Business Development Executive. Responsibilities include client interaction, lead generation, presentations, and sales, with a focus on candidates with sales experience or recent MBA graduates."
    },
    {
        "job_title": "Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/22984",
        "location": "Technopark",
        "closing_date": "25 Aug 2025",
        "job_description": "<h2>Way.Com India Pvt Ltd - Walk-In Customer Success Executive</h2>\n<p><strong>About Us</strong></p>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. We leverage AI, machine learning, and advanced data analytics to deliver personalized solutions, making car ownership easier and more rewarding. We have been featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list.</p>\n<p><strong>Role Overview</strong>:</p>\n<p>We are looking for a dedicated Customer Support Executive to join our team. In this role, you will be the first point of contact for our customers, ensuring they receive prompt, helpful, and courteous assistance.</p>\n<p><strong>Key Responsibilities</strong>:</p>\n<ul>\n<li>Address customer queries through phone, email, chat, and social media channels.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to products, orders, returns, and general support requests.</li>\n<li>Maintain accurate customer records and feedback in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking customer satisfaction metrics and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<p><strong>Preferred Skills</strong>:</p>\n<ul>\n<li>Proven experience in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment</li>\n</ul>\n<p><strong>Walk-In Details</strong>:</p>\n<ul>\n<li><strong>Location</strong>: Way.com, 4th floor, Technopark Phase - 3, Thiruvananthapuram</li>\n<li><strong>Date</strong>: 25, Aug 2025</li>\n<li><strong>Time</strong>: 10:00 AM to 12:00 PM</li>\n<li><strong>Experience</strong>: 0 - 2 years</li>\n</ul>\n<p><strong>Walk-In Entry Pass</strong>:</p>\n<p>Candidates must apply for an entry pass to Technopark Campus via the mobile app or web browser.</p>\n<ul>\n<li><strong>Mobile App</strong>:</li>\n<li><a href=\"Mobile AppClick here to download the Mobile App for Android\">Android</a></li>\n<li><a href=\"Mobile AppClick here to download the Mobile App for iOS\">iOS</a></li>\n<li><strong>Website URL</strong>: <a href=\"vms.technopark.org\">vms.technopark.org</a></li>\n<li><a href=\"Click here for the User Manual\">User Manual</a></li>\n</ul>\n<p><strong>Note</strong>: Original certificates will be verified at the Entry Gate.</p>\n<p><strong>Contact Information</strong>:</p>\n<ul>\n<li><strong>Email</strong>: careers@way.com</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Customer Service",
            "CRM Systems",
            "Communication Skills"
        ],
        "summary": "Way.com is hiring a Customer Support Executive to address customer queries and resolve concerns. The role requires excellent communication skills and a customer-first attitude."
    },
    {
        "job_title": "Website Developer – Trainee",
        "company": "Alp Turnkey Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22983",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Website Developer – Trainee</h2>\n<p><strong>Alp Turnkey Solutions (P) LTD</strong>\nModule No.5, 4th floor, Gayatri Building, Phase I, Technopark , 695581\n<a href=\"https://www.alp-ts.com\">https://www.alp-ts.com</a></p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 21, Aug 2025\n<strong>Contact Email:</strong> info@alp-ts.com</p>\n<p><strong>About Us:</strong>\nWe specialize in building interactive websites and enterprise-level applications. We are offering freshers an opportunity to gain professional experience in web technologies through structured training and real projects.</p>\n<p><strong>Key Responsibilities:</strong>\n- Learn and work on website design and development.\n- Work with HTML, CSS, JavaScript, and modern frameworks.\n- Support senior developers in live projects.\n- Test and improve front-end and back-end functionalities.</p>\n<p><strong>Eligibility:</strong>\n- Fresh graduates passionate about web development.\n- Knowledge of HTML, CSS, JavaScript (basic) preferred.\n- Strong problem-solving ability and eagerness to learn.</p>\n<p><strong>Training &amp; Stipend:</strong>\n- 1st Month: Training (No Salary)\n- Next 6 Months: Stipend of ₹5,000/month\n- Post Training: Attractive salary package based on performance</p>\n<p><strong>How to Apply:</strong>\nSend your resume to info@alp-ts.com with subject line “Application – Website Developer Trainee”.</p>\n<p><strong>Preferred Skills/Eligibility:</strong>\n- Fresh graduates passionate about web development.\n- Knowledge of HTML, CSS, JavaScript (basic) preferred.\n- Strong problem-solving ability and eagerness to learn.</p>",
        "tags": [
            "0 Years",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "summary": "Alp Turnkey Solutions is offering a Website Developer Trainee position for fresh graduates. This role involves learning web development, working with modern frameworks, and supporting senior developers."
    },
    {
        "job_title": "Flutter Developer – Trainee",
        "company": "Alp Turnkey Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22982",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Flutter Developer – Trainee</h2>\n<p><strong>Alp Turnkey Solutions (P) LTD</strong>\nModule No.5, 4th floor, Gayatri Building, Phase I, Technopark, 695581\n<a href=\"https://www.alp-ts.com\">https://www.alp-ts.com</a></p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 21, Aug 2025\n<strong>Contact Email:</strong> info@alp-ts.com</p>\n<p><strong>About Us:</strong>\nWe are building advanced mobile applications for education and enterprise. We are inviting freshers who are passionate about Flutter development and want to grow with hands-on experience and mentorship.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Learn and develop mobile applications using Flutter.</li>\n<li>Assist in building cross-platform apps (Android &amp; iOS).</li>\n<li>Debug, test, and improve application performance.</li>\n<li>Work closely with the design and backend teams.</li>\n</ul>\n<p><strong>Eligibility:</strong></p>\n<ul>\n<li>Fresh graduates with interest in mobile app development.</li>\n<li>Basic knowledge of Dart/Flutter preferred.</li>\n<li>Creative thinker, fast learner, and team-oriented.</li>\n</ul>\n<p><strong>Training &amp; Stipend:</strong></p>\n<ul>\n<li>1st Month: Training (No Salary)</li>\n<li>Next 6 Months: Stipend of ₹5,000/month</li>\n<li>Post Training: Attractive salary package based on performance</li>\n</ul>\n<p><strong>How to Apply:</strong>\nSend your resume to info@alp-ts.com with subject line “Application – Flutter Developer Trainee”.</p>",
        "tags": [
            "0 Years",
            "Flutter",
            "Dart",
            "Mobile App Development"
        ],
        "summary": "Alp Turnkey Solutions is seeking a Flutter Developer Trainee. This role involves learning and developing mobile applications using Flutter and assisting in building cross-platform apps."
    },
    {
        "job_title": "PHP Laravel Developer – Trainee",
        "company": "Alp Turnkey Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22981",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>PHP Laravel Developer – Trainee</h2>\n<p><strong>Alp Turnkey Solutions (P) LTD</strong>\nModule No.5, 4th floor, Gayatri Building, Phase I, Technopark , 695581\nhttps://www.alp-ts.com\nClosing Date: 15, Sept 2025\nJob Published: 21, Aug 2025\nContact Email: info@alp-ts.com</p>\n<p><strong>About Us:</strong>\nWe are a growing software solutions company specializing in LMS, ERP, and enterprise applications. We are offering an exciting opportunity for freshers to kickstart their career in PHP Laravel development with hands-on training and real-world projects.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Learn and work on PHP Laravel-based applications.</li>\n<li>Assist in coding, debugging, and testing.</li>\n<li>Collaborate with senior developers and team members.</li>\n<li>Contribute to live projects and product development.</li>\n</ul>\n<p><strong>Preferred Skills/Eligibility:</strong></p>\n<ul>\n<li>Fresh graduates with a passion for coding.</li>\n<li>Basic knowledge of PHP, Laravel, and MySQL preferred.</li>\n<li>Enthusiastic, quick learner, and strong team player.</li>\n</ul>\n<p><strong>Training &amp; Stipend:</strong></p>\n<ul>\n<li>1st Month: Training (No Salary)</li>\n<li>Next 6 Months: Stipend of ₹5,000/month</li>\n<li>Post Training: Attractive salary package based on performance</li>\n</ul>\n<p><strong>How to Apply:</strong>\nSend your resume to info@alp-ts.com with subject line “Application – PHP Laravel Developer Trainee”</p>",
        "tags": [
            "0 Years",
            "PHP",
            "Laravel",
            "MySQL"
        ],
        "summary": "Alp Turnkey Solutions is seeking a PHP Laravel Developer Trainee. This role offers hands-on training and project experience for fresh graduates passionate about coding."
    },
    {
        "job_title": "\"Software Solutions Expert\" – FinTech (Male Candidates - IDUKKI, KOTTAYAM)",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/22980",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Software Solutions Expert – FinTech</h2>\n<p><strong>IGNOSI ENTERPRISES</strong>\nGround Floor, Tejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.ignosi.in\">http://www.ignosi.in</a></p>\n<p><strong>Closing Date:</strong> 30, Aug 2025\n<strong>Job Published:</strong> 21, Aug 2025\n<strong>Contact Email:</strong> hr@ignosi.co.in</p>\n<p><strong>Role:</strong> Software Solutions Expert – FinTech (Male Candidates, IDUKKI, KOTTAYAM)\n<strong>Location:</strong> IDUKKI, KOTTAYAM (Travel involved)\n<strong>Qualification:</strong> Any Degree</p>\n<p>Hey there!</p>\n<p>If you love talking to people, enjoy technology, and are curious to learn something new, we’d love to meet you.\nWe’re a super-friendly team looking for someone who’s:</p>\n<ul>\n<li>Good at communicating – Just be yourself and explain things clearly.</li>\n<li>Okay with a bit of travel – We visit clients and make real connections.</li>\n<li>Excited to learn – We’ll train you on everything!</li>\n<li><strong>Bonus:</strong> If you’ve done B2B sales in banking, finance, or jewelry – even better!</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<p><strong>What You Get:</strong></p>\n<ul>\n<li><strong>Monthly Salary:</strong> ₹18,000 - 25,000 + Extra Incentives (earn more if you enjoy selling!)</li>\n<li><strong>Growth Path:</strong> You can become a Sales Manager within a year</li>\n<li><strong>Training &amp; Support:</strong> We’ll guide you at every step – no pressure.</li>\n<li><strong>Friendly Culture:</strong> No bossy vibes here – just a good team with good goals.</li>\n</ul>\n<p>Not sure if you fit? Let’s just talk. Send a message or your resume to: hr@ignosi.co.in Or call: 9778196774</p>",
        "tags": [
            "Entry Level",
            "Sales",
            "FinTech",
            "B2B"
        ],
        "summary": "Ignosi Enterprises is hiring a Software Solutions Expert for their FinTech team in Idukki and Kottayam. The role involves communication, travel, and a passion for learning with potential career growth."
    },
    {
        "job_title": "\"Software Solutions Expert – FinTech (Male Candidates - PALAKKAD , THRISSUR)",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/22979",
        "location": "Technopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Software Solutions Expert – FinTech</h2>\n<p><strong>IGNOSI ENTERPRISES</strong>\nGround Floor, Tejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.ignosi.in\">http://www.ignosi.in</a></p>\n<p><strong>Role:</strong> Software Solutions Expert – FinTech (Male Candidates, Calicut &amp; Malappuram)</p>\n<p><strong>Location:</strong> CALICUT, MALAPPURAM (Travel involved)</p>\n<p><strong>Qualification:</strong> Any Degree</p>\n<p>Hey there! If you love talking to people, enjoy technology, and are curious to learn something new, we’d love to meet you.\nWe’re a super-friendly team looking for someone who’s:</p>\n<ul>\n<li>Good at communicating – Just be yourself and explain things clearly.</li>\n<li>Okay with a bit of travel – We visit clients and make real connections.</li>\n<li>Excited to learn – We’ll train you on everything!</li>\n</ul>\n<p><strong>Bonus:</strong> If you’ve done B2B sales in banking, finance, or jewelry – even better!</p>\n<p><strong>Preferred Skills</strong></p>\n<p><strong>What You Get:</strong></p>\n<ul>\n<li>Monthly Salary: ₹18,000 - 25,000 + Extra Incentives (earn more if you enjoy selling!)</li>\n<li>Growth Path: You can become a Sales Manager within a year</li>\n<li>Training &amp; Support: We’ll guide you at every step – no pressure.</li>\n<li>Friendly Culture: No bossy vibes here – just a good team with good goals.</li>\n</ul>\n<p>Not sure if you fit? Let’s just talk</p>\n<p>Send a message or your resume to: hr@ignosi.co.in\nOr call: 9778196774</p>\n<p>Contact Email: hr@ignosi.co.in\nClosing Date: 30, Aug 2025\nJob Published: 21, Aug 2025</p>",
        "tags": [
            "1+ Years",
            "Sales",
            "B2B",
            "FinTech"
        ],
        "summary": "Ignosi Enterprises is hiring a Software Solutions Expert for FinTech sales in Calicut and Malappuram. The role involves client visits and offers a growth path to Sales Manager."
    },
    {
        "job_title": "Business Development Manager cum HR Manager",
        "company": "Alp Turnkey Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22978",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Business Development Manager cum HR Manager</h2>\n<p><strong>Alp Turnkey Solutions (P) LTD</strong>\nModule No.5, 4th floor, Gayatri Building, Phase I, Technopark, 695581\n<a href=\"https://www.alp-ts.com\">https://www.alp-ts.com</a></p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 21, Aug 2025\n<strong>Contact Email:</strong> info@alp-ts.com</p>\n<p><strong>Brief Description:</strong></p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Generate new business opportunities and manage telecalling leads.</li>\n<li>Conduct product demos for LMS and related products.</li>\n<li>Manage employee performance, recruitment, and HR functions.</li>\n<li>Build and maintain client relationships with excellent communication skills.</li>\n<li>Coordinate with internal teams for smooth operations and delivery.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<p><strong>Compensation:</strong></p>\n<ul>\n<li>Monthly Salary: ₹15,000 – ₹25,000 (based on experience)</li>\n<li>\n<p>Plus performance-based incentives</p>\n</li>\n<li>\n<p>Growth opportunities and skill development.</p>\n</li>\n</ul>\n<p><strong>How to Apply:</strong>\nSend your updated resume to info@alp-ts.com with the subject line “Application – Business Development &amp; HR Manager”.</p>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Graduate/Postgraduate in Business, HR, or related field.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Prior experience in business development/HR preferred.</li>\n<li>Ability to handle multiple responsibilities and work in a fast-paced environment.</li>\n<li>Female candidates preferred.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Business Development",
            "HR Management",
            "Communication Skills"
        ],
        "summary": "Alp Turnkey Solutions is seeking a Business Development Manager cum HR Manager. Key responsibilities include generating business, managing HR functions, and building client relationships."
    },
    {
        "job_title": "Associate Business Development Consultant",
        "company": "Fingent Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22977",
        "location": "Technopark",
        "closing_date": "05 Oct 2025",
        "job_description": "<h2>Associate Business Development Consultant</h2>\n<p><strong>Fingent Technology Solutions (P) Ltd</strong>\nSBC No: 2309, Yamuna, Technopark Phase III, 695583\n<a href=\"http://www.fingent.com\">http://www.fingent.com</a></p>\n<p><strong>Closing Date:</strong> 05, Oct 2025\n<strong>Job Published:</strong> 21, Aug 2025\n<strong>Contact Email:</strong> careers@fingent.com</p>\n<h3>About Fingent</h3>\n<p>Fingent is an award-winning and ISO 27001:2013-certified custom software development company. With over two decades of experience, we've delivered 700+ projects for clients across four continents. Our global presence includes offices in the US, UAE, Australia, and India. We specialize in creating innovative IT solutions that address our client's most pressing business challenges, providing them with a competitive edge in their respective industries. Our services include Web Application Development, Mobile Application Development, Product Development (SaaS), Artificial Intelligence (AI), AR/VR, 3D Commerce, SAP, IoT (Internet of Things), and Enterprise Software Development.</p>\n<h3>Role Description</h3>\n<p>This is a full-time on-site role for an Associate Business Development Consultant located in Kochi. The Associate Business Development Consultant will be responsible for driving new business development, generating leads, consulting with clients, developing business plans, and effectively communicating with stakeholders. The role involves identifying business opportunities, building and maintaining relationships with clients, and providing strategic advice to support the growth of the company.</p>\n<h3>Preferred Skills/Qualifications</h3>\n<ul>\n<li>Communication Skills (Verbal &amp; Written)</li>\n<li>Engaging prospects via Calls, Emails &amp; Presentations</li>\n<li>Understanding of Sales &amp; Business Development Process, CRM Tools</li>\n<li>Research Skills: Account mapping &amp; identify key stakeholders, Market Research and competitor analysis skills</li>\n<li>Interpersonal &amp; Professional Skills: Proactive, Relationship building skills, Team player-effectively collaborate with marketing team</li>\n</ul>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Handle both inbound and outbound sales for products.</li>\n<li>Generate new leads through targeted outreach.</li>\n<li>Qualify inbound leads received through marketing campaigns &amp; conduct account mapping.</li>\n<li>Perform initial outreach to leads through calls and emails and understand customer requirements.</li>\n<li>Schedule product demos effectively.</li>\n<li>Develop a solid understanding of the product portfolio, value propositions, and target markets.</li>\n<li>Work closely with the marketing team to align on campaigns and provide feedbacks on lead quality.</li>\n<li>Maintain and update lead records in the CRM system.</li>\n</ul>\n<h3>Experience Level</h3>\n<p>1-2 years experience</p>",
        "tags": [
            "1-2 Years",
            "Business Development",
            "CRM Tools",
            "Communication Skills"
        ],
        "summary": "Fingent is seeking an Associate Business Development Consultant to drive new business, generate leads, and build client relationships in Kochi. This role involves sales, outreach, lead qualification, and collaboration with marketing to grow the company."
    },
    {
        "job_title": "Delivery Manager – Software Development",
        "company": "Fingent Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22976",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Delivery Manager – Software Development</h2>\n<p><strong>About Fingent</strong></p>\n<p>At Fingent, we believe that technology can make a meaningful difference to the lives around us. The lives of those who use it, the lives of those who build it and to society at large. We create and provide software which is beautiful, usable and compelling, to solve complex business challenges. We nurture smart people who bring out the best in themselves, their peers, and their clients.</p>\n<p><strong>About the Role</strong></p>\n<p>We are seeking a Delivery Manager with strong technical acumen to oversee the development and maintenance of in-house applications for a leading company in the Financial Services domain. This role requires a mature, diplomatic leader who can drive delivery across global distributed teams.</p>\n<p><strong>Skill Set Requirement</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field.</li>\n<li>15+ years of IT experience with at least 5 years in delivery management or similar leadership roles.</li>\n<li>Strong technical background (e.g., software engineering, architecture, or solution delivery in enterprise environments).</li>\n<li>Proven track record of managing distributed development teams across time zones.</li>\n<li>Experience in Financial Services or other regulated industries preferred.</li>\n<li>Hands-on knowledge of modern software development practices (Agile, DevOps, CI/CD, Cloud).</li>\n<li>Exceptional communication, negotiation, and stakeholder management skills.</li>\n<li>Ability to thrive in complex, matrixed organizations with multiple priorities and stakeholders.</li>\n</ul>\n<p><strong>Roles and Responsibilities</strong></p>\n<ul>\n<li><strong>Delivery Ownership:</strong> End-to-end responsibility for planning, execution, and delivery of software development initiatives, ensuring high quality, timely releases aligned with business priorities.</li>\n<li><strong>Team Leadership:</strong> Manage and support distributed software development teams, fostering accountability, collaboration, and high performance.</li>\n<li><strong>Stakeholder Management:</strong> Build strong relationships with business stakeholders, product owners, and cross-functional teams to align on objectives, priorities, and expectations.</li>\n<li><strong>Technical Oversight:</strong> Provide guidance on technical decisions, ensuring scalability, security, and maintainability of applications. Engage with architects and developers to resolve issues and mitigate risks early.</li>\n<li><strong>Process Excellence:</strong> Establish and improve delivery frameworks (Agile/DevOps), enforce best practices in software development and deployment, and drive continuous improvement.</li>\n<li><strong>Risk &amp; Issue Management:</strong> Proactively identify and address risks, dependencies, and delivery challenges, balancing competing demands in a global matrix environment.</li>\n<li><strong>Communication &amp; Diplomacy:</strong> Act as a trusted bridge between technical teams and business stakeholders, handling conflicts and trade-offs with tact and maturity.</li>\n</ul>\n<p><strong>Experience</strong></p>\n<p>15 to 20 years</p>\n<p><strong>Contact Information</strong></p>\n<p>Contact Email: jobs@fingent.com</p>\n<p>Closing Date: 30, Sept 2025</p>",
        "tags": [
            "15+ Years",
            "Delivery Management",
            "Agile",
            "DevOps"
        ],
        "summary": "Fingent is seeking a Delivery Manager to oversee software development for a financial services client. The role involves managing distributed teams, ensuring timely releases, and stakeholder alignment."
    },
    {
        "job_title": ".NET Developer",
        "company": "Breeze Brain Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22975",
        "location": "Technopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>.NET Developer</h2>\n<p><strong>Breeze Brain Technologies (P) Ltd</strong>\nModule 20, SBC, - 2 Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"https://www.breezebrain.com\">https://www.breezebrain.com</a></p>\n<p><strong>Closing Date:</strong> 31, Aug 2025\n<strong>Job Published:</strong> 21, Aug 2025\n<strong>Contact Email:</strong> careers@breezebrain.com</p>\n<p>We are seeking enthusiastic and skilled .NET Developers with 0–3 years of experience in building Windows desktop applications. This is an exciting opportunity to join a collaborative development team and contribute to the design, development, and maintenance of high-quality software solutions using C# and the .NET Framework.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, test, and maintain Windows desktop applications using C# and the .NET Framework.</li>\n<li>Collaborate with designers, stakeholders, and team members to gather and understand requirements.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Assist with debugging, troubleshooting, and performance optimization.</li>\n<li>Participate in code reviews to ensure code quality and best practices.</li>\n<li>Support and maintain existing applications with minor enhancements and bug fixes.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong understanding of C# and .NET Framework (4.6.2 or later).</li>\n<li>Experience with Windows Forms or WPF.</li>\n<li>Familiarity with SQL Server and writing basic SQL queries.</li>\n<li>Good grasp of OOP principles and design patterns (e.g., SOLID, MVVM).</li>\n<li>Basic knowledge of unit testing (e.g., NUnit, MSTest).</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Good communication and team collaboration abilities.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Exposure to .NET Core or .NET 5/6.</li>\n<li>Knowledge of Azure or other cloud platforms.</li>\n<li>Familiarity with CI/CD pipelines or DevOps tools.</li>\n<li>Understanding of UI/UX principles for desktop software.</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Competitive salary and benefits.</li>\n<li>Mentorship and continuous learning opportunities.</li>\n<li>Exposure to modern technologies and tools.</li>\n<li>A collaborative and supportive work culture.</li>\n</ul>\n<p><strong>How to Apply:</strong>\nSend your updated resume to careers@breezebrain.com with the subject line: \"Dot Net Developer\" Applications without the correct subject line may be delayed or rejected.</p>",
        "tags": [
            "0-3 Years",
            "C#",
            ".NET Framework",
            "SQL Server"
        ],
        "summary": "We are seeking a .NET Developer to build Windows desktop applications using C# and .NET. The role involves contributing to the design, development, and maintenance of high-quality software solutions."
    },
    {
        "job_title": "Software Engineer - Drupal",
        "company": "Fingent Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/22974",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Software Engineer - Drupal</h2>\n<p><strong>Fingent Technology Solutions (P) Ltd</strong>\nSBC No : 2309, Yamuna, Technopark Phase III , 695583\n<a href=\"http://www.fingent.com\">http://www.fingent.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 21, Aug 2025\n<strong>Contact Email:</strong> jobs@fingent.com</p>\n<p>At Fingent, we believe that technology can make a meaningful difference to the lives around us. The lives of those who use it, the lives of those who build it and to society at large. We create and provide software which is beautiful, usable and compelling, to solve complex business challenges. We nurture smart people who bring out the best in themselves, their peers, and their clients.</p>\n<p><strong>Roles and Responsibilities:</strong></p>\n<ul>\n<li>Build complex products, websites, web and e-commerce applications using Drupal 8-10, PHP 8, HTML, CSS, and JavaScript.</li>\n<li>Advanced site-building experience including deep familiarity with Drupal modules such as Views, Rules and Panels.</li>\n<li>Follow Drupal coding standards and best practices.</li>\n<li>Design and develop responsive design websites.</li>\n<li>Good experience in Caching &amp; Performance improvement.</li>\n<li>Contribute to the entire Drupal development life cycle, including planning, architecture, implementation, testing, and deployment.</li>\n<li>Customize and extend Drupal modules to meet project requirements.</li>\n<li>Debug and troubleshoot Drupal-related issues, ensuring optimal performance and user experience.</li>\n<li>Self-starter who can work independently.</li>\n<li>Ability to manage the project and work to strict deadlines and to work in a team environment.</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul>\n<li>3+ years industry experience as a software engineer, with at least 2 years of hands-on experience with Drupal.</li>\n<li>Effective communication skills, with the ability to convey technical concepts to both technical and non-technical stakeholders.</li>\n<li>Proficient in object-oriented PHP, MySQL, HTML, SCSS, and JQuery within the Drupal environment.</li>\n<li>Strong understanding of Drupal APIs and custom module development.</li>\n<li>Familiarity with version control systems such as Git.</li>\n</ul>\n<p><strong>Experience:</strong> 2-5 Years</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>3+ years industry experience as a software engineer, with at least 2 years of hands-on experience with Drupal.</li>\n<li>Effective communication skills, with the ability to convey technical concepts to both technical and non-technical stakeholders.</li>\n<li>Proficient in object-oriented PHP, MySQL, HTML, SCSS, and JQuery within the Drupal environment.</li>\n<li>Strong understanding of Drupal APIs and custom module development.</li>\n<li>Familiarity with version control systems such as Git.</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "Drupal",
            "PHP",
            "MySQL"
        ],
        "summary": "Fingent is seeking a Drupal Software Engineer to build complex web applications. The role requires expertise in Drupal, PHP, and related technologies, along with strong communication skills."
    },
    {
        "job_title": "Senior .NET Developer",
        "company": "Appfabs Innovation (P) Ltd",
        "url": "https://technopark.org/job-details/22973",
        "location": "Technopark",
        "closing_date": "21 Sep 2025",
        "job_description": "<h2>Senior .NET Developer</h2>\n<p><strong>Appfabs Innovation (P) Ltd</strong>\nModules No. 11, Gayathri Building, Phase I, Technopark Campus, Thiruvanthapuram, 695581\n<a href=\"https://www.appfabs.ca\">https://www.appfabs.ca</a></p>\n<p><strong>Contact Email:</strong> teamhr@appfabs.in</p>\n<p><strong>Closing Date:</strong> 21, Sept 2025\n<strong>Job Published:</strong> 21, Aug 2025</p>\n<p><strong>Brief Description:</strong>\nSenior .NET Backend Developer</p>\n<p><strong>Position Summary:</strong>\nWe are seeking a highly skilled Senior .NET Backend Developer with strong expertise in C#, .Net Core, SQL, React JS and knowledge of design patterns to join our team. The ideal candidate will have deep experience in designing and developing scalable backend systems using modern .NET technologies, along with solid knowledge of database development, API integrations, and CI/CD practices. Exposure to front-end technologies, cloud platforms, and monitoring solutions is an added advantage.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable backend services using .NET Core/C# following layered architecture and repository design pattern.</li>\n<li>Develop and optimize SQL queries, stored procedures, and database designs to ensure high performance and reliability.</li>\n<li>Implement and maintain RESTful APIs with proper authentication and authorization mechanisms (JWT, OAuth2, Azure AD).</li>\n<li>Work with SharePoint API, Microsoft Graph API, and Teams/Outlook/Word plugins for enterprise integrations.</li>\n<li>Collaborate with cross-functional teams in an Agile environment to deliver high-quality solutions.</li>\n<li>Ensure high test coverage with XUnit, NUnit, Jest (for React) and write effective unit/integration tests.</li>\n<li>Contribute to CI/CD pipelines, build automation, and deployment processes using Azure DevOps or equivalent.</li>\n<li>Implement monitoring and logging solutions (Coralogix, Datadog) for system reliability.</li>\n<li>Collaborate with front-end developers working on React JS and Redux to ensure seamless integration.</li>\n<li>Document APIs with Swagger, and test endpoints with Postman.</li>\n<li>Participate in code reviews, technical design discussions, and knowledge-sharing sessions.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li>5+ years of professional experience in backend development using C# and .NET Core.</li>\n<li>Strong expertise in SQL Server, Stored Procedures, Functions, Views, and Performance Tuning.</li>\n<li>Deep understanding of LINQ, Entity Framework, repository &amp; layered architecture patterns.</li>\n<li>Experience with CI/CD pipelines, build/release processes, and Azure DevOps/GitHub Actions.</li>\n<li>Familiarity with Agile development methodology.</li>\n<li>Hands-on experience with Swagger, Postman, and API documentation/testing.</li>\n<li>Strong understanding of authentication &amp; authorization (JWT, OAuth2).</li>\n<li>Experience with Visual Studio, VS Code, and SSMS.</li>\n<li>Unit testing experience with XUnit/NUnit, front-end testing knowledge with Jest is a plus.</li>\n</ul>\n<p><strong>Preferred / Nice-to-Have Skills:</strong></p>\n<ul>\n<li>Experience with Python scripting.</li>\n<li>Knowledge of Coralogix/Datadog monitoring solutions.</li>\n<li>Domain knowledge in LegalTech / Legal domain systems.</li>\n<li>Exposure to React JS, Redux, and modern front-end development.</li>\n<li>Experience with Microsoft Graph API, SharePoint API, Teams/Outlook/Word add-ins.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "C#",
            ".NET Core",
            "SQL Server"
        ],
        "summary": "Appfabs Innovation is looking for a Senior .NET Backend Developer. The role involves designing scalable systems, optimizing SQL, and collaborating on integrations using modern .NET technologies."
    },
    {
        "job_title": "Trainee,Finance and Accounts (B.Com Freshers - 2024 & 2025 Passouts)",
        "company": "Zyxware Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/22972",
        "location": "Technopark",
        "closing_date": "25 Aug 2025",
        "job_description": "<h2>Trainee, Finance and Accounts (B.Com Freshers - 2024 &amp; 2025 Passouts) - Walk-In Interview</h2>\n<p><strong>Zyxware Technologies</strong> is looking for a motivated Trainee to join their Finance and Accounts team. This is an excellent opportunity for B.Com freshers (2024 &amp; 2025 passouts) to start their career in accounting and finance. The position is based in Technopark, Thiruvananthapuram, Kerala.</p>\n<p><strong>Walk-In Details:</strong></p>\n<ul>\n<li><strong>Date:</strong> August 25, 2025</li>\n<li><strong>Time:</strong> 10:30 AM - 12:00 PM</li>\n<li><strong>Venue:</strong> Zyxware Technologies (P) Ltd., SBC 2205, II Floor, Yamuna Building, Technopark Phase III campus, Trivandrum - 695581</li>\n<li><strong>Contact Person:</strong> Sayoojya M. V., HR Generalist, Zyxware Technologies (7012492995)</li>\n<li><strong>Contact Email:</strong> careers@zyxware.com</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Assist in day-to-day accounting activities (sales, purchases, operational expenses).</li>\n<li>Support in preparation of financial statements and MIS reports.</li>\n<li>Support in the preparation of project-wise MIS reports.</li>\n<li>Learn and assist in statutory compliances (TDS, PF, GST, Softex, SEZ, FIRC, Income Tax, etc.).</li>\n<li>Help in preparing client invoices and tracking receivables.</li>\n<li>Maintain proper documentation and records for financial transactions.</li>\n<li>Work with accounting software such as QuickBooks, Zoho Books, and MS Office/Google Sheets.</li>\n<li>Provide support during audits by coordinating with internal teams.</li>\n<li>Learn accounting policies, procedures, and internal controls.</li>\n</ul>\n<p><strong>Preferred Skills/Desired Candidate Profile:</strong></p>\n<ul>\n<li><strong>Education:</strong> B.Com (2024 &amp; 2025 Passout)</li>\n<li><strong>Marks for Graduation:</strong> 70% and above</li>\n<li><strong>Mathematics Marks for Class 10:</strong> 90% or above</li>\n<li>Knowledge of finance, accounting, budgeting, and cost control principles including GAAP.</li>\n<li>Basic understanding of accounting concepts and principles.</li>\n<li>Good analytical and problem-solving skills.</li>\n<li>Proficiency in MS Office / Google Sheets.</li>\n<li>Strong communication skills (oral and written) in English.</li>\n<li>Eagerness to learn and ability to work as part of a team.</li>\n</ul>\n<p><strong>Stipend:</strong> INR 15,000 per month</p>\n<p><strong>Note:</strong> Successful trainees will be absorbed as Executive, Finance and Accounts after the training period.</p>\n<p><strong>Interview Rounds on August 25, 2025:</strong></p>\n<ol>\n<li><strong>Written Test:</strong> (1 hour, MCQs) covering Financial Accounting, Cost and Management Accounting, Economics and Analysis, Auditing, Risk Management, Ethics and Conflict Management. Cut-off score: 70%.</li>\n<li><strong>Face to Face Interview:</strong> With Finance and HR Team during the second half of the day.</li>\n</ol>\n<p><strong>Important Instructions:</strong></p>\n<ul>\n<li>Candidates must secure a minimum of 70% in B.Com and 90% in Mathematics in Class 10.</li>\n<li>Selected candidates must be willing to work from the Technopark Office (Monday to Friday).</li>\n<li>Candidates should be ready to join on or before August 29, 2025.</li>\n<li>Please carry one copy of updated resume.</li>\n</ul>\n<p><strong>Walk-In Entry Pass:</strong></p>\n<p>Apply for the entry pass to Technopark Campus through the mobile app/web browser:</p>\n<ul>\n<li>Mobile App: <a href=\"link to Android app\">Android</a>, <a href=\"link to iOS app\">iOS</a></li>\n<li>Website URL: <a href=\"http://vms.technopark.org\">vms.technopark.org</a></li>\n<li>User Manual: Click here for the User Manual</li>\n</ul>\n<p><em>Note: Original certificates will be verified at the Entry Gate.</em></p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Zyxware Technologies (P) Ltd</strong></li>\n<li>SBC 2205, II Floor, Yamuna Building, Technopark Phase III, Trivandrum, 695583</li>\n<li><a href=\"http://www.zyxware.com\">http://www.zyxware.com</a></li>\n</ul>",
        "tags": [
            "0 Years",
            "B.Com",
            "Accounting",
            "MS Office"
        ],
        "summary": "Zyxware Technologies is hiring a Finance and Accounts Trainee for their Technopark office. This is a great opportunity for fresh B.Com graduates."
    },
    {
        "job_title": "Confidential Assistant (Job Code CA/82025/487 )",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/22971",
        "location": "Technopark",
        "closing_date": "03 Sep 2025",
        "job_description": "<h2>Confidential Assistant</h2>\n<p><strong>Kerala University of Digital Sciences, Innovation and Technology</strong> invites applications from qualified Indian Citizens for the position of Confidential Assistant on a contract basis.</p>\n<p><strong>Job Code:</strong> CA/82025/487</p>\n<p><strong>Closing Date:</strong> 03, Sept 2025</p>\n<p><strong>Job Published:</strong> 21, Aug 2025</p>\n<p><strong>Location:</strong></p>\n<p>Technopark Phase-IV Campus (Technocity),\nMangalappuram, Thonnakkal PO,\nTrivandrum, Kerala, 695317</p>\n<p><strong>Website:</strong> https://duk.ac.in</p>\n<p><strong>Contact Email:</strong> recruitments@duk.ac.in</p>\n<p><strong>Application Process:</strong></p>\n<p>Qualified candidates can submit their applications online through the Recruitment Portal. All guidelines related to the submission of applications are available in the recruitment portal.</p>\n<p>Applications shall be submitted online latest on 03.09.2025. The application form is available at https://www.duk.ac.in/careers.</p>\n<p><strong>Essential Educational Qualification:</strong></p>\n<ul>\n<li>Graduation in any discipline and a Diploma in computer applications</li>\n</ul>\n<p><strong>Essential Expertise:</strong></p>\n<ul>\n<li>Expertise in data entry</li>\n</ul>\n<p><strong>Desirable Skillset:</strong></p>\n<ul>\n<li>Good written and verbal communication skills.</li>\n<li>Proficiency in MS Word, Excel, PowerPoint, and letter drafting.</li>\n</ul>",
        "tags": [
            "0 Years",
            "Data Entry",
            "MS Office",
            "Communication Skills"
        ],
        "summary": "Kerala University seeks a Confidential Assistant with expertise in data entry and MS Office. The role requires strong communication skills and a relevant educational background."
    }
]