[
    {
        "job_title": "IT & Facilities Assistant (0.6-2 yrs)",
        "company": "Thoughtminds System Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20486/485",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>IT &amp; Facilities Assistant</h2>\n<p><strong>Company:</strong> Thought Minds – a global leader in providing solutions on LLM and generative AI solutions.</p>\n<p><strong>Job Description:</strong></p>\n<p>We are looking for a proactive IT &amp; Facilities Assistant to support our IT operations and facilities management. The role involves:</p>\n<ul>\n<li>Maintaining an asset register for all company equipment.</li>\n<li>Creating employee IDs for new joiners.</li>\n<li>Managing and maintaining biometric devices.</li>\n<li>Handling laptop and IT support issues, including coordination with vendors.</li>\n<li>Assisting with company-related travel within Kochi.</li>\n<li>Visiting the InfoPark office for company requirements as needed.</li>\n<li>Supporting the facilities department in day-to-day operations.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Basic IT knowledge and troubleshooting skills.</li>\n<li>Good organizational and coordination abilities.</li>\n<li>Willingness to travel locally within Kochi.</li>\n<li>Ability to multitask across IT and facilities responsibilities.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at anachana@thoughtminds.io</p>",
        "tags": [
            "0-2 Years",
            "IT Support",
            "Facilities Management",
            "Asset Register"
        ],
        "summary": "Seeking a proactive IT & Facilities Assistant to manage equipment, IT support, and daily operations. Requires basic IT knowledge, organizational skills, and local travel within Kochi."
    },
    {
        "job_title": "Product Owner (7+yrs)",
        "company": "Thoughtminds System Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20487/485",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Product Owner (7+ Years)</h2>\n<p>ThoughtMinds is a global leader in delivering advanced solutions in Generative AI, LLM technologies, and digital transformation services. We're growing rapidly and are looking for a dynamic and experienced Product Owner to join our team.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Own and manage the product backlog, defining clear and actionable user stories and acceptance criteria.</li>\n<li>Collaborate closely with stakeholders, customers, and cross-functional teams to gather requirements, identify opportunities, and translate them into product features.</li>\n<li>Drive product vision and roadmap, ensuring alignment with business goals and client needs.</li>\n<li>Analyze market trends, customer feedback, and usage data to identify insights and generate new product ideas.</li>\n<li>Prioritize initiatives based on value, feasibility, and impact, balancing short-term needs with long-term growth.</li>\n<li>Work interactively with development teams to clarify requirements, remove blockers, and ensure timely delivery of features.</li>\n<li>Act as a champion of innovation—bringing forward new ideas and ensuring continuous improvement of product and processes.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Proven experience as a Product Owner, Business Analyst, or similar role in product development.</li>\n<li>Technical skill on Postgres (to query and do data analysis).</li>\n<li>Strong analytical and problem-solving skills with the ability to translate data into actionable insights.</li>\n<li>Excellent communication and interpersonal skills—able to engage effectively with both technical and non-technical stakeholders.</li>\n<li>Highly proactive, with a self-starter attitude and the ability to anticipate needs and take initiative.</li>\n<li>Strong facilitation and collaboration skills; thrives in an interactive, fast-paced environment.</li>\n<li>Experience in Agile/Scrum methodologies with a solid understanding of product management best practices.</li>\n</ul>\n<p><strong>Qualification:</strong></p>\n<ul>\n<li>Bachelor's or Master's Degree in Computer Science/MBA</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at ancha&lt;na@thoughtminds.io</p>",
        "tags": [
            "7+ Years",
            "Product Owner",
            "Agile/Scrum",
            "Postgres"
        ],
        "summary": "Seeking a Product Owner with 7+ years experience to manage product backlogs and drive vision. Requires expertise in Agile/Scrum and Postgres for data analysis."
    },
    {
        "job_title": "Android Developer (3 yrs of experience)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20467/157",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Android Developer at Tranzmeo</h2>\n<p>Tranzmeo is seeking an Android Developer to join our distributed, multifunctional team. If you enjoy working on apps, AI, and ML applications, we would love to hear from you.</p>\n<p>We hire for culture, passion, and the ability to learn quickly. You’ll do well here if you are passionate about quality and craftsmanship and are self-driven.</p>\n<p><strong>No. of Openings:</strong> 1</p>\n<h3>What we are looking for in you:</h3>\n<ul>\n<li>Minimum 2-3 years of experience</li>\n<li>Bachelor's degree in Computer Science or IT</li>\n<li>Must have good analytical and problem-solving skills</li>\n<li>Ability to work independently</li>\n</ul>\n<h3>Required Skills:</h3>\n<ul>\n<li><strong>IDE:</strong> Android Studio</li>\n<li><strong>Programming Language:</strong> Java, Kotlin</li>\n<li><strong>Version Control:</strong> Git</li>\n<li><strong>UI Layouts:</strong> Linear, Relative, Constraint Layouts</li>\n<li><strong>Architecture:</strong> MVP, MVVM</li>\n<li><strong>APIs:</strong> Client-server communication</li>\n<li><strong>Data Storage:</strong> Local data storage</li>\n<li><strong>Testing:</strong> Unit test cases, crash resolution, memory management</li>\n<li><strong>Optimization:</strong> App performance, memory footprint optimization</li>\n<li><strong>Process:</strong> App store build release process</li>\n<li><strong>Debugging:</strong> Debugging and resolving crashes, exceptions</li>\n<li><strong>Memory Management:</strong> Manual Memory Management Rules</li>\n</ul>\n<h3>Roles &amp; Responsibilities:</h3>\n<ul>\n<li>Design, build, ship, and maintain mobile apps on the Android platform.</li>\n<li>Work with the team to design new product features.</li>\n<li>Help maintain code quality and review others’ code.</li>\n<li>Proactively address performance issues and bugs.</li>\n<li>Raise your own and the team's skill level every day by growing and learning.</li>\n<li>Use available project management and communication tools.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com.</p>",
        "tags": [
            "2-3 Years",
            "Android",
            "Java",
            "Kotlin"
        ],
        "summary": "Seeking an Android Developer with 2-3 years of experience to build and maintain mobile apps. Responsibilities include feature design, code quality, and performance optimization."
    },
    {
        "job_title": "Data Science Intern",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20468/157",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Data Science Intern</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Explain predictive models to various business users and make recommendations to drive business strategy.</li>\n<li>Make recommendations to resolve application performance problems.</li>\n<li>Implement data processing methods and tools.</li>\n<li>Collaborate with product leaders, subject matter experts, and decision-makers to develop success criteria and optimize new products, features, policies, and models.</li>\n<li>Leverage your experience in analytics tools and scientific rigor to produce actionable insights.</li>\n<li>Distill and communicate key insights to senior management in verbal, visual, and written media.</li>\n<li>Together with the Co-op department lead, determine an appropriate data science problem statement and toolset to apply during the co-op term.</li>\n<li>Determine strengths and weaknesses of data science toolsets and procedures.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Knowledge of Machine Learning concepts (cross-validation, regularization, boosting, bootstrapping) is a plus.</li>\n<li>Working on a degree in Computer Science, or a related field, with project experience in data analysis.</li>\n<li>Experience with big data technologies (Hadoop, Hive, MongoDB, Spark).</li>\n<li>Experience with statistical analysis and data mining using tools such as R, SAS, Matlab, Stata, or SPSS.</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0-2 Years",
            "Machine Learning",
            "Data Analysis",
            "Big Data Technologies"
        ],
        "summary": "Data Science Intern to explain models, resolve issues, and implement data processing. Collaborate on product optimization and provide actionable insights to management."
    },
    {
        "job_title": "Project Manager (Data & Analytics)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20469/157",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Project Manager (Data &amp; Analytics)</h2>\n<p>We are looking for an experienced Project Manager – Data &amp; Analytics to lead and manage data-driven projects across various business domains. The ideal candidate will have strong experience in managing data engineering, business intelligence, and analytics projects, with a proven ability to collaborate with technical and business stakeholders to deliver high-impact solutions on time and within budget.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead end-to-end project management for data and analytics initiatives.</li>\n<li>Define project scope, goals, deliverables, timelines, and resource plans.</li>\n<li>Work closely with data engineers, data scientists, analysts, and business stakeholders.</li>\n<li>Manage project risks, issues, and dependencies proactively.</li>\n<li>Ensure quality assurance, timely reporting, and documentation throughout the project lifecycle.</li>\n<li>Communicate project status, updates, and escalations to leadership and stakeholders.</li>\n<li>Drive Agile/Scrum ceremonies and ensure timely sprint deliverables.</li>\n<li>Coordinate across cross-functional teams to ensure alignment with business objectives.</li>\n<li>Track KPIs, ROI, and business impact of analytics solutions.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Engineering, or a related field. PMP/PRINCE2 certification is a plus.</li>\n<li>7+ years of total experience with at least 3+ years in managing data analytics or data engineering projects.</li>\n<li>Strong understanding of data warehousing, ETL pipelines, data visualization, and analytics platforms.</li>\n<li>Hands-on experience working with tools/technologies like SQL, Power BI/Tableau, Python/R /R (preferred), and cloud data platforms (AWS/GCP/Azure).</li>\n<li>Strong project management skills, including planning, budgeting, and stakeholder management.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "3+ Years",
            "Data Analytics",
            "Project Management",
            "SQL"
        ],
        "summary": "Experienced Project Manager needed for data & analytics projects. Must manage data engineering, BI, and analytics initiatives, collaborating with stakeholders for timely delivery."
    },
    {
        "job_title": "Junior Geophysicist- Fiber-optic Sensing & AI (Fresher)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20470/157",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Junior Geophysicist - Fiber-optic Sensing &amp; AI (Fresher)</h2>\n<p>We are seeking a motivated Junior Geophysicist (recent graduate) to dive into projects involving Distributed Acoustic Sensing (DAS), fiber‑optic sensor data, and Python‑driven AI analysis. You’ll work closely with geophysicists, data scientists, and engineers to drive data‑centric insights and support field deployments.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Support data acquisition, preprocessing, and interpretation from fiber‑optic sensing systems (DAS/DTS).</li>\n<li>Analyze large time‑series datasets using Python (NumPy, Pandas, SciPy, Matplotlib).</li>\n<li>Collaborate with AI/ML experts to build models for signal classification, event detection, or anomaly identification.</li>\n<li>Participate in field activities, including deploying sensors, monitoring systems, and validating datasets.</li>\n<li>Document workflows, results, and technical insights clearly in reports or code comments.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>Bachelor's or Master's degree in Geophysics, Geoscience, Physics, Engineering, or related discipline.</li>\n<li>Fundamental understanding of seismic wave behavior and fiber‑optic sensing principles.</li>\n<li>Basic proficiency in Python and experience with data‑analysis libraries.</li>\n<li>Interest in machine learning—any exposure to scikit‑learn, TensorFlow, or PyTorch is a plus.</li>\n<li>Excellent analytical thinking, communication skills, and collaborative mindset.</li>\n</ul>\n<h3>Preferred (Nice-to-Have)</h3>\n<ul>\n<li>Experience with signal processing, time‑series analysis, or seismic inversion methods.</li>\n<li>Familiarity with version control systems (e.g., Git) and Jupyter notebooks.</li>\n<li>Willingness and physical ability to participate in occasional fieldwork and travel.</li>\n</ul>\n<h3>What You’ll Gain</h3>\n<ul>\n<li>Hands‑on experience at the intersection of geophysics, fiber‑optic sensing, and AI.</li>\n<li>Mentorship from industry professionals and cross‑disciplinary collaboration.</li>\n<li>Exposure to real‑world problems in energy, infrastructure, and environmental monitoring.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "Fresher",
            "Python",
            "Fiber-optic Sensing",
            "Geophysics"
        ],
        "summary": "Seeking a Junior Geophysicist for fiber-optic sensing and AI projects. Responsibilities include data analysis and model building, with opportunities for field deployment and learning."
    },
    {
        "job_title": "Junior Business Development Executive - B2B Sales",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20471/157",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Junior Business Development Executive - B2B Sales</h2>\n<p><strong>Experience:</strong> 0 to 3 years (Freshers can apply)</p>\n<p><strong>Qualifications:</strong>\n- Engineering\n- MBA (optional)</p>\n<p><strong>Preferred Experience:</strong>\n- B2B Sales\n- Lead Generation\n- Customer Acquisition</p>\n<p><strong>About the Role:</strong>\nWe are seeking a proactive, committed, and ambitious Junior Business Development Executive to join our dynamic team. The ideal candidate will possess strong interpersonal skills, be a smart negotiator with excellent grasping power, and have good presentation abilities.</p>\n<p><strong>Responsibilities:</strong>\n- Engage in B2B sales activities, focusing on lead generation and customer acquisition.\n- Utilize strong communication and presentation skills to represent the company effectively.\n- Work proactively to achieve sales targets and contribute to business growth.</p>\n<p><strong>Requirements:</strong>\n- Prior experience in B2B Inside Sales, Lead Generation, or Customer Acquisition is preferred.\n- Proficiency in MS Office (Google Docs, PowerPoint) and familiarity with these tools.\n- Willingness to travel approximately 80-20%.\n- Excellent verbal and written communication skills in English.\n- Must possess a passport.\n- Should be living within a 30-minute radius of the office.</p>\n<p><strong>Culture:</strong>\n- Young and dynamic work environment.</p>\n<p><strong>Application Process:</strong>\nInterested candidates are encouraged to submit their resumes to hr@tranzmeo.com or lakshmi@team.tranzmeo.com.</p>\n<p><strong>Job Details:</strong>\n- <strong>Employment:</strong> Full-time\n- <strong>Industry:</strong> Software Development</p>",
        "tags": [
            "0-3 Years",
            "B2B Sales",
            "Lead Generation",
            "Customer Acquisition"
        ],
        "summary": "Seeking a Junior Business Development Executive with 0-3 years experience in B2B sales, lead generation, and customer acquisition. Must be proactive, ambitious, and possess strong communication and negotiation skills."
    },
    {
        "job_title": "Technical Lead- Data Science & Machine Learning",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20472/157",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Technical Lead - Data Science &amp; Machine Learning</h2>\n<p>Tranzmeo is an innovative leader in the fiber optic sensing industry, dedicated to developing cutting-edge solutions that optimize pipeline monitoring, well monitoring, railway, aerospace, defense, and other applications. We harness the power of AI, ML, and Big Data to push the boundaries of sensing technology and provide real-time insights that matter.</p>\n<p>We're hiring a passionate and experienced Technical Lead to head our Data Science &amp; Machine Learning initiatives. If you're excited about applying AI/ML to advanced sensing technologies and want to make a tangible impact, we want to hear from you!</p>\n<h3>What You'll Do:</h3>\n<ul>\n<li>Lead the design, development, and deployment of scalable AI/ML models tailored to fiber optic sensing data.</li>\n<li>Architect Big Data solutions for processing vast amounts of sensing data in real-time.</li>\n<li>Collaborate with product teams, sensor engineers, and stakeholders on innovative projects.</li>\n<li>Mentor and manage a talented team of data scientists and engineers.</li>\n<li>Ensure data quality, model performance, and security standards.</li>\n<li>Stay ahead of developments in AI/ML and fiber optic sensing fields to foster innovation.</li>\n</ul>\n<h3>What We're Looking For:</h3>\n<ul>\n<li>B.Tech in Computer Science, Data Science, or related fields.</li>\n<li>6+ years of experience in data science, machine learning, and Big Data, preferably in the sensing or telecom sectors.</li>\n<li>Proven leadership and team management skills.</li>\n<li>Strong programming skills (Python).</li>\n<li>Experience with cloud platforms (AWS, GCP, Azure).</li>\n<li>Hands-on experience with ML frameworks (TensorFlow, PyTorch, scikit-learn).</li>\n<li>Skilled in Big Data tools (Hadoop, Spark, Kafka, Airflow).</li>\n<li>Good understanding of fiber optic sensing technologies and data characteristics is a plus.</li>\n<li>Excellent problem-solving, communication, and collaboration skills.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work on innovative sensing technology projects with real-world impact.</li>\n<li>Lead the AI and ML strategies in a pioneering industry.</li>\n<li>Dynamic and growth-oriented work environment.</li>\n<li>Opportunity to shape the future of fiber optic sensing solutions.</li>\n</ul>\n<p><strong>Job Details</strong></p>\n<ul>\n<li><strong>Employment:</strong> Full-time</li>\n<li><strong>Industry:</strong> Software Development</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tranzmeo.com.</p>",
        "tags": [
            "6+ Years",
            "Python",
            "AWS",
            "Machine Learning"
        ],
        "summary": "Lead Data Science & ML initiatives, architecting AI/ML models and Big Data solutions for fiber optic sensing. Requires 6+ years of experience and strong technical and leadership skills."
    },
    {
        "job_title": "Customer Success Manager",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20473/157",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Customer Success Manager</h2>\n<p>We are seeking an experienced Customer Success Manager to join our team. The candidate will play a key role in ensuring customer satisfaction, delivering client engagement excellence, and driving customer success through proactive measures.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Act as the primary point of contact and trusted advisor for customers.</li>\n<li>Develop and nurture long-term relationships with the Customer stakeholders.</li>\n<li>Understand Customer requirements and business goals.</li>\n<li>Ensure frictionless onboarding &amp; adoption of Tranzmeo’s product/solution.</li>\n<li>Proactively review and manage customer accounts for greater Customer satisfaction and long-term retention.</li>\n<li>Track &amp; get the customer issues resolved promptly and effectively, escalating when necessary.</li>\n<li>Conduct regular review meetings with the customer to provide insights on product usage and best practices.</li>\n<li>Collaborate with cross-functional Tranzmeo teams (Sales, Product, Support) to ensure a seamless customer experience.</li>\n<li>Regularly monitor customer account health metrics and implement strategies to mitigate business risks.</li>\n<li>Develop new knowledge assets based on experiential insights from Customer engagements.</li>\n<li>Gather business insights of Customer needs and drive upsell/cross-sell opportunities.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> B.Tech degree (mandatory).</li>\n<li><strong>Experience:</strong> Minimum 7 years of relevant experience in Customer Success Management, Customer Delivery Management, or Customer Relationship Management.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li><strong>Language Proficiency:</strong> Fluency in English and Hindi is mandatory.</li>\n<li>Strong problem-solving and negotiation abilities.</li>\n<li>Ability to manage multiple clients and priorities effectively.</li>\n<li>Ability to quickly learn about the software products/solutions to guide clients in their business context.</li>\n<li>Familiarity with CRM tools and customer success platforms.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary and benefits.</li>\n<li>A dynamic, respectful, and growth-oriented professional environment.</li>\n<li>Opportunities for Career development and skill enhancement.</li>\n<li>Opportunities to gain highly valued professional experiences.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "7+ Years",
            "Customer Success Management",
            "CRM",
            "Client Relationship Management"
        ],
        "summary": "Seeking an experienced Customer Success Manager with a B.Tech degree and 7+ years of experience. Responsibilities include customer satisfaction, engagement, and retention. Fluency in English and Hindi is mandatory."
    },
    {
        "job_title": "Inside Sales Specialist",
        "company": "Global Surf IT Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20474/421",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Inside Sales Specialist</h2>\n<p><strong>Location:</strong> TransAsia Cyberpark, Infopark Phase II, Kochi</p>\n<p><strong>Experience:</strong> 2+ Years</p>\n<h3>JOB SUMMARY</h3>\n<p>As an Inside Sales Specialist, you will drive business growth by generating leads, managing client relationships, and converting opportunities into sales. You will handle inquiries, follow up on prospects, and coordinate with internal teams to ensure seamless client engagement and achieve sales targets.</p>\n<h3>JOB RESPONSIBILITIES</h3>\n<ul>\n<li>Handle inside sales activities to drive business and conversions.</li>\n<li>Manage client accounts and do proper follow-ups.</li>\n<li>Conduct cold calling to generate new business opportunities.</li>\n<li>Handle incoming inquiries and provide appropriate sales support.</li>\n<li>Develop and maintain strong relationships with clients to ensure repeat business.</li>\n<li>Proactively follow up on leads and convert them into successful sales.</li>\n<li>Coordinate and communicate with clients regarding events and webinars.</li>\n<li>Maintain and update sales records, CRM, and databases.</li>\n<li>Collaborate with cross-functional teams to meet business goals.</li>\n<li>Understanding of IT products and services to communicate effectively with clients.</li>\n</ul>\n<h3>SKILLS REQUIRED</h3>\n<ul>\n<li>Strong verbal and written communication skills.</li>\n<li>Ability to engage and persuade potential customers.</li>\n<li>Previous experience in B2B Sales or IT sales.</li>\n<li>Experience in cold calling and lead generation.</li>\n<li>Proficiency in CRM software and Microsoft Office Suite.</li>\n<li>Knowledge of IT products, services, and technology trends.</li>\n<li>Ability to handle client objections and negotiate effectively.</li>\n<li>Strong organizational skills with attention to detail.</li>\n</ul>\n<p><em>Preference will be given to female candidates, in line with our commitment to diversity and inclusion</em></p>\n<h3>How to Apply:</h3>\n<p>If you are passionate about driving sales and building strong client relationships, we'd love to hear from you! Please send your updated CV to talenthunt@globalsurf.ae with the subject “Application for Inside Sales Specialist – GS-IT”.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at talenthunt@globalsurf.ae</p>",
        "tags": [
            "2+ Years",
            "Inside Sales",
            "Lead Generation",
            "CRM"
        ],
        "summary": "Drive business growth by generating leads, managing client relationships, and converting opportunities into sales. Handle inquiries, follow up on prospects, and coordinate with internal teams to achieve sales targets."
    },
    {
        "job_title": "Creative Copywriter",
        "company": "Global Surf IT Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20478/421",
        "location": "Infopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Creative Copywriter (Social Media &amp; Campaigns)</h2>\n<p><strong>Experience:</strong> 2+ years</p>\n<p>We’re looking for a Creative Copywriter who supports social and campaign impact.</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Craft compelling, creative copy for social media platforms — including captions, hooks, ad copy, and storytelling elements for campaigns.</li>\n<li>Translate strategic ideas into engaging short-form content that aligns with visual direction and campaign goals.</li>\n<li>Collaborate closely with creative teams to ensure copy is integrated seamlessly with visuals and brand narratives.</li>\n<li>Adapt tone of voice and messaging across various brands, industries, and target audiences.</li>\n<li>Support social media and campaign execution with copy that drives engagement, awareness, and conversion.</li>\n<li>Stay updated with social trends, platform best practices, and content formats to keep copy fresh, relevant, and effective.</li>\n</ul>\n<h3>Job Requirements:</h3>\n<ul>\n<li>Proven experience in advertising, digital, or campaign-driven environments — preferably within creative or social-first agencies.</li>\n<li>Strong portfolio showcasing creative copy for social media, digital ads, or integrated campaigns (not just blogs or long-form content).</li>\n<li>Ability to write with versatility — tailoring voice and messaging to fit different brands and audiences.</li>\n<li>A sharp eye for storytelling, audience engagement, and impactful short-form writing.</li>\n<li>Understanding of how copy works with visuals in a campaign or social context.</li>\n<li>Comfortable working under deadlines, within briefs, and across collaborative creative teams.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>If you are passionate about creative writing for social media and campaigns, we'd love to hear from you! Please send your updated CV and Portfolio to talenthunt@globalsurf.ae with the subject “Application for Creative Copywriter – Global Surf”. If this opportunity aligns with your career goals, kindly share your updated resume with us at talenthunt@globalsurf.ae</p>",
        "tags": [
            "2+ Years",
            "Copywriting",
            "Social Media",
            "Campaigns"
        ],
        "summary": "Seeking a Creative Copywriter with 2+ years of experience to craft compelling social media and campaign copy. Must excel in short-form writing, collaboration, and adapting brand voices."
    },
    {
        "job_title": "Service Monitoring Analyst (WFH)",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20480/4",
        "location": "Infopark",
        "closing_date": "23 Sep 2025",
        "job_description": "<h2>Service Monitoring Analyst (WFH)</h2>\n<p><strong>Job Type:</strong> Full-time</p>\n<p><strong>Experience:</strong> 2-5 years</p>\n<p>Service Monitoring Analysts play a key role in ensuring the organization continues to exceed industry-leading availability across all services (e.g., Transaction Processing, Web Services).</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Continual monitoring of all key services, including error rates, fluctuation in volumes, transaction accept/decline rates, client connectivity, and timeliness of reporting to clients.</li>\n<li>Eyes on glass</li>\n<li>Dashboard monitoring</li>\n<li>Investigation of alerts</li>\n<li>Performing a combination of Business As Usual (BAU) monitoring processes and ad-hoc actions, such as change or client event-specific monitoring and reporting.</li>\n<li>Immediate escalation of potential issues as per defined processes.</li>\n<li>Continually improving the effectiveness and targeting of monitoring.</li>\n<li>Providing insights to clients and colleagues from monitoring.</li>\n</ul>\n<p>The role offers multiple exciting career progression paths within the organization, including Customer Care, Technical Support, Testing, and Project Delivery.</p>\n<p><strong>Skills, Ability, and Experience:</strong></p>\n<p><strong>Essential:</strong></p>\n<ul>\n<li>A track record of success in a monitoring role.</li>\n<li>Background in Financial Services; understanding of Cards is desirable.</li>\n<li>An understanding of transaction processing systems, electronic Point of Sale (POS), and ATMs will be an added advantage.</li>\n<li>Keen attention to detail.</li>\n<li>A strong sense of urgency.</li>\n<li>Excellent oral and written communication skills in English.</li>\n<li>Ability to perform both within a team and autonomously.</li>\n<li>Experience in office software applications such as Word, Excel, email, and browsers.</li>\n<li>Have a genuine passion for technology.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at aswathi.asok@arttechgroup.com.</p>",
        "tags": [
            "2-5 Years",
            "Service Monitoring",
            "Transaction Processing",
            "Financial Services"
        ],
        "summary": "Monitor key services for availability and performance issues. Escalate problems, improve monitoring, and provide insights. Career paths in customer care, tech support, testing, and project delivery are available."
    },
    {
        "job_title": "Recruitment Consultant",
        "company": "Opshore Talent Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/20477/168",
        "location": "Infopark",
        "closing_date": "25 Sep 2025",
        "job_description": "<h2>Recruitment Consultant</h2>\n<p>Ealoor Consultancy UK Ltd T/A Nursingjobs UK is a prominent name in the field of International Healthcare Recruitment, with <strong>23 years of experience</strong> assisting the NHS, private hospitals, private nursing homes, and other private healthcare organizations in the UK with their staffing solutions.</p>\n<p>We also provide professional consulting to employers to run the international recruitment process profitably. Having placed over 6000 healthcare professionals, we are the \"go-to\" provider for any international nurse seeking an opportunity in the UK. We take immense pride in providing highly skilled and qualified healthcare professionals to our clients, strictly adhering to the NHS code of conduct.</p>\n<h3>Qualifications and Skills:</h3>\n<ul>\n<li>Freshers can apply.</li>\n<li>Sales/Customer service skills.</li>\n<li>Good Software skills.</li>\n<li>Excellent verbal and written communication.</li>\n<li>Must be target-oriented.</li>\n<li>Must be able to work under pressure.</li>\n<li>Immediate joiners are preferred.</li>\n<li>Understanding of UK healthcare staffing and recruitment best practices, regulations, and compliance is an added advantage.</li>\n<li>Must be ready to work in UK shifts.</li>\n</ul>\n<h3>Job Details:</h3>\n<ul>\n<li><strong>Job Type:</strong> Full-time</li>\n<li><strong>Work Location:</strong> Opshore Talent Solutions, Carnival Infopark Phase - 2, Kakkanad, Kochi - 682030.</li>\n<li><strong>Work Timings:</strong> Monday to Friday, 12:30 PM to 9:30 PM IST, Saturday 10 AM to 4 PM IST (Second Saturdays Holiday).</li>\n<li>Candidates should be willing to commute/relocate.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@opshoretalentsolutions.com.</p>",
        "tags": [
            "0-2 Years",
            "Recruitment",
            "Healthcare Staffing",
            "Sales"
        ],
        "summary": "Recruitment Consultant role at Nursingjobs UK. Freshers welcome for full-time UK shift work in Kochi, focusing on healthcare staffing and client solutions. Immediate joiners preferred."
    },
    {
        "job_title": "# PHP Developer",
        "company": "Virtual Sys Technologies",
        "url": "https://infopark.in/company-jobs/details/20479/81",
        "location": "Infopark",
        "closing_date": "27 Sep 2025",
        "job_description": "<h2>PHP Developer Job Description</h2>\n<p><strong>Position Summary:</strong>\nWe are seeking a skilled PHP Developer to join our dynamic team. The ideal candidate will be responsible for developing, deploying, and maintaining web applications using PHP and related technologies. You will work closely with front-end developers, designers, and project managers to deliver high-quality web solutions that meet the needs of our clients.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Develop and Maintain Web Applications:</strong> Write clean, well-designed code to develop web applications using PHP frameworks such as Laravel, Symfony, or CodeIgniter.</li>\n<li><strong>Database Management:</strong> Design, implement, and maintain database schemas. Perform database queries and optimization using MySQL, PostgreSQL, or other database management systems.</li>\n<li><strong>Collaborate with Front-End Developers:</strong> Work alongside front-end developers to integrate user-facing elements with server-side logic. Ensure that the back-end and front-end components are consistent and perform efficiently.</li>\n<li><strong>Troubleshoot and Debug Applications:</strong> Identify and fix bugs, performance issues, and other technical problems in existing applications.</li>\n<li><strong>API Integration:</strong> Develop and integrate RESTful APIs to connect the web applications with third-party services and mobile applications.</li>\n<li><strong>Security and Data Protection:</strong> Implement security measures to protect data and applications. Ensure that applications comply with security standards and best practices.</li>\n<li><strong>Code Reviews and Best Practices:</strong> Conduct code reviews, ensure adherence to best practices, and maintain coding standards.</li>\n<li><strong>Documentation:</strong> Create and maintain technical documentation for the developed applications and APIs.</li>\n<li><strong>Stay Updated with Emerging Technologies:</strong> Keep abreast of the latest trends and advancements in PHP development and web technologies.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, or a related field. Equivalent work experience may also be considered.</li>\n<li><strong>Experience:</strong><ul>\n<li>Proven experience as a PHP Developer.</li>\n<li>Proficiency with PHP frameworks such as Laravel, Symfony, or CodeIgniter.</li>\n<li>Experience with front-end technologies such as HTML, CSS, JavaScript, and AJAX.</li>\n</ul>\n</li>\n<li><strong>Technical Skills:</strong><ul>\n<li>Strong knowledge of PHP, web frameworks, and web technologies.</li>\n<li>Experience with database management systems like MySQL, PostgreSQL, etc.</li>\n<li>Familiarity with version control systems, such as Git.</li>\n<li>Understanding of MVC design patterns.</li>\n<li>Proficient in developing and consuming RESTful APIs.</li>\n<li>Familiarity with Linux/Unix server environments and basic command-line skills.</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong><ul>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Excellent communication and teamwork abilities.</li>\n<li>Ability to manage time effectively and handle multiple tasks simultaneously.</li>\n<li>Eagerness to learn new technologies and improve skills continuously.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Relevant certifications in PHP, web development, or related fields.</li>\n<li><strong>Experience with CMS:</strong> Experience with content management systems like WordPress, Drupal, or Joomla.</li>\n<li><strong>Agile Methodologies:</strong> Experience working in an Agile/Scrum development process.</li>\n</ul>\n<p><strong>Employment Type:</strong>\nFull-time\nOn-site/Remote/Hybrid (specify based on company policy)</p>\n<p><strong>Application Process:</strong>\nTo apply, please submit your resume, cover letter, and a portfolio of your previous work or GitHub repository (if applicable).</p>\n<p>Apply directly via our job portal here: Apply Here</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs2025@virtualsystechnologies.com</p>",
        "tags": [
            "Proven experience",
            "PHP",
            "Laravel",
            "MySQL"
        ],
        "summary": "Skilled PHP Developer wanted for web application development. Responsibilities include coding, database management, API integration, and troubleshooting. Requires strong PHP and framework knowledge."
    },
    {
        "job_title": "Sr.Fullstack Developer",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/20485/182",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Sr. Full-Stack Developer</h2>\n<p>We're looking for a self-driven Senior Full-Stack Developer to independently design, build, and deliver full-stack applications while working directly with clients. This is a high-autonomy role where you'll own the project end-to-end, make technical decisions, and implement your solutions.</p>\n<h3>What You'll Do</h3>\n<ul>\n<li>Develop and maintain full-stack applications using Node.js (backend) and React.js (frontend).</li>\n<li>Build and integrate RESTful APIs for web and mobile applications.</li>\n<li>Design scalable, secure backend systems, leveraging AWS Lambda and other AWS services (EC2, S3, Aurora, RDS).</li>\n<li>Manage relational databases (Aurora/MySQL/PostgreSQL) including schema design and optimization.</li>\n<li>Take full ownership of projects: propose solutions, make architectural decisions, and implement independently.</li>\n<li>Serve as the primary technical contact for clients, gathering requirements and delivering solutions.</li>\n<li>Ensure high performance, reliability, and security across applications.</li>\n</ul>\n<h3>What You Bring</h3>\n<ul>\n<li>7+ years of full-stack development experience.</li>\n<li>Strong expertise in Node.js, React.js, and AWS Lambda.</li>\n<li>Experience with scalable backend design and microservices.</li>\n<li>Proficiency in relational databases (Aurora/MySQL/PostgreSQL) and cloud deployment.</li>\n<li>Excellent communication skills for direct client interaction.</li>\n<li>Proven ability to work independently, take ownership, and deliver high-quality results.</li>\n</ul>\n<h3>Why Join Us</h3>\n<p>If you enjoy complete project ownership, solving complex problems on your own, and seeing the direct impact of your work, this role is perfect for you. Work independently, implement your ideas, and deliver top-quality solutions directly to clients.</p>\n<h3>Application Instructions</h3>\n<p>Apply now with the subject line: “Sr. Full-Stack Developer.”</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@2hatslogic.com</p>",
        "tags": [
            "7+ Years",
            "Node.js",
            "React.js",
            "AWS Lambda"
        ],
        "summary": "Senior Full-Stack Developer to design and build applications independently. This role involves client interaction, technical decision-making, and end-to-end project ownership."
    },
    {
        "job_title": "Infosec L2 Security Analyst (Security Operations Center - Advanced)",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20475/4",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Infosec L2 Security Analyst (Security Operations Center - Advanced)</h2>\n<p><strong>Job Position:</strong> Infosec L2 Security Analyst (Security Operations Center - Advanced)\n<strong>Location:</strong> From Kochi Office (Onsite)\n<strong>Company Location:</strong> Kochi</p>\n<p><em>Preferring Male Candidates</em></p>\n<p><strong>Job Summary:</strong>\nThe L2 Security Analyst is responsible for performing advanced incident analysis, investigating security escalations from L1 analysts, conducting vulnerability assessments, and actively supporting threat hunting and malware analysis. This role acts as a critical link within the SOC by coordinating incident response efforts, ensuring compliance with security frameworks, and enhancing the organization's cybersecurity posture through diligent monitoring and remediation activities.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Monitor, analyze, and respond to alerts generated by firewalls, proxy servers, and intrusion detection/prevention systems (IDS/IPS).</li>\n<li>Perform rule tuning and assist in configuration adjustments of firewall, proxy, and IDS devices.</li>\n<li>Handle escalations from L1 analysts and conduct in-depth investigations of security incidents and alerts.</li>\n<li>Perform comprehensive log analysis, root cause analysis, threat hunting and forensic examinations.</li>\n<li>Coordinate with stakeholders across IT, security, and business units to implement incident response and remediation.</li>\n<li>Execute vulnerability assessments using tools like Nessus and Qualys; manage patching activities in coordination with relevant teams.</li>\n<li>Participate in continuous threat hunting exercises and malware analysis to identify emerging threats.</li>\n<li>Ensure adherence to security policies, standards, and regulatory frameworks such as ISO 27001, PCI DSS, and GDPR.</li>\n<li>Maintain and update incident response playbooks; contribute to SOC process improvements.</li>\n<li>Provide technical guidance and mentoring to L1 analysts.</li>\n<li>Prepare detailed incident reports and documentation for stakeholders.</li>\n</ul>\n<p><strong>Required Experience and Qualifications:</strong></p>\n<ul>\n<li>2 to 5 years of experience in cybersecurity operations, SOC, or IT infrastructure security.</li>\n<li>Proven expertise with SIEM platforms (e.g., Splunk, QRadar), endpoint protection, and threat detection solutions.</li>\n<li>Hands-on experience with vulnerability management tools such as Nessus, Qualys, or equivalent.</li>\n<li>Familiarity with regulatory standards and compliance requirements (ISO 27001, PCI DSS, GDPR preferred).</li>\n<li>Relevant security certifications such as CEH, CompTIA Security+, or equivalent are highly desirable.</li>\n<li>Strong analytical, problem-solving skills, and attention to detail.</li>\n<li>Effective communication skills with ability to liaise across technical and non-technical teams.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Knowledge of malware analysis and computer forensic techniques.</li>\n<li>Experience with scripting languages (Python, Bash) for automation and security tool enhancement.</li>\n<li>Understanding of network security protocols and firewall management.</li>\n<li>Ability to work collaboratively under pressure in a fast-paced, 24/7 operational environment.</li>\n</ul>\n<p><strong>Contact Information:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at chandini.m@arttechgroup.com</p>",
        "tags": [
            "2-5 Years",
            "SIEM",
            "Vulnerability Management",
            "Incident Response"
        ],
        "summary": "Advanced L2 Security Analyst needed for SOC in Kochi. Responsibilities include incident analysis, threat hunting, and vulnerability assessments."
    },
    {
        "job_title": "Engineering Lead",
        "company": "AVENTUS INFORMATICS",
        "url": "https://infopark.in/company-jobs/details/20482/148",
        "location": "Infopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Engineering Lead</h2>\n<p>We are seeking a highly skilled Engineering Lead to offer technical guidance, oversee several projects, and facilitate communication between clients and internal teams. This position demands a blend of practical technical skills, architectural planning, client interaction, and team leadership.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Provide comprehensive leadership throughout the entire lifecycle of multiple simultaneous projects, from design to delivery.</li>\n<li>Establish and enforce project architectures that are robust, scalable, and secure, aligning with business needs.</li>\n<li>Engage with clients to understand their needs, present solutions, and maintain excellent stakeholder relationships.</li>\n<li>Lead engineering teams by delegating tasks, tracking progress, and ensuring projects are completed within schedule.</li>\n<li>Champion execution through Agile methodologies, guaranteeing the delivery of high-quality results.</li>\n<li>Act as a central point of communication between clients, product managers, and technical teams, ensuring clarity and alignment.</li>\n<li>Mentor and develop engineers, cultivating an environment of learning, responsibility, and ongoing enhancement.</li>\n<li>Uphold organizational standards, security protocols, and relevant industry regulations.</li>\n</ul>\n<h3>Required Qualifications:</h3>\n<ul>\n<li>A proven history of success in roles such as Engineering Lead, Technical Lead, or Senior Software Engineer.</li>\n<li>Profound knowledge across the full technology spectrum, encompassing frontend, backend, databases, and cloud infrastructure.</li>\n<li>Demonstrated experience in designing enterprise-level architectures and systems engineered for scalability.</li>\n<li>Experience managing multiple projects characterized by complex demands and strict deadlines.</li>\n<li>A thorough understanding of Agile project management frameworks.</li>\n<li>Outstanding leadership, interpersonal, and communication abilities, with a focus on client engagement.</li>\n<li>Strong aptitude for analysis and problem-solving.</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>The chance to lead significant projects for international clients.</li>\n<li>A work environment that values collaboration and innovation.</li>\n<li>Opportunities for career advancement and leadership training.</li>\n<li>A competitive salary and benefits package.</li>\n</ul>\n<p>If this role matches your career aspirations, please send your updated resume to hr@aventusinformatics.com.</p>",
        "tags": [
            "5+ Years",
            "Agile Methodologies",
            "Architecture Design",
            "Team Management"
        ],
        "summary": "Lead technical design, development, and delivery of multiple projects. Requires strong architecture, client engagement, and team management skills."
    },
    {
        "job_title": "Delphi Developer",
        "company": "SparkSupport Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20483/63",
        "location": "Infopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Delphi Developer</h2>\n<p><strong>Company:</strong> SparkSupport Infotech Pvt Ltd\n<strong>Location:</strong> Carnival Infopark, Kochi, Kerala\n<strong>Experience:</strong> 5+ Years\n<strong>Employment Type:</strong> Full-time - Permanent\n<strong>Work Mode:</strong> On-site/Hybrid\n<strong>Shift:</strong> Regular Shift</p>\n<h3>Job Summary:</h3>\n<p>Sparksupport is seeking an expert Delphi programmer to join our software development company in Kochi, supporting our customers in the Netherlands remotely. The ideal candidate will have a strong background in analyzing problems and recommending solutions, with the ability to manage and train a team technically.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Expert in research, design, creation, and implementation of Delphi VCL systems based on end-user requirements.</li>\n<li>Resolve issues related to Delphi VCL and provide corrective measures.</li>\n<li>Test applications and perform bug fixes.</li>\n<li>Develop best practices for application design and development.</li>\n<li>Possess knowledge of Delphi object-oriented programming.</li>\n<li>Lead and manage a team, reporting on risks, issues, and dependencies.</li>\n<li>Work in coordination with other technical and non-technical teams.</li>\n<li>Provide technical training and develop/follow coding standards.</li>\n</ul>\n<h3>Required Technical Skills:</h3>\n<ul>\n<li>Minimum 5+ years in the software industry as a Delphi programmer.</li>\n<li>Strong programming experience in Delphi advanced concepts and object-oriented knowledge.</li>\n<li>Must have good hands-on experience in Delphi migration projects.</li>\n<li>Must have component development experience.</li>\n<li>Must have worked on Delphi versions: 7.x to 10.x releases.</li>\n<li>Minimum 5+ years of development experience using third-party components like Dev Express.</li>\n<li>Experience with Database Management Systems such as MS SQL, MySQL, and others.</li>\n<li>Exposure to Git/Bitbucket.</li>\n<li>Strong UI/UX background is a plus.</li>\n<li>Experience with tools like JIRA, Confluence, Bitbucket, Jenkins.</li>\n<li>Basic knowledge of Java is required.</li>\n</ul>\n<h3>Non-Technical Skills:</h3>\n<ul>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Excellent written and oral communication in English.</li>\n<li>Strong listening and interpersonal communication skills.</li>\n<li>Strong presentation and documentation skills.</li>\n<li>Good team player, with the ability to motivate and lead a team.</li>\n<li>Motivated to learn new functional areas.</li>\n<li>Willingness to travel to Europe for client visits (1-2 weeks).</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@sparksupport.com</p>",
        "tags": [
            "5+ Years",
            "Delphi",
            "SQL",
            "Git"
        ],
        "summary": "Seeking an expert Delphi developer with 5+ years of experience to research, design, and implement VCL systems. Responsibilities include team management, training, and remote client support."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "Jachoos Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/20481/363",
        "location": "Infopark",
        "closing_date": "22 Oct 2025",
        "job_description": "<h2>Digital Marketing Executive</h2>\n<p><strong>Location:</strong> Cochin, Kerala\n<strong>Experience Required:</strong> 2 years</p>\n<p><strong>Job Overview:</strong>\nWe are seeking a highly motivated and skilled Digital Marketing Executive (Male/Female) to join our team in Cochin. The ideal candidate will have hands-on experience in managing digital marketing campaigns, with a strong focus on Meta (Facebook &amp; Instagram) and LinkedIn platforms.</p>\n<p><strong>Key Responsibilities:</strong>\n- Plan, execute, and optimize paid campaigns across Meta and LinkedIn.\n- Monitor campaign performance, analyze metrics, and generate performance reports.\n- Conduct keyword research and audience targeting to maximize campaign reach and ROI.\n- Collaborate with the creative team to develop engaging ad creatives and content.\n- Stay updated with the latest trends, tools, and best practices in digital marketing.\n- Manage budgets efficiently and ensure campaigns meet performance goals.\n- Support the overall digital marketing strategy, including SEO, email, and content marketing initiatives when required.</p>\n<p><strong>Requirements:</strong>\n- Minimum 2 years of experience in digital marketing.\n- Proven expertise in Meta Ads Manager and LinkedIn Campaign Manager.\n- Strong analytical skills with the ability to interpret data and optimize campaigns.\n- Knowledge of SEO, Google Ads, and analytics tools is an added advantage.\n- Excellent communication and teamwork skills.\n- Ability to work independently and manage multiple campaigns simultaneously.</p>\n<p><strong>Preferred Qualifications:</strong>\n- Certification in digital marketing platforms (Google, Meta, LinkedIn) is a plus.\n- Agency background or experience managing multiple client accounts will be an advantage.</p>\n<p><strong>Job Types:</strong> Full-time, Permanent</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at nimit@jachoos.com.</p>",
        "tags": [
            "2+ Years",
            "Meta Ads",
            "LinkedIn Campaign Manager",
            "Digital Marketing"
        ],
        "summary": "Seeking a Digital Marketing Executive in Cochin with 2 years of experience. Responsibilities include managing Meta and LinkedIn campaigns, analyzing performance, and optimizing ROI."
    },
    {
        "job_title": "PHP Intern",
        "company": "NDimensionZ Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/20484/209",
        "location": "Infopark",
        "closing_date": "22 Oct 2025",
        "job_description": "<h2>PHP Intern</h2>\n<p><strong>Position:</strong> PHP Intern\n<strong>Mode:</strong> Work from Office\n<strong>Duration:</strong> 3 Months Internship</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in the development and maintenance of web applications using PHP, MySQL, and related technologies.</li>\n<li>Write clean, efficient, and well-documented code under the guidance of mentors.</li>\n<li>Work with front-end developers to integrate user-facing elements with server-side logic.</li>\n<li>Debug, test, and troubleshoot issues in existing applications.</li>\n<li>Research and learn new technologies, frameworks, and tools as required.</li>\n<li>Participate in code reviews and contribute ideas to improve functionality and efficiency.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Basic knowledge of Core PHP and understanding of OOPs concepts.</li>\n<li>Familiarity with HTML, CSS, JavaScript, and MySQL.</li>\n<li>Understanding of MVC frameworks (Laravel/CodeIgniter) is a plus.</li>\n<li>Good problem-solving skills and eagerness to learn.</li>\n<li>Strong communication skills and ability to work in a team.</li>\n</ul>\n<h3>Eligibility:</h3>\n<ul>\n<li>Students pursuing B.Tech / MCA / B.Sc. (CS/IT) or recent graduates.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at sandhya.benoj@ndimensionz.com</p>",
        "tags": [
            "0-1 Years",
            "PHP",
            "MySQL",
            "Web Development"
        ],
        "summary": "Seeking a PHP Intern for a 3-month, work-from-office role. Responsibilities include assisting in web application development and learning new technologies."
    },
    {
        "job_title": "Python Django Developer",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/20476/401",
        "location": "Infopark",
        "closing_date": "22 Oct 2025",
        "job_description": "<h2>Python Django Developer</h2>\n<p><strong>Experience:</strong> 3+ Years</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Write clean, efficient, and reusable Python code.</li>\n<li>Develop and maintain web applications and backend services.</li>\n<li>Design and implement RESTful APIs and microservices.</li>\n<li>Work with relational and NoSQL databases (PostgreSQL, MongoDB, MySQL).</li>\n<li>Automate processes using Python scripts and cron jobs.</li>\n<li>Implement data processing pipelines for analytics and AI models.</li>\n<li>Optimize code performance and memory management.</li>\n<li>Collaborate with cross-functional teams to design scalable solutions.</li>\n<li>Ensure security best practices in data handling and API authentication.</li>\n<li>Stay up to date with Python libraries, frameworks, and best practices.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at joinus@pearlsofttechnologies.com</p>",
        "tags": [
            "3+ Years",
            "Python",
            "Django",
            "RESTful APIs"
        ],
        "summary": "Seeking a Python Django Developer with 3+ years of experience. Develop web applications, backend services, and APIs, working with databases and ensuring best practices."
    },
    {
        "job_title": "Business Analyst",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/23726",
        "location": "Technopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Business Analyst at QWY Software (P) Ltd</h2>\n<p><strong>Location:</strong> Trivandrum, India (Technopark Phase 1)\n<strong>Company:</strong> QWY Software (P) Ltd\n<strong>Industry:</strong> IT/ITES (E-commerce, Logistics, Hyperlocal Delivery Services)</p>\n<p><strong>Contact:</strong> careers@qwysoft.com</p>\n<p><strong>Closing Date:</strong> October 10, 2025\n<strong>Job Published:</strong> September 22, 2025</p>\n<h3>Job Description:</h3>\n<p>QWY Software (P) Ltd is seeking a motivated Business Analyst to join our dynamic team. The ideal candidate will bridge the gap between business needs and technical solutions, focusing on our e-commerce, logistics, and hyperlocal delivery services.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Collaborate with stakeholders to understand and document problem statements and requirements.</li>\n<li>Conduct market studies to analyze competitor approaches to similar issues.</li>\n<li>Identify and evaluate potential solutions in the market.</li>\n<li>Engage with the business team to finalize feasible solutions.</li>\n<li>Prepare technical documents for requirements.</li>\n<li>Coordinate with the internal development team for discussions and timeline reviews.</li>\n<li>Create and assign tickets in Redmine for development tracking.</li>\n<li>Maintain stakeholder communication, providing regular progress updates and sample screens.</li>\n<li>Perform implementation-level testing on the staging environment.</li>\n<li>Identify, raise, and work with testers to resolve bugs.</li>\n<li>Conduct overall testing for release-related features.</li>\n<li>Provide User Acceptance Testing (UAT) support to stakeholders.</li>\n<li>Collect and address stakeholder feedback, prioritizing critical issues.</li>\n<li>Perform post-release implementation testing.</li>\n<li>Prepare and document release notes.</li>\n<li>Organize weekly meetings with BA stakeholders to discuss progress.</li>\n<li>Ensure timely closure and resolution of all raised tickets.</li>\n<li>Assist the BA in generating reports for order analysis, driver utilization, and violations.</li>\n</ul>\n<h3>Preferred Skills and Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in MCA, BTech, BCA+MBA, BSc CS+MBA, or a related field.</li>\n<li><strong>1-4 years</strong> of experience in business analysis, software development, or related roles.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to work collaboratively and manage multiple tasks effectively.</li>\n<li>Calm, patient, and pleasant demeanor.</li>\n<li>Willingness to travel as needed.</li>\n<li>Good understanding of the Software Development Life Cycle (SDLC).</li>\n<li>Strong documentation skills with keen attention to detail.</li>\n<li>Ability to work independently and take initiative.</li>\n</ul>\n<p><strong>To Apply:</strong>\nInterested candidates are requested to share their CV to <strong>careers@qwysoft.com</strong> with the subject line \"Business Analyst\".</p>",
        "tags": [
            "1-4 Years",
            "Business Analysis",
            "SDLC",
            "Documentation"
        ],
        "summary": "Seeking a Business Analyst to collaborate with stakeholders, gather requirements, and work with development teams. Responsibilities include market analysis, testing, and communication for IT/ITES projects."
    },
    {
        "job_title": "Presales Executive – IT Software",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/23725",
        "location": "Technopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Presales Executive – IT Software</h2>\n<p><strong>Company:</strong> QWY Software (P) Ltd\n<strong>Location:</strong> Trivandrum, India (Technopark Phase 1)\n<strong>Published:</strong> September 22, 2025\n<strong>Closing Date:</strong> October 10, 2025\n<strong>Contact:</strong> careers@qwysoft.com</p>\n<p><strong>Industry Focus:</strong> IT/ITES covering E-com, Logistics, and Hyperlocal Delivery Services.</p>\n<h3>Brief Description</h3>\n<p>Understand customer needs, shape solutions, and deliver compelling demos and trainings that move deals forward. This role blends customer conversations, technical work (POCs, integrations testing), and collaboration with Product and Engineering.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Qualify opportunities and map customer pain points to product capabilities.</li>\n<li>Plan, prepare, and deliver tailored product presentations, demos, and walkthroughs.</li>\n<li>Run structured discovery; document use cases, success criteria, and solution fit.</li>\n<li>Draft solution proposals, configurations, and effort estimates aligned to requirements.</li>\n<li>Build/assist POCs and pilots (environment setup, workflow config, basic data prep, API trials).</li>\n<li>Ensure proposed architectures are feasible, scalable, secure, and competitive with market offerings.</li>\n<li>Provide timely technical clarifications during the sales cycle; coordinate smooth handover to Delivery/Implementation.</li>\n<li>Capture and relay client feedback, feature requests, and edge cases to Product, and track through release.</li>\n<li>Maintain presales assets (demo scripts, sample datasets, architecture diagrams, use-case libraries).</li>\n<li>Monitor industry trends and competitor offerings; synthesize insights for Product and Sales.</li>\n<li>Enable internal users/stakeholders with training on new or refreshed features and technical talking points.</li>\n<li>Represent the company at ONDC/industry and domain forums; share takeaways internally and drive follow-up actions.</li>\n<li>Generate qualified leads via outbound outreach, networking, and partner channels; maintain prospect list in CRM.</li>\n<li>Convert leads into opportunities and new customer projects by running discovery calls and driving proposals/POCs to commitment.</li>\n<li>Collaborate with Marketing on campaigns and forecast pipeline contribution.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, Engineering, or equivalent experience.</li>\n<li>1–3 years in presales, solution engineering, or technical consulting within software/SaaS.</li>\n<li>Strong communication and presentation skills; comfortable with both business and technical audiences.</li>\n<li>Demonstrated problem-solving ability and a customer-centric mindset.</li>\n<li>Working knowledge of software stacks (e.g., cloud services—AWS, APIs, web apps, databases).</li>\n<li>Familiarity with CRM and collaboration tools.</li>\n<li>Experience preparing architecture diagrams and professional decks (PowerPoint/Slides).</li>\n<li>Domain knowledge in logistics, e-commerce, ERP, or delivery/fleet management.</li>\n</ul>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Location:</strong> Bangalore, Karnataka</p>\n<p><strong>Interested Candidates:</strong> Please share your CV to careers@qwysoft.com with the Subject line \"Presales Executive\".</p>",
        "tags": [
            "1-3 Years",
            "Presales",
            "Logistics",
            "E-commerce"
        ],
        "summary": "Seeking a Presales Executive for IT software solutions in e-commerce and logistics. Responsibilities include understanding client needs, delivering demos, and driving sales cycles."
    },
    {
        "job_title": "Product Engineer",
        "company": "Gemini Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23724",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Product Engineer at GEMINI SOFTWARE SOLUTIONS (P) Ltd</h2>\n<p><strong>Company:</strong> GEMINI SOFTWARE SOLUTIONS (P) Ltd\n<strong>Location:</strong> 414 - 415, NILA, TECHNOPARK, TRIVANDRUM, 685581\n<strong>Website:</strong> http://www.GeminiSoftware.com\n<strong>Contact Email:</strong> careers@geminisoftware.com\n<strong>Closing Date:</strong> October 31, 2025\n<strong>Job Published:</strong> September 22, 2025</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop, test, and deploy responsive and interactive web applications using MVC architecture with client-side JavaScript frameworks.</li>\n<li>Collaborate with UI/UX designers to translate design mock-ups into functional and visually appealing web applications.</li>\n<li>Write clean, maintainable, and efficient code following best practices and coding standards.</li>\n<li>Optimize web applications for performance, scalability, and cross-browser compatibility.</li>\n<li>Troubleshoot and debug issues to ensure smooth and efficient application performance.</li>\n<li>Participate in code reviews and contribute to the continuous improvement of development processes.</li>\n<li>Remain updated with the latest technologies and contribute innovative ideas for product enhancement.</li>\n<li>Demonstrate agility in learning and adapting to the logistics domain and apply the same in solving the same on our platform.</li>\n</ul>\n<h3>Qualifications and Experience:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field.</li>\n<li>2-4 Years of experience in software development in .NET technologies.</li>\n<li><strong>Preference</strong> to candidates who have experience in WMS or Logistics IT services products.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Key Skills:</strong><ul>\n<li>Proficiency in C#, JavaScript, jQuery, ASP.NET Core, Web API, HTML, and CSS.</li>\n<li>Strong skills in SQL Server development, capable of handling complex requirements and optimizing techniques for maximum query performance.</li>\n<li>Develop and enhance RESTful APIs that are efficient, scalable, and compliant with industry standards, facilitating seamless integration with external systems and services.</li>\n</ul>\n</li>\n</ul>",
        "tags": [
            "2-4 Years",
            ".NET",
            "JavaScript",
            "SQL Server"
        ],
        "summary": "Seeking a Product Engineer with 2-4 years of .NET experience to develop web applications. Must be proficient in C#, JavaScript, and SQL Server, with a focus on logistics domain."
    },
    {
        "job_title": "Technical Support - L2 (.NET)",
        "company": "Gemini Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23723",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Technical Support - L2 (.NET)</h2>\n<p><strong>Company:</strong> GEMINI SOFTWARE SOLUTIONS (P) Ltd\n<strong>Address:</strong> 414 - 415, NILA, TECHNOPARK, TRIVANDRUM, 685581\n<strong>Website:</strong> http://www.GeminiSoftware.com\n<strong>Contact Email:</strong> careers@geminisoftware.com\n<strong>Job Published:</strong> 22, Sept 2025\n<strong>Closing Date:</strong> 31 Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking 2 enthusiastic Technical Support personnel with basic .NET &amp; MS SQL development exposure within 1 to 1.5 years of experience to join our dynamic team. The successful candidate will be responsible for technically supporting client queries as well as assisting the development team in maintaining high-quality software applications using the .NET framework. The ideal candidate should have good communication skills, a solid understanding of software development principles, excellent problem-solving skills, and the ability to work both independently and collaboratively in a fast-paced environment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Provide technical support and assistance to end-users.</li>\n<li>Troubleshoot, debug, and resolve issues in existing software applications.</li>\n<li>Support, develop, test, and maintain software applications using the .NET Core framework.</li>\n<li>Document software designs, processes, and procedures.</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Write clean, scalable, and maintainable code following best practices.</li>\n<li>Participate in code reviews to ensure code quality and adherence to coding standards.</li>\n</ul>\n<h3>Qualifications and Experience:</h3>\n<ul>\n<li><strong>Education:</strong> Bachelor’s degree in computer science, engineering, or a related field.</li>\n<li><strong>Experience:</strong> Minimum 1 Year in software development (.Net, .Net Core) or technical support. We are looking for skilled candidates with 1.0 to 1.5 years of experience only.</li>\n<li><strong>Added Advantage:</strong> Experience in Banking Domain.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Good communication and interpersonal skills.</li>\n<li>Working knowledge in C#, ASP.NET Core, and REST API.</li>\n<li>Working knowledge in SQL Server programming.</li>\n<li>Working knowledge of front-end technologies such as HTML, CSS, and JavaScript.</li>\n<li>Familiarity with microservices architecture.</li>\n<li>Experience with unit testing frameworks.</li>\n<li>Understanding of DevOps principles and practices.</li>\n<li>Understanding of object-oriented programming principles.</li>\n</ul>\n<p><strong>Note:</strong> Selected candidates may be required to work in shifts.</p>",
        "tags": [
            "1-1.5 Years",
            ".NET Core",
            "MS SQL",
            "C#"
        ],
        "summary": "Seeking a Technical Support - L2 (.NET) professional with 1-1.5 years of experience. Responsibilities include client support, software maintenance, and development using .NET Core and MS SQL."
    },
    {
        "job_title": "Software Testing Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/23722",
        "location": "Technopark",
        "closing_date": "04 Oct 2025",
        "job_description": "<h2>Software Testing Trainee</h2>\n<p><strong>Company:</strong> ZenturioTech (P) Ltd\n<strong>Location:</strong> Trivandrum\n<strong>Contact Email:</strong> admin@zenturiotech.com\n<strong>Closing Date:</strong> 04, Oct 2025\n<strong>Job Published:</strong> 22, Sept 2025</p>\n<h3>About the Role:</h3>\n<p>ZenturioTech is looking for a motivated and detail-oriented Software Testing Trainee to support our QA and software testing initiatives. This is an excellent opportunity to gain hands-on experience in software testing processes, tools, and best practices while learning from experienced professionals in a dynamic tech environment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in creating and executing manual test cases for web and mobile applications.</li>\n<li>Support the QA team in identifying, documenting, and tracking software defects.</li>\n<li>Participate in functional, regression, and exploratory testing under guidance.</li>\n<li>Help prepare test reports and track testing metrics.</li>\n<li>Collaborate with developers to understand requirements and troubleshoot issues.</li>\n<li>Gain exposure to automated testing tools and scripts as required.</li>\n</ul>\n<h3>Qualifications &amp; Skills:</h3>\n<ul>\n<li>Currently pursuing or recently completed a degree in Computer Science, IT, or a related field.</li>\n<li>Basic understanding of software development life cycle (SDLC) and software testing life cycle (STLC).</li>\n<li>Familiarity with concepts like functional testing, regression testing, and bug tracking.</li>\n<li>Knowledge of testing tools like Jira, TestRail, or Selenium is a plus.</li>\n<li>Good analytical, problem-solving, and communication skills.</li>\n<li>Eager to learn and adapt in a fast-paced technology environment.</li>\n</ul>\n<h3>What You'll Gain:</h3>\n<ul>\n<li>Hands-on experience in software testing for real-world applications.</li>\n<li>Exposure to QA processes, test case design, and defect management.</li>\n<li>Mentorship from experienced QA and software professionals.</li>\n<li>Opportunity to transition into a full-time QA or Software Testing role based on performance.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume to admin@zenturiotech.com with the subject line “Software Testing Trainee – Application”.</p>",
        "tags": [
            "0-2 Years",
            "Jira",
            "Selenium",
            "TestRail"
        ],
        "summary": "Seeking a Software Testing Trainee in Trivandrum. Learn and gain hands-on experience in software testing processes and tools. Opportunity for full-time role based on performance."
    },
    {
        "job_title": "Software Developer  - React",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/23721",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Software Developer - React</h2>\n<p><strong>Company:</strong> ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Experience:</strong> 4 – 6 years\n<strong>Joining:</strong> Immediate joiners preferred\n<strong>Closing Date:</strong> 30 September 2025\n<strong>Job Published:</strong> 22 September 2025</p>\n<p><strong>Contact Email:</strong> recruitment@ateamsoftsolutions.com\n<strong>Contact Number:</strong> +91 7907410058</p>\n<p><strong>Brief Description:</strong>\nJoin us at ATeam InfoSoft Solutions, Technopark, to lead impactful projects and build next-generation web applications. We are seeking an experienced React Developer with strong expertise in ReactJS, Next.js, and Redux to contribute to the development of high-performing web applications.</p>\n<h2>Key Responsibilities:</h2>\n<ul>\n<li>Design, develop, and deploy modern web applications using React.js and Next.js.</li>\n<li>Collaborate with product owners, designers, and backend teams to deliver seamless solutions.</li>\n<li>Ensure performance, quality, and responsiveness of applications.</li>\n<li>Conduct code reviews and maintain best practices.</li>\n<li>Work with GraphQL, React Query, and WebSockets to deliver scalable, real-time solutions.</li>\n<li>Stay updated with emerging front-end technologies and industry trends.</li>\n</ul>\n<h2>Required Technical Skills:</h2>\n<ul>\n<li>Strong expertise in React.js and Next.js (SSR, SSG, API routes).</li>\n<li>Proficiency in JavaScript (ES6+), HTML5, CSS3, and Tailwind CSS.</li>\n<li>Experience with Redux or Zustand for state management.</li>\n<li>Familiarity with GraphQL and React Query.</li>\n<li>Hands-on experience with WebSockets and real-time communication.</li>\n<li>Solid knowledge of build tools such as Webpack/Vite and Git workflow.</li>\n</ul>\n<h2>Why Join Us:</h2>\n<ul>\n<li>Exposure to exciting projects with global clients.</li>\n<li>Collaborative and innovative work culture.</li>\n<li>Opportunities for continuous learning and career growth.</li>\n</ul>\n<h2>Preferred Skills (Added Advantage):</h2>\n<ul>\n<li>Proven ability to lead a team of 4+ developers.</li>\n<li>Experience in project estimation &amp; delivery planning.</li>\n<li>Practical experience with Firebase (Auth, Firestore, Messaging, Storage, etc.).</li>\n<li>Experience in WebSockets.</li>\n</ul>\n<p><strong>Apply Now:</strong> recruitment@ateamsoftsolutions.com</p>",
        "tags": [
            "4-6 Years",
            "React.js",
            "Next.js",
            "GraphQL"
        ],
        "summary": "Experienced React Developer needed for next-gen web app development. Must have expertise in ReactJS, Next.js, and Redux. Join a collaborative team in Technopark."
    },
    {
        "job_title": "SALES AND MARKETING EXECUTIVE",
        "company": "Scalgo Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23720",
        "location": "Technopark",
        "closing_date": "06 Nov 2025",
        "job_description": "<h2>Sales and Marketing Executive at SCALGO TECHNOLOGIES (P) Ltd</h2>\n<p><strong>Company:</strong> SCALGO TECHNOLOGIES (P) Ltd\n<strong>Location:</strong> 1st Floor, M Squared Building, Annex 1, Technopark Campus, Karyavattam, Trivandrum, Kerala, 695581\n<strong>Website:</strong> https://www.scalgo.net</p>\n<p><strong>Contact Email:</strong> hrteam@scalgo.net</p>\n<p><strong>Job Published:</strong> September 22, 2025\n<strong>Closing Date:</strong> November 06, 2025</p>\n<h3>Brief Description</h3>\n<p>SCALGO TECHNOLOGIES is seeking a proactive and experienced Sales and Marketing Executive with a background in the IT industry. The successful candidate will be responsible for taking ownership of our product, driving business growth, and cultivating strong client relationships.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Actively search for new business opportunities and identify important prospects through networking and research.</li>\n<li>Acquire new clients for the organization while retaining existing ones, acting as the key point of contact.</li>\n<li>Conduct product demonstrations and presentations to prospective clients, negotiate contracts, and finalize sales deals.</li>\n<li>Collaborate with other departments to enhance and maintain customer experience.</li>\n<li>Attend industry events and trade shows to promote products and services.</li>\n<li>Schedule and attend discovery calls, conduct product demos, follow up with existing clients, collect feedback, and maintain business relationships.</li>\n<li>Identify new sales opportunities through cold calling, emailing, and networking events, initiating contact with relevant prospects.</li>\n<li>Prepare quarterly sales reports detailing targets, trends, and highlights, and analyze data to refine sales strategies.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, or a related field.</li>\n<li>3+ years of experience in sales, preferably within the IT industry.</li>\n<li>Proven track record of consistently meeting and exceeding sales targets.</li>\n<li>In-depth knowledge of IT products and services.</li>\n<li>Strong problem-solving and decision-making skills, with demonstrable knowledge of sales techniques and strategies.</li>\n<li>Excellent interpersonal skills, research capabilities, negotiation skills, and essential analytical capabilities.</li>\n<li>Excellent communication and presentation skills.</li>\n<li>Ability to work independently and collaboratively within a team.</li>\n<li>Proficiency in CRM and lead generation platforms such as LinkedIn Sales Navigator, Salesforce, and HubSpot.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates are invited to apply by sending their resume to hrteam@scalgo.net with the subject line: \"Application Submission: Sales and Marketing Executive\".</p>",
        "tags": [
            "3+ Years",
            "Sales",
            "IT Industry",
            "CRM"
        ],
        "summary": "Seeking an experienced IT Sales Executive to drive business growth and client relationships. Responsibilities include prospecting, sales, and reporting. Requires 3+ years of IT sales experience."
    },
    {
        "job_title": "Senior Python Developer",
        "company": "Scalgo Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23719",
        "location": "Technopark",
        "closing_date": "06 Nov 2025",
        "job_description": "<h2>Senior Python Developer</h2>\n<p><strong>Company:</strong> SCALGO TECHNOLOGIES (P) Ltd\n<strong>Location:</strong> Technopark Campus, Karyavattom, Trivandrum, Kerala\n<strong>Website:</strong> https://www.scalgo.net\n<strong>Published Date:</strong> 22, Sept 2025\n<strong>Closing Date:</strong> 06, Nov 2025</p>\n<p><strong>Contact Email:</strong> hrteam@scalgo.net</p>\n<h3>Brief Description:</h3>\n<p>We are seeking talented and experienced Senior Backend Developers with a strong proficiency in Python and the Django framework to join our growing development team. Interested candidates are invited to apply by sending their resume to hrteam@scalgo.net with the subject “Application Submission: Senior Python Developer- Django\".</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop and maintain server-side applications using Python and the Django framework.</li>\n<li>Design and implement RESTful APIs to support frontend functionalities and integration with external services.</li>\n<li>Collaborate with frontend developers to ensure seamless integration between server-side and client-side components.</li>\n<li>Optimize application performance and scalability through efficient coding, caching, and database query optimization.</li>\n<li>Write unit tests and conduct thorough code reviews to ensure code quality and maintainability.</li>\n<li>Troubleshoot and debug issues reported by users or identified during testing phases.</li>\n<li>Collaborate with the product team to understand requirements, provide technical insights, and propose innovative solutions.</li>\n<li>Stay up-to-date with industry trends and best practices in backend development and recommend improvements to enhance development processes.</li>\n<li>Collaborate with cross-functional teams to gather requirements and deliver cloud-based solutions.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Engineering, or a related field.</li>\n<li>7+ years of professional experience as a Back-end Developer, with a strong focus on Python and Django.</li>\n<li>Proficiency in Python and the Django framework, along with a good understanding of object-oriented programming principles.</li>\n<li>Experience in designing and developing RESTful APIs using Django REST Framework.</li>\n<li>Solid experience with one or more cloud platforms: AWS, Google Cloud Platform (GCP), or Azure.</li>\n<li>Strong knowledge of database systems such as PostgreSQL or MySQL, including database design and optimization.</li>\n<li>Solid understanding of software development best practices, including coding standards, code reviews, and testing methodologies.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and collaboration abilities, with the capacity to work effectively in a team environment.</li>\n<li>Familiarity with frontend technologies like HTML, CSS, and JavaScript is a plus.</li>\n<li>Experience with version control systems, such as Git, and collaborative development workflows.</li>\n</ul>\n<p><strong>Contact:</strong> hrteam@scalgo.net</p>",
        "tags": [
            "7+ Years",
            "Python",
            "Django",
            "AWS"
        ],
        "summary": "Seeking experienced Senior Python Developers proficient in Django to build and optimize backend applications. Responsibilities include API design, cloud solutions, and code quality assurance."
    },
    {
        "job_title": "Technical Architect",
        "company": "Scalgo Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23718",
        "location": "Technopark",
        "closing_date": "06 Nov 2025",
        "job_description": "<h2>Technical Architect at SCALGO TECHNOLOGIES (P) Ltd</h2>\n<p><strong>Company:</strong> SCALGO TECHNOLOGIES (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala\n<strong>Contact Email:</strong> hrteam@scalgo.net\n<strong>Application Deadline:</strong> November 6, 2025</p>\n<h3>Job Summary</h3>\n<p>SCALGO TECHNOLOGIES is seeking an experienced Technical Architect with over 10 years of experience to lead the design, development, and optimization of open-source solutions. The ideal candidate will possess a strong technical foundation in software architecture and open-source technologies, with a dedication to maintaining high-quality code through rigorous reviews. This is a hands-on leadership role requiring the ability to guide teams, implement best practices, and deliver robust, scalable solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and implement scalable, secure, high-performance architectures for open-source applications.</li>\n<li>Select appropriate tools, frameworks, and libraries to meet project and business requirements.</li>\n<li>Lead end-to-end technical project delivery, ensuring adherence to quality standards and best practices.</li>\n<li>Conduct thorough code reviews to uphold coding standards, architectural guidelines, and design patterns.</li>\n<li>Address and resolve technical debt, performance bottlenecks, and security vulnerabilities.</li>\n<li>Establish and enforce coding standards, development guidelines, and best practices.</li>\n<li>Champion the adoption of open-source tools and frameworks, and contribute to open-source projects.</li>\n<li>Collaborate effectively with product managers, UI/UX designers, and DevOps engineers.</li>\n<li>Mentor developers, fostering a culture of continuous learning and improvement.</li>\n<li>Serve as the technical expert, tackling complex challenges and removing roadblocks.</li>\n<li>Remain current with industry trends, tools, and technologies.</li>\n<li>Identify opportunities for enhancing system performance, scalability, and maintainability.</li>\n<li>Foster innovation and experimentation to advance technical capabilities.</li>\n</ul>\n<h3>Required Skills and Qualifications</h3>\n<ul>\n<li><strong>Experience:</strong> 10+ years of software development experience, with at least 3 years in an architectural role. Proven experience leading open-source projects from inception to delivery.</li>\n<li><strong>Programming:</strong> Strong proficiency in Java, Python, GoLang, or JavaScript.</li>\n<li><strong>Open-Source:</strong> Deep understanding of open-source frameworks, libraries, and tools. Proven track record of contributing to or maintaining open-source projects.</li>\n<li><strong>Architecture:</strong> Expertise in architecture patterns such as microservices, event-driven architecture, and serverless.</li>\n<li><strong>Code Quality:</strong> Strong grasp of clean code principles, SOLID design patterns, and refactoring techniques. Experience conducting code reviews for large, distributed teams.</li>\n<li><strong>Cloud &amp; DevOps:</strong> Familiarity with cloud platforms (AWS, GCP, Azure) and CI/CD pipelines. Experience with containerization and orchestration tools (Docker, Kubernetes).</li>\n<li><strong>Version Control:</strong> Strong knowledge of Git, GitHub, and version control best practices.</li>\n<li><strong>Problem Solving:</strong> Excellent analytical, problem-solving, and debugging skills.</li>\n<li><strong>Leadership:</strong> Demonstrated leadership and mentoring abilities. Effective communication skills for engaging with diverse stakeholders.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Familiarity with agile methodologies and tools (e.g., Jira, Trello, Redmine).</li>\n<li>Expertise in security best practices for mobile and web applications.</li>\n<li>Master’s degree in Computer Science, Software Engineering, or a related field.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Open-Source",
            "Software Architecture",
            "Java/Python/GoLang/JavaScript"
        ],
        "summary": "Seeking an experienced Technical Architect to lead open-source solution design and development. Requires 10+ years of experience with strong architecture, coding, and leadership skills."
    },
    {
        "job_title": "Technical  Project Manager",
        "company": "Scalgo Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23717",
        "location": "Technopark",
        "closing_date": "06 Nov 2025",
        "job_description": "<h2>Technical Project Manager</h2>\n<p><strong>Company:</strong> SCALGO TECHNOLOGIES (P) Ltd\n<strong>Location:</strong> 1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> https://www.scalgo.net</p>\n<p><strong>Job Published:</strong> 22, Sept 2025\n<strong>Closing Date:</strong> 06, Nov 2025</p>\n<p><strong>Contact Email:</strong> hrteam@scalgo.net</p>\n<h3>Brief Description</h3>\n<p>SCALGO TECHNOLOGIES is seeking an experienced and dynamic Technical Project Manager with expertise in Python Django, PHP, and Angular. The role involves overseeing the entire project lifecycle, ensuring timely delivery, and maintaining high standards of quality. Strong technical background, leadership skills, and collaborative teamwork are essential for project success.</p>\n<p>Interested candidates are invited to apply by sending their resume to hrteam@scalgo.net with the subject “Application Submission: Technical Project Manager\".</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Determining project requirements and developing work schedules for the team.</li>\n<li>Delegating tasks and achieving daily, weekly, and monthly goals.</li>\n<li>Liaising with team members, management, and clients to ensure projects are completed to standard.</li>\n<li>Identifying risks and forming contingency plans as soon as possible.</li>\n<li>Analysing existing operations and scheduling training sessions and meetings to discuss improvements.</li>\n<li>Keeping up-to-date with industry trends and developments.</li>\n<li>Updating work schedules and performing troubleshooting as required.</li>\n<li>Motivating staff and creating a space where they can ask questions and voice their concerns.</li>\n<li>Being transparent with the team about challenges, failures, and successes.</li>\n<li>Writing progress reports and delivering presentations to the relevant stakeholders.</li>\n</ul>\n<h3>Preferred Skills Requirements:</h3>\n<ul>\n<li>10+ years of experience in software development, with significant experience in Python Django, PHP, and Angular.</li>\n<li>Proven experience in leading and managing software development projects, including teams of developers.</li>\n<li>Excellent technical, diagnostic, and troubleshooting skills.</li>\n<li>Strong proficiency in project management methodologies, tools, and processes.</li>\n<li>Excellent communication, leadership, and problem-solving skills.</li>\n<li>Demonstrated ability to work effectively in a fast-paced, deadline-driven environment.</li>\n<li>Ability to adapt and learn new technologies and frameworks as needed for the project.</li>\n<li>Strong understanding of software development life cycle (SDLC) processes and best practices.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Python Django",
            "PHP",
            "Angular"
        ],
        "summary": "Experienced Technical Project Manager needed with Python Django, PHP, and Angular expertise. Oversee project lifecycle, ensure quality delivery, and lead development teams."
    },
    {
        "job_title": "MLOps Engineer",
        "company": "Trois Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23716",
        "location": "Technopark",
        "closing_date": "20 Oct 2025",
        "job_description": "<h2>MLOps Engineer</h2>\n<p><strong>Company:</strong> Trois Infotech (P) Ltd\n<strong>Location:</strong> 4th Floor, KSUM C DAC Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> http://www.trois.in\n<strong>Published Date:</strong> 22, Sept 2025\n<strong>Closing Date:</strong> 20, Oct 2025\n<strong>Contact Email:</strong> careers@trois.in</p>\n<h3>Brief Description</h3>\n<p>Trois Infotech is building a robust DevOps, MLOps, and DataOps team to test, validate, and deploy production-grade Computer Vision and AI pipelines. This team will manage pipelines across a diverse range of hardware, from low-power edge devices (Jetson Orin, Hailo-8/15) to high-performance multi-GPU data-center nodes. As a senior member of this team reporting to the CTO, you will need to demonstrate mastery in DevOps, MLOps, and DataOps, with a strong understanding of hardware capabilities.</p>\n<h3>Purpose of the Role</h3>\n<p>As a junior member of the team, your primary function will be to support the transition of AI/ML artifacts from research and development (R&amp;D) to production environments. Key contributions will include:</p>\n<ul>\n<li>Assisting with comprehensive functional testing, encompassing unit, integration, and regression tests.</li>\n<li>Supporting the validation of models against critical performance metrics such as latency, throughput, and accuracy.</li>\n<li>Contributing to the path-to-production process through tasks related to containerization, CI/CD implementation, and system monitoring.</li>\n</ul>\n<h3>Role Focus and Time Allocation</h3>\n<ul>\n<li><strong>Focus:</strong> Your work will be concentrated on edge testing, edge deployment, automated regression, and release operations.</li>\n<li><strong>Time Allocation:</strong><ul>\n<li>Testing: 60%</li>\n<li>Deployment &amp; Ops: 40%</li>\n</ul>\n</li>\n</ul>\n<h3>Responsibilities</h3>\n<p>In this entry-level role, you will learn and apply the following under the guidance of senior team members:</p>\n<p><strong>Build &amp; Packaging:</strong>\n- <strong>Edge:</strong> Assist with tools like TensorRT, ONNX, and Hailo NN-Converter.\n- <strong>Server / Data-Center:</strong> Work with Yocto / Ubuntu Core images.\n- <strong>Cross-Cutting:</strong> Utilize Docker/OCI containers, assist in packaging testing environments, and work with Git-versioned artifacts.</p>\n<p><strong>Functional &amp; Model Validation:</strong>\n- <strong>Edge:</strong> Support model quantization and calibration tasks.\n- <strong>Server / Data-Center:</strong> Assist in running fairness tests.\n- <strong>Cross-Cutting:</strong> Work with regression datasets managed in DVC.</p>\n<p><strong>Performance &amp; Power Testing:</strong>\n- <strong>Edge:</strong> Employ tools for Jetson power-profiling and assist in thermal testing.\n- <strong>Server / Data-Center:</strong> Support bandwidth and saturation tests.\n- <strong>Cross-Cutting:</strong> Help measure and report latency and throughput.</p>\n<h3>Preferred Skills</h3>\n<p>We are seeking candidates with a foundational skill set and a strong eagerness to learn. Basic familiarity with performance testing and Docker/Kubernetes deployments is required.</p>\n<p><strong>Modern C++ (17/20/23):</strong>\n- Basic CMake skills and familiarity with gdb.</p>\n<p><strong>AI Runtimes – C++ APIs:</strong>\n- ONNX Runtime (C++): Ability to run sample applications.\n- TensorRT (C++): Experience with trtexec.\n- NVIDIA Triton: Capable of deploying a prebuilt model.\n- DeepStream (C/C++): Ability to run the reference application.</p>\n<p><strong>Edge &amp; Embedded Tool-chain:</strong>\n- Jetson (L4T): Proficient with ssh and tegrastats.\n- Hailo-8/15: Able to run samples.\n- Intel ARC / OpenVINO: Can run basic hello_query_device.</p>\n<p><strong>Build &amp; Packaging (C++):</strong>\n- CMake: Can build from a given README file.\n- Conan / vcpkg: Able to install dependencies.\n- Cross-compilation: Can use prebuilt images.</p>\n<p><strong>Performance &amp; Profiling:</strong>\n- CPU: Familiar with htop.\n- GPU: Familiar with nvidia-smi.</p>\n<p><strong>Testing C++ Pipelines:</strong>\n- Unit / Integration: Can write simple assert statements for testing.\n- Regression &amp; KPI: Able to run scripts, collate data and KPIs, and report them to the R&amp;D team.</p>\n<p><strong>DataOps &amp; Telemetry:</strong>\n- gRPC / ZeroMQ C++: Can run example code.\n- Logging &amp; Tracing: Can use printf for logging.</p>\n<h3>Experience</h3>\n<ul>\n<li>3-5 years of experience.</li>\n<li>Solid C++ coursework or open-source contributions (please provide proof via GitHub links).</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "MLOps",
            "DevOps",
            "C++"
        ],
        "summary": "Join Trois Infotech as an MLOps Engineer. Support AI/ML pipeline deployment from R&D to production, focusing on testing and operations."
    },
    {
        "job_title": "Senior Computer Vision/Embedded Engineer",
        "company": "Trois Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23715",
        "location": "Technopark",
        "closing_date": "20 Oct 2025",
        "job_description": "<h2>Senior Computer Vision/Embedded Engineer</h2>\n<p><strong>Company:</strong> Trois Infotech (P) Ltd\n<strong>Location:</strong> 4th Floor, KSUM C DAC Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> http://www.trois.in\n<strong>Contact Email:</strong> careers@trois.in\n<strong>Date Published:</strong> 22, Sept 2025\n<strong>Closing Date:</strong> 20, Oct 2025</p>\n<h3>Role Overview:</h3>\n<p>Trois Infotech is seeking a Senior Computer Vision/Embedded Engineer to join our team in Trivandrum. This full-time, on-site position involves developing and implementing advanced computer vision algorithms, as well as conducting research and development in areas like pattern recognition, robotics, and computer vision. The successful candidate will work closely with cross-functional teams to seamlessly integrate computer vision solutions into our products. The Research and development and Productization include Face Recognition, WiFi (IEEE 802.11ah), 4G LTE, and 5G, ensuring reliable data transmission, Real-Time, and Edge-based Computer Vision Processing, etc.</p>\n<h3>Experience:</h3>\n<p>5-6 years (Experience requirements may be relaxed for highly proficient candidates as determined during the interview process.)</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>High-accuracy edge processing for facial recognition (FR) and incident detections.</li>\n<li>Develop and maintain reusable, testable, and efficient production code for machine learning and deep learning pipelines in computer vision.</li>\n<li>Design and implement low-latency, high-availability, and high-performance applications.</li>\n<li>Assess, prioritize, and implement feature requests based on technical requirements.</li>\n<li>Collaborate with internal teams to understand user needs and deliver technical solutions.</li>\n<li>Integrate front-end elements developed by UI/UX teams with server-side logic.</li>\n<li>Implement and manage data storage solutions, including databases, key-value stores, and blob storage.</li>\n</ul>\n<h3>Required Skills and Qualifications:</h3>\n<ul>\n<li><strong>Programming Languages:</strong> Proficiency in Python combined with one of the following: C++, Rust, Java, or Kotlin. Experience developing computer vision models with frameworks such as Jax, TensorFlow 2, or PyTorch is essential. Candidates proficient in Python combined with C++ or Rust will be prioritized.</li>\n<li><strong>Deployment Experience:</strong> Experience deploying models and computer vision pipelines using ONNX Runtime, TensorRT, and DeepStream Runtime.</li>\n<li><strong>CUDA-C/OpenCL-C:</strong> Strong familiarity with these technologies is highly advantageous.</li>\n<li><strong>Computer Vision and Image Processing:</strong> Demonstrated problem-solving skills in image processing and computer vision, with a deep understanding of modern machine learning methods and deep learning architectures (e.g., object detection, segmentation, image classification using Deep Neural Networks). The ability to conceptualize zero-shot architectures for various computer vision tasks is important. Candidates may be required to code specific DNN architectures and perform image processing routines during the interview.</li>\n<li><strong>Linux Proficiency:</strong> Strong command-line skills are required, as much of the work will be performed on remotely connected edge AI/IoT devices.</li>\n<li><strong>Scalable Application Design:</strong> Solid understanding of the principles behind designing scalable applications.</li>\n<li><strong>API Development:</strong> Ability to write and consume HTTP REST and Streaming APIs using Python, Java, or Rust.</li>\n<li><strong>Platform Optimization:</strong> Understanding the differences between multiple delivery platforms (e.g., mobile vs. desktop) and optimizing output for specific platforms.</li>\n</ul>",
        "tags": [
            "5-6 Years",
            "Computer Vision",
            "Python",
            "Embedded"
        ],
        "summary": "Senior Computer Vision/Embedded Engineer sought for AI product development. Responsibilities include algorithm implementation, research, and edge processing for facial recognition and incident detection."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23714",
        "location": "Technopark",
        "closing_date": "24 Sep 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd</p>\n<p><strong>Location:</strong> 1st Floor, M Squared Building, Annex 1, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581</p>\n<p><strong>Website:</strong> www.trainonexsolutions.in</p>\n<p><strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Job Published:</strong> 22, Sept 2025</p>\n<p><strong>Closing Date:</strong> 24, Sept 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<h3>Requirements and Preferences</h3>\n<ul>\n<li><strong>Experience:</strong> 0-1 years required. Freshers can also apply.</li>\n<li><strong>Immediate Joiners:</strong> Need immediate joiners.</li>\n<li><strong>Work Arrangement:</strong> Work from office opportunity.</li>\n<li><strong>Candidates:</strong> Male and Female candidates preferred.</li>\n<li><strong>Language:</strong> Fluency with Malayalam Language is preferred.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Communication"
        ],
        "summary": "Seeking a Telesales Executive to drive sales and customer relationships over the phone. Identify, qualify, and close deals to contribute to company growth."
    },
    {
        "job_title": "SOFTWARE ENGINEER (SE/092025/55)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23713",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Software Engineer Position at Kerala University of Digital Sciences, Innovation and Technology</h2>\n<p><strong>Organization:</strong> Kerala University of Digital Sciences, Innovation and Technology\n<strong>Location:</strong> Technopark Phase-IV Campus (Technocity), Mangalappuram, Thonnakkal PO, Trivandrum, Kerala, 695317\n<strong>Website:</strong> https://duk.ac.in\n<strong>Job Code:</strong> SE/092025/55</p>\n<p><strong>Closing Date:</strong> October 3, 2025\n<strong>Job Published:</strong> September 21, 2025\n<strong>Contact Email:</strong> recruitments@duk.ac.in</p>\n<h3>Brief Description</h3>\n<p>Kerala University of Digital Sciences, Innovation and Technology is seeking qualified Indian Citizens for a contract-based Software Engineer position. Interested candidates should apply online through the University's Recruitment Portal. Application guidelines are available on the portal. The deadline for submitting applications is October 3, 2025.</p>\n<h3>Essential Educational Qualification</h3>\n<ul>\n<li>B.Tech/M.Tech/MCA/MSc in Computer Science or an equivalent degree from a recognized University/Educational Institution.</li>\n<li>A minimum 3-year Engineering Diploma / BCA / BSc from a recognized Educational Institution with exceptional programming skills and experience may also be considered.</li>\n</ul>\n<h3>Job Function</h3>\n<ul>\n<li>Development, testing, and implementation of software components using the PHP programming language.</li>\n</ul>\n<h3>Job Description</h3>\n<ul>\n<li>Develop and test standalone applications for various projects within the University.</li>\n</ul>\n<h3>Desirable Technical Skills &amp; Experience</h3>\n<ul>\n<li>A minimum of 2 years of PHP development experience in the IT industry.</li>\n<li>Experience with the latest front-end technologies such as ReactJS / Angular, etc.</li>\n<li>Proficiency in PHP web frameworks such as Laravel / CodeIgniter, etc.</li>\n<li>Familiarity with code versioning tools like CVS, SVN, Git, etc.</li>\n<li>Experience with SQL/NoSQL databases.</li>\n<li>Proficiency in HTML, CSS, and JavaScript.</li>\n<li>Experience in scaling and tuning database applications, modeling, and performance optimization.</li>\n</ul>\n<h3>Desirable Soft Skills</h3>\n<ul>\n<li>Strong problem-solving abilities.</li>\n<li>Good interpersonal and communication skills.</li>\n<li>Willingness to learn and adapt to changes.</li>\n</ul>\n<p><strong>Application Link:</strong> https://www.duk.ac.in/careers</p>",
        "tags": [
            "2+ Years",
            "PHP",
            "Laravel",
            "ReactJS"
        ],
        "summary": "Seeking a Software Engineer for contract-based roles. Responsibilities include PHP development, testing, and implementation of University software projects. Apply online by October 3, 2025."
    },
    {
        "job_title": "TECH LEAD (TL/092025/55)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/23712",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Tech Lead Position at Kerala University of Digital Sciences, Innovation and Technology</h2>\n<p><strong>Organization:</strong> Kerala University of Digital Sciences, Innovation and Technology\n<strong>Location:</strong> Technopark Phase-IV Campus (Technocity), Mangalappuram, Thonnakkal PO, Trivandrum, Kerala, 695317\n<strong>Website:</strong> https://duk.ac.in\n<strong>Reference Code:</strong> TL/092025/55</p>\n<p><strong>Closing Date:</strong> October 3, 2025\n<strong>Application Published:</strong> September 21, 2025\n<strong>Contact Email:</strong> recruitments@duk.ac.in</p>\n<h3>Brief Description</h3>\n<p>Kerala University of Digital Sciences, Innovation and Technology is inviting applications from qualified Indian Citizens for the position of Tech Lead on a contract basis. Interested candidates must apply online through the University's Recruitment Portal.</p>\n<h3>Application Submission</h3>\n<p>Applications must be submitted online no later than October 3, 2025. The application form and guidelines are available at https://www.duk.ac.in/careers.</p>\n<h3>Essential Qualifications and Experience</h3>\n<ul>\n<li><strong>Educational Qualification:</strong> B.Tech/M.Tech/MCA/MSc Computer Science or equivalent degree from a recognized University/Educational Institution.</li>\n<li><strong>Experience:</strong><ul>\n<li>Minimum 6 years of experience in the IT Industry.</li>\n<li>Minimum 2 years of experience in a Lead Role.</li>\n<li>Minimum 4 years of experience in PHP development.</li>\n</ul>\n</li>\n</ul>\n<h3>Job Description</h3>\n<ul>\n<li>Design and develop standalone applications for various university projects.</li>\n<li>Develop and execute testing processes to improve product quality.</li>\n<li>Lead and supervise overall development activities, including designing, code review, testing, and implementation of software components.</li>\n</ul>\n<h3>Job Functions</h3>\n<ul>\n<li>Hiring and training technical personnel.</li>\n<li>Delegating work and assignments to team members.</li>\n<li>Collaborating with the team to identify and resolve technical problems.</li>\n<li>Analyzing user needs and finding suitable applications.</li>\n<li>Establishing team goals.</li>\n<li>Ensuring software and applications are updated.</li>\n<li>Supervising system modifications.</li>\n<li>Conducting security audits to identify areas for improvement.</li>\n<li>Guiding the team through technical issues and challenges.</li>\n</ul>\n<h3>Desirable Technical Skills</h3>\n<ul>\n<li>PHP Web frameworks (e.g., Laravel, CodeIgniter).</li>\n<li>Latest Frontend Frameworks (e.g., React, Angular).</li>\n<li>Web servers and database languages.</li>\n<li>Code versioning tools (e.g., CVS, SVN, Git).</li>\n<li>Familiarity with SQL/NoSQL databases.</li>\n<li>PHP Microservice framework.</li>\n<li>Automated testing frameworks (e.g., PHP Unit).</li>\n<li>Writing T-SQL queries, stored procedures, triggers, functions, etc.</li>\n<li>Experience in Payment Gateway and API Integration.</li>\n<li>Content Management Systems (e.g., WordPress, Drupal, Joomla).</li>\n<li>Knowledge in Graphic design software.</li>\n<li>Database application scaling and tuning, modeling, performance optimization.</li>\n</ul>\n<h3>Desirable Soft Skills</h3>\n<ul>\n<li>Project management</li>\n<li>Problem-solving</li>\n<li>Innovation and best coding practices</li>\n<li>Interpersonal and communication skills</li>\n<li>Critical and out-of-the-box thinking</li>\n<li>Openness to learning and adapting to changes</li>\n<li>Ability to mentor Software Engineers</li>\n<li>Self-driven</li>\n<li>Ability to work with minimum supervision</li>\n<li>Analytical Thinking</li>\n<li>Ability to perform under pressure</li>\n</ul>",
        "tags": [
            "6+ Years",
            "PHP",
            "Laravel",
            "React"
        ],
        "summary": "Tech Lead needed for Kerala University of Digital Sciences on a contract basis. Requires 6+ years IT experience, including 2 years lead role and 4 years in PHP development."
    },
    {
        "job_title": "Computer Vision & Augmented Reality R&D Engineer",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/23711",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Computer Vision &amp; Augmented Reality R&amp;D Engineer</h2>\n<p><strong>Company:</strong> iBoson Innovations (P) Ltd\n<strong>Location:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> http://www.iboson.io\n<strong>Closing Date:</strong> 30 September 2025\n<strong>Job Published:</strong> 21 September 2025\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking highly motivated R&amp;D Engineers specializing in Computer Vision and Augmented Reality to design, prototype, and optimize next-generation visual computing solutions. The role involves pushing the boundaries of 3D perception, real-time tracking, and AR interaction through a combination of algorithm research, system design, and hands-on development.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Research, develop, and prototype algorithms for 2D/3D computer vision, including feature detection, descriptor matching, pose estimation, and object recognition.</li>\n<li>Build and optimize pipelines for 3D reconstruction, point cloud registration, and depth estimation using monocular, stereo, and LiDAR data.</li>\n<li>Develop AR solutions leveraging ARCore, ARKit, and Unity, including plane detection, meshing, and spatial mapping.</li>\n<li>Implement and evaluate feature matching and registration techniques (e.g., SIFT, LSD, SuperGlue, RANSAC-based methods) for robust object/scene understanding.</li>\n<li>Integrate and optimize machine learning models (e.g., quantized and lightweight vision models) for mobile and embedded platforms.</li>\n<li>Work across multiple platforms (C++, Python, Java, Swift) to bridge research prototypes with production-level applications.</li>\n<li>Collaborate with cross-functional teams to transform R&amp;D outcomes into deployable solutions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong background in Computer Vision, 3D Geometry, and Augmented Reality.</li>\n<li>Proficiency in OpenCV, Open3D, Eigen, and feature-matching frameworks.</li>\n<li>Hands-on experience with ARCore, ARKit, Unity, and real-time spatial computing.</li>\n<li>Familiarity with point cloud processing, depth sensing, and reconstruction techniques.</li>\n<li>Programming expertise in C++, Python, and at least one mobile platform language (Java/Kotlin for Android, Swift for iOS).</li>\n<li>Knowledge of ML model optimization and quantization for resource-constrained environments.</li>\n<li>Strong problem-solving and R&amp;D mindset with the ability to prototype and iterate quickly.</li>\n</ul>\n<h3>Nice-to-Have</h3>\n<ul>\n<li>Experience with neural feature descriptors and transformer-based matching networks.</li>\n<li>Background in SLAM, visual positioning systems, or optical flow methods.</li>\n<li>Contributions to open-source CV/AR projects or research publications.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Opportunity to work on cutting-edge AR and CV research with real-world impact.</li>\n<li>Collaborative environment where experimentation and innovation are encouraged.</li>\n<li>Pathway to publish research, build prototypes, and shape next-gen AR systems.</li>\n<li>Work on next-generation AR smart glasses.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Computer Vision",
            "Augmented Reality",
            "C++"
        ],
        "summary": "Seeking R&D Engineers in Computer Vision and AR to develop next-gen visual computing solutions. Requires algorithm research, system design, and hands-on development for 3D perception and AR interactions."
    },
    {
        "job_title": "Product Marketing Specialist",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/23710",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Product Marketing Specialist</h2>\n<p><strong>Company:</strong> iBoson Innovations (P) Ltd\n<strong>Location:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> http://www.iboson.io</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 21, Sept 2025\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly motivated Product Marketing Specialist to join our team. In this role, you will be responsible for driving go-to-market strategies, crafting compelling product positioning, and executing marketing campaigns that build awareness, generate leads, and support sales growth. You’ll work closely with cross-functional teams, including product, sales, and design, to ensure consistent messaging and a strong market presence.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and execute product marketing strategies to increase brand visibility and drive customer acquisition.</li>\n<li>Create engaging content such as blogs, case studies, presentations, email campaigns, and social media posts tailored for different channels and audiences.</li>\n<li>Plan and manage marketing campaigns across digital platforms like LinkedIn, Pinterest, Meta, Google Ads, SEO, email, and events.</li>\n<li>Collaborate with the product team to translate technical features into clear customer benefits.</li>\n<li>Conduct market research and competitor analysis to identify trends, opportunities, and positioning strategies.</li>\n<li>Support sales teams with marketing collateral, product demos, and sales enablement tools.</li>\n<li>Track and analyze campaign performance, preparing reports with actionable insights.</li>\n<li>Organize webinars and promotional events.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Communications, or related field.</li>\n<li>3-5 years of experience in product marketing, digital marketing, or a similar role.</li>\n<li>Strong understanding of digital marketing tools like Google Analytics, SEO/SEM, LinkedIn Ads, Mailchimp/HubSpot, or similar.</li>\n<li>Strong SEO knowledge with exposure to the latest trends and best practices.</li>\n<li>Excellent communication, copywriting, and storytelling skills.</li>\n<li>Ability to work collaboratively in a fast-paced, cross-functional environment.</li>\n<li>Creative mindset with attention to detail and data-driven decision-making.</li>\n</ul>\n<h3>Nice to Have (Preferred Skills)</h3>\n<ul>\n<li>Experience in B2B SaaS / IT / Tech industries.</li>\n<li>Familiarity with CRM tools (HubSpot, Salesforce, Zoho).</li>\n<li>Knowledge of product lifecycle, GTM strategies, and customer journey mapping.</li>\n</ul>\n<p>Interested candidates may send their updated resume to career@ibosoninnov.com to begin the interview process.</p>",
        "tags": [
            "3-5 Years",
            "Product Marketing",
            "Digital Marketing",
            "SEO"
        ],
        "summary": "Seeking a Product Marketing Specialist to drive go-to-market strategies and marketing campaigns. Responsibilities include content creation, digital platform management, and market research to support sales growth."
    },
    {
        "job_title": "Software Engineer - Java",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/23709",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Software Engineer - Java</h2>\n<p><strong>Company:</strong> iBoson Innovations (P) Ltd\n<strong>Location:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> http://www.iboson.io\n<strong>Closing Date:</strong> September 30, 2025\n<strong>Job Published:</strong> September 21, 2025\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<h3>Brief Description</h3>\n<p>iBoson is an AI-first product company specializing in cutting-edge technologies. We thrive on innovation and are looking for a highly skilled and proactive experienced Java Developer to join our dynamic team. We are building new product lines and are looking for passionate team members.</p>\n<p>As a Senior Java Developer, you will be responsible for designing, developing, and deploying scalable backend solutions and services using Java, Spring Boot, and Microservices architecture. You will collaborate closely with cross-functional teams to deliver high-quality software solutions while ensuring best practices in coding, testing, and deployment.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain Java-based applications</li>\n<li>Write clean, maintainable, and efficient code</li>\n<li>Participate in code reviews and mentor junior developers</li>\n<li>Collaborate with cross-functional teams to define and implement new features</li>\n<li>Troubleshoot and resolve complex technical issues</li>\n<li>Contribute to architectural decisions and technical documentation</li>\n<li>Ensure application performance, quality, and responsiveness</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>5+ years of professional Java development experience</li>\n<li>Strong knowledge of Spring Framework (Spring Boot, Spring MVC, Spring Data)</li>\n<li>Experience with RESTful API design and implementation</li>\n<li>Proficiency in database technologies (SQL, NoSQL)</li>\n<li>Experience with build tools like Maven or Gradle</li>\n<li>Understanding of microservices architecture</li>\n<li>Knowledge of containerization (Docker, Kubernetes)</li>\n<li>Experience with version control systems (Git)</li>\n<li>Experience with reactive programming (Project Reactor, RxJava)</li>\n<li>Knowledge of cloud platforms (AWS, Azure, GCP)</li>\n<li>Experience with messaging systems (Kafka, RabbitMQ)</li>\n<li>Familiarity with CI/CD pipelines</li>\n<li>Understanding of security best practices</li>\n<li>Experience with testing frameworks (JUnit, Mockito)</li>\n<li>Bachelor's degree in Computer Science, Engineering, or related field (or equivalent practical experience)</li>\n</ul>\n<p>If you are someone who takes full ownership of responsibilities, embraces challenges, and delivers results in a fast-paced, time-oriented environment without pressure, we’d love to hear from you! Apply now by submitting your resume and portfolio to career@ibosoninnov.com.</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Microservices"
        ],
        "summary": "Experienced Java Developer to design, develop, and deploy scalable backend solutions using Java and Spring Boot. Join an AI-first product company for exciting new product lines."
    },
    {
        "job_title": "Software Engineer - Backend (Node.js)",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/23708",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Software Engineer - Backend (Node.js)</h2>\n<p><strong>Company:</strong> iBoson Innovations (P) Ltd\n<strong>Location:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> http://www.iboson.io</p>\n<p><strong>Job Published:</strong> 21, Sept 2025\n<strong>Closing Date:</strong> 30, Sept 2025\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<h3>Brief Description</h3>\n<p>At iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to build next-gen solutions. We are expanding our team and looking for a skilled Node.js Developer to help develop robust, scalable, and high-performance backend systems for our products.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain scalable server-side applications using Node.js.</li>\n<li>Develop and integrate RESTful APIs and third-party services.</li>\n<li>Optimize back-end processes for performance, security, and scalability.</li>\n<li>Work closely with front-end developers to integrate user-facing elements.</li>\n<li>Manage and implement database solutions (SQL/NoSQL).</li>\n<li>Debug, troubleshoot, and resolve back-end issues efficiently.</li>\n<li>Follow best practices in code quality, testing, and documentation.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>5+ years of experience in back-end development, with a focus on Node.js.</li>\n<li>Strong understanding of JavaScript, TypeScript, and asynchronous programming.</li>\n<li>Experience in building and managing RESTful APIs and microservices architecture.</li>\n<li>Proficiency in databases (MongoDB, MySQL, or PostgreSQL).</li>\n<li>Knowledge of authentication and authorization mechanisms (JWT, OAuth).</li>\n<li>Experience with server-side frameworks like Express.js, Nest.js, or similar.</li>\n<li>Familiarity with cloud platforms (AWS, Google Cloud, or Azure) is a plus.</li>\n<li>Understanding of Agile methodologies and CI/CD pipelines.</li>\n<li>Exposure to AI integrations in back-end applications is an advantage.</li>\n<li>AR technology exposure is a plus.</li>\n</ul>\n<p><strong>About the Role:</strong></p>\n<p>Be part of a team that thrives on innovation and problem-solving. At iBoson, you’ll work with emerging AR &amp; AI technologies, contribute to impactful projects, and grow in a collaborative and tech-driven environment. If you're ready to take on exciting challenges, we’d love to hear from you! Send your resume to career@ibosoninnov.com.</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "RESTful APIs",
            "Databases"
        ],
        "summary": "Seeking a skilled Node.js Backend Developer for AR/AI solutions. Responsibilities include designing scalable systems, developing APIs, and optimizing databases. Join an innovative tech-driven team."
    },
    {
        "job_title": "Software Engineer - Frontend",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/23707",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Software Engineer - Frontend</h2>\n<p><strong>Company:</strong> iBoson Innovations (P) Ltd\n<strong>Location:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> http://www.iboson.io\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<p><strong>Job Published:</strong> 21, Sept 2025\n<strong>Closing Date:</strong> 30, Sept 2025</p>\n<h3>Brief Description</h3>\n<p>At iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to create next-generation solutions. We are expanding our team and seeking skilled Front-end Developers to join us.</p>\n<p>The ideal candidate should have strong expertise in Angular, React, or Vue.js, along with solid knowledge of JavaScript, HTML, and CSS. A good understanding of responsive web design and SEO best practices is essential. You should be comfortable building user interfaces that work seamlessly across various devices and screen sizes.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Build and maintain responsive, interactive web interfaces using HTML5, CSS3, JavaScript, React, Angular, and Vue.js.</li>\n<li>Collaborate with backend developers to integrate RESTful APIs and ensure robust application performance.</li>\n<li>Implement UI/UX designs with a focus on accessibility, cross-browser compatibility, and mobile-first principles.</li>\n<li>Write clean, scalable, and well-documented code adhering to industry standards.</li>\n<li>Optimize web applications for speed, scalability, and SEO best practices.</li>\n<li>Troubleshoot and resolve complex frontend issues to enhance functionality and user satisfaction.</li>\n<li>Stay updated with the latest web development trends and technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Minimum 3 years of professional experience in frontend development.</li>\n<li>Strong proficiency in JavaScript (ES6+), HTML5, and CSS3.</li>\n<li>Proven expertise in Angular, React.js, and Vue.js for developing dynamic, component-based applications.</li>\n<li>Understanding of SEO principles and how to apply them to web applications.</li>\n<li>Experience in creating user-friendly, accessible, and performant websites.</li>\n<li>Experience with responsive and adaptive design techniques.</li>\n<li>Proficiency with Git for version control and collaborative development.</li>\n<li>Solid understanding of web performance optimization and debugging tools (e.g., Chrome DevTools).</li>\n<li>Excellent problem-solving skills and ability to work in a fast-paced, collaborative environment.</li>\n<li>Experience with testing frameworks such as Jest and Mocha.</li>\n</ul>\n<h3>Nice to Have / Added Advantage:</h3>\n<ul>\n<li>Experience with Tailwind CSS or Bootstrap.</li>\n<li>Knowledge of WebGL or 3D-related frameworks like Three.js.</li>\n<li>Familiarity with CSS preprocessors (e.g., SASS, LESS) or CSS-in-JS (e.g., styled-components).</li>\n<li>Knowledge of TypeScript for type-safe JavaScript development.</li>\n<li>Exposure to UI/UX tools (e.g., Figma) for design collaboration.</li>\n</ul>\n<p>Be part of a team that thrives on innovation and problem-solving. At iBoson, you’ll work with emerging AR &amp; AI technologies, contribute to impactful projects, and grow in a collaborative and tech-driven environment. If you're ready to take on exciting challenges, we’d love to hear from you! Send your resume to career@ibosoninnov.com.</p>",
        "tags": [
            "3+ Years",
            "React",
            "Angular",
            "Vue.js"
        ],
        "summary": "Seeking skilled Front-end Developers experienced in Angular, React, or Vue.js to build AR/AI solutions. Responsibilities include interface development, API integration, and performance optimization."
    },
    {
        "job_title": "Telecaller/Marketing Executive (Female Candidates Only)",
        "company": "Techstas Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23706",
        "location": "Technopark",
        "closing_date": "27 Sep 2025",
        "job_description": "<h2>Telecaller/Marketing Executive (Female Candidates Only)</h2>\n<p><strong>Company:</strong> Techstas Info Solutions (P) Ltd\n<strong>Website:</strong> <a href=\"http://www.techstas.com\">http://www.techstas.com</a></p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> September 27, 2025\n*   <strong>Time:</strong> 11:00 AM - 1:00 PM\n*   <strong>Venue:</strong> Techstas Info Solutions Pvt Ltd, Module 9, -2 Floor, Thejaswini Building, Technopark, Trivandrum - 695581</p>\n<p><strong>Job Published:</strong> September 20, 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a proactive and customer-focused Telecaller / Marketing Executive to join our dynamic team. The ideal candidate will be responsible for managing inbound and outbound calls, handling customer queries, and ensuring a seamless customer experience. This role also includes lead generation and contributing to sales growth through effective communication and relationship building.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Make outbound calls to potential customers and handle inbound queries with professionalism.</li>\n<li>Deliver prompt, polite, and efficient customer support, including issue resolution.</li>\n<li>Generate quality leads through phone calls and other platforms, assisting in conversions.</li>\n<li>Understand customer requirements and recommend appropriate products or services.</li>\n<li>Maintain accurate and detailed records of customer interactions in the CRM system.</li>\n<li>Collaborate with internal teams to ensure customer satisfaction and timely follow-ups.</li>\n<li>Meet and exceed assigned daily, weekly, and monthly sales targets.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Proficiency in English, Tamil, and Malayalam is mandatory; knowledge of Hindi will be an added advantage.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Basic IT knowledge (MS Office) is required.</li>\n<li>Female candidates only.</li>\n<li>Customer-oriented attitude with strong problem-solving skills.</li>\n<li>Ability to thrive in a fast-paced, target-driven environment.</li>\n<li>Goal-driven mindset with the ability to achieve sales targets.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Prior experience in telecalling, customer support, or inside sales.</li>\n<li>Familiarity with call center software or CRM systems.</li>\n<li>Ability to communicate in additional regional languages will be a plus.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary package.</li>\n<li>Supportive and collaborative work environment.</li>\n<li>Comprehensive on-the-job training and career development opportunities.</li>\n<li>Clear growth path within the organization.</li>\n<li>Recognition and rewards for top performers.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates can send their updated resumes to <strong>career@techstas.com</strong> with the subject line: “Application for Telecaller / Marketing Executive”.</p>\n<h3>Walk-In Venue &amp; Entry Pass Information</h3>\n<ul>\n<li><strong>Address:</strong> Techstas Info Solutions Pvt Ltd, Module 9, -2 Floor, Thejaswini Building, Technopark, Trivandrum, Pin Code: 695581</li>\n<li><strong>Contact Numbers:</strong> +91 75111 05995, +91 86067 50792</li>\n<li><strong>Technopark Entry Pass:</strong> Candidates must apply for a Technopark entry pass via the mobile app or web browser (vms.technopark.org). The pass will be sent to their registered mobile number/email. Show the softcopy at the gate. For those without smartphones, print the pass from self-operating kiosks using an OTP. Original certificates will be verified at the gate.</li>\n</ul>\n<p><strong>Contact Email:</strong> career@techstas.com</p>",
        "tags": [
            "0-2 Years",
            "Telecalling",
            "Sales",
            "Customer Support"
        ],
        "summary": "Seeking a female Telecaller/Marketing Executive for lead generation and customer support. Responsibilities include calls, query resolution, and sales target achievement. Requires language proficiency and basic IT knowledge."
    },
    {
        "job_title": "HR EXECUTIVE",
        "company": "Joopium Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23705",
        "location": "Technopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>HR EXECUTIVE</h2>\n<p><strong>Company:</strong> JOOPIUM TECHNOLOGIES (P) Ltd\n<strong>Location:</strong> 4TH FLOOR AMSTOR ANNEXE AMSTOR HOUSE, TECHNOPARK KAZHAKOOTAM TRIVANDRUM, 695581\n<strong>Website:</strong> https://joopiumtechnologies.com\n<strong>Contact Email:</strong> careers@joopiumtechnologies.com\n<strong>Closing Date:</strong> 10, Oct 2025\n<strong>Job Published:</strong> 20, Sept 2025</p>\n<p><strong>Mode:</strong> WORK FROM OFFICE</p>\n<p><strong>Experience:</strong> 1-2 Years</p>\n<h3>Job Responsibilities:</h3>\n<ol>\n<li><strong>Recruitment and Hiring:</strong><ul>\n<li>Sourcing and selecting qualified candidates for open positions.</li>\n<li>Includes job postings, resume screening, conducting interviews, and facilitating the hiring process.</li>\n</ul>\n</li>\n<li><strong>Employee Onboarding and Offboarding:</strong><ul>\n<li>Facilitate the onboarding process for new employees, ensuring they have necessary paperwork, orientation, and training.</li>\n<li>Manage the offboarding process when employees leave the organization.</li>\n</ul>\n</li>\n<li><strong>Employee Relations:</strong><ul>\n<li>Handle employee relations matters, including conflict resolution, disciplinary actions, and employee grievances.</li>\n<li>Provide suggestions to promote positive work environments, mediate disputes, and ensure adherence to company policies and employment laws.</li>\n</ul>\n</li>\n<li><strong>Compensation and Benefits:</strong><ul>\n<li>Manage employee compensation and benefits programs.</li>\n<li>Includes salary administration, bonus plans, employee benefits enrollment, and managing payroll processes.</li>\n</ul>\n</li>\n<li><strong>Performance Management:</strong><ul>\n<li>Implement performance management systems and processes.</li>\n<li>Involves setting performance goals based on directions from higher management, conducting performance evaluations, providing feedback, and facilitating employee development plans.</li>\n</ul>\n</li>\n<li><strong>Policy Development and Compliance:</strong><ul>\n<li>Develop and communicate company policies and ensure compliance with applicable employment laws and regulations.</li>\n<li>Educate employees about policies and procedures, maintain employee handbooks, and handle legal and regulatory compliance matters.</li>\n</ul>\n</li>\n<li><strong>Training and Development:</strong><ul>\n<li>Coordinate training and development initiatives to enhance employee skills and knowledge.</li>\n<li>May include organizing workshops, training sessions, and implementing employee development programs.</li>\n</ul>\n</li>\n<li><strong>Employee Engagement and Retention:</strong><ul>\n<li>Focus on initiatives to enhance employee engagement, satisfaction, and retention.</li>\n<li>May include organizing workshops, training sessions, and implementing employee development programs.</li>\n</ul>\n</li>\n<li><strong>HR Administration:</strong><ul>\n<li>Handle administrative tasks such as maintaining employee records, managing HR systems and databases, and ensuring employee data confidentiality.</li>\n</ul>\n</li>\n<li><strong>Legal Compliance:</strong><ul>\n<li>Stay updated on employment laws and regulations to ensure compliance.</li>\n<li>Assist with legal matters, contracts, and workplace investigations.</li>\n</ul>\n</li>\n</ol>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Excellent Communication skills</li>\n<li>Proven work experience in HR-related fields</li>\n<li>Experience with full-cycle recruitment</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>MBA or other HR-related fields</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Recruitment",
            "Onboarding",
            "Compensation and Benefits"
        ],
        "summary": "Seeking an HR Executive with 1-2 years of experience for a Work From Office role. Responsibilities include recruitment, onboarding, employee relations, and performance management."
    },
    {
        "job_title": "Technical Sales Specialist-AI  (Exp-0-2 Yrs)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23704",
        "location": "Technopark",
        "closing_date": "04 Nov 2025",
        "job_description": "<h2>Technical Sales Specialist - AI</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in</p>\n<p><strong>Job Published:</strong> 20, Sept 2025\n<strong>Closing Date:</strong> 04, Nov 2025</p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<h3>Brief Description</h3>\n<p>We are hiring an AI Sales Specialist to lead the marketing initiatives for our AI products and services and drive business growth. This strategic role requires excellent communication with a great attitude and the ability to set and achieve sales targets. The ideal candidate will have good academics and a results-oriented mind-set.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and implement a strategic sales plan to achieve company sales targets and objectives.</li>\n<li>Identify new opportunities and potential clients, actively prospecting and generating leads.</li>\n<li>Build and maintain strong relationships with key clients, understanding their needs and providing tailored solutions to meet their requirements.</li>\n<li>Develop, execute, and monitor marketing programs for our AI products and services across a variety of channels in line with the GTM strategy derived.</li>\n<li>Research the market, analyze trends, and provide advice on defining the organization's marketing strategy to effectively reach the target market.</li>\n<li>Collaborate with internal teams, including product and sales, to develop and monitor strategic marketing initiatives.</li>\n<li>Analyze and report on the performance and efficiency of marketing campaigns.</li>\n<li>Create marketing materials, such as sales and product collateral, while ensuring brand guidelines are met.</li>\n<li>Work with external agencies and vendors to execute marketing programs.</li>\n<li>Write, proofread, and edit creative and technical content across different mediums to support marketing initiatives.</li>\n<li>Provide expert advice on branding, positioning, communications, and other marketing issues.</li>\n<li>Give direction to marketing efforts, utilizing the most effective methods and tools.</li>\n<li>Stay updated on emerging trends and share best practices, fostering knowledge and insights.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Excellent Academics.</li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li>6–11 LPA (Competitive fixed salary &amp; Attractive performance-based incentives &amp; ESOPs)</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>B.Tech in Non-IT disciplines, OR Bachelor’s/Master’s in Mathematics/Statistics, OR Technical degree with MBA</li>\n</ul>\n<h3>Experience Required</h3>\n<ul>\n<li>0-3 years</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "AI Sales",
            "Marketing",
            "Lead Generation"
        ],
        "summary": "Seeking an AI Sales Specialist to drive marketing initiatives and business growth for AI products. Requires excellent communication, sales target achievement, and strong analytical skills."
    },
    {
        "job_title": "Junior Technical Support-Devops (0.5 -2 Yrs)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23703",
        "location": "Technopark",
        "closing_date": "04 Nov 2025",
        "job_description": "<h2>Junior Technical Support - DevOps</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Job Published:</strong> 20, Sept 2025\n<strong>Closing Date:</strong> 04, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a proactive &amp; highly skilled Technical Support Engineer to provide exceptional technical support to overseas projects, working in rotational shifts to ensure 24/7 availability. This role involves troubleshooting complex issues across cloud platforms, networking, application architectures, and DevOps toolchains. The ideal candidate should be self-motivated, a collaborator, agile, and a continuous learner.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Provide technical support and troubleshoot issues related to cloud platforms and services such as Fargate, ECS, DynamoDB, BigQuery, SNS etc.</li>\n<li>Understand problems by consuming logs and metrics from various sources using services such as CloudWatch, Prometheus, Grafana, Loki, Alert Managers, and Splunk etc.</li>\n<li>Analyze and resolve networking challenges, including load balancers, API gateways, reverse proxies, ingress controllers, and service-to-service communications.</li>\n<li>Work on issues related to client-server communications, firewalls, and virtual machines.</li>\n<li>Collaborate with DevOps teams to manage and troubleshoot toolchains like Docker, Kubernetes, Jenkins, Ingress Controllers etc.</li>\n<li>Act as the first point of contact for technical queries and escalate issues when necessary.</li>\n<li>Liaise with development and operations teams to identify root causes and resolve incidents effectively.</li>\n<li>Document troubleshooting steps, solutions, and maintain a knowledge base for recurring issues.</li>\n<li>Collaborate with cross-functional teams to implement best practices for monitoring and incident response.</li>\n<li>Participate in shift handovers and provide timely updates on ongoing issues.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Cloud Platforms and Services</strong></p>\n<ul>\n<li>Hands-on knowledge working with Fargate and ECS for managing and troubleshooting containerized workloads.</li>\n<li>Proficiency with DynamoDB and BigQuery for analyzing data and making decisions based on the analysis.</li>\n<li>Hands-on knowledge of SNS for debugging message delivery issues and integration workflows.</li>\n</ul>\n<p><strong>Monitoring and Logging Tools</strong></p>\n<ul>\n<li>Proficiency in CloudWatch Logs, Loki, and Splunk for consuming and analyzing logs to identify and resolve issues.</li>\n<li>Hands-on knowledge with Prometheus and Grafana for analyzing metrics using dashboards and monitoring system health.</li>\n<li>Knowledge of Alert Manager for configuring and managing alert escalation.</li>\n<li>Ability to interpret metrics from various sources and create actionable insights.</li>\n</ul>\n<p><strong>Networking and Security</strong></p>\n<ul>\n<li>Understanding of load balancers (e.g., ALB, NLB) for distributing traffic and troubleshooting connectivity issues.</li>\n<li>Knowledge in API Gateways like AWS API Gateway or NGINX for managing API traffic.</li>\n<li>Knowledge of reverse proxies and ingress controllers (e.g., NGINX Ingress, Traefik) for managing internal/external traffic.</li>\n<li>Understanding service-to-service communications, including DNS, HTTP/HTTPS, and gRPC protocols.</li>\n<li>Hands-on knowledge with firewalls, security groups, and IAM roles for secure communications.</li>\n<li>Troubleshooting skills for VM-related issues in platforms like AWS EC2 or equivalent.</li>\n</ul>\n<p><strong>DevOps Toolchains</strong></p>\n<ul>\n<li>Proficiency with Docker for managing container images and runtime debugging.</li>\n<li>Understanding of Kubernetes concepts of managing deployments, ingress setups, and pod-related issues and related troubleshooting commands and mechanisms.</li>\n<li>Knowledge of CI/CD pipeline building tools such as Jenkins, GitHub Actions, ArgoCD for building, deploying, and managing automated pipelines.</li>\n<li>Understanding of Ingress controllers (e.g., NGINX, Traefik) and SSL termination for secure routing.</li>\n</ul>\n<p><strong>Troubleshooting and Incident Management</strong></p>\n<ul>\n<li>Strong problem-solving skills to identify root causes using logs, metrics, and system-level debugging.</li>\n<li>Ability to document detailed troubleshooting steps and solutions for recurring issues.</li>\n</ul>\n<p><strong>Collaboration and Communication</strong></p>\n<ul>\n<li>Ability to work with cross-functional teams (DevOps, development, and operations) to resolve incidents.</li>\n<li>Skills in effective and proactive communication to escalate issues and provide updates during shift handovers.</li>\n<li>Proficiency with tools like Slack, JIRA, Confluence, or Google Workspace for collaboration and issue tracking.</li>\n</ul>\n<p><strong>Salary Package:</strong> 4 - 6 LPA\n<strong>Work Type:</strong> Work From Office\n<strong>Location:</strong> Trivandrum</p>\n<p><strong>Role:</strong> Technical Support Engineer with 0.5 - 2 years of experience.</p>",
        "tags": [
            "0.5-2 Years",
            "DevOps",
            "Cloud Platforms",
            "Networking"
        ],
        "summary": "Seeking a Junior Technical Support Engineer with 0.5-2 years of experience. Responsibilities include troubleshooting cloud, networking, and DevOps issues for overseas projects."
    }
]