[
    {
        "job_title": "Product Support Specialist",
        "company": "Voyon Technology Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21522/372",
        "location": "Infopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<h2>Product Support Specialist</h2>\n<p>We are seeking a proactive and customer-focused <strong>Product Support Specialist</strong> to assist users in effectively utilizing our products. This role involves troubleshooting issues, providing timely support, and collaborating with internal teams to ensure a seamless customer experience.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Provide technical and functional support to customers via phone, email, chat, or ticketing systems</li>\n<li>Understand product features and guide users on proper usage</li>\n<li>Diagnose, troubleshoot, and resolve product-related issues promptly</li>\n<li>Escalate complex issues to internal teams and follow up until resolution</li>\n<li>Document customer interactions, issues, and solutions accurately</li>\n<li>Assist in product testing, feedback collection, and continuous improvement</li>\n<li>Create and update support documentation, FAQs, and user guides</li>\n<li>Ensure high levels of customer satisfaction</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in any discipline (technical background preferred)</li>\n<li>0-2 years of experience in product/customer support</li>\n<li>Strong understanding of software products/applications</li>\n<li>Excellent problem-solving and analytical skills</li>\n<li>Outstanding communication and interpersonal abilities</li>\n<li>Ability to work independently and in a team</li>\n<li>Familiarity with CRM or ticketing tools is advantageous</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary and benefits</li>\n<li>Learning and growth opportunities</li>\n<li>Collaborative, supportive work environment</li>\n</ul>\n<p><strong>Contact:</strong>\n- Follow our LinkedIn page for updates: <a href=\"https://www.linkedin.com/company/voyontechnologyservices\">Voyon Technologies Services</a>\n- Email your resume to: <strong>careers@voyon.net</strong></p>",
        "tags": [
            "0-2 Years",
            "CRM/Ticketing Tools",
            "Software Products",
            "Problem-Solving"
        ],
        "summary": "The Product Support Specialist provides technical support, troubleshoots issues, and ensures customer satisfaction. Requires 0-2 years of experience and strong communication skills."
    },
    {
        "job_title": "Business Development Executive – IT Services (Immediate Hiring)",
        "company": "Ynot Infosolutions",
        "url": "https://infopark.in/company-jobs/details/21526/262",
        "location": "Infopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<p><strong>Business Development Executive – IT Services (Immediate Hiring)</strong></p>\n<p>We are seeking a <strong>Business Development Executive</strong> with experience in <strong>IT services sales</strong> to manage client communication, generate leads, and convert prospects into long-term customers. This role is ideal for candidates who enjoy client interaction, sales discussions, and closing deals, with a basic understanding of websites and IT services.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Generate new business leads through calls, emails, WhatsApp, LinkedIn, and online platforms</li>\n<li>Understand client requirements and suggest suitable IT solutions (websites, apps, digital services)</li>\n<li>Conduct introductory calls and follow-ups with prospects</li>\n<li>Explain IT services and workflows in simple, non-technical language</li>\n<li>Convert leads into sales and achieve monthly targets</li>\n<li>Maintain strong relationships with existing clients</li>\n<li>Track leads, follow-ups, and client updates in CRM or Excel</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong communication &amp; negotiation skills</li>\n<li>Confidence in client handling and follow-ups</li>\n<li>Basic understanding of:</li>\n<li>Websites &amp; web applications</li>\n<li>IT services/software solutions</li>\n<li>Ability to explain concepts clearly to non-technical clients</li>\n<li>Sales-driven mindset with focus on results</li>\n</ul>\n<h3>Good to Have (Not Mandatory)</h3>\n<ul>\n<li>Experience in IT sales / digital marketing/software services</li>\n<li>Basic knowledge of website or app workflows</li>\n<li>Familiarity with hosting, domains, or e-commerce concepts</li>\n</ul>\n<h3>Qualification &amp; Experience</h3>\n<ul>\n<li>Any Bachelor’s degree (Computer Science preferred but not mandatory)</li>\n<li><strong>6 months – 1 year experience</strong> in business development / IT sales/client handling</li>\n</ul>\n<p><strong>Application Instructions:</strong>\nInterested candidates are invited to submit their resumes, portfolios, and cover letters with the subject line: “Business Development Executive”.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@ynotinfo.com</strong>.</p>",
        "tags": [
            "6 Months - 1 Year",
            "IT Sales",
            "Client Relationship Management",
            "Digital Marketing"
        ],
        "summary": "Seeking a Business Development Executive to generate IT services leads and convert prospects into clients. Requires strong communication, sales skills, and basic IT knowledge."
    },
    {
        "job_title": "QA Lead (5–7 years’ experience, 2+ years in Lead Role)",
        "company": "Empay Software Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21544/251",
        "location": "Infopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<h2>QA Lead (5–7 years’ experience, 2+ years in Lead Role)</h2>\n<p>We are seeking an experienced QA Lead to oversee the entire quality assurance lifecycle, manage a team of QA engineers, and ensure the delivery of high-quality software products. The ideal candidate should have strong expertise in manual and automation testing, test strategy planning, quality processes, and team leadership.</p>\n<h3>Location</h3>\n<p>Infopark, Kochi</p>\n<h3>Work Mode</h3>\n<p>Work From Office (Mandatory)</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead and mentor the QA team by providing guidance, technical expertise, and domain knowledge to ensure timely completion of testing activities.</li>\n<li>Review business requirements, functional specifications, and design documents to ensure complete test coverage across all features.</li>\n<li>Prepare and maintain comprehensive QA documentation, including test plans, test cases, user flow diagrams, and coverage reports.</li>\n<li>Plan and execute regression testing for each release, delegate tasks to junior QA members, and collaborate closely with the development team to ensure high-quality, on-time delivery.</li>\n<li>Perform functional testing, database validation, and log analysis to ensure stability and reliability of the web application (Spring MVC) and Spring Boot–based API services.</li>\n<li>Manage test environments, test data, and automation scripts; evaluate and recommend suitable automation frameworks, tools, and technologies to enhance testing efficiency.</li>\n<li>Ensure adherence to QA processes, best practices, and documentation standards aligned with the SDLC.</li>\n<li>Coordinate with cross-functional teams including development, project management, business teams, and clients to resolve issues and support smooth release cycles.</li>\n<li>Identify root causes of recurring issues, implement corrective actions, and continuously monitor the application to prevent recurring defects.</li>\n<li>Explore and propose new automation tools, ideas, and methodologies to improve testing efficiency and coverage.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>Bachelor’s/Master’s degree in Computer Science, Engineering, or a related field.</li>\n<li>5–7 years of experience in QA with minimum 2+ years in a lead or leadership role.</li>\n<li>Strong knowledge of manual and automation testing methodologies.</li>\n<li>Hands-on experience with API testing tools and performance testing tools.</li>\n<li>Strong analytical and problem-solving skills with exceptional attention to detail.</li>\n<li>Excellent leadership, communication, and stakeholder management skills.</li>\n<li>ISTQB or similar certification is an added advantage.</li>\n</ul>\n<h3>Contact</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@empaysoft.com</strong>.</p>",
        "tags": [
            "5–7 Years",
            "Manual & Automation Testing",
            "API Testing Tools",
            "Performance Testing Tools"
        ],
        "summary": "A QA Lead is needed to manage QA teams, ensure software quality, and implement testing strategies. Requires 5–7 years of QA experience with 2+ years in a leadership role."
    },
    {
        "job_title": "Senior QA Engineer (4+ Year’s)",
        "company": "Empay Software Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21545/251",
        "location": "Infopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<h2>Senior QA Engineer (4+ Years)</h2>\n<p>We are seeking an experienced <strong>Senior QA Engineer</strong> with expertise in <strong>Manual Testing</strong> to ensure product quality through comprehensive testing processes. The ideal candidate will collaborate with development and product teams to deliver high-quality releases.</p>\n<h3>Location</h3>\n<p>Infopark, Kochi</p>\n<h3>Work Mode</h3>\n<p>Work From Office (Mandatory)</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Review business requirements and functional specifications for clarity and testability.</li>\n<li>Prepare and maintain QA documentation (test plans, test cases, test scenarios).</li>\n<li>Perform manual testing for web applications, including functional, integration, and regression testing.</li>\n<li>Conduct API testing and basic database validation for accuracy and data consistency.</li>\n<li>Execute test cycles for releases, validate fixes, and ensure quality standards.</li>\n<li>Identify, document, and track defects using defect-tracking tools; follow up with development teams.</li>\n<li>Collaborate with development and product teams to resolve issues and support testing needs.</li>\n<li>Maintain organized test data, test results, and QA documentation.</li>\n<li>Provide guidance to junior QA team members as needed.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li><strong>4+ years</strong> of hands-on software testing experience.</li>\n<li>Strong understanding of SDLC, STLC, and defect life cycle processes.</li>\n<li>Solid manual testing methodologies and best practices.</li>\n<li>Experience in API testing and backend validation.</li>\n<li>Working knowledge of test management and defect-tracking tools.</li>\n<li>Strong analytical thinking, communication skills, and attention to detail.</li>\n<li>Exposure to automation tools is an added advantage.</li>\n</ul>\n<h3>Contact</h3>\n<p>For inquiries, email your resume to <strong>hr@empaysoft.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "Manual Testing",
            "API Testing",
            "Defect-Tracking Tools"
        ],
        "summary": "Senior QA Engineer required with 4+ years of manual testing experience. Responsibilities include test execution, defect tracking, and collaboration with development teams for quality releases."
    },
    {
        "job_title": "Java Team Lead (5+ years of experience in Java, with at least 2+years of experience in lead role)",
        "company": "Empay Software Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21546/251",
        "location": "Infopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<p><strong>Java Team Lead</strong></p>\n<p><strong>Location:</strong> Infopark, Kochi\n<strong>Work Mode:</strong> Work From Office (Mandatory)</p>\n<p>We are seeking a <strong>highly skilled and motivated Java Team Lead</strong> to join our expanding technology team. The ideal candidate will possess <strong>strong expertise in Java-based application development</strong> and <strong>proven leadership experience</strong> in guiding development teams. If you have <strong>hands-on experience with microservices, cloud platforms, and modern frameworks</strong>, we’d like to meet you.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, test, and deliver high-quality software based on functional and technical requirements.</li>\n<li>Review code, perform debugging, and ensure adherence to best coding practices.</li>\n<li>Lead and mentor a team of Java developers, providing technical guidance and performance feedback.</li>\n<li>Participate actively across all stages of the Software Development Life Cycle (SDLC).</li>\n<li>Collaborate with cross-functional teams to define technical solutions and resolve project challenges.</li>\n<li>Ensure timely delivery of project modules while maintaining code quality and performance standards.</li>\n<li>Prepare and maintain technical documentation as needed.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>Minimum 5+ years of Java development experience</strong>.</li>\n<li><strong>At least 2+ years in a team lead or senior developer role</strong>.</li>\n<li>Strong expertise in:</li>\n<li>Core Java, OOPS Concepts</li>\n<li>Spring MVC, Spring Boot, Spring Security</li>\n<li>JPA, Hibernate</li>\n<li>RESTful APIs, Microservices</li>\n<li>HTML/JSP and React (good to have)</li>\n<li>Eclipse/IntelliJ IDE</li>\n<li>Strong knowledge of SQL Server or Oracle databases.</li>\n<li>Solid understanding of SDLC methodologies (Agile/Scrum preferred).</li>\n<li>Experience working with cloud platforms (AWS, Azure, or Google Cloud).</li>\n<li>Experience in Banking, EFT, or Card Payment domains is an added advantage.</li>\n<li>Bachelor’s/Master’s degree in Computer Science, Engineering, or related field.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@empaysoft.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Microservices"
        ],
        "summary": "Lead Java development teams with expertise in microservices and cloud platforms. Requires 5+ years of Java experience and 2+ years in a leadership role."
    },
    {
        "job_title": "UI/UX Designer Internship",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/21525/387",
        "location": "Infopark",
        "closing_date": "13 Jan 2026",
        "job_description": "<h2>UI/UX Designer Internship</h2>\n<p><strong>Location:</strong> Kochi</p>\n<p>Join us as a <strong>UI/UX Design Intern</strong> and work on real-world projects with expert mentorship. Top performers may be absorbed as <strong>UI/UX Trainees</strong> after successful internship completion.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Collaborate on real-world UI/UX projects</li>\n<li>Receive expert mentorship and guidance</li>\n<li>Contribute to design processes under supervision</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Basic understanding of UI/UX principles</li>\n<li>Familiarity with design tools like <strong>Figma</strong>, <strong>Adobe XD</strong>, <strong>Sketch</strong>, or similar</li>\n<li>Strong attention to detail and creativity</li>\n<li>Willingness to learn and accept feedback positively</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <strong>careers@alignminds.com</strong></p>",
        "tags": [
            "Entry Level",
            "UI/UX Principles",
            "Figma",
            "Adobe XD"
        ],
        "summary": "Seeking a UI/UX Design Intern to work on real-world projects in Kochi with expert mentorship. Top performers may transition to UI/UX Trainee roles post-internship."
    },
    {
        "job_title": "Lead Generation Executive / Business Development Executive",
        "company": "AlignMinds Technologies",
        "url": "https://infopark.in/company-jobs/details/21540/387",
        "location": "Infopark",
        "closing_date": "14 Jan 2026",
        "job_description": "<p><strong>Job Title:</strong> Lead Generation Executive / Business Development Executive\n<strong>Location:</strong> Kochi\n<strong>Experience:</strong> 1+ Years</p>\n<p>We are seeking a <strong>results-driven Lead Generation Executive</strong> to identify, qualify, and generate new business opportunities. The ideal candidate will:</p>\n<ul>\n<li><strong>Identify and generate new leads</strong> through cold calling, email campaigns, LinkedIn, social media, and online research</li>\n<li><strong>Research target companies</strong> and decision-makers to build a qualified prospect database</li>\n<li><strong>Qualify leads</strong> based on predefined criteria and pass high-quality leads to the sales team</li>\n<li><strong>Maintain CRM systems</strong> with accurate lead information</li>\n<li><strong>Collaborate with sales and marketing teams</strong> to improve lead quality and conversion rates</li>\n<li><strong>Track and report</strong> lead generation metrics and performance regularly</li>\n<li><strong>Stay updated</strong> on industry trends, competitors, and market conditions</li>\n<li><strong>Follow up with prospects</strong> to nurture relationships and advance them through the sales funnel</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong>\n- Bachelor’s degree in Business, Marketing, or a related field (preferred)\n- Proven experience in lead generation, sales development, or similar roles\n- Strong communication and interpersonal skills\n- Ability to research and analyze market data\n- Familiarity with CRM tools and lead generation platforms\n- Goal-oriented mindset with target-achievement focus\n- Strong organizational and time-management skills</p>\n<p><strong>Contact:</strong> Share your resume at <strong>careers@alignminds.com</strong></p>",
        "tags": [
            "1+ Years",
            "CRM Tools",
            "Lead Generation Platforms",
            "LinkedIn/Social Media"
        ],
        "summary": "Lead Generation Executive to identify and nurture business opportunities through cold calling, email campaigns, and CRM tools. Requires 1+ years of sales development experience."
    },
    {
        "job_title": "Customer Support Associate",
        "company": "ORTHOFX PRIVATE LIMITED",
        "url": "https://infopark.in/company-jobs/details/21548/354",
        "location": "Infopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Company Overview</h2>\n<p>OrthoFX is the first all-in-one aligner solution preferred by doctors, transforming practices and patient lives through innovation, technology, and value-added services. Our patented polymers deliver continuous optimal forces during treatment, supported by efficient 3D controls and AI-enabled remote monitoring. We partner with over 1,850 locations globally, offering tools and support to maximize profitability and eliminate inefficiencies.</p>\n<h2>Position Summary</h2>\n<p>As a <strong>Customer Support Associate</strong>, you will be a crucial part of our Customer Success Team. Your success will be driven by your genuine passion for helping customers and your willingness to learn and grow.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Handle customer inquiries via email, phone, and chat with prompt, accurate responses.</li>\n<li>Provide knowledgeable assistance and go the extra mile to resolve customer queries.</li>\n<li>Resolve issues within agreed Service Level Agreement (SLA) deadlines.</li>\n<li>Collaborate with internal stakeholders (Sales Team, Product Team) for faster resolutions.</li>\n<li>Escalate complex issues to managers when necessary.</li>\n<li>Resolve incoming queries from the Sales Team to facilitate sales.</li>\n<li>Reach out to doctors, staff, and dental practice stakeholders for updates and information retrieval.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Graduation in any discipline.</li>\n<li>Excellent communication skills (written, verbal, interpersonal).</li>\n<li>Mandatory voice process experience.</li>\n<li>Strong problem-solving skills to identify root causes of customer issues.</li>\n<li>Support executive experience with US-based companies preferred.</li>\n<li>Superior documentation expertise.</li>\n<li>Confident phone presence and strong listening skills.</li>\n<li>Reliable, detail-oriented work ethic.</li>\n</ul>\n<h2>We Offer</h2>\n<ul>\n<li>Comprehensive training and career growth opportunities.</li>\n<li>Industry knowledge expansion.</li>\n<li>A fun, supportive, and high-performing culture.</li>\n<li>Advancement opportunities in Revenue Operations (Sales, Marketing, Customer Service).</li>\n</ul>\n<h2>Job Details</h2>\n<ul>\n<li><strong>Location</strong>: Kochi</li>\n<li><strong>Working Hours</strong>: US Shift</li>\n</ul>\n<p><strong>Contact</strong>: For applications, email your updated resume to hr-india@orthofx.com.</p>",
        "tags": [
            "1+ Year",
            "Customer Support",
            "Communication Skills",
            "Problem-Solving"
        ],
        "summary": "Customer Support Associate at OrthoFX handles inquiries, resolves issues, and collaborates with teams to ensure customer satisfaction in the orthodontic aligner industry."
    },
    {
        "job_title": "Java Spring Boot Developers (Experience: 3-5 years)",
        "company": "SayOne Technologies Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21523/129",
        "location": "Infopark",
        "closing_date": "17 Jan 2026",
        "job_description": "<h2>Java Spring Boot Developer</h2>\n<p><strong>Experience:</strong> 3–5 Years\n<strong>Employment Type:</strong> Full-Time\n<strong>Location:</strong> Kochi/Work from office</p>\n<h3>About the Role</h3>\n<p>We are seeking a skilled and motivated Software Developer with <strong>3+ years</strong> of hands-on experience in building scalable backend systems. The ideal candidate will possess strong expertise in Java-based microservices, cloud technologies, and modern development practices. You will collaborate closely with cross-functional teams in an agile environment to design, develop, test, and deploy high-quality software solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain Java Spring Boot microservices</li>\n<li>Build and manage projects using Maven</li>\n<li>Write clean, maintainable, and well-tested code following best practices</li>\n<li>Develop and execute unit tests using JUnit</li>\n<li>Implement and manage caching solutions using Redis</li>\n<li>Work with relational databases such as PostgreSQL and MySQL</li>\n<li>Integrate and manage services on Amazon Web Services (AWS), including:</li>\n<li>EC2</li>\n<li>S3</li>\n<li>Kinesis</li>\n<li>SQS</li>\n<li>Monitor, debug, and optimize applications using the ELK stack (Elasticsearch, Logstash, Kibana)</li>\n<li>Collaborate with team members using Git for version control</li>\n<li>Participate actively in Agile/Scrum ceremonies (stand-ups, sprint planning, retrospectives)</li>\n<li>Track tasks, bugs, and progress using Jira or similar project management tools</li>\n<li>Troubleshoot production issues and provide timely resolutions</li>\n<li>Contribute to system design discussions and technical decision-making</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>3–5 years</strong> of professional experience in software development</li>\n<li>Strong proficiency in Java and Spring Boot (Microservices architecture)</li>\n<li>Experience with Maven build lifecycle</li>\n<li>Solid understanding of Git-based workflows</li>\n<li>Hands-on experience with JUnit testing</li>\n<li>Knowledge of ELK stack for logging and monitoring</li>\n<li>Experience with Redis for caching</li>\n<li>Strong SQL skills with PostgreSQL/MySQL</li>\n<li>Practical experience with AWS services (EC2, S3, Kinesis, SQS)</li>\n<li>Familiarity with Agile methodologies and Scrum framework</li>\n<li>Experience using Jira or similar tools for project tracking</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong problem-solving and analytical skills</li>\n<li>Good communication and collaboration abilities</li>\n<li>A proactive team player with a sense of ownership</li>\n<li>Ability to work independently</li>\n<li>Willingness to learn new technologies and adapt to changing requirements</li>\n</ul>\n<h3>Nice to Have (Optional)</h3>\n<ul>\n<li>Experience with CI/CD pipelines</li>\n<li>Exposure to containerization (Docker/Kubernetes)</li>\n<li>Understanding of system design and scalability concepts</li>\n</ul>\n<p><strong>Contact:</strong> Share your updated resume at careers@sayonetech.com.</p>",
        "tags": [
            "3–5 Years",
            "Java Spring Boot",
            "AWS",
            "Git"
        ],
        "summary": "Java Spring Boot Developer with 3–5 years of experience in building scalable backend systems, microservices, and AWS integration. Requires expertise in Java, Spring Boot, and Agile methodologies."
    },
    {
        "job_title": "Market Research Consultant",
        "company": "Armia Systems Pvt. Ltd",
        "url": "https://infopark.in/company-jobs/details/21547/3",
        "location": "Infopark",
        "closing_date": "17 Jan 2026",
        "job_description": "<p><strong>Market Research Consultant</strong></p>\n<p><strong>Company:</strong> Armia Systems Pvt Ltd\n<strong>Location:</strong> Infopark Kochi\n<strong>Duration:</strong> 6 months (extendable based on business requirements)</p>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Graduation (any discipline)</li>\n<li><strong>6 Months</strong> in data entry/market research</li>\n<li>Excellent written and verbal communication in English</li>\n<li>Experience in <strong>Market Research</strong>, <strong>Google Sheets/Excel</strong>, and basic <strong>AI tools</strong></li>\n<li>Strong attention to detail and accuracy</li>\n<li>Ability to work independently and follow instructions</li>\n<li>Willingness to handle repetitive, detail-oriented tasks</li>\n</ul>\n<h3><strong>Roles &amp; Responsibilities</strong></h3>\n<ul>\n<li>Collect and compile café menu data by researching websites and entering information into a web application</li>\n<li>Update and confirm completion status in Google Sheets</li>\n<li>Cross-check data for accuracy and completeness</li>\n<li>Follow data entry guidelines and formats</li>\n<li>Coordinate with internal teams for clarifications or missing info</li>\n<li>Maintain consistency and quality during repetitive tasks</li>\n</ul>\n<h3><strong>Contact</strong></h3>\n<p>Share your resume at <strong>jobs@armia.com</strong> if this aligns with your career goals.</p>",
        "tags": [
            "6 Months",
            "Market Research",
            "Google Sheets/Excel",
            "AI Tools"
        ],
        "summary": "Market Research Consultant for Product Support Team at Armia Systems, requiring data entry, market research, and attention to detail skills."
    },
    {
        "job_title": "Digital Marketing Interns",
        "company": "GALTech Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21551/189",
        "location": "Infopark",
        "closing_date": "17 Jan 2026",
        "job_description": "<p><strong>Digital Marketing Interns</strong></p>\n<p>We are seeking enthusiastic and motivated <strong>Digital Marketing Interns</strong> to join our team for a <strong>6-month internship</strong>. This opportunity provides hands-on experience in digital marketing and a foundation for a full-time career.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Assist in planning and executing digital marketing campaigns</li>\n<li>Support SEO activities (on-page, off-page, keyword research, backlinking)</li>\n<li>Manage and assist with social media content creation and scheduling</li>\n<li>Help in basic Google Ads and social media ads execution</li>\n<li>Create and optimize content for websites, blogs, and social platforms</li>\n<li>Analyze campaign performance using tools like Google Analytics</li>\n<li>Conduct market and competitor research</li>\n</ul>\n<h3>Eligibility / Requirements</h3>\n<ul>\n<li>Basic knowledge of digital marketing concepts</li>\n<li>Familiarity with SEO, social media platforms, and content marketing</li>\n<li>Good communication and writing skills</li>\n<li>Willingness to learn and adapt in a fast-paced environment</li>\n<li>Freshers who have completed a Digital Marketing course</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Hands-on practical training</li>\n<li>Internship certificate upon successful completion</li>\n<li>Performance-based opportunity for full-time employment</li>\n</ul>\n<p>If this aligns with your career goals, share your updated resume at <strong>hr@galtech.org</strong>.</p>",
        "tags": [
            "Freshers (0-1 Years)",
            "SEO",
            "Google Ads",
            "Social Media Marketing"
        ],
        "summary": "6-month digital marketing internship for freshers, offering hands-on experience in SEO, Google Ads, and social media. Includes training, certificate, and potential full-time employment."
    },
    {
        "job_title": "Frontend Web Developer: React (Contractor Role)",
        "company": "Zoiteckh Informations Solutions",
        "url": "https://infopark.in/company-jobs/details/21527/466",
        "location": "Infopark",
        "closing_date": "19 Jan 2026",
        "job_description": "<p><strong>Frontend Web Developer: React (Contractor Role)</strong></p>\n<p><strong>Framework:</strong> React (TypeScript mandatory)\n<strong>State:</strong> Redux Toolkit / Zustand\n<strong>Styling:</strong> Tailwind CSS\n<strong>Build:</strong> Vite / Webpack\n<strong>API:</strong> REST integration (Axios / Fetch)</p>\n<p><strong>Mandatory Skills:</strong>\n- Component-driven architecture\n- Clean state management\n- Form validation &amp; error handling</p>\n<p><strong>Performance Basics:</strong>\n- Memorisation\n- Avoid unnecessary re-renders\n- Cross-browser &amp; responsive design</p>\n<p><strong>Debugging Skills:</strong>\n- Browser dev tools mastery\n- Debug API/network issues\n- Fix UI bugs without copy-pasting AI output</p>\n<p><strong>AI Usage Expectation:</strong>\n- Use AI for: Component scaffolding, UI layout ideas\n- <strong>Must:</strong> Understand React lifecycle clearly, Fix broken hooks/state logic manually</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@zoiteckh.com</strong></p>",
        "tags": [
            "Not Specified",
            "React",
            "Redux Toolkit",
            "Tailwind CSS"
        ],
        "summary": "Frontend Developer needed for React projects with Redux and Tailwind. Requires strong debugging and performance optimization skills."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Apro IT Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21532/420",
        "location": "Infopark",
        "closing_date": "20 Jan 2026",
        "job_description": "<h2>UI/UX Designer</h2>\n<p>We are seeking a <strong>UI/UX Designer</strong> who can take ownership of features and projects end-to-end, contributing meaningfully to product decisions. This role goes beyond designing screens—it requires understanding user problems, collaborating closely with stakeholders, and translating ideas into thoughtful, intuitive digital experiences. The ideal candidate is comfortable working independently, asking the right questions, and balancing UX thinking with strong UI execution.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Own the UI/UX design process for assigned features or projects from concept to delivery</li>\n<li>Work closely with product managers, developers, and stakeholders to understand business goals and user needs</li>\n<li>Translate problem statements into user flows, wireframes, and high-fidelity designs</li>\n<li>Conduct user research, competitor analysis, and usability reviews to inform design decisions</li>\n<li>Create and maintain consistent UI patterns and design systems across products</li>\n<li>Present design ideas clearly and explain the reasoning behind decisions</li>\n<li>Collaborate with developers during implementation to ensure design quality and usability</li>\n<li>Continuously improve existing experiences based on feedback and product learnings</li>\n</ul>\n<h3>What We’re Looking For</h3>\n<ul>\n<li>1–3 years of hands-on experience in UI/UX or Product Design</li>\n<li>Strong understanding of user-centered design principles</li>\n<li>Ability to think beyond visuals and focus on solving real user problems</li>\n<li>Proficiency in design tools such as <strong>Figma</strong> (Adobe XD / Sketch knowledge is a plus)</li>\n<li>A solid portfolio showcasing design process, problem-solving, and final outcomes</li>\n<li>Basic understanding of responsive design and how designs translate to development</li>\n<li>Good communication skills and the ability to work cross-functionally</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Experience working on real products with multiple stakeholders</li>\n<li>Familiarity with accessibility and mobile-first design principles</li>\n<li>Basic understanding of HTML/CSS</li>\n<li>Ability to work in fast-paced or ambiguous environments</li>\n</ul>\n<h3>What This Role Is NOT</h3>\n<ul>\n<li>Not just a UI execution role</li>\n<li>Not limited to following instructions or handing off screens</li>\n<li>This role expects ownership, curiosity, and active participation in shaping the product</li>\n</ul>\n<h3>Why Join Us</h3>\n<ul>\n<li>Opportunity to work on meaningful, real-world products</li>\n<li>High ownership and impact on design decisions</li>\n<li>Collaborative environment with direct access to decision-makers</li>\n<li>Space to grow into a strong product-focused designer</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@aproitsolutions.in</strong>.</p>",
        "tags": [
            "1–3 Years",
            "Figma",
            "User-Centered Design",
            "Design Systems"
        ],
        "summary": "Seeking a UI/UX Designer with 1–3 years of experience to own end-to-end design projects, solve user problems, and collaborate cross-functionally. Requires proficiency in Figma and user-centered design principles."
    },
    {
        "job_title": "Performance Marketing Executive",
        "company": "Apro IT Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21533/420",
        "location": "Infopark",
        "closing_date": "20 Jan 2026",
        "job_description": "<h2>Performance Marketing Executive</h2>\n<p>We are a growing IT solutions and digital marketing firm seeking a <strong>Performance Marketing Executive</strong> who specializes in managing and optimizing paid advertising campaigns across multiple platforms. This role is perfect for a data-driven marketer with <strong>6 months - 1 year</strong> of hands-on experience in paid media who thrives on testing, analytics, and delivering measurable results. You will be responsible for driving consistent <strong>4x ROAS</strong> and ensuring client satisfaction through strategic execution and continuous optimization.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Plan, execute, and optimize campaigns across <strong>Meta Ads</strong>, <strong>Google Ads</strong>, and other paid media platforms.</li>\n<li>Continuously monitor performance and optimize campaigns for <strong>CTR</strong>, <strong>CPC</strong>, <strong>CPL</strong>, and <strong>ROAS</strong>.</li>\n<li>Collaborate with the creative team to develop high-converting ad visuals and compelling copy.</li>\n<li>Conduct A/B testing on creatives, audiences, and landing pages to identify winning combinations.</li>\n<li>Prepare detailed weekly and monthly performance reports with insights and actionable recommendations.</li>\n<li>Stay ahead of platform updates, bidding strategies, and best practices to ensure competitive advantage.</li>\n<li>Contribute to strategic media planning aimed at achieving sustained performance growth for each client.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>6 months - 1 year</strong> of hands-on experience in performance marketing / paid advertising.</li>\n<li>Proven record of achieving or exceeding <strong>4x ROAS</strong> consistently across campaigns.</li>\n<li>Strong knowledge of <strong>Meta Ads Manager</strong> and <strong>Google Ads</strong>, including campaign structure and optimization tactics.</li>\n<li>Understanding of funnels, pixels, conversions, tracking, and retargeting strategies.</li>\n<li>Analytical proficiency with tools for performance tracking and data interpretation.</li>\n<li>Excellent communication and client management skills, with a focus on reporting clarity and transparency.</li>\n</ul>\n<h3>Bonus Skills (Nice to Have)</h3>\n<ul>\n<li>Experience with <strong>LinkedIn Ads</strong> or <strong>YouTube Ads</strong>.</li>\n<li>Familiarity with <strong>GA4</strong>, <strong>GTM</strong>, and conversion tracking setup.</li>\n<li>Basic knowledge of ad copywriting and creative testing.</li>\n<li>Previous experience in a digital marketing agency environment.</li>\n</ul>\n<h3>Success Metrics (How You’ll Be Measured)</h3>\n<ul>\n<li>Consistent delivery of <strong>4x+ ROAS</strong> across all client campaigns.</li>\n<li>Achievement of defined <strong>CPL</strong>, <strong>CTR</strong>, and conversion goals.</li>\n<li>High client satisfaction and retention through measurable results.</li>\n<li>Quality, accuracy, and insightfulness of performance reporting.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@aproitsolutions.in</strong>.</p>",
        "tags": [
            "6 Months - 1 Year",
            "Meta Ads Manager",
            "Google Ads",
            "ROAS Optimization"
        ],
        "summary": "A Performance Marketing Executive with 6-12 months of paid media experience is needed to optimize Meta and Google Ads campaigns, achieving 4x ROAS and driving client satisfaction through data-driven strategies."
    },
    {
        "job_title": "Senior Backend Engineer",
        "company": "ORTHOFX PRIVATE LIMITED",
        "url": "https://infopark.in/company-jobs/details/21549/354",
        "location": "Infopark",
        "closing_date": "30 Jan 2026",
        "job_description": "<h2>Senior Backend Engineer</h2>\n<h3>Job Summary</h3>\n<p>We are seeking a highly skilled Senior Software Engineer – Java with a strong backend and DevOps background to design, develop, deploy, and maintain scalable, cloud-native applications. The role involves building high-performance backend services while actively contributing to CI/CD pipelines, containerization, and cloud infrastructure.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain backend services using <strong>Java 11+</strong>, <strong>Spring Boot</strong>, and <strong>JPA/Hibernate</strong></li>\n<li>Build and optimize <strong>PostgreSQL</strong> databases, ensuring performance and reliability</li>\n<li>Develop and maintain <strong>RESTful APIs</strong> within a <strong>microservices architecture</strong></li>\n<li>Implement and manage <strong>CI/CD pipelines</strong> for automated build and deployment</li>\n<li>Containerize applications using <strong>Docker</strong> and deploy on <strong>Kubernetes (EKS)</strong></li>\n<li>Work with <strong>AWS</strong> services such as <strong>EC2, RDS/Aurora, S3, Cognito</strong>, and <strong>EKS</strong></li>\n<li>Monitor application health and performance using logging and monitoring tools</li>\n<li>Ensure security best practices, including authentication and authorization</li>\n<li>Collaborate with cross-functional teams in an <strong>Agile/Scrum</strong> environment</li>\n<li>Participate in code reviews, design discussions, and production support</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>5+ years</strong> of hands-on experience in Java backend development</li>\n<li>Strong expertise in <strong>Java 11+</strong>, <strong>Spring Boot</strong>, <strong>Spring Data JPA</strong></li>\n<li>Solid experience with <strong>PostgreSQL</strong> and database performance tuning</li>\n<li>Hands-on experience with <strong>microservices</strong> and <strong>REST API</strong> design</li>\n<li>Strong <strong>DevOps</strong> experience with:</li>\n<li><strong>Docker &amp; Kubernetes</strong></li>\n<li><strong>CI/CD tools</strong> (Jenkins, GitHub Actions, Bitbucket Pipelines, GitLab CI)</li>\n<li>Working knowledge of <strong>AWS</strong> cloud services</li>\n<li>Experience with <strong>Linux</strong>, shell scripting, and production deployments</li>\n<li>Good understanding of system design and scalability</li>\n<li><strong>Bachelor’s degree</strong> in Engineering / Computer Science or equivalent</li>\n</ul>\n<h3>Why OrthoFX?</h3>\n<ul>\n<li>Be part of a high-growth US-based healthcare tech company.</li>\n<li>Work on impactful products that touch real lives.</li>\n<li>Collaborative, transparent, and inclusive culture.</li>\n<li>Opportunities to grow and lead as the company scales.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr-india@orthofx.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Docker"
        ],
        "summary": "Senior Backend Engineer required with Java, DevOps, and cloud expertise to design scalable applications and manage CI/CD pipelines."
    },
    {
        "job_title": "QA Automation Engineer",
        "company": "ORTHOFX PRIVATE LIMITED",
        "url": "https://infopark.in/company-jobs/details/21550/354",
        "location": "Infopark",
        "closing_date": "30 Jan 2026",
        "job_description": "<h2>QA Automation Engineer</h2>\n<h3>Role Overview</h3>\n<p>We are seeking an Automation QA Engineer to bridge traditional automation with AI-driven quality engineering. You will build robust test frameworks and integrate AI tools to enhance test coverage, reduce maintenance, and accelerate CI/CD pipelines.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>AI-Enhanced Frameworks</strong>: Design automation frameworks (e.g., Selenium, Playwright) with AI plugins for self-healing locators to reduce flaky tests.</li>\n<li><strong>Generative QA</strong>: Use Large Language Models (LLMs) and GenAI tools to generate test cases, edge-case scenarios, and synthetic test data.</li>\n<li><strong>Shift-Left Intelligence</strong>: Implement AI tools to analyze code changes and predict test failures for faster feedback.</li>\n<li><strong>Visual Regression</strong>: Deploy AI-based tools (Applitools, Percy) to detect UI inconsistencies beyond pixel-matching.</li>\n<li><strong>Performance Insight</strong>: Apply machine learning models to analyze logs and performance metrics to identify bottlenecks.</li>\n</ul>\n<h3>Technical Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Traditional Stack</strong>: Proficiency in Java, Python, or JavaScript with experience in PyTest, TestNG, or Cypress.</li>\n<li><strong>AI Tooling</strong>: Hands-on experience or interest in AI testing platforms (Testim.io, Mabl, Functionize).</li>\n<li><strong>Prompt Engineering</strong>: Use GenAI (ChatGPT, GitHub Copilot) for script writing and test plan documentation.</li>\n<li><strong>Data Literacy</strong>: Basic understanding of AI model training/validation for testing AI-integrated features.</li>\n</ul>\n<h3>Contact</h3>\n<p>If this aligns with your goals, share your resume at <a href=\"mailto:hr-india@orthofx.com\">hr-india@orthofx.com</a>.</p>",
        "tags": [
            "Not Specified",
            "Java/Python/JavaScript",
            "AI Testing Tools (Testim.io, Mabl)",
            "Generative AI (LLMs)"
        ],
        "summary": "QA Automation Engineer needed to develop AI-enhanced test frameworks and leverage GenAI tools for test case generation and visual regression. Requires proficiency in Java/Python, AI testing platforms, and prompt engineering for AI-assisted testing."
    },
    {
        "job_title": "Junior PPC Executive",
        "company": "Orestes Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21528/390",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Job Summary</strong>\nWe are seeking a <strong>Junior PPC Executive</strong> to support in planning, executing, and optimizing paid advertising campaigns across digital platforms. The ideal candidate should have foundational knowledge of performance marketing and a strong eagerness to learn and grow in paid media.</p>\n<p><strong>Key Responsibilities</strong>\n- Assist in setting up and managing PPC campaigns on:\n  - <strong>Google Ads</strong> (Search, Display, YouTube, Google Business)\n  - <strong>Meta Ads</strong> (Facebook &amp; Instagram)\n  - <strong>LinkedIn</strong> and other platforms\n- Participate in ROI-based monthly campaign strategy planning for each client, including:\n  - Goal setting\n  - Budget allocation\n  - Audience and funnel planning\n- Conduct keyword research and audience targeting.\n- Create and manage ad copies, extensions, and creatives in coordination with the design/content team.\n- Monitor and optimize daily campaign performance (CTR, CPC, conversions, ROAS).\n- Support A/B testing of ads, audiences, and landing pages.\n- Prepare monthly and weekly performance reports with insights and recommendations.\n- Assist in setting up and monitoring conversion tracking (GA4, Google Tag Manager, Meta Pixel).\n- Ensure campaigns align with client objectives, timelines, and budgets.\n- Stay updated with the latest PPC trends, tools, and platform updates.</p>\n<p><strong>Required Skills &amp; Qualifications</strong>\n- Strong analytical and problem-solving skills\n- Good communication and teamwork skills</p>\n<p><strong>Contact Information</strong>\nInterested candidates should share their resume to <strong>aswathy@orestestech.com</strong>. For further inquiries, contact <strong>8089671177</strong>.</p>",
        "tags": [
            "0-2 Years",
            "Google Ads",
            "Meta Ads",
            "LinkedIn"
        ],
        "summary": "Junior PPC Executive needed to manage Google Ads, Meta, and LinkedIn campaigns. Requires 0-2 years experience, analytical skills, and collaboration with design/content teams."
    },
    {
        "job_title": "Business Development Executive  – IT & Digital Sales (Domestic)",
        "company": "Orestes Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21529/390",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Business Development Executive – IT &amp; Digital Sales (Domestic)</h2>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Identify, generate, and convert new business opportunities in the domestic market through meetings and networking.</li>\n<li>Promote and sell IT services including web development, software solutions, mobile apps, digital marketing, and cloud solutions.</li>\n<li>Conduct client visits, product presentations, and requirement analysis.</li>\n<li>Build and maintain strong relationships with clients, partners, and decision-makers.</li>\n<li>Prepare proposals, quotations, and negotiate commercial terms to close deals.</li>\n<li>Achieve monthly and quarterly sales targets and revenue goals.</li>\n<li>Maintain accurate sales records, pipeline updates, and CRM data.</li>\n<li>Coordinate with technical, marketing, and delivery teams to ensure smooth project execution.</li>\n<li>Track market trends, competitor activities, and customer feedback.</li>\n<li>Participate in exhibitions, trade shows, and business events when required.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Minimum <strong>3+ years</strong> of proven experience in IT and digital sales (Domestic Market).</li>\n<li>Strong understanding of IT services and digital solutions.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to identify client needs and propose suitable IT solutions.</li>\n<li>Self-motivated, target-oriented, and capable of working independently.</li>\n<li>Proficiency in CRM tools, MS Office, and sales reporting.</li>\n<li>Willingness to travel extensively within the assigned territory.</li>\n</ul>\n<h3>Contact Information:</h3>\n<ul>\n<li>Email: <a href=\"mailto:aswathy@orestestech.com\">aswathy@orestestech.com</a></li>\n<li>Phone: 8089671177</li>\n</ul>",
        "tags": [
            "3+ Years",
            "IT Services",
            "Digital Solutions",
            "CRM Tools"
        ],
        "summary": "Drive domestic IT and digital sales by generating business opportunities, managing client relationships, and meeting revenue targets. Requires 3+ years of experience in IT sales and proficiency in CRM tools."
    },
    {
        "job_title": "Automation Tester-Squish (Job Code: iATSq)",
        "company": "Calpine Group",
        "url": "https://infopark.in/company-jobs/details/21530/1",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Job Title:</strong> Automation Tester - Squish\n<strong>Job Code:</strong> iATSq</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Work closely with QA, validation teams, developers, and product managers to understand requirements, resolve issues, and provide feedback.</li>\n<li>Write, execute, and debug automated test scripts for functional, regression, performance, API, and UI testing.</li>\n<li>Integrate automated tests into <strong>CI/CD pipelines</strong> in <strong>Azure DevOps</strong>.</li>\n<li>Communicate test progress, risks, and challenges to the team and management.</li>\n<li>Participate in design reviews to provide feedback on testability and potential issues.</li>\n<li>Analyze test results, identify failures, and report bugs with detailed information in <strong>Azure DevOps</strong>, escalating to QA manager and Product manager as needed.</li>\n<li>Create documentation to support testing and include it in <strong>Azure DevOps</strong> for work item closure.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li><strong>3-8 years</strong> of experience in QA automation.</li>\n<li>Proficiency in <strong>Squish</strong> for test automation.</li>\n<li>Strong understanding of <strong>CI/CD pipelines</strong> and <strong>Azure DevOps</strong>.</li>\n<li><strong>BE/BTech/MSc/MCA</strong> degree.</li>\n</ul>\n<h3>Work Location:</h3>\n<ul>\n<li><strong>Kochi</strong></li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Candidates meeting the above criteria may submit their resumes to <strong><a href=\"mailto:resume@calpinetech.com\">resume@calpinetech.com</a></strong>.</p>",
        "tags": [
            "3-8 Years",
            "Squish",
            "Azure DevOps",
            "CI/CD"
        ],
        "summary": "QA Automation Tester with 3-8 years of experience in Squish and Azure DevOps, responsible for test automation, CI/CD integration, and collaboration with cross-functional teams."
    },
    {
        "job_title": "Sr. Frontend Developer/Lead-React (Job Code: iSFRCt)",
        "company": "Calpine Group",
        "url": "https://infopark.in/company-jobs/details/21531/1",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Sr. Frontend Developer/Lead - React (Job Code: iSFRCt)</h2>\n<p><strong>Location:</strong> Immediate joiners required from Kochi/Bangalore</p>\n<h3>Mandatory Skills</h3>\n<ul>\n<li><strong>Core Technologies:</strong> React.js, TypeScript, JavaScript, Next.js</li>\n<li><strong>Technical Requirements:</strong></li>\n<li>Proficiency in JavaScript, HTML/CSS, and React</li>\n<li>Experience with state management libraries (e.g., Redux)</li>\n<li>Integration of REST APIs</li>\n<li>Responsive design principles and performance optimization techniques (e.g., lazy loading)</li>\n<li>Version control with GitHub</li>\n<li>CI/CD pipelines, Docker, and AWS CloudFront/cloud services</li>\n</ul>\n<h3>Candidate Profile</h3>\n<ul>\n<li><strong>Experience:</strong> 5+ years in frontend development</li>\n<li><strong>Qualifications:</strong> BE/BTech/MCA</li>\n<li><strong>Soft Skills:</strong></li>\n<li>Strong problem-solving abilities</li>\n<li>Effective communication</li>\n<li>Passion for technology</li>\n<li>Quality-focused coding mindset</li>\n</ul>\n<p><strong>Contact:</strong> Share your updated resume at <a href=\"mailto:resume@calpinetech.com\">resume@calpinetech.com</a></p>",
        "tags": [
            "5+ Years",
            "React.js",
            "TypeScript",
            "Next.js"
        ],
        "summary": "Senior/Lead React developer with expertise in TypeScript, Next.js, and AWS. Requires strong problem-solving and 5+ years of frontend experience."
    },
    {
        "job_title": "Solution Architect - Data & AI",
        "company": "Beinex Consulting Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21536/260",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Position Overview</h2>\n<p><strong>Position</strong>: Solution Architect (Data &amp; AI)\n<strong>Experience</strong>: 8+ Years\n<strong>Work Model</strong>: Work from Home in India (onsite travel to Abu Dhabi if needed)\n<strong>Notice Period</strong>: Immediate to 30 days\n<strong>Mode</strong>: Permanent</p>\n<h3>Responsibilities</h3>\n<ul>\n<li><strong>Solution Design &amp; Architecture</strong>: Design end-to-end data and AI architectures across ingestion, transformation, storage, analytics, and ML layers. Build scalable, cloud-native ecosystems using Azure, Snowflake, and open-source frameworks (Spark, Airflow, Kafka). Define architecture blueprints, data models, and governance-aligned integration patterns. Develop AI/ML platforms with MLOps, monitoring, and responsible AI principles.</li>\n<li><strong>Technical Leadership</strong>: Lead architecture discussions, design reviews, and guide data/ML teams through delivery. Drive modern data engineering practices (CI/CD, IaC, DevOps). Evaluate and recommend emerging technologies for enterprise solutions.</li>\n<li><strong>Client Consulting &amp; Engagement</strong>: Translate business needs into scalable data-driven solutions. Support pre-sales, RFPs, and executive-level presentations. Advise on data strategy, architecture roadmaps, and AI adoption frameworks.</li>\n<li><strong>Delivery &amp; Governance</strong>: Ensure architectural integrity, scalability, and compliance with data privacy standards. Define best practices, reusable assets, and mentoring frameworks for internal teams.</li>\n</ul>\n<h3>Key Skills Requirements</h3>\n<ul>\n<li>Proficient in end-to-end AI architecture (data prep to deployment) with MLOps, Spark, Kafka, Airflow, Hadoop, dbt, and Delta Lake.</li>\n<li>Expertise in LLMs, GenAI models, and AI agents using Azure OpenAI, LangChain, and Semantic Kernel.</li>\n<li>Experience with RAG pipelines, vector databases, and governance frameworks.</li>\n<li>Hands-on expertise in Azure Synapse, Data Factory, Databricks, Purview, and Machine Learning.</li>\n<li>Experience with Azure OpenAI, Cognitive Services, and Microsoft Fabric.</li>\n<li>Efficiency in data lakehouse design, Snowpark, Streamlit, optimization for large-scale analytics, automation using dbt, Airflow, and Terraform.</li>\n<li>Strong programming skills in Python, SQL, and Scala, and experience with API/microservice-based data integration.</li>\n<li>Expertise in CI/CD with Azure DevOps, GitHub Actions, Terraform, Docker, and Kubernetes.</li>\n<li>Proven client-facing and advisory consulting experience with strong analytical, communication, and stakeholder management skills.</li>\n<li>Bachelor’s/Master’s in Computer Science, Data Engineering, or related fields.</li>\n<li>Minimum 8 years of total experience, with at least 2 years in Data/AI solution architecture roles.</li>\n<li>Preferred certifications: Azure Solutions Architect Expert, Data Engineer Associate, SnowPro Core, Advanced Architect, and TOGAF (optional).</li>\n</ul>\n<h3>How to Apply</h3>\n<p>If interested, share your updated resume at <strong>abirami.s@beinex.com</strong> for further process.</p>",
        "tags": [
            "8+ Years",
            "Azure",
            "Snowflake",
            "Python"
        ],
        "summary": "Experienced Solution Architect (Data & AI) with 8+ years, leading cloud-native data/AI solutions using Azure, Snowflake, and Python. Requires strategic consulting, technical leadership, and enterprise solution design."
    },
    {
        "job_title": "Front-End Developer - UI/UX",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21542/182",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Front-End Developer - UI/UX</strong></p>\n<p>We are seeking a talented and creative Front-End Developer to join our team. In this role, you will be responsible for translating user requirements into engaging, intuitive user interfaces. You’ll work closely with both design and development teams to deliver seamless, user-focused digital experiences.</p>\n<p><strong>Responsibilities:</strong>\n- Collaborate closely with designers and developers to understand project scope and objectives.\n- Develop user interfaces for web applications and mobile-responsive platforms.\n- Implement responsive design principles to ensure accessibility across different screen sizes and devices.\n- Write clean, efficient, and maintainable code using HTML, CSS (SASS/Less), and JavaScript.\n- Conduct thorough testing to ensure high performance and reliability of interfaces.\n- Stay updated on industry trends and best practices in UI/UX design and front-end development.</p>\n<p><strong>Requirements:</strong>\n- Strong proficiency in HTML, CSS, JavaScript, and styling frameworks like Bootstrap or Tailwind CSS.\n- 2–4 years of hands-on experience in front-end development focused on UI/UX.\n- Strong understanding of key design principles and responsive design concepts.\n- Knowledgeable about web performance and optimization.\n- Understanding of web accessibility standards (WCAG) to design user interfaces.\n- Proven experience as a UI Developer or in a similar role.\n- Experience with UI/UX design principles and tools is a plus.\n- Excellent problem-solving skills and attention to detail.\n- Ability to work collaboratively in a team environment.</p>\n<p><strong>Added Advantage (Nice to Have):</strong>\n- Hands-on with WordPress or Shopify themes? That’s a plus.\n- Know your way around Vue, Nuxt, or anything in the Vue ecosystem? Even better.\n- Bonus points if you’ve worked with REST APIs, touched TypeScript, or used Material UI in your projects.</p>\n<p>If you're passionate about building clean, user-friendly interfaces and want to work in a team that values good design, attention to detail, and smart front-end development, we’d love to hear from you.</p>\n<p><strong>Contact:</strong>\nSend us your resume and portfolio at 👉 <a href=\"mailto:hr@2hatslogic.com\">hr@2hatslogic.com</a> with subject line \"Front End Developer\".</p>",
        "tags": [
            "2-4 Years",
            "HTML/CSS/JavaScript",
            "Bootstrap/Tailwind CSS",
            "Vue Ecosystem"
        ],
        "summary": "A Front-End Developer with 2-4 years of experience in UI/UX, skilled in HTML/CSS/JavaScript, Bootstrap/Tailwind, and Vue ecosystems to build responsive, user-centric interfaces."
    },
    {
        "job_title": "Senior Accountant",
        "company": "TutorComp Infotech (I) Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21552/44",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Senior Accountant</strong></p>\n<p>We are seeking an experienced and proactive <strong>Senior Accountant</strong> to oversee our company’s day-to-day financial operations, compliance, and government liaison activities. The ideal candidate should have strong accounting knowledge, multitasking ability, and readiness to travel for official duties.</p>\n<p><strong>Experience:</strong> 5+ Years</p>\n<p><strong>Key Responsibilities:</strong>\n- Maintain accurate Books of Accounts\n- Ensure compliance with government and statutory regulations\n- Manage cash flow, bank transactions, and reconciliations\n- Prepare monthly and yearly budgets, financial statements, and cost control reports\n- Handle client payment tracking and invoicing (B2B)\n- Verify employee and tutor salaries (Domestic &amp; Foreign)\n- Manage petty cash, vouchers, payment invoices, and office purchases\n- Handle Softex documentation and EDPMS (SEZ) filings\n- Liaise with government departments and regulatory bodies\n- Manage contracts, agreements, FIRC, CPA, MOU records\n- Ensure timely payments for subscriptions, salaries, and statutory dues\n- Coordinate with the CA team for audits, GST filing, TDS, and PT computation\n- Maintain and manage loan accounts, assets, and stationery inventory\n- Support management with custom financial reports as needed</p>\n<p><strong>Key Skills &amp; Requirements:</strong>\n- Solid knowledge of Financial &amp; Cost Accounting\n- Proficiency in Tally ERP / Zoho Books (added advantage)\n- Strong command of MS Office, especially Excel, Word, and PowerPoint\n- Excellent verbal and written communication skills\n- Ability to multitask, solve problems, and adapt to regulatory changes\n- Prior experience with statutory compliance, taxation, and internal audits\n- Must be comfortable with field visits to government offices</p>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@tutorcomp.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Tally ERP",
            "MS Office",
            "Statutory Compliance"
        ],
        "summary": "Senior Accountant oversees financial operations, compliance, and government liaison. Requires 5+ years, accounting software proficiency, and statutory expertise."
    },
    {
        "job_title": "Junior Business Analyst",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/21524/269",
        "location": "Infopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>Junior Business Analyst</h2>\n<h3>Responsibilities:</h3>\n<ul>\n<li><strong>Client Collaboration</strong>: Work with clients to define high-level requirements and capture business needs.</li>\n<li><strong>Product Demonstration</strong>: Demonstrate products to prospective customers.</li>\n<li><strong>Adaptability</strong>: Work independently and collaboratively in unstructured environments with self-direction.</li>\n<li><strong>Software Analysis</strong>: Explore, analyze, and utilize various software platforms from an end-user perspective.</li>\n<li><strong>Team Coordination</strong>: Coordinate with Development and Testing teams.</li>\n<li><strong>Task Management</strong>: Manage multiple tasks simultaneously to meet demanding deadlines.</li>\n<li><strong>Requirement Development</strong>: Develop functional and non-functional requirements.</li>\n<li><strong>Meetings</strong>: Attend management status meetings.</li>\n<li><strong>Sprint Ceremonies</strong>: Schedule and ensure all sprint ceremonies are conducted timely and effectively.</li>\n<li><strong>Documentation</strong>: Ensure FRS documents are ready and signed off before sprint start dates.</li>\n<li><strong>Quality Assurance</strong>: Review and approve test cases.</li>\n<li><strong>Client Availability</strong>: Maintain flexibility and availability for client calls to meet needs effectively.</li>\n</ul>\n<h3>Desired Skills:</h3>\n<ul>\n<li>Excellent <strong>critical thinking</strong> and <strong>problem-solving</strong> skills.</li>\n<li>Strong <strong>written</strong> and <strong>verbal communication</strong> skills.</li>\n<li>Detail-oriented with robust <strong>organizational</strong> skills.</li>\n<li>Proficiency in <strong>Microsoft Office tools</strong>.</li>\n</ul>\n<h3>Experience &amp; Qualifications:</h3>\n<ul>\n<li><strong>Freshers</strong> (2024/2025 passouts) with a <strong>B.Tech/MCA/MBA</strong> in Computer Science/IT or MBA (with a computer science background).</li>\n</ul>\n<h3>Contact:</h3>\n<p>For inquiries, email your resume to <strong>careers@feathersoft.com</strong>.</p>",
        "tags": [
            "Freshers (0 Years)",
            "Critical Thinking",
            "Communication Skills",
            "Microsoft Office Tools"
        ],
        "summary": "Junior Business Analyst role for freshers (2024/2025 passouts) requiring client collaboration, product demos, and team coordination with a focus on organizational and technical skills."
    },
    {
        "job_title": "Senior QA Automation & Manual Engineer",
        "company": "Focaloid Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21541/366",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Senior QA Automation &amp; Manual Engineer</h2>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain automation frameworks using <strong>Selenium</strong>, <strong>TestNG</strong>, or <strong>Cypress</strong></li>\n<li>Conduct end-to-end API testing using tools like <strong>Postman</strong>, <strong>RestAssured</strong>, or <strong>Swagger</strong></li>\n<li>Perform performance/load testing using tools such as <strong>JMeter</strong> or equivalent</li>\n<li>Ensure integration of test suites into CI/CD pipelines (<strong>Jenkins</strong>, <strong>GitHub Actions</strong>, etc.)</li>\n<li>Own and manage the defect lifecycle using tools like <strong>JIRA</strong> or <strong>Azure DevOps</strong></li>\n<li>Collaborate closely with developers, product managers, and other stakeholders to resolve issues and align expectations</li>\n<li>Mentor and coach junior QA engineers, ensuring adherence to QA best practices and standards</li>\n<li>Maintain clear documentation of test plans, cases, results, and QA metrics</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li><strong>5+ years</strong> of experience in QA, Automation &amp; Manual</li>\n<li>Strong knowledge of manual testing, functional, UI, and regression testing</li>\n<li>Proficiency in test automation with frameworks like <strong>Selenium</strong>, <strong>TestNG</strong>, or <strong>Cypress</strong></li>\n<li>Experience in REST API testing using <strong>Postman</strong>, <strong>Swagger</strong>, or scripting with <strong>RestAssured</strong></li>\n<li>Hands-on experience with <strong>JMeter</strong> or equivalent performance testing tools</li>\n<li>Familiar with CI/CD tools and version control systems (e.g., <strong>Git</strong>, <strong>Jenkins</strong>, <strong>GitHub Actions</strong>)</li>\n<li>Good understanding of <strong>SDLC</strong>, <strong>STLC</strong>, and defect life cycle</li>\n<li>Exposure to <strong>Agile/Scrum</strong> environments</li>\n<li>Excellent communication, reporting, and team collaboration skills</li>\n</ul>\n<h3>Preferred/Optional Skills:</h3>\n<ul>\n<li>Knowledge of <strong>Docker</strong>, <strong>Kubernetes</strong>, or cloud platforms (<strong>AWS</strong>, <strong>Azure</strong>)</li>\n<li>Experience with test case management tools like <strong>TestRail</strong> or <strong>Zephyr</strong></li>\n<li>Exposure to security testing or accessibility compliance</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>ajish.prabhakaran@focaloid.com</strong></p>",
        "tags": [
            "5+ Years",
            "Selenium",
            "TestNG",
            "JMeter"
        ],
        "summary": "Senior QA Automation & Manual Engineer required to design automation frameworks, conduct API testing, and collaborate with cross-functional teams. Must have 5+ years of QA experience with expertise in Selenium, TestNG, and JMeter."
    },
    {
        "job_title": "Project Manager",
        "company": "Focaloid Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21543/366",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Project Manager</h2>\n<h3>Responsibilities:</h3>\n<p>Project Managers are responsible for managing projects from the planning stage through execution, ensuring alignment with scope, budget, and resource requirements. Key responsibilities include:</p>\n<ul>\n<li><strong>People Management</strong>: Conduct regular one-on-one meetings, create development plans, and hold team members accountable for their roles.</li>\n<li><strong>Project &amp; Technology Leadership</strong>: Analyze customer requests, translate requirements into documentation (e.g., functional specifications, use cases, data models), and ensure development processes are followed.</li>\n<li><strong>Teamwork &amp; Collaboration</strong>: Own task delivery, share resources/knowledge across teams, maintain up-to-date time logs, and communicate project status to the Delivery Software Team.</li>\n<li><strong>Quality &amp; Continuous Improvement</strong>: Ensure code passes QA, conduct code reviews, and identify/remove obstacles to project efficiency.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li><strong>Experience</strong>: 10+ years total, with 3+ years in a Project Manager role.</li>\n<li><strong>Skills</strong>: Demonstrated expertise in project management processes, tools, and artifacts; people management; strategic planning; risk/change management.</li>\n<li><strong>Technical Knowledge</strong>: Software development lifecycle, business process mapping, quality management techniques.</li>\n<li><strong>Soft Skills</strong>: Strong communication, cross-functional collaboration, problem-solving, and time management.</li>\n</ul>\n<h3>Contact:</h3>\n<p>For inquiries, email: <strong>ajish.prabhakaran@focaloid.com</strong></p>",
        "tags": [
            "10+ Years",
            "Project Management",
            "People Management",
            "Software Development Lifecycle"
        ],
        "summary": "Lead projects from planning to delivery, managing teams, translating requirements, and ensuring quality. Requires 10+ years of experience with 3+ years in project management."
    },
    {
        "job_title": "iOS Lead Developer",
        "company": "Appadore Private Limited",
        "url": "https://infopark.in/company-jobs/details/21534/253",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<p><strong>iOS Lead Developer</strong></p>\n<p>We are seeking an experienced iOS Lead to drive the design, development, and delivery of high-quality iOS applications. You will lead the iOS team, own technical decisions, and build scalable, high-performance apps for the latest Apple devices.</p>\n<p><strong>Responsibilities</strong>\n- Lead architecture, design, and development of iOS applications\n- Mentor and guide iOS developers; conduct code reviews\n- Collaborate with product, design, and backend teams to deliver features\n- Ensure code quality, performance, scalability, and security\n- Plan work, provide estimates, and ensure timely delivery\n- Handle App Store submissions, releases, and maintenance\n- Identify and resolve performance bottlenecks and technical risks</p>\n<p><strong>Requirements</strong>\n- <strong>7+ years</strong> of iOS development experience with enterprise-grade applications\n- <strong>2+ years</strong> in a lead or senior iOS role\n- Strong expertise in <strong>Swift</strong>, <strong>SwiftUI</strong>, <strong>UIKit</strong>, and <strong>Cocoa Touch</strong>\n- Experience publishing apps on the <strong>App Store</strong>\n- Solid understanding of OOP, protocols, delegates, and memory management\n- Experience with REST APIs, sockets, JSON parsing, and chat/real-time apps\n- Ability to build UI programmatically and follow best iOS practices</p>\n<p><strong>Contact</strong>\nSend your resume to <strong>careers@appadore.com</strong> with the subject line <strong>“iOS Lead Developer Role”</strong>.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@appadore.com</strong>.</p>",
        "tags": [
            "7+ Years",
            "Swift",
            "SwiftUI",
            "UIKit"
        ],
        "summary": "Lead iOS development, mentor team, and deliver high-quality apps with collaboration across product, design, and backend teams."
    },
    {
        "job_title": "Android Lead Developer",
        "company": "Appadore Private Limited",
        "url": "https://infopark.in/company-jobs/details/21535/253",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<p><strong>Android Lead Developer</strong></p>\n<p>We are seeking an experienced Android Lead to design, architect, and deliver high-quality Android applications. You will lead the Android development team, own technical decisions, and build scalable, secure, and high-performance apps for modern Android devices.</p>\n<p><strong>Responsibilities</strong>\n- Lead architecture, design, and development of Android applications\n- Provide technical leadership, mentorship, and code reviews for the Android team\n- Collaborate with product, design, backend, and QA teams to deliver features\n- Ensure application performance, scalability, security, and code quality\n- Plan development activities, provide accurate estimates, and ensure timely delivery\n- Identify and resolve technical issues, bottlenecks, and risks\n- Manage Play Store releases, updates, and compliance\n- Continuously improve codebase, architecture, and development processes</p>\n<p><strong>Requirements</strong>\n- 7+ years of Android development experience building enterprise-grade applications\n- 2+ years of experience in a Lead or Senior Android role\n- Strong expertise in Kotlin, Java, Android SDK, and Jetpack components\n- Experience with MVVM/MVP architecture and modern Android development practices\n- Proven experience publishing and maintaining apps on the Google Play Store\n- Strong understanding of OOP, design patterns, memory management, and multithreading\n- Experience with REST APIs, sockets, JSON parsing, and real-time/chat applications\n- Ability to build complex UI and ensure responsiveness across devices\n- Strong communication, problem-solving, and team collaboration skills</p>\n<p><strong>Contact</strong>\n📩 Send your resume to: <a href=\"mailto:careers@appadore.com\">careers@appadore.com</a>\n📌 Subject line: <strong>Android Lead Developer</strong></p>",
        "tags": [
            "7+ Years",
            "Kotlin",
            "Android SDK",
            "MVVM/MVP"
        ],
        "summary": "Lead Android development team to design and deliver high-quality apps. Requires 7+ years experience with Kotlin, Android SDK, and MVVM/MVP architecture."
    },
    {
        "job_title": "Sales Specialist",
        "company": "TouchWorld Technology",
        "url": "https://infopark.in/company-jobs/details/21539/352",
        "location": "Infopark",
        "closing_date": "15 Jul 2026",
        "job_description": "<p><strong>Sales Specialist</strong></p>\n<p>We are seeking a <strong>Software Sales Specialist (International Sales)</strong> with a minimum of <strong>1 year of experience</strong> in software product selling.</p>\n<p><strong>Responsibilities:</strong>\n- Identify potential clients and promote software products\n- Build and maintain customer relationships\n- Close sales deals\n- Achieve sales targets independently</p>\n<p><strong>Qualifications:</strong>\n- Minimum 1 year of experience in software product selling\n- Strong communication and negotiation skills\n- Self-motivated and result-oriented\n- Ability to work independently\n- Customer-focused mindset</p>\n<p><strong>Experience:</strong> Minimum 1 year in software product selling\n<strong>Salary:</strong> Commission-based</p>\n<p><strong>Immediate Joiner Required</strong>\n<strong>Location:</strong> INFOPARK, KOCHI</p>\n<p><strong>Apply:</strong> Send your resume to <a href=\"mailto:hrteam@touchworldtechnology.com\">hrteam@touchworldtechnology.com</a></p>",
        "tags": [
            "1+ Year",
            "Software Product Selling",
            "Communication & Negotiation Skills",
            "Client Relationship Management"
        ],
        "summary": "International software sales role requiring 1+ year experience, focusing on client acquisition, relationship building, and commission-based sales targets."
    },
    {
        "job_title": "Senior Database Administrator",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26657",
        "location": "Technopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Job Title:</strong> Senior Database Administrator\n<strong>Closing Date:</strong> 16, Jan 2026\n<strong>Published Date:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a <strong>7+ years experienced</strong> candidate for this role.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Optimize database queries for fast and efficient data retrieval, especially for complex or high-volume operations.</li>\n<li>Design and implement indexing strategies to reduce query execution times and improve performance.</li>\n<li>Monitor slow queries and recommend best practices for rewriting or re-architecting them.</li>\n<li>Analyze SQL query execution plans to identify bottlenecks and optimize performance.</li>\n<li>Schedule and execute database maintenance tasks (backups, consistency checks, index rebuilding).</li>\n<li>Implement automated monitoring systems to track performance, availability, and critical parameters (CPU, memory, disk I/O, replication status).</li>\n<li>Proactively diagnose and resolve database issues (locking, deadlocks, data corruption).</li>\n<li>Implement high availability solutions (e.g., SQL Server Always On, Oracle RAC, MySQL Group Replication).</li>\n<li>Plan for database scalability and resource optimization (CPU, memory, disk, network).</li>\n<li>Manage database licensing and identify cost-reduction opportunities.</li>\n<li>Monitor and optimize cloud database costs using tools like AWS Cost Explorer and Azure Cost Management.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li><strong>7+ years</strong> of Microsoft SQL Server administration experience.</li>\n<li><strong>Behavioral Competencies:</strong> Communication, Teamwork, Digital Mindset, Operational Excellence, Analytical Ability, Customer Centricity, Business &amp; Market Acumen, Empathy, Growth Mindset.</li>\n</ul>\n<h3><strong>Certifications</strong></h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Software Engineering, or related field.</li>\n<li>Microsoft SQL certifications (MTA Database, MCSA: SQL Server, MCSE: Data Management and Analytics) are advantageous.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates should email their resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are via official website, LinkedIn, or the HR email ID. For clarifications, contact <a href=\"mailto:careers@reflectionsinfos.com\">careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "7+ Years",
            "Microsoft SQL Server",
            "High Availability Tools",
            "Cloud Cost Management"
        ],
        "summary": "Senior Database Administrator with 7+ years of experience in Microsoft SQL Server, focusing on performance optimization, high availability solutions, and cloud cost management."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26656",
        "location": "Technopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<h2><strong>Job Posting: Delivery Manager</strong></h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date:</strong> 16, Jan 2026\n<strong>Published Date:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a <strong>14+ years</strong> seasoned Technical Delivery Manager to oversee the successful delivery of complex technical projects and solutions. The ideal candidate will have a strong technology background, exceptional project management skills, and the ability to collaborate with cross-functional teams. This role requires end-to-end ownership of project delivery, ensuring alignment with business goals, managing stakeholder expectations, and driving technical excellence.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li><strong>Project Delivery Management:</strong></li>\n<li>Oversee planning, execution, and delivery of multiple technical projects.</li>\n<li>Manage scope, timelines, budgets, risks, and quality.</li>\n<li>\n<p>Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n</li>\n<li>\n<p><strong>Team Leadership:</strong></p>\n</li>\n<li>Lead and mentor cross-functional technical teams, fostering collaboration and innovation.</li>\n<li>\n<p>Conduct performance reviews and provide growth opportunities.</p>\n</li>\n<li>\n<p><strong>Stakeholder Engagement:</strong></p>\n</li>\n<li>Bridge technical teams, business stakeholders, and clients.</li>\n<li>\n<p>Communicate project status, risks, and solutions effectively.</p>\n</li>\n<li>\n<p><strong>Technical Expertise:</strong></p>\n</li>\n<li>Collaborate with architects and engineers on technical solutions.</li>\n<li>\n<p>Provide input on architecture, design, and implementation strategies.</p>\n</li>\n<li>\n<p><strong>Process Improvement:</strong></p>\n</li>\n<li>Identify opportunities to improve delivery processes and tools.</li>\n<li>\n<p>Implement best practices in software development.</p>\n</li>\n<li>\n<p><strong>Risk and Issue Management:</strong></p>\n</li>\n<li>Proactively identify risks and develop mitigation strategies.</li>\n<li>\n<p>Resolve technical and operational challenges promptly.</p>\n</li>\n<li>\n<p><strong>Customer Focus:</strong></p>\n</li>\n<li>Ensure customer satisfaction through high-quality solutions aligned with business needs.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li><strong>Experience:</strong></li>\n<li>14+ years in technology delivery roles with hands-on development and leadership.</li>\n<li>Proven success in large-scale, complex projects with diverse teams.</li>\n<li>Manage P&amp;L for accounts, ensuring revenue growth and profitability.</li>\n<li>Plan team ramp-ups/downs using pyramid planning, external hiring, and internal sourcing.</li>\n<li>Drive account management activities (financial tracking, invoice collection, margin improvements).</li>\n<li>\n<p>Build client relationships via QBRs, on-site visits, and account mining.</p>\n</li>\n<li>\n<p><strong>Technical Expertise:</strong></p>\n</li>\n<li>Modern software development practices, cloud technologies (AWS, Azure, GCP), and DevOps.</li>\n<li>\n<p>Proficiency in Java, Python, or .NET preferred.</p>\n</li>\n<li>\n<p><strong>Project Management:</strong></p>\n</li>\n<li>Expertise in Agile, Scrum, Kanban, and traditional methodologies.</li>\n<li>\n<p>PMP/CSM certification advantageous.</p>\n</li>\n<li>\n<p><strong>Leadership and Communication:</strong></p>\n</li>\n<li>\n<p>Strong team leadership, conflict resolution, and communication skills.</p>\n</li>\n<li>\n<p><strong>Education:</strong></p>\n</li>\n<li>Bachelor’s in Computer Science/Engineering (Master’s a plus).</li>\n</ul>\n<h3><strong>Secondary Skills</strong></h3>\n<ul>\n<li>Managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices.</li>\n<li>Business acumen to align technical goals with strategy.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates should email resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current/expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge fees for job applications. All communications are via official website, LinkedIn, or the HR email. Report any suspicious activity to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "14+ Years",
            "AWS",
            "Agile",
            "Java"
        ],
        "summary": "Seeking a seasoned Delivery Manager with 14+ years of experience to lead complex technical projects, manage cross-functional teams, and ensure client satisfaction through strategic planning and technical excellence."
    },
    {
        "job_title": "Solution Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26655",
        "location": "Technopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<h2><strong>Job Description: Solution Architect at Reflections Info Systems (P) Ltd</strong></h2>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Company Website:</strong> <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date:</strong> 16, Jan 2026\n<strong>Job Published:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Role Overview</strong></h3>\n<p>We are seeking a <strong>Solution Architect</strong> to design and deliver scalable, secure, and high-performing technology solutions for clients. This role blends hands-on technical expertise with strategic architectural thinking, requiring collaboration with senior architects, delivery teams, and stakeholders to translate business needs into robust technical designs.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<h4><strong>Architecture &amp; Design</strong></h4>\n<ul>\n<li>Create solution architectures, high-level designs, and technical diagrams.</li>\n<li>Develop and evolve technical strategies for assigned projects.</li>\n<li>Evaluate emerging technologies, tools, and frameworks for client solutions.</li>\n<li>Support proof-of-concepts, prototypes, and feasibility assessments.</li>\n</ul>\n<h4><strong>Collaboration &amp; Delivery</strong></h4>\n<ul>\n<li>Ensure development teams adhere to architectural standards and design principles.</li>\n<li>Participate in code reviews, technical design sessions, and agile ceremonies.</li>\n<li>Collaborate with multidisciplinary teams (policy, product, engineering, QA) to deliver user-centric designs.</li>\n<li>Define and implement open-source, cloud-first solutions at scale.</li>\n</ul>\n<h4><strong>Governance &amp; Stakeholder Engagement</strong></h4>\n<ul>\n<li>Clarify requirements and support technology decisions with technical and non-technical stakeholders.</li>\n<li>Communicate architectural vision and solution rationale across teams.</li>\n<li>Identify underlying problems and contribute to digital transformation initiatives.</li>\n<li>Define architecture standards, guidelines, and best practices.</li>\n<li>Engage in communities of practice to promote technical excellence.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<h4><strong>Technical Skills</strong></h4>\n<ul>\n<li>Strong grasp of software development principles and system design.</li>\n<li>Hands-on experience with programming languages (Java, Python, C#, etc.).</li>\n<li>Practical knowledge of full-stack development (frontend, backend, cloud, infrastructure, networking).</li>\n<li>Experience with cloud-first architectures (AWS, Azure, GCP) and cloud-native solutions.</li>\n<li>Knowledge of databases, integration patterns, APIs, and microservices.</li>\n<li>Familiarity with open-source technologies and modern development practices.</li>\n</ul>\n<h4><strong>Professional Skills</strong></h4>\n<ul>\n<li>Agile delivery experience with technical teams.</li>\n<li>Collaborative stakeholder engagement to align on technical decisions.</li>\n<li>Strong analytical and problem-solving skills with a focus on architectural implications.</li>\n<li>Excellent communication to simplify complex technical concepts for diverse audiences.</li>\n</ul>\n<h3><strong>Educational Requirements</strong></h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Software Engineering, or a related technical field.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates should email their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details. <strong>Important:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are conducted via official email or LinkedIn. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Cloud Architecture",
            "Java",
            "Open-Source Technologies"
        ],
        "summary": "A Solution Architect role requiring 5+ years of experience in designing scalable, cloud-first solutions with expertise in Java and open-source technologies."
    },
    {
        "job_title": "Cloud Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26654",
        "location": "Technopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<h2><strong>Job Title</strong>: Cloud Infrastructure Architect</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Closing Date</strong>: 16, Jan 2026\n<strong>Published Date</strong>: 09, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking an experienced <strong>Cloud and Infrastructure Architect</strong> to lead enterprise-wide infrastructure strategy and implementation across public cloud platforms and on-premise data center technologies. This role requires an expert who can drive cloud adoption strategies, hybrid infrastructure design, seamless migration execution, and infrastructure security governance while aligning technical solutions with broader business and IT goals.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Lead the development and execution of enterprise infrastructure strategies for public cloud, private cloud, and on-premise data centers.</li>\n<li>Drive cloud adoption and migration programs, including assessments, migration planning, execution governance, and post-migration optimization.</li>\n<li>Architect robust solutions across compute, storage, networking, virtualization, and enterprise security best standards.</li>\n<li>Provide thought leadership and decision-making guidance on public cloud services, data center technologies, and emerging infrastructure trends.</li>\n<li>Design and enforce strong infrastructure security practices, governance frameworks, and compliance adherence (e.g., GDPR, PCI DSS, HIPAA).</li>\n<li>Collaborate with enterprise architecture, security, DevOps, application, and network teams to ensure cohesive infrastructure delivery.</li>\n<li>Drive continuous improvement initiatives aimed at infrastructure scalability, automation, performance, and cost optimization.</li>\n<li>Support pre-sales activities, including RFP/RFI responses, solution design, cost estimations, and client workshops.</li>\n<li>Evaluate and manage partnerships with cloud providers, OEMs, and technology vendors to validate solution feasibility, strengthen service capabilities, and drive aligned GTM.</li>\n<li>Develop and maintain technical documentation, accelerators, frameworks, and solution blueprints.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li><strong>15+ years</strong> of professional experience in IT infrastructure design, implementation, and operations, including <strong>5+ years</strong> focused on cloud and data center architecture.</li>\n<li>Proven track record in enterprise cloud migration projects, hybrid cloud strategy execution, and digital transformation initiatives.</li>\n<li>Strong expertise in public cloud platforms (AWS, Azure, GCP), designing solutions using native services for compute, storage, networking, identity, security, and automation.</li>\n<li>Strong background in data center technologies, including virtualization (VMware, Hyper-V), storage systems, network architecture, and infrastructure security.</li>\n<li>Solid knowledge of containerization and orchestration (Docker, Kubernetes/OpenShift) supporting infrastructure modernization.</li>\n<li>Strong understanding of IaC and automation tools such as Terraform, Ansible, CloudFormation, ARM Templates.</li>\n<li>Demonstrated expertise in security architecture and compliance, including identity management, network segmentation, and data protection.</li>\n<li>Strong consulting and client engagement capabilities, assessments, solution presentations, and executive discussions.</li>\n<li>Experience with enterprise monitoring, logging, and observability tools (Splunk, Prometheus, Grafana, New Relic).</li>\n<li>Strong analytical skills with experience in cost assessment, TCO analysis, and infrastructure optimization for cloud and data centers.</li>\n<li>Good experience in pre-sales, solution design, RFP responses, and deal support.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates may forward their detailed resumes to <strong><a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></strong> along with their notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Please note that <strong>no payment is ever sought for jobs in Reflections</strong>. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. For clarifications or alerts regarding fraudulent activities, contact <strong><a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></strong>.</p>",
        "tags": [
            "15+ Years",
            "Cloud Architecture",
            "Infrastructure Security",
            "Automation Tools"
        ],
        "summary": "A Cloud Infrastructure Architect is needed to lead enterprise cloud strategies, hybrid infrastructure design, and security governance. Requires 15+ years of IT infrastructure and cloud expertise with a focus on public cloud platforms and security compliance."
    },
    {
        "job_title": "Senior DotNet Developer + Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26653",
        "location": "Technopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<h2><strong>Company Information</strong></h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2><strong>Job Title</strong></h2>\n<p>Senior DotNet Developer + Azure</p>\n<h2><strong>Key Dates</strong></h2>\n<ul>\n<li><strong>Closing Date</strong>: 16, Jan 2026</li>\n<li><strong>Published On</strong>: 09, Jan 2026</li>\n</ul>\n<h2><strong>Contact</strong></h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></li>\n</ul>\n<h2><strong>Working Hours</strong></h2>\n<p>12:00 PM - 9:00 PM</p>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Design, develop, enhance, document, and maintain robust applications using <strong>.NET Core 6/8+</strong>, <strong>C#</strong>, <strong>REST APIs</strong>, <strong>T-SQL</strong>, and modern <strong>JavaScript/jQuery</strong></li>\n<li>Integrate and support third-party APIs and external services</li>\n<li>Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack</li>\n<li>Identify, prioritize, and execute tasks throughout the <strong>Software Development Life Cycle (SDLC)</strong></li>\n<li>Participate in <strong>Agile/Scrum</strong> ceremonies and manage tasks using <strong>Jira</strong></li>\n<li>Understand technical priorities, architectural dependencies, risks, and implementation challenges</li>\n<li>Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability</li>\n</ul>\n<h2><strong>Preferred Skills</strong></h2>\n<ul>\n<li><strong>8+ years</strong> of hands-on development experience with:</li>\n<li><strong>C#</strong>, <strong>.NET Core 6/8+</strong>, <strong>Entity Framework / EF Core</strong></li>\n<li><strong>JavaScript</strong>, <strong>jQuery</strong>, <strong>REST APIs</strong></li>\n<li><strong>MS SQL Server</strong> expertise (complex SQL queries, stored procedures, views, functions, etc.)</li>\n<li>Unit testing with <strong>XUnit</strong>, <strong>MSTest</strong></li>\n<li>Software design patterns, system architecture, and scalable solution design</li>\n<li>Leadership through clear communication, technical mentorship, and ownership</li>\n<li>Problem-solving and debugging capabilities</li>\n<li>Writing reusable, testable, and efficient code</li>\n<li>Framework and shared library development for large-scale applications</li>\n<li><strong>Microservices</strong> and <strong>Service-Oriented Architecture (SOA)</strong></li>\n<li><strong>API Integrations</strong></li>\n</ul>\n<h2><strong>Azure Cloud Experience (2+ years)</strong></h2>\n<ul>\n<li><strong>Azure Functions</strong>, <strong>Durable Functions</strong>, <strong>Service Bus</strong>, <strong>Event Grid</strong>, <strong>Storage Queues</strong></li>\n<li><strong>Blob Storage</strong>, <strong>Azure Key Vault</strong>, <strong>SQL Azure</strong></li>\n<li><strong>Application Insights</strong>, <strong>Azure Monitoring</strong></li>\n</ul>\n<h2><strong>Secondary Skills</strong></h2>\n<ul>\n<li>Familiarity with <strong>AngularJS</strong>, <strong>ReactJS</strong>, and other front-end frameworks</li>\n<li><strong>Azure API Management (APIM)</strong></li>\n<li><strong>Azure Containerization</strong> and orchestration (e.g., <strong>AKS/Kubernetes</strong>)</li>\n<li><strong>Azure Data Factory (ADF)</strong> and <strong>Logic Apps</strong></li>\n<li>Exposure to application support and operational monitoring</li>\n<li><strong>Azure DevOps</strong> - CI/CD pipelines (Classic / YAML)</li>\n</ul>\n<h2><strong>Application Instructions</strong></h2>\n<p>Interested candidates should forward detailed resumes to <strong><a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></strong> along with notice period, current, and expected CTC details.</p>\n<h2><strong>Important Notice</strong></h2>\n<p>Reflections Info Systems does <strong>not</strong> charge any fees for job applications. Fraudsters may impersonate the company. All official communications are sent via the official HR email or LinkedIn. For clarifications, contact <strong><a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></strong>.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "C#",
            "Azure Cloud Services"
        ],
        "summary": "Senior DotNet Developer with Azure expertise, requiring 8+ years of experience in .NET Core, C#, and cloud solutions. Focus on scalable applications, team leadership, and Azure services integration."
    },
    {
        "job_title": "WordPress Developer",
        "company": "Awdar Software Solutions Llp",
        "url": "https://technopark.org/job-details/26652",
        "location": "Technopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>AWDAR SOFTWARE SOLUTIONS LLP</h2>\n<p><strong>Module No 2301, 3rd Floor, Yamuna Building, Technopark Phase 3, Trivandrum, 695583</strong>\n<a href=\"https://ainexit.com\">Visit Website</a></p>\n<h3>Job Title: WordPress Developer</h3>\n<p><strong>Closing Date:</strong> 15, Jan 2026\n<strong>Published Date:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@awdar-solutions.com\">hr@awdar-solutions.com</a></p>\n<h3>Brief Description</h3>\n<ul>\n<li><strong>Experience Required:</strong> Minimum 2 Years</li>\n<li><strong>Joining:</strong> Immediate (within 2 weeks)</li>\n</ul>\n<h3>Job Summary</h3>\n<p>We are seeking a skilled WordPress Developer with <strong>2+ years of experience</strong> and strong hands-on knowledge of <strong>Amelia</strong>, <strong>Tutor LMS</strong>, and <strong>WooCommerce</strong> plugins. The ideal candidate will be responsible for building, customizing, and maintaining feature-rich WordPress websites for booking systems, e-learning platforms, and eCommerce solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and maintain WordPress websites using Amelia, Tutor LMS, and WooCommerce</li>\n<li>Customize themes and plugins as per business requirements</li>\n<li>Configure booking systems, online courses, and payment gateways</li>\n<li>Optimize website performance, security, and scalability</li>\n<li>Troubleshoot plugin conflicts and technical issues</li>\n<li>Integrate third-party APIs and tools</li>\n<li>Collaborate with UI/UX designers and content teams</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Minimum 2 years of experience as a WordPress Developer is mandatory</li>\n<li>Strong expertise in WordPress, PHP, HTML, CSS, JavaScript</li>\n<li>Hands-on experience with <strong>Amelia (Booking Plugin)</strong></li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with Elementor / Gutenberg / WPBakery</li>\n<li>Familiarity with MySQL and database optimization</li>\n<li>Experience with <strong>Tutor LMS (Learning Management System)</strong></li>\n<li>Experience with custom post types, hooks, and shortcodes</li>\n<li>Experience with membership &amp; subscription plugins</li>\n<li>Strong knowledge of <strong>WooCommerce (eCommerce &amp; Payments)</strong></li>\n<li>Knowledge of SEO &amp; performance optimization</li>\n<li>Knowledge of Git/version control</li>\n<li>Familiarity with payment gateways (Stripe, PayPal, Razorpay, etc.)</li>\n</ul>\n<h3>Apply</h3>\n<p>Interested in joining our team? Send your updated resumes to <a href=\"mailto:hr@awdar-solutions.com\">hr@awdar-solutions.com</a></p>",
        "tags": [
            "2+ Years",
            "Amelia",
            "Tutor LMS",
            "WooCommerce"
        ],
        "summary": "A WordPress Developer with 2+ years of experience is needed to build booking systems, e-learning platforms, and eCommerce sites using Amelia, Tutor LMS, and WooCommerce plugins."
    },
    {
        "job_title": "Python Developer_ Fresher",
        "company": "Movytech Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/26651",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Job Posting: Python Developer</h2>\n<p><strong>Company:</strong> Movytech Innovations (P) Ltd\n<strong>Location:</strong> Fourth Floor, CDAC Building, Technpark Phase 1, Thiruvananthapuram, 695581\n<strong>Application Deadline:</strong> 31, Jan 2026\n<strong>Published Date:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> hr@movytech.co</p>\n<h3>Brief Description</h3>\n<p>Interested candidates should apply via the mandatory link below:\n<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfsX8oVYbPhTaFl6D70BlwvH0tEqCBCtDGBQ8fDy47s0pkVLg/viewform?usp=header\">Application Form</a></p>\n<p>We are seeking a talented Python Developer to join our dynamic team. As a Python Developer, you will be responsible for:</p>\n<ul>\n<li>Designing and implementing server-side web application logic using Python and relevant frameworks.</li>\n<li>Developing, testing, and maintaining robust and scalable software solutions.</li>\n<li>Collaborating with cross-functional teams (front-end developers, designers, product managers) to deliver high-quality software.</li>\n<li>Integrating user-facing elements with server-side logic.</li>\n<li>Optimizing performance and troubleshooting issues across the entire stack (database to front-end).</li>\n<li>Developing and implementing data storage solutions.</li>\n<li>Staying updated with industry best practices and technologies.</li>\n<li>Writing effective, scalable, and well-documented code.</li>\n<li>Participating in code reviews to maintain code quality.</li>\n<li>Collaborating with stakeholders to understand requirements and provide technical solutions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with cloud platforms (AWS, Azure).</li>\n<li>Experience with DynamoDB and PGSQL.</li>\n<li>Knowledge of containerization and orchestration tools (Docker, Kubernetes).</li>\n<li>Familiarity with DevOps practices and CI/CD pipelines.</li>\n<li>Experience with agile development methodologies.</li>\n<li>Minimum 2 years of experience in Python.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Python",
            "AWS",
            "Docker"
        ],
        "summary": "Movytech Innovations seeks a Python Developer with 2+ years experience to design server-side logic, collaborate with teams, and utilize cloud platforms for scalable solutions."
    },
    {
        "job_title": "Software Sales Executive (SDR / Telecalling)",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/26650",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</strong></p>\n<p><strong>Address:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"https://www.ateamsoftsolutions.com\">https://www.ateamsoftsolutions.com</a></p>\n<p><strong>Job Title:</strong> Software Sales Executive (SDR / Telecalling)\n<strong>Closing Date:</strong> 09, Feb 2026\n<strong>Published Date:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> recruitment@ateamsoftsolutions.com</p>\n<h3>Brief Description</h3>\n<p>We are hiring a <strong>Software Sales Executive</strong> to support outbound sales efforts for the <strong>Middle East market</strong>. This role is strictly focused on <strong>telecalling and appointment setting</strong>. There is <strong>no closing or negotiation</strong> involved.</p>\n<h3>Work Mode</h3>\n<p><strong>Hybrid or Work From Home</strong></p>\n<h3>Experience Required</h3>\n<ul>\n<li><strong>Minimum 2 years</strong> in outbound sales or telecalling for an IT services or product-based company</li>\n</ul>\n<h3>Role Overview</h3>\n<ul>\n<li>Speak directly with decision-makers, qualify interest, and book meetings for the senior sales team</li>\n<li>This is a <strong>pure Sales Development (SDR)</strong> role</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Outbound telecalling to decision-makers in Middle East companies</li>\n<li>Clear introduction of our software services or products</li>\n<li>Qualify leads based on interest and basic requirements</li>\n<li>Schedule meetings for the core sales team</li>\n<li>Maintain accurate call notes and lead status</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong English communication skills</li>\n<li>Clear neutral accent with minimum 8/10 clarity</li>\n<li>Confidence in speaking with senior stakeholders</li>\n<li>Experience in outbound calling or inside sales</li>\n<li>Comfortable working with call targets and follow-ups</li>\n<li>Ability to work aligned with Middle East business hours</li>\n</ul>\n<h3>Important Notes</h3>\n<ul>\n<li>This is <strong>not a US shift</strong></li>\n<li><strong>No negotiation or deal-closing</strong> responsibilities</li>\n<li>Performance is measured by <strong>quality appointments booked</strong></li>\n</ul>",
        "tags": [
            "2+ Years",
            "Outbound Sales",
            "SDR",
            "Telecalling"
        ],
        "summary": "Seeking a Software Sales Executive to handle outbound telecalling and appointment setting for the Middle East market. Requires 2+ years in outbound sales with strong communication skills."
    },
    {
        "job_title": "Senior Product Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26649",
        "location": "Technopark",
        "closing_date": "12 Feb 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title</strong>: Senior Product Designer\n<strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time</p>\n<h3>Role Overview</h3>\n<p>We’re hiring a <strong>Senior Product Designer</strong> to independently own complex product areas and ship high-quality experiences. Over the past year, Way.com shipped multiple new products and verticals where senior designers played a key role in turning ambiguity into shipped outcomes. This role exists due to expanding product scope. You’ll own end-to-end design for key flows and modules, work closely with PMs and Engineers, and partner with design leadership to raise quality and consistency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Work on live, revenue-impacting products across consumer and SaaS, where UX decisions affect adoption and retention</li>\n<li>Drive design from discovery to delivery for assigned areas</li>\n<li>Translate requirements into clear flows and UI</li>\n<li>Collaborate cross-functionally</li>\n<li>Contribute to critiques and standards</li>\n<li>Maintain the design system</li>\n<li>Proactively improve UX quality</li>\n<li>Operate as a high-ownership contributor with growing strategic influence</li>\n</ul>\n<p><strong>This role is not pixel-pushing, passive support, or throw-it-over-the-wall design.</strong></p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>3–5 years of experience</li>\n<li>Strong portfolio</li>\n<li>Ability to independently ship work end-to-end</li>\n<li>Comfortable with ambiguity</li>\n<li>Experience in research and iteration</li>\n<li>Strong with modern design tools</li>\n<li>Ability to communicate decisions clearly</li>\n<li>Move fast and take ownership</li>\n</ul>\n<h3>Why This Role Matters</h3>\n<ul>\n<li>Way.com is scaling fast</li>\n<li>Designers work on products with direct revenue impact</li>\n<li>Strong ownership and visibility</li>\n<li>Clear path toward Lead responsibility</li>\n<li>Opportunity to deepen impact, sharpen ownership, and grow through real work</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong></li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong></li>\n<li>Dynamic, fast-paced, and innovation-driven work culture</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Contact Email</strong>: careers@way.com\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/senior-product-designer\">Senior Product Designer Application</a></p>",
        "tags": [
            "3–5 Years",
            "Product Design",
            "UX/UI Design",
            "Design Systems"
        ],
        "summary": "Senior Product Designer at Way.com to lead end-to-end design for high-impact automotive products, driving innovation and user-centric solutions in a fast-growing tech environment."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26648",
        "location": "Technopark",
        "closing_date": "01 Feb 2026",
        "job_description": "<h2>About SRS</h2>\n<p>SRS Web Solutions is a leading healthcare SaaS technology company specializing in digital healthcare documentation for the medical, dental, and veterinary industries. We have served over 3,000+ clients and 5 million patients worldwide, modernizing practices by improving productivity, efficiencies, and the bottom line. Our senior software developers have a collective 100,000 hours in customized healthcare and security programming. SRS is an Inc 5000 company ranked as a fastest-growing company in the USA.</p>\n<h2>Job Details</h2>\n<ul>\n<li><strong>Closing Date</strong>: 01, Feb 2026</li>\n<li><strong>Job Published</strong>: 09, Jan 2026</li>\n<li><strong>Contact Email</strong>: ananthu.m@srswebsolutions.in</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Develop secure and scalable full-stack applications using React JS, Node JS, and Laravel.</li>\n<li>Build adaptive and responsive front-end interfaces using React, HTML5, CSS, Bootstrap 5, JavaScript, TypeScript, and Webpack.</li>\n<li>Design and implement middleware, REST APIs, and microservices using Node JS, Express JS, and Laravel.</li>\n<li>Design and manage databases; write SQL queries, stored procedures, views, and functions.</li>\n<li>Work with relational databases like PostgreSQL, SQLite, and Redis.</li>\n<li>Use Docker for containerization and deployment.</li>\n<li>Apply software design principles and patterns to ensure clean and maintainable code.</li>\n<li>Collaborate with teams, troubleshoot issues, and optimize application performance.</li>\n</ul>\n<h2>Qualifications &amp; Experience</h2>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field (Master’s degree is a plus).</li>\n<li><strong>3–5 years</strong> of hands-on experience in developing full-stack applications using React JS, Node JS, and preferably Laravel.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Strong hands-on expertise in React JS and Node JS</li>\n<li>Proficiency in JavaScript, TypeScript, HTML5, CSS, Bootstrap 5, and Webpack</li>\n<li>Experience in developing REST APIs and working with microservice architecture</li>\n<li>Strong knowledge of Express JS and Laravel</li>\n<li>Good understanding of database design, SQL queries, stored procedures, views, and functions</li>\n<li>Experience working with PostgreSQL, SQLite, Redis, or other relational databases, along with Laravel’s ORM (Eloquent) or query builder</li>\n<li>Working knowledge of Docker and containerized deployments</li>\n<li>Understanding of software design principles and design patterns</li>\n<li>Ability to troubleshoot, optimize, and maintain large-scale applications</li>\n<li>Good communication and collaboration skills</li>\n<li>Immediate joiners preferred</li>\n</ul>\n<h2>Contact</h2>\n<p>Send your resumes to <strong>hr@srswebsolutions.com</strong> or <strong>ananthu.m@srswebsolutions.in</strong>.</p>",
        "tags": [
            "3–5 Years",
            "React JS",
            "Node JS",
            "Laravel"
        ],
        "summary": "A Full Stack Developer role at a healthcare SaaS company requiring React JS, Node JS, and Laravel expertise with 3–5 years of experience in building scalable applications."
    },
    {
        "job_title": "Customer Success - QC Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26647",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title</strong>: Customer Success - QC Specialist\n<strong>Experience</strong>: 5–8 years\n<strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time\n<strong>Contact Email</strong>: careers@way.com</p>\n<p><strong>Role Overview</strong></p>\n<p>The Customer Success QC Specialist (Mid–Senior Level) is responsible for owning the quality assurance framework for customer interactions across all support channels. This role ensures high standards of communication, accuracy, and customer experience while driving continuous improvement initiatives across the Customer Success and Support teams. The specialist acts as a quality gatekeeper and a partner to training, operations, and product teams.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ol>\n<li><strong>Quality Assurance Leadership</strong></li>\n<li>Conduct detailed audits of customer interactions (email, chat, phone, tickets) using advanced QA scorecards.</li>\n<li>Identify quality gaps at agent, process, and system levels.</li>\n<li>Lead calibrations with internal QA teams and external partners.</li>\n<li>\n<p>Maintain and evolve quality frameworks and rubrics for CS/support functions.</p>\n</li>\n<li>\n<p><strong>Coaching &amp; Skill Development</strong></p>\n</li>\n<li>Provide structured, actionable feedback to support executives and customer success specialists.</li>\n<li>Work closely with L&amp;D and Ops to implement coaching plans and refresher training.</li>\n<li>\n<p>Conduct communication etiquette, tone, and product knowledge sessions when required.</p>\n</li>\n<li>\n<p><strong>Process &amp; Compliance Ownership</strong></p>\n</li>\n<li>Ensure consistency in SOPs, escalation workflows, and service guidelines.</li>\n<li>Identify recurring defects and lead root-cause analysis (RCA).</li>\n<li>Recommend process improvements to reduce errors, improve FCR, and increase CSAT.</li>\n<li>\n<p>Ensure compliance with customer data privacy and operational standards.</p>\n</li>\n<li>\n<p><strong>Insights, Reporting &amp; Stakeholder Management</strong></p>\n</li>\n<li>Create weekly, monthly, and quarterly quality dashboards for leadership review.</li>\n<li>Present trends on CX gaps, agent performance, and customer sentiment insights.</li>\n<li>Partner with Product, CS Ops, and Support teams to improve workflows and customer journey experience.</li>\n<li>\n<p>Track impact of implemented improvements and coaching cycles.</p>\n</li>\n<li>\n<p><strong>Tools &amp; Systems</strong></p>\n</li>\n<li>Experience with Zendesk, Freshdesk, Salesforce, Intercom, or similar platforms.</li>\n<li>Ability to work with QA tools, knowledge bases, reporting dashboards, and analytics platforms.</li>\n<li>Manage and continuously update QA documentation, SOPs, and knowledge articles.</li>\n</ol>\n<p><strong>Required Skills &amp; Qualifications</strong></p>\n<ul>\n<li>5–8 years of experience in Customer Success, Customer Support QA/QC, or CX Quality roles.</li>\n<li>Strong expertise in customer interaction evaluation and quality frameworks.</li>\n<li>Excellent written and verbal communication skills with strong attention to detail.</li>\n<li>Ability to diagnose behavioural, technical, and communication issues.</li>\n<li>Experience running calibrations, RCAs, and process improvement initiatives.</li>\n<li>Strong analytical skills with experience in quality reporting and dashboards.</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li>Exposure to SaaS support environments or global customer bases.</li>\n<li>Experience coaching support teams at scale.</li>\n<li>Knowledge of metrics such as CSAT, FCR, NPS, QA accuracy, AHT, and SLA adherence.</li>\n<li>Experience handling multilingual or culturally diverse customer interactions.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-qc\">https://waydot.greythr.com/hire/jobs/customer-success-qc</a></p>",
        "tags": [
            "5-8 Years",
            "Zendesk",
            "Salesforce",
            "Intercom"
        ],
        "summary": "Customer Success QC Specialist ensures quality in customer interactions and drives process improvements. Requires 5-8 years experience in QA/QC with expertise in tools like Zendesk and Salesforce."
    },
    {
        "job_title": "Director - Integrated Marketing",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26646",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Position Overview</strong></p>\n<p><strong>Role</strong>: Director - Integrated Marketing\n<strong>Location</strong>: Trivandrum\n<strong>Type</strong>: Full-time/WFO role\n<strong>Closing Date</strong>: 11, Jan 2026</p>\n<p><strong>Role Overview</strong></p>\n<p>We’re seeking a senior marketing operator to lead the India-based non-paid marketing engine. This role drives awareness, SEO, AI search (LLM/GEO), and organic growth, collaborating with top-tier agencies and in-house teams. You’ll translate global strategy into flawless execution, acting as a player-coach to scale brands and command agencies with precision.</p>\n<p><strong>Responsibilities</strong>\n- Lead brand growth with a focus on SEO, LLM/GEO, and social media, collaborating with content &amp; UGC teams (excluding paid media buying).\n- Act as the command center for external agencies: set direction, review output, enforce timelines, and raise standards.\n- Orchestrate execution between internal marketing teams and global leadership.\n- Build quarterly roadmaps, weekly execution plans, and delivery reviews with detailed KPIs.\n- Personally audit strategy, content, SEO, and AI search visibility for quality and impact.</p>\n<p><strong>Preferred Skills</strong>\n- 10–15+ years in marketing across agency and in-house leadership roles.\n- Strong expertise in SEO, content, and brand strategy.\n- Proven success in scaling a brand nationally or globally.\n- Decisive, structured, and execution-focused leadership.\n- Experience growing organic traffic and page rankings for national brands.</p>\n<p><strong>Why This Role Is Special</strong>\n- Direct access to global marketing leadership.\n- Authority to shape organic and brand growth strategies.\n- High-impact role in a fast-scaling global business.</p>\n<p><strong>Why Join Us?</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Impact 10+ million users with innovative solutions.\n- Dynamic, fast-paced, innovation-driven culture.\n- Clear career growth pathways in a rapidly scaling tech company.\n- Competitive compensation.</p>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/director-integrated-marketing\">https://waydot.greythr.com/hire/jobs/director-integrated-marketing</a>\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "10–15+ Years",
            "SEO",
            "Content Marketing",
            "Brand Strategy"
        ],
        "summary": "Lead global organic marketing for a top US auto super app, scaling SEO, AI search, and brand growth with cross-functional teams."
    },
    {
        "job_title": "Dot Net Full Stack Developer",
        "company": "Xpetize Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26645",
        "location": "Technopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>About the Role</h2>\n<p>Xpetize Technology Solutions (P) Ltd is seeking a <strong>Dot Net Full Stack Developer</strong> to join our team at Technopark, Trivandrum. The position requires 4–5 years of experience in .NET Full Stack Development.</p>\n<h3>Responsibilities &amp; Qualifications</h3>\n<ul>\n<li><strong>Experience</strong>: 4–5 years in .NET Full Stack Development</li>\n<li><strong>Work Mode</strong>: Work from Office (Technopark - Phase 1, Trivandrum)</li>\n<li><strong>Technical Skills</strong>:</li>\n<li>Strong hands-on experience with <strong>ASP.NET Web API</strong>, <strong>C#</strong>, and <strong>Entity Framework</strong></li>\n<li>Solid experience in <strong>SQL Server</strong> (Stored Procedures, Queries, Performance Optimization)</li>\n<li>Experience with <strong>Angular</strong> and frontend technologies (<strong>TypeScript</strong>, <strong>JavaScript</strong>, <strong>HTML</strong>, <strong>CSS</strong>)</li>\n<li>Good understanding of <strong>REST API</strong> design and integration</li>\n<li><strong>Soft Skills</strong>:</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Strong problem-solving and communication skills</li>\n</ul>\n<h3>Additional Details</h3>\n<ul>\n<li><strong>Number of Positions</strong>: 02</li>\n<li><strong>Job Published</strong>: 09, Jan 2026</li>\n<li><strong>Closing Date</strong>: 09, Feb 2026</li>\n<li><strong>Contact Email</strong>: <a href=\"mailto:careers@xpetize.com\">careers@xpetize.com</a></li>\n<li><strong>Address</strong>: A-10, TBIC, 4th Floor, Nila, Technopark, Kerala, Trivandrum, 695581</li>\n<li><strong>Company Website</strong>: <a href=\"http://www.xpetize.com\">www.xpetize.com</a></li>\n</ul>",
        "tags": [
            "4–5 Years",
            "ASP.NET Web API",
            "C#",
            "Angular"
        ],
        "summary": "A .NET Full Stack Developer role requiring 4-5 years of experience in C#, ASP.NET, SQL Server, and Angular, with 2 positions available at Xpetize Technology Solutions in Trivandrum."
    },
    {
        "job_title": "Digital Marketing Trainee",
        "company": "Hybcloud Technologies (P) Ltd (Cloud Control)",
        "url": "https://technopark.org/job-details/26644",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>HybCloud Technologies (P) Ltd (Cloud Control)</h2>\n<p>ACE-12, 4th Floor, C-DAC Building, Technopark, Trivandrum, Kerala, India , 695582\n<a href=\"http://www.ecloudcontrol.com\">http://www.ecloudcontrol.com</a></p>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@ecloudcontrol.com\">careers@ecloudcontrol.com</a></p>\n<h3>About Us:</h3>\n<p>Revolutionizing Platform Engineering with AppZ, DataZ, ManageZ and lowtouch.ai\nAt Cloud Control, we are a leading cloud platform engineering team dedicated to optimizing cloud infrastructure, automating and securing DevOps pipelines, and enhancing observability for our clients. We specialize in clearing technical debt efficiently, enabling enterprises to accelerate cloud adoption and modernization while reducing long-term costs. Our innovative AI solutions (Agentic AI Platform) empower businesses to streamline operations, improve time to market, and ensure high availability across public, private, and hybrid environments.</p>\n<h3>Role Overview:</h3>\n<p>We are seeking a motivated and enthusiastic <strong>Digital Marketing Trainee</strong> to join our marketing team. This entry-level position is designed for individuals eager to start their career in digital marketing and business development. As a Digital Marketing Trainee, you will assist in various digital marketing activities, lead generation, social media management, content creation, and market analysis. Basic knowledge of SEO is a plus, but the primary focus will be on broader digital marketing and business development tasks.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Lead Generation:</strong> Assist in identifying potential clients and generating leads through various online channels, including social media, email campaigns, and digital outreach.</li>\n<li><strong>Social Media Management:</strong> Help manage and schedule posts on social media platforms, engage with followers, and track social media performance to increase brand awareness and drive traffic.</li>\n<li><strong>Content Creation:</strong> Support the content team in creating engaging blog posts, social media updates, newsletters, and other marketing materials that resonate with our target audience.</li>\n<li><strong>Email Marketing:</strong> Assist in developing and executing email marketing campaigns to nurture leads, engage customers, and drive conversions.</li>\n<li><strong>Market Research and Analysis:</strong> Conduct research on industry trends, competitors, and target audiences to support marketing and business development strategies.</li>\n<li><strong>Business Development Support:</strong> Collaborate with the sales and marketing teams to identify new business opportunities and contribute to business development initiatives.</li>\n<li><strong>Collaboration:</strong> Work closely with the marketing, design, and development teams to support ongoing projects and campaigns.</li>\n<li><strong>SEO Knowledge:</strong> Apply basic SEO principles to optimize digital marketing efforts, ensuring content is search-engine friendly.</li>\n<li><strong>Continuous Learning:</strong> Stay updated on the latest digital marketing trends, tools, and best practices to enhance your skills and knowledge.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Education:</strong> Bachelor’s degree in Marketing, Business, Communications, or a related field.</li>\n<li><strong>Skills:</strong> Basic understanding of digital marketing concepts, including social media, content marketing, email marketing, and lead generation.</li>\n<li><strong>Tools:</strong> Familiarity with digital marketing tools like Google Analytics, social media platforms, and content management systems is a plus.</li>\n<li><strong>Communication:</strong> Strong written and verbal communication skills.</li>\n<li><strong>Creativity:</strong> A creative mindset with an eye for detail and a passion for marketing.</li>\n<li><strong>Enthusiasm:</strong> A positive attitude, willingness to learn, and a proactive approach to tasks.</li>\n<li><strong>Team Player:</strong> Ability to work collaboratively in a team environment.</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li><strong>Training and Development:</strong> Comprehensive training and mentorship to help you grow and develop your digital marketing and business development skills.</li>\n<li><strong>Career Growth:</strong> Opportunities for advancement within the company based on performance and skills development.</li>\n</ul>\n<p><strong>Job Types:</strong> Full-time, Freshers</p>",
        "tags": [
            "Freshers",
            "Digital Marketing",
            "SEO",
            "Google Analytics"
        ],
        "summary": "Digital Marketing Trainee role for freshers at Cloud Control, offering training in SEO, social media, and content creation with opportunities for career growth."
    },
    {
        "job_title": "Digital Marketing Intern",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/26643",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Digital Marketing Intern at Valoriz Digital (P) Ltd</h2>\n<p><strong>Location:</strong> Valoriz Digital, Technopark, Trivandrum\n<strong>Duration:</strong> 3 months (Unpaid)\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@valoriz.com\">careers@valoriz.com</a></p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Assist in social media content creation and basic digital marketing activities.</li>\n<li>Conduct market research and analysis across various domains and websites, including TAM/SAM/SOM assessments, to identify business opportunities.</li>\n<li>Support lead generation efforts across digital platforms.</li>\n<li>Help with SEO, keyword research, and campaign coordination.</li>\n<li>Track basic performance metrics and prepare reports.</li>\n<li>Stay updated with current digital marketing trends.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong interest in digital marketing and willingness to learn.</li>\n<li>Basic understanding of social media, SEO, and lead generation.</li>\n<li><strong>MBA in Marketing is mandatory for this role.</strong></li>\n<li>Good communication and analytical skills.</li>\n<li>Ability to work collaboratively in a fast-paced environment.</li>\n</ul>\n<h3>Additional Notes:</h3>\n<ul>\n<li>Interns who demonstrate exceptional performance during the internship will be offered a full-time opportunity with strong career growth in marketing.</li>\n</ul>\n<p><strong>Company Address:</strong> L2, -1 Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.valoriz.com\">www.valoriz.com</a></p>",
        "tags": [
            "0-1 Years",
            "Social Media",
            "SEO",
            "Lead Generation"
        ],
        "summary": "Digital Marketing Intern role at Valoriz Digital requires an MBA in Marketing. Responsibilities include social media, SEO, and lead generation with potential for full-time conversion."
    },
    {
        "job_title": "Finance Executive/Finance Analyst",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26642",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2><strong>Finance Executive/Finance Analyst</strong> at Way.com India Pvt Ltd</h2>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Closing Date:</strong> January 11, 2026\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/finance-executive\">Finance Executive/Analyst Application</a></p>\n<h3><strong>About Us</strong></h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, parking, EV charging, and more. Recognized by Bloomberg and ranked #48 on Andreessen Horowitz’s Marketplace list, we leverage AI and data analytics to redefine car ownership.</p>\n<h3><strong>Role Overview</strong></h3>\n<p>We seek a <strong>CA-qualified Finance Professional</strong> with <strong>2–3 years of experience</strong> in <strong>FP&amp;A, accounting, financial reporting, and reconciliations</strong>. The role involves collaborating with business teams, preparing financial statements, managing AR/AP processes, and utilizing ERP systems.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li><strong>Financial Planning &amp; Analysis:</strong> Partner with stakeholders to drive financial insights, coordinate forecasts, and analyze performance variances.</li>\n<li><strong>Financial Accounting &amp; Reporting:</strong> Prepare compliant financial statements, manage revenue/cost bookings, and conduct P&amp;L, balance sheet, and cash flow analysis.</li>\n<li><strong>Reconciliation &amp; Compliance:</strong> Perform AP/AR and intercompany reconciliations, and support audits with documentation.</li>\n<li><strong>Budgeting &amp; Costing:</strong> Assist in budget preparation, cash flow forecasting, and variance analysis.</li>\n<li><strong>Accounts Payable/Receivable:</strong> Oversee vendor payments, invoice processing, and client invoicing.</li>\n<li><strong>ERP &amp; Tools:</strong> Work with <strong>SAP/Tally/ERP systems</strong>, <strong>Power BI</strong>, <strong>SQL</strong>, and <strong>Advanced Excel</strong> for reporting and analysis.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Strong knowledge of accounting standards and financial principles.</li>\n<li>Proficiency in <strong>SAP/Tally/ERP applications</strong>.</li>\n<li>Advanced skills in <strong>Excel</strong>, <strong>Power BI</strong>, and <strong>SQL</strong>.</li>\n<li>Excellent analytical, reconciliation, and problem-solving abilities.</li>\n<li>Attention to detail and cross-functional collaboration.</li>\n</ul>\n<h3><strong>Why Join Us?</strong></h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with innovative solutions.</li>\n<li>Dynamic, innovation-driven culture in a rapidly scaling tech company.</li>\n<li><strong>Competitive compensation</strong> and clear career growth pathways.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "SAP",
            "Power BI",
            "Excel"
        ],
        "summary": "CA-qualified Finance Executive/Analyst with 2-3 years experience in FP&A, financial reporting, and ERP systems. Supports financial analysis, budgeting, and compliance for a leading auto super app."
    },
    {
        "job_title": "Junior QA Engineer (Manual + Automation)",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26641",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>Way.com — Junior QA Engineer (Manual + Automation)</h2>\n<p><strong>Company</strong>: Way.Com India Pvt Ltd\n<strong>Location</strong>: 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website</strong>: <a href=\"http://www.way.com\">http://www.way.com</a>\n<strong>Closing Date</strong>: 11, Jan 2026\n<strong>Job Published</strong>: 09, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/junior-qa-engineer\">https://waydot.greythr.com/hire/jobs/junior-qa-engineer</a></p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with solutions for auto insurance, parking, EV charging, and more. Leveraging AI, machine learning, and data analytics, we deliver personalized experiences and have been recognized by Bloomberg and UnitQ.</p>\n<h3>Role Overview</h3>\n<p>We seek a motivated <strong>Junior QA Engineer</strong> with <strong>1–2 years</strong> of experience in <strong>manual</strong> and <strong>automation testing</strong> of web and mobile applications. The ideal candidate will:\n- Perform functional, regression, sanity, and exploratory testing\n- Use automation tools like <strong>Selenium</strong>, <strong>Playwright</strong>, or <strong>Cypress</strong>\n- Design test cases from requirements and identify edge cases\n- Log defects in <strong>Jira</strong> and validate fixes\n- Analyze failures to distinguish automation vs. product issues\n- Validate production issues via logging and monitoring\n- Adapt to evolving QA practices and tools</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in <strong>Java</strong>, <strong>JavaScript</strong>, <strong>TypeScript</strong>, or <strong>Python</strong></li>\n<li>Basic <strong>Git</strong> knowledge</li>\n<li>Cross-browser/device testing experience</li>\n<li>API testing with <strong>Postman</strong> or REST</li>\n<li>Understanding of <strong>SDLC</strong>, <strong>STLC</strong>, and <strong>Agile/Scrum</strong></li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li><strong>SQL</strong> for database testing</li>\n<li>CI/CD pipeline exposure (<strong>Jenkins</strong>, <strong>GitHub Actions</strong>)</li>\n<li>Test management tools (<strong>TestRail</strong>)</li>\n<li>Basics of performance, security, or accessibility testing</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work for the <strong>#1 Auto Super App</strong> in the US</li>\n<li>Impact <strong>10+ million users</strong></li>\n<li>Fast-paced, innovation-driven culture</li>\n<li>Clear career growth in a scaling tech company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time</p>",
        "tags": [
            "1-2 Years",
            "Selenium",
            "Playwright",
            "Cypress"
        ],
        "summary": "Junior QA Engineer with 1-2 years of manual/automation testing experience for web/mobile apps at a leading US automotive super app."
    },
    {
        "job_title": "IT Infrastructure Engineer (Trivandrum)",
        "company": "Infospica Consultancy Services",
        "url": "https://technopark.org/job-details/26640",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>Infospica Consultancy Services</h2>\n<p>2301, Third Floor, Yamuna, Phase-III, Technopark, Trivandrum , 695583\n<a href=\"http://www.infospica.com\">http://www.infospica.com</a></p>\n<h3>IT Infrastructure Engineer (Trivandrum)</h3>\n<p><strong>Closing Date:</strong> 10, Feb 2026\n<strong>Job Published:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:naima.a@infospica.com\">naima.a@infospica.com</a></p>\n<p><strong>Brief Description</strong>\nWe are hiring an IT Infrastructure Engineer to manage servers, support deployments, and ensure secure &amp; reliable application hosting.</p>\n<p><strong>Responsibilities:</strong>\n- Manage Linux servers and containerized applications (Docker).\n- Support CI/CD pipelines (GitLab preferred).\n- Deploy applications (WordPress, Strapi, Java, .NET, PHP, Python, Node.js, Angular, React, Next.js).\n- Configure and maintain web/app servers (Apache, Nginx, HAProxy, Tomcat).\n- Manage databases (MySQL, PostgreSQL, SQL Server).\n- Monitor servers, troubleshoot issues, and improve performance.\n- Handle SSL, DNS, firewalls, backups, and disaster recovery.</p>\n<p><strong>Preferred Skills:</strong>\n- Strong Linux administration &amp; shell scripting.\n- Docker &amp; Docker Compose experience.\n- Good understanding of CI/CD workflows.\n- Knowledge of networking, logs, load balancing &amp; security.\n- Exposure to cloud platforms (AWS, Azure, GCP).</p>",
        "tags": [
            "3-5 Years",
            "Linux",
            "Docker",
            "CI/CD"
        ],
        "summary": "Seeking an IT Infrastructure Engineer to manage servers and deployments. Requires Linux, Docker, and CI/CD expertise for secure application hosting."
    },
    {
        "job_title": "Angular Developer (Trivandrum/Remote)",
        "company": "Infospica Consultancy Services",
        "url": "https://technopark.org/job-details/26639",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<p><strong>Infospica Consultancy Services</strong>\n2301, Third Floor, Yamuna, Phase-III, Technopark, Trivandrum, 695583\n<a href=\"http://www.infospica.com\">http://www.infospica.com</a></p>\n<p><strong>Job Title:</strong> Angular Developer (Trivandrum/Remote)\n<strong>Closing Date:</strong> 10, Feb 2026\n<strong>Job Published:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:jobs@infospica.com\">jobs@infospica.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced Front End Developer with <strong>4+ years</strong> of expertise in designing and developing interactive web applications. The ideal candidate will have a strong proficiency in <strong>Angular (version 8 and above)</strong>, <strong>JavaScript</strong>, and <strong>TypeScript</strong>. The candidate should be well-versed in creating visually appealing and intuitive front-end interfaces using <strong>CSS3</strong> and <strong>HTML5</strong>.</p>\n<h3>Mandatory Skills</h3>\n<ul>\n<li>Front End Development</li>\n<li>Angular (version 8 and above)</li>\n<li>JavaScript</li>\n<li>TypeScript</li>\n<li>CSS3</li>\n<li>HTML5</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Engineering, or a related field.</li>\n<li><strong>4+ years</strong> of professional experience as an Angular Developer.</li>\n<li>Strong proficiency in Angular (version 8 and above), JavaScript, TypeScript, CSS3, and HTML5.</li>\n<li>Experience in designing and developing responsive web applications.</li>\n<li>Knowledge of API interfacing and experience in consuming RESTful APIs.</li>\n<li>Familiarity with version control systems (e.g., Git).</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Excellent communication and teamwork skills.</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop dynamic front-end interfaces using Angular, JavaScript, TypeScript, CSS3, and HTML5.</li>\n<li>Collaborate with back-end developers and UX/UI designers to implement visually appealing and intuitive user interfaces.</li>\n<li>Utilize best practices for web development to ensure high performance and maintainability of code.</li>\n<li>Integrate with back-end services by consuming RESTful APIs to fetch and display data.</li>\n<li>Debug and troubleshoot issues related to front-end development, ensuring smooth user experiences across various devices and browsers.</li>\n<li>Optimize application performance to deliver fast and responsive user interfaces.</li>\n<li>Stay updated with the latest trends and technologies in front-end development.</li>\n</ul>\n<h3>Notice Period</h3>\n<ul>\n<li>Immediate</li>\n</ul>\n<h3>Location</h3>\n<ul>\n<li>Trivandrum (WFO) / Remote (WFH)</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Angular (version 8 and above)",
            "JavaScript",
            "TypeScript"
        ],
        "summary": "Seeking an Angular Developer with 4+ years of experience in front-end development using Angular, JavaScript, and TypeScript to create responsive web applications."
    },
    {
        "job_title": "Junior Digital Marketing Executive (Trivandrum)",
        "company": "Infospica Consultancy Services",
        "url": "https://technopark.org/job-details/26638",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<p><strong>Company</strong>: Infospica Consultancy Services\n<strong>Address</strong>: 2301, Third Floor, Yamuna, Phase-III, Technopark, Trivandrum, 695583\n<strong>Website</strong>: <a href=\"http://www.infospica.com\">http://www.infospica.com</a>\n<strong>Job Title</strong>: Junior Digital Marketing Executive\n<strong>Location</strong>: Trivandrum (WFO)\n<strong>Closing Date</strong>: 10, Feb 2026\n<strong>Published Date</strong>: 09, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:jobs@infospica.com\">jobs@infospica.com</a></p>\n<p><strong>Brief Description</strong>\nWe are seeking a proactive and enthusiastic <strong>Junior Digital Marketing Executive</strong> to join our dynamic marketing team. This role is ideal for someone passionate about digital trends and basic marketing knowledge, offering growth opportunities in a fast-paced environment.</p>\n<p><strong>Mandatory Skills</strong>\n- Strong written &amp; verbal communication\n- Basic knowledge of social media platforms &amp; tools\n- Familiarity with digital marketing (SEO, Content, Email Campaigns)</p>\n<p><strong>Key Responsibilities</strong>\n- Assist in executing digital marketing campaigns across social media, email, and content marketing\n- Support social media post management and scheduling\n- Monitor campaign performance using basic analytics tools\n- Conduct market and competitor research\n- Create and optimize SEO-focused content\n- Maintain marketing databases and mailing lists\n- Learn and contribute to email marketing, SEO, and online ads</p>\n<p><strong>Preferred Skills</strong>\n- Exposure to tools like Canva, Google Analytics, Mailchimp\n- Basic understanding of CMS platforms (e.g., WordPress)\n- Creative mindset with visual content skills</p>\n<p><strong>Required Qualification</strong>\n- Bachelor's degree in Computer Science, Information Technology, or related field\n- Engineering graduates preferred</p>\n<p><strong>Notice Period</strong>: 2 Weeks/1 Month (Max)</p>",
        "tags": [
            "Entry Level",
            "SEO",
            "Social Media Marketing",
            "Email Marketing"
        ],
        "summary": "Junior Digital Marketing Executive role in Trivandrum requires SEO, social media, and email marketing skills. Opportunity to grow in a fast-paced environment with basic digital marketing responsibilities."
    },
    {
        "job_title": "IT System - Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26637",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<p><strong>Company Information</strong></p>\n<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title</strong>: IT System Engineer\n<strong>Experience</strong>: 2 to 4 years\n<strong>Work Arrangement</strong>: On-site\n<strong>Employment Type</strong>: Full-time\n<strong>Closing Date</strong>: 11, Jan 2026\n<strong>Job Published</strong>: 09, Jan 2026\n<strong>Contact Email</strong>: careers@way.com\n<strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/it-system-engineer\">https://waydot.greythr.com/hire/jobs/it-system-engineer</a></p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking an experienced <strong>IT System Engineer</strong> with 2–4 years of experience in IT infrastructure management, Office 35 administration, and system support. The ideal candidate will have hands-on experience in Linux and Windows environments, networking (Fortigate or similar routers), and cloud-based server deployments. The role also involves infrastructure monitoring using <strong>Grafana, Zabbix, or similar tools</strong>, with opportunities to grow into <strong>DevOps and automation domains</strong>.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Provide <strong>technical support</strong> and troubleshooting for hardware, software, and networking issues.</li>\n<li>Manage and maintain <strong>IT infrastructure</strong>, ensuring uptime, performance, and security.</li>\n<li><strong>Administer and support Office 365</strong>, including Exchange Online, Teams, SharePoint, and OneDrive.</li>\n<li>Configure and manage <strong>Fortigate routers/firewalls</strong> and VPN connections.</li>\n<li>Perform <strong>Linux system administration</strong> – user management, configurations, patching, and updates.</li>\n<li>Support <strong>Windows environments</strong> for installation, configuration, and maintenance.</li>\n<li><strong>Deploy and manage virtual machines (VMs)</strong> on cloud platforms such as <strong>DigitalOcean</strong> and <strong>OVH</strong>.</li>\n<li>Implement and manage <strong>infrastructure monitoring</strong> using <strong>Grafana, Zabbix, or similar tools</strong>.</li>\n<li>Maintain IT documentation, system configurations, and internal knowledge base.</li>\n<li>Collaborate with teams to <strong>support the transition toward DevOps workflows</strong> and infrastructure automation.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Bachelor’s degree in <strong>Computer Science, Information Technology, or a related field</strong>.</li>\n<li><strong>2–4 years</strong> of experience in IT Support, System Administration, or Infrastructure Engineering.</li>\n<li>Hands-on experience with <strong>Office 365 administration</strong>.</li>\n<li>Strong understanding of <strong>Fortigate routers/firewalls</strong> and networking fundamentals.</li>\n<li>High-level knowledge of Linux administration.</li>\n<li>Experience with <strong>cloud VM management</strong> (DigitalOcean, OVH, or equivalent).</li>\n<li>Familiarity with <strong>monitoring tools such as Grafana, Zabbix, or similar platforms</strong>.</li>\n<li>Strong troubleshooting, analytical, and problem-solving skills.</li>\n<li>Excellent communication and documentation abilities.</li>\n<li>Willingness to work in <strong>rotational shifts</strong>.</li>\n</ul>\n<p><strong>Why You Will Love Working With Us</strong></p>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/it-system-engineer\">https://waydot.greythr.com/hire/jobs/it-system-engineer</a></p>",
        "tags": [
            "2-4 Years",
            "Office 365",
            "Linux",
            "Cloud VM Management (DigitalOcean/OVH)"
        ],
        "summary": "Seeking an IT System Engineer with 2-4 years of experience in IT infrastructure, Office 365, Linux, and cloud environments. Responsibilities include system administration, networking, and DevOps automation for a US-based automotive super app."
    },
    {
        "job_title": "Backend Developer (Trivandrum/Remote)",
        "company": "Infospica Consultancy Services",
        "url": "https://technopark.org/job-details/26636",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<p><strong>Infospica Consultancy Services</strong>\n2301, Third Floor, Yamuna, Phase-III, Technopark, Trivandrum, 695583\n<a href=\"http://www.infospica.com\">http://www.infospica.com</a></p>\n<p><strong>Backend Developer (Trivandrum/Remote)</strong>\n<strong>Closing Date:</strong> 10, Feb 2026\n<strong>Job Published:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:jobs@infospica.com\">jobs@infospica.com</a></p>\n<h3>Job Overview</h3>\n<p>We are seeking an experienced Backend Developer with strong expertise in <strong>.NET Core</strong> and <strong>Node.js</strong> to design, develop, and maintain scalable backend systems and APIs. The ideal candidate has hands-on experience building high-performance, secure, and maintainable server-side applications and is comfortable working in a collaborative, fast-paced environment.</p>\n<h3>Mandatory Skills</h3>\n<ul>\n<li><strong>.NET Core</strong>, <strong>Node.js</strong>, <strong>RESTful APIs</strong></li>\n<li>Relational and/or NoSQL Databases</li>\n<li>Experience with ORMs (Entity Framework Core, Sequelize, TypeORM)</li>\n<li><strong>Git</strong></li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Minimum <strong>4+ years</strong> of backend development experience</li>\n<li>Minimum 3 years of hands-on experience in <strong>.NET Core</strong></li>\n<li>Strong proficiency in <strong>.NET Core / ASP.NET Core</strong></li>\n<li>Strong hands-on experience with <strong>Node.js</strong></li>\n<li>Experience with RESTful API design and development</li>\n<li>Solid understanding of relational and/or NoSQL databases</li>\n<li>Experience with ORMs</li>\n<li>Knowledge of asynchronous programming, multithreading, and event-driven architecture</li>\n<li>Familiarity with authentication standards (JWT, OAuth, OpenID Connect)</li>\n<li>Experience with <strong>Git</strong> and version control workflows</li>\n<li>Understanding of CI/CD pipelines and deployment processes</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain backend services using <strong>.NET Core</strong> and <strong>Node.js</strong></li>\n<li>Build and consume RESTful APIs and/or GraphQL APIs</li>\n<li>Develop scalable, high-performance, and secure backend architectures</li>\n<li>Work with databases such as SQL Server, PostgreSQL, MySQL, or MongoDB</li>\n<li>Implement authentication, authorization, and data protection mechanisms</li>\n<li>Integrate third-party services, APIs, and cloud-based solutions</li>\n<li>Optimize application performance, scalability, and reliability</li>\n<li>Write clean, reusable, and well-documented code</li>\n<li>Collaborate with frontend developers, DevOps, and product teams</li>\n<li>Participate in code reviews, troubleshooting, and production support</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Experience with microservices architecture</li>\n<li>Exposure to cloud platforms (Azure, AWS, or GCP)</li>\n<li>Knowledge of Docker and containerization</li>\n<li>Experience with message brokers (RabbitMQ, Kafka, Azure Service Bus)</li>\n<li>Familiarity with unit testing and automated testing frameworks</li>\n<li>DevOps and monitoring experience</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong problem-solving and analytical skills</li>\n<li>Excellent communication and collaboration abilities</li>\n<li>Ability to work independently and take ownership of tasks</li>\n<li>Attention to detail and commitment to code quality</li>\n</ul>\n<h3>Notice Period</h3>\n<ul>\n<li>Immediate/15 Days Maximum</li>\n</ul>\n<h3>Location</h3>\n<ul>\n<li>Trivandrum (WFO) / Remote (WFH)</li>\n</ul>",
        "tags": [
            "4+ Years",
            ".NET Core",
            "Node.js",
            "RESTful APIs"
        ],
        "summary": "Seeking a Backend Developer with 4+ years of experience in .NET Core and Node.js to design scalable backend systems and APIs."
    },
    {
        "job_title": "Graphic Designer Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26635",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>Way.com — Lead Marketing Designer</h2>\n<p><strong>Company Overview</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with solutions for auto insurance, EV charging, parking, and more. Leveraging AI, machine learning, and data analytics, we deliver personalized experiences and are recognized as the #1 Product in Insurance by UnitQ and ranked 48th on Andreessen Horowitz’s fastest-growing companies list.</p>\n<p><strong>Job Details</strong>\n- <strong>Role</strong>: Lead Marketing Designer\n- <strong>Experience</strong>: 4–6 years\n- <strong>Work Arrangement</strong>: On-site\n- <strong>Employment Type</strong>: Full-time\n- <strong>Location</strong>: 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n- <strong>Application Link</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-graphic-designer\">Apply Now</a>\n- <strong>Contact</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>\n<p><strong>Role Overview</strong>\nWe seek a <strong>Lead Marketing Designer</strong> to collaborate with marketing and design leadership to shape Way.com’s visual identity at scale. This role is not about executing briefs but redefining how marketing design operates, driving growth through high-impact campaigns and brand initiatives.</p>\n<p><strong>Key Responsibilities</strong>\n- Lead visual design for marketing campaigns, brand initiatives, social/performance ads, and web/product-led marketing.\n- Translate business goals into compelling visual stories.\n- Own design quality from concept to delivery.\n- Collaborate with marketing, content, growth, and product teams.\n- Mentor junior designers and elevate team standards.\n- Manage multiple projects while maintaining quality and timelines.</p>\n<p><strong>Preferred Skills</strong>\n- 4–6 years of graphic/marketing design experience.\n- Expertise in <strong>Figma</strong> and <strong>Adobe Creative Suite</strong>.\n- AI proficiency for concept generation, campaign scaling, and training juniors.\n- Experience with digital-first brands and fast-moving teams.\n- Ability to take feedback, defend design decisions, and thrive in ambiguity.</p>\n<p><strong>Bonus Skills</strong>\n- Motion/video/animation skills.\n- Performance marketing creative experience.\n- Startup/high-growth environment background.</p>\n<p><strong>Why This Role Matters</strong>\nDesign at Way.com is a <strong>growth lever</strong>, not a support function. You’ll impact 10+ million users, scale our app/web product, and drive brand initiatives. Expect real ownership, direct feedback, and high expectations.</p>\n<p><strong>Why Join Us?</strong>\n- Work for the #1 Auto Super App in the US.\n- Make a meaningful impact across 10+ million users.\n- Dynamic, innovation-driven culture in a rapidly scaling tech company.\n- Clear career growth pathways and competitive compensation.</p>",
        "tags": [
            "4-6 Years",
            "Figma",
            "Adobe Creative Suite",
            "AI"
        ],
        "summary": "Lead Marketing Designer at Way.com, a leading automotive super app, to shape visual campaigns and mentor teams. Requires 4-6 years of design experience with Figma and Adobe Creative Suite expertise."
    },
    {
        "job_title": "Graphic Designer Junior",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26634",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We’re looking for a <strong>Junior Marketing Designer</strong> to join a marketing design team that already proved its value. After the marketing design team was established, Way.com:\n- Minted high-impact digital and physical campaigns\n- Defined brand guidelines and asset systems from scratch\n- Brought visual consistency across the organization\n- Helped market and sell multiple new and existing products\n- Designed for both B2C customers and B2B partners\n- Supported trade shows and large-scale product launches\n- Drove deep customer impact and strong conversion-led revenue</p>\n<p>This role is for someone early in their career who wants real work, real feedback, and real growth, not busywork.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Support design execution across:</li>\n<li>Marketing campaigns</li>\n<li>Social media</li>\n<li>Ads and performance creatives</li>\n<li>Web and internal communications</li>\n<li>Translate briefs into clean, effective visual outputs</li>\n<li>Assist senior designers on campaign, product, and brand assets</li>\n<li>Iterate fast and accurately based on feedback</li>\n<li>Help maintain brand consistency across platforms</li>\n<li>Learn how design directly impacts marketing performance and business outcomes</li>\n</ul>\n<p><strong>Your work won’t sit in folders. It will go live, get seen, and get measured.</strong></p>\n<h2>Preferred Skills</h2>\n<ul>\n<li>1–3 years of graphic design experience (internships/freelance count)</li>\n<li>A portfolio showing solid fundamentals and willingness to learn</li>\n<li>Working knowledge of <strong>Figma</strong> and <strong>Adobe Creative Suite</strong></li>\n<li>Ability to leverage <strong>AI</strong> for:</li>\n<li>Faster concept generation and creative exploration</li>\n<li>Campaign variations at scale</li>\n<li>Improving speed without compromising brand quality</li>\n<li>Understanding of layout, typography, color, and visual hierarchy</li>\n<li>Openness to feedback and eagerness to improve</li>\n<li>Ability to manage tasks, timelines, and revisions responsibly</li>\n<li>Curiosity, ownership, and a strong work ethic</li>\n</ul>\n<h2>Bonus (Nice to Have)</h2>\n<ul>\n<li>Motion graphics or basic video skills</li>\n<li>Experience with social or marketing creatives</li>\n<li>Exposure to fast-paced or startup environments</li>\n</ul>\n<h2>Why This Role Matters</h2>\n<p>You won’t be stuck doing low-impact work. You’ll contribute to marketing design that has already supported the launch of:\n- Our large-scale app and web product\n- Marketing all the recent product initiatives (B2B - SaaS, B2C)\n- Brand initiatives and more.</p>\n<p>You’ll be guided, but also expected to step up.</p>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/junior-graphic-designer\">https://waydot.greythr.com/hire/jobs/junior-graphic-designer</a></p>\n<p><strong>Contact Email</strong>: careers@way.com</p>",
        "tags": [
            "1-3 Years",
            "Figma",
            "Adobe Creative Suite",
            "AI"
        ],
        "summary": "Junior Graphic Designer role at Way.com requires 1-3 years of experience, focusing on marketing campaigns, brand assets, and AI-driven design. Opportunity to impact 10+ million users in a fast-paced tech environment."
    },
    {
        "job_title": "Senior Python Developer",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26633",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Senior Python Developer</h2>\n<p><strong>Company:</strong> Globcom Solutions (P) Ltd\n<strong>Location:</strong> Module 2502, 5th floor, Yamuna Building, Technopark Phase -3, Thiruvananthapuram, 695583\n<strong>Website:</strong> <a href=\"http://www.globcomsolution.com\">http://www.globcomsolution.com</a>\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published:</strong> 09, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:rajesh@globcomsolution.com\">rajesh@globcomsolution.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly skilled and experienced <strong>Senior Python Developer</strong> to join our team. The ideal candidate will be responsible for designing, developing, and maintaining high-quality backend services, APIs, and applications. You will collaborate closely with cross-functional teams to deliver scalable, secure, and efficient software solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and optimize scalable backend systems and RESTful APIs using Python.</li>\n<li>Write clean, efficient, and maintainable code following industry best practices.</li>\n<li>Lead architecture discussions and contribute to technical decision-making.</li>\n<li>Mentor junior developers and conduct regular code reviews.</li>\n<li>Collaborate with product managers, designers, and other stakeholders to understand requirements.</li>\n<li>Integrate third-party services, databases, and cloud-based solutions.</li>\n<li>Troubleshoot, debug, and resolve technical issues in production and development environments.</li>\n<li>Implement security and data protection best practices.</li>\n<li>Ensure high performance and responsiveness of applications.</li>\n<li>Participate in sprint planning, estimation, and Agile development processes.</li>\n<li>Develop automated tests and ensure comprehensive test coverage.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Engineering, or related field.</li>\n<li>1 to 3 years of professional experience in Python development.</li>\n<li>Strong knowledge of Python frameworks such as <strong>Django</strong>, <strong>Flask</strong>, or <strong>FastAPI</strong>.</li>\n<li>Experience with relational and NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB).</li>\n<li>Strong understanding of software architecture, design patterns, and microservices concepts.</li>\n<li>Hands-on experience with cloud platforms (<strong>AWS</strong>, <strong>Azure</strong>, or <strong>GCP</strong>).</li>\n<li>Proficiency with version control systems (<strong>Git</strong>).</li>\n<li>Familiarity with containerization and orchestration tools (<strong>Docker</strong>, <strong>Kubernetes</strong>).</li>\n<li>Experience with CI/CD pipelines and automated testing frameworks.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n</ul>\n<h3>Preferred Qualifications &amp; Skills</h3>\n<ul>\n<li>Experience with asynchronous frameworks</li>\n<li>Knowledge of data engineering or machine learning pipelines.</li>\n<li>Exposure to DevOps practices and infrastructure automation.</li>\n<li>Understanding of performance tuning and optimization.</li>\n<li>Strong communication and interpersonal abilities.</li>\n<li>Leadership qualities and ability to mentor team members.</li>\n<li>Ability to work independently and manage time effectively.</li>\n<li>Adaptability and willingness to learn emerging technologies.</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Python",
            "Cloud (AWS/Azure/GCP)",
            "Django/Flask/FastAPI"
        ],
        "summary": "Senior Python Developer needed to design scalable backend systems and APIs. Requires 1-3 years of Python experience with frameworks like Django/Flask and cloud platforms."
    },
    {
        "job_title": "Lead - Product Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26632",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p><strong>Lead Product Designer</strong></p>\n<h2>Work Arrangement</h2>\n<p><strong>On-site</strong></p>\n<h2>Employment Type</h2>\n<p><strong>Full-time</strong></p>\n<h2>Role Overview</h2>\n<p>We’re seeking a <strong>Lead Product Designer</strong> to own end-to-end product experiences, raise design standards, and drive outcomes—not just deliver screens. You’ll lead core product design, partner with Product, Engineering, Growth, and Leadership, and report to the Head of Design. Apply if you’re a Lead or Senior Designer ready to elevate your career.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>End-to-end product design for key verticals.</li>\n<li>Define UX strategy, drive research, and ship high-quality flows/UI.</li>\n<li>Elevate visual/UI standards across the product ecosystem.</li>\n<li>Influence product roadmap with data, customer insights, and business context.</li>\n<li>Align cross-functionally to simplify ambiguity and ensure design is prioritized.</li>\n<li>Establish lean, effective design workflows.</li>\n<li>Mentor junior designers, provide critique, and shape team culture.</li>\n<li>Evolve Way.com’s design system for scalability.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>7–10+ years</strong> of product design experience, with <strong>3+ years</strong> in a lead/senior role.</li>\n<li>Strong portfolio showcasing complex problem-solving, consumer app work, and high-quality UI.</li>\n<li>Proven ability to drive outcomes, not just outputs.</li>\n<li>Comfort with fast-paced environments, ambiguity, and data-driven decisions.</li>\n<li>Experience in discovery, research, prototyping, and iterative testing.</li>\n<li>Expertise in <strong>Figma</strong> and modern design tools.</li>\n<li>Strong communication: direct, clear, and decisive.</li>\n<li>Ability to influence product, engineering, and leadership without compromise.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with innovative solutions.</li>\n<li>Dynamic, fast-paced, innovation-driven culture.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-product-designer\">https://waydot.greythr.com/hire/jobs/lead-product-designer</a></p>",
        "tags": [
            "7–10+ Years",
            "Figma",
            "Product Design",
            "Data-Driven Design"
        ],
        "summary": "Lead Product Designer to drive end-to-end design for a top US auto super app, requiring 7–10+ years of experience and expertise in consumer app design and data-driven outcomes."
    },
    {
        "job_title": "Communication Trainer - English",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26631",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions ranging from auto insurance to EV charging. Utilizing AI, machine learning, and data analytics, we deliver personalized, innovative services. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s fastest-growing companies list, we aim to simplify car ownership.</p>\n<h2>Role Overview</h2>\n<p>We seek an <strong>English Communication Trainer</strong> to deliver <strong>on-site training</strong> for customer support teams. The role focuses on enhancing communication quality, customer-handling skills, grammar accuracy, and service language proficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct offline training for customer support executives in <strong>voice, email, and chat processes</strong>.</li>\n<li>Train on <strong>professional communication, customer empathy, tone &amp; clarity, neutral accent, and grammar</strong>.</li>\n<li>Develop modules for <strong>Spoken English, business communication, customer handling scripts, call etiquette, and email/chat etiquette</strong>.</li>\n<li>Evaluate learners via <strong>role plays, call simulations, mock chats/emails, and assessments</strong>.</li>\n<li>Identify communication gaps and create <strong>customized training</strong> for new hires and existing employees.</li>\n<li>Provide <strong>actionable feedback</strong> to improve language proficiency and customer interactions.</li>\n<li>Track performance, maintain reports, and collaborate with <strong>managers and QA teams</strong> for improvement.</li>\n<li>Foster an <strong>engaging, professional classroom environment</strong>.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>4–7 years</strong> of experience as a <strong>Communication/English Trainer</strong> in <strong>BPO, Customer Support, or Corporate Training</strong>.</li>\n<li>Strong command of <strong>spoken/written English</strong> and ability to simplify complex concepts.</li>\n<li>Experience in <strong>voice, email, or chat process training</strong>.</li>\n<li>Excellent <strong>presentation, facilitation, and coaching skills</strong>.</li>\n<li>Ability to handle diverse learners and drive measurable improvement.</li>\n</ul>\n<h3>Preferred Attributes</h3>\n<ul>\n<li>Certification in <strong>communication training, TEFL/TESOL, or soft skills</strong>.</li>\n<li>Experience with <strong>customer support KPIs</strong> (CSAT, quality scores, AHT impact).</li>\n<li>Strong understanding of <strong>customer service language, tone, and escalation handling</strong>.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with meaningful contributions.</li>\n<li>Dynamic, innovation-driven culture with <strong>clear career growth pathways</strong>.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer\">https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer</a></p>",
        "tags": [
            "4–7 Years",
            "Communication Training",
            "Customer Support",
            "Corporate Training"
        ],
        "summary": "English Communication Trainer to enhance customer support teams' skills through offline training. Opportunity to work with a leading US auto super app with growth potential."
    },
    {
        "job_title": "Sales Expert",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26630",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p><strong>Sales Expert</strong></p>\n<h2>Work Arrangement</h2>\n<p><strong>On-site</strong></p>\n<h2>Employment Type</h2>\n<p><strong>Full-time</strong></p>\n<h2>Role Overview</h2>\n<p>We are seeking dynamic, customer-focused <strong>Sales Experts</strong> to join our <strong>Refinance Team</strong>. In this role, you will be the voice of our product — engaging directly with customers, understanding their needs, and helping them choose the best refinance solutions. This is a <strong>B2C sales role</strong>, where communication skills, persuasion, and a passion for sales will make all the difference.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Engage with potential customers through <strong>inbound and outbound calls, emails, and chats</strong>.</li>\n<li>Clearly explain refinance products, features, and benefits to customers.</li>\n<li>Build <strong>trust and rapport</strong> with customers to convert inquiries into successful sales.</li>\n<li>Consistently <strong>achieve individual and team sales targets</strong>.</li>\n<li>Maintain accurate records of customer interactions and transactions in <strong>CRM systems</strong>.</li>\n<li>Collaborate with <strong>Customer Support, Product, and Marketing teams</strong> to ensure a smooth post-sale experience.</li>\n<li>Stay updated on <strong>product knowledge, process updates, and industry trends</strong>.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s or Master’s degree in any discipline (preferably Business or Engineering).</li>\n<li><strong>2–5 years of experience</strong> in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and <strong>experience with CRM tools</strong>.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Email</strong>: careers@way.com\n<strong>Application Link</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/sales-expert\">Apply Now</a>\n<strong>Closing Date</strong>: 11, Jan 2026</p>",
        "tags": [
            "2–5 Years",
            "B2C Sales",
            "CRM Tools",
            "Financial Products"
        ],
        "summary": "Way.com seeks Sales Experts to drive refinance solutions for 10M+ users. Requires 2–5 years in B2C sales with CRM proficiency."
    },
    {
        "job_title": "Senior - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26629",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<p><strong>Way.com India Pvt Ltd</strong></p>\n<p><strong>Position</strong>: Senior Marketing Designer\n<strong>Location</strong>: Trivandrum\n<strong>Type</strong>: Full-time/WFO role\n<strong>Closing Date</strong>: 11, Jan 2026\n<strong>Contact Email</strong>: careers@way.com</p>\n<h3>About Way.com</h3>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Role Overview</h3>\n<p>We’re looking for a <strong>Senior Marketing Designer</strong> who loves turning ideas into visuals that perform. You’ll design high-impact campaigns, ads, and visuals across platforms — from paid media to social and email — collaborating with the creative, growth, and product teams.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Create digital ad creatives, banners, and social visuals for ongoing campaigns.</li>\n<li>Conceptualize visuals for product launches and seasonal campaigns.</li>\n<li>Design for performance with a balance of creativity and clarity.</li>\n<li>Work with copywriters, growth managers, and product designers.</li>\n<li>Execute designs that fit Way.com’s visual brand and tone.</li>\n<li>Explore motion and storytelling to drive engagement.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>3–5 years of experience in marketing design or growth design.</li>\n<li>Proficiency in <strong>Figma</strong>, <strong>Photoshop</strong>, <strong>Illustrator</strong>, and <strong>After Effects</strong>.</li>\n<li>Strong sense of layout, typography, and storytelling.</li>\n<li>Understanding of digital marketing and ad metrics.</li>\n<li>A portfolio that shows creativity and an eye for detail.</li>\n<li>Eagerness to learn, collaborate, and grow fast in a creative environment.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/senior-marketing-designer\">Senior Marketing Designer Application</a></p>",
        "tags": [
            "3-5 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Senior Marketing Designer needed to create high-impact campaigns across platforms. Requires 3-5 years of experience and proficiency in Figma, Photoshop, and Illustrator."
    },
    {
        "job_title": "Lead - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26628",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>Way.com India Pvt Ltd</h2>\n<p><strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/lead-marketing-designer\">https://waydot.greythr.com/hire/jobs/lead-marketing-designer</a></p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, parking, EV charging, and more. Utilizing AI, machine learning, and data analytics, we deliver personalized experiences. Recognized by Bloomberg and Andreessen Horowitz, we redefine car ownership.</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>Lead Marketing Designer</strong> to lead creative strategy and execution for digital campaigns. You’ll manage a design team, maintain brand consistency, and collaborate with cross-functional teams to drive high-performing visuals.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Lead and mentor a team of marketing designers.</li>\n<li>Develop creative strategies for paid, owned, and social channels.</li>\n<li>Design campaigns for product launches, seasonal initiatives, and partnerships.</li>\n<li>Ensure consistent visual identity across global marketing.</li>\n<li>Partner with Growth, Product, and Content teams.</li>\n<li>Balance creativity with data-driven performance metrics.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>6–10 years</strong> of experience in marketing design, art direction, or brand design.</li>\n<li>Proven leadership in creative teams.</li>\n<li>Strong portfolio showcasing campaign systems, digital storytelling, and ad design.</li>\n<li>Expertise in <strong>Figma, Photoshop, Illustrator, After Effects / Premiere Pro</strong>.</li>\n<li>Experience in performance design and metrics like CTR and engagement.</li>\n<li>Strong visual storytelling and typography skills.</li>\n</ul>\n<h3>Why Work With Us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Impact 10+ million users with innovative solutions.</li>\n<li>Dynamic, fast-paced, and innovation-driven culture.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Closing Date:</strong> 11, Jan 2026\n<strong>Published:</strong> 09, Jan 2026</p>",
        "tags": [
            "6–10 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Lead Marketing Designer leads creative strategy for campaigns, leveraging Figma, Photoshop, and Illustrator. Opportunity to shape visual identity for a top US automotive app."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26627",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>Way.com — Manager - Project</h2>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Closing Date:</strong> 11, Jan 2026\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/project-manager\">https://waydot.greythr.com/hire/jobs/project-manager</a></p>\n<h3>About Us</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, EV charging, parking, and more. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, we leverage AI and data analytics to redefine car ownership.</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>Project Manager</strong> with <strong>8+ years</strong> of experience to lead strategic projects from initiation to completion. The ideal candidate will demonstrate leadership, domain expertise, and hands-on execution skills to deliver results within scope, timeline, and budget.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead the full project lifecycle for medium to large-scale initiatives.</li>\n<li>Define and manage project scope, objectives, deliverables, and success criteria.</li>\n<li>Develop detailed project plans with resource allocation, timelines, and budgets.</li>\n<li>Identify risks/dependencies, implement mitigation strategies, and escalate issues.</li>\n<li>Manage stakeholder relationships with clear communication and alignment.</li>\n<li>Conduct project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive cross-functional collaboration for smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes.</li>\n<li>Mentor junior team members to build project management capabilities.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s/Master’s degree in Engineering, Business Administration, or related fields.</li>\n<li><strong>8+ years</strong> of project management experience, preferably in fintech platforms.</li>\n<li>Expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in <strong>project management tools</strong> (MS Project, JIRA, Asana, Trello).</li>\n<li>In-depth knowledge of <strong>Agile</strong>, Waterfall, or hybrid methodologies.</li>\n<li>Strong stakeholder management, leadership, and communication skills.</li>\n<li>Problem-solving and decision-making under pressure.</li>\n<li><strong>Certifications</strong> (PMP, PRINCE2, Agile/Scrum Master/SAFe) are preferred.</li>\n<li>Experience with tools like MPP.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Impact 10+ million users with innovative solutions.</li>\n<li>Dynamic, fast-paced, innovation-driven culture.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/project-manager\">https://waydot.greythr.com/hire/jobs/project-manager</a></p>",
        "tags": [
            "8+ Years",
            "Agile",
            "Project Management Tools",
            "PMP Certification"
        ],
        "summary": "Seasoned Project Manager to lead complex initiatives using Agile methodologies. Drive cross-functional teams in a fast-paced fintech environment."
    },
    {
        "job_title": "SEO Team - Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26626",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3><strong>Job Title</strong>:</h3>\n<p>Team Lead - SEO</p>\n<h3><strong>Experience</strong>:</h3>\n<p>9 - 11 years</p>\n<h3><strong>Work Arrangement</strong>:</h3>\n<p>On-site</p>\n<h3><strong>Employment Type</strong>:</h3>\n<p>Full-time</p>\n<h3><strong>Role Overview</strong></h3>\n<p>We are seeking a highly skilled <strong>Team Lead, SEO</strong> to spearhead our organic growth initiatives and enhance our search engine presence. In this leadership role, you will drive the development and execution of comprehensive SEO strategies, manage a team of SEO specialists, and collaborate cross-functionally to optimize our digital footprint. If you have a deep understanding of search algorithms, technical SEO, and content strategy, along with a passion for driving results, we want to hear from you!</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies</strong> – Define and implement a robust SEO roadmap, ensuring alignment with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team</strong> – Manage a team of SEO professionals, fostering a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO</strong> – Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management</strong> – Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making</strong> – Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration</strong> – Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization</strong> – Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis</strong> – Conduct SEO audits, monitor competitor strategies, and identify new opportunities to stay ahead in the industry.</li>\n<li><strong>SEO Performance Reporting</strong> – Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data to make data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h3><strong>Preferred Qualifications</strong></h3>\n<ul>\n<li>Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li>Understanding of PPC advertising and its relationship with organic search.</li>\n<li>Experience working in a high-growth startup or fast-paced environment.</li>\n<li>Familiarity with social media marketing and its impact on SEO.</li>\n<li>Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h3><strong>Why You Will Love Working With Us</strong></h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/seo-team-lead\">https://waydot.greythr.com/hire/jobs/seo-team-lead</a></p>\n<p><strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "9-11 Years",
            "Technical SEO",
            "Google Analytics",
            "SEO Tools"
        ],
        "summary": "Lead SEO initiatives for a top US auto super app, managing a team to optimize search strategies and drive organic growth in a fast-paced tech environment."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26625",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic and customer-focused <strong>Spanish Customer Success Executive</strong> for an on-site, full-time position. This role involves delivering excellent customer service to Spanish-speaking clients via phone, resolving inquiries with professionalism and efficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction</strong>: Manage inbound and outbound calls to resolve queries, concerns, and complaints promptly.</li>\n<li><strong>Service Excellence</strong>: Provide empathetic, professional support to ensure positive customer experiences.</li>\n<li><strong>Issue Escalation</strong>: Identify and escalate complex cases to relevant departments for swift resolution.</li>\n<li><strong>Documentation</strong>: Maintain accurate records of interactions and update databases.</li>\n<li><strong>Performance Goals</strong>: Meet/exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge</strong>: Stay informed on company products/services to provide accurate information.</li>\n<li><strong>Team Collaboration</strong>: Foster a supportive, collaborative work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Fluency in <strong>Spanish and English</strong> (written and spoken) for bilingual communication.</li>\n<li>Proven customer service experience in a voice process.</li>\n<li>Strong interpersonal/communication skills with patience and empathy.</li>\n<li>Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact 10+ million users with meaningful solutions.</li>\n<li>Dynamic, innovation-driven culture in a rapidly scaling tech company.</li>\n<li>Clear career growth pathways and competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\">https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</a>\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "2-4 Years",
            "Spanish",
            "Customer Service",
            "Bilingual Communication"
        ],
        "summary": "Spanish Customer Success Executive at Way.com handles customer service via phone, resolving queries and ensuring satisfaction for the leading US auto super app."
    },
    {
        "job_title": "Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26624",
        "location": "Technopark",
        "closing_date": "11 Jan 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Customer Success Executive\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a <strong>Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Address customer queries through <strong>phone, email, chat, and social media channels</strong>.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to <strong>products, orders, returns, and general support requests</strong>.</li>\n<li>Maintain accurate <strong>customer records and feedback</strong> in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking <strong>customer satisfaction metrics</strong> and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li><strong>Proven experience (2-5 years)</strong> in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<p><strong>Why You Will Love Working with Us</strong></p>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a></p>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Customer Service",
            "Problem-Solving"
        ],
        "summary": "Customer Success Executive at Way.com handles multi-channel support for 10M+ users, requiring 2-5 years of experience in customer service and CRM systems."
    },
    {
        "job_title": "Sales Engineer",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/26623",
        "location": "Technopark",
        "closing_date": "20 Jan 2026",
        "job_description": "<p><strong>Picky Assist (P) Ltd</strong>\n<em>Picky Assist Pvt Ltd (Kerala Startup Mission)</em></p>\n<p><strong>Address:</strong> T-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<strong>Website:</strong> <a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<p><strong>Closing Date:</strong> 20, Jan 2026\n<strong>Published Date:</strong> 08, Jan 2026\n<strong>Contact Email:</strong> careers@pickyassist.com</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and approach software companies across South India to introduce and promote Picky Assist’s WhatsApp API solutions.</li>\n<li>Understand customer business requirements and explain technical concepts in a user-friendly manner.</li>\n<li>Guide clients through WhatsApp API integration, coordinating with internal teams.</li>\n<li>Conduct online/onsite demos, product walkthroughs, presentations, and technical discussions.</li>\n<li>Build/maintain strong client relationships for seamless onboarding and satisfaction.</li>\n<li>Meet monthly sales targets and contribute to revenue growth.</li>\n<li>Travel across South India for client visits and business development.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Engineering degree with basic understanding of APIs, programming, and software integration.</li>\n<li>Excellent English communication skills (mandatory).</li>\n<li>Minimum 6 months of sales/technical role experience.</li>\n<li>Strong customer need analysis and solution-oriented approach.</li>\n<li>Excellent interpersonal skills and customer-focused mindset.</li>\n</ul>",
        "tags": [
            "6 Months+",
            "APIs",
            "Sales",
            "Customer Relationship Management"
        ],
        "summary": "Sales Engineer at Picky Assist promotes WhatsApp API solutions in South India, requiring technical understanding and sales skills to drive client onboarding and revenue growth."
    },
    {
        "job_title": "I.T.I Technician- Electronics Production",
        "company": "Vinvish Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26622",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Company Information</strong></p>\n<p><strong>VINVISH TECHNOLOGIES (P) Ltd</strong>\nC-16, THEJASWINI BUILDING,\nTECHNOPARK,\nTHIRUVANANTHAPURAM,\nKERALA, INDIA. , 695581\nhttp://www.vinvish.com</p>\n<p><strong>Job Title</strong>: I.T.I Technician - Electronics Production\n<strong>Closing Date</strong>: 31, Jan 2026\n<strong>Job Published</strong>: 08, Jan 2026\n<strong>Contact Email</strong>: divya@vinvish.com</p>\n<p><strong>Brief Description</strong>\nWe invite applications from <strong>fresh ITI Electronics graduates</strong> of the <strong>2023, 2024, and 2025 batches only</strong>. Candidates residing near <strong>Technopark Thiruvananthapuram</strong> and <strong>Menamkulam Kinfrapark</strong> will be given preference. Applicants must have their own <strong>two-wheeler</strong> and a <strong>valid driving license</strong>.</p>\n<p><strong>Preferred Skills</strong>\n- Experience with specific soldering techniques (e.g., <strong>SMT</strong>, <strong>THT</strong>)\n- Knowledge of <strong>ESD safety protocols</strong>\n- Familiarity with <strong>lean manufacturing principles</strong>\n- <strong>Teamwork</strong> and <strong>communication skills</strong>\n- <strong>Adaptability</strong> to new technologies and processes</p>",
        "tags": [
            "Fresh Graduates",
            "Soldering Techniques (SMT/THT)",
            "ESD Safety Protocols",
            "Lean Manufacturing Principles"
        ],
        "summary": "Fresh ITI Electronics graduates needed for electronics production role in Thiruvananthapuram with soldering and ESD safety skills."
    },
    {
        "job_title": "JUNIOR ACCOUNTANT ( MALE )",
        "company": "Vinvish Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26621",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>VINVISH TECHNOLOGIES (P) Ltd</strong>\nC-16, THEJASWINI BUILDING,\nTECHNOPARK,\nTHIRUVANANTHAPURAM,\nKERALA, INDIA. , 695581\nhttp://www.vinvish.com</p>\n<p><strong>JUNIOR ACCOUNTANT (MALE)</strong></p>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 08, Jan 2026\n<strong>Contact Email:</strong> divya@vinvish.com</p>\n<h3>Brief Description</h3>\n<ul>\n<li><strong>Education:</strong> Bachelor's degree in accounting/finance (B.Com.)</li>\n<li><strong>Experience:</strong> 2-5 years in accounting or finance roles</li>\n<li><strong>Vehicle:</strong> Must own a two-wheeler</li>\n<li><strong>Driving License:</strong> Valid driving license is mandatory</li>\n<li><strong>Location Preference:</strong> Priority for male candidates residing in Thiruvananthapuram</li>\n</ul>\n<p><strong>Mention the following in your application:</strong>\n- Do you own a two-wheeler?\n- Do you have a valid Indian driving license?\n- Are you currently based in Trivandrum within a 10km radius?\n- What is your current gross salary?\n- What is your expected gross salary?\n- What is the minimum time required for you to join if selected?</p>\n<h3>Preferred Skills</h3>\n<p><strong>Technical Skills:</strong>\n- Proficiency in accounting software (Tally)\n- MS Office applications (Excel, Word)</p>\n<p><strong>Analytical Skills:</strong>\n- Strong analytical and problem-solving abilities</p>\n<p><strong>Attention to Detail:</strong>\n- Detail-oriented with accuracy in accounting tasks</p>\n<p><strong>Communication Skills:</strong>\n- Effective communication and interpersonal skills</p>\n<h3>Other Expectations</h3>\n<ul>\n<li><strong>Teamwork:</strong> Collaborate with colleagues and build positive relationships</li>\n<li><strong>Adaptability:</strong> Willingness to learn new accounting regulations and standards</li>\n<li><strong>Professionalism:</strong> Commitment to integrity and ethical conduct in financial reporting</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "Tally",
            "MS Excel",
            "MS Word"
        ],
        "summary": "Junior Accountant role requiring 2-5 years of experience, B.Com degree, and proficiency in accounting software. Responsibilities include financial reporting, payroll processing, and compliance with accounting standards."
    },
    {
        "job_title": "Kotlin + Swift Developer (2-4 Years Experience)",
        "company": "Expressare Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26620",
        "location": "Technopark",
        "closing_date": "07 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Expressare Technologies (P) Ltd\n<strong>Address:</strong> SBC - 21, Level -2, Tejaswini, 695581\n<strong>Website:</strong> <a href=\"https://expressare.com\">https://expressare.com</a>\n<strong>Job Title:</strong> Kotlin + Swift Developer (2-4 Years Experience)\n<strong>Closing Date:</strong> 07, Feb 2026\n<strong>Published Date:</strong> 08, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:bency@expressare.com\">bency@expressare.com</a></p>\n<h3>Job Summary:</h3>\n<p>We are seeking an experienced Kotlin/Swift Developer passionate about creating innovative, user-friendly mobile applications. The ideal candidate will have strong expertise in Kotlin and Swift, with a proven track record of delivering high-quality apps on time.</p>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor's or Master's degree in Computer Science, Software Engineering, Information Technology, or related field</li>\n<li><strong>2-4 years</strong> of experience in Java or Kotlin development</li>\n<li>Experience with <strong>ViewModel, Data Binding, Jetpack Compose, LiveData, RxJava, Flow, EventBus, Retrofit, Hilt, Room, Gradle, Firebase</strong></li>\n<li>Solid understanding of Android development lifecycle, architecture patterns, asynchronous programming, coroutines, and memory management</li>\n<li>Proficiency in Android Studio, Git, and other development tools</li>\n<li>Experience integrating third-party libraries and APIs</li>\n<li>Familiarity with Agile methodologies and tools like JIRA and Git</li>\n<li>Excellent problem-solving skills and attention to detail</li>\n<li>Strong communication and teamwork abilities</li>\n</ul>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, test, and maintain high-quality Android applications</li>\n<li>Collaborate with project managers, analysts, and developers to meet project requirements</li>\n<li>Write clean, well-documented, efficient, and maintainable code</li>\n<li>Focus on modularization and reusable UI/library components</li>\n<li>Debug and troubleshoot software issues</li>\n<li>Develop unit and integration tests</li>\n<li>Participate in code reviews and provide feedback</li>\n</ul>\n<h3>Preferred:</h3>\n<ul>\n<li>Deep knowledge of <strong>Kotlin</strong> and <strong>Swift</strong></li>\n<li>Experience with <strong>LiveData, Hilt, Retrofit, Firebase</strong></li>\n</ul>\n<h3>About Us:</h3>\n<p>Expressare is a people-first organization committed to investing in employee growth. We foster creativity, innovation, and open communication, offering cutting-edge solutions in software development, mobile apps, cloud computing, and more. Our mission is to transform work and life through technology.</p>\n<p><strong>Website:</strong> <a href=\"https://www.expressare.com\">https://www.expressare.com</a></p>",
        "tags": [
            "2-4 Years",
            "Kotlin",
            "Swift",
            "Retrofit"
        ],
        "summary": "Expressare seeks a Kotlin/Swift Developer with 2-4 years experience to build high-quality mobile apps using Android tools and agile methodologies."
    },
    {
        "job_title": "Sales Executive- IT Sales (Retail billing software / POS solutions)",
        "company": "Xpetize Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26619",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Company</strong>: Xpetize Technology Solutions (P) Ltd\n<strong>Address</strong>: A-10, TBIC, 4th Floor, Nila, Technopark, Kerala, Trivandrum, 695581\n<strong>Website</strong>: <a href=\"http://www.xpetize.com\">http://www.xpetize.com</a>\n<strong>Contact Email</strong>: <a href=\"mailto:careers@xpetize.com\">careers@xpetize.com</a></p>\n<h2>Job Description</h2>\n<p><strong>Job Title</strong>: Sales Executive - IT Sales (Retail billing software / POS solutions)\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 08, Jan 2026\n<strong>Job Location</strong>: Trivandrum\n<strong>Job Nature</strong>: Permanent Position</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Meet or exceed individual sales targets and contribute to the team’s overall sales performance.</li>\n<li>Drive sales initiatives through field visits and direct client engagement at business locations.</li>\n<li>Conduct in-person product demonstrations for retail billing software and its services.</li>\n<li>Identify new sales opportunities via market research, referrals, and networking.</li>\n<li>Provide exceptional customer service, addressing queries and offering solutions.</li>\n<li>Implement sales strategies and participate in promotional events.</li>\n<li>Gather customer feedback for service improvement.</li>\n<li>Maintain accurate records of sales and customer interactions.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Proven experience in field sales (technology/retail solutions preferred).</li>\n<li>Self-starter with strong travel/scheduling management skills.</li>\n<li>Excellent interpersonal and communication skills in English and local languages.</li>\n<li>Ability to negotiate and persuade customers on-site.</li>\n<li>Knowledge of social media marketing strategies and retail operations.</li>\n<li>Valid driver’s license, access to a vehicle, and willingness to travel extensively.</li>\n<li>Familiarity with point-of-sale (POS) systems.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>0-2 Years of experience in sales roles.</li>\n</ul>\n<p><strong>Contact</strong>: For inquiries, email <a href=\"mailto:careers@xpetize.com\">careers@xpetize.com</a>.</p>",
        "tags": [
            "0-2 Years",
            "Retail Billing Software",
            "POS Systems",
            "Social Media Marketing"
        ],
        "summary": "Sales Executive for IT Sales in Trivandrum, focusing on retail billing software and POS solutions. Requires 0-2 years of field sales experience and strong customer engagement skills."
    },
    {
        "job_title": "QA Engineer",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/26618",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Cloud Nautical Solutions India Pvt Ltd\n<strong>Address:</strong> Module No. K12, 2nd Floor, Kabani Building, Technocity, Phase 4, Technopark, Trivandrum, Kerala, India, 695317\n<strong>Website:</strong> <a href=\"https://www.cloudnautical.com\">https://www.cloudnautical.com</a>\n<strong>Closing Date:</strong> 08, Feb 2026\n<strong>Published Date:</strong> 08, Jan 2026\n<strong>Contact Email:</strong> careers@cloudnautical.com</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Creation of test designs, test processes, test cases, and test data.</li>\n<li>Execute testing as per defined procedures.</li>\n<li>Develop and maintain test scripts and automation frameworks for regression testing.</li>\n<li>Report defects and track resolution throughout testing.</li>\n<li>Participate in sprint planning meetings to provide testing input.</li>\n<li>Report bugs using tools and verify bug status updates.</li>\n<li>Conduct functional and regression testing.</li>\n<li>Write release notes.</li>\n<li>Experience with <strong>Selenium (JavaScript)</strong> and <strong>Playwright (JavaScript/TypeScript)</strong> automation tools.</li>\n<li>Experience in <strong>API testing using Postman</strong>.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven manual testing experience for web/mobile applications.</li>\n<li>Knowledge of SDLC and Agile methodologies.</li>\n<li>Strong understanding of software development and test life cycle activities.</li>\n<li>Familiarity with test techniques and software compatibility.</li>\n<li>Excellent organizational skills and attention to detail.</li>\n<li>API testing expertise.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "Selenium (JavaScript)",
            "Playwright (JavaScript/TypeScript)",
            "API Testing (Postman)"
        ],
        "summary": "QA Engineer role requiring automation testing with Selenium/Playwright and API testing using Postman. Responsibilities include test case creation, defect tracking, and Agile collaboration."
    },
    {
        "job_title": "Training & Development Manager",
        "company": "Innovation Incubator Advisory (P) Ltd",
        "url": "https://technopark.org/job-details/26617",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Innovation Incubator Advisory (P) Ltd</h2>\n<p><strong>Module No.421, 4th Floor, Nila Building, Technopark Phase-I Campus, Trivandrum, 695581</strong>\n<a href=\"https://innovationincubator.com\">Visit Website</a></p>\n<h3>Job Title: Training &amp; Development Manager</h3>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 08, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:fannie.na@iinerds.com\">fannie.na@iinerds.com</a></p>\n<h3>Brief Description</h3>\n<p>We seek a <strong>Training &amp; Development (T&amp;D) Manager</strong> with a strong technical background to lead our learning initiatives. This role is not a traditional HR position; it requires someone with expertise in <strong>software development lifecycle</strong>, <strong>cloud infrastructure</strong>, or <strong>technical engineering</strong> to design impactful curricula for our teams.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Curriculum Design:</strong> Create and oversee technical training programs (e.g., coding bootcamps, security workshops, cloud certification paths) tailored to different engineering levels.</li>\n<li><strong>Gap Analysis:</strong> Partner with Department Heads and Tech Leads to identify specific technical skills missing within teams.</li>\n<li><strong>Program Management:</strong> Manage the end-to-end delivery of learning programs, including budget management, vendor selection, and scheduling.</li>\n<li><strong>LMS Management:</strong> Oversee the Learning Management System (LMS) to track employee progress, certifications, and compliance.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Experience:</strong> 3–5 years in <strong>Technical Training</strong>, <strong>Instructional Design</strong>, or <strong>Engineering</strong> with a transition into L&amp;D.</li>\n<li><strong>Technical Proficiency:</strong> Hands-on experience or deep familiarity with <strong>Java</strong>, <strong>AWS</strong>, <strong>Python</strong>, <strong>DevOps</strong>, or <strong>Salesforce</strong>.</li>\n<li><strong>Strategic Thinking:</strong> Ability to align learning objectives with business goals and ROI.</li>\n<li><strong>Communication:</strong> Exceptional presentation and writing skills; ability to explain complex technical concepts to non-technical stakeholders.</li>\n<li><strong>Education:</strong> Bachelor’s degree in any relevant field.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Same as required qualifications (reiterated for emphasis).</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "Java",
            "AWS",
            "Python"
        ],
        "summary": "A Training & Development Manager with technical expertise in software engineering or cloud infrastructure is needed to design and manage technical training programs, aligning learning with business goals."
    },
    {
        "job_title": "Technical Support Executive (Male Candidates Only)",
        "company": "Breeze Brain Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26616",
        "location": "Technopark",
        "closing_date": "13 Jan 2026",
        "job_description": "<p><strong>Breeze Brain Technologies (P) Ltd</strong></p>\n<p><strong>Location:</strong> Module 20, SBC, 2nd Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://www.breezebrain.com\">https://www.breezebrain.com</a>\n<strong>Job Title:</strong> Technical Support Executive (Male Candidates Only)\n<strong>Closing Date:</strong> 13, Jan 2026\n<strong>Published Date:</strong> 08, Jan 2026\n<strong>Contact Email:</strong> careers@breezebrain.com</p>\n<h3><strong>Job Overview</strong></h3>\n<p>Breeze Brain Technologies Pvt Ltd is seeking a dynamic and enthusiastic <strong>Technical Support Executive</strong> to join our growing team. You will serve as the primary point of contact for customers facing technical and software-related issues, delivering prompt and effective support. This role requires strong communication skills, a problem-solving mindset, and a willingness to travel for field assignments.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li><strong>Customer Interaction:</strong> Communicate with customers to understand and diagnose technical/software issues.</li>\n<li><strong>Issue Resolution:</strong> Provide timely solutions and ensure customer satisfaction.</li>\n<li><strong>Collaboration:</strong> Work with internal teams to resolve complex or escalated issues.</li>\n<li><strong>Documentation:</strong> Accurately document all customer interactions, issues, and resolutions for future reference and quality assurance.</li>\n<li><strong>Field Support:</strong> Conduct onsite visits to provide hands-on technical assistance when needed.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>0–2 years of experience in technical support or a similar customer-facing technical role.</li>\n<li>Excellent verbal and written communication in <strong>Tamil, Malayalam, and English</strong>.</li>\n<li>A graduate degree, preferably in <strong>Computer Science, Information Technology</strong>, or related disciplines.</li>\n<li>Young, energetic, and enthusiastic <strong>male candidates</strong> preferred.</li>\n<li>Willingness and ability to travel for onsite technical support.</li>\n<li><strong>Valid driving license</strong> is required.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates who meet the above criteria should email their resume to <strong>careers@breezebrain.com</strong> with the subject line: <strong>“Job Application - Technical Support Executive”</strong>. Note: Applications with a different subject line will not be considered.</p>",
        "tags": [
            "0–2 Years",
            "Technical Support",
            "Customer Service",
            "Field Support"
        ],
        "summary": "Breeze Brain Technologies seeks a Technical Support Executive with 0–2 years of experience, requiring multilingual communication skills and willingness to provide field support. Candidates must have a graduate degree in Computer Science or IT and a valid driving license."
    },
    {
        "job_title": "QA Engineer – Manual & Automation (6+ years experience)",
        "company": "Expressare Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26615",
        "location": "Technopark",
        "closing_date": "07 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Expressare Technologies (P) Ltd</strong>\nSBC - 21, Level -2, Tejaswini , 695581\n<a href=\"https://expressare.com\">Website</a></p>\n<h2>Job Title</h2>\n<p>QA Engineer – Manual &amp; Automation (6+ years experience)</p>\n<h2>Closing Date</h2>\n<p>07, Feb 2026</p>\n<h2>Job Published</h2>\n<p>08, Jan 2026</p>\n<h2>Contact Email</h2>\n<p><a href=\"mailto:bency@expressare.com\">bency@expressare.com</a></p>\n<h2>Job Summary</h2>\n<p>We are seeking a QA Engineer with Manual and Automation testing experience to join our team. The QA Engineer will be responsible for ensuring the quality, reliability, and performance of web and application systems through structured testing processes and automation frameworks. The ideal candidate will have strong analytical skills, attention to detail, and good communication skills (written &amp; oral).</p>\n<h2>Requirements</h2>\n<ul>\n<li>Bachelor’s degree (BCA / BSc / BTech / BE / MCA) in Computer Science, Information Technology, or related fields</li>\n<li><strong>6+ years of experience in Software Testing</strong></li>\n<li>Basic understanding of software testing concepts (SDLC, STLC, Test Cases, Defect Life Cycle)</li>\n<li>Knowledge of at least one programming or scripting language (Java / Python / JavaScript preferred)</li>\n<li>Familiarity with automation tools such as Selenium, Playwright, Cypress, or similar</li>\n<li>Basic knowledge of SQL and databases is an added advantage</li>\n<li>Strong analytical and problem-solving skills</li>\n<li>Good verbal and written communication skills</li>\n</ul>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Understand requirements and prepare test scenarios and test cases</li>\n<li>Perform manual testing of web and application features</li>\n<li>Execute regression, functional, and smoke testing</li>\n<li>Identify, log, and track defects using bug tracking tools</li>\n<li>Develop and maintain basic automation test scripts</li>\n<li>Execute automation test suites and analyze results</li>\n<li>Work closely with developers and product teams to ensure quality deliverables</li>\n<li>Participate in test planning and review meetings</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Knowledge of Agile / Scrum methodology</li>\n<li>Hands-on exposure to test automation frameworks</li>\n<li>Attention to detail and strong documentation skills</li>\n<li>Willingness to learn new tools and technologies</li>\n<li>Good team player with a quality-focused mindset</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>If you meet the requirements and are interested in this exciting opportunity, please submit your resume and cover letter for consideration.</p>",
        "tags": [
            "6+ Years",
            "Selenium",
            "Python",
            "SQL"
        ],
        "summary": "QA Engineer with 6+ years required to ensure quality through manual and automated testing. Must have knowledge of testing frameworks and programming languages like Python/Java."
    },
    {
        "job_title": "Female Customer Care Executive (Trainee)",
        "company": "Integrated Order Automated Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26614",
        "location": "Technopark",
        "closing_date": "18 Jan 2026",
        "job_description": "<h2>About the Company</h2>\n<p>Integrated Order Automated Solutions (P) Ltd is a startup based at Kerala Startup Mission, G3B, Thejaswini, Technopark Rd, Technopark Campus, Karyavattom, Thiruvananthapuram.</p>\n<h2>Position Overview</h2>\n<p><strong>Role</strong>: Female Customer Care Executive (Trainee)\n<strong>Type</strong>: Customer Care Executive Trainee (Pharma Based IT / Software)\n<strong>Experience</strong>: Fresher / 0-6 Months\n<strong>Organization</strong>: Integrated Order Automated Solutions Pvt Ltd\n<strong>Company Location</strong>: Technopark Trivandrum\n<strong>Qualification</strong>: Degree / Diploma\n<strong>Work Hours</strong>: 9AM - 6PM (Monday to Saturday)</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Oversee the sales process to attract new clients.</li>\n<li>Research and identify new market opportunities.</li>\n<li>Generate new business through Phone, WhatsApp, etc.</li>\n<li>Prepare and deliver pitches to potential clients.</li>\n<li>Regular communication with the management to successfully execute the business strategy.</li>\n<li>Excellent PR skills to build long-term relationships with clients.</li>\n<li>Manage the sales process independently.</li>\n</ul>\n<h2>Probation &amp; Growth</h2>\n<ul>\n<li><strong>Probation Period</strong>: 6 Months</li>\n<li><strong>Performance-based Increment</strong>: After probation</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Interested candidates should send their resumes to <strong>ioascareers@gmail.com</strong>.</p>\n<p><strong>Company Website</strong>: <a href=\"http://www.ioas.in\">www.ioas.in</a></p>",
        "tags": [
            "0-6 Months",
            "Pharma IT/Software",
            "Sales Process",
            "Market Research"
        ],
        "summary": "Seeking a Female Customer Care Executive Trainee with 0-6 months experience in Pharma IT/Software to manage sales processes and client relations."
    },
    {
        "job_title": "Assistant Finance Manager",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/26613",
        "location": "Technopark",
        "closing_date": "28 Jan 2026",
        "job_description": "<h2>GENROBOTIC INNOVATIONS (P) Ltd</h2>\n<p><strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a>\n<strong>Contact Email:</strong> career@genrobotics.org\n<strong>Closing Date:</strong> 28, Jan 2026\n<strong>Job Published:</strong> 08, Jan 2026</p>\n<h3>Job Description</h3>\n<p>We are seeking a detail-oriented and experienced <strong>Assistant Finance Manager</strong> to manage end-to-end accounting, statutory compliance, and cash flow operations. The ideal candidate will have strong hands-on experience in accounts payable and receivable management, statutory return preparation and filing, and maintenance of books of accounts in compliance with GAAP. This role requires proficiency in accounting software, advanced Excel skills, and the ability to ensure accurate financial reporting and regulatory compliance. Prior experience in an audit firm will be an added advantage.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Manage end-to-end bookkeeping and Record-to-Report (R2R) activities including journal entries, reconciliations, and month-end/year-end closing.</li>\n<li>Oversee cash flow management, daily fund monitoring, cash flow forecasting, and optimal fund utilization.</li>\n<li>Handle statutory compliances including TDS, GST (GSTR-1, GSTR-3B, GSTR-9), PF, ESI, and Professional Tax filings.</li>\n<li>Manage Accounts Payable (AP): vendor invoice verification, payments, aging analysis, and reconciliations.</li>\n<li>Manage Accounts Receivable (AR): invoicing, collections, customer reconciliations, and aging analysis.</li>\n<li>Maintain books of accounts in compliance with GAAP standards.</li>\n<li>Perform financial statement analysis (P&amp;L, Balance Sheet, Cash Flow) to support management decisions.</li>\n<li>Coordinate with auditors, consultants, and internal stakeholders during audits and reviews.</li>\n<li>Ensure adherence to internal controls, accounting policies, and continuous process improvements.</li>\n</ul>\n<h3>Qualifications &amp; Experience</h3>\n<ul>\n<li><strong>3 years’ experience</strong> with ICWA Inter / ICAI Inter / M.Com / MBA <strong>OR</strong> <strong>5 years’ experience</strong> with B.Com / BBA.</li>\n<li>Preference will be given to candidates with audit firm experience.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Bookkeeping &amp; R2R</strong></li>\n<li><strong>Cash Flow</strong></li>\n<li><strong>Statutory Compliance</strong></li>\n<li><strong>AP Management</strong></li>\n<li><strong>AR Management</strong></li>\n<li><strong>GAAP Accounting</strong></li>\n<li><strong>Financial Analysis</strong></li>\n<li>Proficiency in accounting software such as <strong>Tally Prime</strong>, <strong>Zoho Books</strong>, and <strong>SAP</strong>.</li>\n<li>Advanced <strong>MS Excel</strong> skills (pivot tables, VLOOKUP/XLOOKUP, formulas, reconciliations) and <strong>MS Office</strong> applications.</li>\n<li>Strong verbal communication for coordination with internal teams, auditors, and consultants.</li>\n</ul>\n<h3>Location</h3>\n<p>Technopark, Thiruvananthapuram</p>\n<p><strong>Apply:</strong> [Click here to Apply]</p>",
        "tags": [
            "3-5 Years",
            "Bookkeeping & R2R",
            "Cash Flow",
            "Statutory Compliance"
        ],
        "summary": "Assistant Finance Manager required to manage accounting, statutory compliance, and cash flow operations. Candidates with 3-5 years of experience in accounting and proficiency in financial software are sought."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Cocopalms Tech (P) Ltd",
        "url": "https://technopark.org/job-details/26612",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Company</strong>: Cocopalms Tech (P) Ltd\n<strong>Location</strong>: Carnival, 6th Floor, 695581\n<strong>Website</strong>: <a href=\"https://cocopalms.io\">https://cocopalms.io</a>\n<strong>Job Title</strong>: Business Development Executive\n<strong>Closing Date</strong>: 31, Jan 2026\n<strong>Published Date</strong>: 08, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:aiswarya@cocopalms.io\">aiswarya@cocopalms.io</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a dynamic and results-driven <strong>Business Development Executive</strong> with strong communication skills in <strong>English and Hindi</strong>. The ideal candidate will be responsible for identifying new business opportunities, building client relationships, and driving revenue growth across target markets.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li><strong>Market Research &amp; Lead Generation</strong></li>\n<li>Identify potential clients and business opportunities in target industries.</li>\n<li>\n<p>Conduct market analysis to understand trends and competitor activities.</p>\n</li>\n<li>\n<p><strong>Client Acquisition &amp; Relationship Management</strong></p>\n</li>\n<li>Approach and engage prospective clients through calls, meetings, and presentations.</li>\n<li>\n<p>Build and maintain long-term relationships with clients, ensuring satisfaction and repeat business.</p>\n</li>\n<li>\n<p><strong>Deal Preparation &amp; Execution</strong></p>\n</li>\n<li>Prepare proposals, negotiate, and close deals.</li>\n<li>Collaborate with internal teams to align strategies.</li>\n<li>Track sales activities and report performance.</li>\n</ul>\n<h3><strong>Requirements</strong></h3>\n<ul>\n<li>Bachelor’s degree in Business/Marketing or related field.</li>\n<li><strong>2–4 years</strong> of BD or sales experience.</li>\n<li>Strong communication skills in English &amp; Hindi.</li>\n<li>Proven ability to meet sales targets.</li>\n<li>Proficiency in MS Office and CRM tools.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Experience in <strong>B2B sales &amp; digital marketing</strong></li>\n<li>Excellent communication skills</li>\n<li>Team player</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "B2B Sales",
            "Digital Marketing",
            "CRM Tools"
        ],
        "summary": "Cocopalms Tech seeks a Business Development Executive to drive B2B sales, client acquisition, and relationship management. Requires 2-4 years experience in BD/sales with strong English/Hindi communication skills."
    },
    {
        "job_title": "Presales Coordinator",
        "company": "Cocopalms Tech (P) Ltd",
        "url": "https://technopark.org/job-details/26611",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2><strong>Cocopalms Tech (P) Ltd</strong></h2>\n<p><strong>Location:</strong> Trivandrum\n<strong>Job Type:</strong> Full-time (aligned to Middle East time zone)\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Contact Email:</strong> aiswarya@cocopalms.io</p>\n<h3><strong>Job Position:</strong> Pre-Sales Coordinator</h3>\n<h3><strong>Qualification &amp; Experience</strong></h3>\n<ul>\n<li>Bachelor's or Master's degree in Business Administration (BBA or MBA) from a recognized institution. Basic education from Gulf countries is preferred.</li>\n<li>Minimum of <strong>3-5 years</strong> of proven experience in sales/marketing roles. Female candidates are preferred.</li>\n</ul>\n<h3><strong>Skills Required</strong></h3>\n<ul>\n<li>Excellent verbal and written communication skills.</li>\n<li>Proficient in delivering impactful presentations.</li>\n<li>Good professional and presentable appearance.</li>\n<li>Ability to employ consultative selling techniques.</li>\n<li>Solid understanding of software concepts, particularly in the <strong>ERP domain</strong>.</li>\n<li>Ability to collaborate across departments.</li>\n<li>Adaptability and flexibility.</li>\n<li>Good understanding of the <strong>Middle Eastern market</strong>.</li>\n<li>Strong time management, logical thinking, and decision-making skills.</li>\n</ul>\n<h3><strong>Duties &amp; Responsibilities</strong></h3>\n<ul>\n<li>Conduct in-depth client discussions to understand business processes and requirements.</li>\n<li>Map client needs to <strong>1O1 suit ERP</strong> functionalities.</li>\n<li>Provide pre-sales support for leads and prepare engaging ERP presentations.</li>\n<li>Ensure monthly customer acquisition targets.</li>\n<li>Customize presentations to client-specific needs.</li>\n<li>Stay updated on ERP system features and updates.</li>\n<li>Collaborate with marketing for pre-sales activities.</li>\n<li>Schedule and coordinate demo sessions, ensuring resource allocation and calendar updates.</li>\n<li>Address client queries during/after demos and gather feedback for improvement.</li>\n<li>Facilitate technical training post-implementation.</li>\n<li>Prepare accurate quotations and sales orders.</li>\n<li>Maintain client interaction records and stay informed on industry trends and Middle Eastern market dynamics.</li>\n<li>Perform other assigned tasks by management.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Excellent verbal and written communication.</li>\n<li>Proficient in impactful presentations.</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "ERP (1O1 suit)",
            "Presentation Skills",
            "Middle Eastern Market"
        ],
        "summary": "Pre-sales Coordinator role requiring 3-5 years of sales experience, ERP domain knowledge, and Middle Eastern market expertise. Responsibilities include client engagement, demo coordination, and lead conversion."
    }
]