[
    {
        "job_title": "Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21488/312",
        "location": "Infopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<p><strong>Business Analyst\nJob Description</strong></p>\n<p>The Business Analyst plays a key role in ensuring requirements are clearly understood, accurately documented, and traceable throughout the software development lifecycle. This role focuses on translating business and functional inputs into structured, standardized documentation that supports effective development, testing, and delivery. Working closely with business analysts, design teams, and technical stakeholders, the role ensures consistency, clarity, and alignment across all requirement artifacts.</p>\n<p><strong>Key Responsibilities</strong>\n- Create Software Requirement Specifications (SRS) based on inputs from Core Business Analysts, stakeholder discussions, and requirement walkthroughs\n- Prepare Business Requirement Documents (BRD) using approved templates while ensuring business intent and system behavior are clearly documented\n- Participate in requirement discussions to understand business objectives, functional flows, dependencies, and assumptions before documentation\n- Analyze requirements to identify gaps, ambiguities, and inconsistencies, and work with Core BAs to resolve them\n- Document functional flows, business rules, and acceptance criteria where applicable to support development and QA teams\n- Document wireframes, UI flows, validations, and UI specifications in collaboration with design and product teams\n- Maintain change logs, version history, and document updates throughout the project lifecycle\n- Create and manage traceability matrices linking business, functional, and technical requirements\n- Maintain cross-references across BRD, SRS, UI, API, and related documentation\n- Ensure documentation consistency, completeness, and alignment with approved scope and delivery timelines\n- Ensure accurate and timely PMS updates with structured documentation details\n- Support development, QA, UAT, and audit processes through clear, traceable, and up-to-date documentation\n- Assist in requirement reviews, walkthroughs, and validation sessions with internal and client stakeholders</p>\n<p><strong>Requirements</strong>\n<strong>Required Skills and Experience</strong>\n- 2 to 5 years of experience in Business Analysis documentation or related roles\n- Strong experience in BRD and SRS creation\n- Hands-on experience with documentation templates, standards, and version control\n- Ability to document UI wireframes and functional flows clearly\n- Working knowledge of APIs and system integrations for documentation purposes\n- Experience with project management systems and documentation tools\n- Strong attention to detail and ability to manage multiple documents in parallel\n- Excellent written communication and stakeholder coordination skills</p>\n<p><strong>Minimum Qualifications</strong>\n- Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field\n- 2 to 5 years of experience as a Business Analyst or Product Analyst</p>\n<p><strong>Benefits</strong>\n- A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</p>\n<p><strong>Contact</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-5 Years",
            "BRD/SRS Creation",
            "UI Wireframes",
            "API Documentation"
        ],
        "summary": "Translates business needs into structured documentation for software development. Ensures clarity, traceability, and alignment across teams."
    },
    {
        "job_title": "Business Analyst",
        "company": "Difinity Digital",
        "url": "https://infopark.in/company-jobs/details/21500/495",
        "location": "Infopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<p><strong>Business Analyst</strong></p>\n<p>We are seeking a dynamic and detail-oriented Business Analyst with <strong>5+ years of experience</strong>, ideally with international client handling. The candidate should possess strong skills in requirement gathering and documentation, particularly using <strong>BPMN</strong> tools.</p>\n<p><strong>Key Responsibilities:</strong>\n- Interact with international clients to gather and understand business requirements.\n- Translate business needs into clear, actionable functional specifications.\n- Create detailed documentation using industry-standard tools such as BPMN.\n- Work closely with development and QA teams to ensure requirements are understood and delivered effectively.\n- Support UAT and help align deliverables with business expectations.</p>\n<p><strong>Required Skills and Experience:</strong>\n- 5+ years of experience as a Business Analyst.\n- Strong experience in client communication, especially with international clients.\n- Proven ability in business documentation and process modeling using BPMN tools or equivalents.\n- Excellent communication, analytical thinking, and stakeholder management skills.</p>\n<p><strong>Good to Have (Not Mandatory):</strong>\n- Exposure to domains such as Finance, ERP, AI, RPA, or Data Analytics.</p>\n<p><strong>Notice Period:</strong> Immediate joiners or candidates with a notice period of up to 15 days are preferred.</p>\n<p><strong>Contact:</strong> For inquiries, share your updated resume at <strong>mitty.j@difinitydigital.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "BPMN",
            "Client Communication",
            "Business Documentation"
        ],
        "summary": "Seeking a Business Analyst with 5+ years of experience in international client handling and BPMN process modeling to translate business needs into functional specifications."
    },
    {
        "job_title": "Business Analyst /Project Coordinator",
        "company": "Voyon Technology Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21503/372",
        "location": "Infopark",
        "closing_date": "06 Jan 2026",
        "job_description": "<p><strong>Job Summary</strong></p>\n<p>We are seeking a dynamic and detail-oriented <strong>Business Analyst / Project Coordinator</strong> to join our team. This hybrid role is ideal for professionals who are skilled in gathering and analyzing business requirements while also possessing strong project coordination capabilities.</p>\n<p><strong>Key Responsibilities</strong></p>\n<h3>Business Analysis</h3>\n<ul>\n<li>Gather, analyze, and document business requirements from stakeholders.</li>\n<li>Prepare functional specifications, use cases, and process flows.</li>\n<li>Conduct gap analysis between business needs and existing systems.</li>\n<li>Facilitate workshops, interviews, and meetings with clients and internal teams.</li>\n<li>Support UAT (User Acceptance Testing) and help stakeholders validate requirements.</li>\n</ul>\n<h3>Project Coordination</h3>\n<ul>\n<li>Assist in planning, scheduling, and coordinating project activities.</li>\n<li>Monitor project progress and report on milestones, risks, and issues.</li>\n<li>Maintain project documentation including status reports, meeting minutes, and project plans.</li>\n<li>Coordinate with cross-functional teams to ensure smooth project delivery.</li>\n<li>Serve as a single point of contact for project communication among stakeholders.</li>\n</ul>\n<p><strong>Required Qualifications</strong>\n- Bachelor's degree in Business Administration, Information Technology, or related field.\n- 1+ years of experience in a Business Analyst and/or Project Coordinator role.\n- Strong understanding of project management methodologies (Agile/Scrum/Waterfall).\n- Proficient in tools like Azure DevOps, MS Project, or similar.\n- Excellent verbal and written communication skills.</p>\n<p><strong>Contact Information</strong>\n- For the latest updates on job opportunities, follow our company LinkedIn page: <a href=\"https://www.linkedin.com/company/voyontechnologyservices\">https://www.linkedin.com/company/voyontechnologyservices</a>\n- If this opportunity aligns with your career goals, kindly share your updated resume with us at <a href=\"mailto:careers@voyon.net\">careers@voyon.net</a></p>",
        "tags": [
            "1+ Years",
            "Azure DevOps",
            "MS Project",
            "Agile/Scrum/Waterfall"
        ],
        "summary": "Dynamic role requiring business analysis and project coordination skills with expertise in Azure DevOps and Agile methodologies. Supports UAT and cross-functional team collaboration for project delivery."
    },
    {
        "job_title": "Senior JavaScript Full Stack Developer",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/21480/4",
        "location": "Infopark",
        "closing_date": "09 Jan 2026",
        "job_description": "<h2>Senior JavaScript Full Stack Developer</h2>\n<h3>Overview</h3>\n<p>We are seeking an experienced <strong>Senior JavaScript Full Stack Developer</strong> to join our team. You will collaborate with business owners to transform ideas into clear technical tasks and deliver reliable, scalable solutions. Both frontend and backend development will be done in <strong>TypeScript</strong>.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain full-stack applications using JavaScript and TypeScript (TDD)</li>\n<li>Build and maintain frontend and backend systems</li>\n<li>Work closely with business owners to understand requirements and translate them into technical tasks</li>\n<li>Refine and clarify business ideas into well-defined technical solutions</li>\n<li>Design and optimize database schemas and queries using <strong>MySQL</strong></li>\n<li>Write clean, maintainable, and well-documented code</li>\n<li>Review code, troubleshoot issues, and improve existing systems</li>\n<li>Collaborate with developers and stakeholders to deliver features on time</li>\n</ul>\n<h3>Required Skills and Experience</h3>\n<ul>\n<li>Strong knowledge of <strong>JavaScript</strong></li>\n<li>Hands-on experience with <strong>TypeScript</strong> for both frontend and backend development</li>\n<li>Proven experience as a <strong>Full Stack Developer</strong></li>\n<li>Solid understanding of <strong>MySQL</strong>, including database design and query optimization</li>\n<li>Solid understanding of web application architecture</li>\n<li>Ability to break down business requirements into technical tasks</li>\n<li>Strong problem-solving and analytical skills</li>\n</ul>\n<h3>Desired Skills</h3>\n<ul>\n<li>Experience with modern JavaScript frameworks and libraries</li>\n<li>Familiarity with backend frameworks and APIs</li>\n<li>Experience in agile or fast-paced environments</li>\n<li>Experience with <strong>Nest JS</strong> and <strong>Python</strong></li>\n<li>Mentorship and collaborative mindset</li>\n</ul>\n<h3>Communication &amp; Soft Skills</h3>\n<ul>\n<li>Strong English speaking and writing skills (required)</li>\n<li>Good listener with the ability to understand business needs</li>\n<li>Proactive mindset with attention to detail</li>\n<li>Comfortable working directly with business owners and stakeholders</li>\n</ul>\n<h3>What We Value</h3>\n<ul>\n<li>Clear communication over assumptions</li>\n<li>Ownership and accountability</li>\n<li>Willingness to suggest better solutions</li>\n<li>Practical, business-focused development approach</li>\n</ul>\n<h3>Contact</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>anjana.s@arttechgroup.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "JavaScript",
            "TypeScript",
            "MySQL"
        ],
        "summary": "Senior JavaScript Full Stack Developer needed to design scalable solutions using TypeScript and MySQL, collaborating with business owners to translate requirements into technical tasks."
    },
    {
        "job_title": "Associate Vice President – Technology",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21484/41",
        "location": "Infopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<p><strong>Associate Vice President – Technology</strong></p>\n<p>We are seeking an experienced <strong>Associate Vice President / Technical Lead</strong> with <strong>strong .NET expertise</strong> to lead software projects end-to-end, manage development teams, and serve as a key client-facing stakeholder.</p>\n<p><strong>Key Responsibilities:</strong>\n- Own end-to-end delivery of .NET-based application projects\n- Lead and mentor development teams\n- Provide technical guidance, code reviews, and solution oversight\n- Act as the primary point of contact for clients, ensuring high customer satisfaction\n- Manage timelines, risks, and delivery quality</p>\n<p><strong>Required Experience:</strong>\n- <strong>8 - 10+ years</strong> in software development with strong <strong>.NET / C#</strong> experience\n- Hands-on knowledge of <strong>ASP.NET / .NET Core, Web APIs, SQL Server</strong>\n- Proven experience managing teams and client engagements\n- Strong communication and stakeholder management skills</p>\n<p><strong>Nice to Have:</strong>\n- <strong>Azure / Cloud</strong> exposure\n- <strong>Agile / Scrum</strong> experience\n- <strong>IT services</strong> or offshore delivery background</p>\n<p><strong>Contact:</strong> Share your resume at <strong>career@lucidplus.com</strong></p>",
        "tags": [
            "8 - 10+ Years",
            ".NET / C#",
            "ASP.NET / .NET Core",
            "SQL Server"
        ],
        "summary": "Lead .NET projects and teams, ensuring client satisfaction and technical excellence with 8-10+ years of experience required."
    },
    {
        "job_title": ".NET Project Lead",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21485/41",
        "location": "Infopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<p><strong>.NET Project Lead</strong></p>\n<p>We are seeking an experienced <strong>.NET Project Lead</strong> to oversee project execution, guide development teams, and manage client interactions. This <strong>contract-based role</strong> requires strong technical expertise, excellent communication skills, and the ability to handle end-to-end project management.</p>\n<p><strong>Key Responsibilities:</strong>\n- Lead and mentor a .NET development team and oversee project workflows\n- Manage client interactions, including requirement gathering, clarifications, demos, and status updates\n- Translate client expectations into clear technical tasks for the team\n- Design and develop applications using <strong>.NET / .NET Core</strong>\n- Develop and optimize <strong>Web APIs</strong> and ensure smooth integration with front-end applications\n- Conduct code reviews and enforce coding standards and best practices\n- Collaborate with <strong>QA, UI/UX, and product teams</strong> throughout the SDLC\n- Troubleshoot complex technical issues and ensure timely resolution\n- Work with <strong>MSSQL/MySQL</strong> and write efficient, optimized queries\n- Prepare clear technical documentation and project reports</p>\n<p><strong>Requirements:</strong>\n- <strong>4+ years</strong> of experience working with <strong>C#, .NET Framework / .NET Core</strong>\n- Proven experience leading small teams or development modules\n- Strong knowledge of <strong>Web API development</strong> and <strong>Entity Framework</strong>\n- Excellent communication and client-handling skills\n- Strong understanding of <strong>OOP, design patterns</strong>, and clean coding principles\n- Ability to manage timelines, priorities, and delivery quality\n- Knowledge of <strong>Angular</strong> is an added advantage\n- Experience in <strong>contract-based</strong> or fast-paced project environments is a plus</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>career@lucidplus.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "C#",
            ".NET Core",
            "Web API"
        ],
        "summary": "Lead .NET development teams, manage client projects, and ensure technical excellence in a contract-based environment."
    },
    {
        "job_title": "PHP Developer (2+ Years Experience)",
        "company": "Virtual Sys Technologies",
        "url": "https://infopark.in/company-jobs/details/21504/81",
        "location": "Infopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<h2>PHP Developer (2+ Years Experience)</h2>\n<p>We are looking for a talented and dedicated PHP Developer to join our development team.</p>\n<h3>Requirements:</h3>\n<ul>\n<li>Minimum <strong>2 years</strong> of professional experience in PHP development</li>\n<li>Strong knowledge of <strong>Core PHP</strong></li>\n<li>Hands-on experience with the <strong>CodeIgniter Framework</strong></li>\n<li>Ability to learn and work with new and emerging technologies</li>\n<li>Experience in developing dynamic websites and web applications</li>\n<li>Good understanding of databases (<strong>MySQL/MongoDB</strong>) and <strong>MVC architecture</strong></li>\n<li>Strong problem-solving skills and attention to detail</li>\n<li>Ability to work both independently and in a team environment</li>\n</ul>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, test, and maintain web applications</li>\n<li>Work closely with designers and project managers to deliver high-quality solutions</li>\n<li>Optimize applications for performance, security, and scalability</li>\n<li>Follow best coding practices and documentation standards</li>\n</ul>\n<h3>Work Location:</h3>\n<ul>\n<li><strong>Infopark, Cherthala</strong></li>\n<li>Preference: Candidates residing nearby will be given priority</li>\n<li><strong>Immediate joiners (zero notice period)</strong> are strongly preferred</li>\n</ul>\n<h3>Application Details:</h3>\n<ul>\n<li>Apply directly via our job portal here: <a href=\"Apply Here\">Apply Here</a></li>\n<li>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>jobs2025@virtualsystechnologies.com</strong></li>\n</ul>",
        "tags": [
            "2+ Years",
            "Core PHP",
            "CodeIgniter Framework",
            "MySQL/MongoDB"
        ],
        "summary": "Seeking a PHP Developer with 2+ years experience in CodeIgniter and databases to build dynamic web applications in Infopark, Cherthala. Candidates with immediate availability preferred."
    },
    {
        "job_title": "Senior Solution Architect / Principal Solution Architect",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21505/85",
        "location": "Infopark",
        "closing_date": "13 Jan 2026",
        "job_description": "<p><strong>Senior Solution Architect / Principal Solution Architect</strong></p>\n<p><strong>About Techversant</strong>\nTechversant is a global technology services and solutions company with 17+ years of experience delivering end-to-end IT solutions. We specialize in Digital Transformation, emerging technologies, and industry-specific solutions across domains like ColdFusion, Python, Java, .NET, AI, Blockchain, and mobile development (iOS, Android, Flutter, React Native, Angular, React, Vue).</p>\n<p><strong>What’s Important to Us</strong>\nWe seek a <strong>highly experienced Solution Architect</strong> to serve as a technical authority for complex engineering challenges. This role demands expertise in multiple programming languages, architecture styles, cloud platforms, and AI-driven solutions. The ideal candidate will collaborate with engineering and leadership teams to design scalable, secure, and future-ready systems.</p>\n<p><strong>Experience Required</strong>\n- <strong>10–15 years</strong> of software engineering and architecture experience</p>\n<p><strong>Key Responsibilities</strong>\n- <strong>Architecture &amp; Design</strong>: Define end-to-end architecture for mission-critical systems using microservices, event-driven, serverless, and modernization patterns. Apply design patterns and enterprise integration principles.\n- <strong>Technical Leadership</strong>: Mentor senior engineers, review designs (HLD/LLD), and drive architectural governance.\n- <strong>Cloud &amp; Platform Engineering</strong>: Design solutions on AWS, Azure, GCP; guide containerization, orchestration (Kubernetes), CI/CD, and Infrastructure as Code (Terraform, CloudFormation).\n- <strong>Emerging Technologies</strong>: Evaluate and recommend adoption of new technologies aligned with business value.\n- <strong>Collaboration</strong>: Translate business requirements into technical solutions, communicate complex concepts to stakeholders.</p>\n<p><strong>Technical Requirements</strong>\n- <strong>Programming Languages</strong>: Java, Python, C#, JavaScript/TypeScript, React, Angular\n- <strong>Architecture &amp; Patterns</strong>: Distributed systems, API-first design, DDD, messaging/event streaming\n- <strong>Cloud &amp; DevOps</strong>: AWS/Azure/GCP, Docker, CI/CD pipelines, secure API design\n- <strong>Security &amp; Reliability</strong>: IAM, encryption, compliance, resilient system design</p>\n<p><strong>Soft Skills &amp; Leadership</strong>\n- Recognized problem solver and technical authority\n- Strong analytical, decision-making, and communication skills</p>\n<p><strong>What We Offer</strong>\n- Excellent career growth and exposure to cutting-edge technologies\n- Fixed weekday schedule (weekends off)\n- Family medical insurance, unique leave benefits, and performance-based encashment\n- Long-term growth opportunities, flexible work timings, early-out Fridays\n- Employee rewards, bonus programs for training/certifications/innovation\n- Company-sponsored international tours and work-life balance initiatives</p>\n<p><strong>Contact</strong>: Share your resume at <strong>careers@techversantinfotech.com</strong></p>",
        "tags": [
            "10–15 Years",
            "Cloud Platforms (AWS/Azure/GCP)",
            "Microservices Architecture",
            "Design Patterns"
        ],
        "summary": "Lead technical architecture for scalable systems with 10-15 years of experience in cloud, microservices, and design patterns. Techversant offers global exposure, career growth, and competitive benefits."
    },
    {
        "job_title": "Content Writer Intern (Accounting Background)",
        "company": "Difinity Digital",
        "url": "https://infopark.in/company-jobs/details/21481/495",
        "location": "Infopark",
        "closing_date": "14 Jan 2026",
        "job_description": "<h2>Content Writer Intern (Accounting Background)</h2>\n<p>We’re seeking a <strong>Content Writer Intern</strong> with an <strong>accounting background</strong> to create engaging content across formats while ensuring accounting accuracy. This role is ideal for someone who can simplify complex accounting concepts into accessible, compelling content.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Create content across multiple formats, including:</li>\n<li>Social media content (especially LinkedIn)</li>\n<li>Blogs and long-form articles</li>\n<li>Brand collaterals and explainers as required</li>\n<li>Research accounting, finance, compliance, and business topics</li>\n<li>Translate accounting concepts into easy-to-understand content</li>\n<li>Align content with Praszo’s brand tone and messaging</li>\n<li>Collaborate with internal teams to ensure accuracy and consistency</li>\n<li>Edit and refine content based on feedback</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Background in <strong>Accounting, Commerce, Finance</strong>, or related fields</li>\n<li>Strong interest in <strong>content writing</strong> and communication</li>\n<li>Solid understanding of <strong>accounting basics</strong></li>\n<li>Clear, structured <strong>writing skills</strong></li>\n<li>Ability to research and present information accurately</li>\n<li><strong>Attention to detail</strong> and willingness to learn</li>\n</ul>\n<h3>Preferred (Not Mandatory)</h3>\n<ul>\n<li>Experience writing blogs or social media posts</li>\n<li>Familiarity with finance/business content</li>\n<li>Basic understanding of <strong>SEO</strong> or content planning</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Hands-on experience creating real finance/accounting content</li>\n<li>Exposure to long-form, blog, and social media writing</li>\n<li>A strong writing portfolio across formats</li>\n<li>Opportunity to work with a growing brand</li>\n<li>Potential to transition into a <strong>full-time role</strong> based on performance</li>\n</ul>\n<p><strong>Contact</strong>: varsha.m@difinitydigital.com</p>",
        "tags": [
            "Entry Level",
            "Accounting",
            "Content Writing",
            "Research"
        ],
        "summary": "Accounting-focused content writer intern to create finance-related content. Opportunity for full-time role with performance-based growth."
    },
    {
        "job_title": "Content Writer Intern",
        "company": "Difinity Digital",
        "url": "https://infopark.in/company-jobs/details/21482/495",
        "location": "Infopark",
        "closing_date": "14 Jan 2026",
        "job_description": "<p><strong>Content Writer Intern</strong></p>\n<p>We’re seeking a <strong>Content Writer Intern</strong> with an engineering background who is passionate about researching technology and staying updated with industry trends. This role is ideal for engineering students or fresh graduates who enjoy learning, reading, and simplifying complex technical concepts.</p>\n<p><strong>What You’ll Mainly Do</strong>\n- Research the latest advancements in <strong>AI, automation, data, and analytics</strong>\n- Track industry trends, competitors, and emerging tools/solutions\n- Convert insights into <strong>blog drafts, short articles, content outlines</strong>, and <strong>simple explanations</strong> for websites/social media\n- Collaborate with product, engineering, and marketing teams to ensure technical accuracy\n- Support the content team with fact-checking and background research</p>\n<p><strong>What We’re Looking For</strong>\n- Engineering background (CS, IT, AI, Data Science, Electronics, or similar)\n- Strong interest in technology and current trends\n- Excellent research and reading skills\n- Ability to explain technical topics clearly\n- Basic writing skills with a willingness to improve\n- Curious mindset and attention to detail</p>\n<p><strong>Good to Have</strong>\n- Habit of following tech news, blogs, or product updates\n- Writing samples, notes, or personal tech summaries\n- Basic familiarity with AI or automation concepts</p>\n<p><strong>What You’ll Gain</strong>\n- Exposure to real-world AI and automation projects\n- Enhanced research and technical understanding skills\n- Experience working with product/engineering teams\n- Content for your portfolio\n- Potential for a full-time role based on performance</p>\n<p><strong>Contact:</strong> Share your resume at <strong>varsha.m@difinitydigital.com</strong></p>",
        "tags": [
            "0-1 Years",
            "AI",
            "Automation",
            "Data Analytics"
        ],
        "summary": "Engineering-focused intern to research tech trends and create simplified content. Gain AI/automation project experience and portfolio-building opportunities."
    },
    {
        "job_title": "Business Development Executive (IT Sales)",
        "company": "Virtual Sys Technologies",
        "url": "https://infopark.in/company-jobs/details/21483/81",
        "location": "Infopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>About the Role</h2>\n<p>We are seeking an ambitious and results-driven <strong>Business Development Executive (BDE)</strong> with prior experience in <strong>IT Sales</strong>. The ideal candidate must possess strong <strong>English and Hindi communication skills</strong> and a proven track record of closing deals within the first month of joining.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Conduct market research and global lead generation</li>\n<li>Utilize multiple lead generation and outreach tools</li>\n<li>Execute expert-level email campaigns and maintain daily lead databases</li>\n<li>Demonstrate excellent English communication (written &amp; spoken)</li>\n<li>Mandatory experience in <strong>IT / ITES sales</strong></li>\n<li>Ability to work across time zones and handle high-pressure environments</li>\n<li>Results-driven with a proactive \"get-it-done\" mindset</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Only candidates with relevant <strong>IT Sales experience</strong> should apply. Apply directly via our job portal here: <a href=\"Apply Here\">Apply Here</a>. If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>jobs2025@virtualsystechnologies.com</strong>.</p>",
        "tags": [
            "2-4 Years",
            "IT Sales",
            "Lead Generation",
            "Email Campaigns"
        ],
        "summary": "Seeking a results-driven Business Development Executive with IT Sales experience to generate leads and close deals. Requires strong communication, lead generation skills, and ability to work across time zones."
    },
    {
        "job_title": "Jr. Marketing Manager",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/21499/4",
        "location": "Infopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Job Title: Jr. Marketing Manager</h2>\n<p><strong>Location:</strong> Kochi\n<strong>Job Type:</strong> Full-time\n<strong>Mode:</strong> Remote</p>\n<h3>Job Summary:</h3>\n<p>We are seeking a hands-on and experienced Jr. Marketing Manager with <strong>1-3 years of experience</strong> to drive our marketing efforts. This role will involve executing campaigns, content creation, managing relationships with marketing freelancers, and setting up infrastructure to bring in inbound leads. The ideal candidate is someone who is into execution and has had exposure to managing field marketing initiatives such as trade shows, and collaborating closely with top management, sales, delivery heads, and project heads to align marketing strategies with business objectives.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in developing and implementing marketing plans and campaigns across digital channels.</li>\n<li>Support day-to-day execution of activities such as email campaigns, social media posts, and website updates.</li>\n<li>Write engaging content for blogs, social media, websites, and marketing collateral.</li>\n<li>Research industry topics and help maintain consistent messaging across channels.</li>\n<li>Coordinate with design, content, and marketing freelancers.</li>\n<li>Ensure timely delivery and quality of outsourced work.</li>\n<li>Support planning and execution of trade shows, conferences, and promotional events.</li>\n<li>Help with booth coordination, logistics, and on-ground marketing activities.</li>\n<li>Assist in setting up landing pages, forms, and basic CRM workflows for lead capture.</li>\n<li>Work with the senior team to improve conversion paths and track incoming leads.</li>\n<li>Monitor campaign performance and maintain weekly/monthly marketing dashboards.</li>\n<li>Use analytics tools to track traffic, engagement, and lead generation.</li>\n<li>Work with sales and delivery heads to support ongoing marketing initiatives.</li>\n<li>Ensure alignment between marketing activities and business priorities.</li>\n<li>Help maintain brand guidelines across all marketing outputs.</li>\n<li>Support content reviews and quality checks to ensure brand consistency.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in Engineering, Marketing, Business Administration, or related field.</li>\n<li><strong>1-3 years of experience</strong> in marketing Execution roles.</li>\n<li>Basic understanding of SEO/SEM, social media marketing, and email marketing.</li>\n<li>Exposure to working with AI tools for building landing pages, design activities, content curation, and marketing automation campaigns.</li>\n<li>Good writing skills and ability to create clear, engaging content.</li>\n<li>Good communication skills and willingness to work closely with cross-functional teams.</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>jamshiya@arttechgroup.com</strong>.</p>",
        "tags": [
            "1-3 Years",
            "SEO/SEM",
            "Social Media Marketing",
            "Email Marketing"
        ],
        "summary": "Jr. Marketing Manager needed for campaign execution, content creation, and event coordination with 1-3 years of digital marketing experience."
    },
    {
        "job_title": "DevOps Engineer (Platform & Infrastructure – E-Invoicing & Integration Solutions)",
        "company": "Difinity Digital",
        "url": "https://infopark.in/company-jobs/details/21501/495",
        "location": "Infopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<h2>DevOps Engineer (Platform &amp; Infrastructure – E-Invoicing &amp; Integration Solutions)</h2>\n<p>We are seeking a proactive and technically skilled DevOps Engineer to support and manage the infrastructure and platforms powering our E-Invoicing and Integration Solutions. The role focuses on ensuring system stability, automation, monitoring, and secure deployments across development, testing, and production environments. The ideal candidate will work closely with development, QA, security, and support teams to enable reliable application delivery while maintaining high availability and operational efficiency in compliance with UAE regulatory and interoperability requirements.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Infrastructure &amp; Platform Operations</strong></li>\n<li>Support and maintain Linux-based infrastructure across multiple environments.</li>\n<li>Ensure availability, reliability, and performance of application and platform services.</li>\n<li>Assist in capacity planning, resource utilization, and performance optimization.</li>\n<li>\n<p>Perform routine system maintenance, patching, and upgrades.</p>\n</li>\n<li>\n<p><strong>CI/CD &amp; Deployment Support</strong></p>\n</li>\n<li>Implement and maintain automated build and deployment pipelines.</li>\n<li>Support application deployments, releases, rollbacks, and configuration changes.</li>\n<li>Collaborate with development teams to streamline deployment workflows.</li>\n<li>\n<p>Ensure consistency across development, testing, staging, and production environments.</p>\n</li>\n<li>\n<p><strong>Containerization &amp; Automation</strong></p>\n</li>\n<li>Deploy and manage containerized applications.</li>\n<li>Support container lifecycle management and image versioning.</li>\n<li>Assist in automating operational tasks using scripts and DevOps tools.</li>\n<li>\n<p>Promote infrastructure and deployment best practices.</p>\n</li>\n<li>\n<p><strong>Monitoring, Troubleshooting &amp; Incident Management</strong></p>\n</li>\n<li>Monitor system performance, availability, and logs.</li>\n<li>Proactively identify and resolve infrastructure or application issues.</li>\n<li>Participate in incident response, root cause analysis, and corrective actions.</li>\n<li>\n<p>Track incidents and service requests through a ticketing or ITSM process.</p>\n</li>\n<li>\n<p><strong>Security, Compliance &amp; Operational Readiness</strong></p>\n</li>\n<li>Apply infrastructure-level security controls and access management.</li>\n<li>Support secure data exchange and platform compliance requirements.</li>\n<li>Assist with backup, restore, and disaster recovery processes.</li>\n<li>Maintain operational documentation, runbooks, and standard procedures.</li>\n</ol>\n<h3>Qualifications &amp; Experience</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field.</li>\n<li><strong>4 years plus</strong> of experience in DevOps, Infrastructure, or System Administration roles.</li>\n<li>Hands-on experience with Linux environments.</li>\n<li>Exposure to CI/CD pipelines, container platforms, and automation tools.</li>\n<li>Basic understanding of cloud platforms (Azure/AWS) is an advantage.</li>\n<li>Experience supporting production environments is mandatory.</li>\n<li>Familiarity with integration platforms or API-based systems is a plus.</li>\n<li>Awareness of E-Invoicing or regulatory platforms is beneficial.</li>\n</ul>\n<h3>Key Competencies</h3>\n<ul>\n<li>Strong troubleshooting and problem-solving skills.</li>\n<li>Understanding of DevOps principles and operational best practices.</li>\n<li>Ability to work across multiple environments and priorities.</li>\n<li>Detail-oriented with a focus on system reliability and uptime.</li>\n<li>Good communication and collaboration skills.</li>\n<li>Willingness to learn and adapt to evolving technologies and platforms.</li>\n</ul>\n<h3>Preferred Certifications</h3>\n<ul>\n<li>Docker or Kubernetes Fundamentals (advantage).</li>\n<li>Cloud Fundamentals – Azure / AWS (preferred).</li>\n<li>Linux Administration Certification (advantage).</li>\n<li>ITIL Foundation or equivalent (preferred).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>mitty.j@difinitydigital.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "Linux",
            "CI/CD",
            "Containerization"
        ],
        "summary": "A DevOps Engineer is needed to manage infrastructure and platforms for E-Invoicing solutions, ensuring system stability, automation, and compliance. Requires 4+ years of DevOps experience with Linux, CI/CD, and containerization skills."
    },
    {
        "job_title": "International Telesales Intern",
        "company": "Difinity Digital",
        "url": "https://infopark.in/company-jobs/details/21502/495",
        "location": "Infopark",
        "closing_date": "16 Jan 2026",
        "job_description": "<p><strong>International Telesales Intern</strong></p>\n<p>We are seeking a dynamic and results-driven <strong>International Telesales Intern</strong> with <strong>0–6 months of telesales experience</strong>, preferably in international or cross-border markets. The role involves selling products or services over the phone to international clients, building strong customer relationships, and contributing to revenue growth.</p>\n<p><strong>Internship Duration</strong>: 3 Months</p>\n<p><strong>Key Responsibilities</strong>:\n- Make high-volume outbound calls to international prospects and clients.\n- Promote and sell company products/services to global customers.\n- Understand customer needs and provide tailored solutions.\n- Follow up on leads generated through marketing campaigns, referrals, and other channels.\n- Meet and exceed monthly and quarterly sales targets.\n- Handle objections, close sales, and ensure customer satisfaction.\n- Maintain accurate and detailed records of all calls, conversations, and sales activities in CRM systems.\n- Coordinate with marketing, support, and operations teams to ensure smooth customer onboarding and service delivery.\n- Stay updated on product knowledge, market trends, and competitor offerings.</p>\n<p><strong>Requirements</strong>:\n- <strong>0–6 months of telesales experience</strong>, preferably handling international clients.\n- Strong command of spoken and written English; Arabic or additional languages are a plus.\n- Excellent communication, negotiation, and interpersonal skills.\n- Confident, target-oriented, and self-motivated.\n- Proficiency in CRM systems and MS Office.\n- Ability to work in a fast-paced, multicultural environment.</p>\n<p><strong>Contact</strong>: varsha.m@difinitydigital.com</p>",
        "tags": [
            "0–6 Months",
            "CRM Systems",
            "MS Office",
            "Arabic (Language)"
        ],
        "summary": "Seeking a dynamic International Telesales Intern to sell products/services to global clients. Requires 0–6 months experience, strong communication, and CRM proficiency."
    },
    {
        "job_title": "SQL Support Engineer",
        "company": "SE-Mentor Solutions",
        "url": "https://infopark.in/company-jobs/details/21486/483",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Role Overview</h2>\n<p>We are seeking a <strong>Production Support Engineer</strong> with <strong>3+ years</strong> of experience in <strong>MS SQL Server</strong> and <strong>SSIS</strong> to join our team in <strong>Kochi, Kerala</strong>. This <strong>Full-time</strong> role focuses on maintaining the stability and performance of data integration pipelines and database systems.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Monitoring &amp; Troubleshooting</strong>: Monitor scheduled SSIS packages and SQL Agent jobs; resolve failures to meet SLAs.</li>\n<li><strong>Incident Management</strong>: Address L2/L3 support tickets for data discrepancies, performance issues, and connectivity problems using <strong>ServiceNow/Jira</strong>.</li>\n<li><strong>Performance Tuning</strong>: Optimize long-running queries and SSIS packages through indexing, query optimization, and resource management.</li>\n<li><strong>Data Integrity</strong>: Conduct root cause analysis (RCA) for data issues and ensure high-quality data in production environments.</li>\n<li><strong>Maintenance</strong>: Support database deployments, patch testing, and environment synchronization.</li>\n<li><strong>On-Call Support</strong>: Participate in rotational on-call schedules for critical systems.</li>\n</ul>\n<h3>Technical Requirements</h3>\n<ul>\n<li><strong>SQL Server</strong>: 3+ years with <strong>T-SQL</strong>, stored procedures, views, triggers, and functions.</li>\n<li><strong>SSIS</strong>: Debug and maintain ETL packages with error handling, logging, and deployment expertise.</li>\n<li><strong>Database Administration</strong>: Basic knowledge of SQL Server architecture, backups, restores, and security.</li>\n<li><strong>Tools</strong>: Experience with <strong>SQL Profiler</strong>, execution plans, and version control (<strong>TFS/GIT</strong>).</li>\n<li><strong>Support Experience</strong>: Proven background in <strong>Production Support</strong> or <strong>Application Support</strong> with <strong>ITIL</strong> process knowledge.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Familiarity with scheduling tools like <strong>Control-M</strong>, <strong>Autosys</strong>, or <strong>ActiveBatch</strong>.</li>\n<li>Knowledge of <strong>SSRS</strong> or <strong>Power BI</strong>.</li>\n<li>Strong communication skills for cross-functional collaboration.</li>\n</ul>\n<p><strong>Contact</strong>: Share your resume at <strong>careers@se-mentor.com</strong>.</p>",
        "tags": [
            "3+ Years",
            "MS SQL Server",
            "SSIS",
            "T-SQL"
        ],
        "summary": "A Production Support Engineer in Kochi ensures SQL/SSIS system stability, troubleshoots ETL failures, and optimizes database performance with 3+ years of experience."
    },
    {
        "job_title": "Junior Business Development Engineer",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/21487/107",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2><strong>Junior Business Development Engineer</strong></h2>\n<p><strong>Profile Summary</strong></p>\n<p>The Junior Business Development Engineer supports the company’s growth initiatives within the Architecture, Engineering, and Construction (AEC) industry by identifying new business opportunities, assisting in sales processes, and building strong client relationships. This role collaborates with senior business development engineers and internal teams to ensure seamless project execution.</p>\n<p><strong>Key Responsibilities</strong>\n- Identify potential business opportunities and conduct market research.\n- Assist in preparing proposals, presentations, and reports.\n- Support client communication and follow-ups.\n- Coordinate with internal teams for project execution.\n- Assist senior engineers in meetings and negotiations.\n- Prepare basic reports on sales activities and client interactions.</p>\n<p><strong>Skills and Requirements</strong>\n- Bachelor’s degree in Engineering, Architecture, Business Administration, or a related field.\n- Basic knowledge of the AEC industry.\n- Good communication and presentation skills.\n- Strong organizational and coordination abilities.\n- Willingness to learn and grow in business development.</p>\n<p><strong>About Advenser</strong></p>\n<p>Advenser, a versatile engineering services company, brings cutting-edge engineering solutions to the construction industry. Derived from <em>ADVanced ENgineering SERvices</em>, our name reflects our commitment to innovation and expertise. Since 2007, we have leveraged tools like BIM to deliver exceptional results.</p>\n<p><strong>Contact</strong></p>\n<p>If this opportunity aligns with your career goals, share your resume at <strong>jobs@advenser.com</strong>.</p>",
        "tags": [
            "0-2 Years",
            "AEC Industry",
            "Business Development",
            "BIM"
        ],
        "summary": "Junior Business Development Engineer at Advenser supports AEC industry growth through market research, client relations, and sales assistance, leveraging BIM and collaboration."
    },
    {
        "job_title": "Lead Network Automation Engineer",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21491/68",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Job Title:</strong> Lead Network Automation Engineer\n<strong>Job Code:</strong> CUB/2025/SSE/024\n<strong>Experience:</strong> 10 – 12 yrs\n<strong>Job Location:</strong> Infopark, Kochi</p>\n<h3>Why Join Us?</h3>\n<ul>\n<li><strong>Innovative Environment:</strong> Join a forward-thinking company that encourages creativity and problem-solving</li>\n<li><strong>Career Growth:</strong> Opportunities for professional development and career advancement</li>\n<li><strong>Collaborative Culture:</strong> Work in a team-oriented environment where your contributions are valued</li>\n<li><strong>Competitive Compensation:</strong> Attractive salary package and performance-based incentives</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead end-to-end delivery of network automation and IaC initiatives across enterprise environments</li>\n<li>Design scalable automation solutions for network provisioning, configuration, policy enforcement, drift detection, and compliance reporting</li>\n<li>Develop and maintain Python-based automation frameworks, reusable libraries, utilities, and tooling (logging, validation, retries, reporting)</li>\n<li>Build and standardize IaC patterns using Terraform and Ansible (modules, roles, collections, inventories)</li>\n<li>Implement model-driven network automation using NETCONF and YANG (RESTCONF exposure is a plus)</li>\n<li>Design Jinja template-driven configuration generation and enforce “golden configuration” standards</li>\n<li>Architect and build microservice-based network automation applications, including REST/gRPC APIs, async execution, idempotency, and retry strategies</li>\n<li>Expose automation workflows through secure APIs for provisioning, change execution, audits, and compliance checks</li>\n<li>Integrate automation workflows with CI/CD pipelines, including approvals, testing, validation, and rollback mechanisms</li>\n<li>Ensure all solutions meet security, auditability, and compliance requirements, preferably aligned with banking-grade practices</li>\n<li>Mentor engineers, conduct design and code reviews, and drive automation and engineering best practices across the team</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>10–12+ years of experience in Networking / Infrastructure Engineering with a strong focus on automation</li>\n<li>Strong Python scripting expertise for network automation (API integrations, structured data, parsing, error handling, packaging)</li>\n<li>Proven hands-on experience with Terraform and Ansible in production environments</li>\n<li>Practical experience with NETCONF and YANG for model-driven network automation</li>\n<li>Strong expertise in Jinja templating for configuration generation and standardization</li>\n<li>Hands-on experience designing and delivering microservice-based applications in the network or infrastructure domain</li>\n<li>Solid networking fundamentals (routing, switching, VLANs, VPNs, DNS/DHCP, load balancers, firewalls)</li>\n<li>Strong Git practices and understanding of CI/CD pipelines for infrastructure and network changes</li>\n<li>Experience owning delivery or leading automation initiatives end-to-end</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in banking or financial services projects, including change control, approvals, audit trails, and segregation of duties</li>\n<li>Exposure to multiple network vendor ecosystems (Cisco, Juniper, Arista, Palo Alto, Fortinet, F5, etc.)</li>\n<li>Familiarity with RESTCONF, gNMI, streaming telemetry, and modern network observability patterns</li>\n<li>Experience deploying automation services using Docker and Kubernetes</li>\n<li>Knowledge of event-driven automation patterns using queues or streams (Kafka, RabbitMQ, SQS, etc.)</li>\n<li>Familiarity with Source of Truth concepts and tools (IPAM, CMDB, inventory systems, configuration baselines)</li>\n<li>Experience with secrets management and secure automation patterns (Vault, CyberArk, or similar)</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong ownership mindset with focus on delivery quality, reliability, and maintainability</li>\n<li>Ability to mentor and guide engineers, establish standards, and improve team velocity through reusable patterns</li>\n<li>Clear and confident communication with technical and non-technical stakeholders</li>\n<li>Ability to present solution options, trade-offs, and architectural decisions effectively</li>\n<li>Structured, detail-oriented, and security-conscious approach to engineering</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, or equivalent practical experience</li>\n<li>Networking certifications (CCNP, CCIE, JNCIP, or equivalent) are a plus but not mandatory</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@cubettech.com</strong></p>",
        "tags": [
            "10–12 Years",
            "Python",
            "Terraform",
            "Ansible"
        ],
        "summary": "Lead Network Automation Engineer with 10–12 years of experience in designing automation frameworks, IaC, and mentoring teams. Requires expertise in Python, Terraform, and Ansible for enterprise network solutions."
    },
    {
        "job_title": "Junior Engineer – Façade Detailing",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/21492/107",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Profile Summary</h2>\n<p>We are seeking a <strong>Junior Engineer – Façade Detailing</strong> to support our façade design and drafting projects. This role involves preparing accurate shop drawings, assisting senior engineers, and ensuring technical excellence in every detail.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Prepare façade shop drawings (curtain walls, glazing, cladding, doors &amp; windows, etc.)</li>\n<li>Modify and update drawings in <strong>AutoCAD</strong> as per project requirements</li>\n<li>Review drawings and raise RFIs when required</li>\n<li>Ensure accuracy in dimensions, specifications, and detailing</li>\n<li>Coordinate closely with senior engineers and conduct quality checks</li>\n</ul>\n<h2>Skills and Requirements</h2>\n<ul>\n<li><strong>Diploma/Degree</strong> in Civil, Architecture, or Structural Engineering</li>\n<li><strong>2+ years</strong> of experience in façade detailing with strong <strong>AutoCAD</strong> proficiency</li>\n<li>Ability to read and interpret architectural and structural drawings</li>\n<li>Excellent teamwork and communication skills</li>\n<li>Detail-oriented with a proactive learning mindset</li>\n<li>Knowledge of façade systems and shop drawing preparation</li>\n<li>Ability to identify and resolve technical/design issues effectively</li>\n</ul>\n<h2>About Advenser</h2>\n<p><strong>Advenser</strong>, a versatile engineering services company, brings cutting-edge engineering solutions to the construction industry. Derived from <em>ADVanced ENgineering SERvices</em>, our name reflects our commitment to pushing the boundaries of innovation and expertise. Since 2007, we have leveraged state-of-the-art tools like <strong>BIM</strong> to deliver exceptional results.</p>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume at <strong>jobs@advenser.com</strong>.</p>",
        "tags": [
            "2+ Years",
            "AutoCAD",
            "Façade Detailing",
            "BIM"
        ],
        "summary": "Junior Engineer – Façade Detailing role requiring 2+ years of experience in AutoCAD and façade systems, supporting design projects with technical precision and collaboration."
    },
    {
        "job_title": "Senior DevOps Engineer",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21493/68",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Senior DevOps Engineer</h2>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead end-to-end infrastructure automation and platform reliability initiatives in high-performance environments.</li>\n<li>Design, implement, and manage CI/CD pipelines, IaC frameworks, and container orchestration systems.</li>\n<li>Apply SRE principles to ensure platform resilience, high availability, and continuous improvement.</li>\n<li>Develop and implement strategies for monitoring, observability, and incident response using open-source tools.</li>\n<li>Mentor and guide a small engineering team, fostering collaboration and technical excellence.</li>\n<li>Ensure systems adhere to security, compliance, scalability, and cost optimization best practices.</li>\n<li>Collaborate across product, development, and DevOps teams to define architectural standards and promote automation-first practices.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Proven hands-on expertise with IaC, cloud platforms, CI/CD pipelines, containerization, orchestration, and SRE principles.</li>\n<li>Strong experience with IaC tools such as Ansible, Terraform, CloudFormation, or Pulumi.</li>\n<li>Deep understanding of resource management frameworks like Kubernetes, Apache Mesos, or Yarn.</li>\n<li>Proficient in Linux administration, with experience in monitoring, logging, and observability using Prometheus, Grafana, and ELK.</li>\n<li>Programming proficiency in Python, Java, or Golang, with strong architectural and system design skills focused on scalability and resilience.</li>\n<li>Practical knowledge of multi-cloud and hybrid-cloud architectures.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in network and infrastructure operations engineering.</li>\n<li>Understanding of network protocols (TCP/IP, UDP, HTTP/HTTPS, DNS, BGP, OSPF, VXLAN, IPSec, etc.).</li>\n<li>Familiarity with network security and automation, including zero-trust frameworks, TLS/SSL, and modern automation protocols such as gNMI/gRPC and RESTCONF.</li>\n<li>Experience with Agile methodologies (Scrum/Kanban) and SRE performance metrics (MTTR, SLO, SLI, deployment frequency).</li>\n<li>Strong Python scripting expertise for network automation (API integrations, structured data, parsing, error handling, packaging).</li>\n<li>Proven hands-on experience with Terraform and Ansible in production environments.</li>\n<li>Practical experience with NETCONF and YANG for model-driven network automation.</li>\n<li>Strong expertise in Jinja templating for configuration generation and standardization.</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong leadership and mentoring abilities.</li>\n<li>Excellent problem-solving and analytical thinking.</li>\n<li>Effective communicator across technical and non-technical teams.</li>\n<li>Ability to thrive in fast-paced, evolving technology environments.</li>\n<li>Collaborative and automation-driven mindset.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, or related field.</li>\n<li><strong>5–10 years of experience</strong> in Infrastructure, DevOps, or SRE roles within product-focused organizations.</li>\n<li>Hands-on experience in cloud-native platforms (AWS, Azure, GCP).</li>\n</ul>\n<h3>Preferred Certifications</h3>\n<ul>\n<li>DevOps or SRE Certification.</li>\n<li>Kubernetes Certification (CKA / CKAD).</li>\n<li>Network or Security Certifications (CCNA, CompTIA, or equivalent).</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@cubettech.com</strong>.</p>",
        "tags": [
            "5–10 Years",
            "Infrastructure as Code (IaC)",
            "Kubernetes",
            "Python"
        ],
        "summary": "Senior DevOps Engineer leading infrastructure automation, CI/CD, and mentoring. Requires IaC, Kubernetes, and Python expertise with 5–10 years of cloud-native experience."
    },
    {
        "job_title": "BIM Engineer – MEP",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/21495/107",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>BIM Engineer – MEP</strong></p>\n<p><strong>Profile Summary</strong>\nWe are seeking a detail-oriented BIM Engineer with <strong>3–5 years of experience</strong> to develop accurate 3D models for HVAC, plumbing, and fire protection systems. The candidate must manage multiple tasks, troubleshoot issues, and deliver high-quality results within deadlines.</p>\n<p><strong>Key Responsibilities</strong>\n- Develop and maintain 3D MEP models using <strong>Revit</strong> and/or <strong>Fabrication CAD MEP</strong>.\n- Generate shop drawings, spool drawings, equipment schedules, and project deliverables.\n- Coordinate with other trade services and participate in design review meetings.\n- Maintain modeling standards and mentor junior engineers when required.</p>\n<p><strong>Skills and Qualifications</strong>\n<strong>Technical:</strong>\n- Proficiency in <strong>Revit MEP</strong> or <strong>Fabrication CAD MEP</strong>\n- Knowledge of <strong>Navisworks</strong>, <strong>HVAC/plumbing/fire protection systems</strong>, and <strong>BIM standards</strong></p>\n<p><strong>Soft Skills:</strong>\n- Attention to detail\n- Problem-solving\n- Teamwork\n- Communication\n- Time management</p>\n<p><strong>Education:</strong>\n- <strong>Diploma (3-year)</strong> or <strong>B.Tech (Mechanical)</strong></p>\n<p><strong>About Advenser</strong>\nAdvenser, a versatile engineering services company, delivers cutting-edge solutions to the construction industry. Since 2007, we’ve leveraged tools like BIM to innovate and excel. Apply now by sharing your resume at <strong>jobs@advenser.com</strong>.</p>",
        "tags": [
            "3–5 Years",
            "Revit MEP",
            "Fabrication CAD MEP",
            "Navisworks"
        ],
        "summary": "Detail-oriented BIM Engineer with 3–5 years of experience in Revit MEP and CAD, coordinating MEP systems and mentoring teams. Delivering high-quality 3D models for HVAC, plumbing, and fire protection systems."
    },
    {
        "job_title": "BIM Trainer",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/21496/107",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>BIM Trainer</strong></p>\n<p><strong>Profile Summary</strong>\nWe are seeking a motivated BIM Trainer to conduct training sessions for in-house and external candidates. The ideal candidate should have foundational BIM knowledge and a passion for skill development and teaching.</p>\n<p><strong>Key Responsibilities</strong>\n- Conduct training on BIM tools such as Revit (Architecture/Structure/MEP), Navisworks, and basic Tekla workflows.\n- Deliver classroom and hands-on sessions to build practical understanding.\n- Assist in preparing and updating training materials.\n- Guide and support trainees during project-based tasks.\n- Stay updated on BIM tools and standards.</p>\n<p><strong>Skills and Requirements</strong>\n- Minimum 1 year of BIM experience with basic proficiency in Revit.\n- Understanding of BIM standards, LOD, clash detection, and coordination.\n- Good communication and presentation skills.\n- Interest in training, mentoring, and continuous learning.\n- Autodesk Certification (Revit/Navisworks)\n- Bachelor’s degree in Engineering\n- Exposure to international BIM projects</p>\n<p><strong>About Advenser</strong>\nAdvenser is a global engineering service provider specializing in Building Information Modelling (BIM), CAD, and design support services. With over a decade of experience in delivering value-driven engineering solutions, we are now expanding our training division to develop and empower the next generation of BIM professionals.</p>\n<p><strong>Contact</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@advenser.com</p>",
        "tags": [
            "1+ Year",
            "Revit",
            "Navisworks",
            "Tekla"
        ],
        "summary": "BIM Trainer required for Revit, Navisworks, and Tekla training with 1+ year experience and Autodesk certification."
    },
    {
        "job_title": "Engineer-Steel Detailling",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/21497/107",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Profile Summary</h2>\n<p><strong>Experienced Steel Detailer</strong> with 5+ years of expertise in <strong>Tekla Structures</strong> for structural steel modelling and detailing. Skilled in <strong>Tekla Modelling</strong>, producing accurate GA, shop, and assembly drawings, along with CNC/NC data. Strong coordination abilities with engineers and fabricators to ensure smooth project delivery.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Develop 3D Tekla models and prepare GA, shop, assembly drawings, and project reports.</li>\n<li>Coordinate with engineers, architects, and fabricators to resolve clashes and connection issues.</li>\n<li>Review and ensure accuracy, constructability, and compliance with project standards and codes.</li>\n</ul>\n<h2>Skills &amp; Qualifications</h2>\n<ul>\n<li>Advanced proficiency in <strong>Tekla Structures</strong> with strong knowledge of steel connections and detailing practices.</li>\n<li>Ability to interpret structural drawings, specifications, and standards (<strong>AISC</strong>, <strong>BS</strong>, <strong>IS</strong>, or project-specific).</li>\n<li>Strong problem-solving, communication, and quality-control skills with the ability to meet deadlines.</li>\n</ul>\n<h2>About Advenser</h2>\n<p><strong>Advenser</strong>, a versatile engineering services company, brings cutting-edge engineering solutions to the construction industry. Derived from <strong>ADVanced ENgineering SERvices</strong>, our name reflects our commitment to pushing the boundaries of innovation and expertise. Since our establishment in 2007, we have become a trusted provider, leveraging state-of-the-art tools like <strong>BIM</strong> to deliver exceptional results.</p>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>jobs@advenser.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Tekla Structures",
            "Steel Detailing",
            "AISC/BS/IS Standards"
        ],
        "summary": "Experienced Steel Detailer with 5+ years in Tekla Structures for structural modeling and detailing. Coordinates with engineers and fabricators to ensure project compliance and delivery."
    },
    {
        "job_title": "SEO Specialist",
        "company": "Advenser Engineering Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/21498/107",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>SEO Specialist</h2>\n<h3>Profile Summary</h3>\n<p>Results-driven SEO Specialist with expertise in on-page, off-page, technical SEO, and AEO. Skilled in driving organic growth, improving search visibility, and optimizing content through data-driven strategies across traditional and AI-driven search platforms. Strong collaborator with a focus on quality and measurable results.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Plan and execute SEO strategies aligned with business and client goals.</li>\n<li>Conduct keyword research, competitor analysis, and search intent analysis across traditional and AI-driven platforms.</li>\n<li>Implement on-page, off-page, technical SEO, and AEO best practices (Google SGE, Bing, ChatGPT, Perplexity, etc.).</li>\n<li>Perform technical SEO audits (crawlability, site structure, speed, structured data).</li>\n<li>Optimize content structure, semantics, and structured data for advanced and AI-driven search features.</li>\n<li>Monitor rankings, traffic, conversions, and AI visibility; prepare performance reports.</li>\n<li>Collaborate with design, development, and marketing teams.</li>\n<li>Track brand presence across AI answer engines and support digital marketing initiatives.</li>\n</ul>\n<h3>Skills and Qualifications</h3>\n<ul>\n<li>Strong on-page, off-page, and technical SEO expertise.</li>\n<li>Proficiency in SEO analytics and performance tools.</li>\n<li>Data-driven decision-making and strong analytical skills.</li>\n<li>Experience with search intent optimization and organic growth.</li>\n<li>Strong communication, collaboration, and attention to detail.</li>\n<li>Bachelor’s or Master’s degree in a related field.</li>\n</ul>\n<h3>About Advenser</h3>\n<p>Advenser, a versatile engineering services company, brings cutting-edge engineering solutions to the construction industry. Derived from ADVanced ENgineering SERvices, our name Advenser reflects our commitment to pushing the boundaries of innovation and expertise. Since our establishment in 2007, we have become a trusted provider, leveraging state-of-the-art tools like BIM to deliver exceptional results.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>jobs@advenser.com</strong>.</p>",
        "tags": [
            "3-5 Years",
            "SEO",
            "Technical SEO",
            "AI-Driven Search Optimization"
        ],
        "summary": "SEO Specialist drives organic growth through data-driven strategies, collaborating with teams to optimize content and technical SEO for AI and traditional platforms."
    },
    {
        "job_title": "UI/UX DESIGNER",
        "company": "FDC Web Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21490/192",
        "location": "Infopark",
        "closing_date": "13 May 2026",
        "job_description": "<p><strong>Company:</strong> FDC Web Technologies Pvt Ltd (financial.com)\n<strong>Location:</strong> Infopark, Kochi\n<strong>Work Mode:</strong> Complete Work From Office (WFO)</p>\n<p>We are seeking a passionate and creative <strong>UI/UX Designer</strong> to join our growing digital product team. The ideal candidate will play a key role in designing intuitive, visually appealing, and user-centered web and mobile experiences aligned with our brand identity and business objectives.</p>\n<h3>Your Mission</h3>\n<ul>\n<li>Design intuitive, user-centered interfaces for web and mobile platforms aligned with business goals and brand standards.</li>\n<li>Create wireframes, user flows, interactive prototypes, and high-fidelity mockups using modern design tools.</li>\n<li>Conduct user research and analyze behavior patterns to improve usability and engagement.</li>\n<li>Optimize user journeys by improving layout, navigation, and content presentation.</li>\n<li>Collaborate closely with cross-functional teams to translate requirements into effective design solutions.</li>\n<li>Ensure websites and digital products maintain high usability, accessibility, and visual consistency.</li>\n<li>Work closely with developers to ensure accurate and high-quality implementation of designs.</li>\n<li>Contribute to website performance and visual storytelling through multimedia and video-based design support.</li>\n</ul>\n<h3>Your Profile</h3>\n<ul>\n<li><strong>3 to 6 years</strong> of relevant UI/UX design experience is mandatory.</li>\n<li>Proven experience as a UI/UX Designer with a strong portfolio showcasing interaction and visual design skills.</li>\n<li>Proficiency in <strong>Figma</strong>, <strong>Adobe XD</strong>, <strong>Sketch</strong>, or <strong>Adobe Creative Suite</strong>.</li>\n<li>Strong understanding of design systems, responsive design, and accessibility standards.</li>\n<li>Basic knowledge of <strong>HTML</strong>, <strong>CSS</strong>, and interaction design principles.</li>\n<li>Excellent communication skills and strong attention to detail.</li>\n<li>Ability to manage multiple design tasks and deliver high-quality work within defined timelines.</li>\n</ul>\n<h3>We Offer</h3>\n<ul>\n<li>Stylish office and modern infrastructure at Infopark, Kochi.</li>\n<li>Healthy work-life balance.</li>\n<li>Opportunity for short-term onsite visits to Germany for tenured employees.</li>\n<li>Health insurance coverage for family (spouse and two children).</li>\n<li>Motivated, enthusiastic, and collaborative team environment.</li>\n<li>Agile organizational structure offering creative freedom.</li>\n<li>A reliable employer with more than 25 years of industry experience.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates are requested to apply using the link <a href=\"https://financialcom.jobs.personio.de/\">https://financialcom.jobs.personio.de/</a> or share their updated resume to: <strong>recruitment.india@financial.com</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>recruitment.india@financial.com</strong>.</p>",
        "tags": [
            "3-6 Years",
            "Figma",
            "Adobe XD",
            "Sketch"
        ],
        "summary": "Seeking a UI/UX Designer with 3-6 years of experience to create intuitive web and mobile interfaces using Figma, Adobe XD, and Sketch. Requires strong portfolio and collaboration skills for a dynamic team in Kochi."
    },
    {
        "job_title": "LINUX ADMINISTRATOR (IT ENGINEER / DEVOPS)",
        "company": "FDC Web Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21489/192",
        "location": "Infopark",
        "closing_date": "12 Aug 2026",
        "job_description": "<p><strong>Company:</strong> FDC Web Technologies Pvt Ltd (financial.com)\n<strong>Location:</strong> Infopark, Kochi\n<strong>Work Mode:</strong> Work in a 24/7 shift</p>\n<p>We are seeking a highly skilled Linux Administrator to join our Infrastructure Engineering team. This role is responsible for designing, maintaining, and continuously improving our intercontinental network and Linux server environment, ensuring high availability, security, and performance across multiple global locations. This is a mission-critical role for professionals who enjoy working in large-scale, high-performance infrastructure and are passionate about open-source technologies and automation.</p>\n<h3>Your Mission:</h3>\n<ul>\n<li>Plan, design, and maintain our intercontinental network across six global locations.</li>\n<li>Optimize our data center packet-switching infrastructure for reliability, low latency, and high throughput.</li>\n<li>Keep our network secure using OpenBSD firewalls and manage customer connections via leased lines and VPNs.</li>\n<li>Develop and enhance automated network configuration tools using 100% open-source software (e.g., Ansible, Python).</li>\n<li>Participate in a rotating on-call system (approximately one week in five, fully compensated).</li>\n<li>Work in a 24/7 shift environment to ensure uninterrupted infrastructure availability.</li>\n<li>Assist in maintaining our fleet of ~600 Linux servers (Debian 12, CentOS 8).</li>\n<li>Expand your expertise by learning technologies such as Kubernetes and Puppet.</li>\n</ul>\n<h3>Your Profile:</h3>\n<ul>\n<li>2 to 5 years of hands-on experience in Linux system administration and networking.</li>\n<li>Programming experience in at least one scripting language, ideally Bash, Perl, or Python.</li>\n<li>Strong knowledge of Linux and networking, with proficiency in command-line operations.</li>\n<li>Experience with Icinga, Puppet, Hiera, Linux KVM, Git, Facter, Ansible, or MySQL is desirable.</li>\n<li>Proficiency in monitoring tools, switches, routers, firewalls, and load balancers.</li>\n<li>Experience working in 24/7 operations or data center environments will be an added advantage.</li>\n</ul>\n<h3>We Offer:</h3>\n<ul>\n<li>Stylish office and modern infrastructure at Infopark, Kochi.</li>\n<li>Healthy work-life balance.</li>\n<li>Opportunity for short-term onsite visits to Germany for tenured employees.</li>\n<li>Health insurance coverage for family (spouse and two children).</li>\n<li>Motivated, enthusiastic, and collaborative team environment.</li>\n<li>Agile organizational structure offering creative freedom.</li>\n<li>A reliable employer with more than 25 years of industry experience.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates are requested to apply using the link <a href=\"https://financialcom.jobs.personio.de/\">https://financialcom.jobs.personio.de/</a> or share their updated resume to: recruitment.india@financial.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at recruitment.india@financial.com</p>",
        "tags": [
            "2-4 Years",
            "Linux",
            "Ansible",
            "Python"
        ],
        "summary": "Linux Administrator (IT Engineer/DevOps) role at FDC Web Technologies in Kochi, requiring 2-5 years of experience. Focus on global network management, automation, and 24/7 infrastructure support."
    },
    {
        "job_title": "IT Business Development Manager",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/26555",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<p><strong>PromptTech Global (P) Ltd</strong>\n<strong>Module No 315, Nila Building, Technopark Campus, 695581</strong>\n<a href=\"https://prompttechsolutions.com\">https://prompttechsolutions.com</a></p>\n<p><strong>IT Business Development Manager</strong>\n<strong>Closing Date:</strong> 20, Feb 2026\n<strong>Job Published:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> hr.department@prompttechglobal.com</p>\n<h3>Brief Description</h3>\n<p>At PromptTech Global Holdings Ltd, we empower businesses to thrive in a digital-first world. We seek a visionary <strong>IT Business Development Manager</strong> who will drive growth beyond closing deals. You will be the strategic force behind scaling our IT vertical, bridging client challenges with technical innovation.</p>\n<h3>What Your Journey Will Look Like</h3>\n<ul>\n<li><strong>Be a Trusted Advisor:</strong> Guide clients through ERP, Cloud transitions, Cybersecurity, and Managed Services.</li>\n<li><strong>Drive Growth:</strong> Expand our footprint in SME and Enterprise sectors, converting technical needs into sustainable revenue.</li>\n<li><strong>Connect the Ecosystem:</strong> Cross-sell Insurance, Hardware, and EOR services for 360-degree solutions.</li>\n<li><strong>Architect the Vertical:</strong> Support leadership in structuring the IT department and managing partners/vendors.</li>\n<li><strong>Solution Design:</strong> Analyze requirements and design proposals that solve real-world problems.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>A Seasoned Expert:</strong> 5+ years in IT consulting or business development with deep industry knowledge.</li>\n<li><strong>A Tech Translator:</strong> Simplify complex concepts like digital transformation and cybersecurity for business owners.</li>\n<li><strong>A Relationship Builder:</strong> Proven stakeholder management with growing enterprises.</li>\n<li><strong>A Builder Mindset:</strong> Self-motivated and excited to structure a growing department.</li>\n</ul>\n<h3>Why You’ll Love Working With Us</h3>\n<ul>\n<li><strong>Ownership:</strong> Shape our IT offerings directly.</li>\n<li><strong>Global Reach:</strong> Engage in a global enterprise tech ecosystem.</li>\n<li><strong>Career Trajectory:</strong> Clear path to IT leadership roles as the department grows.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "IT Consulting",
            "Business Development",
            "Digital Transformation"
        ],
        "summary": "PromptTech seeks an IT Business Development Manager to bridge client challenges with technical solutions, driving growth in SME and Enterprise sectors. The role offers ownership in shaping IT offerings and global tech ecosystem engagement."
    },
    {
        "job_title": "Senior Solution Architect / Principal Solution Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/26554",
        "location": "Technopark",
        "closing_date": "13 Jan 2026",
        "job_description": "<h2>Senior Solution Architect / Principal Solution Architect</h2>\n<p><strong>Company:</strong> Techversant Infotech (P) Ltd\n<strong>Location:</strong> Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a>\n<strong>Closing Date:</strong> 13, Jan 2026\n<strong>Published Date:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant</h3>\n<p>Techversant is a global technology services company with 17+ years of experience in delivering end-to-end IT solutions. Specializing in <strong>Digital Transformation</strong>, <strong>Cloud Platforms</strong>, and <strong>AI-driven solutions</strong>, they serve global clients across domains like ColdFusion, Python, Java, .NET, Node JS, Blockchain, React, Angular, and more.</p>\n<h3>What’s Important to Us</h3>\n<p>We seek a <strong>highly experienced Solution Architect</strong> to act as a <strong>technical authority</strong> for complex engineering challenges. The role demands deep expertise in <strong>multiple programming languages</strong>, <strong>cloud platforms</strong>, and <strong>AI-driven solutions</strong>, with a focus on designing scalable, secure, and future-ready systems.</p>\n<h3>Experience Required</h3>\n<ul>\n<li><strong>10–15 years</strong> of software engineering and architecture experience</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<h4>Architecture &amp; Design</h4>\n<ul>\n<li>Define and own end-to-end solution architecture for mission-critical systems.</li>\n<li>Design systems using <strong>Microservices</strong>, <strong>Event-driven architecture</strong>, <strong>Serverless</strong>, and <strong>Modernization patterns</strong>.</li>\n<li>Apply <strong>design patterns</strong> and <strong>enterprise integration patterns</strong> for complex problems.</li>\n<li>Ensure decisions align with <strong>scalability</strong>, <strong>security</strong>, <strong>performance</strong>, and <strong>cost optimization</strong>.</li>\n</ul>\n<h4>Technical Leadership</h4>\n<ul>\n<li>Serve as the primary technical point for engineering teams.</li>\n<li>Mentor senior engineers and architects on best practices.</li>\n<li>Review and approve <strong>HLD/LLD</strong> designs.</li>\n<li>Drive architectural governance and standards.</li>\n</ul>\n<h4>Cloud &amp; Platform Engineering</h4>\n<ul>\n<li>Design solutions on <strong>AWS</strong>, <strong>Azure</strong>, or <strong>GCP</strong>.</li>\n<li>Guide teams on <strong>containerization</strong>, <strong>CI/CD</strong>, and <strong>infrastructure as code</strong>.</li>\n</ul>\n<h4>Emerging Technologies</h4>\n<ul>\n<li>Evaluate and recommend adoption of emerging technologies.</li>\n</ul>\n<h4>Collaboration &amp; Stakeholder Engagement</h4>\n<ul>\n<li>Work with managers, security teams, and stakeholders to translate business needs into technical solutions.</li>\n<li>Communicate complex concepts to technical and non-technical audiences.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Programming &amp; Development</h4>\n<ul>\n<li>Hands-on experience with <strong>Java</strong>, <strong>Python</strong>, <strong>C#</strong>, <strong>JavaScript/TypeScript</strong>, <strong>React</strong>, <strong>Angular</strong>.</li>\n<li>Deep understanding of <strong>OO design</strong>, <strong>SOLID principles</strong>, and <strong>clean architecture</strong>.</li>\n</ul>\n<h4>Architecture &amp; Patterns</h4>\n<ul>\n<li>Proven experience in <strong>distributed systems</strong>, <strong>API-first design</strong>, <strong>DDD</strong>, and <strong>event streaming</strong>.</li>\n</ul>\n<h4>Cloud &amp; DevOps</h4>\n<ul>\n<li>Proficiency in <strong>AWS/Azure/GCP</strong>, <strong>Docker</strong>, <strong>Kubernetes</strong>, <strong>CI/CD pipelines</strong>, and <strong>Terraform</strong>.</li>\n</ul>\n<h4>Security &amp; Reliability</h4>\n<ul>\n<li>Expertise in <strong>IAM</strong>, <strong>encryption</strong>, <strong>secure API design</strong>, and <strong>compliance</strong>.</li>\n<li>Experience designing <strong>resilient systems</strong>.</li>\n</ul>\n<h4>Soft Skills &amp; Leadership</h4>\n<ul>\n<li>Recognized problem solver and technical authority.</li>\n<li>Strong analytical, communication, and stakeholder management skills.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li><strong>Career growth</strong> and exposure to cutting-edge technologies.</li>\n<li><strong>Fixed weekday schedule</strong> with weekends off.</li>\n<li><strong>Family medical insurance</strong>, <strong>unique leave benefits</strong>, and <strong>performance-based encashment</strong>.</li>\n<li><strong>International tours</strong>, <strong>employee rewards</strong>, and <strong>bonus programs</strong> for training, certifications, and innovation.</li>\n<li><strong>Work-life balance</strong> with flexible timings, early-out Fridays, and cultural activities.</li>\n</ul>",
        "tags": [
            "10–15 Years",
            "Java",
            "Python",
            "AWS"
        ],
        "summary": "Techversant seeks a Senior/Principal Solution Architect with 10-15 years of experience in designing scalable systems, cloud solutions, and mentoring teams. The role offers career growth, international opportunities, and a balanced work environment with competitive benefits."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/26553",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>PromptTech Global (P) Ltd</h2>\n<p><strong>Address:</strong> Module No 315, Nila Building, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"https://prompttechsolutions.com\">https://prompttechsolutions.com</a>\n<strong>Closing Date:</strong> 20, Feb 2026\n<strong>Job Published:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> hr.department@prompttechglobal.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Business Development Executive</strong> to build and maintain client relationships. The ideal candidate will possess strong interpersonal skills, sales experience, and the ability to understand customer needs. This role demands excellent communication, customer service orientation, and the capacity to meet sales targets.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Proactively acquire new customers to expand the client base.</li>\n<li>Promote products/services through sales presentations, demonstrations, and discussions.</li>\n<li>Respond to customer/prospect inquiries via phone regarding products/services.</li>\n<li>Achieve sales targets related to revenue, conversion rates, or customer acquisition.</li>\n<li>Collaborate with sales, marketing, and product development teams to address client needs.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in English and exceptional communication skills.</li>\n<li>In-depth knowledge of company products/services.</li>\n<li>Ability to build/maintain client relationships.</li>\n<li>Relationship management, problem-solving, adaptability, teamwork, integrity, sales target achievement, and market knowledge.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "Communication Skills",
            "Sales Strategy",
            "Relationship Management"
        ],
        "summary": "PromptTech Global seeks a Business Development Executive to drive client relationships and achieve sales targets. Requires strong communication, sales skills, and market knowledge."
    },
    {
        "job_title": "Python Developer – Data Analytics",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26552",
        "location": "Technopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<h2>GNX Digital Solutions (P) Ltd</h2>\n<p><strong>Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581</strong>\n<a href=\"https://gnxsolutions.in\">Visit our website</a></p>\n<h3>Python Developer – Data Analytics</h3>\n<p><strong>Closing Date:</strong> 12, Jan 2026\n<strong>Published:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> hr@gnxsolutions.in</p>\n<p><strong>Brief Description</strong>\nWe are seeking a skilled Python Developer with expertise in <strong>data analytics</strong>, <strong>data processing</strong>, and <strong>visualization</strong>. The ideal candidate should be proficient in Python libraries such as Pandas, NumPy, Matplotlib/Seaborn, and collaborate with business teams to derive insights from raw data.</p>\n<p><strong>Key Responsibilities</strong>\n- Develop, maintain, and optimize Python scripts for data extraction, transformation, and analysis.\n- Work with structured/unstructured datasets for cleansing, transformation, and validation.\n- Build data analytics solutions, reports, and dashboards using Python.\n- Perform Exploratory Data Analysis (EDA) to identify trends, patterns, and anomalies.\n- Create custom data models, automation workflows, and analytical tools.\n- Integrate and process data from databases, APIs, and external sources.\n- Develop visualizations using Matplotlib, Seaborn, Plotly (optional).\n- Collaborate with business, product, and engineering teams to define requirements.\n- Optimize analytics scripts for performance and scalability.\n- Document processes, models, and code.</p>\n<p><strong>Preferred Skills</strong>\n- <strong>3+ years</strong> of hands-on Python development experience.\n- Strong knowledge of Pandas, NumPy, and data manipulation.\n- Experience in data analysis, cleaning, EDA, and reporting.\n- Proficiency in Matplotlib/Seaborn for visualization.\n- Experience with SQL, MySQL/PostgreSQL, or NoSQL.\n- Ability to work with CSV, Excel, JSON, and other data formats.\n- Familiarity with Jupyter Notebook or similar environments.\n- Strong analytical, problem-solving, and logical thinking skills.\n- Understanding of statistical concepts (plus).</p>\n<p><strong>Good to Have</strong>\n- Experience with Plotly, Tableau, Power BI.\n- Knowledge of Machine Learning (Scikit-learn).\n- ETL pipelines/workflow automation.\n- Cloud platforms (AWS, GCP, Azure).\n- API/REST integrations.</p>\n<p><strong>Education</strong>\n- Bachelor’s degree in Computer Science, Engineering, Data Science, or related field.\n- Certifications in Python/Data Analytics (added advantage).</p>",
        "tags": [
            "3+ Years",
            "Python",
            "Pandas",
            "SQL"
        ],
        "summary": "Python Developer needed for data analytics, requiring 3+ years of experience with Python, Pandas, and SQL to build insights and collaborate with teams."
    },
    {
        "job_title": "Application Maintenance Support Engineer( 2+Yrs Exp)",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26551",
        "location": "Technopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<h2>GNX Digital Solutions (P) Ltd</h2>\n<p><strong>Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581</strong>\n<a href=\"https://gnxsolutions.in\">Visit Website</a></p>\n<h3>Application Maintenance Support Engineer (2+Yrs Exp)</h3>\n<p><strong>Closing Date:</strong> 12, Jan 2026\n<strong>Job Published:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> hr@gnxsolutions.in</p>\n<h3>Job Summary</h3>\n<p>We are seeking an Application Maintenance Support Engineer with <strong>2+ years of experience</strong> to support, maintain, and enhance existing applications. Responsibilities include incident management, bug fixing, performance monitoring, and coordination with development and business teams to ensure smooth application operations.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Provide L2/L3 application support for production and staging environments</li>\n<li>Monitor application health, performance, and availability</li>\n<li>Analyze, troubleshoot, and resolve application issues within defined SLAs</li>\n<li>Perform root cause analysis (RCA) and implement permanent fixes</li>\n<li>Handle bug fixing, minor enhancements, and configuration changes</li>\n<li>Support application deployments, patches, and version upgrades</li>\n<li>Coordinate with development, QA, infrastructure, and business teams</li>\n<li>Maintain application documentation, SOPs, and knowledge base</li>\n<li>Support database-related activities (data validation, basic queries)</li>\n<li>Participate in on-call/shift support as required</li>\n<li>Ensure compliance with security, audit, and operational standards</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Technical Skills:</strong>\n- Experience in application support/maintenance roles\n- Working knowledge of Java/.NET/Python/Node.js\n- Hands-on SQL and basic database troubleshooting\n- Familiarity with Jira, ServiceNow, Freshdesk\n- Log analysis and monitoring tools\n- Basic Linux/Unix commands\n- SDLC, ITIL processes, incident/change management</p>\n<p><strong>Required Qualifications:</strong>\n- Bachelor’s degree in Computer Science/IT\n- 2+ years in Application Maintenance/Production Support\n- Strong problem-solving and analytical skills\n- Effective communication and stakeholder management</p>\n<p><strong>Good to Have:</strong>\n- Cloud environments (AWS/Azure/GCP)\n- CI/CD pipelines and DevOps tools\n- Domain-specific apps (Banking/Healthcare/E-commerce)\n- ITIL certification</p>",
        "tags": [
            "2+ Years",
            "Java",
            "SQL",
            "Jira"
        ],
        "summary": "Application Maintenance Support Engineer with 2+ years experience to manage application support, troubleshoot issues, and collaborate with teams for operational excellence."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "Zoondia Software (P) Ltd",
        "url": "https://technopark.org/job-details/26550",
        "location": "Technopark",
        "closing_date": "23 Jan 2026",
        "job_description": "<p><strong>Zoondia Software (P) Ltd</strong>\nT2, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.zoondia.com\">http://www.zoondia.com</a></p>\n<p><strong>Contact Email:</strong> <a href=\"mailto:recruit@zoondia.in\">recruit@zoondia.in</a>\n<strong>Closing Date:</strong> 23, Jan 2026\n<strong>Job Published:</strong> 06, Jan 2026</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Digital Marketing Executive</strong> with hands-on experience in <strong>Facebook, Instagram, and Google Ads</strong>, <strong>Mailchimp email marketing</strong>, and <strong>campaign performance analysis</strong> to plan, manage, and optimize online marketing activities.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Plan, create, and manage <strong>Facebook, Instagram, and Google Ads</strong> campaigns (Search, Display, and Performance).</li>\n<li>Execute <strong>Mailchimp email marketing</strong> campaigns, including automation, segmentation, and reporting.</li>\n<li>Monitor campaign performance and prepare regular reports using <strong>Excel</strong> and platform analytics.</li>\n<li>Analyze data to identify optimization opportunities and improve campaign ROI.</li>\n<li>Coordinate with internal teams and clients for approvals, reporting, and updates.</li>\n<li>Stay updated on the latest digital marketing trends, tools, and best practices.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>Proven hands-on experience in <strong>Facebook, Instagram, and Google Ads</strong> campaign management.</li>\n<li>Strong working knowledge of <strong>Mailchimp</strong> (email setup, automation, and analytics).</li>\n<li>Proficiency in <strong>Microsoft Excel</strong> for data reporting and analysis.</li>\n<li>Excellent communication and coordination skills.</li>\n<li>Attention to detail, creativity, and a results-driven mindset.</li>\n</ul>\n<p><strong>Experience:</strong> 2-4 Years\n<strong>Preference:</strong> Immediate Joiner</p>",
        "tags": [
            "2-4 Years",
            "Facebook",
            "Instagram",
            "Google Ads"
        ],
        "summary": "Digital Marketing Executive to manage Facebook, Instagram, and Google Ads campaigns, plus Mailchimp email marketing. Responsibilities include optimization, performance analysis, and client coordination."
    },
    {
        "job_title": "Finance and Accounts Executive",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26549",
        "location": "Technopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<p><strong>Company:</strong> Softnotions Technologies (P) Ltd\n<strong>Address:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Closing Date:</strong> 15, Jan 2026\n<strong>Job Published:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3><strong>Job Description</strong></h3>\n<ul>\n<li>Verifying &amp; accounting for all supplier invoices, payment entries, and regular journals in accounting software.</li>\n<li>Filing GST returns, managing GST audit &amp; refund applications.</li>\n<li>Handling STPI monthly/annual returns and SOFTEX filings.</li>\n<li>Managing banking operations, forex, and corporate credit card activities.</li>\n<li>Calculating payroll, PF, ESI, and professional tax.</li>\n<li>Ensuring compliance with e-TDS returns, IT declarations, and issuing Form-16.</li>\n<li>Managing internal and statutory audits, coordinating with company auditors.</li>\n<li>Collecting and processing bills and vouchers.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>BCom/MCom/MBA (Finance) qualification.</li>\n<li>Minimum <strong>3-4 years</strong> of experience in accounting for IT companies.</li>\n<li>Proficiency in <strong>Zoho Books</strong> and <strong>KEKA</strong>.</li>\n<li>Experience with a <strong>CA firm</strong> is advantageous.</li>\n<li>Strong knowledge of <strong>MS Office</strong> and <strong>MS Excel</strong>.</li>\n<li>Solid understanding of accounting principles and practices.</li>\n<li><strong>Immediate joiner preferred</strong>.</li>\n</ul>",
        "tags": [
            "3-4 Years",
            "Zoho Books",
            "MS Excel",
            "GST Compliance"
        ],
        "summary": "Finance and Accounts Executive role at Softnotions Technologies requires 3-4 years in IT accounting, proficiency in Zoho Books, and GST compliance expertise."
    },
    {
        "job_title": "Automation Tester",
        "company": "Ars Traffic & Transport Technology India (P) Ltd",
        "url": "https://technopark.org/job-details/26548",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>ARS Traffic &amp; Transport Technology India (P) Ltd</strong></p>\n<p><strong>Address:</strong> 131-135, First Floor, Nila Building, Technopark Campus, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.ars-traffic.com\">ars-traffic.com</a>\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published Date:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:ankitac@arstraffic.com\">ankitac@arstraffic.com</a></p>\n<h3><strong>Job Description</strong></h3>\n<p><strong>Role:</strong> Automation Tester\n<strong>Experience Required:</strong> 5+ years</p>\n<h4><strong>Key Responsibilities</strong></h4>\n<ul>\n<li>Test case selection for automation</li>\n<li>Creation and maintenance of test frameworks</li>\n<li>Development and maintenance of test cases</li>\n<li>Design and maintenance of test data for automated scripts</li>\n<li>Execution of automated test suites, failure analysis, reporting, and integration with DevOps pipelines</li>\n</ul>\n<h4><strong>Preferred Skills</strong></h4>\n<ul>\n<li>Share details on: Total Experience, CTC, ECTC, Notice Period, Reason for Change, Current Location, Preferred Location</li>\n</ul>\n<h4><strong>Contact</strong></h4>\n<p>For inquiries, reach out to Ankita via <a href=\"https://www.linkedin.com/in/ankita-chourasia-1266a86b/\">LinkedIn</a></p>",
        "tags": [
            "5+ Years",
            "Automation Testing",
            "Test Frameworks",
            "DevOps Integration"
        ],
        "summary": "Seeking an Automation Tester with 5+ years of experience in test automation, framework development, and DevOps pipeline integration."
    },
    {
        "job_title": "Senior HR Officer",
        "company": "Ars Traffic & Transport Technology India (P) Ltd",
        "url": "https://technopark.org/job-details/26547",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>ARS Traffic &amp; Transport Technology India (P) Ltd</strong>\n131-135, First Floor, Nila Building\nTechnopark Campus\nThiruvananthapuram, 695581\n<a href=\"http://www.ars-traffic.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<ul>\n<li><strong>Role</strong>: Senior HR Officer</li>\n<li><strong>Closing Date</strong>: 31, Jan 2026</li>\n<li><strong>Published Date</strong>: 06, Jan 2026</li>\n<li><strong>Contact Email</strong>: <a href=\"mailto:ankitac@arstraffic.com\">ankitac@arstraffic.com</a></li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Facilitate the onboarding process for new hires, ensuring a seamless transition into the organization.</li>\n<li><strong>Mandatory</strong>: Payroll experience.</li>\n<li>Contribute to employee engagement initiatives aimed at fostering a positive workplace culture and enhancing employee satisfaction.</li>\n<li>Coordinate employee training programs, monitor participation, and evaluate the effectiveness of these initiatives to promote continuous improvement.</li>\n<li>Support managers and employees in HR-related matters, including conflict resolution and performance management.</li>\n<li>Maintain accurate employee records and HR databases, ensuring data integrity and confidentiality.</li>\n<li>Assist in the development and implementation of HR policies and procedures, ensuring adherence to legal requirements.</li>\n<li>Participate in salary and labor market surveys to help inform compensation and benefits strategies.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Please share the following details:</li>\n<li>Total Experience</li>\n<li>CTC</li>\n<li>ECTC</li>\n<li>Notice Period</li>\n<li>Reason for Change</li>\n<li>Current Location</li>\n<li>Preferred Location</li>\n</ul>\n<h2>Contact</h2>\n<p><strong>Ankita Chourasia</strong>\n<a href=\"https://www.linkedin.com/in/ankita-chourasia-1266a86b/\">LinkedIn Profile</a></p>",
        "tags": [
            "5+ Years",
            "Payroll Management",
            "Employee Engagement",
            "HR Policy Development"
        ],
        "summary": "Senior HR Officer to manage onboarding, payroll, and employee engagement. Develop HR policies and coordinate training programs to enhance workplace culture."
    },
    {
        "job_title": "Service Analyst - Application Support Role",
        "company": "Ars Traffic & Transport Technology India (P) Ltd",
        "url": "https://technopark.org/job-details/26546",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>ARS Traffic &amp; Transport Technology India (P) Ltd</h2>\n<p><strong>Location:</strong> 131-135, First Floor, Nila Building, Technopark Campus, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.ars-traffic.com\">ars-traffic.com</a></p>\n<h3>Job Title: Service Analyst - Application Support Role</h3>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> <strong>ankitac@arstraffic.com</strong></p>\n<h3>Key Requirements:</h3>\n<ul>\n<li>Freshers with internship experience or up to <strong>2 years of relevant experience</strong></li>\n<li><strong>Technical background</strong> (B.Tech)</li>\n<li><strong>Strong communication skills</strong> (oral and written)</li>\n<li><strong>Basic Excel proficiency</strong>: lookups, pivots</li>\n<li><strong>Basic SQL queries</strong>: SELECT, UPDATE, DELETE, INSERT</li>\n<li><strong>Logical reasoning skills</strong> to identify anomalies and troubleshoot using logs/data-flow-diagrams (assessment required)</li>\n<li><strong>Preferred (but not mandatory):</strong> Entry-level scripting/data analysis tools (Power BI)</li>\n</ul>\n<h3>Application Details:</h3>\n<ul>\n<li>Share the following: Total Experience, CTC, ECTC, Notice Period, Reason for Change, Current/Preferred Location</li>\n</ul>\n<p><strong>Contact:</strong> Ankita\n<a href=\"https://www.linkedin.com/in/ankita-chourasia-1266a86b/\">LinkedIn Profile</a></p>",
        "tags": [
            "0-2 Years",
            "Excel",
            "SQL",
            "Power BI"
        ],
        "summary": "Entry-level Service Analyst role requiring 0-2 years experience, technical background, and basic Excel/SQL skills for application support. Candidates must demonstrate logical reasoning and communication abilities."
    },
    {
        "job_title": "Canva Designer",
        "company": "Expressare Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26545",
        "location": "Technopark",
        "closing_date": "07 Feb 2026",
        "job_description": "<p><strong>Company Information</strong></p>\n<ul>\n<li><strong>Name</strong>: Expressare Technologies (P) Ltd</li>\n<li><strong>Address</strong>: SBC - 21, Level -2, Tejaswini , 695581</li>\n<li><strong>Website</strong>: <a href=\"https://expressare.com\">https://expressare.com</a></li>\n</ul>\n<p><strong>Job Details</strong></p>\n<ul>\n<li><strong>Closing Date</strong>: 07, Feb 2026</li>\n<li><strong>Published Date</strong>: 06, Jan 2026</li>\n<li><strong>Contact Email</strong>: bency@expressare.com</li>\n</ul>\n<p><strong>Job Summary</strong></p>\n<p>We are seeking a creative and talented Canva Designer to join our team. The candidate is expected to come up with attention-grabbing content.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Bachelor's degree in computer science, design, or a related field.</li>\n<li>Should know basics of video editing using Canva.</li>\n<li>Excellent communication and collaboration skills.</li>\n</ul>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Understand the business environment and the requirements of the organization in designing.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Video editing using Canva</li>\n</ul>",
        "tags": [
            "Not Specified",
            "Canva Design",
            "Video Editing",
            "Communication Skills"
        ],
        "summary": "Creative Canva Designer needed for engaging content creation. Requires design expertise, Canva proficiency, and communication skills."
    },
    {
        "job_title": "Python Developer (1+ years experience)",
        "company": "Expressare Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26544",
        "location": "Technopark",
        "closing_date": "07 Feb 2026",
        "job_description": "<h2>Job Summary</h2>\n<p>We are seeking a passionate and skilled Full Stack Developer with <strong>1–2 years of experience</strong> in developing scalable web applications. The role requires expertise in <strong>Python (Django/Flask/FastAPI)</strong> for backend and <strong>React with TypeScript</strong> for frontend. The ideal candidate should possess strong problem-solving skills, the ability to work in a fast-paced environment, and a keen interest in building high-quality, maintainable software.</p>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Software Engineering, Information Technology, or a related field</li>\n<li><strong>1+ years of hands-on experience</strong> with Python (Django/Flask/FastAPI)</li>\n<li>Strong knowledge of React.js with TypeScript</li>\n<li>Proficiency in HTML5, CSS3, JavaScript (ES6+), REST APIs</li>\n<li>Experience with relational databases (PostgreSQL/MySQL)</li>\n<li>Familiarity with version control systems like Git</li>\n<li>Understanding of Agile/Scrum methodologies</li>\n<li>Good communication and problem-solving skills</li>\n</ul>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, test, and maintain web applications using Python/Django/Flask/FastAPI for backend</li>\n<li>Build and maintain frontend applications using React &amp; TypeScript</li>\n<li>Integrate APIs and ensure smooth communication between frontend and backend</li>\n<li>Write clean, scalable, and reusable code following industry best practices</li>\n<li>Debug, troubleshoot, and resolve issues across the stack</li>\n<li>Collaborate with designers, product managers, and developers to deliver quality solutions</li>\n<li>Participate in code reviews and contribute to continuous improvement</li>\n</ul>\n<h3>Mandatory Skills:</h3>\n<ul>\n<li><strong>OpenCV</strong> – Mandatory</li>\n<li><strong>spaCy or NLTK</strong> – Mandatory</li>\n<li><strong>Keras or TensorFlow or PyTorch</strong></li>\n<li>Familiarity with Hugging Face, BERT</li>\n</ul>\n<h3>Preferred:</h3>\n<ul>\n<li>Experience in AWS Services such as Lambda, EC2, Lightsail, S3, SQS, DynamoDb</li>\n<li>Experience with containerization using Docker or Kubernetes</li>\n<li>Experience with CI/CD tools such as Jenkins</li>\n</ul>\n<h3>About Us</h3>\n<p><strong>Expressare Technologies</strong> is a people-first organization focused on leveraging technology to transform work and life. We build precise technological solutions for individuals, businesses, and everyday problems. Our culture emphasizes creativity, innovation, and open communication, encouraging employees to push boundaries and deliver exceptional results.</p>\n<h3>Contact Information</h3>\n<p><strong>Email:</strong> <a href=\"mailto:bency@expressare.com\">bency@expressare.com</a>\n<strong>Website:</strong> <a href=\"https://expressare.com\">https://expressare.com</a>\n<strong>Location:</strong> SBC - 21, Level -2, Tejaswini, 695581</p>",
        "tags": [
            "1+ Years",
            "Python (Django/Flask/FastAPI)",
            "React with TypeScript",
            "OpenCV"
        ],
        "summary": "Seeking a Full Stack Developer with 1+ years of Python (Django/Flask/FastAPI) and React/TypeScript experience to build scalable web applications. Must have OpenCV and NLP library proficiency."
    },
    {
        "job_title": "Installation Executives: Senior/Junior Positions & Freshers",
        "company": "M Squared Software & Services (P) Ltd",
        "url": "https://technopark.org/job-details/26543",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Company:</strong> M Squared Software &amp; Services (P) Ltd\n<strong>Address:</strong> M Squared Building, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.m2india.com\">http://www.m2india.com</a></p>\n<h2>Job Title</h2>\n<p>Installation Executives: Senior/Junior Positions &amp; Freshers</p>\n<h3>Key Details</h3>\n<ul>\n<li><strong>Closing Date:</strong> 31, Jan 2026</li>\n<li><strong>Published Date:</strong> 06, Jan 2026</li>\n<li><strong>Contact Email:</strong> <a href=\"mailto:careers@m2comsys.us\">careers@m2comsys.us</a></li>\n</ul>\n<h3>Brief Description</h3>\n<p>Installation Executives: Senior &amp; Junior Positions</p>\n<h3>Qualifications</h3>\n<ul>\n<li><strong>Qualification:</strong> Diploma/ITI/Polytechnic/BMS</li>\n<li><strong>Senior Position Experience:</strong> 2+ years in <strong>CCTV</strong> and/or <strong>Office/Home Automation</strong></li>\n<li><strong>Junior Position Experience:</strong> Minimum 6 months in <strong>CCTV</strong> and/or <strong>Office/Home Automation</strong></li>\n<li><strong>Freshers:</strong> Eligible for Junior Position</li>\n</ul>\n<h3>Job Locations</h3>\n<ul>\n<li>Thiruvananthapuram</li>\n<li>Kochi</li>\n<li>Bengaluru</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Knowledge in <strong>Security &amp; Automation</strong> preferred.</li>\n</ul>\n<h3>Application Instructions</h3>\n<ul>\n<li>Email resumes to <strong>careers@m2comsys.us</strong> with subject line: <strong>\"Installation Exec - Senior/Junior/Fresher\"</strong></li>\n<li><strong>Note:</strong> Only male candidates need to apply for these positions.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "CCTV",
            "Office/Home Automation",
            "Security & Automation"
        ],
        "summary": "M Squared Software & Services seeks Installation Executives (Senior/Junior/Fresher) with 2+ years or 6 months experience in CCTV and Office/Home Automation. Candidates must hold a Diploma/ITI/Polytechnic/BMS and apply via email with specified subject line."
    },
    {
        "job_title": "React Developer (2-4 Years Experience)",
        "company": "Expressare Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26542",
        "location": "Technopark",
        "closing_date": "07 Feb 2026",
        "job_description": "<h2>Job Summary:</h2>\n<p>We are seeking an experienced <strong>React Developer</strong> to join our team. As a React Developer, you will develop dynamic, responsive, aesthetic, high-quality, and user-friendly web applications using React with either Typescript or JavaScript.</p>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor's or Master's degree in Computer Science, Software Engineering, Information Technology, or a related field</li>\n<li><strong>2-4 years</strong> of experience in web development with JavaScript or TypeScript</li>\n<li>Strong proficiency in <strong>React</strong>, <strong>Redux</strong>, <strong>Saga</strong>, <strong>emotion/styled components</strong></li>\n<li>Strong knowledge of <strong>Next.js 13</strong> or previous versions</li>\n<li>Proficiency in <strong>HTML</strong>, <strong>CSS</strong>, and libraries like <strong>Bootstrap</strong> or <strong>Tailwind</strong></li>\n<li>Experience with unit testing frameworks like <strong>Jest</strong>, <strong>Enzyme</strong>, or <strong>React Testing Library</strong></li>\n<li>Familiarity with <strong>Agile</strong> methodologies and tools like <strong>JIRA</strong> and <strong>Git</strong></li>\n<li>Excellent problem-solving skills and attention to detail</li>\n<li>Strong communication and collaborative teamwork abilities</li>\n</ul>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, test, and maintain high-quality web UI</li>\n<li>Collaborate with project managers, analysts, and developers to implement solutions</li>\n<li>Write clean, well-documented code following best practices</li>\n<li>Debug and troubleshoot software issues</li>\n<li>Develop unit/integration tests for quality assurance</li>\n<li>Participate in code reviews and provide feedback</li>\n</ul>\n<h3>Preferred:</h3>\n<ul>\n<li>Experience with <strong>TypeScript</strong> in React development</li>\n<li>Experience with <strong>Next.js</strong></li>\n</ul>\n<h3>Contact:</h3>\n<p>Email: <strong>bency@expressare.com</strong></p>\n<h3>About Expressare Technologies:</h3>\n<p>Expressare is a people-first organization focused on technological innovation. We build modern solutions for individuals and businesses, emphasizing accessibility and lightweight methodologies. We invest in employee growth and foster a culture of creativity and open communication.</p>\n<h3>Company Mission:</h3>\n<p>Founded to enable modern technology access, Expressare delivers software development, web/mobile app design, e-commerce solutions, and cloud computing services. Our mission is to transform work and life through technology.</p>",
        "tags": [
            "2-4 Years",
            "React",
            "Next.js",
            "TypeScript"
        ],
        "summary": "Seeking a React Developer with 2-4 years of experience to build dynamic web applications using React, Next.js, and TypeScript. Requires proficiency in front-end technologies and Agile methodologies."
    },
    {
        "job_title": "Immediate Requirement for International voice process @Technopark, Trivandrum",
        "company": "Prochant India (P) Ltd",
        "url": "https://technopark.org/job-details/26541",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Prochant India (P) Ltd</h2>\n<p><strong>Address:</strong> 2nd Floor, Block Niagra Embassy Tarus, Techzone Technology Phase -3, Main Road, Kazhakootam, Thiruvanthapuram, 695583\n<strong>Website:</strong> <a href=\"https://www.prochant.com\">https://www.prochant.com</a></p>\n<h3>Immediate Requirement for International Voice Process @ Technopark, Trivandrum</h3>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published Date:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> nikithai@prochant.com</p>\n<h3>Job Description for AR Caller (Voice Process)</h3>\n<ul>\n<li>Calling Insurance Companies on behalf of healthcare providers for claim status updates.</li>\n<li>Handling US Healthcare Providers Billing.</li>\n<li>Following up with Insurance Companies to check status of outstanding claims.</li>\n<li>Receiving payment information for processed claims.</li>\n<li>Analyzing rejected claims to identify resolution strategies.</li>\n<li>Ensuring deliverables meet quality standards.</li>\n</ul>\n<h3>Essential Functions</h3>\n<ul>\n<li><strong>Performance Standards:</strong> Meet/exceed productivity and quality benchmarks to deliver superior client experience.</li>\n<li><strong>Innovation:</strong> Propose process improvements to enhance efficiency and effectiveness.</li>\n<li><strong>Knowledge:</strong> Understand Revenue Cycle Management (RCM) to contextualize AR processes.</li>\n</ul>\n<h3>Interview Process</h3>\n<ul>\n<li><strong>Level 1:</strong> HR Interview</li>\n<li><strong>Level 2:</strong> Online Assessment</li>\n<li><strong>Level 3:</strong> Technical Interview</li>\n</ul>\n<h3>Shift Timings</h3>\n<ul>\n<li><strong>US Shift:</strong> 6:30 PM to 3:30 AM</li>\n<li><strong>Working Days:</strong> Monday to Friday (Saturday &amp; Sunday fixed off)</li>\n</ul>\n<h3>Benefits</h3>\n<ol>\n<li>Salary &amp; Appraisal - Best in Industry</li>\n<li>Training and support programs</li>\n<li>Monthly Performance Incentives up to ₹17,000/-</li>\n<li>Free dinner facility for night shift employees</li>\n<li>Career growth in Medical Billing</li>\n<li>Leadership programs</li>\n<li>Quarterly Rewards &amp; Recognition</li>\n<li>Upfront Leave Credit</li>\n<li>5-day workweek</li>\n<li>Two-way cab facility for female employees</li>\n<li>ESI and PF benefits</li>\n<li>Certification program with salary compensation</li>\n</ol>\n<h3>Contact Details</h3>\n<p><strong>Nikitha Isaac - HR</strong>\nPhone: 8248927284\nEmail: nikithai@prochant.com</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Immediate joiners with excellent English communication</li>\n<li>Strong written/verbal communication</li>\n<li>Graduates (2022–2025 passouts)</li>\n<li>Work prioritization and queue management</li>\n<li>Team collaboration and independent work</li>\n<li>Problem-solving and listening skills</li>\n<li>High-quality result delivery</li>\n<li>Quick learning ability</li>\n<li>Flexibility for any shift timing</li>\n</ul>\n<p><strong>For immediate joining, send resumes via WhatsApp to 8248927284</strong></p>",
        "tags": [
            "1-4 Years",
            "US Healthcare Providers Billing",
            "Insurance Claim Status",
            "Medical Billing"
        ],
        "summary": "AR Caller role involves managing US healthcare billing claims, ensuring quality, and resolving issues. Benefits include training, performance incentives, and career growth opportunities."
    },
    {
        "job_title": "Senior Digital Marketing Specialist -Immediate joinees prefered",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26540",
        "location": "Technopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</strong>\n<a href=\"https://softnotions.com\">Visit Website</a></p>\n<h3>Senior Digital Marketing Specialist</h3>\n<p><strong>Immediate Joinees Preferred</strong>\n<strong>Closing Date:</strong> 15, Jan 2026\n<strong>Published:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<p><strong>Brief Description</strong>\nDigital Marketing Lead with <strong>6+ years of IT experience</strong> in Digital Marketing. Candidates who can join within <strong>15 days</strong> are encouraged to apply.</p>\n<p><strong>Roles and Responsibilities:</strong>\n- Develop and implement digital marketing strategies across SEO, PPC, email marketing, social media, content marketing, and LinkedIn automation.\n- Follow best practices for social media marketing on platforms like Facebook, Instagram, LinkedIn, etc.\n- Launch optimized online advertisements to enhance brand awareness.\n- Create and manage link-building and content marketing strategies.\n- Measure ROIs and KPIs for campaign effectiveness.\n- Plan and execute social media strategies to drive traffic and engagement.\n- Stay updated on industry trends, technologies, and algorithm changes to optimize campaigns.\n- Monitor online reputation via social media and review platforms.</p>\n<p><strong>Preferred Skills:</strong>\n- MBA in Marketing or a Diploma in Digital Marketing.\n- Proven experience in digital marketing, preferably in similar roles.\n- Proficiency in tools like <strong>Google Analytics</strong>, <strong>Google Ads</strong>, <strong>SEO tools</strong>, email marketing platforms, and social media management tools.\n- Experience managing PPC campaigns (keyword research, bid management, performance tracking).\n- Strong analytical skills for data-driven decision-making.\n- Up-to-date knowledge of SEO best practices and search engine algorithms.\n- Excellent communication skills for creating persuasive content.\n- Self-motivated with a proactive approach to problem-solving and learning.</p>\n<p><strong>Experience:</strong> 6+ years preferred.</p>",
        "tags": [
            "6+ Years",
            "Google Analytics",
            "Google Ads",
            "SEO"
        ],
        "summary": "Senior Digital Marketing Specialist with 6+ years of experience to lead campaigns, manage SEO/PPC, and drive brand awareness through data-driven strategies."
    },
    {
        "job_title": "Junior Accountant",
        "company": "Resfeber Infosolutions (P) Ltd",
        "url": "https://technopark.org/job-details/26539",
        "location": "Technopark",
        "closing_date": "23 Jan 2026",
        "job_description": "<h2><strong>Company Information</strong></h2>\n<p><strong>Resfeber Infosolutions (P) Ltd</strong>\nC-DAC Building, 4th Floor, Technopark Campus, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.travelspoc.com\">Website</a></p>\n<h2><strong>Job Summary</strong></h2>\n<p>We are seeking a <strong>Junior Accountant</strong> (female candidates preferred) to join our team. You will assist in financial tasks, maintain records, and support our accounting operations.</p>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Assist in financial statement preparation</li>\n<li>Manage accounts payable/receivable</li>\n<li>Maintain financial records and ledgers</li>\n<li>Support audit and compliance tasks</li>\n<li>Other tasks as assigned</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<ul>\n<li>0-3 years of experience</li>\n<li>Basic accounting knowledge (Tally, Excel)</li>\n<li>Good communication skills</li>\n</ul>\n<h2><strong>Preferred Skills</strong></h2>\n<ul>\n<li>Recording financial transactions and maintaining accurate records</li>\n<li>Preparing financial reports (balance sheets, income statements, cash flow statements)</li>\n<li>Assisting with accounts payable/receivable, invoicing, and payment processing</li>\n<li>Payroll processing and tax preparation</li>\n<li>Ensuring compliance with accounting standards and company policies</li>\n<li>Conducting basic financial analysis</li>\n<li>Good team player with a positive attitude</li>\n<li>Ability to work independently and handle uncertainty</li>\n</ul>\n<h2><strong>Application Instructions</strong></h2>\n<ul>\n<li>Email your resume to <strong>kavitha@resfeberinfosolutions.com</strong> with the subject <strong>'SSC 1016 Software ConsultantPHP'</strong></li>\n<li>Include the following in your email content:</li>\n<li>Experience</li>\n<li>Current Location</li>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li><strong>Note</strong>: Applications without the specified subject line will not be considered.</li>\n</ul>\n<h2><strong>Job Details</strong></h2>\n<ul>\n<li><strong>Closing Date</strong>: 23, Jan 2026</li>\n<li><strong>Published Date</strong>: 06, Jan 2026</li>\n<li><strong>Contact Email</strong>: hr@travelspoc.com</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "Tally",
            "Excel",
            "Financial Analysis"
        ],
        "summary": "Junior Accountant role requiring 0-3 years of experience with Tally and Excel. Responsibilities include financial record-keeping, accounts payable/receivable, and compliance support."
    },
    {
        "job_title": "Digital marketing Trainee (Fully Remote)",
        "company": "Richinnovations Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26538",
        "location": "Technopark",
        "closing_date": "20 Jan 2026",
        "job_description": "<p><strong>Company</strong>: Richinnovations Technologies (P) Ltd\n<strong>Location</strong>: Fully Remote\n<strong>Closing Date</strong>: 20, Jan 2026\n<strong>Published Date</strong>: 06, Jan 2026\n<strong>Contact Email</strong>: hr@richinnovationsplc.com</p>\n<h3>Job Description</h3>\n<p>If you enjoy storytelling, exploring creative tools, and want real-world experience in digital content creation, this internship is an excellent opportunity.</p>\n<h3>Who Can Apply</h3>\n<ul>\n<li>Students currently pursuing studies</li>\n<li>Individuals interested in gaining professional social media experience</li>\n</ul>\n<h3>Who We’re Looking For</h3>\n<ul>\n<li>Strong interest in social media, reels, short-form videos, and creative editing</li>\n<li>Basic knowledge of Instagram with a willingness to learn more</li>\n<li>Fluency in Malayalam and English</li>\n<li>Creative, energetic, and open to experimenting with new ideas</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Good communication</li>\n<li>Interest in digital marketing</li>\n<li>Creative and storytelling personality</li>\n</ul>",
        "tags": [
            "Entry Level",
            "Social Media",
            "Creative Editing",
            "Malayalam & English Fluency"
        ],
        "summary": "Digital Marketing Trainee role for students/professionals seeking hands-on experience in social media, creative content creation, and digital storytelling. Requires fluency in Malayalam/English and passion for digital trends."
    },
    {
        "job_title": "PHP Developer",
        "company": "Richinnovations Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26537",
        "location": "Technopark",
        "closing_date": "17 Jan 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Richinnovations Technologies (P) Ltd</strong>\nKSUM, Ground floor, Tejaswini Building, Technopark, Kazhakuttom, Trivandrum, Kerala, India. 695581\n<a href=\"https://www.richinnovationsplc.com\">Company Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Closing Date:</strong> 17, Jan 2026\n<strong>Published Date:</strong> 06, Jan 2026\n<strong>Contact Email:</strong> hr@richinnovationsplc.com</p>\n<h2>Brief Description</h2>\n<p>We are seeking a motivated <strong>PHP Developer</strong> to join our team. Immediate joiners are preferred.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Maintain, update, and enhance existing PHP-based projects.</li>\n<li>Collaborate with senior developers to design and develop new web applications and features.</li>\n<li>Debug and troubleshoot issues in existing code, ensuring optimal performance.</li>\n<li>Write clean, well-documented, and efficient code following industry best practices.</li>\n<li>Participate in code reviews and contribute to improving development processes.</li>\n<li>Stay updated with the latest trends and technologies in PHP and web development.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Proficiency in PHP, MySQL, HTML, CSS, and JavaScript.</li>\n<li>Familiarity with version control systems like Git.</li>\n<li>Mandatory understanding of MVC frameworks (Laravel).</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Ability to work collaboratively in a team environment.</li>\n<li>Eagerness to learn and grow in a fast-paced setting.</li>\n</ul>",
        "tags": [
            "1 Year",
            "PHP",
            "Laravel",
            "Git"
        ],
        "summary": "PHP Developer with 1+ year experience required to maintain projects, collaborate on new applications, and utilize Laravel. Must have strong problem-solving and team collaboration skills."
    },
    {
        "job_title": "HR Generalist",
        "company": "Innovation Incubator Advisory (P) Ltd",
        "url": "https://technopark.org/job-details/26536",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Innovation Incubator Advisory (P) Ltd</h2>\n<p><strong>Address:</strong> Module No.421, 4th Floor, Nila Building, Technopark Phase-I Campus, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://innovationincubator.com\">https://innovationincubator.com</a>\n<strong>Contact Email:</strong> fannie.na@iinerds.com\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 05, Jan 2026</p>\n<h3>Role Overview</h3>\n<p>We are seeking a proactive <strong>HR Generalist</strong> to manage day-to-day operations with a strong emphasis on <strong>Talent Development</strong> and <strong>Employee Experience</strong>. This role is designed for an HR professional who can independently lead recruitment cycles, design impactful training programs, and foster a high-performance culture through strategic engagement initiatives.</p>\n<h3>Key Responsibilities</h3>\n<h4>1. Training &amp; Development (L&amp;D)</h4>\n<ul>\n<li><strong>Training Needs Analysis:</strong> Conduct annual skills gap analyses across departments to identify specific training requirements.</li>\n<li><strong>Program Design:</strong> Develop and facilitate internal training modules (soft skills, leadership basics, and compliance) or source specialized external vendors.</li>\n<li><strong>L&amp;D Budgeting:</strong> Assist in managing the annual training budget and track the Return on Investment for all learning programs.</li>\n<li><strong>Career Pathing:</strong> Work with department heads to map out career development paths and succession planning for high-potential employees.</li>\n</ul>\n<h4>2. Employee Engagement &amp; Culture</h4>\n<ul>\n<li><strong>Engagement Strategy:</strong> Design and launch employee engagement surveys; analyze feedback to implement actionable improvements to workplace culture.</li>\n<li><strong>Recognition Programs:</strong> Own the end-to-end execution of employee recognition awards and \"Employee of the Month\" programs to boost morale.</li>\n<li><strong>Internal Communication:</strong> Manage internal newsletters or Slack/Teams channels to ensure transparent communication of company milestones and HR updates.</li>\n<li><strong>Event Leadership:</strong> Lead the planning of large-scale corporate events, team-building retreats, and wellness initiatives that align with company values.</li>\n</ul>\n<h4>3. Core HR Operations</h4>\n<ul>\n<li><strong>Full-Cycle Recruitment:</strong> Manage the end-to-end hiring process for mid-level roles, from sourcing to final offer negotiation.</li>\n<li><strong>Employee Relations:</strong> Serve as a trusted advisor to employees and managers, resolving complex interpersonal conflicts and performance issues.</li>\n<li><strong>Compliance &amp; Payroll:</strong> Oversee payroll accuracy and ensure all HR practices remain compliant with evolving labor laws.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 3–5 years of HR experience, with at least 1–2 years focused on L&amp;D or Employee Engagement.</li>\n<li><strong>Education:</strong> Bachelor’s degree in HR, Psychology, or Business. A certification in Instructional Design or Training Coordination is a plus.</li>\n<li><strong>Skills:</strong> <em>Proven ability to speak in front of groups and facilitate workshops.</em></li>\n<li><strong>Analytical mindset:</strong> Ability to turn survey data into a culture-improvement roadmap.</li>\n<li>**High proficiency in LMS and engagement tools.</li>\n</ul>",
        "tags": [
            "3–5 Years",
            "Learning & Development (L&D)",
            "Employee Engagement",
            "Instructional Design"
        ],
        "summary": "HR Generalist to lead talent development, employee engagement, and strategic HR operations with 3-5 years of L&D and engagement experience."
    },
    {
        "job_title": "ACCOUNTANT",
        "company": "Kawika Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26535",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Kawika Technologies (P) Ltd\n<strong>Address:</strong> ACE 20, 5th Floor, CDAC Building, Technopark, 695581\n<strong>Website:</strong> <a href=\"http://www.kawikatechnologies.com\">http://www.kawikatechnologies.com</a>\n<strong>Contact Email:</strong> hr@kawikatechnologies.com</p>\n<p><strong>Closing Date:</strong> 10, Feb 2026\n<strong>Job Published:</strong> 05, Jan 2026</p>\n<h3><strong>Job Description</strong></h3>\n<p>We are seeking a detail-oriented and reliable <strong>Accountant</strong> to manage financial operations for our growing IT firm. The ideal candidate will handle day-to-day accounting tasks, ensure compliance with statutory requirements, and support financial planning and reporting.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Maintain books of accounts, including journal entries, ledgers, and reconciliations</li>\n<li>Prepare monthly, quarterly, and annual financial statements</li>\n<li>Handle accounts payable and receivable</li>\n<li>Manage payroll processing and related compliances</li>\n<li>Ensure compliance with GST, TDS, income tax, and other statutory regulations</li>\n<li>Assist in budgeting, forecasting, and financial analysis</li>\n<li>Coordinate with auditors and tax consultants</li>\n<li>Monitor expenses and support cost-control initiatives</li>\n</ul>\n<h3><strong>Requirements &amp; Qualifications</strong></h3>\n<ul>\n<li>Bachelor’s degree in Accounting, Finance, or Commerce</li>\n<li>Professional qualification (CA Inter / CMA / MBA Finance) is a plus</li>\n<li>Proven experience as an Accountant, preferably in an IT or services company</li>\n<li>Strong knowledge of accounting principles and taxation (GST, TDS)</li>\n<li>Proficiency in accounting software (Tally, Zoho Books, QuickBooks, etc.)</li>\n<li>Good knowledge of MS Excel</li>\n<li>Strong attention to detail and analytical skills</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Experience working in an IT or software services environment</li>\n<li>Ability to meet deadlines and work independently</li>\n<li>Good communication and coordination skills</li>\n</ul>\n<h3><strong>What We Offer</strong></h3>\n<ul>\n<li>Competitive salary</li>\n<li>Professional growth opportunities</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "GST",
            "TDS",
            "Tally"
        ],
        "summary": "Accountant role for IT firm managing financial operations, compliance, and reporting. Requires accounting expertise with GST/TDS and software proficiency."
    },
    {
        "job_title": "Cyber Security Associate (Job code CSA/102025/587)",
        "company": "Kerala University Of Digital Sciences, Innovation And Technology",
        "url": "https://technopark.org/job-details/26534",
        "location": "Technopark",
        "closing_date": "19 Jan 2026",
        "job_description": "<p><strong>Cyber Security Associate</strong></p>\n<p><strong>Location:</strong> Kerala University of Digital Sciences, Innovation and Technology, Technopark Phase-IV Campus (Technocity), Mangalappuram, Thonnakkal PO, Trivandrum, Kerala, 695317</p>\n<p><strong>Closing Date:</strong> 19, Jan 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> recruitments@duk.ac.in</p>\n<p><strong>Overview</strong>:\nKerala University of Digital Sciences, Innovation and Technology invites applications for the <strong>Cyber Security Associate</strong> role (Job Code: CSA/102025/587) under the KSAAC project. The position is on a <strong>contract basis</strong>, and applications must be submitted online via the <a href=\"https://www.duk.ac.in/careers\">Recruitment Portal</a> by 19.01.2026.</p>\n<p><strong>Essential Qualifications</strong>:\n- Undergraduate degree from a recognized university/educational institution.</p>\n<p><strong>Experience Requirements</strong>:\n- <strong>UG Graduates</strong>: Minimum 1 year of experience in <strong>Vulnerability Assessment and Penetration Testing (VAPT)</strong> or cybersecurity training.\n- <strong>PG / PG Diploma in Cyber Security</strong>: No experience required.\n- Final semester students are eligible to apply.</p>\n<p><strong>Job Responsibilities</strong>:\n- Conduct VAPT on applications, systems, and networks.\n- Collaborate with development and operational teams for security auditing.\n- Document and communicate vulnerabilities with detailed remediation steps.\n- Prioritize and address security gaps with clients/internal teams.\n- Assist in cybersecurity training and consulting services.</p>\n<p><strong>Preferred Skills</strong>:\n- Certifications in CEH, CSA, Security+, CySA+, etc.\n- Knowledge of network/systems technologies, firewalls, and technical reporting.\n- Strong communication skills.</p>\n<p><strong>Application Process</strong>:\nSubmit applications online at <a href=\"https://www.duk.ac.in/careers\">https://www.duk.ac.in/careers</a> by the deadline.</p>",
        "tags": [
            "1 Year",
            "Vulnerability Assessment and Penetration Testing (VAPT)",
            "Cybersecurity Training",
            "Security Certifications (CEH/CSA)"
        ],
        "summary": "Cyber Security Associate role at Kerala University requires 1 year of VAPT experience or cybersecurity training. Responsibilities include security auditing, vulnerability reporting, and training support."
    },
    {
        "job_title": "PHP - Laravel Developer",
        "company": "Kawika Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26533",
        "location": "Technopark",
        "closing_date": "02 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Kawika Technologies (P) Ltd\n<strong>Address:</strong> ACE 20, 5th Floor, CDAC Building, Technopark, 695581\n<strong>Website:</strong> <a href=\"http://www.kawikatechnologies.com\">http://www.kawikatechnologies.com</a>\n<strong>Job Title:</strong> PHP - Laravel Developer\n<strong>Closing Date:</strong> 02, Feb 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@kawikatechnologies.com\">hr@kawikatechnologies.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a skilled and motivated <strong>PHP Laravel Developer</strong> with <strong>2 years</strong> of hands-on experience to join our development team. The ideal candidate should have strong knowledge of PHP, Laravel framework, and web application development, capable of independently handling modules while collaborating effectively with the team.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Design, develop, test, and maintain web applications using PHP and Laravel.</li>\n<li>Analyze project requirements and translate them into technical solutions.</li>\n<li>Write clean, secure, optimized, and well-documented code following best practices.</li>\n<li>Develop and maintain RESTful APIs and integrate third-party services.</li>\n<li>Troubleshoot, debug, and enhance existing applications for performance and reliability.</li>\n<li>Collaborate with front-end developers using HTML, CSS, JavaScript, and Bootstrap.</li>\n<li>Design, optimize, and manage MySQL databases, queries, and migrations.</li>\n<li>Participate in code reviews, team discussions, and sprint planning.</li>\n<li>Follow software development standards, security practices, and version control (Git).</li>\n<li>Stay updated with new tools, Laravel updates, and emerging web technologies.</li>\n</ul>\n<h3><strong>Required Skills &amp; Qualifications</strong></h3>\n<ul>\n<li><strong>Experience:</strong> Minimum 2 years of professional PHP development.</li>\n<li><strong>Education:</strong> Bachelor’s degree / B.Tech / B.E. in Computer Science, IT, or related field.</li>\n<li>Strong knowledge of PHP and Object-Oriented Programming (OOP).</li>\n<li>Hands-on experience with Laravel; knowledge of other MVC frameworks is an advantage.</li>\n<li>Proficiency in MySQL and relational database design.</li>\n<li>Expertise in HTML, CSS, JavaScript, and Bootstrap.</li>\n<li>Experience with Git or other version control systems.</li>\n<li>Problem-solving skills and ability to provide efficient solutions.</li>\n<li>Strong communication and teamwork capabilities.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Experience with API integration and authentication mechanisms.</li>\n<li>Basic understanding of server deployment and hosting environments.</li>\n<li>Familiarity with Agile/Scrum methodologies.</li>\n<li>Knowledge of performance optimization and security best practices.</li>\n</ul>\n<h3><strong>How to Apply</strong></h3>\n<p>Send your updated resume to <a href=\"mailto:hr@kawikatechnologies.com\">hr@kawikatechnologies.com</a></p>",
        "tags": [
            "2+ Years",
            "Laravel",
            "PHP",
            "MySQL"
        ],
        "summary": "Kawika Technologies seeks a PHP Laravel Developer with 2+ years experience to design, develop, and maintain web applications using Laravel, MySQL, and front-end technologies."
    },
    {
        "job_title": "Java Developer",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26532",
        "location": "Technopark",
        "closing_date": "14 Jan 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Address:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Closing Date:</strong> 14, Jan 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Job Title: Java Developer</h3>\n<h4>Brief Description</h4>\n<p>We are hiring a <strong>Java–J2EE Developer</strong> with <strong>minimum 4 years of experience</strong> in enterprise application development, J2EE architecture, REST/SOAP services, and application servers. Basic working knowledge of Oracle and/or open-source databases is mandatory.</p>\n<h4>Qualification &amp; Experience</h4>\n<ul>\n<li>Bachelor’s / Postgraduate degree in Computer Science / IT / Engineering or equivalent</li>\n<li><strong>Minimum 4 years of hands-on experience</strong> in Java–J2EE application development</li>\n<li>Experience with enterprise-scale and web-based applications</li>\n</ul>\n<h4>Technical Proficiency – Java / J2EE</h4>\n<ul>\n<li><strong>Must demonstrate strong proficiency in:</strong></li>\n<li>Java &amp; J2EE Technologies<ul>\n<li>Java</li>\n<li>J2EE architecture and enterprise application concepts</li>\n</ul>\n</li>\n<li>Servlets, JSP, JDBC</li>\n<li>OOP principles, design patterns, and coding standards</li>\n</ul>\n<h4>Frameworks &amp; Web Technologies</h4>\n<ul>\n<li>Experience with <strong>Spring / Spring Boot</strong> (preferred)</li>\n<li>Development of <strong>RESTful and/or SOAP-based web services</strong></li>\n<li>Working knowledge of HTML, CSS, JavaScript</li>\n<li>Understanding of client–server architecture</li>\n</ul>\n<h4>Application Servers</h4>\n<ul>\n<li>Experience deploying and supporting applications on:</li>\n<li>Apache Tomcat</li>\n<li>JBoss / Wildfly</li>\n<li>WebLogic (advantage)</li>\n</ul>\n<h4>Development Practices</h4>\n<ul>\n<li>Strong understanding of <strong>SDLC and Agile methodologies</strong></li>\n<li>Experience with version control systems (Git or equivalent)</li>\n<li>Ability to debug, test, and maintain enterprise applications</li>\n</ul>\n<h4>Database Skills (Mandatory – Basic DBA Knowledge)</h4>\n<ul>\n<li><strong>Basic working knowledge of Oracle DBA or Open-Source DBA concepts</strong></li>\n<li>Strong SQL knowledge for:</li>\n<li>Writing and optimizing queries</li>\n<li>Working with tables, indexes, views, and constraints</li>\n<li>Basic understanding of:</li>\n<li>Database installation concepts</li>\n<li>Backup and recovery concepts</li>\n<li>User roles, privileges, and security</li>\n<li>Database performance considerations</li>\n<li>Exposure to Oracle Database and/or PostgreSQL/MySQL</li>\n</ul>\n<h4>Desirable / Advantageous Skills</h4>\n<ul>\n<li>ORM frameworks (Hibernate / JPA)</li>\n<li>J2EE security concepts</li>\n<li>Basic Linux/Unix commands and shell scripting</li>\n<li>CI/CD pipelines (Jenkins, GitLab CI, etc.)</li>\n<li>Containerization (Docker)</li>\n<li>Cloud platforms (AWS / Azure / OCI)</li>\n</ul>\n<h4>Roles &amp; Responsibilities</h4>\n<ul>\n<li>Design and develop NLTA applications and Mobile Apps</li>\n<li>Monitor, analyze, and develop NLTA Database</li>\n<li>Migrate applications and databases</li>\n<li>Install, configure, and fine-tune RDBMS</li>\n<li>Create database structures (tablespace, indexes, objects)</li>\n<li>Troubleshoot NLTA Database and Application issues</li>\n<li>Ensure availability of NLTA Database and application</li>\n<li>Collaborate with stakeholders and the Maintenance team</li>\n<li>Deploy NLTA applications in local offices (Rodrigues, Outer islands)</li>\n<li>Deploy, publish, and install Mobile Apps</li>\n<li>Provide technical support to NLTA users</li>\n<li>Big Data Analytics</li>\n<li>Advise on system configuration, policies, and practices</li>\n<li>Document all NLTA Services activities</li>\n<li>Provide administration tools/dashboards for monitoring/troubleshooting</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Java/J2EE",
            "Spring Boot",
            "REST/SOAP"
        ],
        "summary": "Java Developer with 4+ years in enterprise application development, J2EE, REST/SOAP, and database management."
    },
    {
        "job_title": "System Administrator",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26531",
        "location": "Technopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Location:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Closing Date:</strong> 15, Jan 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Brief Description</h3>\n<p><strong>Roles &amp; Responsibilities</strong>\n- Set up, configure, monitor, and analyse system and network activities\n- Troubleshoot and resolve system and infrastructure issues\n- Ensure high availability and reliability of system resources and services\n- Configure and maintain system monitoring dashboards\n- Provide technical support to users\n- Work closely with internal teams, vendors, and stakeholders\n- Advise on system configurations, policies, and best practices\n- Support implementation of new technologies and system improvements\n- Document all activities carried out during the execution of client services</p>\n<h3>Preferred Skills &amp; Requirements</h3>\n<ul>\n<li>Graduate in ICT / Computer Science / Information Technology or a related field</li>\n<li>Minimum 4 years of experience in network and system administration</li>\n<li>Hands-on experience in Linux and Windows environments</li>\n<li>Experience with SAN and Storage systems will be an added advantage</li>\n</ul>\n<p><strong>Key Responsibilities:</strong>\n- Installation, configuration, and administration of Linux and Windows servers\n- Monitoring and analysis of system performance and activities\n- System troubleshooting and fault resolution\n- Managing existing infrastructure and services\n- Knowledge of system availability, capacity planning, and resource management\n- Ability to set up and manage system monitoring dashboards\n- Understanding of network fundamentals and server security best practices\n- Strong problem-solving and analytical skills\n- Good communication and coordination abilities\n- Ability to work independently and as part of a team\n- Strong focus on documentation and process compliance\n- Proactive approach to system improvement and stability</p>",
        "tags": [
            "4+ Years",
            "Linux",
            "Windows",
            "SAN/Storage"
        ],
        "summary": "System Administrator role requiring 4+ years of experience in managing Linux/Windows environments, infrastructure troubleshooting, and system optimization. Focus on high availability, security, and collaboration with teams."
    },
    {
        "job_title": "Junior Product / Customer Success Executive",
        "company": "Sequoiaat India (P) Ltd",
        "url": "https://technopark.org/job-details/26528",
        "location": "Technopark",
        "closing_date": "28 Jan 2026",
        "job_description": "<h2>SequoiaAT India (P) Ltd</h2>\n<p><strong>Module No.1A, Ground Floor, PERIYAR Building, Phase-I Campus, Technopark, 695581</strong>\n<a href=\"http://www.sequoiaat.com\">http://www.sequoiaat.com</a></p>\n<h3>Junior Product / Customer Success Executive</h3>\n<p><strong>Closing Date:</strong> 28, Jan 2026\n<strong>Job Published:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> recruitment@sequoiaat.com</p>\n<h3>Role Overview</h3>\n<p>We are seeking a junior-level professional to handle product demos, customer onboarding, basic issue resolution, and drive adoption of paid features for the Offrd platform. This customer-facing role requires excellent communication skills and basic technical understanding.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Product Demos &amp; Onboarding</strong>\n- Conduct live product demos for prospective customers via Zoom/Teams\n- Onboard new customers and guide them through key product features\n- Clearly explain product value and real-life use cases</p>\n<p><strong>Customer Support &amp; Issue Handling</strong>\n- Act as the first point of contact for customer-reported issues\n- Troubleshoot and fix minor functional or configuration issues\n- Coordinate with engineering/product teams for complex issues\n- Ensure timely follow-ups and customer satisfaction</p>\n<p><strong>Paid Feature Adoption &amp; Upsell</strong>\n- Educate customers on premium and paid features\n- Persuade customers to upgrade by highlighting benefits and ROI\n- Support customers during trial-to-paid conversion</p>\n<p><strong>Customer Communication</strong>\n- Maintain professional and empathetic communication with customers\n- Handle objections, questions, and feedback effectively\n- Maintain basic documentation of customer interactions and issues</p>\n<h3>Required Skills &amp; Qualifications</h3>\n<p><strong>Experience:</strong>\n- 1–2 years in SaaS product demos, customer success, support, or pre-sales</p>\n<p><strong>Skills:</strong>\n- Excellent spoken and written English\n- Ability to speak Hindi (preferred)\n- Basic understanding of web/mobile applications and SaaS workflows\n- Comfortable using Zoom/Teams/Google Meet and ticketing/CRM tools (basic level)\n- Good problem-solving and analytical skills</p>",
        "tags": [
            "1-2 Years",
            "SaaS",
            "Customer Success",
            "Zoom/Teams"
        ],
        "summary": "Junior role for SaaS product demos, customer onboarding, and support. Requires 1-2 years in customer success and technical communication skills."
    },
    {
        "job_title": "SQL Support Engineer",
        "company": "Se-Mentor Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26527",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>SE-Mentor Solutions (P) Ltd</strong>\n2nd Floor, Gayathri Building, Technopark Campus\nTrivandrum, Kerala, India , 695581\n<a href=\"http://www.se-mentor.com\">http://www.se-mentor.com</a></p>\n<h2>Job Details</h2>\n<ul>\n<li><strong>Closing Date</strong>: 31, Jan 2026</li>\n<li><strong>Published Date</strong>: 05, Jan 2026</li>\n<li><strong>Contact Email</strong>: careers@se-mentor.com</li>\n<li><strong>Experience Required</strong>: 3+ Years</li>\n<li><strong>Location</strong>: Kochi, Kerala</li>\n<li><strong>Employment Type</strong>: Full-time</li>\n</ul>\n<h2>Role Overview</h2>\n<p>We are seeking a dedicated <strong>Production Support Engineer</strong> with expertise in <strong>MS SQL Server</strong> and <strong>SSIS</strong> to join our team in Kochi. Responsibilities include ensuring the stability, reliability, and performance of data integration pipelines and database systems, troubleshooting ETL failures, and collaborating with development teams for bug fixes.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li><strong>Monitoring &amp; Troubleshooting</strong>: Monitor scheduled SSIS packages and SQL Agent jobs. Resolve failures promptly to meet SLAs.</li>\n<li><strong>Incident Management</strong>: Handle L2/L3 support tickets for data discrepancies, performance issues, and connectivity problems using ServiceNow/Jira.</li>\n<li><strong>Performance Tuning</strong>: Analyze long-running queries and SSIS packages. Recommend indexing, query optimization, and resource management.</li>\n<li><strong>Data Integrity</strong>: Conduct root cause analysis (RCA) for data issues and ensure high-quality data in production environments.</li>\n<li><strong>Maintenance</strong>: Support database deployments, patch testing, and environment synchronization.</li>\n<li><strong>On-Call Support</strong>: Participate in rotational on-call schedules for critical production systems.</li>\n</ul>\n<h2>Technical Requirements</h2>\n<ul>\n<li><strong>SQL Server</strong>: Minimum 3 years of experience with T-SQL, Stored Procedures, Views, Triggers, and Functions.</li>\n<li><strong>SSIS</strong>: Strong debugging and maintenance of ETL packages, including error handling, logging, and deployment models.</li>\n<li><strong>Database Administration</strong>: Basic knowledge of SQL Server architecture, backups, restores, and security permissions.</li>\n<li><strong>Tools</strong>: Experience with SQL Profiler, Execution Plans, and version control (TFS/GIT).</li>\n<li><strong>Support Experience</strong>: Proven background in Production Support or Application Support with ITIL process knowledge.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Experience with scheduling tools like Control-M, Autosys, or ActiveBatch.</li>\n<li>Knowledge of SSRS (Reporting Services) or Power BI.</li>\n<li>Strong communication skills for stakeholder and cross-team collaboration.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "SQL Server",
            "SSIS",
            "T-SQL"
        ],
        "summary": "Seeking a Production Support Engineer with 3+ years in SQL Server and SSIS to monitor, troubleshoot, and optimize data integration pipelines and database systems."
    },
    {
        "job_title": "Digital Marketing Expert",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/26525",
        "location": "Technopark",
        "closing_date": "14 Jan 2026",
        "job_description": "<h2>Klystron Technologies</h2>\n<p><strong>Office No.:</strong> 2210, Yamuna Building, Technopark Phase-III, 695583\n<strong>Website:</strong> <a href=\"https://www.klystronglobal.com\">https://www.klystronglobal.com</a>\n<strong>Closing Date:</strong> 14, Jan 2026\n<strong>Job Published:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> jobs.in@klystronglobal.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a highly skilled and versatile <strong>Digital Marketing Expert</strong> to join our team. The ideal candidate will combine expertise in <strong>SEO, graphic design, UI/UX, video editing, and web development</strong> to deliver creative campaigns, optimize online presence, and enhance user engagement across digital platforms.</p>\n<h3>Key Responsibilities</h3>\n<h4>SEO &amp; Website Optimization</h4>\n<ul>\n<li>Develop and execute SEO strategies to improve website traffic and search engine rankings.</li>\n<li>Conduct keyword research, technical audits, on-page/off-page optimization.</li>\n<li>Track performance using Google Analytics, Search Console, and other tools.</li>\n</ul>\n<h4>Graphic Design</h4>\n<ul>\n<li>Create engaging visuals for social media, ads, websites, and marketing campaigns.</li>\n<li>Ensure brand consistency across all designs and platforms.</li>\n</ul>\n<h4>UI &amp; UX Design</h4>\n<ul>\n<li>Improve user journeys on websites and landing pages to boost engagement and conversions.</li>\n<li>Conduct user research, wireframing, and prototyping using tools like Figma or Adobe XD.</li>\n</ul>\n<h4>Video Editing</h4>\n<ul>\n<li>Edit and produce promotional videos, reels, and content for social media/ads.</li>\n<li>Add motion graphics, effects, and branding elements to enhance video quality.</li>\n</ul>\n<h4>Web Development</h4>\n<ul>\n<li>Manage and maintain company websites (WordPress or custom-built).</li>\n<li>Implement landing pages, website updates, and ensure mobile-friendly responsiveness.</li>\n<li>Collaborate with teams to integrate SEO and UX best practices into development.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience as a Digital Marketing Expert or similar role.</li>\n<li>Strong knowledge of SEO tools (Ahrefs, SEMrush, Google Analytics, etc.).</li>\n<li>Proficiency in design tools (Photoshop, Illustrator, Canva, etc.).</li>\n<li>Experience in UI/UX design (Figma, Adobe XD, Sketch, etc.).</li>\n<li>Skilled in video editing software (Adobe Premiere Pro, After Effects, Final Cut Pro, etc.).</li>\n<li>Hands-on experience with web development (WordPress, HTML, CSS, JavaScript).</li>\n<li>Ability to manage multiple projects and deliver high-quality work on time.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "SEO",
            "UI/UX Design",
            "Video Editing"
        ],
        "summary": "Klystron Technologies seeks a Digital Marketing Expert with SEO, UI/UX, and video editing skills to enhance online presence and user engagement through multifaceted digital strategies."
    },
    {
        "job_title": "Sales Associate",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/26524",
        "location": "Technopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<h2>Company Overview</h2>\n<p>Klystron Technologies is a leading provider of innovative technology products, specializing in <strong>Self-Service Kiosks</strong>, <strong>AI Solutions</strong>, <strong>Odoo ERP</strong>, <strong>Payment Solutions</strong>, <strong>Software Testing</strong>, and <strong>DevOps</strong>. With a commitment to excellence and customer satisfaction, the company delivers cutting-edge solutions to enhance business efficiency and growth globally.</p>\n<h2>Position Summary</h2>\n<p>As a <strong>Sales Associate</strong>, you will drive revenue growth and market expansion by developing and executing sales strategies. Responsibilities include building customer relationships, leading cross-functional teams, and leveraging digital marketing and cold calling techniques to meet sales targets.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Sales &amp; Execution</strong>: Develop sales strategies aligned with business goals, prioritize target markets, and manage leads through the sales lifecycle to exceed quarterly budgets.</li>\n<li><strong>Marketing Strategy</strong>: Execute digital campaigns for lead generation, collaborate with marketing teams on materials, and utilize online sales techniques.</li>\n<li><strong>Team Leadership</strong>: Lead, mentor, and manage a sales team to foster high performance and professional growth.</li>\n<li><strong>Market Expansion</strong>: Identify opportunities for strategic partnerships and expand the company’s presence in new markets.</li>\n<li><strong>Customer Relationship Management</strong>: Build strong relationships with customers, partners, and stakeholders to ensure satisfaction through tailored solutions.</li>\n<li><strong>Sales Operations</strong>: Oversee pipeline management, forecasting, and reporting; optimize sales processes using tools and technologies.</li>\n<li><strong>Product &amp; Market Knowledge</strong>: Stay updated on industry trends and collaborate with product teams to align sales with technology offerings.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, or related field; MBA preferred.</li>\n<li><strong>2+ years</strong> of experience in technology sales and marketing.</li>\n<li>Proven success in selling <strong>Self-Service Kiosks</strong>, <strong>AI Solutions</strong>, <strong>Payment Solutions</strong>, <strong>ERP systems</strong>, <strong>Software Testing</strong>, and <strong>DevOps</strong>.</li>\n<li>Strong leadership, communication, and cold calling/digital marketing skills.</li>\n<li>Ability to meet sales budgets and travel as required.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Competitive salary with performance-based incentives.</li>\n<li>Sales incentives tied to budgetary targets.</li>\n<li>Comprehensive health and wellness benefits.</li>\n<li>Professional development opportunities and a collaborative work environment.</li>\n</ul>\n<h3>Application Process</h3>\n<p>Submit your resume and cover letter to <strong>jobs.in@klystronglobal.com</strong> with the subject line \"Sales Associate\". Applications close on <strong>12, Jan 2026</strong>.</p>\n<p><strong>Contact</strong>: jobs.in@klystronglobal.com | <strong>Office</strong>: Office Nbr: 2210, Yamuna Building, Technopark Phase-III, 695583 | <strong>Website</strong>: <a href=\"https://www.klystronglobal.com\">Klystron Global</a></p>",
        "tags": [
            "2 Years",
            "Self-Service Kiosks",
            "AI Solutions",
            "Odoo ERP"
        ],
        "summary": "A Sales Associate at Klystron Technologies drives revenue through technology product sales, leads teams, and executes digital marketing strategies to expand market presence."
    },
    {
        "job_title": "Jr. Graphic Designer",
        "company": "Zybo Tech Lab (P) Ltd",
        "url": "https://technopark.org/job-details/26523",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Company Info</h2>\n<p><strong>Zybo Tech Lab (P) Ltd</strong>\n3rd Floor, Amstor Building, Technopark, Kazhakoottam, Trivandrum, 695581\n<a href=\"https://zybotechlab.com\">Visit Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role:</strong> Jr. Graphic Designer\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published:</strong> 05, Jan 2026\n<strong>Contact:</strong> <a href=\"mailto:jobs@zybotechlab.com\">jobs@zybotechlab.com</a></p>\n<h2>Key Responsibilities:</h2>\n<ul>\n<li>Design creatives for social media, ads, and marketing materials.</li>\n<li>Collaborate with the marketing team to develop campaign visuals.</li>\n<li>Maintain brand consistency across all platforms.</li>\n<li>Propose innovative ideas to strengthen brand presence.</li>\n</ul>\n<h2>How to Apply:</h2>\n<p>Submit your resume and a short cover letter to <strong>jobs@zybotechlab.com</strong> with the subject line <strong>\"Graphic Designer\"</strong>.</p>\n<h2>Preferred Skills:</h2>\n<ul>\n<li><strong>Required:</strong> Proficiency in Adobe Photoshop, Illustrator; basic knowledge of digital marketing design trends; creativity, attention to detail, time management.</li>\n<li><strong>Optional:</strong> Video editing skills.</li>\n</ul>\n<h2>Qualification:</h2>\n<p>Any degree or diploma in Graphic Design, Visual Communication, or a related field.</p>",
        "tags": [
            "0-2 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Digital Marketing Design"
        ],
        "summary": "Zybo Tech Lab seeks a Jr. Graphic Designer to create engaging visuals for marketing campaigns. Requires Adobe design skills and creativity to enhance brand presence."
    },
    {
        "job_title": "Automation Testing for Chennai Location",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/26522",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Job Overview</h2>\n<p><strong>Company</strong>: Muthoot Pappachan Technologies Ltd\n<strong>Location</strong>: Chennai\n<strong>Job Type</strong>: Full-Time\n<strong>Work Mode</strong>: Monday to Saturday\n<strong>Closing Date</strong>: 31, Jan 2026\n<strong>Published On</strong>: 05, Jan 2026\n<strong>Contact Email</strong>: divya.knair@muthoot.com</p>\n<h3>Job Summary</h3>\n<p>We are seeking a skilled <strong>Automation + Manual Tester</strong> to design, develop, and execute automated tests to ensure software quality and functionality. The role involves collaborating with development teams to identify and resolve issues, improving testing efficiency, and ensuring software meets quality standards before release. This position requires a developer proficient in both automation and manual testing with a passion for mobile app development in a collaborative environment.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Designing and Developing Test Automation Frameworks</strong>: Create infrastructure and tools for automated testing.</li>\n<li><strong>Test Case Execution</strong>: Manually execute test cases and scripts to identify bugs and issues.</li>\n<li><strong>Bug Identification and Reporting</strong>: Document and report software defects using bug tracking tools.</li>\n<li><strong>Collaborating with Developers</strong>: Work closely with development teams to understand software and identify automation areas.</li>\n<li><strong>Test Planning and Estimation</strong>: Contribute to planning and estimating testing efforts.</li>\n<li><strong>Troubleshooting and Debugging</strong>: Resolve issues during testing.</li>\n<li><strong>Reporting Test Results</strong>: Document and report results to stakeholders.</li>\n<li><strong>Continuous Improvement</strong>: Identify areas for process improvement and implement solutions.</li>\n<li><strong>Staying Updated</strong>: Keep abreast of industry trends and tools in automation testing.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Writing and maintaining test scripts.</li>\n<li>Executing automated tests.</li>\n<li>Identifying and documenting defects.</li>\n<li>Collaborating with developers.</li>\n<li>Participating in test planning and estimation.</li>\n<li>Troubleshooting and debugging.</li>\n<li>Reporting test results.</li>\n<li>Staying updated with industry trends.</li>\n</ul>",
        "tags": [
            "Not Specified",
            "Automation Testing",
            "Manual Testing",
            "Test Scripting"
        ],
        "summary": "Muthoot Pappachan Technologies seeks an Automation + Manual Tester in Chennai to design test frameworks, execute tests, identify defects, and collaborate with developers to ensure software quality."
    },
    {
        "job_title": "Senior / Lead Backend Developer (Experience: 5+ Years (Relevant)",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26521",
        "location": "Technopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<h2>Senior / Lead Backend Developer</h2>\n<p><strong>Company:</strong> GNX Digital Solutions (P) Ltd\n<strong>Location:</strong> Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581\n<strong>Website:</strong> <a href=\"https://gnxsolutions.in\">https://gnxsolutions.in</a>\n<strong>Closing Date:</strong> 12, Jan 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> hr@gnxsolutions.in</p>\n<h3>Role Overview</h3>\n<p>We are hiring a <strong>Senior/Lead Backend Developer</strong> to build scalable microservices and secure backend systems. The role involves designing APIs, implementing authentication/authorization, optimizing databases, and working with event-driven architectures.</p>\n<h3>Must-Have Skills</h3>\n<ul>\n<li><strong>Strong experience in Node.js</strong> (NestJS preferred)</li>\n<li>Microservices architecture</li>\n<li>JWT, token flows, <strong>RBAC/PBAC</strong></li>\n<li><strong>PostgreSQL</strong> and SQL optimization</li>\n<li><strong>Redis</strong> for caching/sessions</li>\n<li>RabbitMQ / Kafka</li>\n<li>Git, clean code practices</li>\n<li>Cloud exposure (AWS/Azure)</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>MongoDB / NoSQL</li>\n<li>Keycloak / OAuth2 / OIDC</li>\n<li>SAML, enterprise SSO</li>\n<li>Oracle DB</li>\n<li>Basic DevOps, Docker, CI/CD</li>\n<li>Leadership/mentoring</li>\n<li>API gateways, container environments</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong problem-solving</li>\n<li>Clear communication</li>\n<li>Ownership and quality focus</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Node.js",
            "PostgreSQL",
            "Redis"
        ],
        "summary": "Senior/Lead Backend Developer required to design scalable microservices and secure systems using Node.js, PostgreSQL, and Redis. Must have 5+ years of experience in cloud environments and API development."
    },
    {
        "job_title": "Python Lead 6+ Yrs",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26520",
        "location": "Technopark",
        "closing_date": "12 Jan 2026",
        "job_description": "<p><strong>GNX Digital Solutions (P) Ltd</strong></p>\n<p><strong>Address:</strong> Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581\n<strong>Website:</strong> <a href=\"https://gnxsolutions.in\">https://gnxsolutions.in</a>\n<strong>Closing Date:</strong> 12, Jan 2026\n<strong>Contact Email:</strong> hr@gnxsolutions.in</p>\n<h3><strong>Python Lead (6+ Yrs)</strong></h3>\n<p><strong>Job Published:</strong> 05, Jan 2026</p>\n<p>Are you a seasoned <strong>Python backend expert</strong> ready to <strong>lead high-impact engineering teams</strong> and architect <strong>scalable systems</strong>? Join <strong>GNX Digital Solutions</strong>, a fast-growing, innovation-driven company, where your work powers next-gen digital platforms.</p>\n<h4><strong>Key Responsibilities</strong></h4>\n<ul>\n<li>Architect modular, maintainable, and high-performance backend systems.</li>\n<li>Own the backend lifecycle: <strong>design → development → testing → deployment</strong>.</li>\n<li>Build and scale <strong>RESTful APIs</strong>, <strong>microservices</strong>, and <strong>data pipelines</strong>.</li>\n<li>Drive clean code practices and provide technical mentorship to the team.</li>\n<li>Collaborate with <strong>Product Managers</strong>, <strong>UI/UX Designers</strong>, <strong>QA Engineers</strong>, and <strong>DevOps</strong> for seamless delivery.</li>\n<li>Continuously evaluate and adopt the latest tools, frameworks, and best practices.</li>\n<li>Ensure system performance, <strong>security</strong>, and <strong>fault-tolerance</strong> at scale.</li>\n</ul>\n<h4><strong>Preferred Skills</strong></h4>\n<ul>\n<li><strong>6+ years</strong> of hands-on Python backend development.</li>\n<li>Strong experience with <strong>Django</strong>, <strong>Flask</strong>, or <strong>FastAPI</strong> (at least one in production).</li>\n<li>Proficiency in <strong>RESTful API</strong> design and integration with <strong>ORMs</strong> (e.g., SQLAlchemy, Django ORM).</li>\n<li>Solid understanding of <strong>data modeling</strong>, <strong>schema design</strong>, and <strong>database optimization</strong>.</li>\n<li>Experience with <strong>PostgreSQL</strong>, <strong>MySQL</strong>, <strong>MongoDB</strong>, or similar databases.</li>\n<li>Familiarity with <strong>Docker</strong>, <strong>Git</strong>, and CI/CD tools (GitHub Actions, Jenkins, etc.).</li>\n<li>Hands-on with cloud platforms: <strong>AWS</strong>, <strong>GCP</strong>, or <strong>Azure</strong> (at least one).</li>\n<li>Expertise in <strong>unit testing</strong>, <strong>debugging</strong>, and <strong>performance profiling</strong>.</li>\n</ul>",
        "tags": [
            "6+ Years",
            "Django",
            "RESTful API",
            "PostgreSQL"
        ],
        "summary": "Lead Python backend development for scalable systems. Requires 6+ years of experience with Django/Flask, RESTful APIs, and cloud platforms."
    },
    {
        "job_title": "DevOps Engineer",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/26519",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</h2>\n<p><strong>Address:</strong> 14th Floor, Carnival Technopark, Technopark Campus, Kariyavattom P.O., Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<h3>DevOps Engineer</h3>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> divya.knair@muthoot.com</p>\n<h4>Required Skills</h4>\n<ul>\n<li><strong>4+ years of experience</strong> in DevOps engineering</li>\n<li>Expert knowledge in <strong>Windows servers</strong> and <strong>virtualization platforms</strong></li>\n<li>Expertise in <strong>application management</strong> and <strong>development lifecycle</strong></li>\n<li>Proficiency in <strong>IIS</strong>, <strong>Apache Tomcat</strong>, and <strong>Nginx</strong></li>\n<li>Advanced knowledge in <strong>RedHat Linux servers</strong></li>\n<li>Advanced skills in <strong>DevOps tools</strong>: Jenkins, GitHub, Docker</li>\n<li>Advanced scripting in <strong>PowerShell</strong> or <strong>Python</strong></li>\n</ul>\n<h4>Preferred Skills</h4>\n<ul>\n<li>Experience in <strong>application monitoring</strong>, <strong>alerting</strong>, and <strong>incident response</strong> using Zabbix, Nagios, or Dynatrace</li>\n<li>Intermediate knowledge in <strong>networking &amp; firewall</strong> (Cisco, Fortinet)</li>\n<li>Intermediate knowledge in <strong>cloud platforms</strong>: Azure, AWS, Google Cloud</li>\n<li>Experience managing <strong>large enterprise setups</strong> with over 100 servers</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Jenkins",
            "Docker",
            "PowerShell"
        ],
        "summary": "Seeking a DevOps Engineer with 4+ years of experience in Windows servers, application management, and DevOps tools like Jenkins and Docker. Requires advanced scripting and cloud platform knowledge."
    },
    {
        "job_title": "Software Engineer Trainee/ Freshers in DotNet",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/26518",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong></p>\n<p><strong>Address</strong>: 14th Floor, Carnival Technopark, Technopark Campus, Kariyavattom P.O., Trivandrum, 695581\n<strong>Website</strong>: <a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a>\n<strong>Contact Email</strong>: divya.knair@muthoot.com</p>\n<p><strong>Job Title</strong>: Software Engineer Trainee / Freshers in DotNet\n<strong>Closing Date</strong>: 31, Jan 2026\n<strong>Job Published</strong>: 05, Jan 2026</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop, test, and maintain software programs in accordance with project specifications.</li>\n<li>Collaborate with cross-functional groups to understand business requirements and provide solutions.</li>\n<li>Write code that adheres to best practices and is clear, effective, and scalable.</li>\n<li>Participate in code reviews, debugging, and troubleshooting to enhance software quality.</li>\n<li>Stay updated with new technology and trends in the industry.</li>\n<li>Adhere to the software development lifecycle (SDLC) and Agile methodologies.</li>\n<li>Work with databases, APIs, and cloud platforms as required.</li>\n</ul>\n<h3>Technical Skills</h3>\n<ul>\n<li>Understanding of object-oriented programming (OOP), data structures, and algorithms.</li>\n<li>Familiarity with web technologies (HTML, CSS, JavaScript) and databases (SQL).</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication and teamwork abilities.</li>\n<li>Quick learner with a growth mindset.</li>\n<li>Ability to adapt and work in a fast-paced environment.</li>\n</ul>\n<h3>Academy Skills</h3>\n<ul>\n<li>Minimum of a Bachelor’s Degree in Computer Science, Software Engineering, or related field.</li>\n<li>Must have a good academic track record with &gt;60% marks.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in ASP.NET Web Forms</li>\n<li>Experience in MVC</li>\n<li>OOPs concepts, Interfaces</li>\n<li>.NET Core</li>\n<li>Experience in Web API</li>\n<li>Design Patterns and Principles</li>\n<li>Experience in Windows Forms, Services</li>\n<li>Logical thinking</li>\n<li>SQL Server knowledge</li>\n<li>Angular</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "ASP.NET",
            ".NET Core",
            "SQL Server"
        ],
        "summary": "Muthoot Pappachan Technologies seeks freshers for a Software Engineer role in .NET development. Responsibilities include coding, testing, and collaborating on software solutions using ASP.NET, C#, and SQL Server."
    },
    {
        "job_title": "Software Engineer-Dotnet",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/26517",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong>\n<strong>Address:</strong> 14th Floor, Carnival Technopark, Technopark Campus, Kariyavattom P.O., Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<p><strong>Software Engineer - Dotnet</strong>\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:divya.knair@muthoot.com\">divya.knair@muthoot.com</a></p>\n<p><strong>Location:</strong> Technopark Phase-1, Trivandrum, Kerala\n<strong>Experience:</strong> 2 to 4 years\n<strong>Mode:</strong> Work from Office\n<strong>Role:</strong> Permanent</p>\n<h2>Main Tasks</h2>\n<ul>\n<li>Development of web/window applications using .NET programming components</li>\n<li>Customizing existing applications to align with evolving business requirements</li>\n<li>Completing analysis, design, coding, and implementation phases of the software development lifecycle within scheduled timelines</li>\n<li>Interacting with superiors and business users to capture requirements</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Technical Skills:</strong> ASP.NET, C#, VB.NET, JavaScript, jQuery, VBScript, HTML, XML, Ajax</li>\n<li><strong>Database:</strong> ADO.NET/SQL Server</li>\n<li><strong>Additional Skills:</strong> Angular (preferable), MVC/MVC/WCF/WPF/Design patterns/LINQ/Lambda expressions</li>\n<li><strong>Database Scripting:</strong> SQL scripting, stored procedures, functions</li>\n<li><strong>Version Control:</strong> Experience with Git/SVN for source and configuration management</li>\n<li><strong>APIs:</strong> Experience in API integrations (consuming APIs &amp; libraries)</li>\n<li><strong>Cloud Development:</strong> Cloud development experience is an added advantage</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "ASP.NET",
            "C#",
            "SQL Server"
        ],
        "summary": "Software Engineer - Dotnet role requiring 2-4 years of experience in .NET development, SQL Server, and API integrations for Trivandrum-based tech company."
    },
    {
        "job_title": "Senior Software Engineer - .Net",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/26516",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</strong></p>\n<p><strong>Address:</strong> 14th FLOOR, CARNIVAL TECHNOPARK, TECHNOPARK CAMPUS, KARIYAVATTOM P.O., TRIVANDRUM, 695581\n<strong>Website:</strong> <a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a>\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> divya.knair@muthoot.com</p>\n<h3><strong>Senior Software Engineer - .Net</strong></h3>\n<h4><strong>Brief Description</strong></h4>\n<ul>\n<li><strong>Overall experience in .Net:</strong> 5-12 years</li>\n<li><strong>Minimum 4 years’ experience in ASP .Net/ C# Development</strong></li>\n<li>Develop web/window applications using .NET programming components</li>\n<li><strong>Experience in Angular is an added advantage</strong></li>\n<li>Lead and mentor 2-3 team members</li>\n<li>Customize existing applications to align with evolving business requirements</li>\n<li>Responsible for full software development lifecycle (analysis, design, coding, implementation) within scheduled timelines</li>\n<li>Collaborate with superiors and business users to capture requirements</li>\n</ul>\n<h4><strong>Preferred Skills</strong></h4>\n<ul>\n<li>Proficiency in <strong>ASP.NET, .NET CORE-API, C#, JavaScript, jQuery, VBScript, HTML, XML, Ajax</strong></li>\n<li>Experience with <strong>ADO.NET/SQL Server</strong></li>\n<li><strong>Angular (frontend)</strong> is preferable</li>\n<li>Knowledge of <strong>MVC/WCF/WPF/Design patterns/LINQ/Lambda expressions</strong></li>\n<li>MS SQL scripting, stored procedures, and functions</li>\n<li>Familiarity with <strong>Source &amp; Configuration Management (Git/SVN)</strong></li>\n<li><strong>API integrations</strong> (Consuming APIs &amp; Libraries) preferred</li>\n<li><strong>Cloud Development</strong> experience is an added advantage</li>\n</ul>",
        "tags": [
            "5-12 Years",
            "ASP.NET",
            "C#",
            "Angular"
        ],
        "summary": "Senior Software Engineer with 5-12 years of .NET experience, leading teams and full-cycle development. Requires ASP.NET, C#, and Angular expertise."
    },
    {
        "job_title": "Tech Lead – DotNet",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/26515",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Company</strong>: MUTHOOT PAPPACHAN TECHNOLOGIES LTD\n<strong>Location</strong>: 14th Floor, Carnival Technopark, Technopark Campus, Kariyavattom P.O., Trivandrum, 695581\n<strong>Website</strong>: <a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a>\n<strong>Job Title</strong>: Tech Lead – DotNet\n<strong>Closing Date</strong>: 31, Jan 2026\n<strong>Published Date</strong>: 05, Jan 2026\n<strong>Contact Email</strong>: divya.knair@muthoot.com</p>\n<h3>Role Overview</h3>\n<p>Provide technical guidance to a team of developers in developing features for an enterprise .NET application served via an Angular web-based platform. Lead customization of applications to align with evolving business needs and ensure technical designs meet project goals.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Technical Leadership</strong>: Mentor 5-8 team members and collaborate with superiors/business users to capture requirements.</li>\n<li><strong>Development Expertise</strong>: Develop using ASP.NET, C#, VB.NET, JavaScript, jQuery, HTML, XML, Ajax, and Angular.</li>\n<li><strong>Database Management</strong>: Utilize MySQL/MS SQL Server for SQL scripting, stored procedures, and functions.</li>\n<li><strong>Architecture &amp; Design</strong>: Apply MVC/MVC, WCF/WPF, design patterns, LINQ, and Lambda expressions.</li>\n<li><strong>Source Control</strong>: Manage configurations with Git/SVN.</li>\n<li><strong>API Integration</strong>: Consume APIs and libraries as needed.</li>\n<li><strong>Cloud Development</strong>: Preferred experience in cloud environments.</li>\n<li><strong>Project Management</strong>: Handle multiple projects with overlapping deadlines.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Experience</strong>: 8-16 years in .NET, with <strong>minimum 2 years as a tech lead</strong>.</li>\n<li><strong>Technical Skills</strong>: Proficiency in ASP.NET, C#, SQL Server, and Angular.</li>\n<li><strong>Design &amp; Patterns</strong>: Strong grasp of OOPs, interfaces, design patterns, and principles.</li>\n<li><strong>Additional Skills</strong>: Experience with .NET Core, Web API, Windows Forms/Services, and logical problem-solving.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>ASP.NET Web Forms</li>\n<li>MVC</li>\n<li>.NET Core</li>\n<li>Web API</li>\n<li>Windows Forms/Services</li>\n<li>SQL Server</li>\n<li>Angular</li>\n</ul>\n<h3>Contact</h3>\n<p>For inquiries, reach out to <strong>Divya K. Nair</strong> at <strong>divya.knair@muthoot.com</strong>.</p>",
        "tags": [
            "8-16 Years",
            "ASP.NET",
            "C#",
            "SQL Server"
        ],
        "summary": "Lead .NET development for enterprise applications with Angular, requiring 8-16 years of experience including 2+ years as a tech lead. Must have expertise in ASP.NET, C#, and SQL Server."
    },
    {
        "job_title": "Flutter Developer",
        "company": "Muthoot Pappachan Technologies Ltd",
        "url": "https://technopark.org/job-details/26514",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>MUTHOOT PAPPACHAN TECHNOLOGIES LTD</h2>\n<p><strong>Address:</strong> 14th Floor, Carnival Technopark, Technopark Campus, Kariyavattom P.O., Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://www.mptglobal.com\">https://www.mptglobal.com</a></p>\n<h3>Job Details</h3>\n<ul>\n<li><strong>Closing Date:</strong> 31, Jan 2026</li>\n<li><strong>Published Date:</strong> 05, Jan 2026</li>\n<li><strong>Contact Email:</strong> <a href=\"mailto:divya.knair@muthoot.com\">divya.knair@muthoot.com</a></li>\n</ul>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Flutter Developer</strong> with expertise in <strong>state management</strong>, <strong>design patterns</strong>, and <strong>native mobile integrations</strong>. The role involves designing, developing, and maintaining <strong>iOS and Android applications</strong> with a focus on performance, scalability, and user experience.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and maintain <strong>Flutter applications</strong> for iOS and Android.</li>\n<li>Implement <strong>design patterns</strong> like <strong>MVC, MVVM, Clean Architecture</strong>.</li>\n<li>Manage state using <strong>GetX</strong> (mandatory); <strong>BLoC</strong>, <strong>Riverpod</strong> are pluses.</li>\n<li>Integrate <strong>native functionalities</strong> (Push Notifications, Location Services, Background Services, Camera, GPS, Sensors).</li>\n<li>Collaborate with cross-functional teams to deliver features.</li>\n<li>Optimize apps for speed, scalability, and responsiveness.</li>\n<li>Assist with <strong>app submission</strong> on <strong>Google Play Store</strong> and <strong>Apple App Store</strong>.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n</ul>\n<h3>Key Skills &amp; Requirements</h3>\n<ul>\n<li><strong>Strong expertise in Flutter &amp; Dart</strong>.</li>\n<li>Proficiency in <strong>design patterns</strong> (MVC, MVVM, Clean Architecture).</li>\n<li><strong>State Management</strong>: GetX (mandatory), BLoC, Riverpod.</li>\n<li>Experience with <strong>native Android (Kotlin/Java)</strong> and <strong>iOS (Swift)</strong> development.</li>\n<li>Knowledge of <strong>push notifications</strong>, <strong>background services</strong>, <strong>location services</strong>, and <strong>camera integration</strong>.</li>\n<li>Familiarity with <strong>app publishing</strong> on Play Store and App Store.</li>\n<li>Strong problem-solving skills and ability to write clean, maintainable code.</li>\n<li>Experience with <strong>version control systems (Git)</strong> and <strong>CI/CD pipelines</strong>.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Knowledge of <strong>unit testing</strong>, <strong>integration testing</strong>, and <strong>automated UI testing</strong>.</li>\n<li>Familiarity with <strong>REST APIs</strong>, <strong>GraphQL</strong>, <strong>Firebase</strong>, or other backend services.</li>\n<li>Experience in <strong>agile/scrum environments</strong>.</li>\n<li>Published apps on <strong>Google Play Store</strong> or <strong>Apple App Store</strong>.</li>\n<li>Ability to handle <strong>IC role</strong>.</li>\n</ul>",
        "tags": [
            "Not Specified",
            "Flutter",
            "GetX",
            "Dart"
        ],
        "summary": "A Flutter Developer is needed to design and maintain cross-platform mobile apps with expertise in state management and native integrations. The role requires collaboration across teams and app store publishing experience."
    },
    {
        "job_title": "Frontend Developer",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/26513",
        "location": "Technopark",
        "closing_date": "05 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Cloud Nautical Solutions India Pvt Ltd</strong>\nModule No. K12, 2nd Floor, Kabani Building\nTechnocity, Phase 4, Technopark\nTrivandrum, Kerala, India, 695317\n<a href=\"https://www.cloudnautical.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Job Title:</strong> Frontend Developer\n<strong>Closing Date:</strong> 05, Feb 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Location:</strong> Technopark, Phase 4\n<strong>Contract Duration:</strong> 1 year\n<strong>Contact Email:</strong> <a href=\"mailto:careers@cloudnautical.com\">careers@cloudnautical.com</a></p>\n<h2>Job Description</h2>\n<p>Looking for a frontend engineer with <strong>3+ years of experience</strong> on a contract basis to join our team. The ideal candidate will have experience in building complex web applications using <strong>ReactJS</strong>, <strong>Typescript</strong>, and other front-end technologies.</p>\n<h3>Required Skills</h3>\n<ul>\n<li>3+ years of experience in frontend development</li>\n<li>Strong proficiency in <strong>ReactJS</strong>, <strong>Typescript</strong>, <strong>HTML5</strong>, <strong>Tailwind CSS</strong>, and <strong>Form Handlers</strong> (React hook form, zod/yup, zustand)</li>\n<li>Experience with <strong>Git control systems</strong> and <strong>Agile development methodologies</strong></li>\n<li>In-depth knowledge of <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>HTML</strong>, and front-end languages</li>\n<li>Experience with <strong>user interface design</strong></li>\n<li>Good <strong>project management skills</strong></li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Complete understanding of <strong>ReactJS</strong> and its main fundamentals</li>\n<li>Expert knowledge of <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>HTML</strong>, and related web technologies</li>\n</ul>",
        "tags": [
            "3+ Years",
            "ReactJS",
            "Typescript",
            "Tailwind CSS"
        ],
        "summary": "Cloud Nautical Solutions seeks a Frontend Developer with 3+ years of experience in ReactJS and Typescript to build complex web applications. The role requires expertise in modern front-end technologies and Agile methodologies in Trivandrum, Kerala."
    },
    {
        "job_title": ".NET Developer",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/26512",
        "location": "Technopark",
        "closing_date": "05 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Cloud Nautical Solutions India Pvt Ltd</strong>\nModule No. K12, 2nd Floor, Kabani Building\nTechnocity, Phase 4, Technopark\nTrivandrum, Kerala, India - 695317\n<a href=\"https://www.cloudnautical.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Role</strong>: .NET Developer\n<strong>Closing Date</strong>: 05, Feb 2026\n<strong>Published On</strong>: 05, Jan 2026\n<strong>Location</strong>: Technopark Phase 4\n<strong>Contact Email</strong>: <a href=\"mailto:careers@cloudnautical.com\">careers@cloudnautical.com</a></p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Deliver commercial solutions using .NET technology stack</li>\n<li>Develop RESTful API services with C# and .NET Core</li>\n<li>Write SQL queries and stored procedures</li>\n<li>Apply object-oriented programming (OOP) and SOLID principles</li>\n<li>Implement front-end technologies (HTML, CSS, JavaScript)</li>\n<li>Utilize version control systems (Git) and CI/CD pipelines</li>\n<li>Design cloud applications in AWS or Azure</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor's Degree in Computer Science or related field</li>\n<li>3+ years of hands-on .NET development experience</li>\n<li>Proven RESTful API development experience</li>\n<li>Strong SQL proficiency</li>\n<li>Front-end web development skills</li>\n<li>Version control and CI/CD pipeline expertise</li>\n<li>Cloud application development knowledge</li>\n<li>Problem-solving and analytical abilities</li>\n<li>Agile (Scrum) methodology experience</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Microservice architecture development</li>\n<li>VB.Net experience</li>\n</ul>\n<h2>Contact Information</h2>\n<p>For inquiries, email: <a href=\"mailto:careers@cloudnautical.com\">careers@cloudnautical.com</a></p>",
        "tags": [
            "3+ Years",
            ".NET Core",
            "RESTful API",
            "SQL"
        ],
        "summary": ".NET Developer required with 3+ years of commercial .NET experience in API development, SQL, and cloud technologies."
    },
    {
        "job_title": "NodeJS-Typescript Developer(1-2 Years Experience)",
        "company": "Expressare Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26511",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Company:</strong> Expressare Technologies (P) Ltd\n<strong>Address:</strong> SBC - 21, Level -2, Tejaswini , 695581\n<strong>Website:</strong> <a href=\"https://expressare.com\">https://expressare.com</a></p>\n<p><strong>Job Title:</strong> NodeJS-Typescript Developer\n<strong>Experience Required:</strong> 1-2 Years\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> bency@expressare.com</p>\n<h3>Job Summary:</h3>\n<p>We are seeking an experienced <strong>Typescript</strong> or <strong>Javascript</strong>-based <strong>NodeJS Developer</strong> to join our team. As a Java Developer, you will develop and maintain high-quality software solutions for clients, collaborating with project managers, business analysts, and developers to deliver projects on time and within budget.</p>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor's or Master's degree in Computer Science, Software Engineering, Information Technology, or related field</li>\n<li><strong>1+ years</strong> of experience in <strong>Javascript</strong> or <strong>Typescript</strong> with <strong>NodeJS back-end</strong> development</li>\n<li>Experience with <strong>SQL</strong> and <strong>NoSQL</strong> database design and development</li>\n<li>Familiarity with <strong>Agile methodologies</strong> and tools like <strong>JIRA</strong> and <strong>Git</strong></li>\n<li>Strong problem-solving skills and attention to detail</li>\n<li>Excellent communication and teamwork abilities</li>\n</ul>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, test, and maintain <strong>Java-based</strong> software applications</li>\n<li>Collaborate with cross-functional teams to understand project requirements</li>\n<li>Write clean, well-documented code following industry best practices</li>\n<li>Debug and resolve software issues</li>\n<li>Develop unit and integration tests for software quality</li>\n<li>Participate in code reviews and provide feedback</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Front-end development with <strong>Typescript/Javascript</strong> and <strong>React</strong></li>\n<li>AWS Services: <strong>Lambda, EC2, Lightsail, S3, SQS, DynamoDb</strong></li>\n<li>Containerization: <strong>Docker</strong> or <strong>Kubernetes</strong></li>\n<li>CI/CD tools: <strong>Jenkins</strong></li>\n</ul>",
        "tags": [
            "1-2 Years",
            "NodeJS",
            "AWS Services",
            "Docker/Kubernetes"
        ],
        "summary": "Seeking a NodeJS-Typescript Developer with 1-2 years of experience in backend development, Agile methodologies, and database design. Preferred skills include AWS, Docker, and React."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Crayo Tech Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26510",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Crayo Tech Business Solutions (P) Ltd</strong></p>\n<p><strong>Location:</strong> Kerala Startup Mission, G3B, Thejaswini, Technopark Campus, Kariyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.crayotech.com/india\">http://www.crayotech.com/india</a>\n<strong>Closing Date:</strong> 31, Jan 2026\n<strong>Published Date:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@crayotech.com\">careers@crayotech.com</a></p>\n<h3>Job Summary</h3>\n<p>We are seeking a motivated and results-driven <strong>Business Development Executive</strong> to join our dynamic team. The ideal candidate will be responsible for identifying new business opportunities, developing relationships with potential clients, and driving revenue growth.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and research potential clients and market opportunities.</li>\n<li>Build and maintain strong relationships with existing and prospective clients.</li>\n<li>Conduct market analysis to understand industry trends and competitive landscape.</li>\n<li>Develop and deliver compelling presentations and proposals to clients.</li>\n<li>Collaborate with internal teams to align offerings with client needs.</li>\n<li>Achieve monthly and quarterly sales targets and contribute to overall revenue growth.</li>\n<li>Attend industry events, conferences, and networking functions to promote the company and generate leads.</li>\n<li>Prepare and maintain detailed reports on sales activities, pipeline status, and market feedback.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, or a related field.</li>\n<li>Proven experience in business development, sales, or a similar role.</li>\n<li>Strong understanding of sales principles and customer relationship management (CRM) software.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Strong analytical and problem-solving skills.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Email your resume to <strong>careers@crayotech.com</strong> with the subject: <strong>\"BDE - Candidate Name\"</strong>.</p>",
        "tags": [
            "2-4 Years",
            "CRM Software",
            "Business Development",
            "Sales Strategy"
        ],
        "summary": "Seeking a results-driven Business Development Executive to identify opportunities, build client relationships, and drive revenue growth through strategic sales initiatives."
    },
    {
        "job_title": "MERN STACK DEVELOPER - Trainees",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/26509",
        "location": "Technopark",
        "closing_date": "17 Jan 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</strong>\n<a href=\"https://softnotions.com\">https://softnotions.com</a></p>\n<h3>MERN STACK DEVELOPER - Trainees</h3>\n<p><strong>Closing Date:</strong> 17, Jan 2026\n<strong>Job Published:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h4>Responsibilities</h4>\n<ul>\n<li>Demonstrate exceptional coding skills in <strong>JavaScript / jQuery, MySQL, MongoDB, Node JS, React JS, Hooks, Redux, Context APIs</strong>.</li>\n<li>Implement <strong>asynchronous request handling</strong> and <strong>security/data protection</strong> measures.</li>\n<li>Translate wireframes into functional UI/UX.</li>\n<li>Develop <strong>RESTful services</strong> and ensure <strong>cross-platform/cross-device compatibility</strong>.</li>\n<li>Write <strong>reusable, testable, and efficient code</strong> with <strong>unit/integration tests</strong>.</li>\n<li>Collaborate in cross-functional teams to deliver complete user experiences.</li>\n<li>Debug <strong>Node JS</strong> and integrate <strong>NoSQL data storage solutions</strong>.</li>\n<li>Utilize <strong>Git</strong> for version control and <strong>Jira</strong> for task management.</li>\n</ul>\n<h4>Required Skills</h4>\n<ul>\n<li>Proficiency in <strong>HTML5, CSS3, jQuery, and mobile responsiveness</strong>.</li>\n<li>Understanding of <strong>REST APIs</strong>, <strong>Agile methodologies</strong>, and <strong>performance optimization</strong>.</li>\n<li>Experience with <strong>modern frameworks/design patterns</strong> and <strong>version control systems</strong>.</li>\n</ul>\n<h4>Preferred Skills</h4>\n<ul>\n<li>Thrive in dynamic, client-facing roles with high expectations.</li>\n<li>Translate business outcomes into technical solutions.</li>\n<li>Demonstrate <strong>leadership, communication</strong>, and <strong>problem-solving</strong> in ambiguous environments.</li>\n</ul>\n<h4>Contact Information</h4>\n<p><strong>Email:</strong> recruitment@softnotions.com\n<strong>Address:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</p>",
        "tags": [
            "0-6 Months",
            "JavaScript",
            "React JS",
            "Node JS"
        ],
        "summary": "MERN Stack Developer Trainee role requiring 0-6 months experience in full-stack development with JavaScript, React, and Node. Focus on building secure, scalable applications using modern frameworks and Agile methodologies."
    },
    {
        "job_title": "IT System - Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26508",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>Way.com — IT System Engineer</h2>\n<p><strong>Company</strong>: Way.Com India Pvt Ltd\n<strong>Location</strong>: 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website</strong>: <a href=\"http://www.way.com\">http://www.way.com</a>\n<strong>Closing Date</strong>: 08, Jan 2026\n<strong>Published</strong>: 05, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/it-system-engineer\">https://waydot.greythr.com/hire/jobs/it-system-engineer</a></p>\n<h3>About Us</h3>\n<p>Way.com is America’s leading automotive super app, serving 10+ million customers with solutions for insurance, EV charging, parking, and more. Leveraging AI and data analytics, we’re transforming car ownership and recognized as the #1 Product in Insurance by UnitQ.</p>\n<h3>Role Overview</h3>\n<p>We seek an <strong>IT System Engineer</strong> with <strong>2–4 years</strong> of experience in IT infrastructure, Office 365, and system support. The role involves managing Linux/Windows environments, networking (Fortigate), cloud VMs (DigitalOcean/OVH), and monitoring tools (Grafana/Zabbix). Opportunities exist to grow into DevOps and automation.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Provide technical support for hardware, software, and networking issues.</li>\n<li>Manage IT infrastructure for uptime, performance, and security.</li>\n<li>Administer Office 365 (Exchange, Teams, SharePoint, OneDrive).</li>\n<li>Configure Fortigate routers/firewalls and VPNs.</li>\n<li>Perform Linux system administration (user management, patching).</li>\n<li>Support Windows environments for installation and maintenance.</li>\n<li>Deploy and manage cloud VMs on DigitalOcean/OVH.</li>\n<li>Implement infrastructure monitoring with Grafana/Zabbix.</li>\n<li>Maintain IT documentation and knowledge base.</li>\n<li>Collaborate on DevOps workflows and automation.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s in Computer Science/IT or related field.</li>\n<li><strong>2–4 years</strong> in IT Support/System Administration/Infrastructure.</li>\n<li>Hands-on Office 365 administration.</li>\n<li>Fortigate networking and Linux administration.</li>\n<li>Cloud VM management (DigitalOcean/OVH).</li>\n<li>Monitoring tools (Grafana/Zabbix).</li>\n<li>Troubleshooting, communication, and documentation skills.</li>\n<li>Rotational shift availability.</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>DevOps tools (Docker, Jenkins, Git, CI/CD).</li>\n<li>Bash/Python scripting for automation.</li>\n<li>Infrastructure performance tuning.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work for the #1 Auto Super App in the US.</li>\n<li>Impact 10+ million users.</li>\n<li>Dynamic, innovation-driven culture.</li>\n<li>Career growth in a scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "Office 365",
            "Linux",
            "Fortigate"
        ],
        "summary": "Seeking an IT System Engineer with 2-4 years of experience in IT infrastructure, Office 365, and Linux administration. Responsibilities include managing systems, networking, and cloud environments for a leading automotive app."
    },
    {
        "job_title": "Graphic Designer - Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26507",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Role Overview</h3>\n<p>We’re hiring a <strong>Lead Marketing Designer</strong> to work closely with the marketing and design leadership to shape how Way.com shows up visually, consistently, and at scale. This is not a pixel-pushing role. The marketing design team has already:</p>\n<ul>\n<li>Delivered high-impact digital and physical campaigns</li>\n<li>Established brand guidelines and rules across the organization</li>\n<li>Built and scaled brand asset systems</li>\n<li>Supported marketing for multiple new product launches</li>\n<li>Designed for both <strong>B2C customers and B2B partners</strong></li>\n<li>Played a key role in trade shows and partner-facing initiatives</li>\n<li>Contributed to <strong>deep customer impact and revenue through conversion</strong></li>\n</ul>\n<p>Now the work needs stronger ownership.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead visual design across <strong>marketing campaigns, brand initiatives, social and performance ads, web and product-led marketing</strong></li>\n<li>Translate business and marketing goals into clear, high-impact visual stories</li>\n<li>Own design quality end-to-end, from concept to final delivery</li>\n<li>Collaborate with marketing, content, growth, and product teams</li>\n<li>Maintain and evolve brand consistency while pushing creative boundaries</li>\n<li>Mentor junior designers and raise the overall bar of the team</li>\n<li>Manage multiple projects without compromising quality or timelines</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>4–6 years</strong> of experience in graphic/marketing design</li>\n<li>Strong portfolio that shows thinking, not just visuals</li>\n<li>Expert-level proficiency in <strong>Figma</strong> and <strong>Adobe Creative Suite</strong></li>\n<li>Ability to leverage AI for:</li>\n<li>Faster concept generation and creative exploration</li>\n<li>Campaign variations at scale</li>\n<li>Improving speed without compromising brand quality</li>\n<li>Training juniors on AI usage in ideation and design execution</li>\n<li>Experience designing for digital-first brands and fast-moving teams</li>\n<li>Ability to take feedback, push back when needed, and defend design decisions</li>\n<li>Comfort with ambiguity and rapid iteration</li>\n<li>High ownership mindset. You treat the work like it’s your brand.</li>\n</ul>\n<h3>Bonus (Not Mandatory, But Valuable)</h3>\n<ul>\n<li>Motion, video, or basic animation skills</li>\n<li>Understanding of performance marketing creatives</li>\n<li>Experience in startup or high-growth environments</li>\n</ul>\n<h3>Why This Role Matters</h3>\n<p>Design at Way.com is not a support function. It’s a <strong>growth lever</strong>. You’ll work on marketing design that supports and scales:\n- Our large-scale app and web product\n- Marketing for recent product initiatives (B2B - SaaS, B2C)\n- Brand initiatives and more</p>\n<p>You’ll have real ownership, direct feedback, and high expectations. If you enjoy clarity, accountability, and building work that actually moves the needle, this role will fit.</p>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong></li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong></li>\n<li>Dynamic, fast-paced, and innovation-driven work culture</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company</li>\n<li>Competitive compensation</li>\n</ul>\n<p><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-graphic-designer\">https://waydot.greythr.com/hire/jobs/lead-graphic-designer</a></p>\n<p><strong>Contact Email</strong>: careers@way.com</p>",
        "tags": [
            "4-6 Years",
            "Figma",
            "Adobe Creative Suite",
            "AI"
        ],
        "summary": "Lead Marketing Designer with 4-6 years of experience in Figma, Adobe Creative Suite, and AI-driven design. Shapes visual strategy for a leading US automotive app, impacting 10+ million users."
    },
    {
        "job_title": "Graphic Designer - Junior",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26506",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We’re looking for a <strong>Junior Marketing Designer</strong> to join a marketing design team that already proved its value. After the marketing design team was established, Way.com:</p>\n<ul>\n<li>Minted high-impact digital and physical campaigns</li>\n<li>Defined brand guidelines and asset systems from scratch</li>\n<li>Brought visual consistency across the organization</li>\n<li>Helped market and sell multiple new and existing products</li>\n<li>Designed for both B2C customers and B2B partners</li>\n<li>Supported trade shows and large-scale product launches</li>\n<li>Drove deep customer impact and strong conversion-led revenue</li>\n</ul>\n<p>This role is for someone early in their career who wants real work, real feedback, and real growth, not busywork.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Support design execution across:</li>\n<li>Marketing campaigns</li>\n<li>Social media</li>\n<li>Ads and performance creatives</li>\n<li>Web and internal communications</li>\n<li>Translate briefs into clean, effective visual outputs</li>\n<li>Assist senior designers on campaign, product, and brand assets</li>\n<li>Iterate fast and accurately based on feedback</li>\n<li>Help maintain brand consistency across platforms</li>\n<li>Learn how design directly impacts marketing performance and business outcomes</li>\n</ul>\n<p><strong>Your work won’t sit in folders.</strong> It will go live, get seen, and get measured.</p>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>1–3 years</strong> of graphic design experience (internships/freelance count)</li>\n<li>A portfolio showing solid fundamentals and willingness to learn</li>\n<li>Working knowledge of <strong>Figma</strong> and <strong>Adobe Creative Suite</strong></li>\n<li>Ability to leverage <strong>AI</strong> for:</li>\n<li>Faster concept generation and creative exploration</li>\n<li>Campaign variations at scale</li>\n<li>Improving speed without compromising brand quality</li>\n<li>Understanding of layout, typography, color, and visual hierarchy</li>\n<li>Openness to feedback and eagerness to improve</li>\n<li>Ability to manage tasks, timelines, and revisions responsibly</li>\n<li>Curiosity, ownership, and a strong work ethic</li>\n</ul>\n<h2>Bonus (Nice to Have)</h2>\n<ul>\n<li>Motion graphics or basic video skills</li>\n<li>Experience with social or marketing creatives</li>\n<li>Exposure to fast-paced or startup environments</li>\n</ul>\n<h2>Why This Role Matters</h2>\n<p>You won’t be stuck doing low-impact work. You’ll contribute to marketing design that has already supported the launch of:</p>\n<ul>\n<li>Our large-scale app and web product</li>\n<li>Marketing all the recent product initiatives (B2B - SaaS, B2C)</li>\n<li>Brand initiatives and more.</li>\n</ul>\n<p>You’ll be guided, but also expected to step up.</p>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/junior-graphic-designer\">https://waydot.greythr.com/hire/jobs/junior-graphic-designer</a></p>\n<p><strong>Contact Email:</strong> careers@way.com</p>",
        "tags": [
            "1-3 Years",
            "Figma",
            "Adobe Creative Suite",
            "AI"
        ],
        "summary": "Junior Graphic Designer needed for a dynamic US-based auto super app. Requires 1-3 years of experience, proficiency in design tools, and AI integration for impactful marketing campaigns."
    },
    {
        "job_title": "Lead - Product Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26505",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We’re seeking a <strong>Lead Product Designer</strong> to own end-to-end product experiences, raise design standards, and drive outcomes—not just deliver screens. You’ll lead as a design authority for core products, collaborating directly with Product, Engineering, Growth, and Leadership. Report to the <strong>Head of Design</strong>. Apply if you’re a Lead or Senior Designer ready to elevate your career.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>End-to-end product design for key verticals.</li>\n<li>Design strategy + execution: define UX direction, drive research, and ship high-quality flows/UI with speed.</li>\n<li>Craftsmanship leadership: elevate visual/UI standards across the product ecosystem.</li>\n<li>Decision-making: influence product roadmap with data, customer insights, and business context.</li>\n<li>Cross-functional alignment: drive clarity in chaos, simplify ambiguity, and ensure design isn’t skipped.</li>\n<li>Design process ownership: establish and enforce lean, effective design workflows.</li>\n<li>Mentorship: upskill junior designers, provide sharp critique, guide hiring, and shape team culture.</li>\n<li>System thinking: contribute to and evolve Way.com’s design system for scale.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>7–10+ years</strong> of product design experience, with at least 3 years in a lead or senior-lead role.</li>\n<li>Strong portfolio showcasing complex problem-solving, consumer app work, and high-quality UI.</li>\n<li>Proven ability to drive outcomes, not just outputs.</li>\n<li>Comfort with fast turns, ambiguity, and data-driven decision-making.</li>\n<li>Experience leading discovery, research, prototyping, and iterative testing.</li>\n<li>Expertise in <strong>Figma</strong> and modern product design tools.</li>\n<li>Strong communication: direct, clear, decisive.</li>\n<li>Ability to influence product, engineering, and leadership without being soft or political.</li>\n<li>Bias for action: you move, you ship, you iterate.</li>\n</ul>\n<h2>Why You’ll Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-product-designer\">https://waydot.greythr.com/hire/jobs/lead-product-designer</a></p>\n<p><strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "7–10+ Years",
            "Figma",
            "Consumer App Design",
            "Design Systems"
        ],
        "summary": "Lead Product Designer at Way.com, a top US auto super app, to drive end-to-end product experiences and mentor teams, leveraging advanced design systems and data-driven strategies."
    },
    {
        "job_title": "Communication Trainer - English",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26504",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking an experienced <strong>English Communication Trainer</strong> to deliver offline corporate training programs specifically designed for <strong>Customer Support teams</strong>. The trainer will enhance employees’ communication quality, customer-handling skills, grammar accuracy, and overall service language proficiency.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Conduct <strong>offline communication training</strong> for customer support executives across voice, email, and chat processes.</li>\n<li>Train employees on <strong>professional communication</strong>, <strong>customer empathy</strong>, <strong>tone &amp; clarity</strong>, <strong>neutral accent</strong>, and <strong>grammar usage</strong>.</li>\n<li>Develop and deliver training modules on:</li>\n<li>Spoken English</li>\n<li>Business communication</li>\n<li>Customer handling phrases &amp; scripts</li>\n<li>Call etiquette &amp; soft skills</li>\n<li>Email writing &amp; chat etiquette</li>\n<li>Evaluate learners through role plays, call simulations, mock chats/emails, and assessments.</li>\n<li>Identify communication gaps and create customized training for new hires and existing employees.</li>\n<li>Provide actionable feedback to improve language proficiency, customer interactions, and overall CSAT.</li>\n<li>Track performance, maintain training reports, and coordinate with managers and QA teams for continuous improvement.</li>\n<li>Create an engaging and professional classroom environment.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>4–7 years</strong> of experience as a Communication Trainer / English Trainer in <strong>BPO</strong>, <strong>Customer Support</strong>, or <strong>Corporate Training</strong>.</li>\n<li>Strong command of spoken and written English with ability to simplify concepts.</li>\n<li>Experience in voice, email, or chat process training (preferred).</li>\n<li>Excellent presentation, facilitation, and coaching skills.</li>\n<li>Ability to handle diverse learners and drive measurable improvement.</li>\n</ul>\n<h2>Preferred Attributes</h2>\n<ul>\n<li>Certification in communication training, TEFL/TESOL, or soft skills (added advantage).</li>\n<li>Experience working with customer support KPIs such as CSAT, quality scores, AHT impact, etc.</li>\n<li>Strong understanding of customer service language, tone, and escalation handling.</li>\n</ul>\n<h2>Why Work With Us?</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer\">https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer</a></p>",
        "tags": [
            "4-7 Years",
            "English Communication Training",
            "Customer Support Training",
            "Corporate Training"
        ],
        "summary": "Experienced English Communication Trainer to enhance customer support teams' communication skills. Work with top auto super app impacting 10+ million users."
    },
    {
        "job_title": "Sales Expert",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26503",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Sales Expert</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking dynamic, customer-focused <strong>Sales Experts</strong> to join our <strong>Refinance Team</strong>. In this role, you will be the voice of our product — engaging directly with customers, understanding their needs, and helping them choose the best refinance solutions. This is a <strong>B2C sales role</strong>, where communication skills, persuasion, and a passion for sales will make all the difference.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Engage with potential customers through <strong>inbound and outbound calls, emails, and chats</strong>.</li>\n<li>Clearly explain refinance products, features, and benefits to customers.</li>\n<li>Build <strong>trust and rapport</strong> with customers to convert inquiries into successful sales.</li>\n<li>Consistently <strong>achieve individual and team sales targets</strong>.</li>\n<li>Maintain accurate records of customer interactions and transactions in <strong>CRM systems</strong>.</li>\n<li>Collaborate with <strong>Customer Support, Product, and Marketing teams</strong> to ensure a smooth post-sale experience.</li>\n<li>Stay updated on <strong>product knowledge, process updates, and industry trends</strong>.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s or Master’s degree in any discipline (preferably Business or Engineering).</li>\n<li><strong>2–5 years of experience</strong> in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and <strong>experience with CRM tools</strong>.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Closing Date</strong>: 08, Jan 2026</li>\n<li><strong>Contact Email</strong>: careers@way.com</li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/sales-expert\">https://waydot.greythr.com/hire/jobs/sales-expert</a></li>\n</ul>",
        "tags": [
            "2–5 Years",
            "B2C Sales",
            "CRM Tools",
            "Financial Products"
        ],
        "summary": "Dynamic Sales Experts needed for a B2C refinance team. Requires 2–5 years in sales, CRM proficiency, and a passion for customer engagement."
    },
    {
        "job_title": "Senior - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26502",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>About Way.com</h2>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions ranging from auto insurance and parking to EV charging. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, we leverage AI and data analytics to redefine car ownership.</p>\n<h2>Role Overview</h2>\n<p>We seek a <strong>Senior Marketing Designer</strong> to create high-impact visuals for campaigns, ads, and product launches. You’ll collaborate with creative, growth, and product teams to design across platforms like paid media, social, and email.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design digital ad creatives, banners, and social visuals for ongoing campaigns.</li>\n<li>Conceptualize visuals for product launches and seasonal campaigns.</li>\n<li>Balance creativity and clarity to drive performance.</li>\n<li>Collaborate with copywriters, growth managers, and product designers.</li>\n<li>Align designs with Way.com’s brand and tone.</li>\n<li>Explore motion and storytelling to enhance engagement.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>3–5 years</strong> of experience in marketing or growth design.</li>\n<li>Proficiency in <strong>Figma, Photoshop, Illustrator, and After Effects</strong>.</li>\n<li>Strong layout, typography, and storytelling skills.</li>\n<li>Understanding of digital marketing and ad metrics.</li>\n<li>A portfolio showcasing creativity and attention to detail.</li>\n<li>Eagerness to learn and collaborate in a fast-paced environment.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work for the #1 Auto Super app in the US.</li>\n<li>Impact 10+ million users with innovative solutions.</li>\n<li>Dynamic, innovation-driven culture with clear growth pathways.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/senior-marketing-designer\">Senior Marketing Designer Application</a>\n<strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "3–5 Years",
            "Figma",
            "Photoshop",
            "After Effects"
        ],
        "summary": "Senior Marketing Designer needed to create high-impact campaigns across platforms. Requires 3–5 years experience in marketing design and proficiency in Figma, Photoshop, and After Effects."
    },
    {
        "job_title": "Lead - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26501",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>About Way.com</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We’re seeking a <strong>Lead Marketing Designer</strong>—a hands-on creative leader who can turn strategy into striking visuals and campaigns. You’ll lead the creative direction across digital marketing, brand campaigns, and performance ads, guiding a small team of designers while staying close to execution.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Lead and manage a team of marketing designers.</li>\n<li>Develop and execute creative strategy across paid, owned, and social channels.</li>\n<li>Drive campaign concepts for product launches, seasonal pushes, and partnerships.</li>\n<li>Maintain a consistent visual identity across Way.com’s global marketing ecosystem.</li>\n<li>Partner with Growth, Product, and Content teams to create high-performing visuals.</li>\n<li>Inspire creative excellence and mentor designers to elevate craft quality.</li>\n<li>Balance creativity with marketing performance and data-driven decisions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>6–10 years</strong> of experience in marketing design, art direction, or brand design.</li>\n<li>Proven experience leading creative or design teams.</li>\n<li>Strong portfolio showcasing campaign systems, digital storytelling, and ad design.</li>\n<li>Expertise in <strong>Figma, Photoshop, Illustrator, After Effects / Premiere Pro</strong>.</li>\n<li>Experience in performance design and knowledge of CTR, engagement metrics, and creative testing.</li>\n<li>Strong visual storytelling and typography skills.</li>\n<li>A passion for clean, modern, and conversion-friendly design.</li>\n</ul>\n<h3>Why You’ll Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Contact Information</h3>\n<ul>\n<li><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-marketing-designer\">https://waydot.greythr.com/hire/jobs/lead-marketing-designer</a></li>\n</ul>",
        "tags": [
            "6–10 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Lead Marketing Designer to lead creative strategy and campaigns for Way.com, a top US auto super app. Requires 6-10 years experience in marketing design with expertise in Figma, Photoshop, and Illustrator."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26500",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p><strong>Project Manager</strong></p>\n<h2>Experience</h2>\n<p><strong>8+ Years</strong></p>\n<h2>Work Arrangement</h2>\n<p><strong>On-site</strong></p>\n<h2>Employment Type</h2>\n<p><strong>Full-time</strong></p>\n<h2>Role Overview</h2>\n<p>We are seeking a seasoned <strong>Project Manager</strong> with <strong>8+ years of experience</strong> to oversee and drive strategic projects from initiation to completion. The ideal candidate will bring strong leadership, domain expertise, and hands-on execution skills to ensure successful delivery within scope, timeline, and budget.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Lead the full project lifecycle across multiple <strong>medium to large-scale initiatives</strong>.</li>\n<li>Define and manage <strong>project scope, objectives, deliverables, and success criteria</strong>.</li>\n<li>Develop and execute detailed project plans, including <strong>resource allocation, timelines, and budgets</strong>.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate when required.</li>\n<li>Manage <strong>stakeholder relationships</strong>, ensuring clear communication and alignment at all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams to ensure smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes and policies.</li>\n<li>Mentor and guide junior team members to build project management capability within the team.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s degree in <strong>Engineering, Business Administration, or related field</strong> (Master’s degree is an advantage).</li>\n<li><strong>8+ years</strong> of proven project management experience, preferably in <strong>fintech platform</strong>.</li>\n<li>Strong expertise in managing <strong>complex, cross-functional projects</strong>.</li>\n<li>Proficiency in <strong>project management tools</strong> (MS Project, JIRA, Asana, Trello, or similar).</li>\n<li>In-depth knowledge of <strong>Agile, Waterfall, or hybrid project management methodologies</strong>.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities under pressure.</li>\n<li>Certifications such as <strong>PMP, PRINCE2, or Agile (Scrum Master/SAFe)</strong> are highly preferred.</li>\n<li>Experience with tools like <strong>MPP etc</strong>.</li>\n<li>Ability to work through with <strong>multiple teams, drive for execution &amp; results</strong>.</li>\n</ul>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Apply Now</h2>\n<p><a href=\"https://waydot.greythr.com/hire/jobs/project-manager\">Apply Now</a></p>\n<h2>Contact</h2>\n<p><strong>Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "8+ Years",
            "Agile",
            "JIRA",
            "PMP"
        ],
        "summary": "Lead complex fintech projects for a top US auto super app with 8+ years of experience in Agile methodologies and cross-functional team collaboration."
    },
    {
        "job_title": "SEO Team Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26499",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>Way.com India Pvt Ltd</h2>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a>\n<strong>Closing Date:</strong> 08, Jan 2026\n<strong>Job Published:</strong> 05, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/seo-team-lead\">https://waydot.greythr.com/hire/jobs/seo-team-lead</a></p>\n<h3>About Us</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions like auto insurance, EV charging, and parking. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s fastest-growing companies list, we leverage AI and data analytics to revolutionize car ownership.</p>\n<h3>Job Title</h3>\n<p><strong>Team Lead - SEO</strong>\n<strong>Experience:</strong> 9 - 11 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>Team Lead, SEO</strong> to lead organic growth strategies and enhance our search engine presence. You will manage a team of SEO specialists, execute technical and content strategies, and collaborate cross-functionally to optimize our digital footprint.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies:</strong> Define and implement a robust SEO roadmap aligned with business goals.</li>\n<li><strong>Lead &amp; Mentor the SEO Team:</strong> Foster a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO:</strong> Improve keyword rankings, content performance, and backlink quality.</li>\n<li><strong>Technical SEO Management:</strong> Resolve site architecture, crawl errors, indexing, and page speed issues.</li>\n<li><strong>Data-Driven Decision Making:</strong> Analyze traffic trends and SEO metrics using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration:</strong> Integrate SEO best practices with website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization:</strong> Enhance local search presence and mobile-first indexing strategies.</li>\n<li><strong>Competitive &amp; Market Analysis:</strong> Conduct audits and monitor competitor strategies.</li>\n<li><strong>SEO Performance Reporting:</strong> Deliver insights via detailed reports and dashboards.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>9-11 years of SEO experience</strong>, including 2+ years in a team lead role.</li>\n<li>Proven expertise in <strong>technical SEO</strong>, <strong>content strategy</strong>, and <strong>link-building</strong>.</li>\n<li>Strong knowledge of <strong>search algorithms</strong>, ranking factors, and SEO trends.</li>\n<li>Proficiency in <strong>Google Analytics</strong>, <strong>Google Search Console</strong>, <strong>SEMrush</strong>, <strong>Ahrefs</strong>, <strong>Screaming Frog</strong>.</li>\n<li>Understanding of <strong>mobile-first indexing</strong>, <strong>Core Web Vitals</strong>, and <strong>structured data</strong> (schema markup).</li>\n<li>Experience with <strong>A/B testing</strong>, <strong>CRO</strong>, and <strong>Google My Business optimization</strong>.</li>\n<li>Ability to analyze SEO data for actionable decisions.</li>\n<li>Excellent <strong>communication</strong> and <strong>stakeholder management</strong> skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Basic knowledge of <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>.</li>\n<li>Understanding of <strong>PPC advertising</strong> and its synergy with organic search.</li>\n<li>Experience in <strong>high-growth startups</strong> or fast-paced environments.</li>\n<li>Familiarity with <strong>social media marketing</strong> and its SEO impact.</li>\n<li>Strong <strong>project management</strong> skills for multi-initiative execution.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with innovative solutions.</li>\n<li>Dynamic, fast-paced, and innovation-driven culture.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/seo-team-lead\">https://waydot.greythr.com/hire/jobs/seo-team-lead</a></p>",
        "tags": [
            "9-11 Years",
            "Technical SEO",
            "Content Strategy",
            "Link-Building"
        ],
        "summary": "Lead SEO strategies and team for a top auto super app with 10M+ users. Drive growth through technical SEO, content, and data-driven insights."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26498",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3><strong>Job Title</strong>:</h3>\n<p>Spanish Customer Success Executive</p>\n<h3><strong>Work Arrangement</strong>:</h3>\n<p>On-site</p>\n<h3><strong>Employment Type</strong>:</h3>\n<p>Full-time</p>\n<h3><strong>Role Overview</strong></h3>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a <strong>Spanish Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our Spanish-speaking clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li><strong>Customer Interaction</strong>: Manage inbound and outbound calls, delivering prompt and effective resolutions to customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence</strong>: Provide empathetic, professional support to ensure a positive customer experience in every interaction.</li>\n<li><strong>Issue Escalation</strong>: Identify, prioritize, and escalate complex cases to the appropriate departments for swift resolution.</li>\n<li><strong>Documentation</strong>: Maintain accurate records of customer interactions and keep databases up to date.</li>\n<li><strong>Performance Goals</strong>: Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge</strong>: Stay informed on company products and services to provide customers with accurate and up-to-date information.</li>\n<li><strong>Team Collaboration</strong>: Work closely with colleagues to foster a supportive, collaborative, and high-performing work environment.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li><strong>Fluent in both Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li><strong>Proven experience</strong> in a customer service role, preferably in a voice process.</li>\n<li><strong>Strong interpersonal and communication skills</strong>, with a patient and empathetic approach.</li>\n<li><strong>Ability to multitask</strong> and <strong>manage time efficiently</strong> in a fast-paced environment.</li>\n<li><strong>Familiarity with automotive services</strong>, fintech platforms, or similar industries is an advantage.</li>\n<li><strong>Flexibility to work in shifts</strong> and adapt to changing schedules.</li>\n</ul>\n<h3><strong>Why You Will Love Working with Us</strong></h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a <strong>meaningful impact</strong> across 10+ million users.</li>\n<li><strong>Dynamic, fast-paced</strong>, and innovation-driven work culture.</li>\n<li><strong>Clear pathways for career growth</strong> in a rapidly scaling technology company.</li>\n<li><strong>Competitive compensation</strong>.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\">https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</a></p>\n<p><strong>Contact Email</strong>: careers@way.com</p>",
        "tags": [
            "1-2 Years",
            "Spanish",
            "Customer Service",
            "Automotive Services"
        ],
        "summary": "Seeking a Spanish-speaking Customer Success Executive to provide top-tier support in a dynamic automotive tech environment. Requires bilingual communication and customer service excellence."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26497",
        "location": "Technopark",
        "closing_date": "08 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Customer Success Executive</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a <strong>Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Address customer queries through <strong>phone, email, chat, and social media channels</strong>.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to <strong>products, orders, returns, and general support requests</strong>.</li>\n<li>Maintain accurate <strong>customer records and feedback</strong> in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking <strong>customer satisfaction metrics</strong> and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience (<strong>2-5 years</strong>) in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Contact Information</h3>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a></li>\n</ul>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Customer Service",
            "Problem-Solving"
        ],
        "summary": "Customer Success Executive handles customer inquiries via multiple channels, requiring 2-5 years of experience. Role emphasizes CRM systems, problem-solving, and customer service in a fast-paced tech environment."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Devicedriven India (P) Ltd",
        "url": "https://technopark.org/job-details/26496",
        "location": "Technopark",
        "closing_date": "04 Feb 2026",
        "job_description": "<p><strong>DeviceDriven India (P) Ltd</strong>\n<em>Padmanabha, Technopark Campus, Trivandrum , 695581</em>\n<em>http://www.devicedriven.com</em></p>\n<p><strong>Senior Java Developer</strong>\n<em>Closing Date:</em> 04, Feb 2026\n<em>Job Published:</em> 04, Jan 2026\n<em>Contact Email:</em> jobs@devicedriven.com</p>\n<h3>Brief Description</h3>\n<p>DeviceDriven is contributing engineering expertise to a major <strong>fintech-led digital transformation</strong> initiative focused on modernizing a global-scale transaction and engagement platform. The platform powers millions of secure, real-time transactions across ecosystems such as travel, retail, and digital assets — delivering data-driven, scalable, and frictionless experiences for consumers and enterprise partners. Built on the foundations of <strong>cloud-native architecture</strong>, <strong>microservices</strong>, and <strong>AI-powered intelligence</strong>, the program aims to redefine how next-generation financial and digital platforms operate at scale.</p>\n<h3>What You’ll Work On</h3>\n<p>You’ll join a <strong>high-impact engineering team</strong> responsible for:\n- Re-architecting and enhancing core transaction modules — including payment flows, partner integrations, and data processing pipelines.\n- Building AI-assisted APIs for personalization, fraud prevention, and dynamic decisioning.\n- Leveraging cloud platforms for scalable compute, messaging, analytics, and data infrastructure.\n- Using Generative AI tools (OpenAI, GitHub Copilot, Claude, etc.) to accelerate development and improve quality.\n- Implementing real-time observability and insights systems to surface intelligence across partners, customers, and transactions.</p>\n<h3>Preferred Skills &amp; Experience</h3>\n<p><strong>Required Experience:</strong>\n- 6–12 years in backend development (Spring Boot + Cloud required)</p>\n<p><strong>Core Responsibilities:</strong>\n- Build, enhance, and optimize core backend services for earning, redemption, and partner integrations\n- Implement high-quality, testable RESTful APIs with real-time messaging and event handling\n- Integrate with Cloud services for storage, queuing, observability, and analytics\n- Contribute to CI/CD pipelines, ensure deployment resilience and cost efficiency\n- Use AI-powered tools (Copilot, Codex, Claude) to generate code, tests, and documentation\n- Participate in data-driven monitoring, building reporting metrics into applications\n- Support cross-functional collaboration with frontend, QA, and data analytics teams</p>\n<p><strong>Technical Expertise:</strong>\n- <strong>Languages &amp; Frameworks:</strong> Java 11+, Spring Boot, JPA, Hibernate, Maven/Gradle\n- <strong>Cloud &amp; Infra:</strong> AWS and GCP and associated services\n- <strong>Messaging:</strong> Kafka, SQS/SNS, RabbitMQ, event streaming, pub/sub design\n- <strong>Automation &amp; DevOps:</strong> Docker, Jenkins, Terraform, GitHub Actions\n- <strong>Testing:</strong> JUnit, Mockito, Testcontainers, Postman, integration testing in pipelines\n- <strong>AI Productivity:</strong> GitHub Copilot, Codex, Claude and various AI tools and services\n- <strong>Analytics:</strong> Expose API metrics for reporting, connect backend logs to BI/monitoring pipelines\n- <strong>Security:</strong> IAM roles, OAuth2/JWT, encryption at rest &amp; transit</p>\n<p><strong>Bonus Experience:</strong>\n- Experience with real-time analytics, BI dashboards\n- Working knowledge of fraud/risk analytics and personalization APIs\n- Understanding of NoSQL + SQL coexistence patterns in microservices</p>\n<p><strong>What You’ll Gain:</strong>\n- Direct exposure to production-grade, scalable cloud systems\n- Ability to experiment with AI-assisted development tools\n- Visibility across end-to-end product lifecycle — architecture, implementation, and delivery\n- Growth into lead or architect tracks in a high-impact fintech ecosystem</p>\n<h3>How to Apply</h3>\n<p>Send your resume, GitHub/LinkedIn profile, and a short introduction to: <strong>jobs@devicedriven.com</strong></p>",
        "tags": [
            "6–12 Years",
            "Spring Boot",
            "AWS/GCP",
            "Kafka"
        ],
        "summary": "DeviceDriven seeks a Senior Java Developer to modernize a global fintech platform using cloud-native architecture and AI tools. Responsibilities include building scalable backend services and integrating AI-assisted development for secure, real-time transactions."
    },
    {
        "job_title": "Java Developer",
        "company": "Devicedriven India (P) Ltd",
        "url": "https://technopark.org/job-details/26495",
        "location": "Technopark",
        "closing_date": "04 Feb 2026",
        "job_description": "<h2>DeviceDriven India (P) Ltd</h2>\n<p><strong>Location:</strong> Padmanabha, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.devicedriven.com\">http://www.devicedriven.com</a>\n<strong>Closing Date:</strong> 04, Feb 2026\n<strong>Published:</strong> 04, Jan 2026\n<strong>Contact Email:</strong> jobs@devicedriven.com</p>\n<h3>About the Role</h3>\n<p>DeviceDriven is driving a <strong>fintech-led digital transformation</strong> to modernize a global transaction and engagement platform. This cloud-native, AI-powered system powers millions of real-time transactions across travel, retail, and digital assets, delivering scalable, data-driven experiences for consumers and enterprises.</p>\n<h3>What You’ll Work On</h3>\n<ul>\n<li>Re-architecting core transaction modules (payment flows, partner integrations, data pipelines)</li>\n<li>Building AI-assisted APIs for personalization, fraud prevention, and decisioning</li>\n<li>Leveraging cloud platforms (AWS/GCP) for scalable compute, messaging, and analytics</li>\n<li>Using Generative AI tools (OpenAI, GitHub Copilot, Claude) to accelerate development</li>\n<li>Implementing real-time observability systems for transaction insights</li>\n</ul>\n<h3>Core Responsibilities</h3>\n<ul>\n<li>Develop backend services, REST APIs, and data access layers</li>\n<li>Collaborate with senior engineers on cloud deployment best practices</li>\n<li>Build real-time messaging and integration modules</li>\n<li>Utilize AI tools for code generation, documentation, and test automation</li>\n<li>Implement API analytics, monitoring, and dashboards</li>\n<li>Optimize performance and resilience of backend systems</li>\n</ul>\n<h3>Technical Expertise</h3>\n<ul>\n<li><strong>Languages &amp; Frameworks:</strong> Java, Spring Boot, REST, JPA/Hibernate</li>\n<li><strong>Cloud:</strong> AWS/GCP services</li>\n<li><strong>Messaging:</strong> Kafka basics, SQS/SNS, async event flows</li>\n<li><strong>Dev Tools:</strong> Git, Docker, Jenkins, Maven/Gradle</li>\n<li><strong>AI Tools:</strong> GitHub Copilot, Codex, Claude</li>\n<li><strong>Analytics:</strong> CloudWatch logging/metrics, QuickSight/Grafana</li>\n<li><strong>Testing:</strong> Unit/integration testing, TDD concepts</li>\n</ul>\n<h3>Bonus Experience</h3>\n<ul>\n<li>Event-driven design or reactive programming</li>\n<li>BI tools, API analytics, or report dashboards</li>\n<li>Interest in AI-assisted engineering/prompt-driven development</li>\n</ul>\n<h3>What You’ll Gain</h3>\n<ul>\n<li>Hands-on microservices/cloud production experience</li>\n<li>Mentorship from senior architects and AI tooling access</li>\n<li>Exposure to analytics/reporting pipelines</li>\n<li>Collaborative innovation-focused culture</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume, GitHub/LinkedIn profile, and a short introduction to: <strong>jobs@devicedriven.com</strong></p>",
        "tags": [
            "3–7 Years",
            "Java",
            "Spring Boot",
            "AWS/GCP"
        ],
        "summary": "Java Developer with 3–7 years of experience to build cloud-native, AI-assisted systems for a global fintech platform. Focus on microservices, real-time analytics, and AI tools for scalable solutions."
    },
    {
        "job_title": "DevOps Lead Engineer",
        "company": "Devicedriven India (P) Ltd",
        "url": "https://technopark.org/job-details/26494",
        "location": "Technopark",
        "closing_date": "04 Feb 2026",
        "job_description": "<h2>DeviceDriven India (P) Ltd</h2>\n<p><strong>Location:</strong> Padmanabha, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.devicedriven.com\">http://www.devicedriven.com</a>\n<strong>Closing Date:</strong> 04, Feb 2026\n<strong>Job Published:</strong> 04, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:jobs@devicedriven.com\">jobs@devicedriven.com</a></p>\n<h3>Brief Description</h3>\n<p><strong>Experience:</strong> 10+ years (3–5 years in leadership roles)</p>\n<h3>About the Opportunity</h3>\n<p>DeviceDriven is leading a major digital transformation initiative for a global-scale platform processing millions of secure transactions across industries. As a <strong>DevOps Lead Engineer</strong>, you will architect and operate a <strong>multi-cloud, highly scalable, secure, and compliance-ready cloud platform</strong> built on <strong>GCP, Kubernetes, GitOps, and Infrastructure-as-Code</strong>. This high-impact role influences platform reliability, deployment velocity, security posture, cost efficiency, and operational excellence.</p>\n<h3>Role Overview</h3>\n<p>We seek a hands-on DevOps leader with expertise in:\n- <strong>GCP cloud architecture</strong>\n- <strong>Kubernetes platforms (GKE or equivalent)</strong>\n- <strong>Terraform &amp; IaC best practices</strong>\n- <strong>GitOps workflows</strong>\n- <strong>CI/CD pipelines at scale</strong>\n- <strong>Security &amp; compliance (PCI/SOX preferred)</strong>\n- <strong>Production reliability &amp; observability</strong></p>\n<p>You will collaborate with engineering, security, SRE, and client architecture teams to shape infrastructure direction and ensure operational excellence.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Cloud Architecture (GCP + Multi-Cloud)</strong>\n- Design and operate cloud infrastructure across multiple regions and environments.\n- Define networking, identity, security, and infrastructure standards.\n- Drive multi-cloud integration patterns (GCP primary, AWS/Azure optional).</p>\n<p><strong>Infrastructure-as-Code &amp; Automation</strong>\n- Own Terraform architecture, module standards, versioning, validation, and automation.\n- Establish GitOps workflows for infrastructure and application deployments.\n- Lead migration from legacy setups to fully automated IaC-based systems.</p>\n<p><strong>Kubernetes Platform Engineering</strong>\n- Architect and operate production-grade Kubernetes clusters at scale.\n- Implement service mesh, observability, deployment strategies, and workload security.\n- Define best practices for manifests, Helm/Kustomize, CI-integrated testing, and rollouts.</p>\n<p><strong>CI/CD &amp; Deployment Automation</strong>\n- Design enterprise CI/CD pipelines (GitHub Actions, Azure DevOps, etc.).\n- Implement secure build pipelines, artifact management, and progressive delivery.</p>\n<p><strong>Security, Compliance &amp; Governance</strong>\n- Implement cloud security controls aligned with PCI/SOX and enterprise compliance.\n- Manage secrets, encryption, IAM, policies, and audit posture.\n- Collaborate with security teams on vulnerability management and incident prevention.</p>\n<p><strong>Observability &amp; Reliability</strong>\n- Build unified logging, metrics, tracing, SLO/SLI frameworks, and dashboards.\n- Lead incident response, production readiness assessments, and capacity planning.\n- Advocate for reliability engineering, chaos testing, and best practices.</p>\n<p><strong>Leadership &amp; Collaboration</strong>\n- Mentor DevOps and platform engineers.\n- Lead technical reviews, RFCs, and architecture discussions.\n- Enable engineering teams with self-service tooling and platform capabilities.</p>\n<h3>Required Skills &amp; Qualifications</h3>\n<p><strong>Technical</strong>\n- 10+ years in DevOps, SRE, and cloud platform roles.\n- Strong expertise with GCP (VPC, IAM, GKE, Cloud SQL, security products).\n- Deep Kubernetes experience (cluster design, service mesh, policies, deployment patterns).\n- Expert-level Terraform (modules, state, multi-cloud providers).\n- Strong CI/CD experience and GitOps methodologies.\n- Strong grounding in cloud security principles, IAM, secrets, encryption.\n- Experience with observability stacks (Prometheus, Datadog, OpenTelemetry, etc.).\n- Solid scripting: Bash, Python, Go (nice to have).</p>\n<p><strong>Leadership</strong>\n- Ability to lead cloud modernization and DevOps transformation initiatives.\n- Strong communication and cross-team collaboration skills.\n- Experience working with architects, security, and product teams.</p>\n<h3>Bonus</h3>\n<ul>\n<li>Fintech or regulated domain experience.</li>\n<li>AWS or Azure production experience.</li>\n<li>Platform engineering background building internal developer platforms.</li>\n</ul>\n<h3>Why DeviceDriven</h3>\n<ul>\n<li>Work on a global-scale fintech platform with advanced cloud engineering challenges.</li>\n<li>Architect systems using GCP, Kubernetes, Terraform, GitOps, and multi-cloud.</li>\n<li>High autonomy, senior technical ownership, and leadership opportunities.</li>\n<li>Ability to grow into Principal DevOps Architect or Cloud Platform Director roles.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume, GitHub/LinkedIn profile, and a short note about your interest to: <a href=\"mailto:jobs@devicedriven.com\">jobs@devicedriven.com</a></p>",
        "tags": [
            "10+ Years",
            "GCP",
            "Kubernetes",
            "Terraform"
        ],
        "summary": "DeviceDriven seeks a DevOps Lead Engineer with 10+ years of experience to architect GCP, Kubernetes, and Terraform-based cloud platforms, ensuring security, scalability, and operational excellence."
    },
    {
        "job_title": "Senior Database Engineer (Microsoft SQL Server)",
        "company": "Devicedriven India (P) Ltd",
        "url": "https://technopark.org/job-details/26493",
        "location": "Technopark",
        "closing_date": "04 Feb 2026",
        "job_description": "<p><strong>DeviceDriven India (P) Ltd</strong>\n<strong>Location</strong>: Padmanabha, Technopark Campus, Trivandrum, 695581\n<strong>Website</strong>: <a href=\"http://www.devicedriven.com\">http://www.devicedriven.com</a>\n<strong>Job Title</strong>: Senior Database Engineer (Microsoft SQL Server)\n<strong>Closing Date</strong>: 04, Feb 2026\n<strong>Published</strong>: 04, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:jobs@devicedriven.com\">jobs@devicedriven.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p><strong>Experience Required</strong>: 7–12+ years</p>\n<h3><strong>About the Opportunity</strong></h3>\n<p>You will work on a digital transformation program modernizing a global-scale transaction and engagement platform. The platform handles millions of real-time, high-volume operations across multiple regions and partner ecosystems.</p>\n<p>We are seeking a <strong>Senior SQL Server Database Engineer</strong> to take ownership of database performance, reliability, architecture, and operational excellence for a mission-critical, highly transactional platform running on Microsoft SQL Server in a cloud environment.</p>\n<h3><strong>Role Overview</strong></h3>\n<p>In this senior role, you will be the primary SQL Server expert responsible for:\n- Designing and optimizing database schemas\n- Ensuring high availability and operational resilience\n- Performance tuning for large-scale transactional workloads\n- Managing upgrades, patching, and maintenance\n- Supporting engineering teams during feature development and releases\n- Ensuring data integrity, recoverability, and system reliability</p>\n<p>You will collaborate closely with application engineering, DevOps, and architecture teams to ensure the platform’s data layer is fast, scalable, secure, and predictable.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ol>\n<li><strong>Database Architecture &amp; Design</strong></li>\n<li>Design, model, and optimize SQL Server schemas for high-throughput transactional systems</li>\n<li>Define best practices for indexing, normalization, partitioning, and query design</li>\n<li>\n<p>Review and guide schema evolution and data modeling decisions with engineering teams</p>\n</li>\n<li>\n<p><strong>Performance, Tuning &amp; Optimization</strong></p>\n</li>\n<li>Diagnose and resolve performance bottlenecks (blocking, deadlocks, concurrency issues, slow queries)</li>\n<li>Optimize execution plans, indexing strategies, statistics, and resource configuration</li>\n<li>\n<p>Conduct regular health assessments and create remediation plans</p>\n</li>\n<li>\n<p><strong>High Availability &amp; Disaster Recovery</strong></p>\n</li>\n<li>Design, configure, and maintain AlwaysOn Availability Groups, clustering, log shipping, replication, and other HA/DR mechanisms</li>\n<li>Own backup, restore, and failover processes, including regular testing and validation</li>\n<li>\n<p>Ensure data consistency, integrity, and uptime across multiple environments</p>\n</li>\n<li>\n<p><strong>Operations, Monitoring &amp; Reliability</strong></p>\n</li>\n<li>Monitor SQL Server performance using DMVs, PerfMon, Extended Events, Query Store, and profiling tools</li>\n<li>Establish alerting and automated monitoring for query performance, storage, replication, and job failures</li>\n<li>\n<p>Own routine maintenance: index management, statistics updates, patching, upgrades</p>\n</li>\n<li>\n<p><strong>Cloud &amp; Platform Integration (GCP Environment)</strong></p>\n</li>\n<li>Manage SQL Server deployments and operations within a GCP-hosted environment</li>\n<li>Collaborate with DevOps and infrastructure teams on provisioning, scaling, security, and observability</li>\n<li>\n<p>Integrate DB operations into CI/CD and release processes (migrations, pre-flight checks, rollback strategies)</p>\n</li>\n<li>\n<p><strong>Security, Access &amp; Compliance Alignment</strong></p>\n</li>\n<li>Implement secure authentication, authorization, role management, and least-privilege access</li>\n<li>Maintain auditing, logging, and compliance-aligned configuration for sensitive financial data</li>\n<li>\n<p>Ensure encryption, retention, and governance policies are enforced</p>\n</li>\n<li>\n<p><strong>Data Integration, Reporting &amp; Migration</strong></p>\n</li>\n<li>Support ETL, reporting, and analytical workloads via SSIS/SSRS or equivalent tools</li>\n<li>Lead structured data migration efforts between environments or SQL Server versions</li>\n<li>Work with engineering teams to expose reliable, efficient data interfaces</li>\n</ol>\n<h3><strong>Required Skills &amp; Qualifications</strong></h3>\n<ul>\n<li><strong>Technical Expertise</strong>:</li>\n<li>7–12+ years in Database Engineering / SQL Server Administration</li>\n<li>Strong hands-on expertise in Microsoft SQL Server (advanced configuration, tuning, internals)</li>\n<li>AlwaysOn, clustering, replication, log shipping</li>\n<li>Performance tuning and query optimization</li>\n<li>Backup/restore, DR planning, failover testing</li>\n<li>SQL Profiler, Extended Events, DMVs, Query Store</li>\n<li>Experience supporting high-volume OLTP systems</li>\n<li>Experience operating SQL Server in cloud environments (GCP preferred; AWS/Azure acceptable)</li>\n<li>\n<p>Strong understanding of concurrency, locking, transactions, isolation levels, and recovery models</p>\n</li>\n<li>\n<p><strong>Nice-to-Have</strong>:</p>\n</li>\n<li>SSIS / SSRS / ETL experience</li>\n<li>Experience with Looker, data warehousing, or analytical pipelines</li>\n<li>Experience with container-based or microservices ecosystems</li>\n<li>Fintech or regulated environment experience</li>\n<li>\n<p>Exposure to automation via scripting (PowerShell, Python, Bash)</p>\n</li>\n<li>\n<p><strong>Soft Skills</strong>:</p>\n</li>\n<li>Strong ownership and accountability</li>\n<li>Excellent problem-solving and analytical abilities</li>\n<li>Clear communication and ability to work with cross-functional teams</li>\n<li>Calm under pressure and experienced with production incident handling</li>\n<li>Strong documentation discipline</li>\n</ul>\n<h3><strong>Why Join DeviceDriven</strong></h3>\n<ul>\n<li>Work on a global, high-volume platform with real engineering complexity</li>\n<li>Take full ownership of the database layer in a modern cloud environment</li>\n<li>Collaborate with senior architects, backend, DevOps, and AI engineering teams</li>\n<li>Opportunity to evolve into Database Architect or Platform Data Engineering Lead roles</li>\n<li>Culture of technical excellence, autonomy, and innovation</li>\n</ul>\n<h3><strong>How to Apply</strong></h3>\n<p>Send your resume, GitHub/LinkedIn profile, and a short note about your interest to: <a href=\"mailto:jobs@devicedriven.com\">jobs@devicedriven.com</a></p>",
        "tags": [
            "7–12+ Years",
            "Microsoft SQL Server",
            "Cloud (GCP)",
            "High Availability/Disaster Recovery"
        ],
        "summary": "Senior Database Engineer for Microsoft SQL Server in a cloud environment, focusing on performance tuning, high availability, and cross-team collaboration for mission-critical platforms."
    },
    {
        "job_title": "Node.JS Technical Architect",
        "company": "Devicedriven India (P) Ltd",
        "url": "https://technopark.org/job-details/26492",
        "location": "Technopark",
        "closing_date": "04 Feb 2026",
        "job_description": "<h2>DeviceDriven India (P) Ltd</h2>\n<p><strong>Location:</strong> Padmanabha, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.devicedriven.com\">www.devicedriven.com</a>\n<strong>Closing Date:</strong> 04, Feb 2026\n<strong>Job Published:</strong> 04, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:jobs@devicedriven.com\">jobs@devicedriven.com</a></p>\n<h3>About the Opportunity</h3>\n<p>DeviceDriven is leading a major digital transformation initiative, modernizing a global-scale transaction and engagement platform that processes millions of secure, real-time operations. As a <strong>Technical Architect</strong>, you will define and drive the architecture for a complex, distributed, cloud-native platform built on microservices, AI-driven components, multi-cloud infrastructure, and high-volume transactional systems. This role offers the opportunity to make foundational decisions that impact system performance, developer velocity, and customer experience at massive scale.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a hands-on Technical Architect who can own end-to-end architecture across backend services, cloud infrastructure, APIs, front-end integration patterns, data systems, and production observability. You must be strong in <strong>Node.js</strong>, distributed systems, <strong>multi-cloud (AWS + GCP)</strong>, authentication standards, event-driven design, AI-enhanced workflows, <strong>Kubernetes</strong>, and secure production deployments. You will collaborate with multiple engineering squads, DevOps, product teams, and senior client architects to ensure the platform is scalable, secure, consistent, and future-ready.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Platform Architecture &amp; System Design</strong></li>\n<li>Define and evolve the architecture blueprint across microservices, APIs, data pipelines, and integration layers.</li>\n<li>Architect high-volume, low-latency financial transaction systems with strong consistency and fault isolation.</li>\n<li>Own patterns for WebSockets, real-time communication, and bidirectional messaging services.</li>\n<li>Establish standards for API design, GraphQL/REST patterns, rate limiting, and contract-driven development.</li>\n<li>\n<p>Lead decisions around caching, distributed locks, state management, and performance optimization.</p>\n</li>\n<li>\n<p><strong>Authentication, Authorization &amp; Security</strong></p>\n</li>\n<li>Architect secure authentication systems using OAuth2, JWT, SAML, OpenID Connect, and custom identity flows.</li>\n<li>Define encryption, secrets management, secure transport, token lifecycles, and cross-service IAM strategies.</li>\n<li>Ensure compliance with fintech-grade security, audit, and regulatory requirements.</li>\n<li>\n<p>Establish standardized patterns for secure multi-tenant systems.</p>\n</li>\n<li>\n<p><strong>Multi-Cloud Engineering (AWS + GCP)</strong></p>\n</li>\n<li>Design cloud-native services using AWS (ECS, Lambda, RDS, DynamoDB, SQS, SNS, API Gateway) and GCP (Cloud Run, Pub/Sub, Firestore, BigQuery).</li>\n<li>Create cloud-agnostic patterns where feasible.</li>\n<li>Collaborate with DevOps for infrastructure-as-code (Terraform, Helm, CDK, Pulumi).</li>\n<li>\n<p>Define HA/DR strategies, regional failover mechanisms, and network design.</p>\n</li>\n<li>\n<p><strong>Distributed Messaging &amp; Microservices</strong></p>\n</li>\n<li>Architect event-driven workflows using Kafka, RabbitMQ, SQS/SNS, Pub/Sub.</li>\n<li>Establish patterns for idempotency, exactly-once processing, and eventual consistency.</li>\n<li>\n<p>Lead the design for sagas, orchestration, and rule-based flow engines.</p>\n</li>\n<li>\n<p><strong>Kubernetes, Containers &amp; API Gateways</strong></p>\n</li>\n<li>Define deployment patterns on Kubernetes (EKS/GKE) with autoscaling, networking, and service mesh considerations.</li>\n<li>Architect container strategies using Docker, image optimization, and runtime hardening.</li>\n<li>\n<p>Lead the design of API gateways (Kong, Apigee, AWS API Gateway, NGINX) including routing, transformations, and authentication.</p>\n</li>\n<li>\n<p><strong>AI &amp; Automation Integration</strong></p>\n</li>\n<li>Architect and integrate AI agentic flows for fraud prevention, decisioning, personalization, and operational automation.</li>\n<li>Build systems that leverage LLMs (OpenAI, Claude, Gemini) for business logic augmentation, rule orchestration, and developer tools.</li>\n<li>\n<p>Define safe, scalable ways to incorporate AI with guardrails and prompt orchestration design.</p>\n</li>\n<li>\n<p><strong>Front-End Integration &amp; Next.js Awareness</strong></p>\n</li>\n<li>Work with front-end teams using Express/Next.js to define backend contracts, routing strategies, caching, SSR/ISR patterns, and edge-first architectures.</li>\n<li>\n<p>Guide interfaces for real-time components, authenticated flows, and profile/account management.</p>\n</li>\n<li>\n<p><strong>Observability, Reliability, and Production Excellence</strong></p>\n</li>\n<li>Own the architecture for logging, monitoring, metrics, tracing, alerts, and distributed visibility.</li>\n<li>Ensure compliance with SLOs, SLIs, and SLAs, defining reliability targets for all services.</li>\n<li>Lead performance tuning, chaos testing frameworks, load testing, and incident response standards.</li>\n<li>\n<p>Ensure production rollout patterns: blue/green, canary deployments, progressive delivery.</p>\n</li>\n<li>\n<p><strong>Engineering Standards &amp; Team Enablement</strong></p>\n</li>\n<li>Establish coding, testing, CI/CD, and documentation standards across engineering squads.</li>\n<li>Promote automated testing (unit, integration, contract, performance).</li>\n<li>Conduct design reviews, architectural RFCs, and drive cross-team technical alignment.</li>\n<li>Mentor Senior Developers and Leads on system design, patterns, and best practices.</li>\n</ol>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>12+ years</strong> of backend engineering experience (Node.js + TypeScript ideally).</li>\n<li>Deep experience designing and scaling microservices and distributed systems.</li>\n<li>Strong in AWS and GCP architectures for enterprise-grade systems.</li>\n<li>Expertise in SQL and NoSQL: Postgres/MySQL, MongoDB, DynamoDB, Firestore.</li>\n<li>Proficient with Kafka / RabbitMQ / SQS / SNS / Pub/Sub.</li>\n<li>Strong grounding in WebSockets, event-driven patterns, and rule engines.</li>\n<li>Hands-on experience with Docker, Kubernetes (EKS/GKE), service meshes (Istio/Linkerd).</li>\n<li>Strong understanding of OAuth2, SAML, JWT, OpenID Connect, and enterprise identity.</li>\n<li>Familiarity with Next.js, React, Angular or equivalent front-end frameworks.</li>\n<li>Exposure to AI engineering — agentic flows, prompting, vector search, LLM workflows.</li>\n<li>Experience in building high-throughput systems with tight reliability constraints.</li>\n</ul>\n<h3>Leadership &amp; Collaboration</h3>\n<ul>\n<li>Experience guiding multiple engineering squads.</li>\n<li>Ability to architect, document, communicate, and justify decisions.</li>\n<li>Experience working with senior client architects, product teams, and DevOps.</li>\n<li>Strong problem-solving and cross-team coordination skills.</li>\n</ul>\n<h3>Bonus</h3>\n<ul>\n<li>Fintech, payments, or transaction-heavy domain expertise.</li>\n<li>Experience designing fraud/risk scoring systems.</li>\n<li>Familiarity with DDD, CQRS, and event sourcing.</li>\n<li>Experience with serverless + container hybrid architectures.</li>\n</ul>\n<h3>Why DeviceDriven</h3>\n<ul>\n<li>Work on a global-scale fintech system handling millions of real-time transactions.</li>\n<li>Architect next-generation systems with AI, multi-cloud, Kubernetes, and event-driven designs.</li>\n<li>Join a high-performance engineering culture of excellence, innovation, and autonomy.</li>\n<li>Opportunity to grow into Principal Architect roles.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume, GitHub/LinkedIn profile, and a short note about your interest to: <a href=\"mailto:jobs@devicedriven.com\">jobs@devicedriven.com</a></p>",
        "tags": [
            "12+ Years",
            "Node.js",
            "Multi-Cloud (AWS + GCP)",
            "Kubernetes"
        ],
        "summary": "DeviceDriven seeks a Node.js Technical Architect to lead cloud-native platform architecture, integrating AI, multi-cloud, and Kubernetes for high-scale fintech systems."
    }
]