[
    {
        "job_title": "Intern — React Front-End (with UI/UX Basics)",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/21133/296",
        "location": "Infopark",
        "closing_date": "24 Nov 2025",
        "job_description": "<h2>Intern — React Front-End (with UI/UX Basics)</h2>\n<p><strong>Location:</strong> Infopark, Kakkanad\n<strong>Mode:</strong> Full-time (Office)</p>\n<h3>About the Role:</h3>\n<p>We are looking for a React Front-End Intern with basic knowledge of web development and UI/UX. You will learn, support the team, and help build responsive web pages and simple features.</p>\n<h3>Skills Required:</h3>\n<ul>\n<li>Basic understanding of React.js</li>\n<li>Knowledge of HTML, CSS, and JavaScript</li>\n<li>Good understanding of UI/UX and tools like Figma/Adobe XD</li>\n<li>Willingness to learn and work in a team</li>\n<li>Basic understanding of Git (added advantage)</li>\n<li>Knowledge of REST APIs (added advantage)</li>\n</ul>\n<h3>Who Can Apply:</h3>\n<ul>\n<li>Freshers — only 2025, 2024, and 2023 passouts</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@grapelime.in</p>",
        "tags": [
            "Fresher",
            "React.js",
            "UI/UX",
            "HTML/CSS"
        ],
        "summary": "Seeking a React Front-End Intern with UI/UX basics for an office-based, full-time role. Learn and assist in building responsive web pages and features."
    },
    {
        "job_title": "Devops Engineer - 5+ Years",
        "company": "Thinkpalm Technologies Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21145/49",
        "location": "Infopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>DevOps Engineer - 5+ Years Experience</h2>\n<p><strong>Notice Period:</strong> Immediate to 15 Days</p>\n<p><strong>Qualification:</strong> BTech/BE/Masters is mandatory</p>\n<p><strong>Key Responsibilities:</strong>\n- Design and maintain CI/CD pipelines (e.g., Jenkins, GitHub Actions, GitLab CI) for containerized microservices across shore and vessel environments.\n- Architect and manage cloud-agnostic deployments across AWS, Azure, and on-premise (vessel) environments using Kubernetes and Docker.\n- Implement infrastructure as code (IaC) using tools like Terraform &amp; Ansible.\n- Set up automated health checks, monitoring, and logging systems for real-time operational visibility (e.g., Prometheus, Grafana, ELK, Datadog, etc.).\n- Support and manage PostgreSQL Write-Ahead Logging (WAL) replication and data sync agents between offline (vessel) and online (shore/cloud) systems.\n- Ensure high availability through multi-zone or hot standby configurations in the cloud.\n- Handle RBAC, PBAC, OAuth2/OIDC, and Zero Trust implementation via API Gateway, WAF, and Identity Server.\n- Coordinate with backend/frontend engineers and QA teams for release planning and post-deployment support.</p>\n<p><strong>Must-Have Skills:</strong>\n- Strong experience with Kubernetes, Docker, and containerized microservices.\n- Hands-on with Terraform, Helm, Ansible and IaC frameworks.\n- Deep understanding of GitOps, release pipelines, and feature toggling.\n- Experience working with PostgreSQL including WAL and logical replication.\n- Familiarity with network protocols, CDN, firewalls, and reverse proxies.\n- Cloud-native architecture experience (AWS, Azure, GCP) and hybrid deployments.\n- Strong scripting (Python, Bash, PowerShell) and automation skills.</p>\n<p><strong>Good-to-Have:</strong>\n- Experience with IoT edge computing (MODBUS, MQTT, NMEA protocols) onboard vessels.\n- Exposure to zero-downtime deployments, blue/green, or canary releases.\n- Understanding of maritime compliance standards: IMO, SOLAS, GDPR, etc.</p>\n<p><strong>Soft Skills:</strong>\n- Strong leadership and mentoring abilities.\n- Excellent communication and documentation skills.\n- Decision-maker under pressure, especially during outages or sync failures.\n- Collaborative mindset with cross-functional teams.</p>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at r.reshma@thinkpalm.com</p>",
        "tags": [
            "5+ Years",
            "Kubernetes",
            "Terraform",
            "AWS"
        ],
        "summary": "DevOps Engineer needed with 5+ years experience in CI/CD, Kubernetes, and cloud-agnostic deployments. Requires strong IaC, automation, and PostgreSQL replication skills."
    },
    {
        "job_title": "ML Engineer - 3+ Years",
        "company": "Thinkpalm Technologies Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21146/49",
        "location": "Infopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>ML Engineer</h2>\n<p><strong>Experience:</strong> 3+ Years\n<strong>Notice Period:</strong> Immediate to 30 Days\n<strong>Qualification:</strong> BTech/BE/Masters is mandatory</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and optimize AI/ML models for real-world applications.</li>\n<li>Build and maintain pipelines using LangChain/LangGraph to integrate LLMs into production workflows.</li>\n<li>Work with data ingestion, preprocessing, and feature engineering to ensure model readiness.</li>\n<li>Collaborate with product and engineering teams to deliver scalable AI solutions.</li>\n<li>Optimize performance of deployed models and ensure reliability in production environments.</li>\n<li>Stay updated with advancements in generative AI, LLM orchestration, and emerging ML frameworks.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Data Science, AI/ML, or a related field.</li>\n<li>3+ years of experience in AI/ML engineering.</li>\n<li>Strong proficiency in Python and ML libraries such as TensorFlow, PyTorch, Scikit-learn, Pandas, and NumPy.</li>\n<li>Proven experience in building LLM applications using LangChain and/or LangGraph.</li>\n<li>Good understanding of natural language processing (NLP) techniques.</li>\n<li>Knowledge of REST APIs, data pipelines, and cloud platforms (AWS/Azure/GCP).</li>\n<li>Strong problem-solving, debugging, and optimization skills.</li>\n</ul>\n<h3>Nice to Have:</h3>\n<ul>\n<li>Familiarity with vector databases (e.g., Pinecone, Weaviate, FAISS).</li>\n<li>Experience with orchestration tools for multi-agent AI systems.</li>\n<li>Exposure to MLOps practices for deployment and monitoring.</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at r.reshma@thinkpalm.com</p>",
        "tags": [
            "3+ Years",
            "LangChain",
            "Python",
            "LLM"
        ],
        "summary": "ML Engineer needed with 3+ years of experience in AI/ML model development. Must be proficient in Python and LLM applications using LangChain."
    },
    {
        "job_title": "Office Assistant",
        "company": "Mantra IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21141/383",
        "location": "Infopark",
        "closing_date": "29 Nov 2025",
        "job_description": "<h2>Office Assistant</h2>\n<p>We are seeking a highly organized and detail-oriented Office Assistant to support our daily administrative and accounting operations. This role is ideal for individuals with a strong commerce background and the maturity to handle responsibilities independently.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Manage day-to-day administrative tasks such as filing, documentation, and data entry.</li>\n<li>Assist with basic accounting functions, including maintaining records, preparing vouchers, and updating entries in Tally.</li>\n<li>Handle phone calls, emails, and official correspondence professionally.</li>\n<li>Coordinate with internal teams, vendors, and clients to ensure smooth office operations.</li>\n<li>Maintain office inventory, monitor petty cash, and track routine operational expenses.</li>\n<li>Support the HR and Accounts departments with routine administrative functions.</li>\n<li>Perform additional clerical or administrative tasks assigned by management.</li>\n</ul>\n<h3>Qualifications &amp; Skills:</h3>\n<ul>\n<li>B.Com/M.Com qualification is mandatory.</li>\n<li>Working knowledge of Tally is highly preferred.</li>\n<li>Proficiency in MS Office (Word, Excel, Outlook).</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Excellent organizational skills and attention to detail.</li>\n<li>Ability to multitask, prioritize tasks, and work independently.</li>\n<li>Candidates with prior experience or those re-entering the workforce after a career break are encouraged to apply.</li>\n<li>Preference will be given to individuals with a mature, responsible approach and the ability to work independently with minimal supervision.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates are requested to send their updated resume and, if available, a portfolio to: \n📧 hr@mantraitsolutions.in</p>\n<p>Alternatively, you can apply directly through the Careers section on our website:\n🌐 https://mantraitsolutions.in</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@mantraitsolutions.in</p>",
        "tags": [
            "0-2 Years",
            "Tally",
            "MS Office",
            "Commerce"
        ],
        "summary": "Seeking a B.Com/M.Com qualified Office Assistant for administrative and accounting support. Must be organized, detail-oriented, and proficient in MS Office and Tally."
    },
    {
        "job_title": "Python Developer-– AI & Voice Agent Specialist",
        "company": "Voxtron Solutions LLP",
        "url": "https://infopark.in/company-jobs/details/21140/336",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Python Developer - AI &amp; Voice Agent Specialist</h2>\n<p><strong>About the Role:</strong></p>\n<p>We are seeking an experienced Python Developer with deep expertise in AI workflows, AI Agents, and Voice AI Agents. The ideal candidate will design, develop, and deploy intelligent conversational systems capable of handling complex, multi-step business processes across multiple channels. The role requires hands-on experience in AI development, WebRTC, and SIP-based telephony integrations.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain AI-powered chatbots and voice agents using Python.</li>\n<li>Implement and optimize AI workflows and autonomous AI Agents for complex business processes.</li>\n<li>Integrate voice AI capabilities, including speech recognition, TTS (Text-to-Speech), and conversational voice interactions.</li>\n<li>Develop and maintain WebRTC- and SIP-based telephony integrations for real-time voice communication.</li>\n<li>Collaborate with cross-functional teams to design scalable, real-time AI solutions.</li>\n<li>Work with LLMs, RAG systems, or other AI architectures to enhance agent intelligence.</li>\n<li>Troubleshoot, debug, and enhance AI systems for performance and reliability.</li>\n<li>Stay updated with the latest advancements in NLP, AI workflows, agentic AI, and voice technologies.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li>4+ years in Python and Python-based AI frameworks.</li>\n<li>Hands-on experience with chatbots, agentic AI, AI Agents, and AI workflow orchestration.</li>\n<li>Voice AI Agent experience is mandatory (speech recognition, TTS, conversational voice AI).</li>\n<li>Experience with AI development, WebRTC, and SIP telephony integration.</li>\n<li>Familiarity with LLMs, RAG, or similar AI architectures.</li>\n<li>Knowledge of cloud deployment, APIs, and real-time system integration.</li>\n<li>Strong problem-solving skills and ability to work in a fast-paced environment.</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lavanya@voxtronme.com</p>",
        "tags": [
            "4+ Years",
            "Python",
            "AI Agents",
            "Voice AI"
        ],
        "summary": "Seeking an experienced Python Developer for AI & Voice Agent Specialist role. Design, develop, and deploy intelligent conversational systems and voice agents with WebRTC/SIP integration."
    },
    {
        "job_title": "Senior Accountant",
        "company": "TutorComp Infotech (I) Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21143/44",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Senior Accountant</h2>\n<p>We are seeking an experienced and proactive Senior Accountant to oversee our company’s day-to-day financial operations, compliance, and government liaison activities. The ideal candidate should have strong accounting knowledge, multitasking ability, and readiness to travel for official duties.</p>\n<p><strong>Experience:</strong> 5 years and above</p>\n<p><strong>Key Responsibilities:</strong>\n- Maintain accurate Books of Accounts\n- Ensure compliance with government and statutory regulations\n- Manage cash flow, bank transactions, and reconciliations\n- Prepare monthly and yearly budgets, financial statements, and cost control reports\n- Handle client payment tracking and invoicing (B2B)\n- Verify employee and tutor salaries (Domestic &amp; Foreign)\n- Manage petty cash, vouchers, payment invoices, and office purchases\n- Handle Softex documentation and EDPMS (SEZ) filings\n- Liaise with government departments and regulatory bodies\n- Manage contracts, agreements, FIRC, CPA, MOU records\n- Ensure timely payments for subscriptions, salaries, and statutory dues\n- Coordinate with the CA team for audits, GST filing, TDS, and PT computation\n- Maintain and manage loan accounts, assets, and stationery inventory\n- Support management with custom financial reports as needed</p>\n<p><strong>Key Skills &amp; Requirements:</strong>\n- Solid knowledge of Financial &amp; Cost Accounting\n- Proficiency in Tally ERP / Zoho Books (added advantage)\n- Strong command of MS Office, especially Excel, Word, and PowerPoint\n- Excellent verbal and written communication skills\n- Ability to multitask, solve problems, and adapt to regulatory changes\n- Prior experience with statutory compliance, taxation, and internal audits\n- Must be comfortable with field visits to government offices</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tutorcomp.com</p>",
        "tags": [
            "5+ Years",
            "Accounting",
            "Statutory Compliance",
            "MS Excel"
        ],
        "summary": "Experienced Senior Accountant needed for financial operations and compliance. Responsibilities include reporting, reconciliation, and government liaison. Requires 5+ years experience."
    },
    {
        "job_title": "SOC Lead / Senior Consultant  Specialist",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/21144/4",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>SOC Lead / Senior Consultant Specialist</h2>\n<p><strong>Location:</strong> Kochi</p>\n<p><strong>Role Overview:</strong>\nThe SOC Lead serves as a senior member of the Monitoring and Threat Detection function. This role focuses on high-quality incident triage, technical escalation management, continuous improvement of detection capabilities, and leading incident analysis across enterprise-wide environments. The SOC Lead mentors L1/L2 analysts, ensures SLA compliance, and drives process innovation within the SOC.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead deeper security investigations (L2/L3) and advanced triage of escalated alerts across SIEM, EDR, and email security platforms.</li>\n<li>Collaborate with Threat Detection, Incident Response, and Threat Hunting teams to validate and escalate potential threats.</li>\n<li>Oversee quality assurance of security tickets and ensure accurate root cause and kill chain identification.</li>\n<li>Manage the design and optimization of detection rules, threat correlation logic, and playbooks within SIEM/SOAR tools.</li>\n<li>Provide subject matter expertise in high-severity incident response and containment, ensuring coordinated communication with clients and internal stakeholders.</li>\n<li>Conduct and support Purple Team simulations and threat validation exercises to assess detection efficacy.</li>\n<li>Mentor and guide SOC analysts, fostering technical growth and enforcing operational discipline.</li>\n<li>Coordinate with enterprise teams on email and cloud security incidents, leading Proofpoint and Microsoft 365 Defender investigations.</li>\n<li>Define and maintain documentation including incident response procedures, triage guides, and detection playbooks.</li>\n<li>Contribute to automation initiatives to reduce repetitive manual work and improve response efficiency.</li>\n</ul>\n<p><strong>Additional Responsibilities:</strong></p>\n<ul>\n<li>Lead SIEM architecture and design, ensuring scalable log ingestion, parsing, normalization, and enrichment across cloud and on-prem environments.</li>\n<li>Oversee SIEM administration, including connector management, health monitoring, log source onboarding, and retention optimization.</li>\n<li>Define and enforce triage standards for SIEM alerts, ensuring consistent severity classification, enrichment, and correlation logic.</li>\n<li>Evaluate and enhance SIEM use case lifecycle management—from requirements gathering to rule tuning, false-positive reduction, and KPI reporting.</li>\n<li>Drive continuous improvement of SIEM detection coverage, aligning with threat models, MITRE ATT&amp;CK techniques, and emerging adversary behaviors.</li>\n</ul>\n<p><strong>Core Skills and Experience:</strong></p>\n<ul>\n<li>Over 10 years of cybersecurity operations experience, with at least 4-5 years in SOC L2/L3 or senior incident response roles.</li>\n<li>Hands-on expertise with multiple SIEM platforms (e.g., AWS, Azure Wazuh, Splunk, Log360, Elastic).</li>\n<li>Proficient with leading EDR tools such as CrowdStrike, Microsoft Defender, SentinelOne, Fortinet.</li>\n<li>Strong working knowledge of Email Security (TAP, DLP, Threat Response, SPF/DKIM/DMARC) tools such as FortiMail, Microsoft Purview, Proofpoint.</li>\n<li>Expertise in attack vectors, MITRE ATT&amp;CK mapping, threat analysis, and incident containment strategies.</li>\n<li>Solid understanding of enterprise infrastructure — networks, firewalls, endpoint platforms, OS (Windows/Linux), and web applications.</li>\n<li>Excellent knowledge of cloud security operations across Azure, AWS, and Google Cloud.</li>\n<li>Awareness of major security frameworks: ISO 27001, NIST, CIS, OWASP, and PCI DSS.</li>\n<li>Functional knowledge of SOAR automation and orchestration workflows.</li>\n</ul>\n<p><strong>Leadership and Delivery:</strong></p>\n<ul>\n<li>Lead service operations ensuring incident SLAs are consistently met.</li>\n<li>Conduct regular performance reviews and provide knowledge-sharing sessions to elevate SOC maturity.</li>\n<li>Liaise with customers to discuss incident outcomes, mitigations, and improvement recommendations.</li>\n<li>Manage process documentation and enforce consistent global SOC methodologies.</li>\n</ul>\n<p><strong>Desired Certifications:</strong></p>\n<ul>\n<li>CEH, GCIA, GCIH, CISSP, or equivalent cybersecurity certifications.</li>\n<li>Vendor-specific credentials (Microsoft, Proofpoint, or SIEM/EDR certifications) preferred.</li>\n</ul>\n<p><strong>Additional Attributes:</strong></p>\n<ul>\n<li>Strong analytical, investigative, and documentation skills.</li>\n<li>Excellent communication and presentation abilities.</li>\n<li>Self-driven with ability to manage multiple escalations under pressure.</li>\n<li>Flexible to work in a 24x7 rotational environment if required.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at merin.cb@arttechgroup.com</p>",
        "tags": [
            "10+ Years",
            "SIEM",
            "EDR",
            "Cloud Security"
        ],
        "summary": "Senior SOC Lead responsible for incident triage, threat detection, and team mentorship. Drives process innovation and ensures SLA compliance in security operations."
    },
    {
        "job_title": "Python Developer (Core Python + AI Experience)",
        "company": "Voxtron Solutions LLP",
        "url": "https://infopark.in/company-jobs/details/21148/336",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Python Developer (Core Python + AI Experience)</h2>\n<p><strong>Job Summary</strong></p>\n<p>We are seeking an experienced Python Developer with strong expertise in Core Python and hands-on experience in Artificial Intelligence (AI) technologies. The ideal candidate will work on backend development, automation, AI model integration, and data-driven solutions. You will collaborate with cross-functional teams to build scalable, intelligent applications.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Develop, optimize, and maintain applications using Core Python.</li>\n<li>Design and integrate AI/ML models into applications.</li>\n<li>Work with machine learning pipelines, model inference, and data processing workflows.</li>\n<li>Build and manage RESTful APIs and backend logic for AI-enabled applications.</li>\n<li>Write clean, reusable, and efficient code following industry best practices.</li>\n<li>Develop automation scripts and AI-based solutions for business problems.</li>\n<li>Debug, troubleshoot, and enhance existing AI and Python applications.</li>\n<li>Collaborate with product managers, data scientists, and engineers to deliver intelligent features.</li>\n<li>Document technical designs, AI workflows, and code modules.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications</strong></p>\n<ul>\n<li>3–6 years of experience as a Python Developer (Core Python is mandatory).</li>\n<li>Hands-on experience in AI / Machine Learning, including model development or integration.</li>\n<li>Strong understanding of Python fundamentals:</li>\n<li>Data structures, OOP, multithreading, decorators, generators</li>\n<li>Exception handling and module development</li>\n<li>Experience with AI/ML libraries such as:</li>\n<li>TensorFlow / PyTorch / Scikit-learn / Keras (any one or more)</li>\n<li>Experience with NLP, computer vision, or predictive analytics is an added advantage.</li>\n<li>Experience in building and consuming REST APIs.</li>\n<li>Strong knowledge of databases (MySQL/PostgreSQL/SQLite).</li>\n<li>Familiarity with Git, version control, and CI/CD workflows.</li>\n<li>Strong debugging, analytical, and problem-solving skills.</li>\n</ul>\n<p><strong>Good to Have</strong></p>\n<ul>\n<li>Experience with Large Language Model (LLM) integration (OpenAI, Hugging Face, etc.).</li>\n<li>Knowledge of Docker and containerized deployments.</li>\n<li>Exposure to cloud services (AWS, Azure, or GCP) for AI model hosting.</li>\n<li>Understanding of data engineering concepts.</li>\n</ul>\n<p><strong>Education</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, AI/ML, Data Science, or related field preferred.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lavanya@voxtronme.com</p>",
        "tags": [
            "3-6 Years",
            "Python",
            "AI/ML",
            "REST APIs"
        ],
        "summary": "Experienced Python Developer needed for backend and AI integration. Responsibilities include developing AI models, building APIs, and creating data-driven solutions."
    },
    {
        "job_title": "Team Lead - ColdFusion",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21147/85",
        "location": "Infopark",
        "closing_date": "02 Dec 2025",
        "job_description": "<h2>Team Lead - ColdFusion</h2>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a global technology services and solutions company with over 17 years of experience providing high-quality end-to-end IT solutions and services to clients worldwide. Techversant specializes in Digital Transformation, understanding evolving industrial scenarios, investment priorities, and technology disruption.</p>\n<p>We offer expertise and consultation in various technology domains including ColdFusion, Python, Java, .NET, Node JS, Ruby on Rails, Golang, PHP, Artificial Intelligence, Blockchain, iOS, Android, Flutter, React Native, Angular, React Vue, and more, catering to diverse industry verticals globally.</p>\n<p><strong>What’s Important to Us:</strong></p>\n<p>We are seeking an experienced Senior Full Stack ColdFusion Lead with 8+ years of experience, coupled with proven technical leadership and mentorship capabilities. The core function requires mastery of CFML, OOP, and robust MVC frameworks (like ColdBox, FW/1), alongside advanced database tuning and RESTful API development. Success depends on exceptional diagnostic skills and architectural oversight to ensure high-performance enterprise applications. Experience with migration (Adobe to Lucee), React.js knowledge, and CI/CD practices is considered desirable.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the architecture, design, and development of enterprise-grade, high-performance web applications using ColdFusion and Lucee, integrating modern frontend technologies like React.js.</li>\n<li>Drive initiatives to migrate legacy Adobe ColdFusion applications to the Lucee platform, ensuring seamless transition, compatibility, and performance optimization.</li>\n<li>Guide, mentor, and coach a team of developers, performing rigorous code reviews and enforcing best practices and coding standards.</li>\n<li>Collaborate closely with business analysts and stakeholders to gather complex requirements, define technical specifications, and manage project lifecycles.</li>\n<li>Oversee performance optimization for existing applications and new feature development, focusing on scalability, security, and reliability.</li>\n<li>Develop and integrate backend systems with frontend interfaces and third-party services using RESTful APIs, SOAP web services, JSON, and XML data formats.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>8+ years of extensive experience in Full Stack ColdFusion development, including proven technical leadership or team management roles.</li>\n<li><strong>Primary Skills:</strong> Deep expertise in CFML, CFCs, SQL, and related web technologies (HTML5, CSS3, JavaScript, jQuery).</li>\n<li>Advanced experience in architecting, designing, and leading the development of highly scalable and complex enterprise-level applications, applying Object-Oriented Programming (OOP) principles and robust MVC frameworks (e.g., ColdBox, FW/1).</li>\n<li>Mastery in hands-on development, optimization, and maintenance of critical web applications using CFML. This includes deep proficiency in database performance tuning, complex SQL query optimization, and schema design for relational databases like Oracle, SQL Server, or MySQL.</li>\n<li>Extensive experience in designing, developing, and consuming complex RESTful APIs and SOAP web services using JSON and XML data formats.</li>\n<li>Proven experience in migrating legacy ColdFusion applications to modern platforms, including migration experience from Adobe ColdFusion to Lucee server environments.</li>\n<li>Strong capability in modern frontend development using HTML5, CSS3, JavaScript, jQuery, and Ajax. Experience with modern JavaScript frameworks, specifically React.js, is required.</li>\n<li>Expert knowledge of code version control tools like Git or SVN. Experience in driving and implementing modern development practices, including CI/CD pipelines, automated testing, and DevOps principles.</li>\n<li>Exceptional diagnostic and troubleshooting skills for highly complex, mission-critical issues in production environments. Eagerness to debug and ensure maximum application uptime and performance.</li>\n<li>Excellent communication and stakeholder management skills. Ability to gather complex requirements, collaborate with cross-functional teams, mentor junior developers, and translate sophisticated business needs into robust technical deliverables.</li>\n<li>A proactive attitude towards learning, evaluating, and adapting to new technologies, industry trends, and driving continuous process improvements.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Familiarity with Agile or Scrum methodologies, including experience leading Scrum teams or ceremonies.</li>\n<li>Familiarity with project management tools, such as JIRA.</li>\n<li>Knowledge of other modern web technologies, such as Angular or Node.js.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life balance – flexible work timings, early out Fridays, various social and cultural activities.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "8+ Years",
            "ColdFusion",
            "CFML",
            "React.js"
        ],
        "summary": "Lead Full Stack ColdFusion role requiring 8+ years of experience with technical leadership. Focus on CFML, OOP, MVC frameworks, database tuning, and RESTful API development."
    },
    {
        "job_title": "UI/UX Developer",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21138/182",
        "location": "Infopark",
        "closing_date": "06 Dec 2025",
        "job_description": "<h2>UI/UX Developer</h2>\n<p>We are seeking a talented and creative Front-End Developer to join our team. In this role, you will be responsible for translating user requirements into engaging, intuitive user interfaces. You’ll work closely with both design and development teams to deliver seamless, user-focused digital experiences.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Collaborate closely with designers and developers to understand project scope and objectives.</li>\n<li>Develop user interfaces for web applications and mobile-responsive platforms.</li>\n<li>Implement responsive design principles to ensure accessibility across different screen sizes and devices.</li>\n<li>Write clean, efficient, and maintainable code using HTML, CSS (SASS/Less), and JavaScript.</li>\n<li>Conduct thorough testing to ensure high performance and reliability of interfaces.</li>\n<li>Stay updated on industry trends and best practices in UI/UX design and front-end development.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Strong proficiency in HTML, CSS, JavaScript, and styling frameworks like Bootstrap or Tailwind CSS.</li>\n<li>5–7 years of hands-on experience in front-end development focused on UI/UX.</li>\n<li>Strong understanding of key design principles and responsive design concepts.</li>\n<li>Knowledgeable about web performance and optimization.</li>\n<li>Understanding of web accessibility standards (WCAG) to design user interfaces.</li>\n<li>Proven experience as a UI Developer or in a similar role.</li>\n<li>Experience with UI/UX design principles and tools is a plus.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Ability to work collaboratively in a team environment.</li>\n</ul>\n<h3>Added Advantage (Nice to Have):</h3>\n<ul>\n<li>Hands-on with WordPress or Shopify themes? That’s a plus.</li>\n<li>Know your way around Vue, Nuxt, or anything in the Vue ecosystem? Even better.</li>\n<li>Bonus points if you’ve worked with REST APIs, touched TypeScript, or used Material UI in your projects.</li>\n</ul>\n<p>If you're passionate about building clean, user-friendly interfaces and want to work in a team that values good design, attention to detail, and smart front-end development, we’d love to hear from you.</p>\n<p>Send us your resume and portfolio at 👉 hr@2hatslogic.com with subject line \"UI/UX Developer\"</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@2hatslogic.com</p>",
        "tags": [
            "5-7 Years",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "summary": "Seeking a Front-End Developer to create intuitive user interfaces for web and mobile. Requires 5-7 years of experience in UI/UX development with strong HTML, CSS, and JavaScript skills."
    },
    {
        "job_title": "Junior C++ Developer",
        "company": "Neork Technologies",
        "url": "https://infopark.in/company-jobs/details/21134/494",
        "location": "Infopark",
        "closing_date": "10 Dec 2025",
        "job_description": "<h2>Junior C++ Developer</h2>\n<p><strong>Job Summary:</strong></p>\n<p>We are looking for a C++ Developer with strong programming skills and working knowledge of Python and Linux. The candidate should have 2 years of relevant development experience and be capable of building efficient, high-performance applications.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, enhance, and maintain applications using C++.</li>\n<li>Write automation scripts or supporting tools using Python.</li>\n<li>Work in a Linux-based environment for development, debugging, and deployment.</li>\n<li>Optimize code for performance, scalability, and reliability.</li>\n<li>Troubleshoot, debug, and resolve software defects.</li>\n<li>Collaborate with cross-functional teams to deliver high-quality software.</li>\n<li>Maintain documentation and follow coding standards.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong proficiency in C++ (C++11/14/17 preferred).</li>\n<li>Good working knowledge of Python for scripting or tool development.</li>\n<li>Experience with Linux OS, Ubuntu Touch, shell commands, and development tools.</li>\n<li>Experience with Git or other version control systems.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@neork.com</p>",
        "tags": [
            "2 Years",
            "C++",
            "Python",
            "Linux"
        ],
        "summary": "Seeking a C++ Developer with 2 years of experience in building high-performance applications using C++, Python, and Linux. Responsibilities include development, scripting, and debugging."
    },
    {
        "job_title": "Augmented Reality (AR)/Virtual Reality (VR) Developer",
        "company": "Neork Technologies",
        "url": "https://infopark.in/company-jobs/details/21135/494",
        "location": "Infopark",
        "closing_date": "10 Dec 2025",
        "job_description": "<h2>Augmented Reality (AR)/Virtual Reality (VR) Developer</h2>\n<p>We are seeking an AR/VR Developer with primary experience in AR and additional exposure to VR, possessing 2–3 years of relevant experience. The candidate will be responsible for developing interactive and immersive AR/VR applications using Unity or Unreal Engine.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and optimize AR applications (ARCore, ARKit, Vuforia, etc.).</li>\n<li>Support VR experience development for platforms like Oculus or HTC Vive.</li>\n<li>Build 3D interactions, UI/UX elements, and animations.</li>\n<li>Collaborate with designers and artists on immersive features.</li>\n<li>Test, debug, and document application components.</li>\n</ul>\n<h3>Required Skills:</h3>\n<ul>\n<li>Strong AR development experience (primary).</li>\n<li>Basic to intermediate VR development experience.</li>\n<li>Proficiency in Unity or Unreal Engine.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@neork.com</p>",
        "tags": [
            "2-3 Years",
            "AR/VR Development",
            "Unity",
            "Unreal Engine"
        ],
        "summary": "AR/VR Developer with 2-3 years of experience sought to create immersive AR/VR applications. Responsibilities include development, optimization, and collaboration."
    },
    {
        "job_title": "Junior Spring Boot Developer",
        "company": "Neork Technologies",
        "url": "https://infopark.in/company-jobs/details/21132/494",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Junior Spring Boot Developer</h2>\n<p>We are seeking a Junior Spring Boot Developer with 1 to 2 years of hands-on experience in Spring Boot.</p>\n<h3>About the Role:</h3>\n<p>The ideal candidate should have experience in developing and maintaining web applications using the Spring Boot framework. Success in this position will involve collaborating with cross-functional teams to design, develop, and deploy high-quality software solutions that meet business requirements. As a key member of our development team, you must be fluent in Java and grasp the various components of the Spring Boot system, and when to apply them.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Designing and developing RESTful APIs using Spring Boot.</li>\n<li>Implementing complex business logic and data processing workflows within Spring Boot applications.</li>\n<li>Integrating Spring Boot applications with various databases, third-party APIs, and external services.</li>\n<li>Writing clean, efficient, and maintainable code following coding standards and object-oriented designs.</li>\n<li>Conducting unit testing, integration testing, and performance testing to ensure the quality and reliability of software deliverables.</li>\n<li>Participating in code reviews, architectural discussions, and technical brainstorming sessions.</li>\n<li>Troubleshooting and debugging application issues, identifying root causes, and implementing effective solutions.</li>\n<li>Documenting technical designs, system architecture, and implementation details.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Minimum 1 year of experience in Spring Framework and Spring Boot development.</li>\n<li>Proficiency in designing and implementing RESTful APIs.</li>\n<li>Strong knowledge of database systems such as MySQL.</li>\n<li>Experience with version control systems (e.g., Git), and CI/CD pipelines.</li>\n<li>Familiarity with cloud platforms (e.g., AWS, Azure) and containerization technologies (e.g., Docker, Kubernetes) is a plus.</li>\n<li>Excellent problem-solving skills, attention to detail, and a proactive mindset.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@neork.com</p>",
        "tags": [
            "1-2 Years",
            "Spring Boot",
            "Java",
            "RESTful APIs"
        ],
        "summary": "Seeking a Junior Spring Boot Developer with 1-2 years of experience. Responsibilities include designing and developing RESTful APIs, integrating applications, and writing clean code."
    },
    {
        "job_title": "Full Stack Developer - Python+ReactJS - Immediate Joiner (Experience: 2-3 years)",
        "company": "SayOne Technologies Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21131/129",
        "location": "Infopark",
        "closing_date": "20 Dec 2025",
        "job_description": "<h2>Full Stack Developer - Python+ReactJS - Immediate Joiner</h2>\n<p><strong>Experience Level:</strong> 2-3 Years\n<strong>Location:</strong> Kochi (Work from office)</p>\n<h3>Job Overview</h3>\n<p>We are looking for a skilled and motivated Fullstack Developer with 2+ years of experience to join our dynamic, AI-driven engineering team in Kochi. The ideal candidate should have strong backend development expertise using frameworks such as Django, Flask, or FastAPI, and frontend tools like ReactJs, NextJs along with hands-on experience in tools like Cursor, Augment, or Windsurf. You will be working on building scalable APIs, integrating AI models, and orchestrating workflows using frameworks like Langchain or Crew AI, all while delivering secure and high-performance applications.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Develop and maintain Python applications</strong></li>\n<li>Write clean, scalable, and maintainable code for backend services, data pipelines, and AI-integrated solutions.</li>\n<li><strong>Build scalable APIs and services</strong></li>\n<li>Design RESTful APIs using Django, Flask, or FastAPI for web and mobile apps.</li>\n<li><strong>Build responsive frontends</strong></li>\n<li>Use React.js or Next.js.</li>\n<li><strong>Integrate with AI/LLM systems</strong></li>\n<li>Implement LLM workflows, RAG pipelines, and agent orchestration with Langchain, Crew AI, or similar frameworks.</li>\n<li><strong>Collaborate with cross-functional teams</strong></li>\n<li>Work closely with front-end developers, DevOps, and data scientists to deliver end-to-end features.</li>\n<li><strong>Integrate APIs and web frameworks</strong></li>\n<li>Develop server-side logic and third-party API integrations to enhance functionality.</li>\n<li><strong>Debug, optimize, and secure applications</strong></li>\n<li>Identify bugs, improve performance, and apply security best practices.</li>\n<li><strong>Use modern developer tools</strong></li>\n<li>Leverage developer productivity tools such as Cursor, Augment, or Windsurf.</li>\n<li><strong>Manage environments and dependencies</strong></li>\n<li>Use UV for efficient Python packaging.</li>\n<li><strong>Maintain high code quality</strong></li>\n<li>Apply formatting and linting tools like black, ruff, and flake8.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>2+ years of hands-on experience in backend and frontend development.</li>\n<li>Proficiency in backend frameworks: Django, Flask, or FastAPI.</li>\n<li>Experience with ORMs: SQLAlchemy or Django ORM.</li>\n<li>Good with ReactJs.</li>\n<li>Familiarity with developer tools: Cursor, Augment, Windsurf.</li>\n<li>Experience with Poetry, UV, and virtual environments.</li>\n<li>Understanding of backend security best practices.</li>\n<li>Proficient in code quality tools: black, ruff, flake8.</li>\n<li>Experience with LLMs, RAG pipelines, Langchain, Crew AI, or AutoGen.</li>\n<li>Strong understanding of API design, authentication (OAuth/JWT), and performance tuning.</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Experience with Docker and CI/CD pipelines.</li>\n<li>Exposure to cloud platforms: AWS, GCP, or Azure.</li>\n<li>Familiarity with task queues (Celery, RQ) and async programming.</li>\n<li>Experience building developer platforms, SDKs, or internal tools.</li>\n<li>Contributions to open-source or personal AI projects.</li>\n</ul>\n<p><strong>Contact:</strong> If interested, feel free to apply here or forward your profile to careers@sayonetech.com. If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@sayonetech.com.</p>",
        "tags": [
            "2-3 Years",
            "Python",
            "ReactJS",
            "Langchain"
        ],
        "summary": "Full Stack Developer with 2-3 years of experience in Python (Django/Flask/FastAPI) and ReactJS. Build scalable APIs, integrate AI models using Langchain, and work in Kochi."
    },
    {
        "job_title": "Business Analyst",
        "company": "Neork Technologies",
        "url": "https://infopark.in/company-jobs/details/21136/494",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Business Analyst</h2>\n<h3>Roles &amp; Responsibilities:</h3>\n<ul>\n<li><strong>Requirement Elicitation:</strong> Lead workshops and interviews with clients, product owners, and domain experts to elicit, analyze, and capture complex business requirements for our HIS/ERP modules.</li>\n<li><strong>Process Modeling (BPMN):</strong> Develop and maintain detailed BPMN 2.0 diagrams to meticulously map current-state ('as-is') and future-state ('to-be') business processes, including all exception paths and business rules.</li>\n<li><strong>System Modeling (UML):</strong> Create comprehensive UML diagrams (e.g., Use Case, Activity, and State Machine diagrams) to formally model system behavior, user interactions, and complex state transitions.</li>\n<li><strong>Agile Authoring:</strong> Author clear, concise, and unambiguous User Stories and define precise, testable Acceptance Criteria for each one. Your ACs must be detailed enough to cover all business rules, scenarios, and edge cases.</li>\n<li><strong>Verification &amp; Validation:</strong> Facilitate formal review sessions with the original business stakeholders, walking them through your BPMN, UML, and User Stories to gain explicit sign-off and confirm that your documentation perfectly represents their requirements.</li>\n<li><strong>Handoff &amp; Support:</strong> Act as the primary requirements liaison for the Solution Architect and development teams. You will present the verified documentation, clarify all functional queries, and ensure a perfect, shared understanding before implementation begins.</li>\n</ul>\n<h3>Qualifications &amp; Expertise:</h3>\n<ul>\n<li><strong>Experience:</strong> 3-5+ years of proven experience as a Business Analyst in an enterprise software environment (ERP, HIS, finance, or similar complex domains) [Year of experience is negotiable if you are confident in the above-mentioned skills].</li>\n<li><strong>BPMN Expertise:</strong> Expert-level proficiency in BPMN 2.0. Must be able to model complex, multi-level business processes, including all gateways, events, and exception paths, in a clear and standardized way.</li>\n<li><strong>UML Expertise:</strong> Expert-level proficiency in UML. Must demonstrate mastery of creating and interpreting Use Case, Activity, and State Machine diagrams. Familiarity with Class and Sequence diagrams is a significant asset.</li>\n<li><strong>Agile Mastery:</strong> Demonstrable, expert-level skill in authoring effective User Stories and Acceptance Criteria. You must have a strong portfolio of examples showcasing your ability to capture complex logic.</li>\n<li><strong>Analytical Rigor:</strong> Meticulous, obsessive attention to detail is non-negotiable. You must possess exceptional analytical skills and a passion for finding and resolving ambiguity.</li>\n<li><strong>Communication:</strong> Superior facilitation and communication skills, with the proven ability to lead workshops, manage stakeholder expectations, and gain consensus.</li>\n</ul>\n<h3>Contact Information:</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@neork.com</p>",
        "tags": [
            "3-5+ Years",
            "BPMN",
            "UML",
            "Agile"
        ],
        "summary": "Seeking an experienced Business Analyst proficient in BPMN, UML, and Agile methodologies. Responsibilities include requirement elicitation, process/system modeling, and stakeholder communication."
    },
    {
        "job_title": "Solution Architect",
        "company": "Neork Technologies",
        "url": "https://infopark.in/company-jobs/details/21137/494",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Solution Architect</h2>\n<h3>Roles &amp; Responsibilities</h3>\n<ol>\n<li><strong>Architectural Accountability</strong>: Take complete ownership of the high-level design for all new features and services, particularly for complex modules (E.g. Electronic Medical Records (EMR), Revenue Cycle Management (RCM), Material Resource Planning (MRP), Stock Management, and Accounts.</li>\n<li><strong>Design &amp; Enforcement</strong>: Champion, mentor, and enforce the use of modern software design principles. You will be the final authority on ensuring DDD, Design Patterns, SOLID, and Clean Architecture are practically implemented in our codebase.</li>\n<li><strong>Technical Translation</strong>: Analyze complex business requirements from the hospital domain and translate them into detailed solution designs, component models, and a clear technical roadmap.</li>\n<li><strong>Technology Governance</strong>: Collaborate closely with developers, project managers, and business analysts to ensure the architectural vision is implemented correctly using our core tech stack: Flutter (using VIPER Architecture), Spring Boot, JPA, and Hibernate.</li>\n<li><strong>Database Design</strong>: Design and govern the evolution of scalable, high-performance data models for our Oracle and PostgreSQL database environments.</li>\n<li><strong>Guidance &amp; Review</strong>: Provide decisive technical leadership and guidance to development teams. Conduct rigorous design and code reviews to ensure all code adheres to the established architectural standards.</li>\n</ol>\n<h3>Professional &amp; Technical Skills</h3>\n<h4>Must-Have Qualifications:</h4>\n<ol>\n<li><strong>Experience</strong>: 5+ years of proven experience in a solution architecture, technical lead, or senior engineering role within an enterprise software environment (ERP, HIS, or similar complex domains). (Year of experience is negotiable if you are confident in the above-mentioned skills).</li>\n<li><strong>Architectural Mastery (Theoretical)</strong>: Expert-level mastery of software architecture patterns, with specific, deep knowledge of Domain-Driven Design (DDD), GoF Design patterns, SOLID principles, and Clean Architecture.</li>\n</ol>\n<h4>Architectural Mastery (Practical):</h4>\n<ol>\n<li>Demonstrable, hands-on expertise in applying Object-Oriented Design (OOD) and SOLID principles to build maintainable software.</li>\n<li>Proven ability to use Design Patterns (e.g., Strategy, State, Specification, Factory) as a primary tool to replace complex, procedural, and deeply nested conditional logic (if/else branching, or Switch cases).</li>\n<li><strong>Tech Stack Proficiency</strong>: Strong, hands-on command of the Java ecosystem, particularly Spring Boot for application development and JPA/Hibernate for data persistence.</li>\n<li><strong>Database Expertise</strong>: Deep knowledge of relational database (RDBMS) design, optimization, and performance tuning, specifically with PostgreSQL and Oracle.</li>\n<li><strong>Leadership</strong>: Proven experience in making and enforcing high-stakes technical decisions and mentoring development teams in advanced concepts.</li>\n</ol>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@neork.com</p>",
        "tags": [
            "5+ Years",
            "Spring Boot",
            "DDD",
            "Oracle"
        ],
        "summary": "Solution Architect needed for high-level design and technical leadership. Responsibilities include translating business needs into technical roadmaps and enforcing architectural standards."
    },
    {
        "job_title": "Embedded hardware Engineer",
        "company": "Lanware Solutions",
        "url": "https://infopark.in/company-jobs/details/21142/211",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Embedded Hardware Engineer</h2>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>Microcontroller Design &amp; Bring-Up</strong>\n- Select and integrate MCUs/SoCs (Cortex-M/A, ESP32, STM32, NXP i.MX, Raspberry Pi).\n- Define pin-muxing, boot modes, and power sequencing.\n- Lead board bring-up and initial firmware flashing (UART/JTAG/SWD).</p>\n<p><strong>Circuit Design</strong>\n- Convert product requirements into analog/digital/mixed-signal schematics.\n- Select components considering power, SI, thermal, cost, and lifecycle.</p>\n<p><strong>PCB Layout</strong>\n- Execute 2–8-layer PCB layouts with controlled impedance.\n- Apply DFM/DFA/DFT and IPC standards.</p>\n<p><strong>Prototyping &amp; Validation</strong>\n- Prepare fabrication/assembly packages and BOMs.\n- Coordinate prototype builds (in-house/EMS).\n- Conduct functional, SI, thermal, and environmental testing.</p>\n<p><strong>Compliance &amp; Certification</strong>\n- Implement EMI/EMC mitigation.\n- Support CE/FCC/IEC/UL and relevant RF certifications.</p>\n<p><strong>Documentation &amp; Release</strong>\n- Maintain all design artifacts in PLM.\n- Prepare design reviews, test reports, and release documents.</p>\n<p><strong>Cross-Functional Collaboration</strong>\n- Work with firmware, mechanical, and manufacturing teams for quick issue resolution.</p>\n<h2>Must-Have Qualifications</h2>\n<p><strong>Education:</strong> B.E./B.Tech/Diploma in Electronics/Electrical or related field.</p>\n<p><strong>Experience:</strong> 4–5 years; delivered at least two MCU-based products to mass production.</p>\n<p><strong>Technical Skills:</strong>\n- Strong MCU/SoC architecture knowledge.\n- Proficient in Altium/KiCad/Allegro.\n- High-speed interfaces (DDR, USB 3.x, GbE), mixed-signal, and power design.\n- Hands-on with scopes, logic analyzers, JTAG/SWD, spectrum analyzers.\n- EMI/EMC workflows; knowledge of IPC-2221/2222 and DFM/DFA.</p>\n<p><strong>Soft Skills:</strong>\n- Analytical thinking, strong ownership, clear communication, ability to mentor.\n- Comfortable with fast-paced, iterative development.</p>\n<h2>Nice-to-Have</h2>\n<ul>\n<li>RF/antenna design (Wi-Fi, BLE, LoRa).</li>\n<li>Functional safety/automotive exposure.</li>\n<li>Familiarity with PLM tools (Arena, Windchill) and Git/SVN.</li>\n<li>Experience with production test fixtures or ATE scripts.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@lanwaresolutions.com</p>",
        "tags": [
            "4-5 Years",
            "MCU/SoC Design",
            "Altium",
            "EMI/EMC"
        ],
        "summary": "Seeking an Embedded Hardware Engineer with 4-5 years of experience in MCU-based product development. Responsibilities include circuit design, PCB layout, and validation for mass production."
    },
    {
        "job_title": "DevOps Engineer",
        "company": "TouchWorld Technology",
        "url": "https://infopark.in/company-jobs/details/21139/352",
        "location": "Infopark",
        "closing_date": "22 Jul 2026",
        "job_description": "<h2>DevOps Engineer</h2>\n<p>A proactive and detail-oriented DevOps Engineer with 5 years of hands-on experience in cloud infrastructure automation, container orchestration, and CI/CD implementation. Strong practical knowledge of Linux environments, cloud-native technologies, and network security. Adept at leveraging tools like Jenkins, Ansible, and Docker to streamline deployment workflows and ensure system reliability.</p>\n<h3>Key Skills &amp; Experience:</h3>\n<ul>\n<li><strong>Kubernetes (EKS):</strong> Experience deploying, managing, and troubleshooting applications on AWS Elastic Kubernetes Service (EKS). Familiar with Helm, autoscaling, and monitoring within Kubernetes environments.</li>\n<li><strong>Docker:</strong> Proficient in creating, managing, and optimizing Docker containers. Skilled in writing custom Dockerfiles and troubleshooting container issues.</li>\n<li><strong>Linux &amp; Shell Scripting:</strong> Strong expertise in Linux system administration and daily usage of shell commands for automation, monitoring, and system diagnostics.</li>\n<li><strong>Network Security:</strong> Hands-on experience in configuring and managing security groups, firewalls, IAM policies, and ensuring secure communication between services in AWS and Kubernetes environments.</li>\n<li><strong>Ansible:</strong> Experience in writing and executing playbooks for configuration management and automated provisioning of infrastructure.</li>\n<li><strong>Jenkins:</strong> Skilled in designing and managing Jenkins pipelines for CI/CD workflows, integrating with Git, Docker, and AWS services.</li>\n<li><strong>AWS Cloud:</strong><ul>\n<li>EKS: Core competency in managing containerized workloads.</li>\n<li>EC2 &amp; S3: Provisioning, securing, and managing compute and storage resources.</li>\n<li>Security Groups &amp; IAM: Implementing secure access policies and managing service-to-service communication.</li>\n<li>Lambda: Working knowledge of setting up serverless functions for event-driven automation.</li>\n</ul>\n</li>\n</ul>\n<h3>Mandatory Hands-On Experience:</h3>\n<ul>\n<li>Linux systems and advanced shell command usage</li>\n<li>Jenkins pipeline configuration and maintenance</li>\n<li>AWS services including EKS, EC2, S3, and Security Groups</li>\n<li>Network security concepts and practical enforcement</li>\n</ul>\n<p>A quick learner and effective problem solver, passionate about automation, scalability, and secure DevOps practices.</p>\n<h3>Location:</h3>\n<ul>\n<li>ON-SITE</li>\n<li>KOCHI-INFOPARK</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>IMMEDIATE JOINER</li>\n<li>Experience Required: Min 5 years</li>\n</ul>\n<h3>Contact:</h3>\n<p>SEND YOUR RESUME TO: hrteam@touchworldtechnology.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hrteam@touchworldtechnology.com.</p>",
        "tags": [
            "5+ Years",
            "AWS",
            "Kubernetes",
            "CI/CD"
        ],
        "summary": "Seeking a DevOps Engineer with 5+ years experience in cloud automation, container orchestration, and CI/CD. Must have strong Linux, Kubernetes (EKS), Docker, and AWS skills. On-site role in Kochi."
    },
    {
        "job_title": "Senior Database Engineer (Microsoft SQL Server)",
        "company": "Devicedriven India (P) Ltd",
        "url": "https://technopark.org/job-details/25347",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>Senior Database Engineer (Microsoft SQL Server)</h2>\n<p><strong>Company:</strong> DeviceDriven India (P) Ltd\n<strong>Location:</strong> Padmanabha, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> http://www.devicedriven.com\n<strong>Closing Date:</strong> 22, Dec 2025\n<strong>Job Published:</strong> 22, Nov 2025\n<strong>Contact Email:</strong> jobs@devicedriven.com</p>\n<h3>About the Opportunity</h3>\n<p>You will work on a digital transformation program modernizing a global-scale transaction and engagement platform. The platform handles millions of real-time, high-volume operations across multiple regions and partner ecosystems. We are looking for a Senior SQL Server Database Engineer who can take ownership of database performance, reliability, architecture, and operational excellence for a mission-critical, highly transactional platform running on Microsoft SQL Server in a cloud environment.</p>\n<h3>Role Overview</h3>\n<p>In this senior role, you will be the primary SQL Server expert responsible for:\n- Designing and optimizing database schemas\n- Ensuring high availability and operational resilience\n- Performance tuning for large-scale transactional workloads\n- Managing upgrades, patching, and maintenance\n- Supporting engineering teams during feature development and releases\n- Ensuring data integrity, recoverability, and system reliability</p>\n<p>You will work closely with application engineering, DevOps, and architecture teams to ensure the platform’s data layer is fast, scalable, secure, and predictable.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li>\n<p><strong>Database Architecture &amp; Design</strong></p>\n<ul>\n<li>Design, model, and optimize SQL Server schemas for high-throughput transactional systems</li>\n<li>Define best practices for indexing, normalization, partitioning, and query design</li>\n<li>Review and guide schema evolution and data modeling decisions with engineering teams</li>\n</ul>\n</li>\n<li>\n<p><strong>Performance, Tuning &amp; Optimization</strong></p>\n<ul>\n<li>Diagnose and resolve performance bottlenecks: blocking, deadlocks, concurrency issues, slow queries</li>\n<li>Optimize execution plans, indexing strategies, statistics, and resource configuration</li>\n<li>Conduct regular health assessments and create remediation plans</li>\n</ul>\n</li>\n<li>\n<p><strong>High Availability &amp; Disaster Recovery</strong></p>\n<ul>\n<li>Design, configure, and maintain AlwaysOn Availability Groups, clustering, log shipping, replication, and other HA/DR mechanisms</li>\n<li>Own backup, restore, and failover processes, including regular testing and validation</li>\n<li>Ensure data consistency, integrity, and uptime across multiple environments</li>\n</ul>\n</li>\n<li>\n<p><strong>Operations, Monitoring &amp; Reliability</strong></p>\n<ul>\n<li>Monitor SQL Server performance using DMVs, PerfMon, Extended Events, Query Store, and profiling tools</li>\n<li>Establish alerting and automated monitoring for query performance, storage, replication, and job failures</li>\n<li>Own routine maintenance: index management, statistics updates, patching, upgrades</li>\n</ul>\n</li>\n<li>\n<p><strong>Cloud &amp; Platform Integration (GCP Environment)</strong></p>\n<ul>\n<li>Manage SQL Server deployments and operations within a GCP-hosted environment</li>\n<li>Collaborate with DevOps and infrastructure teams on provisioning, scaling, security, and observability</li>\n<li>Integrate DB operations into CI/CD and release processes (migrations, pre-flight checks, rollback strategies)</li>\n</ul>\n</li>\n<li>\n<p><strong>Security, Access &amp; Compliance Alignment</strong></p>\n<ul>\n<li>Implement secure authentication, authorization, role management, and least-privilege access</li>\n<li>Maintain auditing, logging, and compliance-aligned configuration for sensitive financial data</li>\n<li>Ensure encryption, retention, and governance policies are enforced</li>\n</ul>\n</li>\n<li>\n<p><strong>Data Integration, Reporting &amp; Migration</strong></p>\n<ul>\n<li>Support ETL, reporting, and analytical workloads via SSIS/SSRS or equivalent tools</li>\n<li>Lead structured data migration efforts between environments or SQL Server versions</li>\n<li>Work with engineering teams to expose reliable, efficient data interfaces</li>\n</ul>\n</li>\n</ol>\n<h3>Required Skills &amp; Qualifications</h3>\n<p><strong>Technical Expertise</strong>\n*   7–12+ years in Database Engineering / SQL Server Administration\n*   Strong hands-on expertise in:\n    *   Microsoft SQL Server (advanced configuration, tuning, internals)\n    *   AlwaysOn, clustering, replication, log shipping\n    *   Performance tuning and query optimization\n    *   Backup/restore, DR planning, failover testing\n    *   SQL Profiler, Extended Events, DMVs, Query Store\n*   Experience supporting high-volume OLTP systems\n*   Experience operating SQL Server in cloud environments (GCP preferred; AWS/Azure acceptable)\n*   Strong understanding of concurrency, locking, transactions, isolation levels, and recovery models</p>\n<p><strong>Nice-to-Have</strong>\n*   SSIS / SSRS / ETL experience\n*   Experience with Looker, data warehousing, or analytical pipelines\n*   Experience with container-based or microservices ecosystems\n*   Fintech or regulated environment experience\n*   Exposure to automation via scripting (PowerShell, Python, Bash)</p>\n<p><strong>Soft Skills</strong>\n*   Strong ownership and accountability\n*   Excellent problem-solving and analytical abilities\n*   Clear communication and ability to work with cross-functional teams\n*   Calm under pressure and experienced with production incident handling\n*   Strong documentation discipline</p>\n<h3>Why Join DeviceDriven</h3>\n<ul>\n<li>Work on a global, high-volume platform with real engineering complexity</li>\n<li>Take full ownership of the database layer in a modern cloud environment</li>\n<li>Collaborate with senior architects, backend, DevOps, and AI engineering teams</li>\n<li>Opportunity to evolve into Database Architect or Platform Data Engineering Lead roles</li>\n<li>Culture of technical excellence, autonomy, and innovation</li>\n</ul>\n<h3>How to Apply</h3>\n<ul>\n<li>Send your resume, GitHub/LinkedIn profile, and a short introduction to: jobs@devicedriven.com</li>\n</ul>",
        "tags": [
            "7-12+ Years",
            "Microsoft SQL Server",
            "GCP",
            "High Availability"
        ],
        "summary": "Seeking a Senior SQL Server Database Engineer for a global platform modernization. Responsibilities include database performance, reliability, architecture, and operational excellence in a cloud environment."
    },
    {
        "job_title": "Flutter Mobile App Developer",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25346",
        "location": "Technopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Flutter Mobile App Developer</h2>\n<p><strong>Company:</strong> Globcom Solutions (P) Ltd\n<strong>Location:</strong> Technopark, Thiruvananthapuram\n<strong>Contact Email:</strong> rajesh@globcomsolution.com\n<strong>Website:</strong> http://www.globcomsolution.com\n<strong>Job Published:</strong> 22, Nov 2025\n<strong>Closing Date:</strong> 15, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Globcom Solutions (P) Ltd is seeking an experienced Flutter Mobile App Developer with 3 to 5 years of professional experience. The ideal candidate will have hands-on expertise in developing advanced mobile applications for Android and iOS platforms, with a strong preference for prior experience in building photo and video editing applications (similar to Canva). You should possess strong skills in implementing image and video editing features using Flutter packages, and be able to design and build feature-rich, high-performance, and scalable applications. Collaboration with cross-functional teams and delivery of polished apps with seamless user experiences are key aspects of this role.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design and develop mobile applications using Flutter for both Android and iOS platforms.</li>\n<li>Implement advanced photo and video editing features, including layers, cropping, filters, text overlay, stickers, and shapes.</li>\n<li>Work with Flutter image editing packages (e.g., <code>image</code>, <code>photofilters</code>, <code>flutter_image_editor</code>, <code>extended_image</code>).</li>\n<li>Ensure efficient image rendering, compression, and optimization for mobile performance.</li>\n<li>Integrate custom brushes, drawing tools, and color pickers for creative editing functionality.</li>\n<li>Develop and enhance video editing features using libraries such as <code>video_player</code>, <code>ffmpeg_kit_flutter</code>, <code>flutter_ffmpeg</code>, and <code>chewie</code>.</li>\n<li>Implement video trimming, merging, transitions, filters, audio synchronization, and speed control.</li>\n<li>Collaborate with designers and backend developers to deliver intuitive, user-friendly apps.</li>\n<li>Ensure application quality, responsiveness, and performance across devices.</li>\n<li>Stay updated with the latest Flutter updates, libraries, and best practices.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>3 to 5 years of professional experience in Flutter mobile app development.</li>\n<li>Strong knowledge of Android and iOS app development with Flutter.</li>\n<li>Proven experience in building photo and video editing applications is highly preferred.</li>\n<li>Expertise with Flutter packages for image editing and video processing.</li>\n<li>Deep understanding of UI/UX for creative editing apps.</li>\n<li>Experience with image rendering, compression, optimization, and performance tuning.</li>\n<li>Knowledge of video editing workflows including trimming, merging, transitions, and audio sync.</li>\n<li>Familiarity with REST APIs, third-party integrations, and version control (Git).</li>\n<li>Strong problem-solving skills, creativity, and attention to detail.</li>\n<li><strong>Bonus:</strong> Knowledge of AI-based editing features, AR/VR integration, or custom creative tools.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume to rajesh@globcomsolution.com</p>",
        "tags": [
            "3-5 Years",
            "Flutter",
            "Image Editing",
            "Video Editing"
        ],
        "summary": "Experienced Flutter Developer (3-5 years) for advanced Android/iOS apps. Must have photo/video editing app development experience similar to Canva."
    },
    {
        "job_title": "Team Lead - ColdFusion",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/25345",
        "location": "Technopark",
        "closing_date": "02 Dec 2025",
        "job_description": "<h2>Tech Lead - ColdFusion</h2>\n<p><strong>Company:</strong> Techversant Infotech (P) Ltd\n<strong>Location:</strong> Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\n<strong>Website:</strong> http://www.techversantinfotech.com\n<strong>Contact Email:</strong> careers@techversantinfotech.com\n<strong>Published Date:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 02 Dec 2025</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a global technology services and solutions company with over 17 years of experience, providing high-quality end-to-end IT solutions. We focus on Digital Transformation, understanding evolving industrial scenarios, investment priorities, and technology disruption. Our expertise spans multiple domains including ColdFusion, Python, Java, .NET, Node JS, Ruby on Rails, Golang, PHP, Artificial Intelligence, Blockchain, iOS, Android, Flutter, React Native, Angular, and Vue, catering to various industry verticals worldwide.</p>\n<h3>About the Role:</h3>\n<p>We are seeking an experienced Senior Full Stack ColdFusion Lead with 8+ years of experience, possessing proven technical leadership and mentorship capabilities. The ideal candidate will have mastery of CFML, OOP, robust MVC frameworks (ColdBox, FW/1), advanced database tuning, and RESTful API development. Success requires exceptional diagnostic skills and architectural oversight for high-performance enterprise applications. Experience with migration (Adobe to Lucee), React.js, and CI/CD practices is considered desirable.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead the architecture, design, and development of enterprise-grade, high-performance web applications using ColdFusion and Lucee, integrating modern frontend technologies like React.js.</li>\n<li>Drive initiatives to migrate legacy Adobe ColdFusion applications to the Lucee platform, ensuring seamless transition, compatibility, and performance optimization.</li>\n<li>Guide, mentor, and coach a team of developers, performing rigorous code reviews and enforcing best practices and coding standards.</li>\n<li>Collaborate closely with business analysts and stakeholders to gather complex requirements, define technical specifications, and manage project lifecycles.</li>\n<li>Oversee performance optimization for existing applications and new feature development, focusing on scalability, security, and reliability.</li>\n<li>Develop and integrate backend systems with frontend interfaces and third-party services using RESTful APIs, SOAP web services, JSON, and XML data formats.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>8+ years of extensive experience in Full Stack ColdFusion development, including proven technical leadership or team management roles.</li>\n<li><strong>Primary Skills:</strong> Deep expertise in CFML, CFCs, SQL, and related web technologies (HTML5, CSS3, JavaScript, jQuery).</li>\n<li>Advanced experience in architecting, designing, and leading the development of highly scalable and complex enterprise-level applications, applying Object-Oriented Programming (OOP) principles and robust MVC frameworks (e.g., ColdBox, FW/1).</li>\n<li>Mastery in hands-on development, optimization, and maintenance of critical web applications using CFML, including deep proficiency in database performance tuning, complex SQL query optimization, and schema design for relational databases (Oracle, SQL Server, MySQL).</li>\n<li>Extensive experience in designing, developing, and consuming complex RESTful APIs and SOAP web services using JSON and XML data formats.</li>\n<li>Proven experience in migrating legacy ColdFusion applications to modern platforms, including migration from Adobe ColdFusion to Lucee server environments.</li>\n<li>Strong capability in modern frontend development using HTML5, CSS3, JavaScript, jQuery, and Ajax. Experience with modern JavaScript frameworks, specifically React.js, is required.</li>\n<li>Expert knowledge of code version control tools like Git or SVN.</li>\n<li>Experience in driving and implementing modern development practices, including CI/CD pipelines, automated testing, and DevOps principles.</li>\n<li>Exceptional diagnostic and troubleshooting skills for highly complex, mission-critical issues in production environments.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n<li>A proactive attitude towards learning, evaluating, and adapting to new technologies and industry trends.</li>\n</ul>\n<h3>Nice to Have:</h3>\n<ul>\n<li>Familiarity with Agile or Scrum methodologies.</li>\n<li>Familiarity with project management tools like JIRA.</li>\n<li>Knowledge of other modern web technologies (Angular, Node.js).</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule with weekends off.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long-term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs.</li>\n<li>Bonus programs for training, certifications, and innovation.</li>\n<li>Work-life balance: flexible work timings, early out Fridays, social and cultural activities.</li>\n<li>Company sponsored international tours.</li>\n</ul>",
        "tags": [
            "8+ Years",
            "ColdFusion",
            "CFML",
            "React.js"
        ],
        "summary": "Lead ColdFusion developer needed with 8+ years of experience in CFML, OOP, and MVC frameworks. Responsibilities include architecture, migration, and team mentorship."
    },
    {
        "job_title": "Associate - CEO's Office",
        "company": "Toonz Animation India (P) Ltd",
        "url": "https://technopark.org/job-details/25344",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Associate - CEO's Office</h2>\n<p><strong>Company:</strong> Toonz Animation India (P) Ltd\n<strong>Location:</strong> Technopark Campus, Trivandrum, Kerala, India\n<strong>Contact:</strong> hr@toonzanimationindia.com\n<strong>Website:</strong> http://www.toonz.co\n<strong>Closing Date:</strong> December 31, 2025\n<strong>Job Published:</strong> November 21, 2025</p>\n<h3>Position Overview</h3>\n<p>This role provides high-level strategic, operational, and administrative support to the management team in a fast-paced animation production environment. The individual will function as an extension of the Management Office—coordinating across Production, Creative, HR, Administration, MIS, Finance, Accounts and Client Teams. Key responsibilities include tracking production deliverables, consolidating reports, preparing dashboards, reviewing project performance, and ensuring smooth communication across departments to support timely decision-making.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>1. Management Support &amp; Coordination</strong>\n- Assist management with day-to-day priorities, production reviews, and project decision-making.\n- Coordinate with Department Heads / Production to collect updates on tasks, shot status, and pipeline challenges.\n- Manage management calendars, review schedules, client calls, and internal reviews.\n- Represent management in internal meetings, production checkpoints, and external client discussions when needed.</p>\n<p><strong>2. Meeting &amp; Communication Management</strong>\n- Prepare agendas, minutes, and action trackers for production meetings, leadership reviews, and cross-team syncs.\n- Ensure alignment between departments before and after meetings.\n- Draft internal updates, weekly summaries, production notes, and strategic communications on behalf of management.</p>\n<p><strong>3. Data, Analytics &amp; Reporting</strong>\n- Prepare production dashboards, shot delivery reports, resource utilization summaries, and monthly MIS.\n- Analyse data to identify bottlenecks, delivery risks, cost overruns, or productivity gaps.\n- Consolidate inputs from production tracking tools into clear management-ready insights.\n- Provide data-driven recommendations to improve pipeline efficiency and project output quality.</p>\n<p><strong>4. Project &amp; Deliverable Tracking</strong>\n- Track progress of key shows, episodes, assets, and deliveries in coordination with production teams.\n- Flag deviations from production schedules, budgets, or quality checkpoints to management.\n- Maintain a central task management system capturing all management priorities, deadlines, and follow-ups.</p>\n<p><strong>5. Stakeholder Management</strong>\n- Serve as the single point of coordination between management and internal teams.\n- Support communication with external clients, partners, and vendors, ensuring timely responses and professional conduct.\n- Maintain confidentiality and foster strong, smooth relationships across stakeholders.</p>\n<p><strong>6. People &amp; Studio Operations Support</strong>\n- Coordinate with team leads to address production bottlenecks, staffing needs, or workflow constraints.\n- Assist management with team evaluations, resource planning, hiring projections, and performance review inputs.\n- Support company-wide events such as production reviews, festivals, project kick-offs, leadership summits, and HR initiatives.</p>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Business Administration, Management, Media, Animation Production, or related fields.</li>\n<li>3–8 years of experience in senior leadership support, production coordination, PMO, or business operations—ideally within animation, VFX, gaming, or media.</li>\n<li>Experience in a Management Office, Production Office, Strategy, or Executive Assistant role is highly preferred.</li>\n</ul>\n<h3>Preferred Skills &amp; Competencies</h3>\n<ul>\n<li>Strong understanding of animation production workflows is a major advantage.</li>\n<li>Excellent analytical skills with the ability to interpret production data and reports.</li>\n<li>Proficiency in Excel, PowerPoint, and familiarity with production tools.</li>\n<li>Strong communication, documentation, and interpersonal abilities.</li>\n<li>Exceptional organizational skills and the ability to manage multiple moving parts under tight deadlines.</li>\n<li>High levels of ownership, discretion, professionalism, and problem-solving capability.</li>\n<li>Ability to influence teams and drive follow-ups without formal authority.</li>\n</ul>",
        "tags": [
            "3-8 Years",
            "Animation Production",
            "Production Coordination",
            "Data Analysis"
        ],
        "summary": "Provides strategic and operational support to management in animation production. Coordinates departments, tracks deliverables, and analyzes data for timely decision-making."
    },
    {
        "job_title": "Senior Engineer – Automation (Contract)",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/25343",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Senior Engineer – Automation (Contract)</h2>\n<p><strong>Company:</strong> Fakeeh Technologies (P) Ltd</p>\n<p><strong>Location:</strong> Carnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581</p>\n<p><strong>Contact:</strong> careers@fakeeh.tech</p>\n<p><strong>Closing Date:</strong> December 31, 2025</p>\n<p><strong>Job Published:</strong> November 21, 2025</p>\n<h3>Job Overview:</h3>\n<p>Fakeeh Technologies is seeking a skilled and detail-oriented Senior Engineer – Automation Testing to design, develop, and maintain robust automation frameworks for web and enterprise applications. The ideal candidate will possess strong hands-on experience with Playwright and Selenium (Java), a deep understanding of testing frameworks, automation best practices, and CI/CD integration. This role demands end-to-end automation ownership, encompassing framework creation, execution, analysis, and continuous improvement. Experience in the healthcare domain or with hospital information systems (HIS/EMR/EHR) is considered a significant advantage.</p>\n<h3>Core Responsibilities:</h3>\n<ul>\n<li>Design and implement end-to-end automation frameworks using Playwright and Selenium (Java/TestNG/JUnit).</li>\n<li>Analyze requirements, identify automation scope, and select appropriate tools and techniques.</li>\n<li>Develop and maintain modular, reusable, and scalable test automation scripts and libraries.</li>\n<li>Integrate automation suites with CI/CD pipelines (e.g., Jenkins, Git, Azure DevOps) for continuous testing.</li>\n<li>Execute and maintain automated test suites across multiple browsers and environments.</li>\n<li>Collaborate with QA, Development, and DevOps teams to ensure seamless automation coverage in sprints.</li>\n<li>Implement data-driven, keyword-driven, and hybrid automation frameworks as needed.</li>\n<li>Debug and fix test automation issues, ensuring the stability and maintainability of test scripts.</li>\n<li>Prepare and review automation test plans, execution reports, and defect tracking summaries.</li>\n<li>Participate in peer code reviews to ensure best practices in design and code quality.</li>\n<li>Contribute to the implementation of QMS/PMS processes within QA automation practices.</li>\n<li>Perform cross-browser and parallel testing, ensuring compatibility and reliability.</li>\n<li>Contribute to test estimation, planning, and reporting activities.</li>\n<li>Identify automation gaps, propose enhancements, and drive process improvement initiatives.</li>\n</ul>\n<h3>Must-Have Skills and Experience:</h3>\n<ul>\n<li>5+ years of experience in software test automation, with proven expertise in Playwright and Selenium with Java.</li>\n<li>Strong experience in framework design and development (data-driven, hybrid, or keyword-driven).</li>\n<li>Proficient in Java, TestNG/JUnit, Maven/Gradle, and automation best practices.</li>\n<li>Strong knowledge of UI automation concepts, element locators, waits, synchronization, and error handling.</li>\n<li>Familiar with API testing using Postman, REST Assured, or similar tools.</li>\n<li>Experience with CI/CD pipelines (Jenkins, GitLab CI, Azure DevOps) for automated execution and reporting.</li>\n<li>Solid understanding of SDLC, STLC, and Agile/Scrum QA processes.</li>\n<li>Ability to troubleshoot complex automation issues and optimize execution time.</li>\n<li>Exposure to cross-browser and parallel test execution (e.g., using Selenium Grid or Playwright’s parallel mode).</li>\n<li>Strong analytical and problem-solving skills with attention to detail.</li>\n<li>Excellent communication and collaboration skills in cross-functional environments.</li>\n</ul>\n<h3>Desirable Skills (Good to Have):</h3>\n<ul>\n<li>Experience in healthcare or hospital information systems (HIS, EMR, EHR).</li>\n<li>Exposure to SQL/Oracle databases for backend validation.</li>\n<li>Understanding of performance or API automation techniques.</li>\n<li>ISTQB or equivalent QA certification.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Playwright",
            "Selenium",
            "Java"
        ],
        "summary": "Seeking a Senior Engineer – Automation Testing with 5+ years of experience in Playwright and Selenium (Java). This role involves designing, developing, and maintaining automation frameworks and CI/CD integration."
    },
    {
        "job_title": "QA Team Lead/Project Lead",
        "company": "Fakeeh Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/25342",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>QA Team Lead/Project Lead</h2>\n<p><strong>Company:</strong> Fakeeh Technologies (P) Ltd\n<strong>Location:</strong> Carnival Building, 13th Floor, Technopark Campus, Karyavattom, Trivandrum, 695581\n<strong>Contact Email:</strong> careers@fakeeh.tech\n<strong>Closing Date:</strong> December 31, 2025\n<strong>Job Published:</strong> November 21, 2025</p>\n<h3>Job Overview</h3>\n<p>Fakeeh Technologies is seeking an experienced and proactive QA Team Lead to spearhead quality assurance across multiple projects. This role requires a solid understanding of QA best practices, Agile methodologies, and practical experience in both manual and automation testing. The position demands a blend of individual contribution, cross-team collaboration, and the agility to adapt to evolving requirements. Prior experience in the healthcare domain or with hospital applications is highly advantageous.</p>\n<h3>Core Responsibilities</h3>\n<ul>\n<li>Lead and manage QA activities for diverse projects and domains.</li>\n<li>Provide hands-on testing support for critical or fast-paced projects.</li>\n<li>Establish and enforce organizational QA standards, processes, and best practices.</li>\n<li>Collaborate with cross-functional teams to gather requirements and ensure comprehensive test coverage.</li>\n<li>Plan, estimate, and track QA efforts throughout sprints and releases.</li>\n<li>Actively participate in Agile/Scrum ceremonies (sprint planning, stand-ups, retrospectives).</li>\n<li>Independently create, execute, and review manual and automated test cases.</li>\n<li>Mentor and support team members, assisting with blockers and technical challenges.</li>\n<li>Oversee defect tracking, risk management, and issue resolution with development teams.</li>\n<li>Prepare and present test reports, metrics, and quality dashboards to stakeholders.</li>\n<li>Maintain test assets and deliverables within test management tools.</li>\n<li>Ensure adherence to organizational QA policies and healthcare regulatory standards.</li>\n</ul>\n<h3>Must-Have Skills and Experience</h3>\n<ul>\n<li>6+ years of QA experience, with at least 2 years in a leadership capacity.</li>\n<li>Deep understanding of QA methodologies, test strategy, test planning, and defect management.</li>\n<li>Proven ability to work effectively both independently and as part of a team.</li>\n<li>Skill in writing clear, reusable test cases and scenarios.</li>\n<li>Proficiency in Agile/Scrum methodologies and related tools/practices.</li>\n<li>Hands-on experience with test management and defect tracking tools (e.g., JIRA, Quality Center/ALM, TestRail).</li>\n<li>Experience promoting and leading QA performance improvement initiatives (process optimization, tool adoption, test effectiveness).</li>\n<li>Solid grasp of test estimation techniques, risk-based testing, and test planning.</li>\n<li>Experience reviewing test cases and automation scripts, ensuring best practices.</li>\n<li>Strong communication skills, with experience coordinating across QA, development, and business teams.</li>\n<li>Demonstrated ability to lead and mentor QA teams.</li>\n<li>Experience as an individual contributor in test design and execution (manual and/or automation).</li>\n</ul>\n<h3>Desirable Skills (Good to Have)</h3>\n<ul>\n<li>Experience in the healthcare domain, particularly with HIS, EMR/EHR, or clinical systems.</li>\n<li>Familiarity with healthcare compliance standards.</li>\n<li>Experience with test automation tools like Selenium WebDriver (Java/TestNG), UFT/QTP, or TestComplete.</li>\n<li>Knowledge of API testing (e.g., Postman) and SQL for backend testing.</li>\n<li>Experience with CI/CD pipelines, Jenkins, and version control tools (e.g., Git).</li>\n<li>ISTQB or equivalent QA certification.</li>\n</ul>",
        "tags": [
            "6+ Years",
            "Agile",
            "Test Automation",
            "Healthcare Domain"
        ],
        "summary": "Experienced QA Team Lead wanted for multiple projects. Requires strong QA, Agile, manual/automation testing skills, and leadership. Healthcare experience is a plus."
    },
    {
        "job_title": "Video Editing & Content Creator Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/25341",
        "location": "Technopark",
        "closing_date": "06 Dec 2025",
        "job_description": "<h2>Video Editing &amp; Content Creator Trainee</h2>\n<p><strong>Company:</strong> ZenturioTech (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala (Technopark)\n<strong>Contact:</strong> admin@zenturiotech.com\n<strong>Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 06, Dec 2025</p>\n<h3>Role Overview</h3>\n<p>The Video Editing &amp; Content Creator Trainee will assist in creating engaging digital content for social media and marketing campaigns. The role involves editing videos, designing short-form content, supporting brand storytelling and collaborating with the marketing team to enhance online presence.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Edit short-form and long-form videos for social media platforms (Instagram, YouTube, LinkedIn, etc.).</li>\n<li>Assist in planning, shooting and developing creative content ideas.</li>\n<li>Create basic graphics, thumbnails, reels and promotional content.</li>\n<li>Collaborate with marketing teams to align content with brand goals.</li>\n<li>Ensure timely delivery of high-quality content.</li>\n<li>Stay updated with trends in video editing, social media and content creation.</li>\n<li>Organize raw footage, maintain media libraries and support post-production tasks.</li>\n</ul>\n<h3>Qualifications &amp; Skills</h3>\n<ul>\n<li>Basic knowledge of video editing software (Adobe Premiere Pro, Filmora, CapCut, Final Cut Pro, etc.).</li>\n<li>Creative mindset with an eye for storytelling and design.</li>\n<li>Familiarity with social media trends and content formats.</li>\n<li>Strong communication and time-management skills.</li>\n<li>Ability to brainstorm and execute fresh content ideas.</li>\n<li>Photography or graphic design skills are a plus.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Hands-on experience in content creation and video editing.</li>\n<li>Opportunity to build a professional creative portfolio.</li>\n<li>Mentorship from marketing and creative teams.</li>\n<li>Exposure to real brand campaigns and digital strategy.</li>\n<li>Possibility of full-time conversion based on performance.</li>\n</ul>\n<p><strong>Contact Email:</strong> admin@zenturiotech.com</p>",
        "tags": [
            "0-1 Years",
            "Video Editing",
            "Content Creation",
            "Social Media"
        ],
        "summary": "Trainee edits videos and creates digital content for social media and marketing. Assists in planning, shooting, and graphic design to enhance online presence."
    },
    {
        "job_title": "Business Development Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/25340",
        "location": "Technopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Business Development Trainee at ZenturioTech (P) Ltd</h2>\n<p><strong>Location:</strong> Trivandrum\n<strong>Company:</strong> ZenturioTech (P) Ltd\n<strong>Address:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala , 695581\n<strong>Website:</strong> https://zenturiotech.com\n<strong>Contact Email:</strong> admin@zenturio.com\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 08 Dec 2025</p>\n<h3>Role Overview</h3>\n<p>The Business Development Trainee will support the company’s growth through lead generation, market research, sales activities and client engagement. This role requires strong communication skills, an interest in sales &amp; marketing, and the ability to build and maintain customer relationships. The trainee will work closely with cross-functional teams to contribute to revenue growth and business expansion.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Generate and qualify leads through calls, emails and outreach.</li>\n<li>Support sales activities, including product demos, presentations and meeting sales targets.</li>\n<li>Assist in basic marketing tasks such as campaigns, content support and market research.</li>\n<li>Prepare proposals, presentations and business pitches.</li>\n<li>Maintain client relationships and follow up on inquiries.</li>\n<li>Track competitor activities and industry trends.</li>\n<li>Update CRM, prepare sales reports and support internal coordination.</li>\n</ul>\n<h3>Qualifications &amp; Skills</h3>\n<ul>\n<li>Bachelor’s degree (completed or pursuing) in Business, Marketing, Management or related field.</li>\n<li>Strong communication, negotiation and interpersonal skills.</li>\n<li>Basic understanding of sales cycle, marketing concepts and customer engagement.</li>\n<li>Proficiency in MS Office (Excel, PowerPoint, Word).</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Analytical mindset with good problem-solving skills.</li>\n<li>Quick learner with a strong passion for sales and business development.</li>\n<li>Prior internship/project experience in sales, marketing or customer-facing roles is an advantage.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Hands-on experience in sales, marketing and business development.</li>\n<li>Mentorship from experienced sales and business leaders.</li>\n<li>Exposure to client interactions and real market environments.</li>\n<li>Opportunity to build strong professional networks.</li>\n<li>Potential for full-time placement and career growth based on performance.</li>\n</ul>\n<p><strong>Contact Email:</strong> admin@zenturiotech.com</p>",
        "tags": [
            "0-2 Years",
            "Business Development",
            "Sales",
            "Marketing"
        ],
        "summary": "Seeking a Business Development Trainee in Trivandrum to support growth through lead generation and sales activities. Role requires strong communication skills and interest in sales & marketing."
    },
    {
        "job_title": "Frontend Developer ( Contract 1+ yrs)",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/25339",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>Frontend Developer (Contract)</h2>\n<p><strong>Company:</strong> Cloud Nautical Solutions India Pvt Ltd\n<strong>Location:</strong> Module No.K12, 2nd Floor, Kabani Building, Technocity, Phase 4, Technopark, Trivandrum, Kerala, India, 695317\n<strong>Website:</strong> https://www.cloudnautical.com</p>\n<p><strong>Contract Duration:</strong> 1 Year (with possibility of extension)\n<strong>Closing Date:</strong> 21, Dec 2025\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Contact Email:</strong> careers@cloudnautical.com</p>\n<h3>Job Description</h3>\n<p>Cloud Nautical Solutions is seeking a skilled Frontend Developer for a contract position. The ideal candidate will have over 3 years of experience in building sophisticated web applications.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop and maintain complex web applications.</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Ensure the technical feasibility of UI/UX designs.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Write clean, maintainable, and efficient code.</li>\n<li>Participate in code reviews and contribute to team best practices.</li>\n<li>Work within an Agile development environment.</li>\n</ul>\n<h3>Required Skills:</h3>\n<ul>\n<li><strong>Experience:</strong> 3+ years in frontend development.</li>\n<li><strong>Core Technologies:</strong> Strong proficiency in ReactJS, Typescript, HTML5, Tailwind CSS.</li>\n<li><strong>State Management &amp; Form Handling:</strong> Experience with Zustand, React Hook Form, Zod/Yup.</li>\n<li><strong>Version Control:</strong> Experience with Git.</li>\n<li><strong>Methodologies:</strong> Familiarity with Agile development methodologies.</li>\n<li><strong>Web Fundamentals:</strong> In-depth knowledge of JavaScript, CSS, HTML, and other front-end languages.</li>\n<li><strong>UI/UX:</strong> Experience with user interface design principles.</li>\n<li><strong>Project Management:</strong> Good project management skills.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Complete understanding of ReactJS and its core principles.</li>\n<li>Expert knowledge of JavaScript, CSS, HTML, and related web technologies.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "ReactJS",
            "Typescript",
            "Tailwind CSS"
        ],
        "summary": "Frontend Developer needed for 3+ years contract role. Must have strong skills in ReactJS, Typescript, and building complex web applications."
    },
    {
        "job_title": ".Net Developer",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/25337",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>.Net Developer</h2>\n<p><strong>Company:</strong> Cloud Nautical Solutions India Pvt Ltd</p>\n<p><strong>Location:</strong> Technopark Phase 4, Trivandrum, Kerala, India</p>\n<p><strong>Contact Email:</strong> careers@cloudnautical.com</p>\n<p><strong>Job Published:</strong> 21, Nov 2025</p>\n<p><strong>Closing Date:</strong> 21 Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Cloud Nautical Solutions is seeking .NET Developers on a contract basis with at least 3+ years of hands-on experience delivering commercial solutions using the .NET technology stack. This is a contract role with a duration of 1+ years.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Deliver commercial solutions using .NET technology stack.</li>\n<li>Develop RESTful API Services using C# and .NET Core.</li>\n<li>Write SQL queries and stored procedures.</li>\n<li>Apply object-oriented programming (OOP) and SOLID principles.</li>\n<li>Utilize front-end web technologies such as HTML, CSS, and JavaScript.</li>\n<li>Work with version control systems (e.g., Git).</li>\n<li>Implement CI/CD Pipelines.</li>\n<li>Develop cloud applications in AWS or Azure.</li>\n<li>Collaborate in an Agile (Scrum) environment.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's Degree in Computer Science, or a related field.</li>\n<li>Proven experience in developing RESTful API Services using C# and .NET Core.</li>\n<li>Strong experience in writing SQL queries and stored procedures.</li>\n<li>Solid understanding of object-oriented programming (OOP) and SOLID principles.</li>\n<li>Proficiency in front-end web technologies such as HTML, CSS, and JavaScript.</li>\n<li>Familiarity with version control systems (e.g., Git) and CI/CD Pipelines.</li>\n<li>Knowledge of Cloud Application Development in AWS or Azure.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Excellent communication and teamwork abilities.</li>\n<li>Agile (Scrum) experience.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in developing applications using Microservice Architecture.</li>\n<li>Experience in VB.Net</li>\n</ul>\n<p><strong>Company Address:</strong>\nModule No.K12, 2nd Floor, Kabani Building, Technocity, Phase 4 Technopark, Trivandrum, Kerala, India, 695317</p>\n<p><strong>Company Website:</strong> https://www.cloudnautical.com</p>",
        "tags": [
            "3+ Years",
            ".NET Core",
            "RESTful API",
            "SQL"
        ],
        "summary": "Seeking .NET Developers with 3+ years of experience for a 1+ year contract. Must have strong C#, .NET Core, API, and SQL skills for commercial solutions."
    },
    {
        "job_title": "SEO Specialist",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/25336",
        "location": "Technopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>SEO Specialist at Prayan Animation Studio (P) Ltd</h2>\n<p><strong>Location:</strong> E-12, Tejaswini-1, Technopark, Trivandrum, Kerala, India, 695 581</p>\n<p><strong>Website:</strong> http://www.prayananimation.com</p>\n<p><strong>Contact:</strong> jobs@prayananimation.com</p>\n<p><strong>Closing Date:</strong> November 30, 2025</p>\n<p><strong>Job Published:</strong> November 21, 2025</p>\n<h3>Brief Description</h3>\n<p>Prayan Animation Studio is seeking a results-driven SEO Specialist with a minimum of 2.5 years of dedicated, hands-on experience in Search Engine Optimization. The ideal candidate will possess deep technical and content SEO knowledge, with a proven track record of improving search engine rankings, driving organic traffic, and enhancing on-site performance. This role focuses solely on SEO and does not include general digital marketing responsibilities.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct keyword research and competitor analysis to uncover SEO opportunities.</li>\n<li>Implement on-page SEO: Meta tags, headers, internal links, image optimization, and content alignment.</li>\n<li>Perform technical SEO audits and resolve issues related to crawlability, indexing, and site speed.</li>\n<li>Work with developers to apply SEO best practices in website code.</li>\n<li>Track SEO performance using tools like Google Analytics, Search Console, Ahrefs, or SEMrush.</li>\n<li>Optimize content and provide SEO guidance for new pages.</li>\n<li>Stay updated with SEO trends and algorithm changes.</li>\n<li>Develop and execute white-hat link-building strategies.</li>\n<li>Monitor key SEO metrics including organic traffic, rankings, CTR, and bounce rate.</li>\n</ul>\n<h3>Required Skills and Qualifications</h3>\n<ul>\n<li>2+ years of exclusive SEO experience (not combined with general digital marketing).</li>\n<li>Experience with SEO tools such as Google Search Console, Google Analytics, Ahrefs, SEMrush, Screaming Frog, Moz, etc.</li>\n<li>Hands-on experience with CMS platforms like WordPress, Shopify, or others.</li>\n<li>Familiarity with HTML, CMS platforms (especially WordPress), and Google Ads.</li>\n<li>Excellent analytical, communication, and project management skills.</li>\n<li>Experience in the animation or creative industry is a plus.</li>\n</ul>\n<p><strong>Job Type:</strong> Full-time</p>\n<p><strong>Pay:</strong> Based on experience</p>\n<p><strong>Schedule:</strong> Day shift</p>\n<p><strong>Location Requirement:</strong> Ability to commute or relocate to Trivandrum, Kerala.</p>\n<p><strong>Expected Start Date:</strong> As soon as possible.</p>\n<h3>How to Apply?</h3>\n<p>To apply, please submit your resume and a link to your online portfolio highlighting your best work to jobs@prayananimation.com. Please use \"Resume – SEO Specialist\" as the subject line of your email.</p>\n<h3>Interview Preparation</h3>\n<p>Conduct a thorough study of Prayan Animation Pvt. Ltd., focusing on the company's background, mission, and core values. Gain a clear understanding of the services offered, recent projects, and their positioning in the animation industry. This will help tailor your responses and demonstrate genuine interest during the interview.</p>",
        "tags": [
            "2+ Years",
            "SEO",
            "Google Analytics",
            "SEMrush"
        ],
        "summary": "Seeking an SEO Specialist with 2.5+ years of exclusive SEO experience to improve rankings and organic traffic. Role requires technical and content SEO expertise, using various SEO tools."
    },
    {
        "job_title": "Senior Full Stack Developer",
        "company": "Magpii Innovations Private Limited",
        "url": "https://technopark.org/job-details/25335",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Senior Full Stack Developer</h2>\n<p><strong>Company:</strong> Magpii Innovations Private Limited\n<strong>Location:</strong> 2nd FLOOR, M SQUARED BUILDING, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA - 695581\n<strong>Website:</strong> http://www.magpiitech.com\n<strong>Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 31, Dec 2025\n<strong>Contact Email:</strong> careers@magpiitech.com</p>\n<h3>Brief Description</h3>\n<p>At Magpii Innovations Pvt Ltd, we specialize in delivering high-impact engineering solutions that drive progress and innovation across a range of industries. From pioneering advances in Aerospace and Electric Vehicles to optimizing Industrial Automation and Artificial Intelligence, we bring precision, expertise, and a forward-thinking approach to every project. We are looking for a passionate and dedicated Senior Full Stack Engineer to join our growing team.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, test, and deploy high-quality, scalable, and secure web applications using a variety of technologies.</li>\n<li>Contribute to both front-end (React/Angular) and back-end (ASP.NET Core, Java Spring Boot, Python) development.</li>\n<li>Collaborate with product managers, designers, and other engineers to understand requirements and translate them into technical solutions.</li>\n<li>Implement and maintain CI/CD pipelines to ensure efficient and automated deployments.</li>\n<li>Work with containerization technologies (Docker) and orchestration platforms (Kubernetes) to build and deploy microservices.</li>\n<li>Utilize cloud services (Azure, AWS) for infrastructure, deployment, and scaling of applications.</li>\n<li>Participate in code reviews, promote best practices, and mentor junior engineers (if applicable).</li>\n<li>Troubleshoot and debug production issues, ensuring application stability and performance.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>3 to 8 years of professional experience.</li>\n<li>Degree in B.Tech/M.Tech/MCA in Computer Science Engineering.</li>\n<li><strong>Backend:</strong> Asp .Net Core, Java Spring Boot, Flask, FastAPI.</li>\n<li><strong>Frontend:</strong> React.js, Redux/Context API, and modern JavaScript (ES6+) or Angular.</li>\n<li><strong>Containers:</strong> Knowledge in Docker and Kubernetes.</li>\n<li><strong>Cloud Platform:</strong> Hands-on experience with at least one major cloud provider: Microsoft Azure or Amazon Web Services (AWS).</li>\n<li><strong>Database Knowledge:</strong> Experience with relational databases (e.g., SQL Server, PostgreSQL, MySQL) and/or NoSQL databases (e.g., MongoDB, Cosmos DB).</li>\n<li>Strong programming fundamentals and logical reasoning.</li>\n<li>Experience working with RESTful APIs and third-party integrations.</li>\n<li>Familiarity with version control tools like Git.</li>\n<li>Ability to write unit tests and perform code reviews.</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Exposure to Python frameworks and libraries.</li>\n<li>Experience with Node.js.</li>\n<li>Understanding of DevOps tools and CI/CD pipelines.</li>\n<li>Agile/Scrum methodology experience.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>If your profile matches our requirement, please share your resume to careers@magpiitech.com. Please include the job title along with your email application.</p>",
        "tags": [
            "3-8 Years",
            "ASP.NET Core",
            "React.js",
            "AWS"
        ],
        "summary": "Seeking a Senior Full Stack Engineer with 3-8 years of experience in web application development. Responsibilities include front-end and back-end development, cloud deployment, and CI/CD."
    },
    {
        "job_title": "Business Development Executive/Telecaller",
        "company": "Honeykode Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/25334",
        "location": "Technopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>Business Development Executive/Telecaller Walk-In</h2>\n<p><strong>Company:</strong> HONEYKODE TECHNOLOGIES (P) Ltd\n<strong>Website:</strong> http://www.honeykode.com\n<strong>Location:</strong> Technopark Campus, Phase 1, 6th Floor, Bhavani Building, Trivandrum.</p>\n<h3>Walk-In Details:</h3>\n<ul>\n<li><strong>Dates:</strong> November 24, 2025 - November 25, 2025</li>\n<li><strong>Time:</strong> 11:00 AM - 4:30 PM</li>\n<li><strong>Job Published:</strong> November 21, 2025</li>\n</ul>\n<h3>Brief Description:</h3>\n<p><strong>Minimum Qualifications:</strong> High School / +2 / Diploma / Graduate</p>\n<p><strong>Experience:</strong> 1–2 years in telecalling, telesales, or business development.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Make outbound calls to prospective clients and promote company products/services.</li>\n<li>Understand customer needs and requirements to offer suitable solutions.</li>\n<li>Maintain a database of leads and contacts using CRM tools.</li>\n<li>Follow up on leads generated through various marketing campaigns.</li>\n<li>Achieve daily, weekly, and monthly targets.</li>\n<li>Schedule meetings or product demos for the field sales team.</li>\n<li>Handle customer queries in a professional manner.</li>\n<li>Keep records of calls and customer responses.</li>\n<li>Build and maintain strong client relationships.</li>\n<li>Collaborate with the marketing and sales teams to drive conversions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Fluency in English and regional languages (as applicable).</li>\n<li>Ability to handle rejection and remain confident.</li>\n<li>Strong negotiation and persuasion skills.</li>\n<li>Basic computer knowledge and experience with CRM tools or Excel.</li>\n<li>Positive attitude and target-driven mindset.</li>\n</ul>\n<p><strong>Salary:</strong> ₹10,000 - ₹15,000</p>\n<p><strong>Work Location:</strong> Honeykode Technologies Pvt. Ltd, Technopark, Trivandrum.</p>\n<h3>Walk-In Venue:</h3>\n<p>Honeykode Technologies Pvt. Ltd,\nTechnopark Campus, Phase 1,\n6th Floor, Bhavani Building,\nTrivandrum.</p>\n<h3>Contact Information:</h3>\n<ul>\n<li><strong>Email:</strong> hr@honeykode.com</li>\n</ul>\n<h3>Walk-In Entry Pass Instructions:</h3>\n<p>Candidates are requested to apply for an entry pass to Technopark Campus via the mobile app or web browser. The entry pass will be sent to their registered mobile number/email ID. Show the softcopy of the entry pass on your gadget at the Technopark Entrance Gate. For candidates without a smartphone, print the hardcopy from self-operating kiosks near the TECHNOPARK Main Gate using the provided OTP. Original certificates will be verified at the Entry Gate.</p>\n<ul>\n<li><strong>Mobile App:</strong> <a href=\"link_to_android_app\">Click here to download the Mobile App for Android</a></li>\n<li><strong>Mobile App:</strong> <a href=\"link_to_ios_app\">Click here to download the Mobile App for iOS</a></li>\n<li><strong>Website URL:</strong> vms.technopark.org</li>\n<li><strong>User Manual:</strong> <a href=\"link_to_user_manual\">Click here for the User Manual</a></li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Telecalling",
            "Business Development",
            "CRM"
        ],
        "summary": "Seeking a Business Development Executive/Telecaller with 1-2 years of experience to promote products, manage leads, and achieve sales targets. Must have excellent communication skills and a target-driven mindset."
    },
    {
        "job_title": "React JS Developer",
        "company": "Storygame (P) Ltd",
        "url": "https://technopark.org/job-details/25333",
        "location": "Technopark",
        "closing_date": "14 Dec 2025",
        "job_description": "<h2>React JS Developer at Storygame (P) Ltd</h2>\n<p><strong>Company Overview:</strong>\nAt Storygame Private Limited, we develop innovative solutions to improve user experiences and solve real-world problems. We're looking for an experienced and passionate React.js Developer to join our team.</p>\n<p><strong>Job Description:</strong>\nWe are seeking a skilled React.js Developer with 3+ years of hands-on experience in front-end development. The ideal candidate will have a strong technical background, the ability to deliver high-quality code, and a passion for creating exceptional user experiences.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain complex web applications using React.js.</li>\n<li>Create reusable components and front-end libraries for future use.</li>\n<li>Translate designs and wireframes into high-quality, responsive code.</li>\n<li>Optimize components for maximum performance across a wide range of devices and browsers.</li>\n<li>Collaborate with cross-functional teams, including backend developers and designers, to integrate APIs and deliver seamless user experiences.</li>\n<li>Ensure technical feasibility of UI/UX designs and provide feedback for improvements.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Minimum 3 years of professional experience in front-end development.</li>\n<li>Strong proficiency in React.js, JavaScript (ES6+), HTML5, and CSS3.</li>\n<li>Hands-on experience with state management libraries (e.g., Redux, Zustand).</li>\n<li>Solid understanding of RESTful APIs and asynchronous programming.</li>\n<li>Strong problem-solving skills with a keen eye for detail.</li>\n<li>Good understanding of responsive design principles and cross-browser compatibility.</li>\n<li>Experience with debugging, performance optimization, and testing frameworks.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience with version control systems (e.g., Git, GitHub, GitLab).</li>\n<li>Knowledge of modern front-end build pipelines and tools (Webpack, Babel, etc.).</li>\n<li>Familiarity with TypeScript and modern JavaScript frameworks.</li>\n<li>Basic understanding of server-side rendering (Next.js) and static site generation.</li>\n<li>Experience with CI/CD pipelines and deployment workflows.</li>\n<li>Good communication skills and a collaborative mindset.</li>\n<li>Participate in code reviews, contribute to best practices, and mentor junior developers when required.</li>\n</ul>\n<p><strong>Contact Information:</strong>\nStorygame (P) Ltd\nGround floor, Tejaswini building, Technopark Phase 1\nKazakootam trivandrum kerala , 695581\nContact Email: hr@storygame.io\nWebsite: https://storygame.io</p>\n<p><strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 14, Dec 2025</p>",
        "tags": [
            "3+ Years",
            "React.js",
            "JavaScript",
            "HTML/CSS"
        ],
        "summary": "Storygame seeks an experienced React.js Developer with 3+ years of experience. Responsibilities include developing complex web apps, optimizing performance, and collaborating with teams."
    },
    {
        "job_title": "Customer Care Executive",
        "company": "G D Innovative Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25332",
        "location": "Technopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>Customer Care Executive</h2>\n<p><strong>Company:</strong> G D INNOVATIVE SOLUTIONS (P) Ltd\n<strong>Address:</strong> C-13, THEJASWINI BUILDING, TECHNOPARK CAMPUS, TRIVANDRUM, 695581\n<strong>Website:</strong> http://www.gdinnovativesolutions.com</p>\n<p><strong>Closing Date:</strong> 25, Nov 2025\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Contact Email:</strong> careers_247@gdinnovativesolutions.com</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Good verbal and written communication skills, with the ability to read, write, and comprehend the English language.</li>\n<li>Experience in direct interaction with clients via E-mail and Phone.</li>\n<li>Identify and assess client needs to achieve desired goals.</li>\n<li>Proven customer support &amp; Administrative skills.</li>\n<li>Ability to multi-task, prioritize, and manage time effectively.</li>\n<li>Good knowledge of MS Office, word processing, and transcription.</li>\n<li>Strong email etiquette and internet research skills.</li>\n<li>Provide accurate and complete information to clients by using the right tools.</li>\n<li>Shift Time: US Shift (Night Shift)</li>\n</ul>\n<p><strong>Note:</strong> We prefer candidates with experience in general administration and executive assistant for C-suite roles.</p>\n<h3>Preferred Qualifications &amp; Skills:</h3>\n<ul>\n<li>Any graduate degree.</li>\n<li>Experience: 1 year and above.</li>\n<li>Candidates with good command over English are required.</li>\n<li>Excellent interpersonal &amp; communication skills.</li>\n<li>Willingness to work in a night shift is mandatory.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Apply with your Recent CV, Last CTC, Expected CTC &amp; Notice period to the given contact email: careers_247@gdinnovativesolutions.com\n<strong>Important:</strong> Application without the job code <strong>GDS/201/324</strong> on the email subject will be rejected.</p>",
        "tags": [
            "1+ Years",
            "Customer Support",
            "Administration",
            "MS Office"
        ],
        "summary": "Seeking a Customer Care Executive with 1+ years of experience for a US Night Shift role. Requires strong communication, administrative, and MS Office skills. Apply with CV and details."
    },
    {
        "job_title": "L & D Coordinator",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25331",
        "location": "Technopark",
        "closing_date": "29 Nov 2025",
        "job_description": "<h2>L&amp;D Coordinator</h2>\n<p><strong>Company:</strong> TRENSER Technology Solutions (P) Ltd\n<strong>Location:</strong> Thejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.trenser.com\n<strong>Contact Email:</strong> careers@trenser.com\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 29, Nov 2025</p>\n<h3>Role Summary</h3>\n<p>The L&amp;D Coordinator will be responsible for supporting and executing learning initiatives across the organization. The role involves coordinating with delivery units to identify training needs, sourcing and managing courses, ensuring smooth delivery of learning programs, and maintaining key training records. The ideal candidate should have strong communication, stakeholder management, and organizational skills.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Coordinate with Delivery Units and business stakeholders to identify training needs and skill gaps.</li>\n<li>Plan, schedule, and organize internal and external training programs.</li>\n<li>Research, evaluate, and recommend relevant training programs, courses, and learning platforms.</li>\n<li>Liaise with vendors, trainers, and internal SMEs for content and session delivery.</li>\n<li>Manage end-to-end execution of training events including communication, logistics, attendance, and feedback.</li>\n<li>Maintain and update training calendars, training records, and LMS data.</li>\n<li>Track training effectiveness by collecting feedback and preparing reports.</li>\n<li>Support L&amp;D initiatives such as onboarding programs, competency development, leadership workshops, etc.</li>\n<li>Ensure alignment of training programs with organizational goals and capability development plans.</li>\n<li>Drive communication and engagement for learning initiatives through effective messaging and coordination.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in HR, Education, Business Administration, or related field.</li>\n<li>Experience in Learning &amp; Development coordination or a similar role.</li>\n<li>Strong communication (written and verbal) and interpersonal skills.</li>\n<li>Experience working with stakeholders across business units.</li>\n<li>Ability to manage multiple programs and deadlines efficiently.</li>\n<li>Familiarity with LMS platforms, online learning tools, and training methodologies.</li>\n<li>High level of attention to detail, ownership, and follow-through.</li>\n<li>Experience coordinating vendor-led or external training programs is an advantage.</li>\n<li>Proficiency in MS Office / Google Workspace.</li>\n</ul>\n<h3>Preferred Attributes</h3>\n<ul>\n<li>Analytical mindset for training evaluation and reporting.</li>\n<li>Strong organizational and project management skills.</li>\n<li>Passion for employee development and continuous learning.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Learning & Development",
            "LMS",
            "Stakeholder Management"
        ],
        "summary": "L&D Coordinator supports learning initiatives by identifying needs, managing programs, and maintaining records. Requires strong communication and organizational skills for successful execution."
    },
    {
        "job_title": "FIELD RELATIONSHIP EXECUTIVE (MALE CANDIDATES)",
        "company": "Hyz Ventures Intl (P) Ltd",
        "url": "https://technopark.org/job-details/25330",
        "location": "Technopark",
        "closing_date": "05 Dec 2025",
        "job_description": "<h2>Field Relationship Executive (Male Candidates)</h2>\n<p><strong>Company:</strong> HYZ VENTURES INTL (P) Ltd\n<strong>Address:</strong> GE, Ground Floor, Padmanabham, Technopark, Karyavattom P O, TVPM, 695581\n<strong>Website:</strong> http://www.hyzventures.com</p>\n<p><strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 05, Dec 2025</p>\n<p><strong>Contact Email:</strong> hr@hyzventures.com</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Deliver excellent customer service to our clients/Vendors.</li>\n<li>Oversee various operational processes and improve them.</li>\n<li>Bring in new clients for our organization while retaining the existing ones. You will act as the key point of contact for our clients.</li>\n<li>Conduct Product/Service demonstrations and presentations to prospective clients, negotiate contracts and finalize sales deals.</li>\n<li>Identifying new sales opportunities through cold calling, emailing and networking events and initiating contact with the right prospects.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Plus Two/Any degree.</li>\n<li>Minimum 0 - 1 years of prior experience in a related field.</li>\n<li>Problem-solving mindset with ownership of outcomes.</li>\n<li>Strong communication skills for coordination across teams.</li>\n<li>Proficiency in handling a tab.</li>\n<li>Eager to learn and adapt to new challenges.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates are requested to send their resumes to hr@hyzventures.com with the subject line: \"Field Relationship Executive\".</p>",
        "tags": [
            "0-1 Years",
            "Sales",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "Seeking a Field Relationship Executive to drive sales and retain clients. Responsibilities include customer service, process improvement, and client engagement."
    },
    {
        "job_title": "Solution Architect (Optimizely)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25329",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Solution Architect (Optimizely)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 12+ years of experience for this role.</p>\n<h3>Job Description</h3>\n<p>We are seeking an experienced Solution Architect to lead the design and implementation of a large-scale migration from SAP B2B to Optimizely Commerce Cloud. This role will serve as the technical leader, responsible for defining a scalable, secure, and future-ready architecture. The ideal candidate has deep expertise in enterprise commerce systems, cloud architecture, and system integrations. You will guide development teams, ensure best practices in solution design, and ultimately take full ownership of the architecture and development transition from the vendor.</p>\n<h4>Responsibilities:</h4>\n<p><strong>Architecture &amp; Design</strong>\n- Define the end-to-end migration architecture from SAP B2B to Optimizely, including CMS, Commerce, and PIM integration.\n- Design scalable, secure, and high-performance frameworks aligned with business goals.\n- Establish data migration strategies for products, pricing, and customer hierarchies.\n- Ensure API integration between SAP, Optimizely, and other enterprise systems.</p>\n<p><strong>Technical Leadership</strong>\n- Lead and mentor development teams on best practices and coding standards.\n- Collaborate with Optimizely consultants and internal teams to validate feasibility and technical approach.\n- Drive DevOps strategy for CI/CD pipelines, containerization, and cloud deployment.</p>\n<p><strong>Project Ownership</strong>\n- Act as the technical owner of the migration project, taking over from vendor after initial phases.\n- Ensure alignment with enterprise security and compliance standards.\n- Provide technical guidance during feasibility analysis and pilot module migration.</p>\n<p><strong>Collaboration &amp; Communication</strong>\n- Work closely with Business Analysts to translate requirements into technical solutions.\n- Communicate architecture decisions to stakeholders and leadership in business-friendly terms.\n- Support QA teams with test strategy for performance, integration, and security.</p>\n<h4>Preferred Skills:</h4>\n<p><strong>Primary Skills:</strong></p>\n<p><strong>Technical Expertise</strong>\n- SAP B2B Architecture: Deep understanding of SAP Commerce Cloud, Back Office, and integration patterns.\n- B2B Platform: Hands-on experience with CMS and Commerce Cloud platforms, specifically Optimizely.\n- Optimizely PIM &amp; Spire: Strong knowledge of Optimizely Product Information Management (PIM) and Spire framework for modern commerce experiences.\n- .NET Development: Proficient in .NET Core and ASP.NET, essential for Optimizely development.\n- Cloud Architecture: Strong knowledge of Azure PaaS, commonly used for hosting Optimizely solutions.\n- Azure Active Directory: Experience with identity and access management using Azure AD.\n- API Design &amp; Integration: Skilled in RESTful services, SAP APIs, and Optimizely endpoints.\n- Frontend Development: Strong React expertise with CMS integration experience.</p>\n<p><strong>Architectural Leadership</strong>\n- Modern Architecture Concepts: Experience with monolithic and microservices-based systems.\n- Solution Architecture Design: Ability to design scalable, secure, and maintainable frameworks.\n- System Integration: Expertise in bridging SAP and Optimizely platforms, including middleware and data flow strategies.\n- Performance &amp; Scalability: Planning for optimized performance and future growth.\n- Security &amp; Compliance: Knowledge of enterprise-grade security, data protection, and regulatory standards.</p>\n<p><strong>Project Ownership</strong>\n- End-to-End Leadership: Proven ability to lead projects from blueprint to execution.\n- Vendor Transition: Skilled in taking over architecture and development from external consultants.\n- Stakeholder Communication: Capable of translating technical decisions into business value for diverse audiences.</p>\n<p><strong>Secondary Skills:</strong></p>\n<p><strong>Technical Enhancements</strong>\n- GraphQL &amp; Headless CMS Architecture: Beneficial for building modern, flexible commerce experiences.\n- DevOps &amp; CI/CD Pipelines: Experience with tools like Azure DevOps or GitHub Actions for automated deployments.\n- Containerization: Familiarity with Docker and Kubernetes for scalable and efficient deployments.</p>\n<p><strong>Soft Skills:</strong></p>\n<p><strong>Team Mentoring &amp; Coaching:</strong> Experienced in guiding developers through complex migration phases and technical transitions.\n<strong>Agile Methodology:</strong> Skilled in managing sprints, backlogs, and iterative delivery cycles to ensure timely and quality outcomes.\n<strong>Analytical Thinking &amp; Problem-Solving:</strong> Strong capability in feasibility analysis, module mapping, and resolving architectural challenges.\n<strong>Continuous Learning Mindset:</strong> Proactively stays updated with evolving trends in SAP BTP, Optimizely, and cloud technologies.</p>\n<hr />",
        "tags": [
            "12+ Years",
            "Optimizely",
            "SAP B2B",
            ".NET"
        ],
        "summary": "Seeking an experienced Solution Architect for SAP B2B to Optimizely migration. Lead design, implementation, and technical ownership of a scalable, secure commerce cloud architecture."
    },
    {
        "job_title": "Cloud Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25328",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Cloud Infrastructure Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 8+ years of experience for this role.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain scalable cloud infrastructure solutions.</li>\n<li>Lead cloud adoption strategies, migration roadmaps, and workload assessments.</li>\n<li>Provide infrastructure expertise to design cloud-native and on-premise solution architectures.</li>\n<li>Architect infrastructure solutions for AI/ML platforms, including training, inference, pipelines, and GPU/TPU setups.</li>\n<li>Ensure infrastructure security, compliance, and adherence to industry best practices.</li>\n<li>Design and implement new capabilities that address gaps and provide an integrated, end-to-end, scalable service.</li>\n<li>Collaborate with external vendors, partners, and stakeholders to ensure successful integration and implementation of infrastructure solutions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Minimum 8 years of experience in the design, implementation, and maintenance of infrastructure solutions.</li>\n<li>Experience in at least 5 projects involving enterprise-level cloud architecture and implementation.</li>\n<li>Proven expertise in designing and implementing large-scale microservices architectures, distributed systems, and integration architectures.</li>\n<li>Hands-on experience in large-scale cloud migration projects.</li>\n<li>Experience in setting up infrastructure for ML workloads, including training, inference, and GPU/TPU provisioning.</li>\n<li>Solid experience in data center operations, including the implementation and support of private and hybrid cloud environments.</li>\n<li>Strong experience with VMware technologies such as vSphere, ESXi, and vCenter.</li>\n<li>Hands-on expertise in infrastructure domains including networking, authentication, compute, and storage.</li>\n<li>Experience in responding to RFPs, preparing solution designs, and performing estimations and costing.</li>\n<li>Strong knowledge of Docker and Kubernetes, with hands-on experience deploying ML workloads.</li>\n<li>Proficient in Infrastructure as Code (IaC) using tools such as Ansible, Terraform, ARM Templates, and CloudFormation.</li>\n<li>Good understanding of SQL and NoSQL databases.</li>\n<li>Deep expertise in DevOps practices, containerization, and CI/CD pipelines.</li>\n<li>Experience with monitoring tools such as Nagios, Splunk, New Relic, or Prometheus.</li>\n<li>Experience working on projects with compliance requirements such as GDPR, PCI DSS, and HIPAA.</li>\n<li>Strong technical knowledge of cloud technologies and virtualization platforms (e.g., VMware, Hyper-V, Cisco, Microsoft, EMC, AWS).</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Experience with infrastructure services such as LDAP, DNS, DHCP, and Active Directory.</li>\n<li>Excellent communication, documentation, and presentation skills.</li>\n<li>Proficiency in scripting languages such as Python, Bash, or PowerShell for automation tasks.</li>\n</ul>\n<h3>Certifications</h3>\n<ul>\n<li>AWS/Azure/GCP Architect Certifications</li>\n<li>Kubernetes Certifications (CKA/CKAD)</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            "Cloud Architecture",
            "Kubernetes",
            "DevOps"
        ],
        "summary": "Seeking an experienced Cloud Infrastructure Architect to design scalable solutions. Responsibilities include cloud adoption, AI/ML infrastructure, and ensuring security and compliance."
    },
    {
        "job_title": "Regional Sales Manager – GCC (Software Sales)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25327",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Regional Sales Manager – GCC (Software Sales)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> GCC Region (Saudi Arabia, UAE, Qatar, Kuwait, Bahrain, and Oman)\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>Reflections Info Systems is seeking a dynamic Regional Sales Manager (RSM) to lead and expand our software business operations across the Gulf Cooperation Council (GCC) region. The RSM will be responsible for driving sustainable revenue growth, building long-term client relationships, and positioning our enterprise software solutions for digital transformation in key industries such as Banking, Financial Services, Telecom, Retail, and Government. This role requires proven enterprise B2B software sales experience, strong leadership, and a deep understanding of regional market dynamics and regulatory landscapes.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop and execute comprehensive regional sales strategies to meet and exceed software and services revenue targets (software solutions, SaaS, licensing, digital transformation).</li>\n<li>Identify and secure new enterprise clients while nurturing long-term relationships with key accounts and CXO-level stakeholders.</li>\n<li>Manage the end-to-end enterprise sales cycle — from prospecting, RFPs, proposals, and negotiations to deal closure.</li>\n<li>Ensure timely revenue collection and follow-up with existing accounts while driving upselling and cross-selling opportunities.</li>\n<li>Drive and expand the partner ecosystem by establishing relationships with system integrators, VARs, and channel partners across GCC.</li>\n<li>Ensure compliance with regional regulatory requirements (e.g., public tenders, data residency norms, SaaS/cloud compliance).</li>\n<li>Collaborate cross-functionally with Pre-Sales, Delivery, Product, Marketing, and Partner Management teams to ensure client satisfaction and solution alignment.</li>\n<li>Represent the company at regional trade events, summits, and conferences to enhance brand visibility and thought leadership.</li>\n<li>Provide accurate sales forecasts, pipeline insights, and market intelligence to senior management.</li>\n</ul>\n<h3>Travel Requirements:</h3>\n<p>Travel is required across GCC as and when necessary for client meetings, partner engagements, and industry events.</p>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Business, Computer Science, Engineering, or related field; MBA preferred.</li>\n<li><strong>5–8 years</strong> of enterprise software sales experience, including <strong>5+ years in a regional leadership capacity</strong> within GCC.</li>\n<li>Proven success in selling SaaS, cloud platforms, and enterprise solutions to large/mid-sized clients.</li>\n<li>Deep understanding of GCC market regulations, tendering processes, and enterprise procurement frameworks.</li>\n<li>Established network of enterprise clients and partners in key markets (especially KSA, Qatar, and UAE).</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Strong soft skills – resilience, adaptability, cross-cultural negotiation, and leadership under pressure.</li>\n<li>Fluency in English and Arabic is mandatory.</li>\n<li>Must hold a valid GCC residency and driving license.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems (P) Ltd never asks for payment for job applications. All communication comes through official channels. Please be aware of potential fraudsters and contact careers@reflectionsinfos.com for any clarifications.</p>",
        "tags": [
            "5+ Years",
            "SaaS",
            "Enterprise Software Sales",
            "GCC Market"
        ],
        "summary": "Regional Sales Manager wanted for GCC software sales. Drive revenue growth, build client relationships, and manage sales cycles. Requires enterprise software sales experience and GCC market knowledge."
    },
    {
        "job_title": "Functional Consultant: Odoo",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25326",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Functional Consultant: Odoo</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<p><strong>Closing Date:</strong> 12, December 2025\n<strong>Job Published:</strong> 21, November 2025</p>\n<h3>Brief Description</h3>\n<p><strong>Experience:</strong> 5+ Years\n<strong>Location:</strong> Trivandrum</p>\n<p>We are looking for a highly skilled Odoo Functional Consultant with extensive experience in implementing and managing Odoo ERP solutions. The ideal candidate should have in-depth knowledge of latest Odoo versions, strong business analysis capabilities, and the ability to guide clients through the entire implementation cycle — from requirement gathering to go-live support.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Odoo Expertise:</strong> Demonstrate strong knowledge of Odoo functionality, modules, and workflows (especially in versions 18 and 19). Present and explain Odoo features and workflows to clients effectively.</li>\n<li><strong>Customer Needs Analysis:</strong> Analyze customers’ business processes and requirements to map them accurately with Odoo functionalities, acting as a trusted business consultant.</li>\n<li><strong>Requirement Assessment:</strong> Identify which requirements can be met through Odoo configurations and which require custom development.</li>\n<li><strong>System Implementation:</strong> Perform complete system implementation, configuration, testing, and fine-tuning of Odoo modules as per client needs.</li>\n<li><strong>Documentation:</strong> Prepare comprehensive documentation (SRS, BRD, or functional specifications) for all tasks requiring development or customization.</li>\n<li><strong>Developer Coordination:</strong> Collaborate closely with the technical/development team to ensure proper implementation and test developed modules and features.</li>\n<li><strong>Customer Support:</strong> Provide end-to-end assistance during the delivery cycle, including software setup, configuration, and go-live support.</li>\n<li><strong>Customer Training:</strong> Conduct training sessions for clients—both online and on-site—to ensure smooth adoption and effective use of Odoo.</li>\n<li><strong>Module Maintenance:</strong> Test, maintain, and ensure smooth functioning of Odoo modules, projects, products, and interfaces.</li>\n<li><strong>Research &amp; Advisory:</strong> Explore new Odoo modules, apps, and verticals to meet evolving business requirements and recommend best-fit solutions.</li>\n<li><strong>Marketing Plugins:</strong> Identify market needs, conceptualize plugin ideas, and promote and demonstrate these plugins to customers.</li>\n<li><strong>Communication:</strong> Exhibit excellent communication skills in English (both verbal and written) to interact effectively with customers and internal teams.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Minimum 5 years of experience as an Odoo Functional Consultant.</li>\n<li>Strong understanding of Odoo ERP modules, business processes, and workflows.</li>\n<li>Proven experience in Odoo implementation, customization, and configuration.</li>\n<li>Experience preparing functional documentation (SRS/BRD).</li>\n<li>Excellent analytical, problem-solving, and client management skills.</li>\n<li>Ability to coordinate effectively with technical and business teams.</li>\n<li>Strong presentation and training abilities.</li>\n<li>Excellent English communication skills (written and verbal).</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Odoo",
            "ERP Implementation",
            "Business Analysis"
        ],
        "summary": "Seeking an Odoo Functional Consultant with 5+ years of experience in Trivandrum. Responsibilities include Odoo implementation, client needs analysis, system configuration, and training. Requires strong Odoo knowledge and communication skills."
    },
    {
        "job_title": "L1/L2 IT Support Engineer - Managed IT Services (US Clients)",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25325",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>L1/L2 IT Support Engineer - Managed IT Services (US Clients)</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> India (Remote/Hybrid)\n<strong>Work Shift:</strong> US shift (Evening/Night)\n<strong>Years of Experience:</strong> 2–5 years (L1/L2)\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 12, Dec 2025</p>\n<p><strong>Contact Email:</strong> careers@pitsolutions.com\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Address:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583</p>\n<h3>About the Role</h3>\n<p>We are hiring L1/L2 IT Support Engineers to support our US-based customers as part of our Managed IT Services team. The role focuses on day-to-day user support, identity and device management, and Microsoft cloud ecosystem operations. You must be comfortable delivering remote support within a modern, cloud-first IT environment.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Handle user onboarding/offboarding in Entra ID and Microsoft 365</li>\n<li>Manage login issues, MFA enrolment, and authentication troubleshooting</li>\n<li>Support devices through Intune, including policies, compliance, and app deployments</li>\n<li>Troubleshoot M365 applications (Outlook, Teams, OneDrive, SharePoint)</li>\n<li>Resolve L1/L2 tickets: desktops/laptops, OS issues, VPN, peripherals, and connectivity problems</li>\n<li>Provide timely updates and maintain accurate documentation</li>\n<li>Collaborate with L3 teams for escalations</li>\n<li>Adhere to ITSM processes (incident, request, change management)</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Microsoft Cloud &amp; Identity</strong>\n- Hands-on experience with Microsoft Entra ID (user lifecycle, password resets, Conditional Access, MFA, authentication methods, group/RBAC basics)\n- Understanding of Entra External ID and guest/external user authentication issues</p>\n<p><strong>Endpoint &amp; Device Management</strong>\n- Strong expertise in Microsoft Intune (Windows/Mac enrolment, configuration/compliance profiles, app deployments, remote troubleshooting)\n- Windows 10/11 endpoint support (OS troubleshooting, drivers, application errors, peripherals)</p>\n<p><strong>Microsoft 365 Applications</strong>\n- License assignment, mailbox creation, and Exchange Online basics\n- Troubleshooting Teams, SharePoint, OneDrive, and the Microsoft 365 app ecosystem</p>\n<p><strong>Networking, VPN &amp; Security</strong>\n- Basic understanding of DNS, DHCP, IP configuration, Wi-Fi troubleshooting\n- VPN support for tools like AnyConnect, GlobalProtect, FortiClient\n- Awareness of antivirus/EDR platforms (Defender, CrowdStrike, etc.)</p>\n<h3>Additional Preferred Skills</h3>\n<ul>\n<li>Basic PowerShell scripting for user/device tasks</li>\n<li>L1 exposure to Microsoft Dynamics 365</li>\n<li>Familiarity with ITSM tools (ServiceNow, Freshservice, Jira SM)</li>\n<li>Knowledge of common SaaS tools (Zoom, Slack, Dropbox, Salesforce)</li>\n<li>Basic understanding of Azure/AWS cloud concepts</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "Microsoft Entra ID",
            "Microsoft Intune",
            "Microsoft 365"
        ],
        "summary": "Hiring L1/L2 IT Support Engineers for US clients. Role involves user support, identity/device management, and Microsoft cloud operations. Must provide remote support."
    },
    {
        "job_title": "Solution Architect (Optimizely)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25324",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Solution Architect (Optimizely)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 28, Nov 2025\n<strong>Job Published:</strong> 21, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for 12+ years experienced candidates for this role.</p>\n<h3>Job Description</h3>\n<p>We are seeking an experienced <strong>Solution Architect</strong> to lead the design and implementation of a large-scale migration from <strong>SAP B2B</strong> to <strong>Optimizely Commerce Cloud</strong>. This role will serve as the <strong>technical leader</strong>, responsible for defining a scalable, secure, and future-ready architecture. The ideal candidate has deep expertise in <strong>enterprise commerce systems, cloud architecture, and system integrations</strong>. You will guide development teams, ensure best practices in solution design, and ultimately take full ownership of the architecture and development transition from the vendor.</p>\n<p><strong>Responsibilities include:</strong></p>\n<p><strong>Architecture &amp; Design</strong></p>\n<ul>\n<li>Define the end-to-end migration architecture from SAP B2B to Optimizely, including CMS, Commerce, and PIM integration.</li>\n<li>Design scalable, secure, and high-performance frameworks aligned with business goals.</li>\n<li>Establish data migration strategies for products, pricing, and customer hierarchies.</li>\n<li>Ensure API integration between SAP, Optimizely, and other enterprise systems.</li>\n</ul>\n<p><strong>Technical Leadership</strong></p>\n<ul>\n<li>Lead and mentor development teams on best practices and coding standards.</li>\n<li>Collaborate with Optimizely consultants and internal teams to validate feasibility and technical approach.</li>\n<li>Drive DevOps strategy for CI/CD pipelines, containerization, and cloud deployment.</li>\n</ul>\n<p><strong>Project Ownership</strong></p>\n<ul>\n<li>Act as the technical owner of the migration project, taking over from vendor after initial phases.</li>\n<li>Ensure alignment with enterprise security and compliance standards.</li>\n<li>Provide technical guidance during feasibility analysis and pilot module migration.</li>\n</ul>\n<p><strong>Collaboration &amp; Communication</strong></p>\n<ul>\n<li>Work closely with Business Analysts to translate requirements into technical solutions.</li>\n<li>Communicate architecture decisions to stakeholders and leadership in business-friendly terms.</li>\n<li>Support QA teams with test strategy for performance, integration, and security.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong></p>\n<p><strong>Technical Expertise</strong></p>\n<ul>\n<li><strong>SAP B2B Architecture:</strong> Deep understanding of SAP Commerce Cloud, Back Office, and integration patterns.</li>\n<li><strong>B2B Platform:</strong> Hands-on experience with CMS and Commerce Cloud platforms, specifically Optimizely.</li>\n<li><strong>Optimizely PIM &amp; Spire:</strong> Strong knowledge of Optimizely Product Information Management (PIM) and Spire framework for modern commerce experiences.</li>\n<li><strong>.NET Development:</strong> Proficient in .NET Core and ASP.NET, essential for Optimizely development.</li>\n<li><strong>Cloud Architecture:</strong> Strong knowledge of Azure PaaS, commonly used for hosting Optimizely solutions.</li>\n<li><strong>Azure Active Directory:</strong> Experience with identity and access management using Azure AD.</li>\n<li><strong>API Design &amp; Integration:</strong> Skilled in RESTful services, SAP APIs, and Optimizely endpoints.</li>\n<li><strong>Frontend Development:</strong> Strong React expertise with CMS integration experience.</li>\n</ul>\n<p><strong>Architectural Leadership</strong></p>\n<ul>\n<li><strong>Modern Architecture Concepts:</strong> Experience with monolithic and microservices-based systems.</li>\n<li><strong>Solution Architecture Design:</strong> Ability to design scalable, secure, and maintainable frameworks.</li>\n<li><strong>System Integration:</strong> Expertise in bridging SAP and Optimizely platforms, including middleware and data flow strategies.</li>\n<li><strong>Performance &amp; Scalability:</strong> Planning for optimized performance and future growth.</li>\n<li><strong>Security &amp; Compliance:</strong> Knowledge of enterprise-grade security, data protection, and regulatory standards.</li>\n</ul>\n<p><strong>Project Ownership</strong></p>\n<ul>\n<li><strong>End-to-End Leadership:</strong> Proven ability to lead projects from blueprint to execution.</li>\n<li><strong>Vendor Transition:</strong> Skilled in taking over architecture and development from external consultants.</li>\n<li><strong>Stakeholder Communication:</strong> Capable of translating technical decisions into business value for diverse audiences.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<p><strong>Technical Enhancements</strong></p>\n<ul>\n<li><strong>GraphQL &amp; Headless CMS Architecture:</strong> Beneficial for building modern, flexible commerce experiences.</li>\n<li><strong>DevOps &amp; CI/CD Pipelines:</strong> Experience with tools like Azure DevOps or GitHub Actions for automated deployments.</li>\n<li><strong>Containerization:</strong> Familiarity with Docker and Kubernetes for scalable and efficient deployments.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li><strong>Team Mentoring &amp; Coaching:</strong> Experienced in guiding developers through complex migration phases and technical transitions.</li>\n<li><strong>Agile Methodology:</strong> Skilled in managing sprints, backlogs, and iterative delivery cycles to ensure timely and quality outcomes.</li>\n<li><strong>Analytical Thinking &amp; Problem-Solving:</strong> Strong capability in feasibility analysis, module mapping, and resolving architectural challenges.</li>\n<li><strong>Continuous Learning Mindset:</strong> Proactively stays updated with evolving trends in SAP BTP, Optimizely, and cloud technologies.</li>\n</ul>\n<p><strong>Application Instructions:</strong>\nInterested candidates may forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Fraudulent Job Offers:</strong>\nThis is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact <strong>careers@reflectionsinfos.com</strong> for any clarification/ alerts on this subject.</p>",
        "tags": [
            "12+ Years",
            "Optimizely",
            "SAP B2B",
            "Cloud Architecture"
        ],
        "summary": "Seeking a Solution Architect for SAP B2B to Optimizely migration. Requires 12+ years experience in enterprise commerce, cloud architecture, and system integrations."
    },
    {
        "job_title": "SDET (.NET)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25323",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Software Development Engineer in Test (SDET) - .NET</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 3+ years of experience for this role.</p>\n<h3>Job Description</h3>\n<p>Reflections Info Systems is seeking a skilled Software Development Engineer in Test (SDET) to ensure the quality and reliability of our SAP B2B to Optimizely Commerce Cloud migration. This role requires a blend of strong programming and QA expertise to design, develop, and execute both automated and manual tests. The SDET will validate functional workflows, API integrations, and data accuracy, while building automation frameworks, integrating tests into CI/CD pipelines, and collaborating with developers and business teams to deliver a robust and scalable solution.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop and maintain automated test suites using .NET Core/C#, Selenium, or Playwright.</li>\n<li>Perform API testing for ECC-Optimizely integrations using Postman or RestSharp.</li>\n<li>Validate migrated data using SQL queries and backend checks.</li>\n<li>Implement unit and integration tests with xUnit, NUnit, or MSTest.</li>\n<li>Set up and manage test pipelines in Azure DevOps or GitHub Actions.</li>\n<li>Conduct functional, regression, and end-to-end testing for ecommerce workflows.</li>\n<li>Perform performance testing using JMeter, k6, or similar tools.</li>\n<li>Ensure secure API practices and basic security testing (OWASP awareness).</li>\n<li>Collaborate in Agile teams, participate in sprint planning, and report defects in JIRA or Azure Boards.</li>\n<li>Generate test reports using ExtentReports, Allure, or custom dashboards.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li><strong>Technical Testing:</strong></li>\n<li>.NET Core / C#: Strong programming skills for writing automated tests and test utilities.</li>\n<li>API Testing: Experience with tools like Postman, RestSharp, or Swagger for testing ECC-Optimizely integrations.</li>\n<li>Unit Testing Frameworks: Proficiency in xUnit, NUnit, or MSTest.</li>\n<li>Test Automation: Building and maintaining automation suites using Selenium WebDriver or Playwright (for UI testing).</li>\n<li>SQL &amp; Data Validation: Writing queries to validate migrated data between ECC and Optimizely.</li>\n<li>\n<p>CI/CD Integration: Setting up test pipelines in Azure DevOps, GitHub Actions, or Jenkins.</p>\n</li>\n<li>\n<p><strong>Functional &amp; Integration Testing:</strong></p>\n</li>\n<li>End-to-End Test Scenarios: Covering product catalog, pricing, inventory, and order workflows.</li>\n<li>Regression Testing: Ensuring stability after each migration phase.</li>\n<li>\n<p>Error Handling &amp; Logging: Implementing robust logging and exception tracking.</p>\n</li>\n<li>\n<p><strong>Quality Practices:</strong></p>\n</li>\n<li>Test Strategy &amp; Planning: Creating test plans aligned with migration phases.</li>\n<li>Defect Management: Using tools like JIRA, Azure Boards, or TestRail.</li>\n<li>Version Control: Git for managing test code and collaboration.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li><strong>Performance &amp; Security Testing:</strong></li>\n<li>Load Testing Tools: JMeter, k6, or Locust for performance validation.</li>\n<li>\n<p>Security Testing Basics: Awareness of OWASP Top 10 and secure API practices.</p>\n</li>\n<li>\n<p><strong>SAP ECC Awareness:</strong></p>\n</li>\n<li>Basic ABAP Understanding: To interpret ECC logic and validate data extraction.</li>\n<li>\n<p>ECC Data Models: Familiarity with tables like MARA, KNA1, VBAK for test data setup.</p>\n</li>\n<li>\n<p><strong>Optimizely Platform Familiarity:</strong></p>\n</li>\n<li>Optimizely Commerce Workflows: Understanding how catalog and order flows work.</li>\n<li>\n<p>CMS Testing: Validating content rendering and personalization logic.</p>\n</li>\n<li>\n<p><strong>Collaboration &amp; DevOps:</strong></p>\n</li>\n<li>Test Reporting Tools: Extent Reports, Allure, or custom dashboards.</li>\n<li>Agile Methodology: Working in sprints, attending stand-ups, and contributing to retrospectives.</li>\n</ul>\n<h3>Soft Skills:</h3>\n<ul>\n<li>Strong communication and documentation abilities.</li>\n<li>Analytical thinking to identify edge cases and potential data issues.</li>\n<li>Proactive collaboration with developers, business analysts, and stakeholders.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "3+ Years",
            ".NET Core/C#",
            "API Testing",
            "Azure DevOps"
        ],
        "summary": "Seeking an SDET with 3+ years experience in .NET for SAP to Optimizely migration. Responsibilities include developing automated tests, API testing, and CI/CD integration."
    },
    {
        "job_title": "Lead (Full Stack - FE / BE / React)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25322",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Lead (Full Stack - FE / BE / React) at Reflections Info Systems (P) Ltd</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>Job Description</h3>\n<p>We are seeking a highly skilled Full Stack Developer with 8+ years of experience to lead the end-to-end migration of our B2B platform to Optimizely. This role requires deep technical expertise across front-end and back-end technologies, strong architectural understanding, and hands-on experience with e-commerce systems. The ideal candidate will drive the technical strategy, implementation, and integration efforts, ensuring a seamless transition from SAP ECC to Optimizely Commerce.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the full lifecycle of the B2B to Optimizely migration project, from planning to deployment.</li>\n<li>Develop scalable, secure, and maintainable full-stack solutions.</li>\n<li>Collaborate with architects, business analysts, QA, and DevOps teams to ensure alignment and delivery.</li>\n<li>Design and implement RESTful APIs for seamless integration between SAP ECC and Optimizely.</li>\n<li>Ensure high performance and responsiveness of applications across browsers and devices.</li>\n<li>Integrate and optimize PIM (Product Information Management) and Spire systems within the e-commerce ecosystem.</li>\n<li>Implement CI/CD pipelines for automated testing and deployment using Azure DevOps or GitHub Actions.</li>\n<li>Maintain documentation and provide technical leadership and mentoring to junior developers.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>\n<p><strong>Front-End (React):</strong></p>\n<ul>\n<li>React.js (Hooks, Context API): Building scalable, component-based UIs.</li>\n<li>JavaScript (ES6+) / TypeScript: Strong scripting and typing for maintainable code.</li>\n<li>HTML5 / CSS3 / SASS: Responsive design and layout skills.</li>\n<li>State Management: Redux or React Query for managing complex state.</li>\n<li>API Integration: Consuming RESTful APIs securely and efficiently.</li>\n<li>Cross-Browser Compatibility: Ensuring consistent UI behavior across platforms.</li>\n</ul>\n</li>\n<li>\n<p><strong>Back-End (.NET):</strong></p>\n<ul>\n<li>.NET Core / C#: Building scalable services and APIs for Optimizely.</li>\n<li>Entity Framework / LINQ: Data access and manipulation.</li>\n<li>RESTful API Design: Creating secure, performant endpoints for ECC-Optimizely integration.</li>\n<li>Authentication &amp; Authorization: OAuth2, JWT, role-based access control.</li>\n<li>Database Design: SQL Server or PostgreSQL schema modeling and optimization.</li>\n</ul>\n</li>\n<li>\n<p><strong>Architecture &amp; Integration:</strong></p>\n<ul>\n<li>Optimizely/EPIServer Platform Knowledge: Deep understanding of CMS and Commerce architecture.</li>\n<li>SAP ECC Data Models: Familiarity with MARA, KNA1, VBAK, etc., for integration planning.</li>\n<li>Middleware &amp; Integration Patterns: Experience with Azure Logic Apps, MuleSoft, or Boomi.</li>\n<li>Microservices Architecture: Designing loosely coupled services for scalability.</li>\n<li>CI/CD Pipelines: Azure DevOps, GitHub Actions, or Jenkins for automated deployments.</li>\n<li>Spire &amp; PIM Integration: Experience integrating product and pricing data into e-commerce platforms.</li>\n</ul>\n</li>\n<li>\n<p><strong>Business &amp; Domain Knowledge:</strong></p>\n<ul>\n<li>Ecommerce Workflows: Product catalog, pricing, inventory, checkout.</li>\n<li>B2B Commerce: Understanding of business customer journeys, bulk ordering, and account-based pricing.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>\n<p><strong>Front-End:</strong></p>\n<ul>\n<li>UI Frameworks: Material UI, Tailwind CSS, or Bootstrap.</li>\n<li>Performance Optimization: Lazy loading, code splitting, caching strategies.</li>\n<li>Accessibility (WCAG): Ensuring inclusive design.</li>\n</ul>\n</li>\n<li>\n<p><strong>Back-End:</strong></p>\n<ul>\n<li>GraphQL: For flexible data querying if used in Optimizely extensions.</li>\n<li>Message Queues: RabbitMQ, Azure Service Bus for async processing.</li>\n<li>Containerization: Docker, Kubernetes for deployment and scaling.</li>\n</ul>\n</li>\n<li>\n<p><strong>Integration &amp; DevOps:</strong></p>\n<ul>\n<li>Monitoring &amp; Logging: ELK stack, Application Insights, or Prometheus.</li>\n<li>Security Best Practices: Data encryption, secure API design, GDPR compliance.</li>\n<li>Test Automation Awareness: Understanding of unit, integration, and performance testing.</li>\n</ul>\n</li>\n<li>\n<p><strong>Business &amp; Domain Knowledge:</strong></p>\n<ul>\n<li>SAP ECC Migration Strategy: Understanding of data extraction, transformation, and validation.</li>\n<li>Stakeholder Communication: Translating technical decisions into business impact.</li>\n</ul>\n</li>\n<li>\n<p><strong>Leadership &amp; Collaboration:</strong></p>\n<ul>\n<li>Solution Design: Translating business requirements into technical architecture.</li>\n<li>Code Reviews &amp; Mentorship: Guiding developers and enforcing best practices.</li>\n<li>Agile Methodology: Working in sprints, managing backlog, and leading stand-ups.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Application Process:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>Please be aware that some fraudsters may promise jobs with Reflections Info Systems for a fee. Reflections Info Systems <strong>never</strong> seeks payment for jobs. We only contact candidates through our official website or LinkedIn. All employment-related emails are sent from our official HR email ID. For any clarification or alerts regarding this matter, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "8+ Years",
            "React",
            ".NET Core",
            "Optimizely"
        ],
        "summary": "Lead Full Stack Developer sought for B2B platform migration to Optimizely. Requires 8+ years of experience in FE/BE technologies, e-commerce, and SAP integration."
    },
    {
        "job_title": "Technical Lead - Linux & Cloud (OpenStack)",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25321",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Technical Lead - Linux &amp; Cloud (OpenStack)</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala, India\n<strong>Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 12, Dec 2025\n<strong>Contact Email:</strong> careers@pitsolutions.com\n<strong>Website:</strong> http://www.pitsolutions.com</p>\n<h3>About the Role</h3>\n<p>We are seeking an experienced Technical Lead with a specialization in Linux and Cloud (OpenStack). This role is crucial for leading and scaling our open-source infrastructure and hosting platforms. The ideal candidate will possess deep expertise in Linux administration, OpenStack operations, security hardening, and hybrid cloud architectures. Responsibilities include overseeing infrastructure design, ensuring operational excellence, and fostering cross-team collaboration to maintain secure, stable, and high-performing environments for both internal systems and client deployments.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Infrastructure &amp; Cloud Management</strong></p>\n<ul>\n<li>Lead the design, deployment, and lifecycle management of OpenStack cloud environments.</li>\n<li>Manage PITS' internal hybrid infrastructure and support client environments according to SLAs.</li>\n<li>Drive service improvement initiatives utilizing Kaizen principles.</li>\n<li>Manage OpenStack core components: Compute (Nova), Networking (Neutron), Storage (Cinder, Swift), and Interface (Horizon).</li>\n<li>Integrate workloads across OpenStack, AWS, and Azure in hybrid/multi-cloud setups.</li>\n<li>Oversee monitoring, performance tuning, capacity planning, and disaster recovery strategies.</li>\n<li>Optimize hosting platforms for cost, scalability, and high availability.</li>\n</ul>\n<p><strong>Server Administration &amp; Hosting</strong></p>\n<ul>\n<li>Administer Linux servers (Ubuntu, CentOS, RHEL) and web servers (Apache, Nginx).</li>\n<li>Manage databases including MySQL/PostgreSQL.</li>\n<li>Oversee hosting for CMS and open-source platforms such as WordPress, Magento, and PHP applications.</li>\n<li>Automate deployments and OS maintenance using Infrastructure as Code (IaC) tools like Ansible or Terraform.</li>\n<li>Ensure regular patching, OS upgrades, and lifecycle governance.</li>\n</ul>\n<p><strong>Security &amp; Compliance</strong></p>\n<ul>\n<li>Implement server and network hardening, firewall rules, secure baselines, and Identity and Access Management (IAM) policies.</li>\n<li>Collaborate with cybersecurity teams to detect, assess, and remediate vulnerabilities.</li>\n<li>Maintain compliance with security standards including CIS Benchmarks, ISO 27001, and SOC2.</li>\n<li>Enforce encryption, access controls, and secure configuration practices.</li>\n</ul>\n<p><strong>Architecture &amp; Automation</strong></p>\n<ul>\n<li>Architect scalable, resilient, and fault-tolerant infrastructure for new and existing products.</li>\n<li>Build and manage CI/CD pipelines integrated with development workflows.</li>\n<li>Automate monitoring, backups, and alerts using tools like Zabbix, Prometheus, and Grafana.</li>\n<li>Evaluate emerging open-source technologies to enhance performance and reliability.</li>\n</ul>\n<p><strong>Leadership &amp; Collaboration</strong></p>\n<ul>\n<li>Mentor and guide junior engineers, providing technical direction and conducting reviews.</li>\n<li>Work closely with development teams to ensure smooth deployments and performance optimization.</li>\n<li>Collaborate with cybersecurity and product teams on secure architecture design.</li>\n<li>Serve as the primary escalation point for complex production issues.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Linux &amp; OpenStack Expertise</strong></p>\n<ul>\n<li>10–12 years of Linux system engineering experience.</li>\n<li>Mandatory hands-on experience with OpenStack (deployment, operations, troubleshooting).</li>\n<li>Deep knowledge of OpenStack components: Nova, Neutron, Keystone, Glance, Cinder, Swift.</li>\n</ul>\n<p><strong>Server, Web &amp; Application Platforms</strong></p>\n<ul>\n<li>Strong proficiency with Linux distributions (Ubuntu, CentOS, RHEL).</li>\n<li>Expertise in web servers (Apache, Nginx) and application servers (PHP-FPM).</li>\n<li>Experience with databases like MySQL/MariaDB and PostgreSQL.</li>\n<li>Familiarity with CMS platforms (WordPress, Magento, Drupal).</li>\n</ul>\n<p><strong>Networking, DevOps &amp; Security</strong></p>\n<ul>\n<li>Strong understanding of networking concepts (DNS, VLANs, load balancers, SSL/TLS).</li>\n<li>Hands-on experience with containerization (Docker) and IaC tools (Ansible, Terraform).</li>\n<li>Proficiency with version control (Git) and CI/CD tools (Jenkins).</li>\n<li>Knowledge of system hardening, firewalling, and security controls.</li>\n<li>Experience designing and managing hybrid/multi-cloud environments.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "OpenStack",
            "Linux",
            "Cloud"
        ],
        "summary": "Lead Linux & Cloud (OpenStack) infrastructure. Manage, scale, and secure hybrid cloud environments. Requires 10+ years experience and expertise in OpenStack and Linux."
    },
    {
        "job_title": "Senior Business Development Executive",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25320",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Senior Business Development Executive</h2>\n<p>PIT Solutions (P) Ltd\nModule No. 209-N, 9th Floor, Yamuna, SEZ IT Building,\nTechnopark Phase III, Thiruvananthapuram, Kerala, India , 695583\nhttp://www.pitsolutions.com</p>\n<p><strong>Closing Date:</strong> 12,Dec 2025\n<strong>Job Published:</strong> 21,Nov 2025\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<h3>Brief Description</h3>\n<ul>\n<li><strong>Location:</strong> Trivandrum</li>\n<li><strong>Years of Experience:</strong> 5+ years</li>\n</ul>\n<h3>About the Role</h3>\n<p>We are seeking an experienced Senior Business Development Executive to drive strategic growth, build strong client relationships, and expand our presence across global markets. The role involves identifying new opportunities, managing key accounts, and collaborating with internal teams to deliver tailored solutions that support revenue growth and long-term business success.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define and execute long-term strategic goals to strengthen market presence</li>\n<li>Build, nurture, and expand relationships with key customers and prospects</li>\n<li>Identify, qualify, and convert new business opportunities across target markets</li>\n<li>Work closely with internal teams to maximize sales potential and achieve revenue targets</li>\n<li>Develop customized presentations and proposals aligned with client needs</li>\n<li>Drive proactive outreach through networking, cold calling, and digital prospecting</li>\n<li>Create persuasive approaches and strategies to secure potential client engagements</li>\n<li>Maintain strong client rapport while meeting and exceeding sales targets</li>\n<li>Present new products and services to enhance existing client relationships</li>\n<li>Maintain positive relationships with existing customers and support ongoing account growth</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Business Development &amp; Sales Expertise</h4>\n<ul>\n<li>Proven experience in business development or sales within the IT/ITeS industry</li>\n<li>Strong outbound sales background with hands-on lead generation and prospecting</li>\n<li>Competency in sales forecasting, pipeline management, and achieving targets</li>\n</ul>\n<h4>Market &amp; Domain Knowledge</h4>\n<ul>\n<li>Understanding of market dynamics, competitive landscape, and company offerings</li>\n<li>Ability to identify unique selling points and differentiators</li>\n<li>Experience in international sales and marketing (mandatory)</li>\n<li>Preferred exposure to ANZ and APAC regions</li>\n</ul>\n<h4>Communication &amp; Relationship Management</h4>\n<ul>\n<li>Excellent communication, negotiation, and interpersonal skills</li>\n<li>Ability to build and maintain long-term client relationships</li>\n<li>Full professional proficiency in English</li>\n</ul>\n<h4>Additional Capabilities</h4>\n<ul>\n<li>Ability to mentor or train internal teams in business development practices</li>\n<li>Strong professional presence and commitment to representing the company positively</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Business Development",
            "Sales",
            "International Sales"
        ],
        "summary": "Seeking a Senior Business Development Executive with 5+ years of experience to drive global growth. Role involves identifying opportunities, building client relationships, and achieving revenue targets."
    },
    {
        "job_title": "Java Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25319",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Java Developer</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>Introduction</h3>\n<p>We are looking for candidates with 7-9 years of experience for the role of Java Developer.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable Java-based applications and services.</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Write clean, maintainable, and testable code.</li>\n<li>Develop and maintain RESTful APIs and integration points with internal and external systems.</li>\n<li>Perform unit and integration testing to ensure high code quality.</li>\n<li>Participate in Agile ceremonies and contribute to continuous improvement initiatives.</li>\n<li>Troubleshoot and resolve application issues in a timely manner.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Core Java (JDK 8 or above), Spring Boot, J2EE, and JPA/Hibernate</li>\n<li>Unit and Integration Testing using Junit, RESTful API development using JSON</li>\n<li>Build &amp; Version Control Tools: Maven, Git, Jenkins</li>\n<li>Database Technologies: JDBC, RDBMS (e.g., MySQL, PostgreSQL), Cassandra</li>\n<li>Messaging Systems: Apache Kafka, ActiveMQ, or IBM MQ</li>\n<li>Cloud Development Experience, preferably in Microsoft Azure</li>\n<li>Strong understanding of object-oriented programming, core Java concepts, and design patterns.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "7-9 Years",
            "Java",
            "Spring Boot",
            "RESTful API"
        ],
        "summary": "Seeking a Java Developer with 7-9 years of experience to design, develop, and maintain scalable Java applications. Responsibilities include coding, API development, testing, and troubleshooting."
    },
    {
        "job_title": "Senior Data Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25318",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Senior Data Architect</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>A minimum of 10 years of experience in data engineering, encompassing the development and scaling of data warehouse and data lake platforms. The candidate should possess a strong background in Snowflake, demonstrating leadership in technical design, architecture, and implementation of complex data solutions.</p>\n<p><strong>Working Hours:</strong> 8 hours, with a few hours of overlap during EST Time zone (12 PM - 9 PM IST). This overlap is mandatory for meetings.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead the design and architecture of data solutions leveraging Snowflake, ensuring scalability, performance, and reliability.</li>\n<li>Oversee the implementation of data pipelines, ETL processes, and data governance frameworks within Snowflake environments.</li>\n<li>Ensure efficient data extraction from SAP BW/ECC systems.</li>\n<li>Collaborate with stakeholders to understand business requirements and translate them into technical specifications and data models.</li>\n<li>Develop and maintain data architecture standards, guidelines, and best practices, including data governance principles and DataOps methodologies.</li>\n<li>Provide technical guidance and mentorship to data engineering teams, fostering skill development and knowledge sharing.</li>\n<li>Conduct performance tuning and optimization of Snowflake databases and queries.</li>\n<li>Stay updated on emerging trends and advancements in Snowflake, cloud data technologies, data governance, and DataOps practices.</li>\n</ul>\n<h3>Mandatory Skills:</h3>\n<ul>\n<li>Snowflake experience</li>\n<li>Data Architecture experience</li>\n<li>ETL process experience</li>\n<li>Large Data migration solutioning experience</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Extensive experience in designing and implementing data solutions using Snowflake, DBT.</li>\n<li>Proficiency in data modeling, schema design, and optimization within Snowflake environments.</li>\n<li>Strong understanding of cloud data warehousing concepts and best practices, particularly with Snowflake.</li>\n<li>Expertise in Python/Java/Scala, SQL, ETL processes, and data integration techniques, with a focus on Snowflake.</li>\n<li>Familiarity with other cloud platforms and data technologies (e.g., AWS, Azure, GCP).</li>\n<li>Demonstrated experience in implementing data governance frameworks and DataOps practices.</li>\n<li>Familiarity with real-time streaming technologies and Change Data Capture (CDC) mechanisms.</li>\n<li>Knowledge of data governance principles and DataOps methodologies.</li>\n<li>Proven track record of architecting and delivering complex data solutions in cloud platforms/Snowflake.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Understanding of SAP BW/ECC systems, including data extraction, transformation, and loading (ETL/ELT) processes.</li>\n<li>Experience with data visualization tools (e.g., Tableau, Power BI) is a plus.</li>\n<li>Experience in designing, developing, and implementing SAP ABAP programs, reports, interfaces, and enhancements.</li>\n<li>Working experience in SAP environments.</li>\n<li>Knowledge of data security and compliance standards.</li>\n<li>Proficiency in SAP ABAP (Advanced Business Application Programming) development.</li>\n<li>Excellent communication and presentation skills, with the ability to convey complex technical concepts to juniors and non-technical stakeholders.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Ability to work effectively in a collaborative team environment and lead cross-functional initiatives.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>Reflections Info Systems (P) Ltd wishes to alert jobseekers about fraudsters who are impersonating the company and soliciting fees for job offers. Please be advised that Reflections Info Systems never requests payment for employment. We communicate with candidates exclusively through our official website or LinkedIn, and all employment-related emails originate from our official HR email address. For any clarifications or to report suspicious activity, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "10+ Years",
            "Snowflake",
            "Data Architecture",
            "ETL"
        ],
        "summary": "Senior Data Architect needed with 10+ years in data engineering and Snowflake expertise. Responsibilities include designing, implementing, and optimizing complex data solutions and pipelines. Skills in ETL, data modeling, and cloud platforms are essential."
    },
    {
        "job_title": "Technical Project Manager (Optimizely)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25317",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Technical Project Manager (Optimizely)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Date Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>We are looking for a Technical Project Manager with 12+ years of experience in migration projects, preferably from SAP Commerce (Hybris) to Optimizely Commerce Cloud. The Technical PM will be responsible for end-to-end delivery oversight, including team onboarding, vendor knowledge transition, governance, SLA adherence, and quality assurance. This role requires strong B2B domain knowledge, hands-on technical understanding, and leadership skills to ensure successful migration and long-term ownership of the solution.</p>\n<h2>Responsibilities:</h2>\n<h3>Project Planning &amp; Delivery</h3>\n<ul>\n<li>Define and manage the migration roadmap, timelines, and milestones.</li>\n<li>Oversee end-to-end delivery ensuring SLA compliance, quality, and governance.</li>\n<li>Conduct feasibility analysis and risk assessments for migration phases.</li>\n</ul>\n<h3>Team &amp; Vendor Management</h3>\n<ul>\n<li>Lead team onboarding and ensure smooth transition of knowledge from vendors.</li>\n<li>Act as the primary liaison between internal teams, vendors, and stakeholders.</li>\n<li>Drive vendor handover strategy for architecture and development ownership.</li>\n</ul>\n<h3>Technical Oversight</h3>\n<ul>\n<li>Ensure alignment with solution architecture and technical standards.</li>\n<li>Collaborate with architects and developers to resolve technical challenges.</li>\n<li>Monitor integration, data migration, and performance testing activities.</li>\n</ul>\n<h3>Governance &amp; Reporting</h3>\n<ul>\n<li>Maintain project documentation, dashboards, and progress reports.</li>\n<li>Conduct status meetings and communicate updates to leadership.</li>\n<li>Ensure compliance with security, quality, and enterprise standards.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<h3>Primary Skills:</h3>\n<ul>\n<li>Experience in migration projects – ideally SAP Hybris to Optimizely</li>\n<li>Strong B2B domain knowledge – pricing, catalogs, workflows, customer hierarchies.</li>\n<li>Hands-on technical understanding – .NET Core, APIs, CMS/Commerce Cloud concepts.</li>\n<li>Proficiency in Agile project management – sprint planning, backlog management.</li>\n<li>Excellent stakeholder communication and vendor management skills.</li>\n<li>Strong governance and SLA management experience.</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Direct experience with Optimizely Commerce Cloud and Spire framework.</li>\n<li>Experience with JS framework (React/Angular/VueJS) &amp; CMS proficiency</li>\n<li>Familiarity with SAP Commerce Cloud (Hybris) architecture.</li>\n<li>Knowledge of Azure cloud services and CI/CD pipelines.</li>\n<li>Exposure to data migration strategies and performance optimization.</li>\n<li>Certification in PMP or Agile/Scrum methodologies.</li>\n</ul>\n<h3>Soft Skills:</h3>\n<ul>\n<li>Leadership &amp; Team Management – Ability to inspire, guide, and manage cross-functional teams.</li>\n<li>Communication Skills – Clear and concise communication with technical and non-technical stakeholders.</li>\n<li>Problem-Solving &amp; Decision-Making – Ability to resolve issues quickly and make informed decisions.</li>\n<li>Negotiation &amp; Influencing – Skilled in managing vendor relationships and stakeholder expectations.</li>\n<li>Adaptability – Comfortable with evolving priorities and dynamic project environments.</li>\n<li>Conflict Resolution – Ability to handle disagreements and maintain team harmony.</li>\n<li>Time Management &amp; Prioritization – Ensures deadlines and deliverables are met efficiently.</li>\n</ul>\n<p><strong>Application Instructions:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "12+ Years",
            "Optimizely",
            "SAP Hybris",
            "Agile Project Management"
        ],
        "summary": "Seeking a Technical Project Manager with 12+ years of experience in migration projects, particularly from SAP Hybris to Optimizely. Role involves end-to-end delivery oversight, team management, and technical leadership for successful solution ownership."
    },
    {
        "job_title": "Full Stack Developer (Angular+Nodejs)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25316",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Full Stack Developer (Angular+Nodejs)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>The full-stack software engineer’s primary job role will be to design and develop solutions using NodeJS, and related technologies. This includes developing backend services and corresponding client-side counterparts.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, test, and maintain high-quality web applications using Angular (version 16+).</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Ensure the technical feasibility of UI/UX designs.</li>\n<li>Participate in code reviews, providing constructive feedback to peers.</li>\n<li>Troubleshoot and debug applications, ensuring optimal performance.</li>\n<li>Stay up-to-date with emerging trends and technologies in front-end development.</li>\n<li>Mentor and guide junior developers, fostering a collaborative and productive work environment.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Minimum of 4 years of professional experience in front-end development.</li>\n<li>Strong proficiency in Angular (version 16+) and related technologies.</li>\n<li>Node JS, Nest JS, Kafka, Redis, Javascript, HTML, CSS</li>\n<li>RESTful API integration</li>\n<li>Experience working with Docker and containerized applications</li>\n<li>Experience working with Kubernetes or other container orchestration tools</li>\n<li>Hands-on knowledge and understanding of AWS environments</li>\n<li>Experience in full-stack development</li>\n<li>Knowledge of RDBMS and Document Database</li>\n<li>Experience with Agile and Scrum development methodologies</li>\n<li>Exposure to continuous integration (CI/CD)</li>\n<li>Knowledge of version control systems such as Git and TFS</li>\n<li>Good analytical and problem-solving skills</li>\n<li>Up-to-date knowledge of latest technologies, tools, and platforms</li>\n<li>Ability to complete tasks with minimum supervision</li>\n<li>Ability to play a leadership role</li>\n</ul>\n<p><strong>Key Technologies:</strong></p>\n<ul>\n<li>Node JS</li>\n<li>Nest JS framework</li>\n<li>Angular</li>\n<li>Kafka / Event architecture / RabbitMQ</li>\n<li>Redis / Caching</li>\n<li>Javascript</li>\n<li>HTML, CSS</li>\n<li>Microservices &amp; Cloud</li>\n<li>Knowledge / Understanding in continuous integration (CI/CD)</li>\n<li>RDBMS/NoSQL/MongoDB</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Knowledge in Laravel is an addon.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Be aware that some fraudsters may promise jobs with Reflections Info Systems for a fee. Reflections Info Systems <strong>never</strong> asks for payment for jobs. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. Please contact <strong>careers@reflectionsinfos.com</strong> for any clarification or alerts on this subject.</p>",
        "tags": [
            "4+ Years",
            "Angular",
            "Node.js",
            "AWS"
        ],
        "summary": "Seeking a Full Stack Developer proficient in Angular (16+) and Node.js. Responsibilities include designing, developing, and optimizing web applications. Requires 4+ years of experience and strong backend/frontend skills."
    },
    {
        "job_title": "Customer Support Executive - Voice Process (Australia Region)",
        "company": "Phykon Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25315",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>Customer Support Executive - Voice Process (Australia Region)</h2>\n<p><strong>Company:</strong> Phykon Solutions (P) Ltd\n<strong>Location:</strong> L-11, B1, Thejaswini Building, Technopark Campus, Karyavattom, Trivandrum, 695581\n<strong>Website:</strong> http://www.phykon.com\n<strong>Contact Email:</strong> hiring@phykon.com\n<strong>Closing Date:</strong> 21, Dec 2025\n<strong>Job Published:</strong> 21, Nov 2025</p>\n<h3>Brief Description</h3>\n<p><strong>Designation:</strong> Customer Support Executive - Voice Process (Australia Region)\n<strong>Experience:</strong> 0-2 years\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Shift:</strong> Rotational (4:30 am to 1:30 pm and 5:30 am to 2:30 pm)\n<strong>Qualification:</strong> Graduation in any stream</p>\n<h3>Job Summary</h3>\n<p>Phykon is seeking a dedicated Customer Support Executive to manage a team of representatives providing top-notch customer service and after-sales support. The ideal candidate will have strong leadership skills, excellent communication abilities, and a deep understanding of customer service processes.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Manage a team of customer support representatives.</li>\n<li>Oversee the entire customer service process.</li>\n<li>Resolve customer complaints and issues promptly.</li>\n<li>Develop and implement customer service policies and procedures.</li>\n<li>Plan and facilitate training sessions to standardize service delivery.</li>\n<li>Monitor individual and team performance.</li>\n<li>Conduct quality assurance surveys with customers and provide feedback to the team.</li>\n<li>Maintain comprehensive product knowledge to enhance customer support.</li>\n<li>Foster a positive and productive work environment for the team.</li>\n</ul>\n<h3>Preferred Skills Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in any field.</li>\n<li>1-3 years of experience in customer support.</li>\n<li>Excellent interpersonal, written, and oral communication skills.</li>\n<li>Proven ability to lead and manage a team.</li>\n<li>Familiarity with CRM systems.</li>\n<li>Proficient computer skills.</li>\n<li>Knowledge of mediation and conflict resolution techniques is a plus.</li>\n</ul>\n<h3>Apply Now:</h3>\n<p>https://phykon.keka.com/careers/jobdetails/6017</p>\n<p>Join Phykon and contribute to our commitment to delivering exceptional customer service and support. Apply now to become a vital part of our dynamic team!</p>",
        "tags": [
            "0-2 Years",
            "Customer Support",
            "Communication Skills",
            "Team Management"
        ],
        "summary": "Seeking a Customer Support Executive for Australia region. Requires managing a team, resolving issues, and ensuring top-notch service with excellent communication."
    },
    {
        "job_title": "Senior DotNet Developer + Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25314",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Senior DotNet Developer + Azure</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Closing Date:</strong> 28, Nov 2025\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 8+ years of experience for this role. The working hours are from 12:00 PM to 9:00 PM.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, enhance, document, and maintain robust applications using .NET Core 6/8+, C#, REST APIs, T-SQL, and modern JavaScript/jQuery.</li>\n<li>Integrate and support third-party APIs and external services.</li>\n<li>Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack.</li>\n<li>Identify, prioritize, and execute tasks throughout the Software Development Life Cycle (SDLC).</li>\n<li>Participate in Agile/Scrum ceremonies and manage tasks using Jira.</li>\n<li>Understand technical priorities, architectural dependencies, risks, and implementation challenges.</li>\n<li>Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p>8+ years of hands-on development experience with:\n- C#, .NET Core 6/8+, Entity Framework / EF Core\n- JavaScript, jQuery, REST APIs\n- Expertise in MS SQL Server, including: Complex SQL queries, Stored Procedures, Views, Functions, Packages, Cursors, Tables, and Object Types.\n- Skilled in unit testing with XUnit, MSTest.\n- Strong in software design patterns, system architecture, and scalable solution design.\n- Ability to lead and inspire teams through clear communication, technical mentorship, and ownership.\n- Strong problem-solving and debugging capabilities.\n- Ability to write reusable, testable, and efficient code.\n- Develop and maintain frameworks and shared libraries to support large-scale applications.\n- Excellent technical documentation, communication, and leadership skills.\n- Microservices and Service-Oriented Architecture (SOA).\n- Experience in API Integrations.</p>\n<p>2+ years of hands-on experience with Azure Cloud Services, including:\n- Azure Functions\n- Azure Durable Functions\n- Azure Service Bus, Event Grid, Storage Queues\n- Blob Storage, Azure Key Vault, SQL Azure\n- Application Insights, Azure Monitoring</p>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Familiarity with AngularJS, ReactJS, and other front-end frameworks.</li>\n<li>Experience with Azure API Management (APIM).</li>\n<li>Knowledge of Azure Containerization and Orchestration (e.g., AKS/Kubernetes).</li>\n<li>Experience with Azure Data Factory (ADF) and Logic Apps.</li>\n<li>Exposure to Application Support and operational monitoring.</li>\n<li>Azure DevOps - CI/CD pipelines (Classic / YAML).</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Please be aware that some fraudsters are promising jobs with Reflections Info Systems for a fee. Reflections Info Systems <strong>never</strong> asks for any payment for job opportunities. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through our official HR email ID. Please contact careers@reflectionsinfos.com for any clarification or to report any suspicious activity.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Azure",
            "C#"
        ],
        "summary": "Seeking an experienced Senior DotNet Developer with 8+ years in .NET Core and Azure. Responsibilities include designing, developing, and integrating scalable applications and leading teams."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25313",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Date Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>Reflections Info Systems is seeking a highly seasoned Technical Delivery Manager with 14+ years of experience to lead the successful delivery of complex technical projects and solutions. The ideal candidate will possess a robust technology background, exceptional project management skills, and the ability to foster collaboration across diverse teams. This role demands end-to-end ownership of project delivery, ensuring alignment with strategic business objectives, adept stakeholder management, and the promotion of technical excellence.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Project Delivery Management:</strong>\n- Oversee the planning, execution, and successful delivery of multiple technical projects.\n- Manage critical project elements including scope, timelines, budgets, risks, and quality assurance.\n- Ensure strict adherence to Agile/Waterfall methodologies as dictated by project needs.</p>\n<p><strong>Team Leadership:</strong>\n- Lead, mentor, and inspire cross-functional technical teams, cultivating an environment of collaboration and innovation.\n- Conduct regular performance evaluations and identify avenues for professional growth and development for team members.</p>\n<p><strong>Stakeholder Engagement:</strong>\n- Serve as the primary liaison between technical teams, business stakeholders, and clients.\n- Provide clear and effective communication regarding project status, identified risks, and proposed solutions to all stakeholders.</p>\n<p><strong>Technical Expertise:</strong>\n- Collaborate closely with architects and engineers to conceptualize and define robust technical solutions.\n- Offer valuable input on architecture, design principles, and implementation strategies.</p>\n<p><strong>Process Improvement:</strong>\n- Proactively identify opportunities to enhance project delivery processes and optimize the use of relevant tools.\n- Implement and champion best practices in software development and delivery lifecycles.</p>\n<p><strong>Risk and Issue Management:</strong>\n- Anticipate and identify potential project risks, developing comprehensive mitigation strategies.\n- Efficiently resolve technical and operational challenges as they arise.</p>\n<p><strong>Customer Focus:</strong>\n- Guarantee customer satisfaction by delivering high-quality solutions that precisely align with stated business needs.</p>\n<h3>Preferred Skills:</h3>\n<p><strong>Experience:</strong>\n- A minimum of 14 years in technology delivery roles, encompassing hands-on development and leadership responsibilities.\n- Demonstrated success in delivering large-scale, intricate projects involving diverse teams.\n- Experience in managing Profit &amp; Loss (P&amp;L) for account portfolios, driving revenue growth and profitability.\n- Proficiency in planning and managing team scaling (ramp-ups and ramp-downs) through strategic pyramid planning, external hiring, and internal resource allocation.\n- Demonstrated ability in account management, including meticulous financial tracking, invoice collection, margin enhancement, and resource planning.\n- Proven capability in building and nurturing strong client relationships through consistent interaction, conducting Quarterly Business Reviews (QBRs), and undertaking on-site visits.\n- Experience supporting account growth initiatives, including opportunity identification, proposal development, and influencing stakeholders to expand business.</p>\n<p><strong>Technical Expertise:</strong>\n- Solid understanding of contemporary software development methodologies, cloud platforms (such as AWS, Azure, GCP), and DevOps principles.\n- Proficiency in at least one prominent programming language (e.g., Java, Python, .NET) is advantageous.</p>\n<p><strong>Project Management:</strong>\n- Expert-level knowledge of Agile, Scrum, Kanban, and traditional project management frameworks.\n- Possessing certifications such as PMP, CSM, or equivalent is a significant plus.</p>\n<p><strong>Leadership and Communication:</strong>\n- Exceptional team leadership, people management, and conflict resolution capabilities.\n- Outstanding communication, presentation, and negotiation skills.</p>\n<h3>Education:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a closely related field. A Master’s degree is considered a bonus.</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Experience managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices and frameworks.</li>\n<li>Strong business acumen, with the ability to strategically align technical objectives with overarching business goals.</li>\n</ul>\n<p><strong>Application Instructions:</strong>\nInterested candidates are requested to forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Job Scams:</strong>\nWe wish to alert job seekers to fraudulent activities where individuals claim to offer employment with Reflections Info Systems for a fee. Please be aware that Reflections Info Systems <em>never</em> solicits payment for job opportunities. All official communication originates from our website, LinkedIn, or HR email address. For any clarifications or to report suspicious activity, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "14+ Years",
            "Project Management",
            "Agile",
            "Cloud Technologies"
        ],
        "summary": "Seeking a Technical Delivery Manager with 14+ years experience to lead complex projects. Role involves end-to-end delivery, team leadership, and stakeholder management."
    },
    {
        "job_title": "Video Editor",
        "company": "Tiltlabs Consultancy Services (P) Ltd",
        "url": "https://technopark.org/job-details/25312",
        "location": "Technopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Video Editor – TILTEDU</h2>\n<p><strong>Company:</strong> TILTLABS CONSULTANCY SERVICES (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala, India\n<strong>Website:</strong> http://www.tiltlabs.io\n<strong>Contact Email:</strong> careers@tiltlabs.io\n<strong>Closing Date:</strong> 08, Dec 2025\n<strong>Job Published:</strong> 21, Nov 2025</p>\n<h3>About TILTEDU</h3>\n<p>TILTEDU is an educational initiative focused on creating engaging content for learners exploring game development, AR/VR, animation, and other creative technologies. We are looking for a versatile Video Editor who can help bring our educational and promotional content to life across various formats and platforms.</p>\n<h3>Role Overview</h3>\n<p>We’re seeking a creative and technically skilled Video Editor who can edit across multiple formats, maintain brand consistency, and deliver high-quality visual content tailored to various digital mediums. The ideal candidate is fast, detail-oriented, and highly collaborative, with a strong eye for storytelling and pacing.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Edit short-form vertical videos (e.g., talking head reels) for social media with dynamic hooks, jump cuts, captions, and zooms.</li>\n<li>Produce cinematic trailers and promo content using motion graphics, B-roll, transitions, and synced audio.</li>\n<li>Cut podcast-style content by choosing compelling snippets, syncing split audio, adding waveforms and overlays.</li>\n<li>Apply clean color correction and basic grading to raw footage while maintaining natural skin tones and background neutrality.</li>\n<li>Collaborate with the creative team to align edits with storytelling goals and branding guidelines.</li>\n<li>Incorporate feedback quickly and meet fast turnaround deadlines without compromising quality.</li>\n</ul>\n<h3>Key Skills &amp; Tools</h3>\n<ul>\n<li><strong>Proficiency in Editing Software:</strong> Adobe Premiere Pro, Final Cut Pro, or DaVinci Resolve</li>\n<li><strong>Motion Graphics:</strong> Adobe After Effects (preferred)</li>\n<li><strong>Audio Syncing &amp; Cleanup:</strong> Basic sound design and syncing for podcasts</li>\n<li><strong>Color Grading:</strong> Experience with basic correction and use of LUTs</li>\n<li><strong>Formats:</strong> Comfortable working across 1080x1920, 1920x1080, 1080x1080</li>\n<li><strong>Bonus:</strong> Experience with gaming or educational content editing</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>0–1 years of experience in video editing (freelance or in-house)</li>\n<li>Strong portfolio demonstrating multi-format video editing</li>\n<li>Ability to work independently and manage multiple projects simultaneously</li>\n<li>Excellent communication and time-management skills</li>\n</ul>\n<h3>Perks</h3>\n<ul>\n<li>Opportunity to work with emerging game developers and educators</li>\n<li>Exposure to creative projects in the edtech and gaming industries</li>\n<li>Type: Freelance/Contract (with potential for long-term collaboration)</li>\n<li>Industry: EdTech / Game Development / Digital Learning</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Adobe Premiere Pro",
            "Adobe After Effects",
            "Video Editing"
        ],
        "summary": "Seeking a creative Video Editor for TILTEDU to create engaging educational content. Responsibilities include editing various formats and collaborating with the team."
    },
    {
        "job_title": "L1/L2 IT Support Engineer (Managed IT Services – US Clients",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25311",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>L1/L2 IT Support Engineer (Managed IT Services – US Clients)</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> India (Remote/Hybrid)\n<strong>Shift:</strong> US Shift (Evening/Night)\n<strong>Experience Required:</strong> 2–5 years (L1/L2)\n<strong>Closing Date:</strong> December 12, 2025\n<strong>Job Published:</strong> November 21, 2025</p>\n<p><strong>Contact:</strong>\n- <strong>Email:</strong> careers@pitsolutions.com\n- <strong>Website:</strong> http://www.pitsolutions.com\n- <strong>Address:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583</p>\n<h3>Role Overview</h3>\n<p>We are seeking experienced L1/L2 IT Support Engineers to join our Managed IT Services team, focusing on supporting our US-based customers. This role involves managing daily user support, identity and device management, and operations within the Microsoft cloud ecosystem. The ideal candidate will have proven experience in providing remote support to end-users in a contemporary, cloud-centric IT environment.</p>\n<h3>Core Technical Skills (Mandatory)</h3>\n<p><em>(Aligned to Microsoft’s Latest Cloud &amp; Identity Stack)</em></p>\n<ol>\n<li>\n<p><strong>Microsoft Entra ID (formerly Azure AD)</strong></p>\n<ul>\n<li>User lifecycle operations: creation, modification, deletion</li>\n<li>Password resets, sign-in issue troubleshooting, login troubleshooting</li>\n<li>Strong understanding of Conditional Access, Authentication Methods, MFA setup &amp; issue management</li>\n<li>Entra ID Connect / Hybrid identity basics</li>\n<li>Group management, RBAC basics</li>\n</ul>\n</li>\n<li>\n<p><strong>Microsoft Entra External ID (Replacement for Azure AD B2C)</strong></p>\n<ul>\n<li>Basic understanding of customer identity flows</li>\n<li>Troubleshooting authentication issues for external/guest users</li>\n</ul>\n</li>\n<li>\n<p><strong>Microsoft Intune (Endpoint Management)</strong></p>\n<ul>\n<li>Device enrollment (Windows/Mac)</li>\n<li>Compliance &amp; configuration profiles</li>\n<li>Application deployment &amp; updates</li>\n<li>Remote troubleshooting for end-user systems</li>\n</ul>\n</li>\n<li>\n<p><strong>Microsoft 365 (M365) Support</strong></p>\n<ul>\n<li>User onboarding/offboarding</li>\n<li>License assignment &amp; mailbox creation</li>\n<li>Basic Exchange Online troubleshooting</li>\n<li>Teams &amp; SharePoint access support</li>\n<li>OneDrive sync issues</li>\n</ul>\n</li>\n<li>\n<p><strong>Windows 10/11 Endpoint Support</strong></p>\n<ul>\n<li>OS troubleshooting (startup, performance, updates)</li>\n<li>Driver issues, application errors, basic registry awareness</li>\n<li>Peripheral support (printers, scanners, webcams, etc.)</li>\n</ul>\n</li>\n<li>\n<p><strong>VPN &amp; Remote Access Support</strong></p>\n<ul>\n<li>Supporting tools like AnyConnect, GlobalProtect, FortiClient, etc.</li>\n<li>Troubleshooting connectivity and MFA-related issues</li>\n<li>Profile and configuration troubleshooting</li>\n</ul>\n</li>\n<li>\n<p><strong>Basic Networking &amp; Security Knowledge</strong></p>\n<ul>\n<li>DNS, DHCP, IP configuration, Wi-Fi troubleshooting</li>\n<li>Understanding of antivirus/EDR agents (Defender, CrowdStrike, etc.)</li>\n</ul>\n</li>\n</ol>\n<h3>Additional Technical Skills (Preferred but Not Mandatory)</h3>\n<ul>\n<li>Basic PowerShell for user and device operations</li>\n<li>Experience supporting Microsoft Dynamics 365 users at L1</li>\n<li>Exposure to ITSM tools (ServiceNow, Freshservice, Jira Service Management)</li>\n<li>Knowledge of SaaS tools (Zoom, Slack, Dropbox, Salesforce basics)</li>\n<li>Basic understanding of cloud concepts (Azure/AWS)</li>\n</ul>\n<h3>Preferred Skills &amp; Responsibilities</h3>\n<ul>\n<li>Handle User Onboarding and Offboarding across Entra ID and M365</li>\n<li>Manage MFA enrolment, login issues, and secure authentication flows</li>\n<li>Support end-user devices through Intune (policy/application issues)</li>\n<li>Troubleshoot M365 apps (Outlook, Teams, OneDrive, SharePoint)</li>\n<li>Resolve daily L1/L2 tickets related to desktops, laptops, login issues, VPN, and printers</li>\n<li>Provide timely updates and maintain accurate documentation</li>\n<li>Work closely with L3 teams for escalated issues</li>\n<li>Follow ITSM processes (incident, request, change management)</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "Microsoft Entra ID",
            "Microsoft Intune",
            "Microsoft 365"
        ],
        "summary": "Seeking L1/L2 IT Support Engineers for remote/hybrid roles supporting US clients. Responsibilities include managing user accounts, devices, and Microsoft cloud services."
    },
    {
        "job_title": "Product Owner",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25310",
        "location": "Technopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Product Owner</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Module No. 209-N, 9th Floor, Yamuna, SEZ IT Building, Technopark Phase III, Thiruvananthapuram, Kerala, India, 695583\n<strong>Website:</strong> http://www.pitsolutions.com\n<strong>Contact Email:</strong> careers@pitsolutions.com</p>\n<p><strong>Closing Date:</strong> 12, Dec 2025\n<strong>Job Published:</strong> 21, Nov 2025</p>\n<h3>Brief Description</h3>\n<ul>\n<li>4–7 years of experience as a Product Owner or Product Manager, preferably in SaaS-based platforms such as Fleet Management, HRMS, or ATS, Health Care.</li>\n<li>Strong understanding of enterprise workflow systems, business process automation, and data-driven decision-making.</li>\n<li>Proven experience working in Agile/Scrum product development environments.</li>\n<li>Ability to write detailed user stories, acceptance criteria, and manage sprint planning effectively.</li>\n<li>Excellent analytical, communication, and stakeholder management skills.</li>\n<li>Familiarity with integration workflows (e.g., GPS, ERP, payroll, CRM, or thirdparty APIs).</li>\n<li>Experience with UI/UX collaboration, product analytics tools, and backlog management systems (e.g., Jira, Azure DevOps).</li>\n<li>Passion for building impactful, scalable software products that solve real business challenges.</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define and own the product vision, strategy, and roadmap for platforms in the Fleet, HRMS, Health Care or ATS domains.</li>\n<li>Collaborate with engineering, design, QA, and business stakeholders to translate market and customer requirements into actionable user stories.</li>\n<li>Conduct detailed business process mapping and identify opportunities for digital automation and optimization.</li>\n<li>Maintain and prioritize the product backlog, ensuring alignment with organizational goals and customer value.</li>\n<li>Work closely with cross-functional teams in an Agile/Scrum environment to deliver product releases on time and within scope.</li>\n<li>Gather and analyze feedback from users, partners, and market research to guide continuous product improvement.</li>\n<li>Define and monitor product performance metrics (adoption, retention, efficiency gains, ROI).</li>\n<li>Conduct competitive and industry analysis to position the product effectively and identify market gaps.</li>\n<li>Ensure a seamless user experience (UX) across different modules and interfaces, emphasizing usability and scalability.</li>\n<li>Support pre-sales and marketing teams with product demos, documentation, and value proposition clarity.</li>\n</ul>",
        "tags": [
            "4-7 Years",
            "Product Owner",
            "SaaS",
            "Agile/Scrum"
        ],
        "summary": "Seeking a Product Owner with 4-7 years of SaaS experience. Responsibilities include defining product vision, managing backlog, and collaborating with teams for impactful product delivery."
    },
    {
        "job_title": "Lead Generation Executive(Marketing )",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25309",
        "location": "Technopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Lead Generation Executive (Marketing)</h2>\n<p><strong>Company:</strong> KENLAND IT SOLUTIONS (P) Ltd\n<strong>Location:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> https://www.kenland.in</p>\n<p><strong>Closing Date:</strong> 30, Dec 2025\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<h3>Job Title: Lead Generation (Marketing and Sales)</h3>\n<p><strong>Experience Required:</strong> Minimum 1 year in the Software/IT industry\n<strong>Employment Type:</strong> Full-Time</p>\n<h3>Job Summary:</h3>\n<p>We are looking for a motivated and detail-oriented Lead Generation Specialist to join our growing sales and marketing team. The ideal candidate will have at least 1 year of experience in the software industry, with a proven ability to identify, qualify, and nurture leads through various outbound and inbound channels. You will play a key role in building a strong pipeline of prospects for our sales team.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Conduct market research to identify potential clients and target segments</li>\n<li>Generate leads via email campaigns, LinkedIn outreach, cold calling, and other digital tools</li>\n<li>Qualify prospects through discovery calls and prepare lead profiles for the sales team</li>\n<li>Maintain and update the CRM system (e.g., HubSpot, Salesforce) with accurate lead information</li>\n<li>Collaborate with marketing to align lead generation efforts with campaigns and strategies</li>\n<li>Track and report lead generation metrics and optimize processes based on performance</li>\n<li>Stay up-to-date with industry trends, target customer personas, and competitive landscape.</li>\n</ul>\n<h3>Preferred Skills &amp; Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, or a related field</li>\n<li>Minimum 1 year of experience in a lead generation or sales development role in the software or IT industry</li>\n<li>Familiarity with CRM software (e.g., Salesforce, HubSpot)</li>\n<li>Experience with lead generation tools such as LinkedIn Sales Navigator, Apollo, ZoomInfo, etc.</li>\n<li>Strong written and verbal communication skills</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Goal-oriented with strong organizational and time management skills.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience working with SaaS products or B2B software sales</li>\n<li>Understanding of sales funnels and pipeline management</li>\n<li>Knowledge of email automation and campaign tools (e.g., Mailchimp, Lemlist)</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Lead Generation",
            "CRM",
            "Salesforce"
        ],
        "summary": "Seeking a Lead Generation Specialist with 1+ year of IT industry experience. Responsibilities include market research, lead generation, qualification, and CRM management to build a sales pipeline."
    },
    {
        "job_title": "Office Assistant",
        "company": "Innure Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/25308",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>Office Assistant</h2>\n<p><strong>Company:</strong> Innure Infotech (P) Ltd</p>\n<p><strong>Location:</strong> Module No-14, 4th Floor, Nila Building, Technopark Campus, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.innure.com</p>\n<p><strong>Contact Email:</strong> hr@scalevel.in</p>\n<p><strong>Date Published:</strong> 21, Nov 2025</p>\n<p><strong>Closing Date:</strong> 21, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Innure Infotech (P) Ltd is hiring an Office Assistant to support daily office operations and assist internal teams. The ideal candidate is organized, efficient, and able to handle routine tasks with accuracy.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Manage clients and handle calls</li>\n<li>Maintain office files, records, and confidential documents</li>\n<li>Support meeting scheduling and calendar coordination</li>\n<li>Prepare letters, reports, and basic Excel sheets</li>\n<li>Track office supplies and coordinate with vendors</li>\n<li>Assist HR with document collection and onboarding support</li>\n<li>Handle mail, courier services, and internal communication</li>\n<li>Manage client relationship and follow-up</li>\n<li>Provide administrative support to management and project teams</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>0–1 year experience in office administration or front office support</li>\n<li>Strong communication and coordination skills</li>\n<li>Basic knowledge of MS Office and email tools</li>\n<li>Good organization and time management</li>\n<li>Attention to detail and timely follow-up</li>\n</ul>",
        "tags": [
            "0-1 Years Experience",
            "MS Office",
            "Communication Skills",
            "Office Administration"
        ],
        "summary": "Seeking an organized and efficient Office Assistant to support daily operations. Responsibilities include client management, record keeping, and administrative support."
    },
    {
        "job_title": "Associate Java Developer - (Work From Home) Immediate Joiners Preffered",
        "company": "Leader It (P) Ltd",
        "url": "https://technopark.org/job-details/25307",
        "location": "Technopark",
        "closing_date": "27 Nov 2025",
        "job_description": "<h2>Associate Java Developer (Work From Home)</h2>\n<p><strong>Company:</strong> LEADER IT (P) Ltd\n<strong>Location:</strong> Remote\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 27, Nov 2025</p>\n<p><strong>Contact Email:</strong> jobsindia@leadergroup.com</p>\n<h3>Job Summary:</h3>\n<p>We are seeking a skilled Java Developer with 3-5 years of experience to join our dynamic team. The ideal candidate will have a strong background in Java development, proficiency in Springboot, and experience with SQL databases. Familiarity with containerization tools like Docker and orchestration platforms like Kubernetes/ Docker is essential. The candidate should be capable of designing, developing, and implementing high-quality software solutions in a collaborative environment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain robust and scalable Java applications.</li>\n<li>Utilize Springboot to create well-structured and efficient web applications.</li>\n<li>Develop and optimize SQL queries for data retrieval and manipulation.</li>\n<li>Implement and manage containerized applications using Docker.</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n</ul>\n<h3>Required Skills and Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, or a related field.</li>\n<li>3-5 years of professional experience in Java development.</li>\n<li>Proficiency in Spring framework.</li>\n<li>Strong understanding of SQL databases and experience with database design.</li>\n<li>Hands-on experience with Docker for containerization.</li>\n<li>Familiarity with version control systems such as Git.</li>\n<li>Knowledge of RESTful APIs and web services.</li>\n<li>Excellent communication and teamwork abilities.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, or a related field.</li>\n<li>3-5 years of professional experience in Java development.</li>\n<li>Proficiency in Spring framework.</li>\n<li>Strong understanding of SQL databases and experience with database design.</li>\n<li>Hands-on experience with Docker for containerization.</li>\n<li>Familiarity with version control systems such as Git.</li>\n<li>Knowledge of RESTful APIs and web services.</li>\n<li>Excellent communication and teamwork abilities.</li>\n</ul>\n<p><strong>NOTE:</strong> APPLY THIS POSITION USING ABOVE PROVIDED LINK</p>\n<p><strong>Company Address:</strong>\nSBC 1, -2 FLOOR,\nTHEJASWINI BUILDING,\nPHASE 1, TECHNOPARK CAMPUS,\nKARYAVATTOM P O,\nTRIVANDRUM, KERALA , 695581</p>\n<p><strong>Website:</strong> http://www.leaderit.in/</p>",
        "tags": [
            "3-5 Years",
            "Java",
            "Springboot",
            "Docker"
        ],
        "summary": "Seeking a Java Developer with 3-5 years experience for a remote role. Must be proficient in Springboot, SQL, and Docker for designing and implementing software solutions."
    },
    {
        "job_title": "Performance Marketing Manager - SEM",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25306",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd - Performance Marketing Manager (SEM)</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/digital-marketing-manager\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 23, Nov 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America's leading automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize AI, machine learning, and data analytics to provide innovative, personalized solutions. Recognized by Bloomberg and Andreessen Horowitz, we simplify car ownership.</p>\n<h3>Job Title: Digital Marketing Manager / Performance Marketing Manager</h3>\n<p><strong>Experience:</strong> 6 to 8 Years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for a data-driven Digital Marketing / Performance Marketing Manager to lead our paid media efforts, focusing on Search Engine Marketing (SEM) across Google Ads, Bing Ads, and other platforms. You will drive performance for key verticals including Airport Parking, City Parking, Auto Insurance, and Car Repair &amp; Maintenance. This role is ideal for individuals with experience managing large budgets, testing beta products, and delivering successful campaigns.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, launch, and optimize high-performance SEM campaigns to meet traffic, conversion, and revenue goals.</li>\n<li>Conduct comprehensive keyword research, build structured campaigns, and perform A/B testing on ads and landing pages.</li>\n<li>Track and analyze key performance metrics (CTR, CPC, CVR, ROAS) to identify scalability and efficiency improvements.</li>\n<li>Collaborate with cross-functional teams (analytics, product, content, design) for effective campaign execution.</li>\n<li>Utilize beta features, automation tools, and new ad formats to maintain a competitive advantage.</li>\n<li>Develop and present detailed performance reports, insights, and strategic recommendations.</li>\n<li>Ensure full compliance with platform advertising policies and maintain high quality scores.</li>\n<li>Stay updated on AI-driven innovations in digital advertising and adopt new features from Google, Meta, Microsoft, etc.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>6+ years of hands-on digital/performance marketing experience, with a strong SEM focus.</li>\n<li>Experience managing $100K+/month in paid media spend, preferably for US markets.</li>\n<li>Proficiency in Google Ads, Bing Ads, Google Analytics, Looker Studio, SA360, etc.</li>\n<li>Proven expertise with AI-powered advertising solutions (e.g., Google Performance Max, Meta Advantage+, DSA).</li>\n<li>Google Ads Certification required; Meta Blueprint or multi-channel expertise is a plus.</li>\n<li>Prior experience in e-commerce, mobility, or booking-based platforms is highly desirable.</li>\n<li>Experience with beta product testing, new feature launches, or award-winning campaigns is a strong advantage.</li>\n<li>Agency background with multi-client and multi-platform experience is a plus.</li>\n<li>Excellent analytical, project management, and communication skills.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a significant impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>",
        "tags": [
            "6-8 Years",
            "SEM",
            "Google Ads",
            "Bing Ads"
        ],
        "summary": "Lead SEM paid media efforts for Way.com's automotive super app. Drive performance across key verticals using data-driven strategies and advanced tools."
    },
    {
        "job_title": "Product Team Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25305",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Product Manager - Way.Com India Pvt Ltd</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/product-manager\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 23, Nov 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America's dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We use cutting-edge AI, machine learning, and data analytics to provide innovative and personalized solutions. Recognized by Bloomberg and Andreessen Horowitz, we are making car ownership easier, more affordable, and rewarding.</p>\n<h3>Job Title: Product Manager</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Product Manager to own the development and delivery of impactful product features that enhance user experience and drive business growth. You will collaborate closely with engineering, design, and data teams to transform innovative ideas into market-ready solutions rapidly.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>End-to-End Product Ownership:</strong> Drive product features from ideation to launch, ensuring alignment with business goals and delivery of high-quality outcomes.</li>\n<li><strong>Data-Driven Decision Making:</strong> Leverage analytics and user feedback to identify opportunities and implement impactful product enhancements.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with engineering, design, and data teams to deliver seamless, timely product releases.</li>\n<li><strong>Performance Management:</strong> Track product performance metrics and execute strategies to maximize growth, retention, and engagement.</li>\n<li><strong>Stakeholder Alignment:</strong> Communicate priorities, timelines, and progress clearly to stakeholders, ensuring transparency and alignment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 3–7 years of experience in product management.</li>\n<li><strong>Product Strategy &amp; Roadmapping:</strong> Defining product vision, goals, and long-term plans, translating them into a prioritized roadmap.</li>\n<li><strong>Data-Driven Decision Making:</strong> Using quantitative and qualitative data to inform choices, validate assumptions, and measure product performance.</li>\n<li><strong>User-Centric Design Thinking:</strong> Applying a creative, iterative problem-solving approach focused on user needs and experience enhancement.</li>\n<li><strong>Stakeholder Management:</strong> Building and maintaining positive relationships with stakeholders, ensuring alignment and effective communication.</li>\n<li><strong>Agile Product Development:</strong> Using flexible, iterative methods for rapid development and adaptation to feedback.</li>\n<li><strong>Market &amp; Competitive Analysis:</strong> Researching industry trends, customer behavior, and competitor offerings.</li>\n<li><strong>A/B Testing &amp; Experimentation:</strong> Comparing variations of product elements to determine optimal performance.</li>\n<li><strong>Go-To-Market Execution:</strong> Planning and executing strategies for successful product launches.</li>\n<li><strong>Wireframing &amp; Prototyping:</strong> Creating visual blueprints and interactive mockups to test concepts.</li>\n<li><strong>User Research:</strong> Collecting and analyzing feedback to understand user behaviors, needs, and motivations.</li>\n<li><strong>Education:</strong> Bachelor’s degree in Engineering or an MBA from a Tier 1 institute.</li>\n<li><strong>Track Record:</strong> Proven track record of launching successful user-facing products.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "3-7 Years",
            "Product Management",
            "Data-Driven Decision Making",
            "Agile Product Development"
        ],
        "summary": "Seeking a Product Manager to drive product features from ideation to launch. Collaborate with cross-functional teams to enhance user experience and business growth."
    },
    {
        "job_title": "Event Parking - Operations Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25304",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Operations Executive - Event Parking</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Published:</strong> 21, Nov 2025\n<strong>Closes:</strong> 23, Nov 2025\n<strong>Contact:</strong> careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/operations-executive-event-parking</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions that redefine car ownership. Recognized by Bloomberg and ranked highly among fast-growing companies, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Operations Executive - Event Parking</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for an experienced Operations Executive specializing in Event Parking. The ideal candidate will have a background in Operations management and a proven ability in process optimization.</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Manage the day-to-day operations of the Event Parking vertical.</li>\n<li>Ensure overall operational efficiency and effectiveness.</li>\n<li>Oversee and enhance various operational processes.</li>\n<li>Coordinate with diverse teams and stakeholders to meet operational objectives.</li>\n<li>Deliver exceptional customer service to our clients.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>MBA in any discipline (Operations or Analytics preferred).</li>\n<li>Minimum 1-2 years of prior experience in a related field.</li>\n<li>Proficiency in Microsoft Excel and data set management.</li>\n<li>Strong attention to detail, with an ability to identify and rectify inconsistencies.</li>\n<li>A process-driven mindset, capable of suggesting improvements.</li>\n<li>A problem-solving approach with a commitment to ownership.</li>\n<li>Excellent communication skills for effective cross-team coordination.</li>\n<li>Flexibility to work evenings and weekends as required by business needs.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact on over 10 million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth paths within a rapidly scaling technology company.</li>\n<li>Competitive compensation package.</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Operations Management",
            "Process Optimization",
            "Excel"
        ],
        "summary": "Seeking an Operations Executive for Event Parking with 1-2 years of experience. Responsibilities include managing daily operations, ensuring efficiency, and process improvement."
    },
    {
        "job_title": "Sales Expert",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25303",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Location:</strong> Technopark Phase-III, Thiruvananthapuram\n<strong>Contact Email:</strong> careers@way.com\n<strong>Closing Date:</strong> 23, Nov 2025\n<strong>Job Published:</strong> 21, Nov 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with solutions for auto insurance, parking, EV charging, and more. We utilize AI, machine learning, and data analytics to offer innovative, personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, we are transforming the automotive experience.</p>\n<h3>Job Title: Sales Expert</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>Way.com is seeking dynamic, customer-focused Sales Experts for its Refinance Team. You will be the primary point of contact for customers, understanding their needs and guiding them to the best refinance solutions. This is a B2C sales role emphasizing communication, persuasion, and a passion for sales.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Engage with potential customers via inbound/outbound calls, emails, and chats.</li>\n<li>Clearly explain refinance products, features, and benefits.</li>\n<li>Build trust and rapport to convert inquiries into sales.</li>\n<li>Consistently achieve individual and team sales targets.</li>\n<li>Maintain accurate customer interaction records in CRM systems.</li>\n<li>Collaborate with Customer Support, Product, and Marketing teams for a seamless post-sale experience.</li>\n<li>Stay updated on product knowledge, process updates, and industry trends.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s or Master’s degree (preferably Business or Engineering).</li>\n<li>2–5 years of experience in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent English communication skills (verbal and written).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and experience with CRM tools.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Apply Now</h3>\n<p><a href=\"https://waydot.greythr.com/hire/jobs/sales-expert\">https://waydot.greythr.com/hire/jobs/sales-expert</a></p>",
        "tags": [
            "2-5 Years",
            "B2C Sales",
            "CRM",
            "Customer Acquisition"
        ],
        "summary": "Seeking B2C Sales Experts for Way.com's Refinance Team. Engage customers via calls/chats, explain products, and drive sales. Requires excellent communication and persuasion skills."
    },
    {
        "job_title": "Senior Marketing - Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25302",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Senior Marketing Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Trivandrum, India (4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583)\n<strong>Type:</strong> Full-time / Work From Office\n<strong>Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 23, Nov 2025\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/senior-marketing-designer</p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. Utilizing cutting-edge AI, machine learning, and advanced data analytics, we provide innovative, personalized solutions that redefine car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, Way.com is dedicated to making car ownership easier, more affordable, and rewarding.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a highly skilled Senior Marketing Designer to translate ideas into impactful visuals. This role involves designing high-performance campaigns, advertisements, and various visual assets for diverse platforms including paid media, social media, and email. The designer will collaborate closely with creative, growth, and product teams.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Create digital ad creatives, banners, and social media visuals for ongoing marketing campaigns.</li>\n<li>Conceptualize and design visuals for new product launches and seasonal promotions.</li>\n<li>Design visually appealing and clear marketing materials that drive performance.</li>\n<li>Collaborate effectively with copywriters, growth managers, and product designers.</li>\n<li>Ensure all designs adhere to Way.com’s established visual brand guidelines and tone.</li>\n<li>Explore the use of motion graphics and storytelling techniques to enhance user engagement.</li>\n</ul>\n<h3>Preferred Skills and Qualifications</h3>\n<ul>\n<li><strong>Experience:</strong> 3–5 years of experience in marketing design or growth design.</li>\n<li><strong>Software Proficiency:</strong> Expertise in Figma, Adobe Photoshop, Adobe Illustrator, and Adobe After Effects.</li>\n<li><strong>Design Skills:</strong> Strong understanding of layout principles, typography, and visual storytelling.</li>\n<li><strong>Marketing Acumen:</strong> Familiarity with digital marketing strategies and key advertising metrics.</li>\n<li><strong>Portfolio:</strong> A compelling portfolio showcasing creativity, attention to detail, and performance-driven design.</li>\n<li><strong>Attributes:</strong> Eagerness to learn, a collaborative spirit, and a desire to grow rapidly within a creative environment.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to contribute to the #1 Auto Super app in the US.</li>\n<li>Make a significant impact on the experience of over 10 million users.</li>\n<li>Be part of a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Receive competitive compensation for your contributions.</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "Figma",
            "Photoshop",
            "After Effects"
        ],
        "summary": "Seeking a Senior Marketing Designer for Way.com in Trivandrum. Responsibilities include creating high-impact visuals for campaigns across digital platforms, collaborating with teams, and driving user engagement."
    },
    {
        "job_title": "Lead Marketing - Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25301",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Lead Marketing Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/lead-marketing-designer\n<strong>Job Published:</strong> November 21, 2025\n<strong>Closing Date:</strong> November 23, 2025</p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers. We offer services including auto insurance, parking, and EV charging. Utilizing cutting-edge AI, machine learning, and advanced data analytics, Way.com delivers innovative, personalized solutions that transform car ownership. We've been recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide, and named the top Product in Insurance by UnitQ.</p>\n<h3>Role Overview</h3>\n<p>Way.com is seeking a <strong>Lead Marketing Designer</strong> to join our team. This is a hands-on creative leadership role responsible for translating strategy into impactful visuals and campaigns. You will guide the creative direction for digital marketing, brand campaigns, and performance ads, while managing a small design team and overseeing execution.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead and manage a team of marketing designers.</li>\n<li>Develop and execute creative strategy across paid, owned, and social channels.</li>\n<li>Drive campaign concepts for product launches, seasonal pushes, and partnerships.</li>\n<li>Maintain a consistent visual identity across Way.com’s global marketing ecosystem.</li>\n<li>Partner with Growth, Product, and Content teams to create high-performing visuals.</li>\n<li>Inspire creative excellence and mentor designers to elevate craft quality.</li>\n<li>Balance creativity with marketing performance and data-driven decisions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 6–10 years of experience in marketing design, art direction, or brand design.</li>\n<li><strong>Leadership:</strong> Proven experience leading creative or design teams.</li>\n<li><strong>Portfolio:</strong> Strong portfolio showcasing campaign systems, digital storytelling, and ad design.</li>\n<li><strong>Software Proficiency:</strong> Expertise in Figma, Photoshop, Illustrator, After Effects / Premiere Pro.</li>\n<li><strong>Performance Marketing:</strong> Experience in performance design and knowledge of CTR, engagement metrics, and creative testing.</li>\n<li><strong>Design Skills:</strong> Strong visual storytelling and typography skills.</li>\n<li><strong>Aesthetic:</strong> A passion for clean, modern, and conversion-friendly design.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "6-10 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Lead Marketing Designer needed to guide creative strategy and execution for campaigns. Requires 6-10 years experience, team leadership, and proficiency in design software."
    },
    {
        "job_title": "Team Lead - SEO",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25300",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Team Lead - SEO</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact:</strong> careers@way.com\n<strong>Website:</strong> http://www.way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead</p>\n<p><strong>About Us:</strong>\nWay.com is America's dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Featured by Bloomberg and ranked among the fastest-growing companies worldwide, Way.com is making car ownership easier, more affordable, and rewarding.</p>\n<p><strong>Job Title:</strong> Team Lead - SEO\n<strong>Experience Required:</strong> 9 - 11 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Closing Date:</strong> November 23, 2025\n<strong>Job Published:</strong> November 21, 2025</p>\n<h2>Role Overview:</h2>\n<p>We are seeking a highly skilled Team Lead, SEO to lead our organic growth initiatives and enhance our search engine presence. This leadership role involves developing and executing comprehensive SEO strategies, managing a team of SEO specialists, and collaborating cross-functionally to optimize our digital footprint. The ideal candidate possesses a deep understanding of search algorithms, technical SEO, content strategy, and a passion for driving results.</p>\n<h2>Key Responsibilities:</h2>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies:</strong> Define and implement a robust SEO roadmap aligned with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team:</strong> Manage a team of SEO professionals, fostering continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO:</strong> Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management:</strong> Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making:</strong> Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration:</strong> Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization:</strong> Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis:</strong> Conduct SEO audits, monitor competitor strategies, and identify new opportunities.</li>\n<li><strong>SEO Performance Reporting:</strong> Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data for data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h2>Preferred Qualifications:</h2>\n<ul>\n<li>Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li>Understanding of PPC advertising and its relationship with organic search.</li>\n<li>Experience working in a high-growth startup or fast-paced environment.</li>\n<li>Familiarity with social media marketing and its impact on SEO.</li>\n<li>Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h2>Why You Will Love Working With Us:</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "9-11 Years",
            "SEO",
            "Technical SEO",
            "SEMrush"
        ],
        "summary": "Lead SEO strategies and team for Way.com, America's automotive super app. Requires 9-11 years experience with expertise in technical SEO and data analysis."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25299",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Manager - Project</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/project-manager\n<strong>Closing Date:</strong> November 23, 2025\n<strong>Job Published:</strong> November 21, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers with services including auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and named the top Product in Insurance by UnitQ, Way.com makes car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Project Manager</h3>\n<p><strong>Experience:</strong> 8+ years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a seasoned Project Manager with over 8 years of experience to lead strategic projects from initiation through completion. The ideal candidate will possess strong leadership, domain expertise, and hands-on execution skills to ensure successful project delivery within scope, timeline, and budget.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead the full project lifecycle across multiple medium to large-scale initiatives.</li>\n<li>Define and manage project scope, objectives, deliverables, and success criteria.</li>\n<li>Develop and execute detailed project plans, including resource allocation, timelines, and budgets.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate when required.</li>\n<li>Manage stakeholder relationships, ensuring clear communication and alignment at all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams to ensure smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes and policies.</li>\n<li>Mentor and guide junior team members to build project management capability within the team.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Business Administration, or related field (Master’s degree is an advantage).</li>\n<li>8+ years of proven project management experience, preferably in a fintech platform.</li>\n<li>Strong expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in project management tools (MS Project, JIRA, Asana, Trello, or similar).</li>\n<li>In-depth knowledge of Agile, Waterfall, or hybrid project management methodologies.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities under pressure.</li>\n<li>Certifications such as PMP, PRINCE2, or Agile (Scrum Master/SAFe) are highly preferred.</li>\n<li>Experience with tools like MPP, etc.</li>\n<li>Ability to work with multiple teams, driving for execution and results.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "8+ Years",
            "Agile",
            "PMP",
            "Fintech"
        ],
        "summary": "Seasoned Project Manager needed with 8+ years experience to lead strategic initiatives. Must excel in Agile/Waterfall methodologies and stakeholder management for a leading auto super app."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25298",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Customer Success Executive at Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Job Published:</strong> 21, Nov 2025\n<strong>Closing Date:</strong> 23, Nov 2025</p>\n<p><strong>About Us:</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide innovative, personalized solutions. Recognized by Bloomberg and Andreessen Horowitz, we aim to make car ownership easier, affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Customer Success Executive\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview:</strong>\nWe are seeking a dynamic, customer-focused individual for our voice process team as a Customer Success Executive. This role requires delivering excellent customer service and professionally handling phone inquiries.</p>\n<p><strong>Key Responsibilities:</strong>\n- Address customer queries via phone, email, chat, and social media.\n- Troubleshoot and resolve customer concerns efficiently.\n- Handle inquiries about products, orders, returns, and general support.\n- Maintain accurate customer records and feedback in the CRM system.\n- Escalate complex issues to appropriate internal teams.\n- Track customer satisfaction metrics and suggest improvements.\n- Ensure all interactions are professional, empathetic, and customer-first.</p>\n<p><strong>Preferred Skills:</strong>\n- <strong>Experience:</strong> 2-5 years in customer service or a similar role.\n- Excellent verbal and written communication skills.\n- Ability to remain calm under pressure and handle difficult situations professionally.\n- Strong problem-solving abilities with keen attention to detail.\n- Knowledge of CRM systems (preferred).\n- Positive attitude and passion for helping others.\n- Ability to work effectively in a team.</p>\n<p><strong>Why You Will Love Working with Us:</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Make a meaningful impact across 10+ million users.\n- Experience a dynamic, fast-paced, and innovation-driven work culture.\n- Clear career growth pathways in a rapidly scaling tech company.\n- Competitive compensation.</p>\n<p><strong>Apply Now:</strong>\nhttps://waydot.greythr.com/hire/jobs/customer-success-executive</p>",
        "tags": [
            "2-5 Years",
            "Customer Service",
            "Communication Skills",
            "Problem Solving"
        ],
        "summary": "Customer Success Executive for Way.com's voice process. Responsibilities include handling customer queries, troubleshooting issues, and maintaining records. Requires 2-5 years of experience."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25297",
        "location": "Technopark",
        "closing_date": "23 Nov 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd / Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\n<strong>Closing Date:</strong> November 23, 2025\n<strong>Job Published:</strong> November 21, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, Way.com is transforming the automotive experience.</p>\n<h3>Job Title: Spanish Customer Success Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a Spanish Customer Success Executive in our voice process. This role involves delivering excellent customer service to our Spanish-speaking clients and professionally and efficiently handling inquiries over the phone.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction:</strong> Manage inbound and outbound calls, providing prompt and effective resolutions to customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence:</strong> Deliver empathetic, professional support to ensure a positive customer experience in every interaction.</li>\n<li><strong>Issue Escalation:</strong> Identify, prioritize, and escalate complex cases to the appropriate departments for swift resolution.</li>\n<li><strong>Documentation:</strong> Maintain accurate records of customer interactions and keep databases up to date.</li>\n<li><strong>Performance Goals:</strong> Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge:</strong> Stay informed on company products and services to provide customers with accurate and up-to-date information.</li>\n<li><strong>Team Collaboration:</strong> Work closely with colleagues to foster a supportive, collaborative, and high-performing work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Bilingual Fluency:</strong> Fluent in both Spanish and English (written and spoken) for effective communication.</li>\n<li><strong>Customer Service Experience:</strong> Proven experience in a customer service role, preferably in a voice process.</li>\n<li><strong>Communication Skills:</strong> Strong interpersonal and communication skills, with a patient and empathetic approach.</li>\n<li><strong>Time Management:</strong> Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li><strong>Industry Familiarity (Advantage):</strong> Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li><strong>Flexibility:</strong> Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Spanish",
            "Customer Service",
            "Voice Process"
        ],
        "summary": "Seeking a Spanish Customer Success Executive for a voice process role. Responsibilities include managing customer interactions, providing service excellence, and issue resolution."
    },
    {
        "job_title": "Sr Preproduction Artist",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/25296",
        "location": "Technopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Sr. Preproduction Artist</h2>\n<p><strong>Company:</strong> Prayan Animation Studio (P) Ltd.\n<strong>Location:</strong> E-12, Tejaswini-1, Technopark, Trivandrum, Kerala, India, 695 581\n<strong>Website:</strong> http://www.prayananimation.com\n<strong>Contact Email:</strong> jobs@prayananimation.com</p>\n<p><strong>Closing Date:</strong> 30, Nov 2025\n<strong>Job Published:</strong> 21, Nov 2025</p>\n<h3>Job Overview:</h3>\n<p>The Sr. Preproduction Artist will be responsible for visualizing scripts and transforming concepts into clear, engaging storyboards that support the overall vision of our 2D animation projects. The ideal candidate will have exceptional drawing skills, a deep understanding of animation principles, and at least 10+ years of professional experience in the animation industry.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Create detailed storyboards that clearly convey narrative, emotion, timing, and camera language.</li>\n<li>Develop polished animatics with accurate timing, pacing, and continuity for production.</li>\n<li>Design original characters, including model sheets, poses, expressions, and turnarounds.</li>\n<li>Visualize scripts and concepts creatively while maintaining consistency with the project’s style and director’s vision.</li>\n<li>Collaborate closely with directors, writers, and the production team to refine storytelling.</li>\n<li>Ensure all pre-production deliverables meet quality standards and project timelines.</li>\n<li>Participate in creative discussions, offer visual solutions, and adapt to feedback quickly.</li>\n<li>Prepare production-ready files and maintain organized documentation.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>10+ years of experience in storyboarding, animatic, and character design for animation.</li>\n<li>Strong drawing skills with an excellent understanding of anatomy, proportion, perspectives, and acting.</li>\n<li>Proficiency in storyboard and animatic tools such as Adobe Animate, Photoshop, or equivalent.</li>\n<li>Solid grasp of cinematic storytelling, shot composition, timing, and staging.</li>\n<li>Ability to design appealing and original characters in varied styles.</li>\n<li>Strong sense of storytelling, rhythm, and visual clarity.</li>\n<li>Ability to work under tight deadlines and handle multiple projects.</li>\n<li>Strong communication and collaboration skills.</li>\n</ul>\n<h3>Job Details:</h3>\n<ul>\n<li><strong>Job Type:</strong> Full-time</li>\n<li><strong>Schedule:</strong> Day shift</li>\n<li><strong>Commute/Relocation:</strong> Must be able to reliably commute or plan to relocate to Trivandrum, Kerala before starting work.</li>\n<li><strong>Expected Start Date:</strong> Immediate Joining</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>To apply, please submit your resume and a link of your online portfolio highlighting your best work to <strong>jobs@prayananimation.com</strong>. Please use the email subject: \"Resume – Sr Pre Production Artist\".</p>",
        "tags": [
            "10+ Years",
            "Storyboarding",
            "Character Design",
            "Animation Principles"
        ],
        "summary": "Seeking a Sr. Preproduction Artist with 10+ years of experience for 2D animation. Responsibilities include storyboarding, character design, and collaborating with the production team."
    }
]