[
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20263/312",
        "location": "Infopark",
        "closing_date": "09 Sep 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p>We are seeking a highly motivated and results-oriented <strong>Senior Business Development Executive</strong> to join our team at 2Base Technologies.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Identify and generate qualified leads through outbound channels, referrals, and market research.</li>\n<li>Drive new business opportunities for web, mobile, and enterprise software development services.</li>\n<li>Manage the complete sales cycle, including lead qualification, client communication, requirement analysis, proposal preparation, pricing, negotiation, and closure.</li>\n<li>Understand client needs and propose tailored IT and digital transformation solutions that align with business objectives.</li>\n<li>Build and maintain strong relationships with key decision-makers (Founders, CXOs, Product Owners).</li>\n<li>Collaborate with delivery, design, and marketing teams to craft compelling proposals and client presentations.</li>\n<li>Maintain accurate records of all sales activities in CRM tools and provide regular sales forecasts and reports.</li>\n<li>Represent the company at networking events, industry meetups, and client meetings to enhance visibility and build trust.</li>\n<li>Meet or exceed monthly and quarterly revenue targets consistently.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree or a combination of relevant education, training, and experience.</li>\n<li>2 - 5 years of experience in B2B sales within the IT services or digital solutions industry.</li>\n<li>Proven ability to independently manage the sales pipeline and close deals.</li>\n<li>Strong understanding of software development services, including web and mobile applications, SaaS, and enterprise solutions.</li>\n<li>Experience working with international clients is preferred.</li>\n<li>Familiarity with CRM systems (Zoho, HubSpot, Salesforce) and outbound sales tools like LinkedIn Sales Navigator.</li>\n<li>Excellent communication, presentation, and negotiation skills.</li>\n<li>Ability to work independently with minimal supervision and take complete ownership of sales targets.</li>\n<li>Strategic thinker with the ability to understand client pain points and position appropriate solutions.</li>\n</ul>\n<p><strong>Experience and Education</strong></p>\n<ul>\n<li>2 - 5 years of relevant experience in sales or business development.</li>\n<li>Bachelor’s degree or BSc. IT or CS / BCA / B-Tech IT, CS or EC, MBA, Diploma in CS / IT.</li>\n<li>Additional certifications in sales, digital marketing, or business consulting will be a plus.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@2basetechnologies.com</p>",
        "tags": [
            "2-5 Years",
            "B2B Sales",
            "CRM",
            "Software Development"
        ],
        "summary": "Seeking a Senior Business Development Executive to drive revenue through IT services and digital solutions. The role involves lead generation, client relationship management, and sales process ownership."
    },
    {
        "job_title": "Content Writer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20264/312",
        "location": "Infopark",
        "closing_date": "09 Sep 2025",
        "job_description": "<h2>Content Writer</h2>\n<p>We are seeking a passionate and skilled Content Writer to join our team. In this role, you will help convey complex technical concepts in a clear, concise, and engaging manner. As a Technical Content Writer, you will be responsible for creating, editing, and maintaining high-quality content that supports our products and services. You will work closely with developers, product managers, and the marketing team to produce content that meets the needs of our target audience.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop, write, and maintain high-quality technical documentation, including user manuals, API documentation, product descriptions, websites contents, whitepapers, case studies, and technical guides using tools like Confluence and MadCap Flare.</li>\n<li>Collaborate with product managers and developers to ensure accurate and clear documentation for both technical and non-technical audiences.</li>\n<li>Simplify and distill complex technical concepts into accessible content.</li>\n<li>Utilize AI-driven tools like ChatGPT to assist in content creation, idea generation, and ensuring content quality.</li>\n<li>Conduct research on industry trends and emerging technologies to create relevant and insightful content.</li>\n<li>Edit and proofread documentation using tools like Grammarly and Hemingway to ensure high standards of quality.</li>\n<li>Optimize content for SEO with the help of tools like Google Analytics, SEMrush, and Ahrefs.</li>\n<li>Oversee the organization and accessibility of the content library using CMS platforms such as WordPress and Drupal.</li>\n<li>Stay updated with industry trends, technology advancements, and the competitive landscape to produce relevant content.</li>\n<li>Proofread and edit content produced by other team members to ensure consistency in style, tone, and quality.</li>\n<li>Optimize content for SEO to increase visibility and engagement on digital platforms.</li>\n<li>Manage and maintain the content library, ensuring all documentation is up-to-date and easily accessible.</li>\n<li>Assist in the development of content strategies that align with company goals.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>1-2 years of experience in technical content writing, preferably in the technology or IT services industry(B2B).</li>\n<li>Strong writing, editing, and proofreading skills.</li>\n<li>Basic understanding of SEO principles and content optimization techniques.</li>\n<li>Ability to research and write on a variety of topics.</li>\n<li>Strong attention to detail and ability to meet deadlines.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Strong knowledge of technical writing best practices, standards, and guidelines.</li>\n<li>Strong collaboration skills with the ability to work effectively across cross-functional teams.</li>\n<li>Comfortable seeking information from subject matter experts and capable of adapting to changing project requirements.</li>\n<li>Ability to manage multiple projects concurrently and stay updated on new trends and new technologies.</li>\n<li>Familiarity with keyword placement and SEO</li>\n</ul>\n<p><strong>Experience &amp; Education</strong></p>\n<ul>\n<li>1-4 years</li>\n<li>Bachelor's degree in English, Communications, Computer Science, or a related field.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@2basetechnologies.com</p>",
        "tags": [
            "1-4 Years",
            "Technical Content Writing",
            "SEO",
            "Content Creation"
        ],
        "summary": "We are looking for a Content Writer to help convey complex technical concepts. They will create, edit, and maintain high-quality content."
    },
    {
        "job_title": "Project Manager",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20265/312",
        "location": "Infopark",
        "closing_date": "09 Sep 2025",
        "job_description": "<h2>Associate Project Manager</h2>\n<p>We are looking for a dynamic and detail-oriented Associate Project Manager to join our team at 2Base Technologies. In this role, you will be responsible for assisting in the planning, execution, and successful delivery of projects while ensuring seamless coordination between teams and stakeholders. If you have a passion for technology, strong organizational skills, and the ability to manage multiple projects effectively, we’d love to hear from you!</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Develop and manage project plans, including timelines, budgets, and resource allocations.</li>\n<li>Define project scope, objectives, and deliverables in collaboration with stakeholders.</li>\n<li>Ensure that projects are delivered on time, within scope, and within budget while adhering to company policies, procedures, and quality standards.</li>\n<li>Identify and manage project risks, issues, and dependencies, implementing mitigation strategies as needed.</li>\n<li>Facilitate and document project meetings, including kick-off meetings, status updates, and post-project evaluations, ensuring follow-ups are tracked.</li>\n<li>Communicate project progress, challenges, and key updates to stakeholders, maintaining strong relationships with customers, vendors, and business partners.</li>\n<li>Mentor and oversee team members, ensuring their professional growth, training, and on-the-job delivery.</li>\n<li>Oversee and guide project teams, including internal staff, external vendors, and contractors, ensuring effective resource utilization.</li>\n<li>Govern development, design, integration, and testing activities, ensuring best practices are followed.</li>\n<li>Evaluate and optimize workflows, making recommendations for process improvements to enhance efficiency and delivery.</li>\n<li>Coordinate cross-functional collaboration to ensure seamless integration of different project components.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Bachelor’s degree or combination of relevant education, training, and experience.</li>\n<li>4- 6 years coordinating or managing projects in the IT industry.</li>\n<li>Project Management Professional (PMP) certification preferred</li>\n<li>Experience with Web &amp; Mobile projects is an added advantage.</li>\n<li>Experience working with an agile software development team.</li>\n<li>Strong proofreading/grammar skills for technical documents.</li>\n<li>Team player with strong interpersonal skills who values communication, collaboration ,and coordination.</li>\n<li>Proven success as a problem-solver possesses a data-driven yet common sense approach to execution.</li>\n<li>Excellent organizational and time management skills.</li>\n<li>Ability to work independently with minimal supervision.</li>\n<li>Ability to learn and utilize new software as required.</li>\n</ul>\n<p><strong>Experience and Education</strong></p>\n<ul>\n<li>4- 6 years</li>\n<li>Bachelor’s degree or BSc. IT or CS / BCA / B-Tech IT, CS or EC, MBA, Diploma in CS / IT.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@2basetechnologies.com</p>",
        "tags": [
            "4-6 Years",
            "Project Management",
            "Agile",
            "Stakeholder Management"
        ],
        "summary": "2Base Technologies is seeking an Associate Project Manager to assist in project planning and execution. The ideal candidate will have 4-6 years of IT project management experience."
    },
    {
        "job_title": "HR Executive",
        "company": "Senscript Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20278/347",
        "location": "Infopark",
        "closing_date": "09 Sep 2025",
        "job_description": "<h2>HR Executive</h2>\n<p><strong>Location:</strong> Kochi</p>\n<p><strong>Experience Required:</strong> Minimum 2 years</p>\n<p><strong>Availability:</strong> Immediate Joiner</p>\n<h3>About the Role</h3>\n<p>We are looking for a proactive and detail-oriented HR Executive to join our team in Kochi. The ideal candidate will have at least 2 years of hands-on experience in HR operations, recruitment, and employee engagement. You will play a key role in supporting HR functions, ensuring smooth processes, and enhancing the employee experience.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Maintain employee records and update HR databases regularly.</li>\n<li>Assist in payroll preparation and leave management.</li>\n<li>Support performance management processes and probation confirmations.</li>\n<li>Handle employee queries and provide support on HR policies.</li>\n<li>Assist in planning and executing employee engagement activities.</li>\n<li>Ensure compliance with company policies and labor laws.</li>\n<li>Coordinate training and development programs.</li>\n<li>Prepare HR reports and assist in audits as required.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Bachelor’s/Master’s degree in Human Resource Management, Business Administration, or related field.</li>\n<li>Minimum 2 years of experience as HR Executive or in a similar HR role.</li>\n<li>Strong knowledge of recruitment processes, HR operations.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Proficiency in MS Office (Word, Excel, PowerPoint).</li>\n<li>Ability to work independently and handle confidential information.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at Careers@senscript.ai</p>",
        "tags": [
            "2+ Years",
            "Recruitment",
            "HR Operations",
            "Employee Engagement"
        ],
        "summary": "Seeking a detail-oriented HR Executive for our Kochi team. The role involves HR operations, recruitment, employee engagement, and supporting HR functions."
    },
    {
        "job_title": "Android Developer (3 yrs of experience)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20269/157",
        "location": "Infopark",
        "closing_date": "10 Sep 2025",
        "job_description": "<h2>Android Developer</h2>\n<p>Tranzmeo is looking for Android Developers to join our distributed, multifunctional team. If you enjoy working on apps, AI, and ML applications, we would love to hear from you.</p>\n<p>We hire for culture, passion, and the ability to learn quickly. You’ll do well here if you are passionate about quality and craftsmanship and are self-driven.</p>\n<p><strong>No. of Openings</strong> - 1</p>\n<p><strong>What we are looking for in you:</strong></p>\n<ul>\n<li>Minimum 1-3 years of experience</li>\n<li>Bachelor's degree in computer science or IT</li>\n<li>Must have good analytical and problem-solving skills</li>\n<li>Ability to work independently</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>IDE – Android Studio</li>\n<li>Programming Language – Java</li>\n<li>Good at using git</li>\n<li>UI – Linear, Relative, Constraints layout, etc.</li>\n<li>Good knowledge of Kotlin</li>\n<li>Design Patterns – MVP, MVVM, etc.</li>\n<li>Client-server communication</li>\n<li>Local data storage</li>\n<li>Knowledge of unit test cases resolves crashes and memory-related issues</li>\n<li>Aware of app store build release process</li>\n<li>Understanding of app performance memory footprint optimization knows how to write unit test cases</li>\n<li>Knows Manual Memory Management Rules.</li>\n<li>Knows how to debug and resolve crashes, exceptions, etc.</li>\n<li>Aware of the app store build release process.</li>\n</ul>\n<p><strong>Roles &amp; Responsibilities:</strong></p>\n<ul>\n<li>Design, build, ship, and maintain mobile apps on the Android platform.</li>\n<li>Work with the team to design new product features.</li>\n<li>Help maintain code quality and review others’ code.</li>\n<li>Proactively address performance issues and bugs.</li>\n<li>Raise your own and the team's skill level every day by growing and learning.</li>\n<li>Use available project management and communication.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "1-3 Years",
            "Android Studio",
            "Kotlin",
            "Java"
        ],
        "summary": "Tranzmeo is seeking an Android Developer to design, build, and maintain mobile apps. The ideal candidate will have 1-3 years of experience and be proficient in Java and Kotlin."
    },
    {
        "job_title": "Data Science Intern",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20270/157",
        "location": "Infopark",
        "closing_date": "10 Sep 2025",
        "job_description": "<h2>Data Science Intern</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Explain the predictive models to various business users and make recommendations to drive business strategy.</li>\n<li>Make recommendations to resolve application performance problems.</li>\n<li>Implement data processing methods and tools.</li>\n<li>Collaborate with product leaders, subject matter experts, and decision-makers to develop success criteria and optimize new products, features, policies, and models.</li>\n<li>Leverage your experience in analytics tools and scientific rigor to produce actionable insights.</li>\n<li>Distill and communicate key insights to senior management in verbal, visual, and written media.</li>\n<li>Together with the Co-op department lead, determine an appropriate data science problem statement and toolset to apply during the co-op term.</li>\n<li>Determine strengths and weaknesses of data science toolsets and procedures.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Knowledge of Machine Learning concepts (cross-validation, regularization, boosting, bootstrapping) is a plus.</li>\n<li>Working on a degree in Computer Science, or a related field, with project experience in data analysis.</li>\n<li>Experience with big data technologies (Hadoop, Hive, MongoDB, Spark).</li>\n<li>Experience with statistical analysis and data mining using tools such as R, SAS, Matlab, Stata, or SPSS.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0 Years",
            "Machine Learning",
            "Data Analysis",
            "Big Data"
        ],
        "summary": "Seeking a Data Science Intern to implement data processing methods and leverage analytics for actionable insights. The role involves collaborating with experts and communicating insights to senior management."
    },
    {
        "job_title": "Technical Lead- Data Science & Machine Learning",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20274/157",
        "location": "Infopark",
        "closing_date": "10 Sep 2025",
        "job_description": "<h2>Technical Lead - Data Science &amp; Machine Learning</h2>\n<p>Tranzmeo, an innovative leader in the fiber optic sensing industry, is seeking a passionate and experienced Technical Lead to head our Data Science &amp; Machine Learning initiatives. We are dedicated to developing cutting-edge solutions that optimize pipeline monitoring, well monitoring, railway, aerospace, defense, and other applications. We harness the power of AI, ML, and Big Data to push the boundaries of sensing technology and provide real-time insights that matter.</p>\n<p><strong>What You'll Do:</strong></p>\n<ul>\n<li>Lead the design, development, and deployment of scalable Al/ML models tailored to fiber optic sensing data.</li>\n<li>Architect Big Data solutions for processing vast amounts of sensing data in real-time.</li>\n<li>Collaborate with product teams, sensor engineers, and stakeholders on innovative projects.</li>\n<li>Mentor and manage a talented team of data scientists and engineers.</li>\n<li>Ensure data quality, model performance, and security standards.</li>\n<li>Stay ahead of developments in AI/ML and fiber optic sensing fields to foster innovation.</li>\n</ul>\n<p><strong>What We're Looking For:</strong></p>\n<ul>\n<li>B.Tech in Computer Science, Data Science, or related fields</li>\n<li>6+ years of experience in data science, machine learning, and Big Data, preferably in the sensing or telecom sectors</li>\n<li>Proven leadership and team management skills</li>\n<li>Strong programming skills (Python)</li>\n<li>Experience with cloud platforms (AWS, GCP, Azure)</li>\n<li>Hands-on experience with ML frameworks (TensorFlow, PyTorch, scikit-learn)</li>\n<li>Skilled in Big Data tools (Hadoop, Spark, Kafka, Airflow)</li>\n<li>Good understanding of fiber optic sensing technologies and data characteristics is a plus</li>\n<li>Excellent problem-solving, communication, and collaboration skills</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Work on innovative sensing technology projects with real-world impact</li>\n<li>Lead the AI and ML strategies in a pioneering industry</li>\n<li>Dynamic and growth-oriented work environment</li>\n<li>Opportunity to shape the future of fiber optic sensing solutions</li>\n</ul>\n<p><strong>Job Details</strong></p>\n<ul>\n<li>Employment: Full-time</li>\n<li>Industry: Software Development</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tranzmeo.com</p>",
        "tags": [
            "6+ Years",
            "Machine Learning",
            "Big Data",
            "Python"
        ],
        "summary": "Tranzmeo is hiring a Technical Lead for Data Science & Machine Learning to lead AI/ML initiatives. The role involves designing and deploying AI/ML models and managing a team."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "Inspite Technologies Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/20257/442",
        "location": "Infopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Digital Marketing Executive</h2>\n<p>We are seeking a results-driven and strategic Digital Marketing Executive to lead and manage digital marketing campaigns for our in-house and client projects. The ideal candidate should have a strong grasp of current marketing tools, ad platforms, analytics, and SEO practices, with the ability to execute campaigns that drive measurable results across web, social, and search channels.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Plan, launch, and manage digital advertising campaigns across Google Ads, Facebook/Instagram Ads, and other platforms.</li>\n<li>Execute and optimize SEO strategies, including keyword research, content optimization, and link-building activities.</li>\n<li>Manage and schedule engaging content across social media platforms (Instagram, Facebook, LinkedIn, YouTube).</li>\n<li>Develop and execute email marketing and WhatsApp marketing campaigns for lead generation and audience engagement.</li>\n<li>Monitor and analyze performance using tools like Google Analytics, Google Search Console, Meta Business Suite, and ad dashboards.</li>\n<li>Generate performance reports, interpret data, and suggest campaign improvements based on insights.</li>\n<li>Collaborate with design and development teams to ensure content and creatives align with campaign goals and branding.</li>\n<li>Stay updated with the latest trends in digital marketing, algorithm changes, and platform-specific best practices.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Proven experience in planning and executing paid campaigns on Google and Meta platforms.</li>\n<li>Strong knowledge of SEO techniques (on-page &amp; off-page) and keyword research tools.</li>\n<li>Familiarity with social media content strategies, trends, and performance analytics.</li>\n<li>Proficiency in tools such as: Google Ads, Meta Ads Manager, Google Analytics, Google Tag Manager</li>\n<li>SEO tools: Google Search Console, Ahrefs, SEMrush, or Moz</li>\n<li>Email/WhatsApp marketing tools</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Strong organizational skills and ability to manage multiple campaigns simultaneously.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Minimum 1 year of hands-on experience in digital marketing.</li>\n<li>Google Ads / Meta Blueprint certification (preferred, not mandatory).</li>\n<li>Experience with marketing automation platforms or CRM tools.</li>\n<li>Basic understanding of WordPress or CMS tools is an advantage.</li>\n<li>Ability to work in a fast-paced environment and manage client expectations.</li>\n</ul>\n<p><strong>Employment Details:</strong></p>\n<ul>\n<li>Type: Full-time</li>\n<li>Location: Inspite Technologies Pvt. Ltd., Infopark, Kochi</li>\n<li>Experience: 0 - 1 year preferred</li>\n<li>Working Mode: Onsite</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates may send their resume and portfolio (if available) to hr@inspitetech.com\nSubject Line: Application – Digital Marketing Executive</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@inspitetech.com</p>",
        "tags": [
            "0-1 Year",
            "Google Ads",
            "Meta Ads Manager",
            "SEO"
        ],
        "summary": "Inspite Technologies is hiring a Digital Marketing Executive to manage digital campaigns and optimize SEO strategies. The role involves using tools like Google Analytics and Meta Ads Manager."
    },
    {
        "job_title": "AI/ML – Team Lead",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20279/85",
        "location": "Infopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>AI/ML - Team Lead</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nTechversant is seeking a highly skilled and experienced AI/ML Lead to lead the design and implementation of our artificial intelligence and machine learning solutions. The successful candidate will work closely with cross-functional teams to understand business requirements and develop scalable, efficient, and robust AI/ML systems.</p>\n<p><strong>Job Description</strong></p>\n<ul>\n<li>As an AI/ML Lead, you will need to build Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and generative models.</li>\n<li>Define, design, and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Create demos and proofs of concept, develop AI/ML based products and services.</li>\n<li>Creating Functional and technical specifications for AI &amp; ML solutions.</li>\n<li>Follow SDLC process</li>\n<li>Advanced analytical knowledge of data and data conditioning</li>\n<li>Programming advanced computing and developing algorithms</li>\n<li>Developing software, data models and executing predictive analysis</li>\n<li>Design, develop, and implement generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements and develop innovative solutions.</li>\n<li>Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).</li>\n<li>Strong proficiency in SQL, NO SQL Databases.</li>\n<li>Experience in implementing and deploying AI\\ Machine Learning solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)</li>\n<li>Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.</li>\n<li>Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g. Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</li>\n</ul>\n<p><strong>What will make you stand out</strong></p>\n<ul>\n<li>Experience in production software engineering routines in DevOps/MLOps (e.g. Continuous Code Integration and Deployment).</li>\n<li>Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</li>\n</ul>\n<p><strong>Experience and Qualification:</strong></p>\n<ul>\n<li>B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "5+ Years",
            "Python",
            "AI/ML",
            "Deep Learning"
        ],
        "summary": "Techversant is looking for an AI/ML Team Lead to design and implement AI/ML solutions, working with cross-functional teams. The role involves developing scalable AI/ML systems and requires strong Python skills."
    },
    {
        "job_title": "Python Solution Architect",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20280/85",
        "location": "Infopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Python Solution Architect</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption. We offer expertise and consultation in multiple technology domains.</p>\n<p><strong>What’s important to us:</strong>\nTechversant is seeking an experienced Solution Architect to design and implement scalable, high-performance AI-driven applications using the latest technologies in Python, cloud, and machine learning. The ideal candidate will have a strong background in Python development, excellent leadership skills, and a passion for mentoring and guiding team members.</p>\n<p><strong>Job Responsibilities</strong>\n- Architect and design end-to-end solutions using Python (Django/FastAPI/Flask), AI/ML models, and cloud-native technologies.\n- Lead AI/ML-driven application development, including model deployment, data pipelines, and intelligent automation.\n- Collaborate with data scientists, engineers, and product teams to integrate AI/ML models into scalable applications.\n- Optimize system performance, ensuring scalability, cost efficiency, and security.\n- Implement microservices architecture with APIs, containerization (Docker/Kubernetes), and event-driven design.\n- Drive best DevOps practices with CI/CD pipelines, MLOps, Infrastructure as Code (Terraform, CloudFormation), and automated testing.</p>\n<p><strong>Preferred Skills</strong>\n- Python &amp; Full Stack: Django, FastAPI, Flask, React, Angular, or Vue.js.\n- AI/ML &amp; Data Science: TensorFlow, PyTorch, Scikit-learn, NLP, Computer Vision, or MLOps.\n- Cloud &amp; DevOps: AWS, Azure, or GCP with Kubernetes &amp; CI/CD.\n- Big Data &amp; Databases: PostgreSQL, MongoDB, Redis, Snowflake, or Spark.\n- Architecture &amp; Security: Microservices, API Gateway, Event-Driven Systems, and best security practices.</p>\n<p><strong>Ideal Experience Level:</strong>\n- 10+ years in software development with strong Python expertise, including full-stack development.\n- 2+ years of experience as a Solution Architect, with demonstrated success in leading and delivering enterprise-level projects.\n- Strong AI/ML experience, specifically in model deployment, data engineering, and cloud integration</p>\n<p><strong>Nice-to-Have Skills:</strong>\n- Hands-on experience with LLMs, Generative AI, or Reinforcement Learning.\n- Expertise in GraphQL, Serverless (AWS Lambda, Firebase), and Edge AI.\n- Experience with data engineering, real-time analytics, and feature stores.</p>\n<p><strong>What Company Offers:</strong>\nExcellent career growth opportunities and exposure to multiple technologies. Fixed weekday day schedule, Family Medical Insurance, Unique leave benefits and encashment options, Long term growth opportunities, Fun family environment, Various internal employee rewards programs, Opportunities for various other Bonus programs, Work life Balance, Company Sponsored International Tours.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "10+ Years",
            "Python",
            "AI/ML",
            "Cloud"
        ],
        "summary": "Techversant is looking for a Python Solution Architect to design and implement AI-driven applications. The role involves leading AI/ML development, optimizing system performance, and ensuring scalability."
    },
    {
        "job_title": "AI/ML – Architect",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20281/85",
        "location": "Infopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>AI/ML – Architect</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption. They offer expertise and consultation in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nWe are looking for a visionary yet hands-on AI Solution Architect who thrives at the intersection of technology, business, and innovation. This is a client-facing leadership role for someone who can conceptualize, design, and deliver robust AI-driven applications while staying ahead of the curve with emerging AI trends and technologies.</p>\n<p>You will be responsible for the entire lifecycle of AI solution development – from client discussions and requirements analysis to architecture design, algorithm selection, solution development, team guidance, and successful delivery.</p>\n<p><strong>Key Responsibilities:</strong>\n- <strong>Client Engagement &amp; Consulting</strong>\n    - Interact directly with clients and stakeholders to understand complex business problems.\n    - Translate business needs into AI/ML opportunities and articulate solution strategies clearly.\n    - Present solution architectures, effort estimates, timelines, and potential ROI.\n- <strong>Solution Design &amp; Architecture</strong>\n    - Define end-to-end AI architecture including data pipelines, model selection, AI engines, integration layers, APIs, and deployment strategies.\n    - Make informed choices of AI/ML/DL algorithms, frameworks, and platforms based on problem type and constraints.\n    - Ensure the architecture is scalable, modular, secure, and optimized for performance.\n- <strong>Hands-On Development</strong>\n    - Develop critical components or proof-of-concepts when needed.\n    - Perform hands-on design and coding for pipelines, model training, inferencing, or integrations.\n    - Create reusable components and automation scripts for repeatability.\n- <strong>Team Leadership &amp; Delivery Oversight</strong>\n    - Build and mentor a high-performing AI development team.\n    - Drive agile development cycles, ensuring timely and quality delivery.\n    - Collaborate with DevOps, Product Managers, and QA teams throughout SDLC.</p>\n<p><strong>Must-Have Skills:</strong>\n- <strong>AI/ML/DL Expertise:</strong>\n    - Proven experience with supervised, unsupervised, and reinforcement learning.\n    - Deep knowledge of ML algorithms (e.g., XGBoost, SVM, Random Forest) and DL architectures (CNNs, RNNs, Transformers, LLMs).\n    - Hands-on with Python, PyTorch, TensorFlow, Keras, Scikit-learn, Hugging Face, etc.\n- <strong>Architecture &amp; System Design:</strong>\n    - Strong grasp on designing large-scale AI/ML pipelines using microservices, APIs, and cloud-native architecture.\n    - Experience designing MLOps workflows (CI/CD for ML) using tools like MLflow, Kubeflow, Airflow, DVC.\n- <strong>Cloud &amp; Platforms:</strong>\n    - Proficient in AWS/GCP/Azure AI/ML services (e.g., SageMaker, Vertex AI, Azure ML Studio).\n    - Familiarity with vector databases (e.g., FAISS, Pinecone), model versioning, and deployment strategies (e.g., REST APIs, gRPC, containers, Kubernetes).\n- <strong>Data Engineering:</strong>\n    - Working knowledge of data wrangling, preprocessing, ETL, feature engineering, data versioning.\n    - Tools: Spark, Pandas, Snowflake, Kafka, Databricks, Delta Lake.\n- <strong>Product &amp; Project Ownership:</strong>\n    - Ability to estimate efforts, manage scope, and align delivery with client expectations.\n    - Experience in productizing AI models and integrating them into full-stack applications.\n- <strong>Soft Skills:</strong>\n    - Excellent communication, stakeholder management, and presentation skills.\n    - Ability to simplify complex AI concepts for non-technical stakeholders.</p>\n<p><strong>Preferred/Nice-to-Have:</strong>\n- Experience with Generative AI (LLMs, GPT, BERT, Stable Diffusion, LangChain, RAG, etc.)\n- Knowledge of Prompt Engineering, Fine-Tuning, and RLHF\n- Experience in NLP, Computer Vision, Time Series, or Recommendation Engines\n- Understanding of ethical AI, explainable AI, and compliance in AI systems\n- Publications, contributions to open-source, or AI certifications</p>\n<p><strong>Education:</strong>\n- Bachelor’s or Master’s degree in Computer Science, Data Science, AI, or related fields.\n- Certifications in Cloud AI/ML platforms or advanced AI specializations are a plus.</p>\n<p><strong>What Company Offers:</strong>\nExcellent career growth opportunities and exposure to multiple technologies.\nFixed weekday day schedule, meaning, you’ll have your weekends off!\nFamily Medical Insurance.\nUnique leave benefits and encashment options based on performance.\nLong term growth opportunities.\nFun family environment surrounded by experienced developers.\nVarious internal employee rewards programs based on Performance.\nOpportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\nWork life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\nCompany Sponsored International Tours</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "5+ Years",
            "AI/ML/DL",
            "Python",
            "Cloud Platforms"
        ],
        "summary": "Techversant is seeking an AI/ML Architect to lead AI solution development, from client engagement to delivery. The role involves designing AI architectures, hands-on development, and team leadership."
    },
    {
        "job_title": "Lead React Native Developer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20282/85",
        "location": "Infopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Lead React Native Developer</h2>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong></p>\n<p>As a Lead- React Native Developer, you will lead the development and maintenance of our mobile applications using React Native. You will collaborate closely with cross-functional teams, including backend developers, to deliver high-quality, scalable, and user-friendly mobile solutions. The ideal candidate should have extensive experience in React Native development, possess a deep understanding of mobile application development best practices, and demonstrate leadership abilities to guide and mentor junior team members.</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Lead the development and implementation of mobile applications using React Native.</li>\n<li>Collaborate with cross-functional teams to gather and analyze project requirements.</li>\n<li>Previous ownership of app development projects is required.</li>\n<li>Develop automated tests to guarantee the product’s top-notch quality.</li>\n<li>Stay updated with the latest advancements and changes in mobile platforms and technologies.</li>\n<li>Provide technical supervision and support to mentor the team effectively.</li>\n<li>Conduct code reviews to ensure adherence to coding standards, best practices, and maintain code quality.</li>\n<li>Ensure the application is published and maintained in both the App Store and Google Play Store, adhering to their respective policies and guidelines.</li>\n<li>Participate in agile development processes, including sprint planning, estimation, and retrospectives.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>10+ years of experience in React Native Development, Minimum 3 yrs in Lead role.</li>\n<li>Expert-level proficiency in JavaScript, TypeScript, and React Native framework.</li>\n<li>Demonstrated hands-on experience in designing and developing applications using React Native, iOS, and Android platforms.</li>\n<li>Capability to plan the core architecture and iteratively enhance it as needed.</li>\n<li>Strong analytical mindset to extract actionable insights from data.</li>\n<li>Excellent Team management and communication skills.</li>\n<li>Experience with RESTful APIs and integration of third-party libraries and APIs.</li>\n<li>Possess a comprehensive understanding of React Native.</li>\n<li>Capable of understanding the company’s business needs and adjusting or innovating the product accordingly.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "10+ Years",
            "React Native",
            "JavaScript",
            "TypeScript"
        ],
        "summary": "We're hiring a Lead React Native Developer to spearhead mobile app development and mentor junior team members. The ideal candidate should have extensive experience in React Native development and leadership."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20283/85",
        "location": "Infopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc</p>\n<p><strong>What’s important to us:</strong>\nWe are seeking experienced AI/ML Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Job Description</strong>\n- Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.\n- Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs) and diffusion models for a range of use cases involving text, code, and multi-modal data.\n- Build Scalable Recommendation Engines: Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.\n- Cloud-Native ML Engineering: Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.\n- End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.\n- Collaborate Across Functions: Work with cross-functional teams including product managers, engineers, and data scientists to translate business goals into AI-powered solutions.</p>\n<p><strong>Core Requirements</strong>\n- Minimum 4 years of experience in building and deploying production-level ML/DL systems\n- Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders\n- Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.\n- Create Functional and technical specifications for AI/ML solutions.\n- Implement machine learning algorithms in services and pipelines that can be used on a web scale.\n- Design, develop, and implement Generative AI models using state-of-the-art techniques.\n- Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.\n- Strong understanding of transformer architectures and deep learning model design\n- Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution\n- Expertise in Python programming with a focus on:\n    - Code optimization and profiling\n    - Multi-threading and multiprocessing\n    - Object-oriented programming and design principles\n- Experience deploying models in a cloud-native environment with strong MLOps practices\n- Understanding of model evaluation, observability, A/B testing, and feedback loops\n- Excellent problem-solving and analytical skills.\n- Strong communication and presentation skills.</p>\n<p><strong>Technical Stack</strong>\n- Languages: Excellent understanding of object-oriented concepts and Python.\n- ML/DL Frameworks:\n    - Machine Learning: Scikit-learn, XGBoost, LightGBM\n    - Deep Learning: PyTorch, TensorFlow, Keras\n    - GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework\n- Cloud &amp; MLOps: AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes\n- Data &amp; Compute: Apache Spark, BigQuery, RabbitMQ, S3, EC2\n- Embedding Stores &amp; Vector Search: FAISS, Pinecone, ChromaDB\n- Orchestration &amp; APIs: Apache Airflow, Docker Deployment, and FastAPI are a must</p>\n<p><strong>Preferred Qualifications</strong>\n- Experience with multi-modal models combining text, vision, or audio\n- Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct)\n- Open-source contributions in AI/ML or GenAI ecosystems\n- Certifications in cloud-based machine learning platforms (AWS/GCP/Azure)</p>\n<p><strong>Education</strong>\n- B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field\n- Equivalent practical experience in developing scalable AI solutions will also be considered</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "4+ Years",
            "Generative AI",
            "Python",
            "Cloud Native"
        ],
        "summary": "Techversant is seeking a Senior AI/ML Engineer to develop and deploy machine learning solutions, with a focus on Generative AI and cloud-native technologies. The ideal candidate will own the full model lifecycle and collaborate across teams."
    },
    {
        "job_title": "Data Scientist",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20284/85",
        "location": "Infopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Data Scientist</h2>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong></p>\n<p>We are seeking experienced Data Scientist Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Data mining or extracting usable data from valuable data sources</li>\n<li>Using machine learning tools to select features, create and optimize classifiers</li>\n<li>Carrying out the preprocessing of structured and unstructured data</li>\n<li>Enhancing data collection procedures to include all relevant information for developing analytic systems</li>\n<li>Processing, cleansing, and validating the integrity of data to be used for analysis</li>\n<li>Analyzing large amounts of information to find patterns and solutions</li>\n<li>Developing prediction systems and machine learning algorithms</li>\n<li>Presenting results in a clear manner</li>\n<li>Propose solutions and strategies to tackle business challenges</li>\n<li>Collaborate with Business and IT teams</li>\n</ul>\n<p><strong>Skills needed:</strong></p>\n<ul>\n<li>Programming Skills – knowledge of statistical programming languages like R, Python, and database query languages like SQL, Hive, Pig is desirable.</li>\n<li>4+ yrs of experience as a data scientist.</li>\n<li>Familiarity with Scala, Java, or C++ is an added advantage.</li>\n<li>Statistics – Good applied statistical skills, including knowledge of statistical tests, distributions, regression, maximum likelihood estimators, etc.</li>\n<li>Proficiency in statistics is essential for data-driven companies.</li>\n<li>Machine Learning – good knowledge of machine learning methods like k-Nearest Neighbors, Naive Bayes, SVM, Decision Forests.</li>\n<li>Strong Math Skills (Multivariable Calculus and Linear Algebra) - understanding the fundamentals of multivariable Calculus and Linear Algebra is important as they form the basis of a lot of predictive performance or algorithm optimization techniques.</li>\n<li>Data Wrangling – proficiency in handling imperfections in data is an important aspect of a data scientist job description.</li>\n<li>Experience with Data Visualization Tools like matplotlib, ggplot, d3.js., Tableau that help to visually encode data</li>\n<li>Excellent Communication Skills – it is incredibly important to describe findings to a technical and non-technical audience.</li>\n<li>Strong Software Engineering Background</li>\n<li>Hands-on experience with data science tools</li>\n<li>Problem-solving aptitude</li>\n<li>Analytical mind and great business sense</li>\n<li>Degree in Computer Science, Engineering or relevant field is preferred</li>\n<li>Proven Experience as Data Analyst or Data Scientist</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "4+ Years",
            "Python",
            "Machine Learning",
            "SQL"
        ],
        "summary": "Techversant is seeking an experienced Data Scientist to drive business opportunities internationally. This role involves data mining, machine learning, and developing predictive systems to tackle business challenges."
    },
    {
        "job_title": "Business Development Executive (Fresher)",
        "company": "Unilaw Global Private Limited",
        "url": "https://infopark.in/company-jobs/details/20290/496",
        "location": "Infopark",
        "closing_date": "25 Sep 2025",
        "job_description": "<h2>Business Development Executive (Fresher)</h2>\n<p>We are seeking energetic and enthusiastic fresh graduates passionate about building a career in IT Sales &amp; Business Development. This role focuses on generating leads, identifying business opportunities, and supporting the sales team in achieving targets.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Research and identify potential clients in domestic and international IT markets.</li>\n<li>Generate leads through cold calls, email campaigns, LinkedIn, and networking.</li>\n<li>Present and promote the company’s software solutions (ERP, CRM, SaaS, Web &amp; Mobile Apps).</li>\n<li>Coordinate with the technical team to understand client requirements.</li>\n<li>Assist in preparing proposals, client presentations, and software demonstrations.</li>\n<li>Maintain CRM records, follow up with prospects, and track sales activities.</li>\n<li>Build strong client relationships to drive long-term growth.</li>\n</ul>\n<p><strong>Skills Required</strong></p>\n<ul>\n<li>Excellent communication (verbal &amp; written) and interpersonal skills.</li>\n<li>Strong interest in IT/software sales.</li>\n<li>Ability to quickly understand technical concepts and explain them to clients.</li>\n<li>Proficiency in MS Office (Word, Excel, PowerPoint).</li>\n<li>Self-motivated, goal-oriented, and willing to learn.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@unilawtech.com</p>",
        "tags": [
            "0 Years",
            "Lead Generation",
            "CRM",
            "ERP",
            "SaaS"
        ],
        "summary": "Seeking a Business Development Executive (Fresher) to generate leads and support sales of IT solutions. Requires strong communication skills and an interest in software sales."
    },
    {
        "job_title": "Lead Totara Developer",
        "company": "InApp Information Technologies India Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20295/329",
        "location": "Infopark",
        "closing_date": "04 Oct 2025",
        "job_description": "<h2>Lead Totara Developer</h2>\n<p><strong>Role Overview</strong></p>\n<p>Lead Totara Developer with expertise in Totara LMS and strong PHP, database, and API development skills. The ideal candidate should have excellent communication skills, be capable of understanding and troubleshooting existing Totara code, and work towards enhancing and optimizing LMS performance. While prior experience in Docker and PHP Unit testing is a plus, the ability to understand and modify existing LMS code with minimal supervision is crucial.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>Technical Responsibilities:</strong></p>\n<ul>\n<li>Develop, customize, and optimize Totara LMS to meet business and user needs.</li>\n<li>Read and interpret existing Totara code to troubleshoot, enhance, and integrate new functionalities.</li>\n<li>Implement and refine Totara API usage for enhanced system functionality.</li>\n<li>Conduct database queries, including JOIN operations, ensuring efficiency and accuracy.</li>\n<li>Identify and fix security vulnerabilities, including XSS and SQL injection risks.</li>\n<li>Implement and maintain unit testing (PHPUnit) for custom features and improvements.</li>\n<li>Optimize LMS performance, including troubleshooting slow database queries and system lag.</li>\n</ul>\n<p><strong>Functional Responsibilities:</strong></p>\n<ul>\n<li>Collaborate with cross-functional teams to understand requirements and translate them into technical implementations.</li>\n<li>Guide junior developers in best practices related to Totara customization and PHP development.</li>\n<li>Participate in code reviews and documentation to maintain high development standards.</li>\n<li>Work closely with QA and DevOps teams to ensure smooth deployment and version control.</li>\n<li>Ensure compliance with e-learning standards like SCORM, xAPI, and LTI.</li>\n</ul>\n<p><strong>Required Technical Skills:</strong></p>\n<ul>\n<li><strong>Totara LMS Development</strong> – Experience in customizing, troubleshooting, and extending LMS functionalities.</li>\n<li><strong>PHP</strong> – Strong hands-on experience in writing and reviewing secure, optimized PHP code.</li>\n<li><strong>Database Management</strong> – Ability to write efficient SQL queries, including JOIN operations.</li>\n<li><strong>API Development</strong> – Familiarity with Totara APIs like get_string(), web services, and RESTful API integration.</li>\n<li><strong>Security Best Practices</strong> – Knowledge of preventing XSS vulnerabilities, input validation, and sanitization.</li>\n<li><strong>Performance Optimization</strong> – Ability to analyze and optimize LMS performance issues.</li>\n</ul>\n<p><strong>Preferred Skills &amp; Tools:</strong></p>\n<ul>\n<li>Docker &amp; Containerization – Understanding of containerized LMS deployments.</li>\n<li>Unit Testing (PHPUnit) – Experience in writing and executing automated tests for PHP-based applications.</li>\n<li>DevOps &amp; CI/CD – Familiarity with Git, Jenkins, and automated deployment workflows.</li>\n<li>Cloud &amp; Server Management – Experience with AWS, Linux, and Nginx/Apache.</li>\n</ul>\n<p><strong>Soft Skills &amp; Competencies:</strong></p>\n<ul>\n<li>Excellent communication skills – Ability to clearly articulate technical concepts and collaborate with teams.</li>\n<li>Problem-solving mindset – Capable of troubleshooting and identifying root causes in LMS issues.</li>\n<li>Self-driven &amp; Independent – Can read and modify existing LMS code with minimal guidance.</li>\n<li>Attention to detail – Ensures code quality, security, and performance optimizations.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@inapp.com</p>",
        "tags": [
            "3+ Years",
            "Totara LMS",
            "PHP",
            "API Development"
        ],
        "summary": "Seeking a Lead Totara Developer to customize and optimize Totara LMS, utilizing strong PHP, database, and API skills. Responsibilities include troubleshooting, enhancing functionalities, ensuring security, and collaborating with cross-functional teams."
    },
    {
        "job_title": "Data Engineer (Fabric/PowerBI)",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/20250/68",
        "location": "Infopark",
        "closing_date": "08 Oct 2025",
        "job_description": "<h2>Data Warehouse Engineer</h2>\n<p><strong>Location:</strong> Infopark, Kochi</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Innovative Environment: Join a forward-thinking company that encourages creativity and problem-solving.</li>\n<li>Career Growth: Opportunities for professional development and career advancement.</li>\n<li>Collaborative Culture: Work in a team-oriented environment where your contributions are valued.</li>\n<li>Competitive Compensation: Attractive salary package and performance-based incentives.</li>\n</ul>\n<p><strong>Job Requirements</strong></p>\n<p>We are looking for a Data Warehouse Engineer with strong expertise in Microsoft Fabric to design, build, and maintain modern data solutions. The role involves developing semantic models, managing data warehouses, and enabling analytics through advanced data pipelines and reporting integrations.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Design, create, and manage semantic models, data warehouses, dataflows, and lakehouses using Microsoft Fabric.</li>\n<li>Develop and maintain ETL/ELT pipelines to process large and complex datasets.</li>\n<li>Write efficient queries using SQL, DAX, KQL, and Power Query (M).</li>\n<li>Support and optimize Power BI dashboards and reporting solutions.</li>\n<li>Implement data governance, security, and performance optimization best practices.</li>\n<li>Collaborate with analysts, business stakeholders, and data scientists to deliver scalable solutions.</li>\n<li>Use Python for automation, data transformations, and advanced analytics tasks.</li>\n</ul>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li>Hands-on expertise with Microsoft Fabric (Lakehouses, Dataflows, Warehouses, Semantic Models).</li>\n<li>Strong knowledge of SQL, DAX, KQL, Power Query (M).</li>\n<li>Proficiency in Python for data engineering workflows.</li>\n<li>Experience with Power BI modeling and development.</li>\n<li>Understanding of data architecture, data governance, and optimization techniques.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Experience with Azure Data Services (Synapse, Data Factory, Databricks).</li>\n<li>Familiarity with CI/CD pipelines, DevOps for data solutions.</li>\n<li>Exposure to machine learning integration with data workflows.</li>\n<li>Knowledge of data security, compliance, and access control frameworks.</li>\n</ul>\n<p><strong>Soft Skills</strong></p>\n<ul>\n<li>Strong analytical and problem-solving mindset.</li>\n<li>Ability to work independently and in cross-functional teams.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n<li>Detail-oriented with a focus on data quality and accuracy.</li>\n<li>Adaptability to new technologies and evolving project requirements.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, Data Engineering, or related field.</li>\n<li>Minimum 3–6 years of hands-on experience in data engineering and warehousing.</li>\n<li>Proven expertise with Microsoft Fabric and Power BI ecosystems.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@cubettech.com</p>",
        "tags": [
            "5+ Years",
            "Microsoft Fabric",
            "Power BI",
            "Python"
        ],
        "summary": "We are seeking a Data Warehouse Engineer to design and maintain data solutions using Microsoft Fabric. The role involves developing data pipelines, optimizing Power BI dashboards, and implementing data governance."
    },
    {
        "job_title": ".NET Developer with SharePoint",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/20253/68",
        "location": "Infopark",
        "closing_date": "08 Oct 2025",
        "job_description": "<h2>.NET Developer with SharePoint</h2>\n<p><strong>Job Title:</strong> Software Engineer - .Net</p>\n<p><strong>Experience:</strong> 4-5 years</p>\n<p><strong>Job Location:</strong> Infopark, Kochi</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Innovative Environment: Join a forward-thinking company that encourages creativity and problem-solving.</li>\n<li>Career Growth: Opportunities for professional development and career advancement.</li>\n<li>Collaborative Culture: Work in a team-oriented environment where your contributions are valued.</li>\n<li>Competitive Compensation: Attractive salary package and performance-based incentives.</li>\n</ul>\n<p><strong>Job Summary:</strong></p>\n<p>We are seeking a skilled and experienced .NET Developer with SharePoint expertise to join our development team. The ideal candidate should have 4–5 years of hands-on experience in building and maintaining .NET-based applications and SharePoint solutions. This role requires strong analytical skills, problem-solving capabilities, and the ability to work in a dynamic environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain .NET-based applications using C#, ASP.NET (MVC/Core), and related technologies.</li>\n<li>Build and customize SharePoint solutions (SharePoint Online / SharePoint 2016/2019).</li>\n<li>Create and maintain custom SharePoint web parts, workflows, lists, libraries, and pages.</li>\n<li>Develop and integrate RESTful APIs and web services.</li>\n<li>Participate in the full software development lifecycle: requirement gathering, design, coding, testing, and deployment.</li>\n<li>Collaborate with UI/UX designers, QA engineers, and business analysts to deliver high-quality solutions.</li>\n<li>Troubleshoot and resolve technical issues in both .NET and SharePoint environments.</li>\n<li>Stay current with emerging technologies and best practices in .NET and SharePoint ecosystems.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>4–5 years of experience in .NET development (C#, ASP.NET, .NET Core).</li>\n<li>Strong experience with SharePoint (preferably SharePoint Online and/or SharePoint 2016/2019).</li>\n<li>Proficiency in SharePoint Framework (SPFx), CSOM, JSOM, PowerShell scripting, and Power Platform (Power Automate, Power Apps) is a plus.</li>\n<li>Solid knowledge of HTML, CSS, JavaScript, jQuery, and Bootstrap.</li>\n<li>Good understanding of SQL Server and database development.</li>\n<li>Experience with RESTful API integration and services.</li>\n<li>Familiarity with Agile methodologies and tools like JIRA or Azure DevOps.</li>\n<li>Excellent problem-solving and debugging skills.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Microsoft Certifications (e.g., Microsoft Certified: SharePoint Developer Associate or .NET certifications).</li>\n<li>Experience with Microsoft Teams and integration with SharePoint.</li>\n<li>Exposure to cloud platforms like Microsoft Azure.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Strong communication and interpersonal skills.</li>\n<li>Ability to work independently and in a team environment.</li>\n<li>Attention to detail and a proactive mindset.</li>\n<li>Effective time management and ability to meet deadlines.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@cubettech.com</p>",
        "tags": [
            "4-5 Years",
            ".NET",
            "SharePoint",
            "C#"
        ],
        "summary": "We need a .NET Developer to develop .NET-based applications and SharePoint solutions. The role requires experience with C#, ASP.NET, and SharePoint, with strong analytical and problem-solving skills."
    },
    {
        "job_title": "Python Developer",
        "company": "Focaloid Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/20285/366",
        "location": "Infopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Python Developer</h2>\n<p>We are seeking experienced Python developers to participate in the complete lifecycle of our company's products and project modules. You will collaborate with project managers and system specialists to ensure successful outcomes.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, build, and maintain efficient, reusable, and reliable Python services and components.</li>\n<li>Ensure optimal performance, quality, and security.</li>\n<li>Identify and resolve bottlenecks and bugs.</li>\n<li>Maintain code quality and organization.</li>\n<li>Understand established software development life cycles.</li>\n<li>Prioritize and multitask to meet deadlines.</li>\n<li>Resolve technical issues through debugging, research, and investigation.</li>\n<li>Collaborate across various teams and with external clients.</li>\n<li>Contribute innovative designs and ideas for improving our company's products and services.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Experience with Flask / Django</li>\n<li>Familiarity with version control (Git)</li>\n<li>Understanding of SQL</li>\n<li>Strong Unit Testing practice</li>\n<li>Understanding of design patterns and Microservices Architecture</li>\n<li>Understanding of Scrum Agile methodology</li>\n<li>Experience in data engineering &amp; Docker is a plus.</li>\n</ul>\n<p><strong>Candidate Profile:</strong></p>\n<ul>\n<li>1 to 4+ years of experience in Design and Development with Python and its Principles.</li>\n<li>Graduate in Computer Science or a related discipline (e.g., BS / B.E. / B-Tech in Electronics, Electrical, IT).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at ajish.prabhakaran@focaloid.com</p>",
        "tags": [
            "1-4+ Years",
            "Python",
            "Flask / Django",
            "SQL",
            "Git"
        ],
        "summary": "Seeking a Python Developer to design, build, and maintain Python services. Requires 1-4+ years of experience and proficiency in relevant technologies and software development methodologies."
    },
    {
        "job_title": "HR Generalist",
        "company": "Senscript Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20277/347",
        "location": "Infopark",
        "closing_date": "30 Oct 2025",
        "job_description": "<h2>HR Generalist</h2>\n<p><strong>Experience Required:</strong> 4+ Years</p>\n<p><strong>Location:</strong> Cochin, Infopark</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Job Description:</strong></p>\n<p>We are looking for an HR Generalist with over 4 years of experience in startup or high-growth environments. The ideal candidate is well-versed in recruitment, employee engagement, statutory compliance, and HR operations, with strong working knowledge of tools like Keka HRMS and Microsoft Office. You should be a self-starter who thrives in fast-paced environments, enjoys building HR processes from the ground up, and is passionate about creating a positive employee experience.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Maintain and manage employee records and HR databases using Keka HRMS (preferred).</li>\n<li>Administer day-to-day HR operations including attendance, leave, payroll inputs, and employee documentation.</li>\n<li>Coordinate onboarding, confirmation, and offboarding processes with proper documentation and system updates.</li>\n<li>Ensure timely compliance with all labor laws and statutory requirements (PF, ESI, PT, Gratuity, etc.).</li>\n<li>Liaise with compliance consultants and government authorities for filings and audits.</li>\n<li>Support the execution of performance management processes and documentation.</li>\n<li>Plan and implement employee engagement activities, team events, wellness initiatives, and internal communications.</li>\n<li>Draft, review, and implement HR policies and standard operating procedures (SOPs).</li>\n<li>Address employee concerns and manage grievance redressal processes in line with organizational values.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s/master's degree in human resources, Business Administration, or a related field.</li>\n<li>Minimum 4 years of experience as an HR Generalist, preferably in startup or high-growth environments.</li>\n<li>Strong experience in end-to-end recruitment, including sourcing, screening, interviewing, and offer management.</li>\n<li>Demonstrated ability to design and execute employee engagement initiatives, such as surveys, team-building events, and culture-building programs.</li>\n<li>Solid understanding of HR operations, Indian labor laws, and statutory compliance processes.</li>\n<li>Proficiency in using Keka HRMS is strongly preferred; experience with Zoho People or similar platforms is a plus.</li>\n<li>Skilled in Microsoft Office tools, particularly Excel, Word, and Outlook.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Strong organizational, interpersonal, and multitasking abilities.</li>\n<li>Ability to work independently and maintain confidentiality in all HR matters.</li>\n</ul>\n<p>CLOUDVICE is proud to be an Equal Employment Opportunity employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at Careers@senscript.ai</p>",
        "tags": [
            "4+ Years",
            "Keka HRMS",
            "Recruitment",
            "Employee Engagement"
        ],
        "summary": "We need an HR Generalist with 4+ years of experience to handle HR operations, compliance, and employee engagement. Proficiency in Keka HRMS and Indian labor laws is essential."
    },
    {
        "job_title": "Angular Developer",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20291/269",
        "location": "Infopark",
        "closing_date": "30 Oct 2025",
        "job_description": "<h2>Angular Developer</h2>\n<ul>\n<li>Develop modern software applications, working with the UI Team.</li>\n<li>Focus on developing user interfaces in Angular web environments, which interact with our users in a stable, intuitive, and safe way.</li>\n<li>Ensure these components are robust and easy to maintain, connected with an existing data system that will be part of a new platform being developed.</li>\n<li>Coordinate with the rest of the team working on different layers of the platform and infrastructure, hence collaborative problem-solving, and a quality product is very important.</li>\n</ul>\n<p><strong>Desired Skills</strong></p>\n<ul>\n<li>Expert-level knowledge of Angular.</li>\n<li>Strong debugging skills on Developer Tools of the browser and Working with Cross-Browser UI.</li>\n<li>Good to have experience in Agile Software Development projects.</li>\n<li>Solid understanding and experience with Object-Oriented design and development.</li>\n<li>Good hands-on experience with Object-oriented JavaScript and Design Pattern.</li>\n<li>Willingness to own a responsibility.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "5+ Years",
            "Angular",
            "JavaScript",
            "UI Development"
        ],
        "summary": "We are looking for an Angular Developer to develop modern user interfaces. The ideal candidate will have expert knowledge of Angular and strong debugging skills."
    },
    {
        "job_title": "Senior Data Scientist",
        "company": "JK Lucent Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20262/415",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Data Scientist</h2>\n<p><strong>Location:</strong> Infopark, Koratty, Kerala\n<strong>Job Type:</strong> Full Time</p>\n<p><strong>Job Summary:</strong></p>\n<p>We are seeking a highly skilled Senior Data Scientist to join our team at JK Lucent. The ideal candidate will have a strong background in developing and deploying machine learning models, extracting actionable insights from complex datasets, and building scalable, data-driven solutions.</p>\n<p><strong>In this role, you will:</strong></p>\n<ul>\n<li>Design and implement advanced AI/ML models to support strategic business objectives.</li>\n<li>Write robust engineering-grade code that integrates seamlessly into production environments.</li>\n<li>Work closely with cross-functional teams to turn data into insights and drive measurable business outcomes.</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<ol>\n<li>Develop and deploy machine learning models using Python, PyTorch, scikit-learn, and other relevant libraries.</li>\n<li>Extract insights from complex data and communicate findings to stakeholders.</li>\n<li>Design and implement data-driven solutions, including real-time and batch processing systems.</li>\n<li>Collaborate with engineers to build scalable and efficient data pipelines.</li>\n<li>Develop and maintain RESTful APIs to serve machine learning models.</li>\n<li>Work with databases, including data modeling, schema design, and query optimization.</li>\n<li>Work with GitHub, Docker, and AWS to ensure smooth deployment and management of models.</li>\n<li>Stay up-to-date with industry trends and advancements in AI/ML.</li>\n</ol>\n<p><strong>Required Skills:</strong></p>\n<ol>\n<li>5+ years of experience in data science and machine learning.</li>\n<li>Strong proficiency in Python and relevant libraries, including PyTorch, scikit-learn, and pandas.</li>\n<li>Experience with machine learning model development, deployment, and maintenance.</li>\n<li>Strong understanding of data structures, algorithms, and software design patterns.</li>\n<li>Experience with databases, including relational databases (e.g., PostgreSQL, MySQL) and NoSQL databases (e.g., MongoDB, Cassandra).</li>\n<li>Experience with GitHub, Docker, and AWS.</li>\n<li>Familiarity with RESTful API design and development.</li>\n<li>Experience with real-time and batch processing systems.</li>\n<li>Excellent communication and collaboration skills.</li>\n</ol>\n<p><strong>Nice to Have:</strong></p>\n<ol>\n<li>Experience with time series forecasting and analysis.</li>\n<li>Knowledge of deep learning frameworks like TensorFlow or Keras.</li>\n<li>Familiarity with natural language processing (NLP).</li>\n<li>Experience with data visualization tools like Matplotlib, Seaborn, or Plotly.</li>\n<li>Knowledge of Agile development methodologies and Scrum framework.</li>\n<li>Experience with cloud platforms like AWS SageMaker, Google Cloud AI Platform, or Azure Machine Learning.</li>\n</ol>\n<p><strong>What We Offer:</strong></p>\n<ol>\n<li>Competitive salary and benefits package.</li>\n<li>Opportunity to work on complex and challenging projects.</li>\n<li>Collaborative and dynamic work environment.</li>\n<li>Professional growth and development opportunities.</li>\n</ol>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@jklucent.com.au</p>",
        "tags": [
            "5+ Years",
            "Python",
            "Machine Learning",
            "AWS"
        ],
        "summary": "JK Lucent is looking for a Senior Data Scientist to develop ML models, extract insights, and build scalable solutions. Proficiency in Python and experience with AWS are required."
    },
    {
        "job_title": "Java Developer",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20294/269",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Java Developer</h2>\n<p><strong>Experience:</strong> 3-5 years</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Identify and analyze user requirements</li>\n<li>Prioritize, assign, and execute tasks throughout the software development life cycle</li>\n<li>Develop Java applications</li>\n<li>Write well-designed, efficient code</li>\n<li>Review, test, and debug team members’ code</li>\n<li>Design database architecture</li>\n<li>Schedule product releases with internal teams</li>\n<li>Document development phases</li>\n<li>Ensure our applications are secure and up-to-date.</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li>Work experience as a Senior Java Developer or similar role.</li>\n<li>Experience designing, building, and testing Java Spring Boot application</li>\n<li>In-depth knowledge of Java frameworks like Spring Boot</li>\n<li>Minimum of 3+ experience with Spring</li>\n<li>Sound knowledge of core java and collections</li>\n<li>Hands-on experience building Rest-based web services</li>\n<li>Experience with Object-Oriented Design (OOD) and design patterns</li>\n<li>Hands-on experience working with databases</li>\n<li>Good delegation and time management skills</li>\n<li>Problem-solving abilities</li>\n</ul>\n<p><strong>Soft Skills</strong></p>\n<ul>\n<li>Good written and oral communication skills</li>\n<li>Team player</li>\n<li>Mentoring and leadership capability</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "3-5 Years",
            "Java Spring Boot",
            "REST API",
            "Object-Oriented Design"
        ],
        "summary": "Seeking a Java Developer with 3-5 years of experience to develop Java applications and design database architecture. The ideal candidate should have experience with Spring Boot and REST-based web services."
    },
    {
        "job_title": "Sales Executive",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23355",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Sales Executive</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a motivated and goal-oriented Sales Executive to drive sales growth across B2B, B2C, and D2C channels. The ideal candidate will have a passion for achieving sales targets and experience in the BFSI domain.</p>\n<p><strong>Contact:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Drive sales growth across B2B, B2C, and D2C channels by identifying new business opportunities and managing existing accounts.</li>\n<li>Develop and implement effective sales strategies to achieve revenue and profitability targets.</li>\n<li>Build strong client relationships through effective communication, regular follow-ups, and personalized engagement.</li>\n<li>Collaborate with marketing and service delivery teams to ensure seamless execution and customer satisfaction.</li>\n<li>Conduct market research to identify trends, competitor activities, and emerging opportunities.</li>\n<li>Negotiate and close deals while maintaining high levels of customer satisfaction.</li>\n<li>Prepare and present sales reports, forecasts, and performance analyses to the management team.</li>\n</ul>\n<p><strong>Required Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, or a related field.</li>\n<li>Minimum of 3 years of proven sales experience across B2B, B2C, and/or D2C sectors.</li>\n<li>Strong understanding of both product-based and service-based sales cycles.</li>\n<li>Excellent negotiation, presentation, and communication skills.</li>\n<li>Ability to manage multiple accounts and prioritize tasks effectively.</li>\n<li>Proficiency in CRM tools and Microsoft Office Suite.</li>\n<li>Strong analytical mindset with a target-driven approach.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience in technology, SaaS, or service delivery domains.</li>\n<li>Familiarity with digital sales, online marketing channels, or e-commerce strategies.</li>\n<li>Ability to work independently and in a fast-paced environment.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Competitive salary and performance-based incentives.</li>\n<li>Opportunity to work with diverse product and service portfolios.</li>\n<li>Career growth in a high-performance sales environment.</li>\n<li>Dynamic and collaborative workplace culture.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Sales",
            "B2B",
            "CRM Tools"
        ],
        "summary": "Techvantage Systems is looking for a Sales Executive to drive sales growth across multiple channels. The role involves developing sales strategies, building client relationships, and achieving revenue targets."
    },
    {
        "job_title": "Senior/Lead Software Engineer – Java Development",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23354",
        "location": "Technopark",
        "closing_date": "21 Sep 2025",
        "job_description": "<h2>Senior/Lead Software Engineer – Java Development</h2>\n<p><strong>TRENSER Technology Solutions (P) Ltd</strong>\nThejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<a href=\"http://www.trenser.com\">http://www.trenser.com</a></p>\n<p><strong>Contact Email:</strong> careers@trenser.com</p>\n<p><strong>Closing Date:</strong> 21, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<h3>Overview</h3>\n<p>This position is for a Full Stack Developer responsible for developing Java based backend and React based frontend for a long term project being done for a North American client. The job location is Trivandrum, India. He/ she will be working along with the existing project team for technical and management aspects. Work involves requirement elicitation, software architecture designing, implementation and code reviews. He/ she will be responsible for taking each assigned task to completion ensuring the quality of deliverables. Should have self-initiatives, decision making and self-directing capabilities to work with minimal supervision and a “go-getter” attitude.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Perform software requirements analysis and determine the functional and non-functional requirements of the project.</li>\n<li>Analyze requirements to create solutions and software architecture design.</li>\n<li>Write product quality code and perform developer level verification.</li>\n<li>Communicate with clarity of requirements and expectations of deliverables.</li>\n<li>On-time delivery of the product with quality</li>\n<li>Work closely with stakeholders including customers to ensure successful execution of the project.</li>\n<li>Manage priority changes and conflicts gracefully with stakeholders involved.</li>\n<li>Address customer escalations and be able to think at fast pace to identify and solve issues in the product.</li>\n<li>Proactively use/ suggest tools and systems to improve quality, productivity etc.</li>\n<li>Stay up to date on relevant technology and process advancements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>More than five years of experience in software development</li>\n<li>At least 3 years of experience in Java development.</li>\n<li>Experience in developing Web APIs / RESTful services using Spring Boot.</li>\n<li>Experience in NoSQL databases like MongoDB</li>\n<li>Experience with code quality tools and unit testing.</li>\n<li>Proficient with JavaScript/TypeScript.</li>\n<li>Knowledge of other web technologies and UI/UX standards</li>\n<li>Understanding of Material design principles and guidelines</li>\n<li>Familiarity with Authentication and Authorization concepts and frameworks</li>\n<li>Familiarity with other JavaScript based frameworks like Angular / React Native is an added advantage.</li>\n<li>Proficient in debugging web pages to isolate functional (JavaScript) and style (CSS) issues.</li>\n<li>Good understanding end experience with code versioning tools e.g., git</li>\n<li>Good understanding of software development lifecycles (SDLC), version control and traceability.</li>\n<li>Experience in developing software under Agile development methodology.</li>\n<li>Knowledgeable and well versant with various development tools for designing, coding, debugging/ troubleshooting, testing, bug tracking, collaboration and source control.</li>\n<li>Bachelor’s degree or equivalent in Engineering discipline - Computer/ Electronics.</li>\n</ul>\n<h3>Knowledge, Skills and Abilities</h3>\n<ul>\n<li>Outstanding attitude and energy to explore unfamiliar software implementations and troubleshoot issues.</li>\n<li>Strong interpersonal skills to get things done as a team.</li>\n<li>Flexible to work in a distributed and collaborative global team environment across time zones.</li>\n<li>Excellent written and oral communication skills.</li>\n<li>Hardworking with “whatever it takes” attitude.</li>\n<li>Ability to judge and estimate work volume for given tasks.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java Development",
            "Spring Boot",
            "React"
        ],
        "summary": "Seeking a Senior/Lead Software Engineer to develop Java-based backend and React-based frontend. The role involves full-stack development, architecture design, and collaboration in an Agile environment."
    },
    {
        "job_title": "Lead Pre Sales - IT Services",
        "company": "Inapp Information Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23353",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Lead Pre Sales - IT Services</h2>\n<p><strong>InApp Information Technologies India (P) Ltd</strong>\n209 S, 9th Floor, Yamuna, Technopark Phase 3., 695583\n<a href=\"http://www.inapp.com\">http://www.inapp.com</a></p>\n<p><strong>Contact Email:</strong> careers@inapp.com</p>\n<p><strong>Role:</strong> Lead Pre Sales - IT Services\n<strong>Experience:</strong> 5-10 years\n<strong>Location:</strong> Hybrid (Trivandrum / Kochi)\n<strong>Closing Date:</strong> 09, Oct 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Job Summary:</strong>\nWe are seeking a dynamic and detail-oriented Presales Consultant to support our IT services sales team. The ideal candidate will have a strong understanding of IT service offerings, excellent communication skills, and proven experience in responding to RFPs, creating compelling case studies, and collaborating across technical and business teams. Should be ready to work flexible hours to accommodate Global client meetings and deliverables.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>RFP &amp; Proposal Management</strong>\n- Analyze and respond to RFPs, RFIs, and RFQs with high-quality proposals.\n- Coordinate with delivery, finance, legal, and technical teams to gather inputs.\n- Ensure proposals are tailored to client needs and aligned with company capabilities.\n- Maintain a repository of reusable proposal content and templates.</p>\n<p><strong>Solution Design &amp; Client Engagement</strong>\n- Understand client requirements and create suitable proposal documents.\n- Participate in client calls, presentations of the proposals and any workshops.\n- Collaborate with architects and SMEs to design proposals and SOWs.</p>\n<p><strong>Collaboration &amp; Cross-functional Interaction</strong>\n- Work closely with sales, delivery, marketing, and account teams.\n- Facilitate internal reviews and approvals for proposals and solutions.\n- Act as a bridge between technical teams and customer business stakeholders.</p>\n<p><strong>Content Development</strong>\n- Create and maintain case studies, capability decks, and client success stories.</p>\n<p><strong>Required Skills:</strong>\n- Experience in IT services presales or solution consulting.\n- Understanding of IT service domains (e.g. cloud, infrastructure, application services).\n- Excellent written and verbal communication skills.\n- Ability to manage multiple proposals and deadlines simultaneously</p>\n<p><strong>Preferred Qualifications:</strong>\n- Experience with global clients and multi-geography proposals.\n- Familiarity with Agile, or other service delivery frameworks.\n- Prior experience in creating sales enablement content.</p>\n<p><strong>Preferred Skills:</strong>\nRFP &amp; Proposal Management, PreSales</p>",
        "tags": [
            "5-10 Years",
            "PreSales",
            "RFP Management",
            "IT Services"
        ],
        "summary": "Seeking a Presales Consultant to support the IT services sales team. Responsibilities include RFP management, solution design, and content development, requiring strong communication and IT service understanding."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23352",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a skilled and proactive Full Stack Developer to join our dynamic team. We are at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems, building intelligent, cutting-edge solutions that push the boundaries of what’s possible through AI and human-machine collaboration.</p>\n<p><strong>Contact:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Locations:</strong>\n- Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\n- 2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581\n- http://www.techvantagesystems.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain scalable web and mobile applications using ReactJS and React Native.</li>\n<li>Build robust backend services and RESTful APIs using NodeJS.</li>\n<li>Collaborate with UI/UX designers and product managers to implement functional and intuitive interfaces.</li>\n<li>Participate in code reviews and contribute to continuous improvement of development practices.</li>\n<li>Optimize applications for performance, security, and scalability.</li>\n<li>Debug and troubleshoot issues across the full stack.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>4–5 years of hands-on experience in full stack development.</li>\n<li>Strong proficiency in ReactJS, and NodeJS.</li>\n<li>Experience with state management tools such as Redux or Context API.</li>\n<li>Familiarity with RESTful API design and integration.</li>\n<li>Solid understanding of frontend technologies (HTML, CSS, JavaScript/TypeScript).</li>\n<li>Experience working with databases like MongoDB, PostgreSQL, or MySQL.</li>\n<li>Good understanding of Git and version control workflows.</li>\n<li>Ability to work independently and in a team environment.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Experience in the insurance domain will be considered a significant advantage.</li>\n</ul>",
        "tags": [
            "4-5 Years",
            "ReactJS",
            "NodeJS",
            "RESTful APIs"
        ],
        "summary": "Techvantage Systems is hiring a Full Stack Developer to build scalable web and mobile applications. Proficiency in ReactJS and NodeJS is required."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23351",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>UI/UX Designer</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a creative and skilled UI/UX Designer to join our team, focusing on AI-driven products. We are a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems. Our mission is to design powerful, seamless, intuitive, and delightful solutions.</p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design intuitive, visually appealing, and user-friendly interfaces for AI-powered applications and platforms.</li>\n<li>Work closely with product managers, AI engineers, and developers to translate complex AI functionalities into seamless user experiences.</li>\n<li>Conduct user research, usability testing, and gather feedback to improve designs continuously.</li>\n<li>Develop wireframes, prototypes, user flows, and mockups that communicate design concepts effectively.</li>\n<li>Ensure the UI/UX design aligns with brand guidelines, accessibility standards, and modern design principles.</li>\n<li>Stay updated with the latest trends in AI-driven user experience, conversational UI, and adaptive interfaces.</li>\n<li>Collaborate in creating engaging data visualization and interactive dashboards for AI analytics tools.</li>\n</ul>\n<p><strong>Required Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Design, HCI, Computer Science, or a related field.</li>\n<li>2–6 years of proven experience as a UI/UX Designer, preferably in AI or data-driven product environments.</li>\n<li>Proficiency in design tools such as Figma, Adobe XD, Sketch, or similar.</li>\n<li>Strong understanding of user-centered design principles, responsive design, and accessibility standards (WCAG).</li>\n<li>Experience in designing for AI products (chatbots, LLM-powered tools, recommendation engines, etc.) is mandatory.</li>\n<li>Familiarity with front-end technologies (HTML, CSS, JavaScript) is a plus.</li>\n<li>Strong portfolio showcasing user-friendly, innovative, and visually appealing designs.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience in conversational UI/UX or generative AI-based tools.</li>\n<li>Knowledge of data visualization best practices for AI/ML outputs.</li>\n<li>Ability to work in agile environments and collaborate with cross-functional teams.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Opportunity to design cutting-edge AI-driven products.</li>\n<li>Collaborative and innovative work culture.</li>\n<li>Competitive salary and benefits package.</li>\n<li>Continuous learning and growth opportunities in the AI space.</li>\n</ul>\n<p><strong>Contact Information:</strong>\nTECHVANTAGE SYSTEMS (P) Ltd\nModule L1A, Level -1, Thejaswini, Technopark, Trivandrum\nand\n2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581\nhttp://www.techvantagesystems.com</p>",
        "tags": [
            "2-6 Years",
            "UI/UX Design",
            "Figma",
            "AI Products"
        ],
        "summary": "Techvantage Systems is looking for a UI/UX Designer to create intuitive interfaces for AI-powered applications. The role involves user research, prototyping, and collaboration with AI engineers."
    },
    {
        "job_title": "Senior Python Developer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23350",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Senior Python Developer</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong>\nModule L1A, Level -1, Thejaswini, Technopark, Trivandrum\nand\n2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581\nhttp://www.techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<p>Techvantage.ai is seeking a passionate and experienced Senior Python Developer to join our dynamic team. You will be responsible for designing, developing, and maintaining scalable backend services and APIs using Python.</p>\n<p><strong>Job Overview:</strong>\nWe are looking for a passionate and experienced Senior Python Developer to join our dynamic team. You will be responsible for designing, developing, and maintaining scalable backend services and APIs using Python. If you enjoy solving complex problems and working on high-impact projects, we’d love to hear from you.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, test, and maintain Python-based backend services and APIs.</li>\n<li>Write clean, maintainable, and efficient code following best practices.</li>\n<li>Collaborate with frontend developers, designers, and other backend engineers to deliver high-quality software solutions.</li>\n<li>Optimize performance and scalability of applications.</li>\n<li>Integrate with third-party APIs and data sources.</li>\n<li>Participate in code reviews and contribute to team learning and improvement.</li>\n<li>Troubleshoot and debug applications as needed.</li>\n<li>Maintain clear documentation of code and technical processes.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>3–5 years of hands-on experience in Python development.</li>\n<li>Strong understanding of web frameworks such as Django, Flask, or FastAPI.</li>\n<li>Experience in building RESTful APIs and microservices.</li>\n<li>Solid knowledge of relational databases (e.g., PostgreSQL, MySQL) and/or NoSQL databases (e.g., MongoDB, Redis).</li>\n<li>Familiarity with version control systems like Git.</li>\n<li>Good understanding of software development life cycle (SDLC) and Agile methodologies.</li>\n<li>Strong problem-solving and communication skills.</li>\n<li>Experience with cloud platforms (AWS, GCP, or Azure) is a plus.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Experience with containerization tools like Docker and orchestration tools like Kubernetes.</li>\n<li>Familiarity with CI/CD pipelines.</li>\n<li>Exposure to DevOps practices or basic system administration.</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "Python",
            "RESTful APIs",
            "Django"
        ],
        "summary": "Techvantage Systems is hiring a Senior Python Developer. The role involves designing, developing, and maintaining scalable backend services and APIs using Python web frameworks."
    },
    {
        "job_title": "AI/ ML Engineer",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23349",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>AI/ML Engineer</h2>\n<p><strong>ZL Software Systems (P) Ltd</strong>\nC-22, - 2 Floor, Thejaswini Building, Phase-1 Campus, Technopark,\nTrivandrum, Kerala, India, 695581\n<a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> <a href=\"&#109;&#97;&#105;&#108;&#116;&#111;&#58;&#99;&#97;&#114;&#101;&#101;&#114;&#115;&#116;&#118;&#109;&#64;&#122;&#108;&#105;&#110;&#107;&#99;&#111;&#114;&#112;&#46;&#99;&#111;&#109;\">&#99;&#97;&#114;&#101;&#101;&#114;&#115;&#116;&#118;&#109;&#64;&#122;&#108;&#105;&#110;&#107;&#99;&#111;&#114;&#112;&#46;&#99;&#111;&#109;</a></p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Strong experience in Data Analytics and Modeling</li>\n<li>Strong knowledge and experience with SQL queries and Database Management Systems (SQL Server)</li>\n<li>Strong experience in GenAI, LLMs (OpenAI, Hugging Face, etc.) and their integration through APIs or fine-tuning for domain-specific use cases.</li>\n<li>Experience with Apache Spark, PySpark, and distributed data processing.</li>\n<li>Strong programming skills in Python (preferred), with experience in AI/ML frameworks like scikit-learn, Hugging Face Transformers, or Keras.</li>\n<li>Experience with MLOps tools, version control (Git), and basic cloud services (preferably Azure).</li>\n<li>Proficiency in Data extraction using natural language prompts using LLM pipelines.</li>\n<li>Excellent problem-solving skills and an independent, ownership-driven attitude.</li>\n<li>Knowledge in Azure AI studio, Visual Studio Copilot.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Bachelor’s or master’s degree in computer science, Data Science, or related field.</li>\n<li>3–5 years of relevant hands-on experience in AI/ML, data engineering, or intelligent automation</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "GenAI",
            "Python",
            "SQL"
        ],
        "summary": "Seeking an AI/ML Engineer with experience in data analytics, GenAI, and Python. The role involves working with LLMs, data processing, and cloud services."
    },
    {
        "job_title": "Product Experience Designer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23348",
        "location": "Technopark",
        "closing_date": "21 Sep 2025",
        "job_description": "<h2>Product Experience Designer (UX/UI)</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a creative and experienced Product Experience Designer to help shape the user experience of our AI-driven platforms. You will collaborate with cross-functional teams to turn sophisticated AI capabilities into intuitive and human-centered design solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the design of engaging, user-friendly interfaces for AI-powered web and mobile products.</li>\n<li>Simplify complex AI-driven workflows into clear and accessible user experiences.</li>\n<li>Design and deliver wireframes, mockups, prototypes, and high-fidelity UI designs.</li>\n<li>Conduct user research, interviews, and usability testing to drive data-informed design decisions.</li>\n<li>Collaborate closely with product managers, engineers, and AI researchers to align product vision with user needs.</li>\n<li>Help maintain and evolve the design system, ensuring consistency across all interfaces.</li>\n<li>Champion design best practices and ensure accessibility and performance in every product experience.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>4+ years of professional experience as a UI/UX Designer with a strong focus on product design.</li>\n<li>Experience designing for AI-based or data-intensive applications.</li>\n<li>Exceptional portfolio showcasing creative thinking and user-centered design across various platforms.</li>\n<li>Proficiency with tools like Figma, Adobe XD, Sketch, or similar.</li>\n<li>Solid grasp of user research, interaction design, and responsive UI design.</li>\n<li>Ability to collaborate across teams and communicate design concepts clearly to both technical and non-technical stakeholders.</li>\n<li>Passion for creating meaningful and elegant user experiences powered by emerging technologies.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience designing products involving Generative AI, Agentic AI, or predictive systems.</li>\n<li>Familiarity with machine learning concepts and how they influence user behavior and design patterns.</li>\n<li>Knowledge of basic front-end development (HTML, CSS, JS) is a plus.</li>\n<li>Comfortable using analytics tools (e.g., Mixpanel, Hotjar) to guide UX improvements.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>The chance to work on groundbreaking AI products with real-world impact</li>\n<li>A collaborative, mission-driven team that values innovation and creativity</li>\n<li>Compensation is not a constraint for the right candidate – we value skill, impact, and innovation</li>\n<li>Opportunities for growth, learning, and contributing to next-gen AI technologies</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>jobs@techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 21, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Company Addresses:</strong></p>\n<p>Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\nand\n2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581</p>\n<p>http://www.techvantagesystems.com</p>",
        "tags": [
            "4+ Years",
            "Figma",
            "UI/UX Design",
            "AI"
        ],
        "summary": "Techvantage Systems is seeking a Product Experience Designer to create user-friendly interfaces for AI products. The ideal candidate will have experience in UX design, user research, and AI-based applications."
    },
    {
        "job_title": "Test Engineer (Automation Testing )",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23347",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Test Engineer (Automation Testing)</h2>\n<p><strong>ZL Software Systems (P) Ltd</strong>\nC-22, 2nd Floor, Thejaswini Building, Phase-1 Campus, Technopark, Trivandrum, Kerala, India, 695581\n<a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> <a href=\"&#109;&#97;&#105;&#108;&#116;&#111;&#58;&#99;&#97;&#114;&#101;&#101;&#114;&#115;&#116;&#118;&#109;&#64;&#122;&#108;&#105;&#110;&#107;&#99;&#111;&#114;&#112;&#46;&#99;&#111;&#109;\">&#99;&#97;&#114;&#101;&#101;&#114;&#115;&#116;&#118;&#109;&#64;&#122;&#108;&#105;&#110;&#107;&#99;&#111;&#114;&#112;&#46;&#99;&#111;&#109;</a></p>\n<h3>Job Summary:</h3>\n<p>We are seeking a skilled and proactive Software Test Automation Engineer with 1–3 years of hands-on experience in test automation using Selenium or Katalon. The ideal candidate will be responsible for designing, developing, and maintaining automated test scripts to ensure the quality and performance of our web and mobile applications. The candidate should have a strong understanding of test automation frameworks, industry best practices such as modular scripting, code reusability, data-driven testing, proper exception handling, and comprehensive logging, as well as Agile development methodologies.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Analyze user stories, requirements, and use cases to develop robust automated test scripts.</li>\n<li>Design, build and maintain reusable and scalable test automation frameworks.</li>\n<li>Maintain and enhance existing automation test suites.</li>\n<li>Execute automated test cases for web and mobile applications and analyze results.</li>\n<li>Identify, log, and track defects, working closely with the team to ensure timely resolution.</li>\n<li>Perform regression testing to ensure new code changes do not impact existing functionality.</li>\n<li>Maintain high standards in test case design and automation code quality.</li>\n<li>Contribute to continuous improvement of automation testing processes, tools, and techniques.</li>\n</ul>\n<h3>Required Skills:</h3>\n<ul>\n<li>1–3 years of hands-on experience in automation testing using Selenium or Katalon.</li>\n<li>Strong knowledge in object-oriented programming, exception handling and file handling.</li>\n<li>Experience in developing and maintaining test automation frameworks.</li>\n<li>Strong understanding of test automation tools, scripting, and testing best practices.</li>\n<li>Experience with test case management and defect tracking tools</li>\n<li>Good understanding of SDLC, STLC, and Agile methodologies.</li>\n<li>Strong analytical and problem-solving skills with attention to detail.</li>\n<li>Good communication and collaboration skills.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Hands-on experience with Katalon Studio is a strong advantage.</li>\n<li>Experience with version control tools like Git.</li>\n<li>Exposure to any CI/CD tools for test suite integration and automation pipeline maintenance.</li>\n<li>Bachelor's degree in computer science or information technology.</li>\n<li>Certification or formal training in test automation or relevant tools is a plus.</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Selenium",
            "Katalon",
            "Test Automation"
        ],
        "summary": "Seeking a Test Engineer to design, develop, and maintain automated test scripts using Selenium or Katalon. The candidate should have 1-3 years of experience in test automation."
    },
    {
        "job_title": "Senior Software Engineer-AI",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23346",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Senior Software Engineer - AI</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is looking for a Senior Software Engineer to join our AI team. We are a next-generation technology and product engineering company specializing in Generative AI, Agentic AI, and autonomous intelligent systems. If you have a passion for innovation and thrive in a fast-paced startup environment, we encourage you to apply.</p>\n<p><strong>Contact:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Location:</strong></p>\n<ul>\n<li>Module L1A, Level -1, Thejaswini, Technopark, Trivandrum</li>\n<li>2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581</li>\n<li><a href=\"http://www.techvantagesystems.com\">http://www.techvantagesystems.com</a></li>\n</ul>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Build and deploy AI-driven applications and services, focusing on Generative AI and Large Language Models (LLMs).</li>\n<li>Design and implement Agentic AI systems—autonomous agents capable of planning and executing multi-step tasks.</li>\n<li>Collaborate with cross-functional teams including product, design, and engineering to integrate AI capabilities into products.</li>\n<li>Write clean, scalable code and build robust APIs and services to support AI model deployment.</li>\n<li>Own feature delivery end-to-end—from research and experimentation to deployment and monitoring.</li>\n<li>Stay current with emerging AI frameworks, tools, and best practices and apply them in product development.</li>\n<li>Contribute to a high-performing team culture and mentor junior team members as needed.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>3–6 years of overall software development experience, with 3+ years specifically in AI/ML engineering.</li>\n<li>Strong proficiency in Python, with hands-on experience in PyTorch, TensorFlow, and Transformers (Hugging Face).</li>\n<li>Proven experience working with LLMs (e.g., GPT, Claude, Mistral) and Generative AI models (text, image, or audio).</li>\n<li>Practical knowledge of Agentic AI frameworks (e.g., LangChain, AutoGPT, Semantic Kernel).</li>\n<li>Experience building and deploying ML models to production environments.</li>\n<li>Familiarity with vector databases (Pinecone, Weaviate, FAISS) and prompt engineering concepts.</li>\n<li>Comfortable working in a startup-like environment—self-motivated, adaptable, and willing to take ownership.</li>\n<li>Solid understanding of API development, version control, and modern DevOps/MLOps practices.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Python",
            "Generative AI",
            "LLMs"
        ],
        "summary": "Techvantage Systems is seeking a Senior Software Engineer - AI to build and deploy AI-driven applications. The ideal candidate will have experience with Generative AI, LLMs, and Agentic AI frameworks."
    },
    {
        "job_title": "Senior Web Developer",
        "company": "Netwalk Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23345",
        "location": "Technopark",
        "closing_date": "20 Sep 2025",
        "job_description": "<h2>Senior Web Developer</h2>\n<p><strong>Netwalk Technologies India (P) Ltd</strong>\nModule 334, Nila Building, 3rd Floor,\nTechnopark Phase 1, 695581\nhttps://netwalk.de</p>\n<p><strong>Closing Date:</strong> 20, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> jobs@netwalk.co.in</p>\n<p><strong>Brief Description:</strong>\n- Development and maintenance of modern frontend and backend systems in common web technologies.\n- User-centered programming of intuitive and user-friendly GUIs\n- Implementation and testing of responsive and adaptive web applications\n- Troubleshoot, debug, and optimize code for performance improvements\n- Work with databases such as PostgreSQL, MySQL, or MongoDB.\n- Implement and maintain CI/CD pipelines for smooth deployments</p>\n<p><strong>Preferred Skills:</strong>\n- Bachelor’s or master’s degree in electrical/Electronics engineering, Computer Science, or a related field.\n- At least 10 years of experience as a Web Developer.\n- Good experience in front-end technologies such as HTML, CSS, JavaScript, React, Angular, or Vue.js)\n- Strong experience in back-end development using Node.js, Python, PHP, or Java\n- Hands-on experience in databases such as PostgreSQL, MySQL, MongoDB, etc\n- Familiarity with cloud platforms like AWS, GCP, Azure\n- Familiar with CI/CD pipelines and DevOps\n- Goal-oriented communication skills and strong ability to work in a team\n- Strong analytical, structural thinking skills</p>",
        "tags": [
            "10+ Years",
            "JavaScript",
            "Node.js",
            "PostgreSQL"
        ],
        "summary": "Netwalk Technologies is seeking a Senior Web Developer to maintain modern systems and develop intuitive GUIs. The role involves front-end, back-end, and database work, along with CI/CD pipeline management."
    },
    {
        "job_title": "Test Engineer (Manual Testing)",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23344",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Test Engineer (Manual Testing)</h2>\n<p><strong>ZL Software Systems (P) Ltd</strong>\nC-22, - 2 Floor, Thejaswini Building, Phase-1 Campus, Technopark,\nTrivandrum, Kerala, India , 695581\n<a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a></p>\n<p><strong>Contact Email:</strong> <a href=\"mailto:careerstvm@zlinkcorp.com\">careerstvm@zlinkcorp.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Job Summary:</strong>\nWe are seeking a motivated and detail-oriented Manual Test Engineer with at least 1-3 years of experience in software testing. The ideal candidate will be responsible for creating and executing test cases, identifying defects, and ensuring the quality of web and mobile applications. This role requires a good understanding of the software development lifecycle and a passion for delivering reliable, user-friendly products.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Understand functional and non-functional requirements and create clear, comprehensive, and well-structured test cases.</li>\n<li>Execute manual test cases across various platforms (web, mobile, desktop).</li>\n<li>Collaborate with developers to reproduce issues and validate fixes.</li>\n<li>Perform various types of testing including functional, regression, UI/UX, and smoke testing.</li>\n<li>Support test planning and test execution phases of software releases.</li>\n<li>Contribute to improving testing processes, quality standards, and documentation.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Good understanding of SDLC, STLC, and defect life cycle.</li>\n<li>Ability to write and execute test cases and test scenarios.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Good communication and collaboration skills.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>Familiarity with Agile/Scrum methodology.</li>\n<li>Basic knowledge of automation testing concepts is a plus.</li>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Manual Testing",
            "SDLC",
            "STLC",
            "Test Cases"
        ],
        "summary": "Seeking a Manual Test Engineer to create and execute test cases for web and mobile applications. Requires 1-3 years of experience and a strong understanding of the SDLC."
    },
    {
        "job_title": "Digitizing Specialist - Embroidery(Night Shift)",
        "company": "Faya Innovations",
        "url": "https://technopark.org/job-details/23343",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Digitizing Specialist - Embroidery (Night Shift)</h2>\n<p>FAYA INNOVATIONS is seeking a skilled Digitizing Specialist to join our team and play a key role in transforming customer logos and artwork into embroidery-ready DST files. This position requires ensuring correct stitch counts, optimized stitch paths, and machine-ready designs that result in high-quality custom apparel. The Digitizing Specialist will collaborate closely with our production team in the US and support additional creative design tasks as required.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Convert customer artwork and logos into embroidery-ready DST files with precise stitch counts and optimized paths.</li>\n<li>Collaborate with the production team to ensure files run smoothly on embroidery machines.</li>\n<li>Review, test, and refine digitized designs to guarantee quality, durability, and efficiency of stitching.</li>\n<li>Deliver accurate files on time to meet production schedules.</li>\n<li>Maintain organized records of digitized designs and ensure version control.</li>\n<li>Support additional design requirements across the company’s e-commerce brands (mockups, graphic edits, marketing creatives, etc.).</li>\n<li>Stay updated on embroidery trends, digitizing software advancements, and best practices.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Proven experience as a Digitizer with a strong portfolio of DST files.</li>\n<li>Proficiency in digitizing software (Primarily Wilcom or similar).</li>\n<li>Strong knowledge of stitch types, densities, underlay, and embroidery production processes.</li>\n<li>Attention to detail with a commitment to precision and quality.</li>\n<li>Ability to troubleshoot and optimize digitized files for embroidery machines.</li>\n<li>Good organizational and time-management skills.</li>\n<li>Flexibility to contribute to other design tasks when needed.</li>\n<li>Strong communication and collaboration skills.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>Experience in the promotional products or e-commerce apparel industry.</li>\n<li>Knowledge of apparel decoration methods beyond embroidery (screen printing, DTG, heat transfer).</li>\n<li>Basic graphic design proficiency (Adobe Illustrator, Photoshop, or similar).</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Opportunity to work with a global e-commerce and branded merchandise leader.</li>\n<li>Exposure to both embroidery digitizing and creative design projects.</li>\n<li>A collaborative, growth-focused environment.</li>\n<li>Competitive compensation package based on experience.</li>\n<li>Career growth and skill development opportunities.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>Autonomy &amp; Impact – Own your work, drive innovation, and see your solutions in action.</li>\n<li>Growth &amp; Mentorship – Be part of an elite team that values continuous learning.</li>\n<li>Stability &amp; Culture – A performance-driven, transparent, and innovation-friendly environment.</li>\n<li>Health Benefits – Family medical insurance with up to ₹2L coverage.</li>\n<li>Brilliance deserves to be well compensated.</li>\n<li>Department: Customer Service Team</li>\n<li>Shift: US Shift : 8.30pm – 5.30am IST</li>\n<li>Location: Technopark phase I, Thiruvananthapuram, Kerala 695581</li>\n<li>Working: 5 days a week.</li>\n</ul>\n<p><strong>Contact Information:</strong> hr.india@fayausa.com</p>\n<p><strong>Closing Date:</strong> 24, Oct 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>",
        "tags": [
            "2+ Years",
            "Embroidery",
            "Wilcom",
            "DST Files"
        ],
        "summary": "FAYA INNOVATIONS seeks a Digitizing Specialist to convert artwork into embroidery-ready DST files. The role involves collaborating with the production team and supporting creative design tasks."
    },
    {
        "job_title": "AI/ML Engineer (min 2+ years of experience)",
        "company": "Storygame (P) Ltd",
        "url": "https://technopark.org/job-details/23342",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>AI/ML Engineer</h2>\n<p><strong>Storygame (P) Ltd</strong>\nGround floor, Tejaswini building, Technopark Phase 1 Kazakootam trivandrum kerala, 695581\n<a href=\"https://storygame.io\">https://storygame.io</a></p>\n<p><strong>Contact Email:</strong> jincy.storygame@gmail.com</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p>We are seeking a highly skilled and innovative AI/ML Engineer with a minimum of 2+ years of experience. The ideal candidate will have deep experience in Large Language Models (LLMs), Generative AI, Retrieval-Augmented Generation (RAG), and multimodal AI involving audio and video processing. You will have hands-on experience building and integrating cutting-edge AI solutions, fine-tuning open-source and proprietary models, and deploying them into production environments.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and deploy solutions using LLMs (GPT, LLaMA, Mistral, Claude, etc.) for real-world applications.</li>\n<li>Implement and optimize RAG pipelines combining vector databases (e.g., Pinecone, Weaviate, FAISS) with LLMs.</li>\n<li>Fine-tune transformer-based models using Hugging Face, LoRA, QLoRA, PEFT, or similar frameworks.</li>\n<li>Work with generative AI models for text, image, audio, and video generation (e.g., Stable Diffusion, Whisper, AudioLM, DreamBooth, SDXL, etc.).</li>\n<li>Design and integrate multimodal systems that can process and generate content across different formats.</li>\n<li>Deploy models using ONNX, TorchServe, Triton, or custom APIs.</li>\n<li>Collaborate with DevOps and MLOps teams for model versioning, deployment, and monitoring.</li>\n<li>Research, prototype, and implement the latest advancements in generative AI and foundation models.</li>\n<li>Ensure ethical AI practices, model alignment, and bias mitigation.</li>\n<li>Optimize models for performance, latency, and resource efficiency.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Experience with AutoGPT, Agentic AI systems, or LangGraph.</li>\n<li>Knowledge of RLHF, alignment training, and custom dataset curation.</li>\n<li>Exposure to MLOps tools like MLflow, Weights &amp; Biases, or Kubeflow.</li>\n<li>Contribution to open-source AI projects or publications in relevant areas.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>2+ years of hands-on experience in AI/ML engineering.</li>\n<li>Proficient with Python, PyTorch, TensorFlow, and ML libraries (e.g., Hugging Face Transformers, LangChain, OpenAI, etc.).</li>\n<li>Strong understanding of LLMs, tokenization, attention mechanisms, and transformer architectures.</li>\n<li>Experience with fine-tuning, prompt engineering, and in-context learning.</li>\n<li>Knowledge of vector databases, embeddings, and RAG-based architectures.</li>\n<li>Familiarity with cloud platforms (AWS/GCP/Azure) and scalable AI infrastructure.</li>\n<li>Experience working with Docker, Kubernetes, and GPU optimization.</li>\n<li>Solid grasp of audio and video processing models.</li>\n<li>Passion for innovation and staying updated with the latest research and trends.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "LLMs",
            "Generative AI",
            "RAG"
        ],
        "summary": "Seeking an AI/ML Engineer to develop AI solutions using LLMs, Generative AI, and RAG. The candidate will deploy and optimize models in production environments."
    },
    {
        "job_title": "Jr.Executive  -Business Development",
        "company": "Zoondia Software (P) Ltd",
        "url": "https://technopark.org/job-details/23340",
        "location": "Technopark",
        "closing_date": "26 Sep 2025",
        "job_description": "<h2>Jr. Executive - Business Development</h2>\n<p><strong>Zoondia Software (P) Ltd</strong>\nT2, Thejaswini Building, Technopark, Trivandrum, 695581\nhttp://www.zoondia.com</p>\n<p><strong>Closing Date:</strong> 26, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> recruit@zoondia.in</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a Junior Business Development Executive to help us grow our IT services business. You will support the sales team by finding new leads, setting up meetings, and following up with potential clients.</p>\n<p><strong>Key Responsibilities:</strong>\n- Find and connect with new leads using platforms like LinkedIn, email, etc.\n- Assist in preparing sales proposals and presentations\n- Help schedule meetings and calls with clients\n- Maintain lead and client data in the CRM\n- Support the senior BD team in day-to-day tasks\n- Follow up with leads and respond to basic inquiries\n- Stay updated on our services and industry trends</p>\n<p><strong>Preferred Skills:</strong>\n- Prefer Immediate Joiners</p>\n<p><strong>Experience:</strong> 1-3 yrs</p>\n<p><strong>Qualification:</strong>\n- Bachelor’s degree in Business Administration, Marketing, or a related field.</p>",
        "tags": [
            "1-3 Years",
            "Business Development",
            "LinkedIn",
            "CRM"
        ],
        "summary": "Zoondia is seeking a Junior Business Development Executive to support the sales team and grow the IT services business. Responsibilities include lead generation, proposal preparation, and client relationship management."
    },
    {
        "job_title": "Senior .NET Full Stack Developer (with GenAI, Python & AWS) - 6 years plus",
        "company": "Enfin Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23339",
        "location": "Technopark",
        "closing_date": "23 Sep 2025",
        "job_description": "<h2>Senior .NET Full Stack Developer (with GenAI, Python &amp; AWS)</h2>\n<p>Enfin Technologies India (P) Ltd is seeking a highly skilled Senior Full Stack Developer with 6+ years of experience to join our team at Thejaswini, Technopark Campus, Trivandrum, Kerala.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain web applications using .NET Core (C#), Angular, and SQL.</li>\n<li>Implement and optimize GenAI solutions, particularly Retrieval-Augmented Generation (RAG) pipelines.</li>\n<li>Develop and integrate Python-based AI/ML modules into enterprise solutions.</li>\n<li>Utilize AWS services (Lambda, S3, SageMaker, Bedrock, etc.) for deployment and scaling.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Ensure code quality and maintainability through best practices, code reviews, and testing.</li>\n</ul>\n<p><strong>Key Skills:</strong></p>\n<ul>\n<li>Strong proficiency in .NET Core, C#, Angular (v10+), HTML/CSS/JS.</li>\n<li>Experience with Python for AI/ML model development or integration.</li>\n<li>Hands-on with Generative AI (e.g., OpenAI, LangChain, RAG frameworks).</li>\n<li>Solid understanding of REST APIs, microservices, and system architecture.</li>\n<li>Proficient in AWS services related to compute, AI/ML, and DevOps.</li>\n<li>Familiarity with CI/CD pipelines, version control (Git), and Agile methodologies.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with LangChain, Haystack, or similar GenAI frameworks.</li>\n<li>Exposure to vector databases (e.g., Pinecone, FAISS, Weaviate).</li>\n<li>Knowledge of containerization tools (Docker, Kubernetes).</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>If you are interested, please share your profile with hr@enfintechnologies.com, along with your overall &amp; relevant experience, CCTC, ECTC, and notice period.</p>\n<p><strong>Closing Date:</strong> 23, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>",
        "tags": [
            "6+ Years",
            ".NET Core",
            "Angular",
            "Generative AI"
        ],
        "summary": "Enfin Technologies is hiring a Senior Full Stack Developer to design and develop web applications, integrate AI-powered features, and utilize AWS services. The role requires expertise in .NET Core, Angular, Python, and Generative AI."
    },
    {
        "job_title": "Cybersecurity Engineer / Infrastructure Security Engineer",
        "company": "Shellsquare Softwares (P) Ltd",
        "url": "https://technopark.org/job-details/23338",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Cybersecurity Engineer / Infrastructure Security Engineer</h2>\n<p><strong>ShellSquare Softwares (P) Ltd</strong>\n1st floor, Periyar Building, Technopark Phase I, Kerala. , 695581\n<a href=\"http://www.shellsquare.com\">http://www.shellsquare.com</a></p>\n<p><strong>Closing Date:</strong> 09, Oct 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> careers@shellsquare.com</p>\n<p><strong>Location:</strong> Technopark, Thiruvananthapuram\n<strong>Employment Type:</strong> Full-time\n<strong>Experience Required:</strong> 5 + years</p>\n<h3>Role Overview</h3>\n<p>We are looking for skilled Infrastructure Security Engineers to address and remediate cybersecurity findings identified during assessments. The role involves applying security patches, updating configurations, and ensuring systems remain compliant with security standards.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Review cybersecurity reports and prioritize remediation tasks.</li>\n<li>Apply patches and update configurations based on vulnerability scan results.</li>\n<li>Collaborate with cybersecurity teams to validate fixes and close findings.</li>\n<li>Maintain logs and change records for audit and compliance purposes.</li>\n<li>Ensure endpoint protection and access control policies are enforced.</li>\n<li>Support compliance efforts for ISO, SOC 2, GDPR and other standards.</li>\n<li>Coordinate with vendors or internal teams for escalated fixes.</li>\n</ul>\n<h3>Skills &amp; Qualifications</h3>\n<ul>\n<li>Proficiency in Windows/Linux system administration, networking, and endpoint management.</li>\n<li>Experience with patch management tools (WSUS, SCCM, Ansible).</li>\n<li>Strong understanding of Active Directory, IAM, MFA implementations.</li>\n<li>Familiarity with ticketing systems (JIRA, ServiceNow).</li>\n<li>Relevant certifications such as ITIL, CompTIA Security+, Microsoft Certified: Security Operations Analyst</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong knowledge of network security, cloud security, and endpoint protection</li>\n<li>Hands‑on experience with vulnerability assessment, penetration testing, and remediation</li>\n<li>Proficiency with SIEM tools (Splunk, QRadar, ArcSight) and security monitoring</li>\n<li>Experience in patch management (WSUS, SCCM, Ansible) and system hardening</li>\n<li>Familiarity with Active Directory, IAM, MFA implementations</li>\n<li>Certifications such as CISSP, CEH, CISM, CompTIA Security+, ITIL</li>\n<li>Strong troubleshooting skills and ability to work in incident response scenarios</li>\n<li>Experience with ticketing systems (JIRA, ServiceNow) and change management processes</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Windows/Linux",
            "Active Directory",
            "Patch Management"
        ],
        "summary": "Seeking an Infrastructure Security Engineer to remediate cybersecurity findings, apply patches, and ensure system compliance. The role requires expertise in system administration, patch management, and security standards."
    },
    {
        "job_title": "Multi-Cloud DevOps Engineer (Azure)",
        "company": "Enfin Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23337",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Multi-Cloud DevOps Engineer (Azure)</h2>\n<p><strong>Enfin Technologies India (P) Ltd</strong>\nC 24, -2 Floor, Thejaswini, Technopark Campus, Trivandrum, Kerala. , 695581\n<a href=\"http://www.enfintechnologies.com\">http://www.enfintechnologies.com</a></p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> hr@enfintechnologies.com</p>\n<p>We are looking for a highly skilled Senior DevOps Engineer with 4 plus years of experience in Azure, AWS, GCP, Kubernetes, Terraform, and modern DevOps practices. The ideal candidate will be responsible for designing, implementing, and managing CI/CD pipelines, automating cloud infrastructure, optimizing Kubernetes deployments, and ensuring the high availability and scalability of applications.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>Cloud Infrastructure Management:</strong>\n- Architect, deploy, and maintain cloud environments in AWS, GCP, and Azure.\n- Implement security best practices, IAM policies, and networking configurations across multi-cloud platforms.\n- Monitor and optimize cloud costs.</p>\n<p><strong>Kubernetes &amp; Containerization:</strong>\n- Deploy, manage, and scale applications using Kubernetes (EKS, AKS, GKE).\n- Implement Helm charts, Operators, and service mesh technologies like Istio or Linkerd.\n- Automate Kubernetes deployments using GitOps tools (ArgoCD, Flux).</p>\n<p><strong>Terraform &amp; Infrastructure as Code:</strong>\n- Develop and maintain Infrastructure as Code using Terraform.\n- Manage cloud infrastructure provisioning and automation through Terraform modules.\n- Optimize Terraform workflows and ensure best practices in state management.</p>\n<p><strong>CI/CD &amp; Automation:</strong>\n- Develop and maintain CI/CD pipelines using Jenkins, GitHub Actions, GitLab CI, CircleCI, or Azure DevOps.\n- Automate infrastructure provisioning using Terraform, CloudFormation, or Pulumi.\n- Implement Configuration Management tools like Ansible, Chef, Puppet, or SaltStack.</p>\n<p><strong>Monitoring, Logging &amp; Security:</strong>\n- Set up monitoring and alerting using Prometheus, Grafana, Datadog, or New Relic.\n- Centralize logging using ELK Stack, Loki, or Splunk.\n- Implement security best practices for DevOps workflows (Secrets Management, SAST, DAST).</p>\n<p><strong>Scripting &amp; Development:</strong>\n- Write automation scripts using Python, Bash, Go, or PowerShell.\n- Develop and optimize infrastructure-as-code templates.</p>\n<p><strong>Collaboration &amp; Best Practices:</strong>\n- Work closely with development, security, and operations teams to optimize deployments.\n- Implement DevSecOps principles for secure development pipelines.\n- Drive SRE (Site Reliability Engineering) practices for operational excellence.</p>\n<p><strong>Preferred Skills:</strong>\n- 4+ years of experience in DevOps and cloud engineering.\n- Hands-on expertise with Azure, GCP, and AWS cloud platforms.\n- Strong experience with Kubernetes (EKS, AKS, GKE) and container orchestration.\n- Expert-level knowledge of Terraform for Infrastructure as Code.\n- Expertise in CI/CD tools (Jenkins, GitLab CI/CD, GitHub Actions, Azure DevOps, etc.).\n- Strong scripting experience in Python, Bash, or Go.\n- Experience with monitoring, logging, and alerting tools.\n- Solid knowledge of security best practices in DevOps.\n- Strong problem-solving and troubleshooting skills.\n- Excellent communication and collaboration abilities.</p>\n<p><strong>Preferred Qualifications:</strong>\n- Certifications in Azure (Azure DevOps Engineer Expert), AWS (AWS Certified DevOps Engineer) or GCP (Professional DevOps Engineer)\n- Experience with serverless technologies (AWS Lambda, Google Cloud Functions).\n- Knowledge of service mesh tools (Istio, Linkerd).\n- Experience with Kubernetes operators and Helm chart development.</p>\n<p>Interested applicants, please share your resume to hr@enfintechnologies.com along with your CCTC, ECTC, &amp; Notice period.</p>",
        "tags": [
            "4+ Years",
            "Azure",
            "Kubernetes",
            "Terraform"
        ],
        "summary": "Enfin Technologies is hiring a Senior DevOps Engineer. You will be responsible for managing CI/CD pipelines and automating cloud infrastructure across multiple cloud platforms."
    },
    {
        "job_title": "Junior Data Entry Operator",
        "company": "Bilagos Softwares (P) Ltd",
        "url": "https://technopark.org/job-details/23335",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Junior Data Entry Operator</h2>\n<p><strong>Bilagos Softwares (P) Ltd</strong>\nModule No. 2802, 8th Floor Yamuna, SEZ IT Building, Phase III Campus, Technopark, Trivandrum, Kerala, 695583\n<a href=\"http://www.bilagos.com\">http://www.bilagos.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> hr@bilagos.in</p>\n<p><strong>Description:</strong>\nThis is an entry-level position intended to handle the back-office operation of SEMINE software.</p>\n<p><strong>Responsibilities:</strong>\n- Correct text that was wrongly read by the machine.\n- Compare the actual document and machine-parsed document displayed side by side.\n- Manual correction of invoices.</p>\n<p><strong>Preferred Skills:</strong>\n- Strong communication skills in English\n- Basic understanding of billing systems and terminology</p>\n<p><strong>Qualification:</strong>\n- Any degree or diploma\n- Background in accounting or commerce is a plus</p>\n<p>We are actively seeking candidates based in Trivandrum.</p>",
        "tags": [
            "Entry Level",
            "Data Entry",
            "Billing Systems",
            "Accounting"
        ],
        "summary": "Entry-level data entry role at Bilagos Softwares, focusing on correcting machine-parsed text, particularly invoices. Accounting background and strong communication skills are preferred."
    },
    {
        "job_title": "Lead Totara Developer",
        "company": "Inapp Information Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23334",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Lead Totara Developer</h2>\n<p><strong>InApp Information Technologies India (P) Ltd</strong>\n209 S, 9th Floor, Yamuna, Technopark Phase 3., 695583\n<a href=\"http://www.inapp.com\">http://www.inapp.com</a></p>\n<p><strong>Closing Date:</strong> 09, Oct 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> careers@inapp.com</p>\n<p><strong>Location:</strong> Trivandrum, Kochi, Remote/Hybrid\n<strong>Timing:</strong> US shift - 2PM- 11PM IST</p>\n<h3>Role Overview</h3>\n<p>Lead Totara Developer with expertise in Totara LMS and strong PHP, database, and API development skills. The ideal candidate should have excellent communication skills, be capable of understanding and troubleshooting existing Totara code, and work towards enhancing and optimizing LMS performance. While prior experience in Docker and PHP Unit testing is a plus, the ability to understand and modify existing LMS code with minimal supervision is crucial.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Technical Responsibilities:</strong></p>\n<ul>\n<li>Develop, customize, and optimize Totara LMS to meet business and user needs.</li>\n<li>Read and interpret existing Totara code to troubleshoot, enhance, and integrate new functionalities.</li>\n<li>Implement and refine Totara API usage for enhanced system functionality.</li>\n<li>Conduct database queries, including JOIN operations, ensuring efficiency and accuracy.</li>\n<li>Identify and fix security vulnerabilities, including XSS and SQL injection risks.</li>\n<li>Implement and maintain unit testing (PHPUnit) for custom features and improvements.</li>\n<li>Optimize LMS performance, including troubleshooting slow database queries and system lag.</li>\n</ul>\n<p><strong>Functional Responsibilities:</strong></p>\n<ul>\n<li>Collaborate with cross-functional teams to understand requirements and translate them into technical implementations.</li>\n<li>Guide junior developers in best practices related to Totara customization and PHP development.</li>\n<li>Participate in code reviews and documentation to maintain high development standards.</li>\n<li>Work closely with QA and DevOps teams to ensure smooth deployment and version control.</li>\n<li>Ensure compliance with e-learning standards like SCORM, xAPI, and LTI.</li>\n</ul>\n<h3>Required Technical Skills:</h3>\n<ul>\n<li><strong>Totara LMS Development</strong> – Experience in customizing, troubleshooting, and extending LMS functionalities.</li>\n<li><strong>PHP</strong> – Strong hands-on experience in writing and reviewing secure, optimized PHP code.</li>\n<li><strong>Database Management</strong> – Ability to write efficient SQL queries, including JOIN operations.</li>\n<li><strong>API Development</strong> – Familiarity with Totara APIs like get_string(), web services, and RESTful API integration.</li>\n<li><strong>Security Best Practices</strong> – Knowledge of preventing XSS vulnerabilities, input validation, and sanitization.</li>\n<li><strong>Performance Optimization</strong> – Ability to analyze and optimize LMS performance issues.</li>\n</ul>\n<h3>Preferred Skills &amp; Tools:</h3>\n<ul>\n<li>Docker &amp; Containerization – Understanding of containerized LMS deployments.</li>\n<li>Unit Testing (PHPUnit) – Experience in writing and executing automated tests for PHP-based applications.</li>\n<li>DevOps &amp; CI/CD – Familiarity with Git, Jenkins, and automated deployment workflows.</li>\n<li>Cloud &amp; Server Management – Experience with AWS, Linux, and Nginx/Apache.</li>\n</ul>\n<h3>Soft Skills &amp; Competencies:</h3>\n<ul>\n<li>Excellent communication skills – Ability to clearly articulate technical concepts and collaborate with teams.</li>\n<li>Problem-solving mindset – Capable of troubleshooting and identifying root causes in LMS issues.</li>\n<li>Self-driven &amp; Independent – Can read and modify existing LMS code with minimal guidance.</li>\n<li>Attention to detail – Ensures code quality, security, and performance optimizations.</li>\n</ul>\n<p>Interested candidates please share your resumes to careers@inapp.com</p>",
        "tags": [
            "12+ Years",
            "Totara LMS",
            "PHP",
            "API Development"
        ],
        "summary": "We are looking for a Lead Totara Developer to customize and optimize our Totara LMS, use your strong PHP, database, and API skills. Apply at careers@inapp.com"
    },
    {
        "job_title": "Business Development Associate",
        "company": "Nxtgenix Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23333",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Business Development Associate</h2>\n<p><strong>Nxtgenix Solutions (P) Ltd</strong> is seeking a motivated Business Development Associate to join our team. This is an excellent opportunity to begin or advance your career in sales and business development within a growing company.</p>\n<p><strong>About Us:</strong>\nNxtGenix Solutions is a cutting-edge UI/UX design studio founded in 2021, specializing in creating next-generation digital products. We are dedicated to delivering innovative and user-centric solutions that transform brands and empower businesses. Our expertise lies in UI/UX Design, Web Development, Product Marketing, and Brand Strategy, helping our clients enhance their digital presence and drive business growth.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Reach out to potential clients and build strong relationships.</li>\n<li>Clearly explain our products and services to prospects.</li>\n<li>Collaborate with the team to plan and achieve sales targets.</li>\n<li>Manage leads and follow up to convert them into opportunities.</li>\n<li>Share ideas to improve client engagement strategies.</li>\n</ul>\n<p><strong>Why Work With Us:</strong></p>\n<ul>\n<li>Be part of a growing company where your work makes a significant difference.</li>\n<li>Work within a supportive team that values your input.</li>\n<li>Acquire new skills and assume responsibility from day one.</li>\n</ul>\n<p><strong>Skills Required:</strong></p>\n<ul>\n<li>0–1 years of experience in sales or business development (fresh graduates with a strong interest in sales and marketing are encouraged to apply).</li>\n<li>Good communication and interpersonal skills.</li>\n<li>Interest in technology and digital products.</li>\n<li>Goal-focused and self-motivated.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Bachelor’s degree in any field.</li>\n</ul>\n<p><strong>How to Apply:</strong>\nSend your resume to hr@nxtgenix.com with the subject line: Business Development Associate.</p>\n<p><strong>Contact Information:</strong>\nNxtgenix Solutions (P) Ltd\n6th Floor, STPI Building, Technopark, Karyavattom P.O, Thiruvananthapuram - 695 581, 695581\nWebsite: https://www.nxtgenix.design\nContact Email: hr@nxtgenix.com</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>",
        "tags": [
            "0-1 Years",
            "Sales",
            "Business Development",
            "Communication Skills"
        ],
        "summary": "NxtGenix Solutions is seeking a Business Development Associate to build client relationships and drive sales. The ideal candidate will have strong communication skills and an interest in technology."
    },
    {
        "job_title": "Fullstack Developer (.NET ,Angular)",
        "company": "Inapp Information Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23332",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Fullstack Developer (.NET, Angular)</h2>\n<p><strong>InApp Information Technologies India (P) Ltd</strong>\n209 S, 9th Floor, Yamuna, Technopark Phase 3, 695583\n<a href=\"http://www.inapp.com\">http://www.inapp.com</a></p>\n<p><strong>Closing Date:</strong> 09, Oct 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> careers@inapp.com</p>\n<p><strong>Role:</strong> Fullstack Developer (.NET, Angular)\n<strong>Experience:</strong> 5-7 years</p>\n<p><strong>Job Summary</strong>\nWe are seeking a highly skilled Full Stack .NET Software Developer with extensive expertise in .NET Core and Angular (version 12 or higher). This key role involves building robust, scalable, and secure enterprise applications leveraging the latest Microsoft technologies and cloud-native practices on Microsoft Azure. The role requires collaboration across cross-functional teams to deliver high-quality software solutions that meet both technical and business objectives.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>Application Design:</strong> Participate in feature discussions, story planning, and the development of scalable, high-performance applications using .NET and Azure.</li>\n<li><strong>Code Quality &amp; Reviews:</strong> Write clean, maintainable, and well-documented code. Conduct and participate in peer code reviews to ensure adherence to coding standards, performance, and security practices.</li>\n<li><strong>Stakeholder Collaboration:</strong> Work closely with product owners, business analysts, QA engineers, and other stakeholders to translate business requirements into technical specifications and deliver quality features.</li>\n<li><strong>Legacy Modernization:</strong> Lead or support initiatives to migrate and modernize legacy applications to Azure cloud platforms, including planning, implementation, and optimization.</li>\n</ul>\n<p><strong>Technology Stack</strong></p>\n<ul>\n<li><strong>Languages &amp; Frameworks:</strong> C#, .NET Core (5.0+), Angular (12+)</li>\n<li><strong>Frontend Technologies:</strong> HTML5, CSS3, JavaScript, TypeScript, Angular</li>\n<li><strong>Databases:</strong> SQL Server (2019+), Entity Framework, MongoDB, Cosmos DB, OpenSearch/Elasticsearch</li>\n<li><strong>Cloud &amp; Infrastructure:</strong> Microsoft Azure: Azure Storage, Azure DevOps, Load Balancing, Monitoring, Containerization (Docker/Kubernetes)</li>\n<li><strong>DevOps &amp; CI/CD Tools:</strong> Git, Azure DevOps Pipelines, GitHub Actions</li>\n<li><strong>Security:</strong> Single Sign-On (SSO), Identity Server, JWT</li>\n<li><strong>Other Tools &amp; Technologies:</strong> RabbitMQ, Redis, IIS, PowerShell, Swagger, SSIS</li>\n<li><strong>Testing &amp; QA:</strong> xUnit, NUnit, Selenium</li>\n</ul>\n<p>Interested candidates, please share your resumes to careers@inapp.com.</p>",
        "tags": [
            "5-7 Years",
            ".NET Core",
            "Angular",
            "Azure"
        ],
        "summary": "Seeking a Full Stack .NET Developer proficient in .NET Core and Angular to build scalable enterprise applications on Azure. This role involves collaborating with cross-functional teams to deliver high-quality software."
    },
    {
        "job_title": "Developer (Fresher)",
        "company": "Awdar Software Solutions Llp",
        "url": "https://technopark.org/job-details/23331",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>AWDAR Software Solutions - Walk-In Developer (Fresher)</h2>\n<p><strong>About Us:</strong>\nAwdar Software Solutions is a growing IT company committed to building innovative and reliable software solutions. We're seeking passionate freshers eager to learn and contribute.</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> 11th Sept 2025 - 19th Sept 2025\n*   <strong>Time:</strong> 10:00 AM - 3:00 PM\n*   <strong>Venue:</strong> Awdar Software Solutions, Technopark Phase III, Trivandrum</p>\n<p><strong>Eligibility:</strong>\n*   Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field (e.g., B.Tech CS, M.Sc. CS, MCA, BCA, B.Sc. CS, Polytechnic Diploma).\n*   Strong fundamentals in programming, logical thinking, and problem-solving.\n*   Willingness to learn and adapt to new technologies.</p>\n<p><strong>Probation &amp; Conditions:</strong>\n*   6-month probation period with a stipend.\n*   Potential full-time job offer after successful probation.\n*   Stipend repayment required if job offer is rejected.\n*   No obligation if the company doesn't offer a job after probation.</p>\n<p><strong>What We Offer:</strong>\n*   Hands-on experience in live projects.\n*   Guidance and mentorship from experienced professionals.\n*   Opportunity to build a long-term career.</p>\n<p><strong>Preferred Skills:</strong>\n*   Knowledge of programming languages such as Java, Python, C#, or JavaScript.\n*   Understanding of web technologies (HTML, CSS, JS) or databases (SQL, MySQL).\n*   Familiarity with software development concepts and SDLC.</p>\n<p><strong>Documents to Carry:</strong>\n*   Updated resume\n*   Original and photocopy of educational certificates\n*   ID proof (Aadhar, Passport, Driving License, etc.)</p>\n<p><strong>Interview Process:</strong>\n*   Written/technical assessment\n*   Technical interview\n*   HR discussion</p>\n<p><strong>Walk-In Entry Pass</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.\nCandidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App</strong>\n*   Click here to download the Mobile App for Android\n*   Click here to download the Mobile App for iOS</p>\n<p><strong>Website URL</strong>\nvms.technopark.org\n*   Click here for the User Manual</p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong>\n*   <strong>Email:</strong> hr@awdar-solutions.com\n*   <strong>Phone:</strong> 8590197457</p>\n<p><strong>Address:</strong>\nAWDAR SOFTWARE SOLUTIONS LLP\nModule No 2301, 3rd Floor, Yamuna Building, Technopark Phase 3, Trivandrum, 695583\nhttps://ainexit.com</p>\n<p><strong>Appointment Confirmation:</strong>\nBefore coming for the walk-in interview, please confirm your attendance:\n*   <strong>Email:</strong> hr@awdar-solutions.com\n*   <strong>Phone:</strong> 8590197457</p>",
        "tags": [
            "0 Years",
            "Java",
            "Python",
            "JavaScript"
        ],
        "summary": "Awdar Software Solutions is hiring freshers for Developer roles. This walk-in interview offers hands-on experience and mentorship for a long-term career."
    },
    {
        "job_title": "Developer (Fresher)",
        "company": "Awdar Software Solutions Llp",
        "url": "https://technopark.org/job-details/23330",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Awdar Software Solutions - Developer (Fresher) Walk-In Interview</h2>\n<p><strong>About Awdar Software Solutions:</strong>\nAwdar Software Solutions is a growing IT company committed to building innovative and reliable software solutions for clients across industries. They are looking for passionate freshers to join their team as Developers.</p>\n<p><strong>Walk-In Interview Details:</strong>\n*   <strong>Date:</strong> September 11, 2025 - September 19, 2025\n*   <strong>Time:</strong> 10:00 AM to 3:00 PM\n*   <strong>Venue:</strong> Awdar Software Solutions, Module No 2301, Third Floor, Yamuna Building, Technopark Phase 3, Trivandrum, 695583\n*   <strong>Website:</strong> <a href=\"https://ainexit.com\">https://ainexit.com</a></p>\n<p><strong>Eligibility:</strong>\n*   Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field (e.g., B. Tech CS, M.Sc. CS, MCA, BCA, B.Sc. CS, Polytechnic Diploma).\n*   Strong fundamentals in programming, logical thinking, and problem-solving.\n*   Willingness to learn and adapt to new technologies.</p>\n<p><strong>What They Offer:</strong>\n*   Hands-on experience in live projects.\n*   Guidance and mentorship from experienced professionals.\n*   Opportunity to build a long-term career in a growing software company.</p>\n<p><strong>Probation &amp; Conditions:</strong>\n*   Selected candidates will undergo a 6-month probation period with a stipend.\n*   After successful completion of probation, the company may provide a full-time job offer.\n*   If a candidate rejects the job offer, they will be required to return the stipend received during probation.\n*   If the company does not provide a job offer after probation, the candidate can leave without any obligation or repayment.</p>\n<p><strong>Preferred Skills:</strong>\n*   Knowledge of programming languages such as Java, Python, C#, or JavaScript.\n*   Understanding of web technologies (HTML, CSS, JS) or databases (SQL, MySQL).\n*   Familiarity with software development concepts and SDLC.</p>\n<p><strong>Documents to Carry:</strong>\n*   Updated resume\n*   Original /photocopy of educational certificates\n*   ID proof (Aadhar, Passport, Driving License, etc.)</p>\n<p><strong>Interview Process:</strong>\n1.  Written/technical assessment\n2.  Technical interview\n3.  HR discussion</p>\n<p><strong>Appointment Confirmation:</strong>\nBefore coming for the walk-in interview, please confirm your attendance:\n*   <strong>Phone:</strong> 8590197457\n*   <strong>Email:</strong> hr@awdar-solutions.com</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser.</p>\n<ul>\n<li><strong>Website URL:</strong> vms.technopark.org</li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong>\n*   <strong>Email:</strong> hr@awdar-solutions.com</p>",
        "tags": [
            "Fresher",
            "Java",
            "Python",
            "SQL"
        ],
        "summary": "Awdar Software Solutions is hiring freshers for Developer roles. Candidates should have strong programming fundamentals and a willingness to learn, for a 6-month probation leading to a full-time offer."
    },
    {
        "job_title": "Market Research & Business Support Associate (Fresher)",
        "company": "Nxtlive Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23329",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Market Research &amp; Business Support Associate (Fresher)</h2>\n<p>NXTLIVE TECHNOLOGIES (P) Ltd is seeking a Market Research &amp; Business Support Associate to join their team. This role involves conducting market research, analyzing data, and preparing materials to support marketing and sales strategies. This is not a sales role; instead, the focus is on research, analysis, and content preparation.</p>\n<p><strong>Contact:</strong> hrdirector@nxtlive.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Conduct market and industry research to identify potential prospects and business opportunities.</li>\n<li>Research companies, industries, and domains to create structured databases of potential clients.</li>\n<li>Support the team with competitive research, trend analysis, and insights gathering.</li>\n<li>Assist in preparing presentations, reports, and business documents for client discussions.</li>\n<li>Draft and organize content for marketing and thought leadership (basic blogs, LinkedIn posts, case studies, etc.).</li>\n<li>Support creation of client-facing materials such as brochures, decks, and company profiles.</li>\n<li>Maintain and update internal research trackers and documentation.</li>\n<li>Collaborate with cross-functional teams to support ongoing projects and initiatives.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Master's degree</li>\n<li>Strong research and analytical skills with attention to detail.</li>\n<li>Good written and verbal communication skills in English.</li>\n<li>Proficiency in MS Office/Google Workspace (Excel, PowerPoint, Docs).</li>\n<li>Ability to organize information clearly and prepare professional documents.</li>\n<li>Self-motivated, eager to learn, and open to feedback.</li>\n</ul>\n<p><strong>Job Details:</strong></p>\n<ul>\n<li><strong>Role:</strong> Market Research &amp; Business Support Associate (Fresher)</li>\n<li><strong>Location:</strong> [Specify – Onsite/Hybrid/Remote]</li>\n<li><strong>Type:</strong> Full-time (with training period, if applicable)</li>\n<li><strong>Experience:</strong> 0–2 years</li>\n</ul>\n<p><strong>Note:</strong>\nApply with a one-pager explaining \"how you would research and create useful insights for our team that could eventually support marketing or sales.\"</p>\n<p><strong>Company Information:</strong>\nNXTLIVE TECHNOLOGIES (P) Ltd\nThejaswini Building, C-15 B\n695581\nhttp://www.nxtlive.com</p>\n<p><strong>Important Dates:</strong>\n- <strong>Closing Date:</strong> 03, Oct 2025\n- <strong>Job Published:</strong> 09, Sept 2025</p>",
        "tags": [
            "0-2 Years",
            "Market Research",
            "Data Analysis",
            "Content Creation"
        ],
        "summary": "NXTLIVE TECHNOLOGIES is hiring a Market Research & Business Support Associate to conduct research and prepare marketing materials. The ideal candidate will have strong analytical and communication skills."
    },
    {
        "job_title": "Data Scientist",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23326",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Data Scientist</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Data Scientist to join our team. We are a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to clients across the globe for more than 16 years.</p>\n<p><strong>About Techversant:</strong>\nTechversant provides Technology services in Digital Transformation, understanding evolving Industrial Scenarios, Investment Priorities, and Technology Disruption. We offer expertise in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, and Business Intelligence.</p>\n<p><strong>Responsibilities:</strong>\n- Data mining or extracting usable data from valuable data sources.\n- Using machine learning tools to select features, create and optimize classifiers.\n- Carrying out the preprocessing of structured and unstructured data.\n- Enhancing data collection procedures to include all relevant information for developing analytic systems.\n- Processing, cleansing, and validating the integrity of data to be used for analysis.\n- Analyzing large amounts of information to find patterns and solutions.\n- Developing prediction systems and machine learning algorithms.\n- Presenting results in a clear manner.\n- Propose solutions and strategies to tackle business challenges.\n- Collaborate with Business and IT teams.</p>\n<p><strong>Preferred Skills:</strong>\n- Programming Skills: knowledge of statistical programming languages like R, Python, and database query languages like SQL, Hive, Pig.\n- 4+ years of experience as a data scientist.\n- Familiarity with Scala, Java, or C++ is an added advantage.\n- Statistics: Good applied statistical skills, including knowledge of statistical tests, distributions, regression, maximum likelihood estimators, etc.\n- Machine Learning: good knowledge of machine learning methods like k-Nearest Neighbors, Naive Bayes, SVM, Decision Forests.\n- Strong Math Skills (Multivariable Calculus and Linear Algebra).\n- Data Wrangling: proficiency in handling imperfections in data.\n- Experience with Data Visualization Tools like matplotlib, ggplot, d3.js, Tableau.\n- Excellent Communication Skills.\n- Strong Software Engineering Background.\n- Hands-on experience with data science tools.\n- Problem-solving aptitude.\n- Analytical mind and great business sense.\n- Degree in Computer Science, Engineering or relevant field is preferred\n- Proven Experience as Data Analyst or Data Scientist</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p><strong>Contact Information:</strong>\n- Techversant Infotech (P) Ltd, Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\n- <a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a>\n- Contact Email: careers@techversantinfotech.com</p>",
        "tags": [
            "4+ Years",
            "Python",
            "Machine Learning",
            "Data Visualization"
        ],
        "summary": "Techversant Infotech is looking for a Data Scientist to extract valuable insights from data and develop machine learning algorithms. The role involves collaborating with teams to solve business challenges."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23325",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Senior AI/ML Engineer to develop and drive new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 19, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<h3>Job Description</h3>\n<ul>\n<li>Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.</li>\n<li>Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs) and diffusion models for a range of use cases involving text, code, and multi-modal data.</li>\n<li>Build Scalable Recommendation Engines: Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.</li>\n<li>Cloud-Native ML Engineering: Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.</li>\n<li>End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.</li>\n<li>Collaborate Across Functions: Work with cross-functional teams including product managers, engineers, and data scientists to translate business goals into AI-powered solutions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Minimum 4 years of experience in building and deploying production-level ML/DL systems</li>\n<li>Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Strong understanding of transformer architectures and deep learning model design</li>\n<li>Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution</li>\n<li>Expertise in Python programming with a focus on:</li>\n<li>Code optimization and profiling</li>\n<li>Multi-threading and multiprocessing</li>\n<li>Object-oriented programming and design principles</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<h3>Technical Stack</h3>\n<ul>\n<li><strong>Languages</strong>: Excellent understanding of object-oriented concepts and Python.</li>\n<li><strong>ML/DL Frameworks</strong>:</li>\n<li>Machine Learning: Scikit-learn, XGBoost, LightGBM</li>\n<li>Deep Learning: PyTorch, TensorFlow, Keras</li>\n<li>GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework</li>\n<li><strong>Cloud &amp; MLOps</strong>: AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes</li>\n<li><strong>Data &amp; Compute</strong>: Apache Spark, BigQuery, RabbitMQ, S3, EC2</li>\n<li><strong>Embedding Stores &amp; Vector Search</strong>: FAISS, Pinecone, ChromaDB</li>\n<li><strong>Orchestration &amp; APIs</strong>: Apache Airflow, Docker Deployment, and FastAPI are a must</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience with multi-modal models combining text, vision, or audio</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct)</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure)</li>\n</ul>\n<h3>Education</h3>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field</li>\n<li>Equivalent practical experience in developing scalable AI solutions will also be considered</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption. We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>Module No</strong>: 2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "4+ Years",
            "Python",
            "Deep Learning",
            "Generative AI"
        ],
        "summary": "Techversant is looking for a Senior AI/ML Engineer to develop AI solutions and drive business opportunities. This role involves creating ML models, Generative AI systems, and cloud-native deployments."
    },
    {
        "job_title": "Lead React Native Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23324",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Lead React Native Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\n<a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 19, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>What’s important to us:</h3>\n<p>As a Lead- React Native Developer, you will lead the development and maintenance of our mobile applications using React Native. You will collaborate closely with cross-functional teams, including backend developers, to deliver high-quality, scalable, and user-friendly mobile solutions. The ideal candidate should have extensive experience in React Native development, possess a deep understanding of mobile application development best practices, and demonstrate leadership abilities to guide and mentor junior team members.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Lead the development and implementation of mobile applications using React Native.</li>\n<li>Collaborate with cross-functional teams to gather and analyze project requirements.</li>\n<li>Previous ownership of app development projects is required.</li>\n<li>Develop automated tests to guarantee the product’s top-notch quality.</li>\n<li>Stay updated with the latest advancements and changes in mobile platforms and technologies.</li>\n<li>Provide technical supervision and support to mentor the team effectively.</li>\n<li>Conduct code reviews to ensure adherence to coding standards, best practices, and maintain code quality.</li>\n<li>Ensure the application is published and maintained in both the App Store and Google Play Store, adhering to their respective policies and guidelines.</li>\n<li>Participate in agile development processes, including sprint planning, estimation, and retrospectives.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>10+ years of experience in React Native Development, Minimum 3 yrs in Lead role.</li>\n<li>Expert-level proficiency in JavaScript, TypeScript, and React Native framework.</li>\n<li>Demonstrated hands-on experience in designing and developing applications using React Native, iOS and Android platforms.</li>\n<li>Capability to plan the core architecture and iteratively enhance it as needed.</li>\n<li>Strong analytical mindset to extract actionable insights from data.</li>\n<li>Excellent Team management and communication skills.</li>\n<li>Experience with RESTful APIs and integration of third-party libraries and APIs.</li>\n<li>Possess a comprehensive understanding of React Native.</li>\n<li>Capable of understanding the company’s business needs and adjusting or innovating the product accordingly.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>",
        "tags": [
            "10+ Years",
            "React Native",
            "JavaScript",
            "TypeScript"
        ],
        "summary": "Techversant is seeking a Lead React Native Developer to lead mobile application development and maintenance. The role requires expertise in React Native, JavaScript, and TypeScript, along with strong leadership skills."
    },
    {
        "job_title": "AI/ML – Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23323",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>AI/ML Architect</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a visionary and hands-on AI Solution Architect to lead the design and delivery of robust AI-driven applications. This client-facing role requires someone who can conceptualize solutions, guide teams, and stay abreast of emerging AI trends.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company with over 16 years of experience, providing high-quality end-to-end IT Solutions and Services. They offer expertise in Digital Transformation and various technology domains, including Artificial Intelligence and Data Science.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Client Engagement &amp; Consulting:</strong><ul>\n<li>Interact with clients to understand business problems.</li>\n<li>Translate needs into AI/ML opportunities and articulate solution strategies.</li>\n<li>Present solution architectures, effort estimates, timelines, and potential ROI.</li>\n</ul>\n</li>\n<li><strong>Solution Design &amp; Architecture:</strong><ul>\n<li>Define end-to-end AI architecture, including data pipelines, model selection, AI engines, integration layers, APIs, and deployment strategies.</li>\n<li>Select appropriate AI/ML/DL algorithms, frameworks, and platforms.</li>\n<li>Ensure scalability, modularity, security, and performance optimization.</li>\n</ul>\n</li>\n<li><strong>Hands-On Development:</strong><ul>\n<li>Develop critical components or proof-of-concepts.</li>\n<li>Design and code for pipelines, model training, inferencing, or integrations.</li>\n<li>Create reusable components and automation scripts.</li>\n</ul>\n</li>\n<li><strong>Team Leadership &amp; Delivery Oversight:</strong><ul>\n<li>Build and mentor a high-performing AI development team.</li>\n<li>Drive agile development cycles for timely and quality delivery.</li>\n<li>Collaborate with DevOps, Product Managers, and QA teams.</li>\n</ul>\n</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>AI/ML/DL Expertise:</strong><ul>\n<li>Experience with supervised, unsupervised, and reinforcement learning.</li>\n<li>Knowledge of ML algorithms (e.g., XGBoost, SVM, Random Forest) and DL architectures (CNNs, RNNs, Transformers, LLMs).</li>\n<li>Hands-on experience with Python, PyTorch, TensorFlow, Keras, Scikit-learn, Hugging Face, etc.</li>\n</ul>\n</li>\n<li><strong>Architecture &amp; System Design:</strong><ul>\n<li>Strong grasp on designing large-scale AI/ML pipelines using microservices, APIs, and cloud-native architecture.</li>\n<li>Experience designing MLOps workflows (CI/CD for ML) using tools like MLflow, Kubeflow, Airflow, DVC.</li>\n</ul>\n</li>\n<li><strong>Cloud &amp; Platforms:</strong><ul>\n<li>Proficient in AWS/GCP/Azure AI/ML services (e.g., SageMaker, Vertex AI, Azure ML Studio).</li>\n<li>Familiarity with vector databases (e.g., FAISS, Pinecone), model versioning, and deployment strategies (e.g., REST APIs, gRPC, containers, Kubernetes).</li>\n</ul>\n</li>\n<li><strong>Data Engineering:</strong><ul>\n<li>Working knowledge of data wrangling, preprocessing, ETL, feature engineering, data versioning.</li>\n<li>Tools: Spark, Pandas, Snowflake, Kafka, Databricks, Delta Lake.</li>\n</ul>\n</li>\n<li><strong>Product &amp; Project Ownership:</strong><ul>\n<li>Ability to estimate efforts, manage scope, and align delivery with client expectations.</li>\n<li>Experience in productizing AI models and integrating them into full-stack applications.</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong><ul>\n<li>Excellent communication, stakeholder management, and presentation skills.</li>\n<li>Ability to simplify complex AI concepts for non-technical stakeholders.</li>\n<li>Experience with Generative AI (LLMs, GPT, BERT, Stable Diffusion, LangChain, RAG, etc.)</li>\n<li>Knowledge of Prompt Engineering, Fine-Tuning, and RLHF</li>\n<li>Experience in NLP, Computer Vision, Time Series, or Recommendation Engines</li>\n<li>Understanding of ethical AI, explainable AI, and compliance in AI systems</li>\n<li>Publications, contributions to open-source, or AI certifications</li>\n</ul>\n</li>\n</ul>\n<h3>Education:</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Data Science, AI, or related fields.</li>\n<li>Certifications in Cloud AI/ML platforms or advanced AI specializations are a plus.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>",
        "tags": [
            "5+ Years",
            "AI/ML/DL",
            "Python",
            "Cloud Platforms"
        ],
        "summary": "Techversant is hiring an AI/ML Architect to design and deliver AI solutions, engage with clients, and mentor a development team. The role requires expertise in AI algorithms, cloud platforms, and strong communication skills."
    },
    {
        "job_title": "Python Solution Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23321",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Python Solution Architect</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Solution Architect to design and implement scalable, high-performance AI-driven applications using the latest technologies in Python, cloud, and machine learning. </p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. We offer expertise and consultation in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence, etc.</p>\n<p><strong>Job Responsibilities:</strong>\n- Architect and design end-to-end solutions using Python (Django/FastAPI/Flask), AI/ML models, and cloud-native technologies.\n- Lead AI/ML-driven application development, including model deployment, data pipelines, and intelligent automation.\n- Collaborate with data scientists, engineers, and product teams to integrate AI/ML models into scalable applications.\n- Optimize system performance, ensuring scalability, cost efficiency, and security.\n- Implement microservices architecture with APIs, containerization (Docker/Kubernetes), and event-driven design.\n- Drive best DevOps practices with CI/CD pipelines, MLOps, Infrastructure as Code (Terraform, CloudFormation), and automated testing.</p>\n<p><strong>Preferred Skills:</strong>\n- Python &amp; Full Stack: Django, FastAPI, Flask, React, Angular, or Vue.js.\n- AI/ML &amp; Data Science: TensorFlow, PyTorch, Scikit-learn, NLP, Computer Vision, or MLOps.\n- Cloud &amp; DevOps: AWS, Azure, or GCP with Kubernetes &amp; CI/CD.\n- Big Data &amp; Databases: PostgreSQL, MongoDB, Redis, Snowflake, or Spark.\n- Architecture &amp; Security: Microservices, API Gateway, Event-Driven Systems, and best security practices.</p>\n<p><strong>Ideal Experience Level:</strong>\n- 10+ years in software development with strong Python expertise, including full-stack development.\n- 2+ years of experience as a Solution Architect, with demonstrated success in leading and delivering enterprise-level projects.\n- Strong AI/ML experience, specifically in model deployment, data engineering, and cloud integration</p>\n<p><strong>Nice-to-Have Skills:</strong>\n- Hands-on experience with LLMs, Generative AI, or Reinforcement Learning.\n- Expertise in GraphQL, Serverless (AWS Lambda, Firebase), and Edge AI.\n- Experience with data engineering, real-time analytics, and feature stores.</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p><strong>Contact Information</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\nhttp://www.techversantinfotech.com\nContact Email: careers@techversantinfotech.com</p>",
        "tags": [
            "10+ Years",
            "Python",
            "AI/ML",
            "Cloud"
        ],
        "summary": "Techversant is looking for a Python Solution Architect to design AI applications. The role involves leading AI/ML development and optimizing system performance using cloud technologies."
    },
    {
        "job_title": "AI/ML – Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23320",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>AI/ML Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a highly skilled and experienced AI/ML Lead to lead the design and implementation of our artificial intelligence and machine learning solutions. The successful candidate will work closely with cross-functional teams to understand business requirements and develop scalable, efficient, and robust AI/ML systems.</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption. We offer expertise and consultation in multiple technology domains.</p>\n<p><strong>Job Description:</strong>\nAs an AI/ML Lead, you will:\n- Build Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and generative models.\n- Define, design, and deliver ML architecture patterns operable in native and hybrid cloud architectures.\n- Implement machine learning algorithms in services and pipelines that can be used on a web scale.\n- Create demos and proofs of concept, develop AI/ML based products and services.\n- Create Functional and technical specifications for AI &amp; ML solutions.\n- Follow SDLC process.\n- Apply advanced analytical knowledge of data and data conditioning.\n- Program advanced computing and developing algorithms.\n- Develop software, data models and execute predictive analysis.\n- Design, develop, and implement generative AI models using state-of-the-art techniques.\n- Collaborate with cross-functional teams to define project goals, research requirements and develop innovative solutions.</p>\n<p><strong>Qualifications:</strong>\n- Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).\n- Strong proficiency in SQL, NO SQL Databases.\n- Experience in implementing and deploying AI/ Machine Learning solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)\n- Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.\n- Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g. Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</p>\n<p><strong>Preferred Skills:</strong>\n- Experience in production software engineering routines in DevOps/MLOps (e.g. Continuous Code Integration and Deployment).\n- Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</p>\n<p><strong>Experience and Qualification:</strong>\n- B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p><strong>Contact Information:</strong>\ncareers@techversantinfotech.com</p>\n<p><strong>Location:</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "5+ Years",
            "Python",
            "AI/ML",
            "Tensorflow"
        ],
        "summary": "Techversant Infotech is seeking an AI/ML Team Lead to design and implement AI/ML solutions. The role involves defining ML architectures, implementing algorithms, and collaborating with cross-functional teams."
    }
]