[
    {
        "job_title": "Business Analyst",
        "company": "Policy4us Insurance Web Aggregator Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19570/346",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p><strong>About the Role:</strong></p>\n<p>We're seeking a talented and curious Entry-Level Business Analyst to join our growing team. You'll play a vital role in supporting data analysis initiatives, working closely with stakeholders to identify business needs, and transforming data into actionable insights that drive informed decision-making.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Assist with data collection, cleaning, and analysis using relevant tools and methodologies.</li>\n<li>Develop and maintain data reports and dashboards to communicate insights effectively.</li>\n<li>Partner with cross-functional teams to understand business needs and translate them into actionable data analysis requests.</li>\n<li>Participate in the development and implementation of data-driven strategies and solutions.</li>\n<li>Continuously learn and stay up-to-date on data analysis trends and technologies</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li><strong>Fresh Start &amp; Analytical Mind:</strong> A recent graduate with a strong foundation in data analysis concepts, statistics, and research methods.</li>\n<li><strong>Tech-Savvy:</strong> Proficiency in Microsoft Office Suite and basic knowledge of data analysis tools are preferred.</li>\n<li><strong>Communication Champion:</strong> Excellent written and verbal communication skills with the ability to present complex data insights in a clear and concise manner.</li>\n<li><strong>Problem-Solving Prowess:</strong> A keen eye for detail and a strong analytical mind to identify trends and patterns within data sets.</li>\n<li><strong>Team Player:</strong> Thrives in a collaborative environment and enjoys working with others.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hro@policy4us.com</p>",
        "tags": [
            "Entry-Level",
            "Data Analysis",
            "Microsoft Office Suite",
            "Communication Skills"
        ],
        "summary": "We are seeking an entry-level Business Analyst to support data analysis, identify business needs, and drive informed decision-making. The ideal candidate will be a recent graduate with strong analytical skills."
    },
    {
        "job_title": "SME - Denial Management",
        "company": "Zapare Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/19586/137",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>SME - Denial Management</h2>\n<p><strong>Zapare Technologies</strong> is seeking dynamic and ambitious professionals to join their team as <strong>SME - Denial Management</strong>.</p>\n<p><strong>Experience:</strong> 2-3 years</p>\n<p><strong>Skills Desired:</strong></p>\n<ul>\n<li>Detailed knowledge of US healthcare billing cycle</li>\n<li>Experience working with different EMR/EHR systems like Epic, Cerner, Allscripts, Athenahealth, NextGen, eClinicalWorks, Meditech, etc.</li>\n<li><strong>Denial analysis and management</strong><ul>\n<li>Review and analyze denied insurance claims to identify cause of denials such as coding issues, preauthorization, payer-specific policies</li>\n<li>Develop and track denial log to monitor patterns and trends in denied claims</li>\n<li>Experience talking with payers to obtain clarification with denials and initiate timely appeals when appropriate</li>\n</ul>\n</li>\n<li>Expertise in working with denial reason codes (CARC, RARC) and identifying root causes of denials.</li>\n<li>Strong understanding of billing regulations, CPT, ICD-10, HCPCS codes, and compliance standards (HIPAA, CMS guidelines).</li>\n<li><strong>Appeals</strong><ul>\n<li>Understand 1st, 2nd, 3rd, and External Level Appeal process, system, and documentation SOP</li>\n<li>Prepare, submit, and follow up on appeals ensuring all necessary documentation is included<ul>\n<li>Review assigned denials and EOB’s for appeal filing information. Gather any missing information</li>\n<li>Review case history, payer history, and state requirements to determine appeal strategy</li>\n<li>Obtain patient and/or physician consent and medical records when required by the insurance plan or state</li>\n<li>Gather and fill out all special appeal or review forms</li>\n<li>Create appeal letters, attach the materials referenced in the letter, and mail them</li>\n</ul>\n</li>\n<li>Maintain a record of all appeals and responses to track appeal outcomes and recovery rates</li>\n<li>Monitor payer response timelines to ensure appeal filing deadlines are met</li>\n<li>Track insurance company and state requirements and denial trend changes</li>\n</ul>\n</li>\n</ul>\n<p>For more details, please contact:\n+91 811 388 55 44\nhr@zaparetech.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@zaparetech.com</p>",
        "tags": [
            "2-3 Years",
            "Denial Management",
            "US Healthcare Billing Cycle",
            "Appeals"
        ],
        "summary": "Seeking a SME in Denial Management to analyze claims, manage appeals, and ensure compliance within the US healthcare billing cycle. The role requires expertise in denial reason codes and billing regulations."
    },
    {
        "job_title": "Dot Net Developer",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/19587/68",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>.Net Developer</h2>\n<p>We are seeking excellent .Net Developers to join our team of professionals.</p>\n<p><strong>Job Features:</strong></p>\n<ul>\n<li>Job Title: .Net Developer</li>\n<li>Job Position: SE</li>\n<li>Experience: 4-5 years</li>\n</ul>\n<p><strong>Job Description:</strong></p>\n<p>As a Junior Developer, you will be responsible for assisting in the development and maintenance of our web applications. You will work closely with our senior developers and other team members to implement new features, fix bugs, and ensure the overall quality of our software. This role requires a basic understanding of both front-end and back-end development, with a focus on Angular for the UI and C#/.NET for the API.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Assist in the development and maintenance of web applications using Angular for the front-end and C#/.NET for the back-end.</li>\n<li>Collaborate with senior developers to implement new features and enhancements.</li>\n<li>Write clean, maintainable, and efficient code.</li>\n<li>Debug and resolve issues in the application.</li>\n<li>Participate in code reviews and contribute to the improvement of coding standards.</li>\n<li>Work with the team to ensure the application meets performance, security, and scalability requirements.</li>\n<li>Stay up-to-date with the latest industry trends and technologies.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Basic understanding of front-end development using Angular.</li>\n<li>Basic understanding of back-end development using C# and .NET.</li>\n<li>Familiarity with RESTful APIs and web services.</li>\n<li>Knowledge of HTML, CSS, and JavaScript.</li>\n<li>Understanding of version control systems, preferably Git.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Ability to work collaboratively in a team environment.</li>\n<li>Good communication skills.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with Firebase and Azure services (Optional).</li>\n<li>Familiarity with Microsoft Identity Web and OAuth2.</li>\n<li>Knowledge of SQL and database management.</li>\n<li>Understanding of software development best practices and design patterns.</li>\n<li>Experience with Agile development methodologies.</li>\n</ul>\n<p><strong>Why Join Cubet?</strong></p>\n<ul>\n<li>Innovative Environment: Be part of a forward-thinking company that values innovation and creativity.</li>\n<li>Career Growth: Opportunities for professional development and career advancement.</li>\n<li>Collaborative Culture: Work in a supportive, team-oriented environment where your contributions are valued.</li>\n<li>Competitive Compensation: Attractive salary package and performance-based incentives.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@cubettech.com</p>",
        "tags": [
            "4-5 Years",
            ".NET",
            "Angular",
            "C#"
        ],
        "summary": "We are looking for a .Net Developer to assist in the development and maintenance of web applications. You will implement new features and fix bugs."
    },
    {
        "job_title": "AI Product Manager",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/19588/68",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>AI Product Manager</h2>\n<p>We are seeking an excellent AI Product Manager to join our team.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Define and execute the organization’s AI roadmap.</li>\n<li>Identify opportunities to leverage AI/ML in business problems or enhancing existing products.</li>\n<li>Own the end-to-end product lifecycle of AI-powered tools, including ideation, prototyping, development, testing, and launch.</li>\n<li>Act as the AI subject matter expert for all stakeholders.</li>\n<li>Monitor AI industry trends and emerging technologies.</li>\n<li>Ensure AI products comply with data privacy regulations (e.g., GDPR, HIPAA) and ethical guidelines.</li>\n<li>Present progress, insights, and strategic recommendations to leadership.</li>\n<li>Take up the mantle of new product ideas from the innovations team and plan and execute the project.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering with specialisation in Data Science or AI.</li>\n<li>6+ years of total experience, which includes product management and AI product planning.</li>\n<li>Technical understanding of machine learning algorithms, NLP, computer vision, and frameworks (e.g., TensorFlow, PyTorch).</li>\n<li>Atleast 2 years of leadership experience managing multidisciplinary teams and budgets.</li>\n<li>Excellent analytical, communication, and client management skills.</li>\n<li>Familiarity with Agile/Scrum methodologies and cloud platforms (AWS, Azure, GCP).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@cubettech.com</p>",
        "tags": [
            "6+ Years",
            "AI/ML",
            "Product Management",
            "Cloud Platforms"
        ],
        "summary": "We're looking for an AI Product Manager to define the AI roadmap and own the product lifecycle. The candidate should have 6+ years of experience and leadership skills."
    },
    {
        "job_title": "Senior Software Engineer(Laravel & JavaScript)",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/19589/68",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Senior Software Engineer (Laravel &amp; JavaScript)</h2>\n<p><strong>Job Title:</strong> Laravel Developer</p>\n<p><strong>Job Position:</strong> SE</p>\n<p><strong>Experience:</strong> 4-5 years in Laravel</p>\n<p><strong>Backend Development:</strong></p>\n<ul>\n<li>Proficiency in PHP 7+ or 8+, with a strong command of modern PHP features and practices.</li>\n<li>Good knowledge and hands-on experience in Slim Framework.</li>\n<li>Exceptionally good in JavaScript.</li>\n<li>Exceptionally good communication skills.</li>\n<li>Good to have Angular, Python Server Knowledge, PowerBI</li>\n</ul>\n<p><strong>Laravel Framework:</strong></p>\n<ul>\n<li>In-depth knowledge of Laravel's ecosystem, including MVC architecture, Eloquent ORM, blade templates, routing, and artisan commands.</li>\n</ul>\n<p><strong>Slim Knowledge:</strong></p>\n<ul>\n<li>Familiarity with Slim for lightweight applications, emphasizing middleware and dependency injection principles.</li>\n</ul>\n<p><strong>AngularJS Expertise (Good to have):</strong></p>\n<ul>\n<li>\n<p>Expertise in building dynamic single-page applications, an understanding of MVC patterns in the AngularJS framework, and experience with directives, services, and two-way data binding.</p>\n</li>\n<li>\n<p>Experience with modern HTML/CSS practices.</p>\n</li>\n</ul>\n<p><strong>Database Management:</strong></p>\n<ul>\n<li>Proficient in MariaDB or MySQL, with skills in designing databases, writing complex SQL queries, and performance tuning.</li>\n</ul>\n<p><strong>Additional Skills:</strong></p>\n<ul>\n<li><strong>Power BI:</strong> Ability to work with Power BI real-time APIs for data visualization and business intelligence role-based reporting.</li>\n<li><strong>Stripe:</strong> Experience with Stripe API integration for payment processing, Subscription management, handling webhooks, and ensuring secure transactions.</li>\n<li><strong>Image Processing:</strong> Basic understanding of image processing models and libraries (e.g., OpenCV) or experience interfacing with cloud-based services.</li>\n<li><strong>GPT APIs:</strong> Familiarity with incorporating GPT APIs for natural language processing tasks, including API management and cost considerations.</li>\n</ul>\n<p><strong>General Skills:</strong></p>\n<ul>\n<li>Familiar with version control systems like Git.</li>\n<li>Understanding of RESTful services and APIs.</li>\n<li>Ability to work in an agile development environment.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and teamwork abilities.</li>\n</ul>\n<p><strong>Why Join Cubet?</strong></p>\n<ul>\n<li>Innovative Environment: Be part of a forward-thinking company that values innovation and creativity.</li>\n<li>Career Growth: Opportunities for professional development and career advancement.</li>\n<li>Collaborative Culture: Work in a supportive, team-oriented environment where your contributions are valued.</li>\n<li>Competitive Compensation: Attractive salary package and performance-based incentives.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@cubettech.com</p>",
        "tags": [
            "4-5 Years",
            "Laravel",
            "JavaScript",
            "PHP"
        ],
        "summary": "We are looking for a Senior Software Engineer with 4-5 years of Laravel experience. Proficiency in PHP, JavaScript, and database management is essential for this role."
    },
    {
        "job_title": "AI & ML Engineer",
        "company": "Cubet Techno Labs Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/19590/68",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>AI &amp; ML Engineer</h2>\n<p>We are seeking an excellent AI &amp; ML Engineer to join our team of professionals. If you have a passion for AI and machine learning, you might be the perfect fit!</p>\n<p><strong>Job Features:</strong></p>\n<ul>\n<li><strong>Job Title:</strong> AI &amp; ML Engineer</li>\n<li><strong>Job Position:</strong> SE</li>\n<li><strong>Experience:</strong> 3+ years</li>\n</ul>\n<p><strong>Role Description:</strong></p>\n<p>As an AI &amp; ML Engineer, you will be responsible for designing and developing machine learning systems and AI products. Your role will involve implementing appropriate ML algorithms and conducting experiments to optimize performance.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Designing and constructing sophisticated machine-learning models.</li>\n<li>Refining and updating existing systems.</li>\n<li>Working with data to create models and perform statistical analysis.</li>\n<li>Training and retraining models to optimize performance.</li>\n<li>Building efficient self-learning applications.</li>\n<li>Contributing to advancements in artificial intelligence.</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul>\n<li>Proven experience as an AI or Machine Learning Engineer or similar role (data science, GenAI).</li>\n<li>Passionate about working in Gen AI product development.</li>\n<li>Understanding of LLMs, Vector DBs, Prompt Engineering etc.</li>\n<li>Understanding of data structures, data modeling, and software architecture.</li>\n<li>Deep knowledge of math, probability, statistics, and algorithms.</li>\n<li>Ability to write robust code in Python, Java, and R.</li>\n<li>Experience in version control using Github/Gitlab</li>\n<li>Experience in working with cloud services like AWS/GCP/Azure.</li>\n<li>Familiarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn).</li>\n<li>Excellent communication skills and ability to work in a team.</li>\n<li>Outstanding analytical and problem-solving skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@cubettech.com</p>",
        "tags": [
            "3+ Years",
            "Machine Learning",
            "Python",
            "LLMs"
        ],
        "summary": "We're seeking an AI/ML Engineer to design and develop machine learning systems, create sophisticated models, and contribute to AI advancements. Proficiency in Python, statistical analysis, and cloud services is essential."
    },
    {
        "job_title": "Data Science Freshers",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19578/157",
        "location": "Infopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Data Science Fresher</h2>\n<ul>\n<li>Explain the predictive models to various business users and make recommendations to drive business strategy.</li>\n<li>Make recommendations to resolve application performance problems.</li>\n<li>Implement data processing methods and tools.</li>\n<li>Collaborate with product leaders, subject matter experts, and decision-makers to develop success criteria and optimize new products, features, policies, and models.</li>\n<li>Leverage your experience in analytics tools and scientific rigor to produce actionable insights.</li>\n<li>Distill and communicate key insights to senior management in verbal, visual, and written media.</li>\n<li>Together with the Co-op department lead, determine an appropriate data science problem statement and toolset to apply during the co-op term.</li>\n<li>Determine strengths and weaknesses of data science toolsets and procedures.</li>\n</ul>\n<p><strong>Qualification</strong></p>\n<ul>\n<li>Knowledge of Machine Learning concepts (cross-validation, regularization, boosting, bootstrapping) is a plus.</li>\n<li>Working on a degree in Computer Science, or a related field, with project experience in data analysis.</li>\n<li>Experience with big data technologies (Hadoop, Hive, MongoDB, Spark).</li>\n<li>Experience with statistical analysis and data mining using tools such as R, SAS, Matlab, Stata, or SPSS.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0 Years",
            "Machine Learning",
            "Data Analysis",
            "Big Data"
        ],
        "summary": "Seeking a data science fresher to drive business strategy. This role involves implementing data processing methods, communicating insights, and working with big data technologies."
    },
    {
        "job_title": "Support Executive",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19579/157",
        "location": "Infopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Support Executive</h2>\n<p>We are looking for a proactive and customer-focused Support Executive to join our team. The ideal candidate will be responsible for resolving customer queries, providing product and service information, and ensuring a high level of customer satisfaction. You will be the first point of contact for clients, ensuring issues are addressed promptly and effectively.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Respond to customer queries via phone, email, or chat in a timely and professional manner.</li>\n<li>Provide accurate information about products and services.</li>\n<li>Troubleshoot and resolve customer issues or escalate them to appropriate departments when necessary.</li>\n<li>Maintain records of customer interactions, feedback, and complaints.</li>\n<li>Follow up with customers to ensure issues are resolved satisfactorily.</li>\n<li>Work closely with internal teams (technical, sales, operations) to support customer needs.</li>\n<li>Identify trends in customer issues and provide feedback for process improvement.</li>\n<li>Adhere to support policies and performance metrics (SLAs, CSAT scores, etc.).</li>\n</ul>\n<p><strong>Qualifications &amp; Skills:</strong></p>\n<ul>\n<li>Bachelor's degree in any discipline (preferably in Business, IT, or a related field).</li>\n<li>Prior experience in customer support or a similar role is a plus.</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong problem-solving skills and a customer-oriented attitude.</li>\n<li>Ability to multitask and manage time effectively.</li>\n<li>Proficiency in using support tools, ticketing systems (e.g., Zendesk, Freshdesk), and the MS Office suite.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Familiarity with CRM systems or helpdesk software.</li>\n<li>Multilingual skills are an advantage.</li>\n<li>Experience working in a fast-paced environment or startups</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "1+ Years",
            "Customer Support",
            "Ticketing Systems",
            "Communication Skills"
        ],
        "summary": "Seeking a Support Executive to resolve customer queries and provide product information. Requires strong communication and problem-solving skills for ensuring customer satisfaction."
    },
    {
        "job_title": "Junior Geophysicist- Fiber-optic Sensing & AI (Fresher)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19580/157",
        "location": "Infopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Junior Geophysicist - Fiber-optic Sensing &amp; AI</h2>\n<p>We are seeking a motivated Junior Geophysicist (recent graduate) to dive into projects involving Distributed Acoustic Sensing (DAS), fiber‑optic sensor data, and Python‑driven AI analysis. You’ll work closely with geophysicists, data scientists, and engineers to drive data‑centric insights and support field deployments.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Support data acquisition, preprocessing, and interpretation from fiber‑optic sensing systems (DAS/DTS).</li>\n<li>Analyze large time‑series datasets using Python (NumPy, Pandas, SciPy, Matplotlib).</li>\n<li>Collaborate with AI/ML experts to build models for signal classification, event detection, or anomaly identification.</li>\n<li>Participate in field activities, including deploying sensors, monitoring systems, and validating datasets.</li>\n<li>Document workflows, results, and technical insights clearly in reports or code comments.</li>\n</ul>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li>Bachelor's or Master's degree in Geophysics, Geoscience, Physics, Engineering, or related discipline.</li>\n<li>Fundamental understanding of seismic wave behavior and fiber‑optic sensing principles.</li>\n<li>Basic proficiency in Python and experience with data‑analysis libraries.</li>\n<li>Interest in machine learning—any exposure to scikit‑learn, TensorFlow, or PyTorch is a plus.</li>\n<li>Excellent analytical thinking, communication skills, and collaborative mindset.</li>\n</ul>\n<p><strong>Preferred (Nice-to-Have)</strong></p>\n<ul>\n<li>Experience with signal processing, time‑series analysis, or seismic inversion methods.</li>\n<li>Familiarity with version control systems (e.g., Git) and Jupyter notebooks.</li>\n<li>Willingness and physical ability to participate in occasional fieldwork and travel.</li>\n</ul>\n<p><strong>What You’ll Gain</strong></p>\n<ul>\n<li>Hands‑on experience at the intersection of geophysics, fiber‑optic sensing, and AI.</li>\n<li>Mentorship from industry professionals and cross‑disciplinary collaboration.</li>\n<li>Exposure to real‑world problems in energy, infrastructure, and environmental monitoring.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0 Years",
            "Python",
            "Fiber-optic Sensing",
            "AI/ML"
        ],
        "summary": "Seeking a Junior Geophysicist for fiber-optic sensing and AI projects, involving data analysis and field deployments. Collaborate with experts to build AI models and gain hands-on experience."
    },
    {
        "job_title": "Project Manager (Data & Analytics)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19581/157",
        "location": "Infopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Project Manager (Data &amp; Analytics)</h2>\n<p>We are looking for an experienced Project Manager – Data &amp; Analytics to lead and manage data-driven projects across various business domains. The ideal candidate will have strong experience in managing data engineering, business intelligence, and analytics projects, with a proven ability to collaborate with technical and business stakeholders to deliver high-impact solutions on time and within budget.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead end-to-end project management for data and analytics initiatives.</li>\n<li>Define project scope, goals, deliverables, timelines, and resource plans.</li>\n<li>Work closely with data engineers, data scientists, analysts, and business stakeholders.</li>\n<li>Manage project risks, issues, and dependencies proactively.</li>\n<li>Ensure quality assurance, timely reporting, and documentation throughout the project lifecycle.</li>\n<li>Communicate project status, updates, and escalations to leadership and stakeholders.</li>\n<li>Drive Agile/Scrum ceremonies and ensure timely sprint deliverables.</li>\n<li>Coordinate across cross-functional teams to ensure alignment with business objectives.</li>\n<li>Track KPIs, ROI, and business impact of analytics solutions.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Engineering, or a related field.</li>\n<li>PMP/PRINCE2 certification is a plus.</li>\n<li>7+ years of total experience with at least 3+ years in managing data analytics or data engineering projects.</li>\n<li>Strong understanding of data warehousing, ETL pipelines, data visualization, and analytics platforms.</li>\n<li>Hands-on experience working with tools/technologies like SQL, Power BI/Tableau, Python/R /R (preferred), and cloud data platforms (AWS/GCP/Azure).</li>\n<li>Strong project management skills including planning, budgeting, and stakeholder management.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "7+ Years",
            "Data Analytics",
            "SQL",
            "Project Management",
            "Data Engineering"
        ],
        "summary": "Seeking a Project Manager to lead data and analytics projects, ensuring timely delivery within budget. The role requires strong data engineering, BI, and stakeholder management skills."
    },
    {
        "job_title": "Senior Business Development Executive",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/19582/296",
        "location": "Infopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Senior Business Development Executive – IT Services</h2>\n<p><strong>Location:</strong> Infopark Kakkanad</p>\n<p><strong>Experience:</strong> 2-5 years</p>\n<p><strong>Employment Type:</strong> Full-Time</p>\n<p><strong>Job Summary:</strong>\nWe are looking for a proactive and results-driven Sr Business Development Executive to drive sales and expand our client base in IT services. The ideal candidate will identify business opportunities, develop strong client relationships, and collaborate with internal teams to deliver IT solutions tailored to customer needs.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead Generation &amp; Prospecting: Identify and generate new business opportunities through market research, networking, cold calling, and online channels.</li>\n<li>Client Relationship Management: Build and maintain strong relationships with potential and existing clients.</li>\n<li>Sales Strategy &amp; Execution: Develop sales strategies, proposals, and presentations to pitch IT services to clients.</li>\n<li>Market Research &amp; Analysis: Stay updated on industry trends, competitors, and emerging technologies to refine business strategies.</li>\n<li>Negotiation &amp; Closing Deals: Handle negotiations, prepare contracts, and close deals to meet or exceed sales targets.</li>\n<li>Collaboration with Technical Teams: Work closely with developers, project managers, and technical teams to ensure seamless service delivery.</li>\n<li>Reporting &amp; Performance Tracking: Maintain records of sales activities, leads, and client interactions.</li>\n</ul>\n<p><strong>Key Skills &amp; Requirements:</strong></p>\n<ul>\n<li>Experience in IT Services Sales (software solutions, cloud services, cybersecurity, etc.).</li>\n<li>Strong communication, negotiation, and presentation skills.</li>\n<li>Ability to identify client pain points and offer tailored IT solutions.</li>\n<li>Proficiency in CRM tools and sales tracking software.</li>\n<li>Self-motivated, target-driven, and a team player.</li>\n<li>Any degree.</li>\n</ul>\n<p>Interested candidates, please share cvs to hr@grapelime.in / binil@grapelimeinnovations.com\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at hr@grapelime.in</p>",
        "tags": [
            "2-5 Years",
            "IT Services Sales",
            "CRM",
            "Negotiation Skills"
        ],
        "summary": "Seeking a Senior Business Development Executive to boost IT service sales and expand the client base. Responsibilities include lead generation, relationship management, and strategic sales execution."
    },
    {
        "job_title": "Business Development Intern",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/19583/296",
        "location": "Infopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Business Development Intern</h2>\n<p>Ready to launch your career in business development? Join GrapeLime Innovations PVT Ltd and grow with a passionate, innovative team!</p>\n<p>Outstanding performers during the internship will have a strong chance to be offered a permanent role.</p>\n<p><strong>Location:</strong> Infopark, Kakkanad</p>\n<p><strong>Work Days:</strong> Monday to Friday (5-day work week)</p>\n<p><strong>Eligibility:</strong> Graduates from 2022, 2023, or 2024 (BTech, MCA candidates please excuse)</p>\n<p><strong>What You'll Do:</strong></p>\n<ul>\n<li>Identify and engage new sales leads</li>\n<li>Pitch and promote our services to potential clients</li>\n<li>Collaborate with cross-functional teams</li>\n<li>Tackle challenges with creativity and confidence</li>\n<li>Manage time, prioritize tasks, and meet deadlines</li>\n</ul>\n<p><strong>What We’re Looking For:</strong></p>\n<ul>\n<li>Excellent communication skills – both verbal and written (a must)</li>\n<li>Creative mindset and strong problem-solving abilities</li>\n<li>Resilience under pressure and a drive to meet goals</li>\n<li>Superb organizational and time-management skills</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your updated CV to hr@grapelime.in</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@grapelime.in</p>",
        "tags": [
            "Entry Level",
            "Business Development",
            "Communication Skills",
            "Problem-Solving"
        ],
        "summary": "GrapeLime Innovations is seeking a Business Development Intern to identify leads and promote services. Graduates from 2022-2024 are eligible; permanent roles may be offered."
    },
    {
        "job_title": "Senior Angular Developer",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/19592/4",
        "location": "Infopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Senior Angular Developer</h2>\n<p><strong>Job Title:</strong> Senior Angular Developer (5–6 Years Experience)</p>\n<p><strong>Location:</strong> Kochi</p>\n<p><strong>Job Type:</strong> Full-Time</p>\n<p><strong>Experience:</strong> 5 to 6 years</p>\n<p><strong>Reports To:</strong> Project Manager</p>\n<p><strong>Job Summary</strong></p>\n<p>We are seeking a highly skilled Angular Developer with 5–6 years of experience to join our dynamic team. The ideal candidate should have a strong grasp of frontend development using Angular (v10+), and a working knowledge of API integration—preferably with Python based backends. Experience with Server-Side Rendering (SSR) and a basic understanding of SEO principles is highly desirable.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Develop and maintain scalable, modular, and performant Angular applications.</li>\n<li>Collaborate with backend developers to integrate RESTful APIs and ensure seamless data flow.</li>\n<li>Implement and manage Angular Universal for SSR to improve performance and SEO.</li>\n<li>Ensure code quality through unit testing and code reviews.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Implement basic SEO best practices in Angular applications (e.g., meta tags, routing strategies).</li>\n<li>Translate designs into high-quality code.</li>\n<li>Troubleshoot and resolve technical issues in the frontend stack.</li>\n<li>Participate in Agile ceremonies, including sprint planning, stand-ups, and retrospectives.</li>\n<li>AI driven development and knowledge of latest Angular version highly preferred to continue with an existing project.</li>\n</ul>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li>Strong hands-on experience with Angular (v10 or later) along with knowledge and understanding in the latest versions.</li>\n<li>Solid understanding of TypeScript, RxJS, and Angular CLI.</li>\n<li>Experience in REST API integration; familiarity with Python (Django/Flask) is a plus.</li>\n<li>Working knowledge of Angular Universal for SSR.</li>\n<li>Familiarity with SEO fundamentals and best practices in single-page applications.</li>\n<li>Understanding of HTML5, CSS3, SCSS, and responsive design.</li>\n<li>Proficient with version control systems like Git.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at aswathi.asok@arttechgroup.com</p>",
        "tags": [
            "5-6 Years",
            "Angular",
            "TypeScript",
            "REST API"
        ],
        "summary": "Seeking a skilled Senior Angular Developer with 5-6 years of experience to develop and maintain scalable Angular applications. Knowledge of API integration and SEO principles is highly desirable."
    },
    {
        "job_title": "HR & Admin (7-10 years)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19596/157",
        "location": "Infopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>HR &amp; Admin</h2>\n<p>As an HR and Admin, you will play a pivotal role in the organization's human resources functions, contributing to the development and implementation of HR strategies and policies. Your primary responsibilities will include collaborating with departmental managers to understand staffing needs, conducting recruitment processes, and managing employee onboarding. You will actively participate in fostering a positive workplace culture through employee engagement initiatives, performance management, and resolving HR-related issues.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design and implement company policies that promote a healthy work environment.</li>\n<li>Ensure a fair recruitment plan and oversee new hiring, interviews, and orientations.</li>\n<li>Facilitating the Onboarding process for new hires.</li>\n<li>Conducting induction programs to provide information about the company, its policies, and procedures.</li>\n<li>Maintaining accurate and up-to-date HR records.</li>\n<li>Handling employee queries and promoting a positive and productive workplace culture.</li>\n<li>Negotiating salary and other compensation terms and extending an offer of employment</li>\n<li>Ensure HR procedures comply with labor laws and regulations.</li>\n<li>Handling Administration activities.</li>\n<li>Process monthly payroll</li>\n<li>Actively involved in the employee performance review</li>\n<li>Participates in the evaluation and monitoring of training programs to ensure success.</li>\n<li>Organize learning and development programs</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Experience in IT Recruitment is a must.</li>\n<li>Minimum 7-10 years of relevant work experience in the IT industry.</li>\n<li>Minimum 5 years recent experience in IT company.</li>\n<li>Knowledge and familiarity with labor laws.</li>\n<li>Outstanding communication skills in English.</li>\n<li>Excellent organizational skills and attention to detail</li>\n<li>Ability to acquire a thorough understanding of the organization’s hierarchy, jobs, qualifications, and compensation practices.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tranzmeo.com</p>",
        "tags": [
            "7-10 Years",
            "IT Recruitment",
            "Labor Laws",
            "Employee Onboarding"
        ],
        "summary": "Seeking an HR & Admin professional to drive HR strategies, manage recruitment, and foster a positive culture. Requires 7-10 years of IT industry experience and expertise in labor laws."
    },
    {
        "job_title": "Database Architect",
        "company": "Empress InfoTech",
        "url": "https://infopark.in/company-jobs/details/19571/70",
        "location": "Infopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Database Architect</h2>\n<p><strong>Overview:</strong>\nWe are seeking an experienced Database Architect to design and implement a robust, scalable database infrastructure for our new Media Asset Management (MAM) product. The ideal candidate will have expertise in modern database systems, architecture design, optimization strategies, and experience supporting on-premises AI and Generative AI applications. You will collaborate closely with the Solutions Architect, development team, and product stakeholders to build a highly performant, secure, and efficient database solution capable of handling transcripts, vector embeddings, and semantic search.</p>\n<p><strong>Responsibilities:</strong>\n- Design and implement scalable database architectures to support high-volume media asset management applications.\n- Define database schemas, indexing strategies, and performance optimization techniques.\n- Evaluate and select appropriate database technologies, including relational databases (e.g., PostgreSQL), document databases, vector databases, and in-memory databases (e.g., Redis).\n- Design databases to efficiently store and manage transcripts and vector embeddings to support AI and Generative AI features.\n- Develop database solutions to facilitate natural language semantic search capabilities.\n- Collaborate with developers and architects to ensure database designs meet product requirements and support seamless application integration.\n- Ensure high availability, disaster recovery, and effective data backup strategies.\n- Develop and enforce database security policies and compliance requirements.\n- Monitor database performance and optimize queries and indexes to maintain efficient system performance.\n- Provide technical guidance, mentoring, and support to the development team.</p>\n<p><strong>Requirements:</strong>\n- Bachelor's or Master's degree in Computer Science, Information Systems, or a related field.\n- 8+ years of experience as a Database Architect or Senior Database Developer.\n- Extensive experience with PostgreSQL, Redis, and other modern database systems.\n- Proven ability in designing database architectures for scalable, cloud-based applications.\n- Strong understanding of data modeling, schema design, indexing, and query optimization.\n- Familiarity with cloud infrastructure (AWS, Azure, GCP) and containerization tools (Docker, Kubernetes).\n- Solid experience in managing database migrations, upgrades, backups, and disaster recovery.\n- Knowledge of security best practices, encryption, compliance standards (GDPR, SOC 2), and data governance.\n- Excellent analytical, problem-solving, and communication skills.\n- Ability to work collaboratively in an Agile team environment.</p>\n<p><strong>Preferred Qualifications:</strong>\n- Experience working with vector databases and emerging database technologies.\n- Understanding of Media Asset Management (MAM) workflows.\n- Certifications in database systems, cloud technologies, or architecture frameworks.\n- Prior experience supporting AI-driven applications, particularly involving Generative AI, natural language processing, and semantic search.</p>\n<p><strong>Application Process:</strong>\nEmail your resume with a subject of 'Database Architect' and provide the following information to be considered for the position:\n1. Highlight your relevant experience with years and expertise.\n2. Notice period required for joining.\n3. Your current location.\n4. Current remuneration and salary expectations.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@empressinfotech.com</p>",
        "tags": [
            "8+ Years",
            "PostgreSQL",
            "Redis",
            "Cloud Infrastructure"
        ],
        "summary": "We are seeking a Database Architect to design database infrastructure for our MAM product. The ideal candidate will have experience with modern database systems, AI, and Generative AI applications."
    },
    {
        "job_title": "HR & Admin (7-10 years)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/19595/157",
        "location": "Infopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>HR &amp; Admin</h2>\n<p>As an HR and Admin, you will play a pivotal role in the organization's human resources functions, contributing to the development and implementation of HR strategies and policies. Your primary responsibilities will include collaborating with departmental managers to understand staffing needs, conducting recruitment processes, and managing employee onboarding. You will actively participate in fostering a positive workplace culture through employee engagement initiatives, performance management, and resolving HR-related issues.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design and implement company policies that promote a healthy work environment.</li>\n<li>Ensure a fair recruitment plan and oversee new hiring, interviews, and orientations.</li>\n<li>Facilitating the Onboarding process for new hires.</li>\n<li>Conducting induction programs to provide information about the company, its policies, and procedures.</li>\n<li>Maintaining accurate and up-to-date HR records.</li>\n<li>Handling employee queries and promoting a positive and productive workplace culture.</li>\n<li>Negotiating salary and other compensation terms and extending an offer of employment</li>\n<li>Ensure HR procedures comply with labor laws and regulations.</li>\n<li>Handling Administration activities.</li>\n<li>Process monthly payroll</li>\n<li>Actively involved in the employee performance review</li>\n<li>Participates in the evaluation and monitoring of training programs to ensure success.</li>\n<li>Organize learning and development programs</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Experience in IT Recruitment is a must.</li>\n<li>Minimum 7-10 years of relevant work experience in the IT industry.</li>\n<li>Minimum 5 years recent experience in IT company.</li>\n<li>Knowledge and familiarity with labor laws.</li>\n<li>Outstanding communication skills in English.</li>\n<li>Excellent organizational skills and attention to detail</li>\n<li>Ability to acquire a thorough understanding of the organization’s hierarchy, jobs, qualifications, and compensation practices.</li>\n</ul>\n<p><strong>How to apply:</strong>\nSend your resume to hr@tranzmeo.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tranzmeo.com</p>",
        "tags": [
            "7-10 Years",
            "HR Strategies",
            "IT Recruitment",
            "Labor Laws"
        ],
        "summary": "Seeking an HR & Admin professional to contribute to HR strategies, recruitment, and employee relations. Manage policies, payroll, and ensure legal compliance in an IT environment."
    },
    {
        "job_title": "Python Solution Architect",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19573/85",
        "location": "Infopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Python Solution Architect</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nTechversant is seeking an experienced Solution Architect to design and implement scalable, high-performance AI-driven applications using the latest technologies in Python, cloud, and machine learning. The ideal candidate will have a strong background in Python development, excellent leadership skills, and a passion for mentoring and guiding team members.</p>\n<p><strong>Job Responsibilities</strong>\n- Architect and design end-to-end solutions using Python (Django/FastAPI/Flask), AI/ML models, and cloud-native technologies.\n- Lead AI/ML-driven application development, including model deployment, data pipelines, and intelligent automation.\n- Collaborate with data scientists, engineers, and product teams to integrate AI/ML models into scalable applications.\n- Optimize system performance, ensuring scalability, cost efficiency, and security.\n- Implement microservices architecture with APIs, containerization (Docker/Kubernetes), and event-driven design.\n- Drive best DevOps practices with CI/CD pipelines, MLOps, Infrastructure as Code (Terraform, CloudFormation), and automated testing.</p>\n<p><strong>Preferred Skills</strong>\n- Python &amp; Full Stack: Django, FastAPI, Flask, React, Angular, or Vue.js.\n- AI/ML &amp; Data Science: TensorFlow, PyTorch, Scikit-learn, NLP, Computer Vision, or MLOps.\n- Cloud &amp; DevOps: AWS, Azure, or GCP with Kubernetes &amp; CI/CD.\n- Big Data &amp; Databases: PostgreSQL, MongoDB, Redis, Snowflake, or Spark.\n- Architecture &amp; Security: Microservices, API Gateway, Event-Driven Systems, and best security practices.</p>\n<p><strong>Ideal Experience Level:</strong>\n- 10+ years in software development with strong Python expertise, including full-stack development.\n- 2+ years of experience as a Solution Architect, with demonstrated success in leading and delivering enterprise-level projects.\n- Strong AI/ML experience, specifically in model deployment, data engineering, and cloud integration</p>\n<p><strong>Nice-to-Have Skills:</strong>\n- Hands-on experience with LLMs, Generative AI, or Reinforcement Learning.\n- Expertise in GraphQL, Serverless (AWS Lambda, Firebase), and Edge AI.\n- Experience with data engineering, real-time analytics, and feature stores.</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "10+ Years",
            "Python",
            "AI/ML",
            "Cloud"
        ],
        "summary": "Techversant is hiring a Python Solution Architect to lead AI-driven application development. Requires 10+ years of experience and expertise in Python, AI/ML, and cloud technologies."
    },
    {
        "job_title": "Lead React Native Developer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19574/85",
        "location": "Infopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Lead React Native Developer</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nAs a Lead- React Native Developer, you will lead the development and maintenance of our mobile applications using React Native. You will collaborate closely with cross-functional teams, including backend developers, to deliver high-quality, scalable, and user-friendly mobile solutions. The ideal candidate should have extensive experience in React Native development, possess a deep understanding of mobile application development best practices, and demonstrate leadership abilities to guide and mentor junior team members.</p>\n<p><strong>Job Description:</strong>\n- Lead the development and implementation of mobile applications using React Native.\n- Collaborate with cross-functional teams to gather and analyze project requirements.\n- Previous ownership of app development projects is required.\n- Develop automated tests to guarantee the product’s top-notch quality.\n- Stay updated with the latest advancements and changes in mobile platforms and technologies.\n- Provide technical supervision and support to mentor the team effectively.\n- Conduct code reviews to ensure adherence to coding standards, best practices, and maintain code quality.\n- Ensure the application is published and maintained in both the App Store and Google Play Store, adhering to their respective policies and guidelines.\n- Participate in agile development processes, including sprint planning, estimation, and retrospectives.</p>\n<p><strong>Preferred Skills:</strong>\n- 10+ years of experience in React Native Development, Minimum 3 yrs in Lead role.\n- Expert-level proficiency in JavaScript, TypeScript, and React Native framework.\n- Demonstrated hands-on experience in designing and developing applications using React Native, iOS and Android platforms.\n- Capability to plan the core architecture and iteratively enhance it as needed.\n- Strong analytical mindset to extract actionable insights from data.\n- Excellent Team management and communication skills.\n- Experience with RESTful APIs and integration of third-party libraries and APIs.\n- Possess a comprehensive understanding of React Native.\n- Capable of understanding the company’s business needs and adjusting or innovating the product accordingly.</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "10+ Years",
            "React Native",
            "JavaScript",
            "RESTful APIs"
        ],
        "summary": "Techversant is seeking a Lead React Native Developer to lead mobile app development and maintenance. The role involves team leadership, full lifecycle app management, and collaboration to deliver high-quality mobile solutions."
    },
    {
        "job_title": "AI/ML – Team Lead",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19575/85",
        "location": "Infopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>AI/ML Team Lead</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p>Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nTechversant is seeking a highly skilled and experienced AI/ML Lead to lead the design and implementation of our artificial intelligence and machine learning solutions. The successful candidate will work closely with cross-functional teams to understand business requirements and develop scalable, efficient, and robust AI/ML systems.</p>\n<p><strong>Job Description</strong></p>\n<p>As a AI/ML Lead, you will:\n- Build Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and generative models.\n- Define, design, and deliver ML architecture patterns operable in native and hybrid cloud architectures.\n- Implement machine learning algorithms in services and pipelines that can be used on a web scale.\n- Create demos and proofs of concept, develop AI/ML based products and services.\n- Create Functional and technical specifications for AI &amp; ML solutions.\n- Follow SDLC process.\n- Use advanced analytical knowledge of data and data conditioning.\n- Program advanced computing and developing algorithms.\n- Develop software, data models and executing predictive analysis.\n- Design, develop, and implement generative AI models using state-of-the-art techniques.\n- Collaborate with cross-functional teams to define project goals, research requirements and develop innovative solutions.</p>\n<p><strong>Qualifications:</strong>\n- Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).\n- Strong proficiency in SQL, NO SQL Databases.\n- Experience in implementing and deploying AI\\ Machine Learning solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)\n- Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.\n- Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g. Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</p>\n<p><strong>What will make you stand out</strong>\n- Experience in production software engineering routines in DevOps/MLOps (e.g.Continuous Code Integration and Deployment).\n- Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</p>\n<p><strong>Experience and Qualification:</strong>\n- B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "5+ Years",
            "Python",
            "AI/ML",
            "Deep Learning"
        ],
        "summary": "Techversant is hiring an AI/ML Team Lead to design and implement AI/ML solutions. The role involves developing and deploying machine learning models and leading cross-functional teams."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19576/85",
        "location": "Infopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption. We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nWe are seeking experienced AI/ML Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Job Description</strong></p>\n<ul>\n<li>Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.</li>\n<li>Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs) and diffusion models for a range of use cases involving text, code, and multi-modal data.</li>\n<li>Build Scalable Recommendation Engines: Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.</li>\n<li>Cloud-Native ML Engineering: Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.</li>\n<li>End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.</li>\n<li>Collaborate Across Functions: Work with cross-functional teams including product managers, engineers, and data scientists to translate business goals into AI-powered solutions.</li>\n</ul>\n<p><strong>Core Requirements</strong></p>\n<ul>\n<li>Minimum 4 years of experience in building and deploying production-level ML/DL systems</li>\n<li>Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Strong understanding of transformer architectures and deep learning model design</li>\n<li>Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution</li>\n<li>Expertise in Python programming with a focus on:<ul>\n<li>Code optimization and profiling</li>\n<li>Multi-threading and multiprocessing</li>\n<li>Object-oriented programming and design principles</li>\n</ul>\n</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Technical Stack</strong></p>\n<ul>\n<li>Languages: Excellent understanding of object-oriented concepts and Python.</li>\n<li>ML/DL Frameworks:<ul>\n<li>Machine Learning: Scikit-learn, XGBoost, LightGBM</li>\n<li>Deep Learning: PyTorch, TensorFlow, Keras</li>\n<li>GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework</li>\n</ul>\n</li>\n<li>Cloud &amp; MLOps: AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes</li>\n<li>Data &amp; Compute: Apache Spark, BigQuery, RabbitMQ, S3, EC2</li>\n<li>Embedding Stores &amp; Vector Search: FAISS, Pinecone, ChromaDB</li>\n<li>Orchestration &amp; APIs: Apache Airflow, Docker Deployment, and FastAPI are a must</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li>Experience with multi-modal models combining text, vision, or audio</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct)</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure)</li>\n</ul>\n<p><strong>Education</strong></p>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field</li>\n<li>Equivalent practical experience in developing scalable AI solutions will also be considered</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "4+ Years",
            "Generative AI",
            "Python",
            "MLOps"
        ],
        "summary": "Techversant is seeking a Senior AI/ML Engineer to develop and deploy machine learning and generative AI solutions. The role involves cloud-native ML engineering and collaboration across functions."
    },
    {
        "job_title": "Software Engineer - AI/ML",
        "company": "Techversant Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19577/85",
        "location": "Infopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>AI/ML Engineer</h2>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nWe are seeking experienced AI/ML Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Job Description</strong></p>\n<ul>\n<li>As an AI/ML Engineer, you will be responsible for developing AI/ML Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and Generative AI models.</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Develop proofs of concept AI/ML based solutions and services and demonstrate it to Business.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Experience in implementing and deploying AI/ML solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)</li>\n<li>Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.</li>\n<li>Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).</li>\n<li>Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g.Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</li>\n<li>Experience in RDBMS, NoSQL, Big Data stores like Elastic, Cassandra, Hbase, Hive, HDFS and Big Data technologies like Kafka, Apache Spark is a plus.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Knowledge in data visualization tools (Tableau, Power BI, etc.) and SQL.</li>\n<li>Excellent understanding of object-oriented concepts and Python.</li>\n<li>Experience in NLP models like BERT, Transformer architectures, etc.</li>\n<li>Experience in leveraging Computer Vision and OCR in document extraction use cases.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>What will make you stand out</strong></p>\n<ul>\n<li>Experience in production software engineering routines (e.g. Continuous Integration/Continuous Deployment).</li>\n<li>Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</li>\n<li>Experience working using Agile-based principles and tools.</li>\n<li>Familiarity with working on large data sets and distributed computing (e.g. Hive, Spark, Kafka, Airflow, Scala).</li>\n<li>Certification in any of the available cloud-based AI/ML technologies is a plus.</li>\n</ul>\n<p><strong>Experience and Qualification:</strong></p>\n<ul>\n<li>B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</li>\n<li>3+ years of relevant experience in AI/ML projects</li>\n</ul>\n<p><strong>What Company Offers:</strong>\nExcellent career growth opportunities and exposure to multiple technologies.</p>\n<p>Fixed weekday day schedule, meaning, you’ll have your weekends off!\nFamily Medical Insurance.\nUnique leave benefits and encashment options based on performance.\nLong term growth opportunities.\nFun family environment surrounded by experienced developers.\nVarious internal employee rewards programs based on Performance.\nOpportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\nWork life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\nCompany Sponsored International Tours</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@techversantinfotech.com</p>",
        "tags": [
            "3+ Years",
            "Python",
            "Tensorflow",
            "AI/ML"
        ],
        "summary": "Techversant is seeking an AI/ML Engineer to develop and implement AI/ML solutions. The candidate should have experience with deep learning frameworks, Python, and cloud-based solutions."
    },
    {
        "job_title": "Security Test Engineer",
        "company": "Emsyne Technologies Privated Limited",
        "url": "https://infopark.in/company-jobs/details/19591/76",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Security Test Engineer</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Perform security audits for IT infrastructure, applications, and cloud environments.</li>\n<li>Conduct penetration testing to identify vulnerabilities and recommend mitigation strategies.</li>\n<li>Perform manual and automated security assessments on web, mobile, and system applications.</li>\n<li>Assist in incident response, forensic analysis, and root cause investigations.</li>\n<li>Analyze security logs, event data, and network traffic for intrusion detection and threat intelligence.</li>\n<li>Knowledge of static and dynamic code analysis, reverse engineering, and manual testing, Threat hunting.</li>\n</ul>\n<p><strong>Required Knowledge and Skills:</strong></p>\n<ul>\n<li>Knowledge in compliance frameworks such as ISO 27001, NIST, CIS, and GDPR.</li>\n<li>Experience with tools like Burp Suite, Metasploit, OpenVAS, Wireshark, and Kali Linux, etc.</li>\n<li>Knowledge of OWASP Top 10, CVE database, MITRE ATT&amp;CK framework, and malware analysis.</li>\n<li>Knowledge in API penetration testing.</li>\n<li>Familiarity with network protocols, firewalls, IDS/IPS, and secure system configurations.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>Certifications like CEH, EJPT</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs@emsyne.com</p>",
        "tags": [
            "1+ Years",
            "Penetration Testing",
            "Security Audits",
            "Vulnerability Assessment"
        ],
        "summary": "Seeking a Security Test Engineer to conduct security audits and penetration testing. Requires experience with security tools and compliance frameworks for vulnerability mitigation."
    },
    {
        "job_title": "Backend Developer (1 - 2.5 Years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/19594/109",
        "location": "Infopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Backend Developer (1 - 2.5 Years)</h2>\n<p><strong>Company:</strong> NewAgeSys IT, (a division of NewAgeSys)\n<strong>Location:</strong> Carnival Infopark, Phase 2, Kakkanad, Ernakulam\n<strong>Job Type:</strong> Onsite\n<strong>Shift Timing:</strong> 11 AM - 8 PM</p>\n<h3>About the Company</h3>\n<p>NewAgeSysIT, a division of NewAgeSys, Inc. established in 1994 and based in New Jersey, specializes in mobile app development and consulting. They help clients maximize their business reach and effectiveness by leveraging the latest technologies. As a full-service mobile and web development firm, NewAgeSMB focuses on servicing clients across North America, UK, Europe, Middle East, Singapore, and Australia. They build long-term relationships with clients, from brainstorming initial ideas to strategizing project plans and deploying cost-effective solutions with solid support and maintenance.</p>\n<h3>About the Job</h3>\n<p>We are seeking a motivated and detail-oriented Backend Developer with 1–2.5 years of experience in server-side application development using Node.js. The ideal candidate should have hands-on experience with the NestJS framework, including building scalable and maintainable APIs, implementing authentication and authorization, and working with middleware, services, and modules. A solid understanding of both relational databases like MySQL or PostgreSQL, and NoSQL databases such as MongoDB, is required, including schema design, query optimization, and integration with backend services. The role involves working closely with front-end developers, DevOps, and product teams to deliver robust backend solutions. Familiarity with version control (Git), best practices in backend architecture, and basic knowledge of deployment and CI/CD workflows will be considered a plus. The candidate should be a proactive problem-solver with good communication skills and the ability to work in a collaborative, fast-paced environment.</p>\n<h3>Full Stack Developer Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain robust and scalable backend systems using Node.js.</li>\n<li>Build and optimize RESTful and/or GraphQL APIs for high-performance applications.</li>\n<li>Collaborate with frontend developers, product managers, and designers to deliver new features.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Optimize application performance, troubleshoot issues, and perform root cause analysis.</li>\n<li>Implement and maintain security and data protection best practices.</li>\n<li>Work with databases (SQL and/or NoSQL), caching layers, and message queues.</li>\n<li>Contribute to technical documentation and knowledge sharing.</li>\n</ul>\n<h3>Full Stack Developer Requirements:</h3>\n<ul>\n<li>1 - 2.5 years of professional experience in backend development with Node.js.</li>\n<li>Strong understanding of JavaScript (ES6+) and asynchronous programming patterns.</li>\n<li>Experience with NestJS/Express.js or similar Node.js frameworks.</li>\n<li>Proficiency with database technologies like MongoDB, PostgreSQL, MySQL, etc.</li>\n<li>Experience in building APIs (RESTful/GraphQL).</li>\n<li>Familiarity with version control systems (e.g., Git).</li>\n<li>Understanding of containerization (e.g., Docker) is a plus.</li>\n<li>Basic knowledge of cloud platforms like AWS, GCP, or Azure is advantageous.</li>\n<li>Good problem-solving skills and attention to detail.</li>\n<li>Strong communication and team collaboration abilities.</li>\n<li>Experience with TypeScript.</li>\n<li>Familiarity with microservices architecture.</li>\n<li>CI/CD pipeline experience (e.g., GitHub Actions, Jenkins).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@newagesysindia.com</p>",
        "tags": [
            "1-2.5 Years",
            "Node.js",
            "NestJS",
            "MongoDB"
        ],
        "summary": "Seeking a Backend Developer with 1-2.5 years of experience to design, develop, and maintain scalable backend systems using Node.js and related technologies. The role involves collaborating with cross-functional teams to deliver robust solutions."
    },
    {
        "job_title": "React Native Developer",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/19584/401",
        "location": "Infopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>React Native Developer</h2>\n<p><strong>Key Skills:</strong> React, Redux, Bridging with Native Modules, Jest, Enzyme, Push Notifications, Restful API Integration, Crash Analytics, Agile Methodologies, Crashlytics</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, maintain, and enhance cross-platform mobile applications using React Native.</li>\n<li>Write robust unit tests using testing frameworks like Jest or Detox to ensure code quality and application reliability.</li>\n<li>Integrate push notification services using AWS SNS.</li>\n<li>Set up and manage CI/CD pipelines for seamless deployment using tools like Fastlane.</li>\n<li>Integrate and monitor Firebase Crashlytics for crash reporting and debugging.</li>\n<li>Collaborate with backend developers to integrate REST APIs effectively.</li>\n<li>Perform code reviews to maintain high standards of code quality and scalability.</li>\n<li>Optimize application performance and ensure a smooth user experience.</li>\n<li>Stay up to date with the latest mobile development trends and React Native best practices.</li>\n<li>Publish and maintain applications on the Apple App Store and Google Play Store, ensuring compliance with platform guidelines.</li>\n</ul>\n<p><strong>Required Skills and Experience:</strong></p>\n<ul>\n<li><strong>React Native:</strong> 5+ years of professional experience in building cross-platform mobile applications.</li>\n<li><strong>Unit Testing:</strong> Strong proficiency with testing frameworks such as Jest, Enzyme, or Detox.</li>\n<li><strong>AWS Services:</strong> Hands-on experience with AWS SNS for push notifications.</li>\n<li><strong>REST APIs:</strong> Solid experience working with RESTful APIs and asynchronous data handling.</li>\n<li><strong>Crash Analytics:</strong> Familiarity with Firebase Crashlytics for monitoring and debugging application crashes.</li>\n<li><strong>State Management:</strong> Expertise in Redux, MobX, or Context API.</li>\n<li>Strong understanding of mobile UI/UX principles and responsive design.</li>\n<li>Excellent problem-solving and debugging skills.</li>\n<li>Experience with deploying apps in the Apple App Store and Google Play Store, including handling app submission, updates, and compliance with platform guidelines.</li>\n<li>Familiarity with native build tools such as Xcode (iOS) and Android Studio (Android).</li>\n<li>Experience managing certificates, provisioning profiles, and resolving app store review issues.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at joinus@pearlsofttechnologies.com</p>",
        "tags": [
            "5+ Years",
            "React Native",
            "Redux",
            "REST APIs"
        ],
        "summary": "We are seeking a React Native Developer to build and maintain cross-platform mobile applications. The candidate should have strong experience with REST APIs, unit testing, and deployment."
    },
    {
        "job_title": "Python AI Developer",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/19585/401",
        "location": "Infopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Python AI Developer</h2>\n<p><strong>Department:</strong> AI &amp; Data Science\n<strong>Employment Type:</strong> Full-Time</p>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for an experienced Python AI Developer with 4–7 years of hands-on experience in real-world AI/ML solutions. You will be responsible for building, deploying, and maintaining scalable AI systems in production, with a focus on Machine Learning, Deep Learning, LLMs, Agents, and NLP. This role demands strong software engineering fundamentals, practical deployment experience, and a deep understanding of both classical and modern AI approaches.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Build, fine-tune, and deploy Large Language Models (LLMs) and AI agents for real-world use cases (e.g., chatbots, summarization, RAG systems, recommendation engines).</li>\n<li>Develop and deploy production-grade models with CI/CD pipelines, monitoring, logging, and rollback strategies.</li>\n<li>Integrate AI systems with SQL/NoSQL databases (e.g., PostgreSQL, MongoDB, Redis).</li>\n<li>Use cloud services (AWS or Azure) for model training, deployment (e.g., SageMaker, Azure ML), and orchestration (e.g., Lambda, Functions, Batch).</li>\n<li>Collaborate with cross-functional teams including Data Engineers, Product Managers, and DevOps to ensure scalable and maintainable solutions.</li>\n<li>Conduct performance tuning, A/B testing, and continuous optimization of deployed models.</li>\n<li>Stay up to date with the latest AI research and apply relevant advancements to existing products.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li>4–7 years of experience in Python programming, with a focus on AI/ML systems.</li>\n<li>Proven experience in deploying AI models in production, not just building POCs.</li>\n<li>Expertise in Machine Learning, Deep Learning, and Natural Language Processing (NLP).</li>\n<li>Strong hands-on experience with LLMs (OpenAI, Claude, Mistral, LLaMA, etc.) and agentic workflows.</li>\n<li>Experience with model serving tools like FastAPI, Django, Flask, Docker, Kubernetes etc.</li>\n<li>Familiarity with SQL/NoSQL databases: PostgreSQL, MongoDB, Redis, or DynamoDB.</li>\n<li>Experience with Vector Databases (e.g., FAISS, Pinecone, Weaviate).</li>\n<li>Solid understanding of cloud services: AWS (SageMaker, Lambda, S3, ECS) or Azure (Azure ML, Blob Storage, Functions).</li>\n<li>Experience working with APIs, microservices, and distributed systems.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Exposure to RAG (Retrieval Augmented Generation) or multi-agent orchestration frameworks like LangChain or Haystack.</li>\n<li>Knowledge of data privacy, security, and compliance in ML systems.</li>\n<li>Contributions to open-source AI/ML projects or research publications.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at joinus@pearlsofttechnologies.com</p>",
        "tags": [
            "4-7 Years",
            "LLMs",
            "Python",
            "AI/ML"
        ],
        "summary": "Seeking a Python AI Developer to build and deploy scalable AI systems. Focus on Machine Learning, Deep Learning, and NLP in a production environment."
    },
    {
        "job_title": "E-commerce Support Lead",
        "company": "Experion Technologies",
        "url": "https://infopark.in/company-jobs/details/19593/103",
        "location": "Infopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>E-commerce Support Lead</h2>\n<p><strong>Skills – Mandatory:</strong> E-Commerce Support, SAP Hybris, Mongo DB, IFS Ticketing, Jira Service Management, Atlassian dashboards and metrics CMS, SaaS</p>\n<p><strong>Skills - Primary:</strong> IFS Ticketing, Jira Service Management, Atlassian dashboards and metrics SAP, CMS, SaaS</p>\n<p><strong>Skills - Good to have:</strong> Automation in support using AI</p>\n<p><strong>Total Experience:</strong> 7-12 years</p>\n<p><strong>Relevant Experience:</strong> 3+ years</p>\n<p><strong>Work Location:</strong> Kochi/Trivandrum</p>\n<p><strong>Job Description / Duties and Responsibilities:</strong></p>\n<ul>\n<li>Experience in Managing Ecommerce Support Programs</li>\n<li>Strong skills with IFS Ticketing, Jira Service Management, Atlassian dashboards and metrics</li>\n<li>Experience working on the SAP Commerce platform and CMS – Contentful, AEM.</li>\n<li>Experience in managing and overseeing an eCommerce solution that is classified as SaaS and used by multiple countries.</li>\n<li>Strong Ecommerce back ground with B2B/B2C implementation experience</li>\n<li>Managing and Tracking SLA’s</li>\n<li>Flexibility to work in Shifts including Night Shifts</li>\n<li>Manage and optimize e-commerce platforms to ensure high uptime, fast load times, and seamless user experience.</li>\n<li>Identify trends to improve operational efficiencies</li>\n<li>Work with a team of Offshore Ecommerce Support Analysts</li>\n<li>Knowledge of Agentic AI</li>\n<li>Build in automations where possible</li>\n<li>Working with peers and cross functional leaders to identify, examine and develop immediate and long term resolutions of support issues</li>\n<li>Experience in working in onshore/offshore model</li>\n<li>End-to-end experience in software development life cycle and familiar with agile methodologies like scrum</li>\n<li>Should actively participate in communication with business stakeholders and participate in all SDLC lifecycles.</li>\n<li>Should be capable of reviewing the work done by other team members and guide them in complex issues.</li>\n<li>Should have good knowledge related to Agile methodology</li>\n<li>Resolve any operational issues that arise</li>\n<li>Excellent time-management, problem-solving and decision-making skills</li>\n<li>Analyze and report on e-commerce performance metrics to identify areas for improvement and growth opportunities.</li>\n<li>Led and mentor e-commerce team members to develop their skills</li>\n<li>Ensure compliance with all applicable laws and regulations related to e-commerce operations.</li>\n<li>Ensure daily operational activities are monitored and completed</li>\n<li>Build strong relationships with cross-functional teams and business leads to implement and roll out productivity tools, understand business needs and provide innovative technology solutions</li>\n<li>Manage support schedules to ensure coverage, ticket assignments, support escalations with a continued focus on process changes that improve resolution times</li>\n<li>Manage the overall performance and growth of our IT Operations team to ensure maximum performance and professional development</li>\n<li>Conduct team meetings, communicate recommendations for improvement as necessary and provide status reporting</li>\n<li>Ability to communicate technical information in a clear manner to Stakeholders</li>\n<li>Ability to draft documents to build out ou knowledge base</li>\n<li>Manage and lead the customer support team, providing guidance and support to ensure high-quality service delivery.</li>\n<li>Collaborate with cross-department teams to align support efforts with overall business objectives and enhance customer experience.</li>\n<li>Optimize support operations to improve efficiency and effectiveness, ensuring timely issue resolution.</li>\n<li>Monitor key performance metrics and service levels to assess team performance and identify areas for improvement.</li>\n<li>Conduct regular training sessions for the support team to enhance their skills and knowledge of products and services.</li>\n<li>Lead initiatives for service process improvement to streamline operations and enhance the customer journey.</li>\n<li>Provide escalation support for complex customer issues, ensuring swift and effective resolution.</li>\n<li>Understanding of key performance metrics related to customer service and support operations.</li>\n<li>Collaborates with external vendors and service providers to ensure timely and effective resolution of issues.</li>\n<li>Acts promptly during critical incidents to minimize downtime and coordinate with relevant stakeholders as necessary.</li>\n<li>Manages ecommerce-related user and system administration responsibilities for all international markets.</li>\n<li>Adhere to the Information Security Management policies and procedures.</li>\n</ul>\n<p><strong>Job Specification / Skills and Competencies:</strong></p>\n<ul>\n<li>Overall 7-12 years experience</li>\n<li>3 years of experience leading an Ecommerce support team.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at sandra.paul@experionglobal.com</p>",
        "tags": [
            "3+ Years",
            "SAP Hybris",
            "Jira Service Management",
            "E-Commerce Support"
        ],
        "summary": "Seeking an E-commerce Support Lead with 3+ years of relevant experience to manage support programs and optimize e-commerce platforms. The role involves team leadership, SLA management, and cross-functional collaboration."
    },
    {
        "job_title": "Business Central Developer (Experienced)",
        "company": "Array Platforms Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19572/394",
        "location": "Infopark",
        "closing_date": "05 Sep 2025",
        "job_description": "<h2>Business Central Developer (Experienced)</h2>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and develop solutions using Dynamics 365 Business Central (AL, C/AL)</li>\n<li>Handle integrations and API development</li>\n<li>Collaborate with cross-functional teams</li>\n<li>Provide post-deployment support</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong experience in Dynamics NAV/Business Central</li>\n<li>Knowledge of AL/ C/AL, web services, and API integration</li>\n<li>Good communication and troubleshooting ability</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at neha.r@array.team</p>",
        "tags": [
            "2+ Years",
            "Business Central",
            "AL/C/AL",
            "API Integration"
        ],
        "summary": "Seeking a Business Central Developer to design and develop solutions using Dynamics 365. The role involves integrations, API development, and collaboration within cross-functional teams."
    },
    {
        "job_title": "AI/ML Engineer",
        "company": "Gaude Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21803",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>AI/ML Engineer - Walk-In Interview</h2>\n<p><strong>GAUDE BUSINESS SOLUTIONS (P) Ltd</strong> is looking for a highly skilled and motivated AI/ML Engineer to join our growing team.</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> 18, July 2025\n*   <strong>Time:</strong> 10:30:00 to 14:30:00\n*   <strong>Venue:</strong> GAUDE BUSINESS &amp; INFRASTRUCTURE SOLUTIONS PVT LTD, Ground Floor, Technopark Trivandrum, Amstor, Technopark Campus, Thiruvananthapuram, Kerala 695581</p>\n<p><strong>Contact:</strong> careers@gaudesolutions.com</p>\n<p><strong>Brief Description:</strong>\nIn this role, you will work on the development, optimization, and deployment of intelligent AI/ML models with a strong focus on NLP and LLM-based systems. You’ll collaborate across engineering, product, and data teams to build AI-powered features into scalable web and enterprise platforms.</p>\n<p><strong>Key Responsibilities:</strong>\n- Design, develop, and deploy machine learning and NLP models for use cases like classification, summarization, entity extraction, recommendation, and document intelligence\n- Build and maintain Multi-Component Pipelines (MCPs) involving LLMs, embedding generation, and vector search\n- Work with Large Language Models (LLMs) and integrate with LangChain and Agentic architectures to build context-aware, task-specific agents\n- Implement Retrieval-Augmented Generation (RAG) pipelines using vector databases including Pinecone and ChromaDB\n- Integrate AI models into scalable backend systems using Django, FastAPI, or Flask, and deploy APIs for intelligent feature consumption\n- Use tools like LangChain, Hugging Face Transformers, and LlamaIndex to support modular and reusable NLP workflows\n- Collaborate with cross-functional engineering teams to embed intelligent agents and LLMs into web platforms and applications\n- Conduct model evaluation, A/B testing, optimization, and hyperparameter tuning to ensure model performance and reliability in production\n- Manage deployments on cloud platforms such as AWS, GCP, or Vertex AI with Docker, Git, and CI/CD practices\n- Keep up with research and trends in generative AI, vector search, multi-agent coordination, and privacy-aware data handling\n- Work with relational and non-relational databases (e.g., PostgreSQL, MySQL, MongoDB) to support data-driven model training, storage, and real-time inference.</p>\n<p><strong>Qualifications:</strong>\n- Bachelor's or Master’s degree in Computer Science, Artificial Intelligence, Data Science, or related technical discipline\n- 2–3 years of experience building and deploying AI/ML solutions\n- Strong programming skills in Python and experience with libraries like NumPy, Pandas, Scikit-learn, TensorFlow or PyTorch\n- Practical experience in RESTful API development and backend frameworks (Django/FastAPI/Flask)\n- Hands-on experience with vector databases such as Pinecone, FAISS, and ChromaDB\n- Knowledge of LLM orchestration tools such as LangChain, LlamaIndex, or similar\n- Familiarity with Git, Agile/Scrum workflows, and collaborative product delivery</p>\n<p><strong>Walk-In Entry Pass</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.\nCandidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App</strong>\nClick here to download the Mobile App for Android\nClick here to download the Mobile App for iOS</p>\n<p><strong>Website URL</strong>\nvms.technopark.org\nClick here for the User Manual</p>\n<p>Note: Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "2-3 Years",
            "NLP",
            "LLM",
            "Python"
        ],
        "summary": "Seeking an AI/ML Engineer to develop and deploy AI/ML models, focusing on NLP and LLM-based systems. Requires 2-3 years of experience and strong Python skills."
    },
    {
        "job_title": "SOFTWARE TESTER",
        "company": "Gaude Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21802",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Software Tester - Walk-In Interview</h2>\n<p><strong>Gaude Business Solutions (P) Ltd</strong> is looking for a detail-oriented and proactive Software Tester with 2–3 years of hands-on experience in both manual and automation testing. As a Tester, you will be responsible for ensuring the quality and reliability of our AI-driven products and web applications.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Create and execute detailed test plans, test cases, and test scripts for web, mobile, and API-based applications.</li>\n<li>Perform functional, integration, regression, UI/UX, and cross-browser testing across platforms.</li>\n<li>Develop and maintain automated test suites using tools like Selenium, Postman, JUnit, or PyTest.</li>\n<li>Conduct API testing (REST/SOAP) using tools such as Postman or Rest Assured.</li>\n<li>Identify, log, and track bugs using JIRA, and ensure proper communication and resolution with development teams.</li>\n<li>Perform smoke testing on build releases and validate bug fixes.</li>\n<li>Conduct performance testing and basic security validation where applicable.</li>\n<li>Collaborate in Agile/Scrum teams to review requirements and plan testing coverage.</li>\n<li>Participate in test reviews, retrospectives, and sprint planning sessions.</li>\n<li>Contribute to documentation of test processes, standards, and QA metrics.</li>\n</ul>\n<p><strong>Required Skills and Experience:</strong></p>\n<ul>\n<li>2–3 years of experience in software testing with a strong understanding of manual testing principles.</li>\n<li>Proficiency in writing and executing test cases and reporting issues effectively.</li>\n<li>Working knowledge of automated testing tools like Selenium WebDriver, TestNG, PyTest, or Cypress.</li>\n<li>Hands-on experience in API testing with tools like Postman, Swagger, or SoapUI.</li>\n<li>Familiarity with bug tracking tools such as JIRA.</li>\n<li>Understanding of SDLC and STLC processes in Agile environments.</li>\n<li>Basic scripting knowledge in Python, Java, or JavaScript is a plus.</li>\n<li>Good communication and analytical skills, with the ability to clearly document and reproduce bugs.</li>\n<li>Attention to detail and a passion for delivering high-quality software.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience testing AI/ML platforms, voice-based systems, or data-heavy web applications.</li>\n<li>Familiarity with CI/CD pipelines and test integration with tools like Git, Jenkins, or GitHub Actions.</li>\n<li>Exposure to performance testing tools like JMeter is a bonus.</li>\n<li>ISTQB Certification (Foundation or higher) is a plus.</li>\n</ul>\n<p><strong>Walk-In Interview Details:</strong></p>\n<ul>\n<li><strong>Date:</strong> 18, July 2025 - 18, July 2025</li>\n<li><strong>Time:</strong> 10:30:00 to 14:30:00</li>\n<li><strong>Venue:</strong> GAUDE BUSINESS &amp; INFRASTRUCTURE SOLUTIONS PVT LTD , Ground Floor, Technopark Trivandrum, Amstor, Technopark Campus, Thiruvananthapuram, Kerala 695581</li>\n</ul>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser.</p>\n<ul>\n<li>Mobile App:</li>\n<li>Click here to download the Mobile App for Android</li>\n<li>Click here to download the Mobile App for iOS</li>\n<li>Website URL: vms.technopark.org</li>\n<li>Click here for the User Manual</li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong>\n- <strong>Email:</strong> careers@gaudesolutions.com\n- <strong>Website:</strong> http://www.gaudesolutions.com\n- <strong>Address:</strong> Ground Floor, Amstor House, Technopark Phase 1, Trivandrum, Kerala, India , 695581</p>",
        "tags": [
            "2-3 Years",
            "Selenium",
            "JIRA",
            "API Testing"
        ],
        "summary": "Gaude Business Solutions is hiring a Software Tester to ensure the quality of AI-driven products. The role involves manual and automated testing with tools like Selenium and JIRA."
    },
    {
        "job_title": "Senior QA Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21801",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Senior QA Engineer</h2>\n<p>Way.Com India Pvt Ltd is seeking a proactive and detail-focused Senior QA Automation Engineer with a solid background in Java and practical experience in test automation. The ideal candidate should be adept at interpreting complex business requirements and transforming them into effective, well-structured test strategies and cases.</p>\n<p><strong>Responsibilities and Requirements:</strong></p>\n<ul>\n<li>5+ years of experience in test automation using Java, with a strong foundation in designing, developing, and maintaining robust and scalable test automation frameworks.</li>\n<li>In-depth knowledge of Core Java, including solid understanding of object-oriented principles, exception handling, multi-threading, and File handling.</li>\n<li>Proficient in Java Collections Frameworks (Lists, Sets, Maps, Queues), DSA with the ability to write efficient, optimized, and maintainable code for complex scenarios.</li>\n<li>Demonstrated ability to comprehend and break down complex business requirements, identify key testing scenarios, and design end-to-end functional test cases that ensure high coverage and quality.</li>\n<li>Hands-on experience with Selenium WebDriver, including advanced features like handling dynamic elements, custom wait conditions, and cross-browser testing.</li>\n<li>Experience in REST API testing using Rest Assured, including Request modelling, authentication mechanisms, and integration with automation suites.</li>\n<li>Exposure to Jenkins or other CI/CD tools, with experience integrating automated test suites into pipelines for continuous feedback and faster releases.</li>\n<li>Familiarity with load and performance testing tools such as JMeter, K6, Locust or similar, and the ability to analyze bottlenecks and suggest improvements.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>5+ years of experience in test automation using Java, with a strong foundation in designing, developing, and maintaining robust and scalable test automation frameworks.</li>\n<li>In-depth knowledge of Core Java, including solid understanding of object-oriented principles, exception handling, multi-threading, and File handling.</li>\n<li>Proficient in Java Collections Frameworks (Lists, Sets, Maps, Queues), DSA with the ability to write efficient, optimized, and maintainable code for complex scenarios.</li>\n<li>Demonstrated ability to comprehend and break down complex business requirements, identify key testing scenarios, and design end-to-end functional test cases that ensure high coverage and quality.</li>\n<li>Hands-on experience with Selenium WebDriver, including advanced features like handling dynamic elements, custom wait conditions, and cross-browser testing.</li>\n<li>Experience in REST API testing using Rest Assured, including Request modelling, authentication mechanisms, and integration with automation suites.</li>\n<li>Exposure to Jenkins or other CI/CD tools, with experience integrating automated test suites into pipelines for continuous feedback and faster releases.</li>\n<li>Familiarity with load and performance testing tools such as JMeter, K6, Locust or similar, and the ability to analyze bottlenecks and suggest improvements.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Email: careers@way.com</p>\n<p><strong>Address</strong>\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Way.Com is looking for a Senior QA Automation Engineer. The role requires strong skills in Java, Selenium WebDriver, and API testing."
    },
    {
        "job_title": "Network & Security Engineer – 5+ Years Experience ( Immediate Joiners)",
        "company": "Kvaliteta Systems And Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21800",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Network &amp; Security Engineer</h2>\n<p><strong>Kvaliteta Systems and Solutions (P) Ltd</strong> is seeking an experienced Network &amp; Security Engineer to join our team in Technopark Phase III, Trivandrum. Kvaliteta is a global IT solutions provider delivering transformative services in Digital Transformation, IT Infrastructure, Private Cloud, Security, and Software Development as a Service (SDaaS).</p>\n<p><strong>Contact Email:</strong> hr@kvaliteta.in</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, implement, and manage SME and enterprise-level network and security solutions.</li>\n<li>Configure and administer Palo Alto Networks Next-Generation Firewalls.</li>\n<li>Deploy and support Cisco routing, switching, SD-WAN, data center, wireless, and Cisco DNAC solutions.</li>\n<li>Implement and manage Cisco security platforms including Firepower, ASA, ISE, Umbrella, and DUO.</li>\n<li>Maintain comprehensive documentation: HLD/LLD, network diagrams, WBS, UAT reports, and handover documentation.</li>\n<li>Provide post-implementation support, including advanced troubleshooting and performance optimization.</li>\n<li>Conduct Proof of Concepts (POCs) and technical demos for pre-sales and client onboarding.</li>\n<li>Collaborate with sales and bid teams to contribute to RFP/RFI responses, solution architecture, BoMs, and technical proposals.</li>\n<li>Identify and resolve network performance bottlenecks and security issues.</li>\n<li>Stay updated on networking and security trends and pursue ongoing certifications.</li>\n<li>Work closely with cross-functional teams to ensure successful design-to-deployment transitions.</li>\n<li>Deliver technical leadership, mentorship, and participate in knowledge sharing across teams.</li>\n</ul>\n<h3>Required Skills &amp; Certifications:</h3>\n<ul>\n<li>Minimum 5 years of hands-on experience in enterprise network implementation and support.</li>\n<li>Strong knowledge of Cisco routing/switching (ISR/ASR, Catalyst, Nexus).</li>\n<li>Experience with Cisco SD-WAN, DNAC, and Unified Communications.</li>\n<li>Proficiency with VPNs, IDS/IPS, virtualization, and network function virtualization (NFV).</li>\n<li>Strong exposure to Palo Alto NGFWs and security architecture.</li>\n<li>Excellent skills in technical documentation and project handover.</li>\n<li>Solid understanding of DevOps practices, CI/CD pipelines, and automation is a plus.</li>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related discipline.</li>\n</ul>\n<h3>Certifications:</h3>\n<ul>\n<li>Cisco CCNP (required)</li>\n<li>Cisco CCIE (preferred)</li>\n<li>PCNSE (Palo Alto Certified Network Security Engineer) or equivalent recognized security certifications (preferred)</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume to hr@kvaliteta.in with “Network &amp; Security Engineer” in the subject line. Please mention your Current CTC, Total Relevant Experience, and Notice Period.</p>",
        "tags": [
            "5+ Years",
            "Cisco",
            "Palo Alto",
            "SD-WAN"
        ],
        "summary": "Kvaliteta Systems is hiring a Network & Security Engineer with 5+ years of experience. The role involves designing, implementing, and managing network and security solutions."
    },
    {
        "job_title": "Graphic Designer",
        "company": "Tigrid Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21799",
        "location": "Technopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>Graphic Designer</h2>\n<p><strong>Tigrid Technologies</strong> is seeking a talented Graphic Designer to join our creative team!</p>\n<p><strong>Contact:</strong> hr@tigrid.in</p>\n<p><strong>Website:</strong> www.tigrid.in</p>\n<p><strong>Location:</strong>\nTIGRID TECHNOLOGIES (P) Ltd\n1st FLOOR, M SQUARED MAIN BUILDING, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA , 695581</p>\n<p><strong>Duration:</strong> 3-6 months</p>\n<p><strong>Work Mode:</strong> Hybrid</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Creative Concept &amp; Visual Design:</strong> Develop original visual concepts and graphics for animation-related needs, including character art, environments, marketing campaigns, pitch decks, and digital assets. Ensure designs align with the studio’s creative vision and storytelling goals.</li>\n<li><strong>Expert Software Skills:</strong> Demonstrate expert-level proficiency in Adobe Creative Suite (Photoshop and Illustrator - compulsory). Knowledge in other tools like Figma, Canva, and Premiere Pro is a bonus. Understanding of motion graphics and UI/UX is a plus.</li>\n<li><strong>Team Collaboration:</strong> Collaborate with directors, animators, and other creative departments to translate ideas into compelling visual outputs. Provide creative input during brainstorming and storyboarding stages.</li>\n<li><strong>Branding &amp; Asset Development:</strong> Create and maintain visual branding across multiple platforms. Develop style guides, templates, and reusable graphic libraries to ensure consistency in visual storytelling.</li>\n<li><strong>Project &amp; Time Management:</strong> Handle multiple tasks and design requests simultaneously, often under tight deadlines. Maintain quality control and attention to detail across all outputs.</li>\n<li><strong>Communication &amp; Presentation:</strong> Present and explain design concepts clearly to internal teams or clients. Take constructive feedback positively and refine designs accordingly. Must possess strong interpersonal and communication skills.</li>\n<li><strong>Print Collateral Design:</strong> Develop brochures, flyers, posters, event branding, and other physical assets with deep knowledge of print processes and finishes, ensuring production-ready files.</li>\n<li><strong>Digital Design:</strong> Create visually consistent and user-friendly digital assets such as banners, newsletters, website components, and UI elements, optimized for various platforms.</li>\n<li><strong>Social Media Design &amp; Optimization:</strong> Design platform-specific creatives, keeping up to date with sizing, aspect ratios, and best practices for Instagram, Facebook, LinkedIn, YouTube, and other platforms.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Visual Communication:</strong> A deep understanding of how to communicate effectively through visual elements like imagery, typography, and layout. This includes the ability to translate complex ideas into clear and engaging visuals.</li>\n<li><strong>Typography:</strong> Mastery of typography, including font selection, hierarchy, spacing, and how to use type to convey tone and meaning. In animation, this extends to kinetic typography – animating text to enhance storytelling.</li>\n<li><strong>Color Theory:</strong> A strong grasp of color psychology, color palettes, and how to use color effectively to evoke emotions, create visual harmony, and establish branding.</li>\n<li><strong>Communication Skills:</strong> Excellent verbal and written communication skills to articulate design concepts, provide feedback, and present ideas effectively.</li>\n<li><strong>Problem-Solving:</strong> The ability to identify and solve creative and technical challenges that may arise during the animation production process.</li>\n<li><strong>Adaptability and Continuous Learning:</strong> Staying updated with the latest animation trends, software advancements, and industry best practices.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your updated CV to hr@tigrid.in</p>",
        "tags": [
            "1+ Years",
            "Adobe Creative Suite",
            "Visual Communication",
            "Typography"
        ],
        "summary": "Tigrid Technologies is hiring a Graphic Designer to develop visual concepts for animation and branding. Proficiency in Adobe Creative Suite and strong communication skills are essential."
    },
    {
        "job_title": "Executive Assistant (Fresher)",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/21798",
        "location": "Technopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Executive Assistant (Fresher)</h2>\n<p><strong>GENROBOTIC INNOVATIONS (P) Ltd</strong>\nThejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a></p>\n<p><strong>Closing Date:</strong> 30, July 2025\n<strong>Job Published:</strong> 14, July 2025</p>\n<p><strong>Contact Email:</strong> <a href=\"mailto:career@genrobotics.org\">career@genrobotics.org</a></p>\n<p><strong>Brief Description:</strong>\nWe are seeking a highly motivated and detail-oriented Executive Assistant, a hybrid role that combines executive support with responsibilities in business operations and analysis, offering the right candidate a chance to directly learn and contribute data-driven analysis to operational efficiency, strategic planning, and decision-making at the highest levels.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage calendars, schedule meetings, and coordinate meetings.</li>\n<li>Prepare and document minutes of meetings and ensure timely follow-up on action items.</li>\n<li>Organize and maintain both physical and digital files and records.</li>\n<li>Coordinate and facilitate effective interdepartmental communication.</li>\n<li>Assist with preparing meeting agendas and compiling necessary materials.</li>\n<li>Perform general administrative duties such as data entry, filing, and document preparation.</li>\n</ul>\n<p><strong>Preferred Skills/Skills Required:</strong></p>\n<ul>\n<li>Excellent verbal and written communication skills</li>\n<li>Strong organizational and multitasking abilities</li>\n<li>Basic knowledge of MS Office (Word, Excel, PowerPoint, Outlook)</li>\n<li>Willingness to learn and take initiative</li>\n<li>Ability to collaborate with multiple teams and departments</li>\n</ul>\n<p><strong>Added Advantage:</strong></p>\n<ul>\n<li>Strong analytical and critical thinking skills.</li>\n<li>Experience with Excel, PowerPoint, and Business Intelligence (BI) tools such as Power BI or Tableau.</li>\n<li>Proactive and detail-oriented approach to work.</li>\n</ul>\n<p><strong>Qualification:</strong> Any Degree</p>\n<p><strong>Experience:</strong> 0-3 years of experience in executive assistance, business analysis, or operations.</p>\n<p><strong>Location:</strong> Technopark, Thiruvananthapuram</p>\n<p><strong>For those who are interested in this position:</strong> <a href=\"mailto:career@genrobotics.org\">CLICK HERE TO APPLY!</a></p>",
        "tags": [
            "0-3 Years",
            "MS Office",
            "Communication Skills",
            "Business Analysis"
        ],
        "summary": "GenRobotic Innovations is hiring an Executive Assistant to provide executive support and contribute to data-driven analysis. The role involves administrative tasks, meeting coordination, and interdepartmental communication."
    },
    {
        "job_title": "Senior Accountant (M.Com Graduates only)",
        "company": "Susopt Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21797",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Senior Accountant</h2>\n<p><strong>SUSOPT SOLUTIONS (P) Ltd</strong>\n1ST FLOOR, M SQUARED BUILDING,\nTECHNOPARK CAMPUS,\nKARIYAVATTOM, TRIVANDRUM, KERALA , 695581\nhttp://www.susopt.com</p>\n<p><strong>Contact Email:</strong> hr@susopt.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>Financial Reporting &amp; Recording:</p>\n<ul>\n<li>Prepare and maintain accurate financial statements, including balance sheets, income statements, cash flow statements, and other management reports.</li>\n<li>Maintain accurate records of all financial transactions.</li>\n<li>Ensure all transactions are recorded in the general ledger, including journal entries, invoices, receipts, and payments.</li>\n<li>Reconcile accounts, including bank statements, accounts payable, and receivable.</li>\n</ul>\n<p>Taxation and Compliance:</p>\n<ul>\n<li>Ensure timely filing of GST returns, TDS, and other statutory compliance.</li>\n<li>Coordinate with external auditors for audits and provide necessary information and documentation.</li>\n<li>Stay updated with changes in tax laws and ensure compliance with relevant regulations (including GST, Income Tax, and other local laws).</li>\n</ul>\n<p>Accounts Payable &amp; Receivable:</p>\n<ul>\n<li>Oversee the accounts payable and receivable processes.</li>\n<li>Monitor cash flow and ensure that payments to vendors and receipts from clients are processed in a timely manner.</li>\n<li>Reconcile vendor statements and resolve any discrepancies.</li>\n</ul>\n<p>Internal Controls and Procedures:</p>\n<ul>\n<li>Maintain strong internal controls to ensure accuracy and integrity of financial records.</li>\n</ul>\n<p>Payroll Processing:</p>\n<ul>\n<li>Assist in the preparation of monthly payroll, including calculating salaries, deductions, bonuses, and benefits.</li>\n<li>Ensure statutory deductions (Provident Fund, Professional Tax, etc.) are deducted and paid on time.</li>\n<li>Maintain records of employee leaves, attendance, and other payroll-related documentation.</li>\n</ul>\n<p>Other Duties:</p>\n<ul>\n<li>Coordinate with other departments, such as procurement and operations, to resolve financial discrepancies and support business activities.</li>\n<li>Perform any other duties as assigned by the Finance Manager or senior management.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<p>Education and Experience:</p>\n<ul>\n<li>Master’s degree in Commerce (M.Com) or related field; CA inter or ACCA will be an added advantage.</li>\n<li>Minimum 7 plus years of experience in mid-sized companies or a reputed CA firm.</li>\n<li>Knowledge of UAE / Oman VAT and Corporate Tax laws will be a preference.</li>\n</ul>\n<p>Skills:</p>\n<ul>\n<li>Proficiency in accounting software (e.g., Tally, SAP B1, or similar) and MS Office (Excel, Word, PowerPoint).</li>\n<li>In-depth knowledge of accounting principles, tax laws, and financial reporting standards.</li>\n<li>Strong analytical skills and attention to detail.</li>\n<li>Ability to manage multiple tasks and meet deadlines.</li>\n<li>Excellent verbal and written communication skills in English and Malayalam (preferred for ease of communication within local teams and vendors).</li>\n</ul>\n<p>Personal Attributes:</p>\n<ul>\n<li>High level of integrity and confidentiality.</li>\n<li>Strong organizational skills and ability to work independently.</li>\n<li>Proactive, with a solution-oriented approach to problem-solving.</li>\n<li>Ability to work effectively in a team and collaborate with other departments.</li>\n</ul>\n<p>Compensation &amp; Benefits:</p>\n<ul>\n<li>Competitive salary based on experience and qualifications.</li>\n<li>Opportunities for career advancement and professional development.</li>\n</ul>\n<p>If you believe this role is a good fit for you, please send your CV to hr@susopt.com. Candidates from all parts of India are welcome to apply for this position.</p>\n<p>Closing Date: 31, July 2025\nJob Published: 14, July 2025</p>",
        "tags": [
            "7+ Years",
            "Accounting",
            "Tally",
            "Financial Reporting"
        ],
        "summary": "Seeking a Senior Accountant with 7+ years of experience to manage financial reporting, taxation, and compliance. Proficiency in accounting software and strong analytical skills required."
    },
    {
        "job_title": "WordPress Developers",
        "company": "Adroitminds Software Labs",
        "url": "https://technopark.org/job-details/21796",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>WordPress Developer</h2>\n<p><strong>AdroitMinds Software Labs</strong> is looking for a talented and detail-oriented WordPress Developer with 2–3 years of hands-on experience.</p>\n<p><strong>Location:</strong> Technopark Phase III, Trivandrum, India</p>\n<p><strong>Website:</strong> <a href=\"http://www.adroitminds.com\">http://www.adroitminds.com</a></p>\n<p><strong>Contact Email:</strong> <a href=\"careers@adroitminds.com\">careers@adroitminds.com</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain custom WordPress themes and plugins.</li>\n<li>Convert design mockups (Figma/PSD) into responsive, cross-browser-compatible WordPress websites.</li>\n<li>Customize and extend existing themes and plugins as per project requirements.</li>\n<li>Ensure website performance, speed, and scalability.</li>\n<li>Integrate third-party APIs and tools (e.g., payment gateways, CRMs, marketing tools).</li>\n<li>Troubleshoot and resolve website issues and bugs.</li>\n<li>Maintain and optimize existing WordPress websites.</li>\n<li>Collaborate with designers, project managers, and other developers.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>2–3 years of professional WordPress development experience.</li>\n<li>Strong knowledge of PHP, HTML5, CSS3, JavaScript/jQuery.</li>\n<li>Experience with custom theme and plugin development.</li>\n<li>Familiarity with page builders like Elementor, WPBakery, or Gutenberg.</li>\n<li>Good understanding of WordPress database architecture and REST API.</li>\n<li>Basic knowledge of SEO, website performance optimization, and security best practices.</li>\n<li>Experience with version control tools like Git.</li>\n<li>Ability to work independently and manage time effectively.</li>\n</ul>\n<p><strong>About AdroitMinds:</strong></p>\n<p>AdroitMinds is a product engineering, eCommerce, and AI company headquartered at Technopark, Trivandrum.</p>\n<p><strong>Follow Us:</strong></p>\n<ul>\n<li>LinkedIn: <a href=\"https://www.linkedin.com/company/adroitminds/\">https://www.linkedin.com/company/adroitminds/</a></li>\n<li>Instagram: <a href=\"https://www.instagram.com/adroitminds_official/\">https://www.instagram.com/adroitminds_official/</a></li>\n</ul>",
        "tags": [
            "2-3 Years",
            "WordPress",
            "PHP",
            "JavaScript"
        ],
        "summary": "AdroitMinds is seeking a WordPress Developer to develop and maintain WordPress sites. The role requires experience with PHP, HTML, CSS, JavaScript, and API integrations."
    },
    {
        "job_title": "MACHINE OPERATOR/DRIVER",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/21795",
        "location": "Technopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Machine Operator/Driver</h2>\n<p><strong>Genrobotic Innovations (P) Ltd</strong>\nThejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a></p>\n<p><strong>Closing Date:</strong> 30, July 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> <a href=\"mailto:Career@genrobotics.org\">Career@genrobotics.org</a></p>\n<p><strong>Brief Description:</strong>\nGenrobotic Innovations specializes in the design and development of robotic solutions to address the most pressing social issues. Our best-in-class solutions combine the use of robotics and artificial intelligence in a seamless fashion. Bandicoot is a cutting-edge solution that combines advanced engineering technology with compassion. By leveraging robotics and artificial intelligence, the Bandicoot Robot enters and cleans manholes, eliminating the need for sanitation workers to expose themselves to dangerous environments.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Operating Robot.</li>\n<li>Must have Four Wheeler Driving Skills.</li>\n<li>Basic Knowledge of Mechanical &amp; electrical maintenance works is good.</li>\n<li>Communicating with clients and taking bill updates.</li>\n<li>Communicating with the manager on a regular basis.</li>\n<li>Handle the site with complete responsibility.</li>\n</ul>\n<p><strong>Preferred Skills &amp; Qualifications:</strong></p>\n<ul>\n<li><strong>License/Certification:</strong> Four Wheeler Licence [LMV] (Preferred)</li>\n<li><strong>Qualification:</strong> ITI / Diploma in Electrical/Electronics/Mechanical</li>\n<li><strong>Experience:</strong> Freshers and experienced candidates can apply</li>\n<li><strong>Job Location:</strong> KWA Thiruvananthapuram</li>\n</ul>\n<p><a href=\"mailto:Career@genrobotics.org\">Click here to apply</a></p>",
        "tags": [
            "Freshers",
            "Robotics",
            "Four Wheeler Driving",
            "Mechanical Maintenance"
        ],
        "summary": "Operate and maintain robotic solutions for social issues, such as the Bandicoot robot. Requires driving skills and basic mechanical/electrical knowledge; freshers can apply."
    },
    {
        "job_title": "Engineering Manager - Mobile",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21794",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Engineering Manager - Mobile</h2>\n<p>Way.com is seeking a highly motivated and experienced Engineering Manager to join our Mobile Engineering Team. In this role, you will play a key part in leading the development of innovative projects that power our automotive platform. This is a unique opportunity to work with cutting-edge technology and be part of a team that is shaping the future of mobility.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Lead a team of Android and iOS engineers in designing, building, shipping, and maintaining mobile app features focused on our automotive platform.</li>\n<li>Manage the development and successful delivery of complex, cross-functional projects in close collaboration with engineering teams and stakeholders across the USA and Canada.</li>\n<li>Contribute to project planning and scoping efforts while owning the execution and delivery of key engineering initiatives.</li>\n<li>Collaborate with teams across Product, Design, Science, Research, Data Science, Regulatory, and Marketing to align on objectives and deliverables.</li>\n<li>Mentor and coach team members, fostering their technical and professional development, and supporting their career growth.</li>\n<li>Provide technical leadership to the team. While you may not be writing code regularly, your deep technical expertise will guide architecture decisions and lead technical discussions.</li>\n<li>Make well-informed technical decisions, balancing trade-offs to ensure scalable and sustainable solutions.</li>\n<li>Champion engineering best practices, define performance metrics, and drive continuous process and operational improvements.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications &amp; Requirements</strong></p>\n<ul>\n<li>A minimum of <strong>7+ years of experience</strong> in software engineering, including at least 2 years in a leadership or engineering management capacity</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or MCA</li>\n<li>Demonstrated experience in managing teams of <strong>Android and/or iOS engineers</strong></li>\n<li>Hands-on expertise in delivering consumer-facing mobile applications or the backend systems that support them</li>\n<li>Strong proficiency in <strong>Agile/Scrum development methodologies</strong>, with a solid understanding of iterative development and process optimization</li>\n<li>Exceptional communication, project management, and delegation skills, with a proven ability to deliver cross-functional projects from concept to launch</li>\n<li>Strong leadership and people management capabilities, with a focus on recognizing contributions, providing constructive feedback, and nurturing a culture of growth</li>\n<li>A collaborative, empathetic, and adaptable mindset, with openness to feedback and a commitment to continuous learning</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Email: careers@way.com</p>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583</p>",
        "tags": [
            "7+ Years",
            "Android",
            "iOS",
            "Agile/Scrum"
        ],
        "summary": "We are seeking an Engineering Manager to lead our mobile engineering team and drive the development of our automotive platform. Requires 7+ years of experience and proficiency in Agile/Scrum."
    },
    {
        "job_title": "Senior Business Development Executive",
        "company": "Stackmod Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/21793",
        "location": "Technopark",
        "closing_date": "14 Aug 2025",
        "job_description": "<h2>Senior Business Development Executive</h2>\n<p>Stackmod Innovations (P) Ltd is seeking a motivated and results-driven Senior Business Development Executive to join our Sales Department.</p>\n<p><strong>Location:</strong> Ace-22, 5th Floor, CDAC Building, Technopark Phase 1 Campus, Thiruvananthapuram, 695581</p>\n<p><strong>Website:</strong> <a href=\"https://www.stackmod.io\">https://www.stackmod.io</a></p>\n<p><strong>Contact Email:</strong> hr@stackmod.io</p>\n<p><strong>Closing Date:</strong> 14, Aug 2025</p>\n<p><strong>Job Published:</strong> 14, July 2025</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage existing client accounts and maintain long-term relationships.</li>\n<li>Identify and pursue new sales opportunities through cold calling, networking, and lead generation.</li>\n<li>Understand client requirements and provide suitable solutions and proposals.</li>\n<li>Prepare and deliver presentations, quotations, and sales reports.</li>\n<li>Coordinate with internal teams to ensure client satisfaction and timely service delivery.</li>\n<li>Meet or exceed monthly and quarterly sales targets.</li>\n<li>Maintain accurate records of sales activities, client interactions, and pipeline status.</li>\n<li>Follow up on payments and ensure timely collections.</li>\n<li>Stay updated on industry trends and competitors.</li>\n</ul>\n<h3>Key Skills and Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, or a related field.</li>\n<li>1–3 years of experience in sales, business development, or account management.</li>\n<li>Excellent communication, negotiation, and interpersonal skills.</li>\n<li>Strong customer service orientation and relationship management abilities.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Proficiency in MS Office and CRM tools.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience in B2B or tech product/service sales.</li>\n<li>Background in managing corporate clients or enterprise accounts.</li>\n<li>Familiarity with sales forecasting, reporting, and CRM platforms.</li>\n<li>Proven ability to close deals and handle objections effectively.</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>Competitive salary and attractive incentives</li>\n<li>Opportunity to work with a dynamic sales team and fast-growing company</li>\n<li>Professional growth, skill development, and career advancement opportunities</li>\n<li>Collaborative and performance-driven work culture</li>\n<li>Exposure to diverse client industries and sales strategies</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates can send their updated resume to hr@stackmod.io with the subject line \"Senior Business Development Executive – Sales.\"</p>",
        "tags": [
            "1-3 Years",
            "Business Development",
            "CRM",
            "Sales"
        ],
        "summary": "Stackmod Innovations is hiring a Senior Business Development Executive to manage client accounts and identify new opportunities. The ideal candidate will drive sales growth and build strong client relationships."
    },
    {
        "job_title": "Spanish Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21792",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Way.Com India Pvt Ltd</strong> is seeking a customer-focused and enthusiastic professional to join our team as a Spanish Customer Success Executive. You will be the primary point of contact for our Spanish-speaking customers, ensuring each interaction is handled with care, efficiency, and professionalism.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage both inbound and outbound calls, addressing customer inquiries, concerns, and complaints promptly and courteously.</li>\n<li>Provide compassionate and solution-focused support to guarantee a positive experience during every interaction.</li>\n<li>Recognize and prioritize complex issues, escalating them to the appropriate teams for swift and effective resolution.</li>\n<li>Accurately document all customer communications, keeping records current and comprehensive.</li>\n<li>Achieve or surpass monthly performance goals, including metrics related to customer satisfaction, first-call resolution, and overall productivity.</li>\n<li>Stay well-informed about company products and services to deliver precise and current information to customers.</li>\n<li>Work collaboratively with team members to build a positive, high-performing, and supportive work environment.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>Fluent in both <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong <strong>interpersonal and communication skills</strong>, with a patient and empathetic approach.</li>\n<li>Ability to <strong>multitask</strong> and <strong>manage time efficiently</strong> in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 16, July 2025</p>",
        "tags": [
            "1+ Years",
            "Spanish Language",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "Way.Com is hiring a Spanish Customer Success Executive to support Spanish-speaking customers. Responsibilities include managing inquiries, resolving issues, and ensuring customer satisfaction."
    },
    {
        "job_title": "Customer Success Executive",
        "company": "Waybeo Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21791",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Customer Success Executive</h2>\n<p><strong>Waybeo Technology Solutions</strong> offers advanced intelligence through call tracking &amp; ad-generated calls for enterprises, serving about 22,000 locations across India. As a Customer Success Executive, you will collaborate with the customer success team to ensure customer satisfaction and value from our products and services. You'll assist in building and maintaining client relationships, addressing queries, and improving the overall customer experience.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Collaborate with the Customer Success team in managing customer accounts.</li>\n<li>Work with cross-functional teams (Tech, Sales, Marketing, Support) to ensure customer needs are met.</li>\n<li>Support onboarding and training of new customers to ensure successful product adoption.</li>\n<li>Learn about competitors and analyze how to integrate new processes.</li>\n<li>Monitor customer usage patterns to identify areas for improvement or potential upsell opportunities.</li>\n<li>Conduct customer follow-ups to gather feedback, identify pain points, and offer solutions.</li>\n<li>Assist with maintaining and updating customer data in CRM tools.</li>\n<li>Help create and manage customer success documentation and reports.</li>\n<li>Assist in developing and implementing strategies to improve the overall customer experience.</li>\n</ul>\n<p><strong>Qualification:</strong></p>\n<ul>\n<li>0-1 year of experience</li>\n<li>A graduate degree in a relevant field, preferably an MBA or a related discipline.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Hands-on experience in customer success strategies and customer relationship management.</li>\n<li>Learn about key customer retention metrics and how to drive customer satisfaction.</li>\n<li>Build professional communication and problem-solving skills.</li>\n<li>Exposure to various departments such as Sales, Marketing, and Product Development.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong written and verbal communication skills in English.</li>\n<li>Basic computing knowledge, with multi-tasking &amp; documentation skills.</li>\n<li>Good knowledge in using MS Office tools like Excel and familiarity with CRM tools.</li>\n<li>Passion for customer service and enhancing customer experience.</li>\n<li>Ability to collaborate with different departments and work in a team environment.</li>\n<li>High attention to detail and organizational skills.</li>\n<li>Willingness to learn and adapt in a fast-paced environment.</li>\n<li>Good understanding of the Hindi language is a plus.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Email:</strong> aiswarya.cs@waybeo.com</li>\n<li><strong>Website:</strong> http://www.waybeo.com</li>\n</ul>",
        "tags": [
            "0-1 Year",
            "Customer Success",
            "CRM",
            "Communication Skills"
        ],
        "summary": "Join Waybeo as a Customer Success Executive, ensuring client satisfaction and value. Responsibilities include client relationship management, onboarding, and cross-functional collaboration to enhance customer experience."
    },
    {
        "job_title": "Senior ReactJS Engineer (Contract)",
        "company": "Diagnal Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21790",
        "location": "Technopark",
        "closing_date": "28 Aug 2025",
        "job_description": "<h2>Senior ReactJS Engineer (Contract)</h2>\n<p><strong>DIAGNAL TECHNOLOGIES (P) Ltd</strong>\n2801, Yamuna Building, Technopark Phase III, Trivandrum, 695583\n<a href=\"http://www.diagnal.com\">http://www.diagnal.com</a></p>\n<p><strong>Closing Date:</strong> 28, Aug 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> vivekkumar.jaiswal@diagnal.com</p>\n<p><strong>Brief Description:</strong>\nYou will:</p>\n<ul>\n<li>Develop ReactJS Web video streaming apps for Browsers / TV and supporting metadata management platforms.</li>\n<li>Responsible for the technical design and development of advanced video streaming consumer applications with multiple backend integrations.</li>\n<li>Deliver app solutions across the entire app life cycle – prototype to build to test to launch to support.</li>\n<li>Build sleek Web UI UX interfaces with a focus on usability features.</li>\n<li>Optimize performance and stability, as well as non-functional aspects such as logging.</li>\n<li>Keep up to date on the latest industry trends and Device / OS / IDE updates.</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\nYou have:</p>\n<ul>\n<li>4+ years of Experience (at least 3 years in React.js).</li>\n<li>Excellent command of the English language.</li>\n<li>3 or more years of experience in front-end web-based solutions in a project services or product engineering organization.</li>\n<li>Hands-on development experience using JavaScript, HTML, CSS, AJAX, JSON.</li>\n<li>Good working knowledge of JavaScript Frameworks, especially ReactJS.</li>\n<li>Must be experienced in React 18 and have a basic understanding of React 19.</li>\n<li>Experience with application frameworks and in-depth knowledge of SOLID principles.</li>\n<li>Experience with developing highly polished consumer-facing websites with smooth interactivity and responsive behavior directly from design assets.</li>\n<li>Published sites that are now online.</li>\n<li>Self-motivation and the ability to manage your own time to get the job done at the high international quality levels we expect.</li>\n<li>An engineering Degree in computer science or equivalent practical experience.</li>\n<li>A solid understanding of browser system fundamentals, application performance optimization, and backend integration.</li>\n<li>Prior experience working within the OTT apps, Media, E-commerce, Telecommunications, or similar large-scale consumer-facing industry is preferred.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "ReactJS",
            "JavaScript",
            "HTML/CSS"
        ],
        "summary": "Seeking a Senior ReactJS Engineer to develop web video streaming apps. Requires 4+ years of experience and expertise in ReactJS, JavaScript, HTML, and CSS."
    },
    {
        "job_title": "Junior Company Secretary",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21789",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Junior Company Secretary</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA , 695581\nhttps://www.kenland.in</p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p><strong>Job Summary:</strong>\nWe are seeking a qualified and motivated Junior Company Secretary to join our team. The ideal candidate must be a member of ICSI with at least 1 year of experience in handling company secretarial and compliance functions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Assist in ensuring compliance with the Companies Act, SEBI regulations, and other applicable laws.</li>\n<li>Support in drafting notices, agendas, and minutes for Board and General Meetings.</li>\n<li>Help maintain statutory registers and filing of forms with MCA/ROC.</li>\n<li>Coordinate with auditors, legal advisors, and regulatory authorities.</li>\n<li>Support senior management in corporate governance and compliance matters.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Qualified Company Secretary with valid ICSI membership.</li>\n<li>Minimum 1 year of experience in a company secretarial/compliance role.</li>\n<li>Basic understanding of corporate laws, secretarial standards, and statutory filings.</li>\n<li>Good communication and documentation skills.</li>\n<li>Ability to handle compliance tasks with attention to detail.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Company Secretarial",
            "Compliance",
            "Corporate Laws"
        ],
        "summary": "Kenland IT Solutions is looking for a Junior Company Secretary. The role involves ensuring compliance and supporting corporate governance, requiring a qualified Company Secretary with experience."
    },
    {
        "job_title": "Senior Dot Net Developer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21788",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Senior .Net Developer</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA, 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p>We are seeking a skilled and experienced Senior .Net Developer to lead and manage the development of complex software projects. The ideal candidate will have strong technical knowledge, leadership skills, and experience in delivering high-quality solutions while managing a team effectively.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the design, development, and deployment of applications using .NET Core and related technologies.</li>\n<li>Collaborate with stakeholders to gather and analyze requirements, ensuring alignment with project goals.</li>\n<li>Provide technical leadership and mentorship to the development team.</li>\n<li>Oversee project planning, scheduling, and execution to ensure timely delivery of milestones.</li>\n<li>Review code to ensure adherence to coding standards and best practices.</li>\n<li>Troubleshoot and resolve technical issues during the development lifecycle.</li>\n<li>Coordinate with cross-functional teams, including QA, DevOps, and Product Management.</li>\n<li>Monitor project risks and implement mitigation strategies.</li>\n<li>Prepare and present progress reports to senior management and stakeholders.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science, Engineering, or a related field.</li>\n<li>5+ years of experience in software development, with at least 3+ years in .NET Core.</li>\n<li>Strong proficiency in C#, ASP.NET Core, Entity Framework, and RESTful APIs.</li>\n<li>Hands-on experience with cloud platforms like Azure or AWS.</li>\n<li>Familiarity with front-end technologies like Angular, React, or Vue.js is a plus.</li>\n<li>Experience in microservices architecture and containerization (e.g., Docker, Kubernetes).</li>\n<li>Proven ability to manage a team and deliver projects on time.</li>\n</ul>",
        "tags": [
            "5+ Years",
            ".NET Core",
            "C#",
            "RESTful APIs"
        ],
        "summary": "Seeking a Senior .Net Developer to lead the development of complex software projects. Requires strong technical knowledge and team management experience to deliver high-quality solutions."
    },
    {
        "job_title": "Junior Dot Net Developer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21787",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Junior .Net Developer</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA, 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> <a href=\"mailto:recruiter@kenland.in\">recruiter@kenland.in</a></p>\n<p><strong>Brief Description</strong>\nWe are seeking a junior ASP.NET Developer with 1-2 years of experience to join our development team. The ideal candidate will be responsible for designing, developing, and maintaining web applications using ASP.NET MVC and .Net Core.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop, test, and deploy ASP.NET MVC applications.</li>\n<li>Collaborate with cross-functional teams to define and implement new features.</li>\n<li>Debug and resolve software issues to ensure optimal performance.</li>\n<li>Participate in code reviews and follow best coding practices.</li>\n<li>Maintain and improve existing applications, identifying areas for optimization.</li>\n<li>Stay updated with the latest technologies and ASP.NET best practices.</li>\n<li>Document code and technical designs for future reference.</li>\n<li>Provide basic technical support and troubleshooting for applications in production.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Strong knowledge of C# programming language.</li>\n<li>Experience in software development, with .NET Core.</li>\n<li>Familiarity with HTML, CSS, JavaScript, and jQuery.</li>\n<li>Basic experience with front-end frameworks like Bootstrap.</li>\n<li>Understanding of relational databases, Entity Framework, and ORM tools (Dapper).</li>\n<li>Knowledge of version control systems like Git.</li>\n<li>Good problem-solving skills and attention to detail.</li>\n<li>Ability to work effectively in a collaborative team environment.</li>\n<li>A positive attitude, willingness to learn, and adaptability to project requirements.</li>\n<li>Basic understanding of object-oriented programming (OOP) principles.</li>\n<li>Experience in writing SQL queries and working with relational databases.</li>\n<li>Exposure to RESTful APIs and Web Services.</li>\n<li>Understanding of Agile methodologies.</li>\n<li>Knowledge of cloud platforms like Azure.</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "ASP.NET MVC",
            ".NET Core",
            "C#"
        ],
        "summary": "Seeking a Junior ASP.NET Developer to design, develop, and maintain web applications. The role involves using ASP.NET MVC and .Net Core within a collaborative team."
    },
    {
        "job_title": "Jr. Executive - Business Development",
        "company": "Zoondia Software (P) Ltd",
        "url": "https://technopark.org/job-details/21786",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Jr. Executive - Business Development</h2>\n<p>Zoondia Software (P) Ltd is seeking a motivated Junior Business Development Executive to contribute to the growth of our IT services business.</p>\n<p><strong>Location:</strong> T2, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.zoondia.com\">http://www.zoondia.com</a></p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> recruit@zoondia.in</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Find and connect with new leads using platforms like LinkedIn, email, etc.</li>\n<li>Assist in preparing sales proposals and presentations.</li>\n<li>Help schedule meetings and calls with clients.</li>\n<li>Maintain lead and client data in the CRM.</li>\n<li>Support the senior BD team in day-to-day tasks.</li>\n<li>Follow up with leads and respond to basic inquiries.</li>\n<li>Stay updated on our services and industry trends.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Prefer Immediate Joiners</li>\n</ul>\n<p><strong>Experience:</strong> 1-3 yrs</p>\n<p><strong>Qualification:</strong> Bachelor’s degree in Business Administration, Marketing, or a related field.</p>",
        "tags": [
            "1-3 Years",
            "Business Development",
            "Lead Generation",
            "CRM"
        ],
        "summary": "Zoondia is looking for a Junior Business Development Executive to support the sales team and grow the IT services business. Responsibilities include lead generation, client communication, and CRM management."
    },
    {
        "job_title": "Java Developer (Job Location : West Mumbai)",
        "company": "Zoondia Software (P) Ltd",
        "url": "https://technopark.org/job-details/21785",
        "location": "Technopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Java Developer</h2>\n<p><strong>Zoondia Software (P) Ltd</strong>\nT2, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.zoondia.com\">http://www.zoondia.com</a></p>\n<p><strong>Job Location:</strong> West Mumbai</p>\n<p><strong>Closing Date:</strong> 30, July 2025</p>\n<p><strong>Job Published:</strong> 14, July 2025</p>\n<p><strong>Contact Email:</strong> recruit@zoondia.in</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Strong in JAVA, Spring Boot, and Spring MVC</li>\n<li>Experience in REST API development and integration</li>\n<li>Worked with Spring Security, Spring Batch, JPA</li>\n<li>Proficient in SQL queries and stored procedures</li>\n<li>Hands-on with MySQL and MariaDB</li>\n<li>Basic knowledge of React and jQuery</li>\n<li>Experience in UPI payment integration</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Prefer Immediate Joiners</li>\n</ul>\n<p><strong>Experience:</strong> 2 to 5 years</p>",
        "tags": [
            "2-5 Years",
            "Java",
            "Spring Boot",
            "REST API"
        ],
        "summary": "Zoondia Software is seeking a Java Developer for their West Mumbai location. The role involves Java, Spring Boot, REST API development, and database proficiency."
    },
    {
        "job_title": "Flutter Developer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21784",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Flutter Developer</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA , 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> <a href=\"mailto:recruiter@kenland.in\">recruiter@kenland.in</a></p>\n<p><strong>Role Overview:</strong>\nWe are seeking a skilled Flutter Developer with a strong background in mobile application development to join our dynamic team. The ideal candidate will be passionate about building seamless and high-performance apps for both Android and iOS platforms, using Flutter and Dart.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, test, and deploy high-quality mobile applications using Flutter.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Maintain and improve the codebase for scalability, reliability, and performance.</li>\n<li>Implement third-party APIs and ensure smooth integration with back-end services.</li>\n<li>Debug and resolve application issues, ensuring optimal performance.</li>\n<li>Stay updated with emerging technologies and industry trends.</li>\n<li>Participate in code reviews to maintain quality and consistency.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Experience:</strong> 2 years in Flutter and Dart.</li>\n<li>Proficiency in building cross-platform apps with robust UI/UX.</li>\n<li>Solid understanding of the mobile development lifecycle.</li>\n<li>Familiarity with RESTful APIs and third-party libraries.</li>\n<li>Strong knowledge of Git or other version control tools.</li>\n<li>Experience with native mobile development (Android/iOS) is a plus.</li>\n<li>Problem-solving skills with attention to detail.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Flutter",
            "Dart",
            "RESTful APIs"
        ],
        "summary": "Kenland IT Solutions is seeking a Flutter Developer to build high-performance mobile apps. The role involves cross-functional collaboration, API integration, and maintaining code quality."
    },
    {
        "job_title": "Customer Relationship Executive",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21783",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Customer Relationship Executive</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA , 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p><strong>Brief Description:</strong>\nWe are seeking an experienced Customer Relationship Executive with over 2+ years of expertise in handling customers within service-oriented industries, such as hospitals, salons, and healthcare. The ideal candidate must have strong communication skills, a pleasing personality, and high ethical standards. They should be capable of professionally and amiably handling customers, managing pressure effectively, and engaging in cold conversations to enhance customer relationships.</p>\n<p><strong>Key Responsibilities:</strong>\n- Build and maintain strong relationships with customers to ensure a positive service experience.\n- Act as the primary point of contact for customer inquiries, concerns, and feedback.\n- Ensure high levels of customer satisfaction and retention through proactive engagement.\n- Handle cold conversations to build rapport with new and potential customers.\n- Manage customer grievances effectively with a polite and problem-solving approach.\n- Maintain a customer database and ensure timely follow-ups.\n- Collaborate with internal teams to ensure smooth service delivery.\n- Work under pressure and handle high customer volumes efficiently.\n- Uphold professional ethics and integrity in all interactions.\n- Communicate fluently in Malayalam, English, and Tamil to cater to a diverse customer base.</p>\n<p><strong>Preferred Skills:</strong>\n- 2+ years of experience in customer relationship management in the service sector.\n- Strong verbal and written communication skills in Malayalam, English, and Tamil.\n- Pleasing personality with excellent interpersonal skills.\n- Ability to handle cold conversations and customer complaints tactfully.\n- Strong problem-solving and conflict-resolution abilities.\n- Ability to work under pressure and manage multiple tasks efficiently.\n- High level of professional ethics, integrity, and customer service orientation.</p>",
        "tags": [
            "2+ Years",
            "Customer Relationship Management",
            "Communication Skills",
            "Problem-solving"
        ],
        "summary": "Seeking a Customer Relationship Executive to manage customer relations in service industries. Requires strong communication, problem-solving skills, and fluency in Malayalam, English, and Tamil."
    },
    {
        "job_title": "TELESALES EXECUTIVE-FEMALES PREFERRED",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21782",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Telesales Executive - Females Preferred (Walk-In)</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\n<a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> July 15, 2025 - July 15, 2025\n*   <strong>Time:</strong> 10:30:00 AM to 12:30:00 PM\n*   <strong>Published:</strong> July 14, 2025\n*   <strong>Contact Email:</strong> <a href=\"mailto:trainonexsolutions.hr@gmail.com\">trainonexsolutions.hr@gmail.com</a></p>\n<p><strong>Brief Description:</strong>\nWe are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for conducting sales over the phone and maintaining good customer relationships. The goal is to help the company grow by acquiring customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<ul>\n<li>Immediate Joiners Needed</li>\n<li>Work from office opportunity</li>\n<li>Experience: 0-1 years required (Freshers can also apply)</li>\n<li>Female Candidates preferred</li>\n<li>Fluency with Malayalam Language required</li>\n<li>Salary: 17-2Preferred SkillsCustomer Interaction</li>\n</ul>\n<p><strong>Skills:</strong>\n*   Customer Interaction\n*   Communication\n*   Interpersonal communication\n*   Meet sales goals</p>\n<p><strong>Walk-In Venue:</strong>\nTRAINONEX SOLUTIONS\nM SQUARED BUILDING FIRST FLOOR\nTECHNOPARK PHASE 1</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\n*   <a href=\"link\">Click here to download the Mobile App for Android</a>\n*   <a href=\"link\">Click here to download the Mobile App for iOS</a></p>\n<p><strong>Website URL:</strong>\n<a href=\"http://vms.technopark.org\">vms.technopark.org</a>\n<a href=\"link\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Communication",
            "Customer Interaction"
        ],
        "summary": "Trainonex Solutions is seeking a Telesales Executive to drive sales and build customer relationships. This role requires fluency in Malayalam and offers an office-based opportunity."
    },
    {
        "job_title": "Operations Executive",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21781",
        "location": "Technopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Operations Executive</h2>\n<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong>\n3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2,\nTECHNOPARK CAMPUS, KARIYAVATTOM,\nTRIVANDRUM, KERALA , 695581\n<a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<p><strong>Closing Date:</strong> 15, Aug 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> <a href=\"mailto:recruiter@kenland.in\">recruiter@kenland.in</a></p>\n<p>We are seeking a proactive and technically skilled Operations Executive with a strong background in Techno Commercial operations. The ideal candidate will play a key role in managing operations, client coordination, and external meetings. This role requires someone who can bridge technical knowledge and ensure smooth execution of project activities.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Coordinate and manage external meetings, techno commercial operations</li>\n<li>Represent the company in discussions related to ongoing and upcoming projects.</li>\n<li>Prepare and maintain project documentation, client reports, and presentations</li>\n<li>Ensure smooth communication flow between clients and internal departments</li>\n<li>Attend site visits, client meetings, and official events as needed</li>\n<li>Maintain strong professional relationships with clients and stakeholders</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 3+ years of experience in IT operations or client-handling roles</li>\n<li>Bachelor’s degree in Engineering (B.Tech preferred)/ PG in Engineering</li>\n<li>Strong interpersonal, coordination, and communication skills</li>\n<li>Good understanding of IT services, technical concepts, and project workflows</li>\n<li>Need to have knowledge in required tools</li>\n<li>Ability to manage multiple responsibilities and meet deadlines</li>\n<li>Willingness to travel for meetings and client visits</li>\n</ul>\n<p><strong>Preferred Attributes:</strong></p>\n<ul>\n<li>Experience in handling business coordination in an IT or tech-based organization</li>\n<li>Ability to handle both technical and operational tasks efficiently</li>\n<li>Confident in representing the organization in professional settings</li>\n</ul>",
        "tags": [
            "3+ Years",
            "IT Operations",
            "Client Coordination",
            "Project Management"
        ],
        "summary": "Kenland IT Solutions is hiring an Operations Executive to manage operations and client coordination. The role involves techno-commercial operations and requires strong communication skills and IT knowledge."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21780",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p><strong>Way.Com India Pvt Ltd</strong> is seeking a results-driven Business Development Manager to join our energetic sales team. This role is perfect for someone who thrives in fast-paced settings, excels at building strong relationships, and is driven by revenue growth through strategic multi-channel outreach (calls, emails, and digital engagement).</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Be part of something meaningful – Join a dynamic, collaborative team that thrives on creativity and constantly challenges boundaries.</li>\n<li>Enjoy competitive rewards – Benefit from a comprehensive compensation and benefits package that values your contributions and achievements.</li>\n<li>Grow your career – We support your professional development with ongoing learning and growth opportunities.</li>\n<li>Make a real impact – Be a part of groundbreaking initiatives that influence the future of mobility and enhance daily life.</li>\n</ul>\n<p><strong>Key Responsibilities:</strong></p>\n<p>As a Business Development Manager, your responsibilities will include:</p>\n<ul>\n<li>Actively identifying and engaging potential clients through outbound calls, emails, and social platforms to qualify new business opportunities.</li>\n<li>Delivering compelling product presentations that clearly articulate the value and advantages of our solutions to prospective customers.</li>\n<li>Maintaining accurate and up-to-date customer data in the CRM system to ensure timely follow-ups and effective pipeline management.</li>\n<li>Consistently meeting or surpassing sales targets and performance benchmarks, directly contributing to the company’s growth.</li>\n<li>Fostering and maintaining strong relationships with existing clients to encourage repeat business and referrals.</li>\n<li>Creating comprehensive sales reports and forecasts for leadership to support strategic decisions and planning.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications</strong></p>\n<ul>\n<li>Proven experience in B2B sales, with a strong track record of achieving targets.</li>\n<li>5–8 years of sales experience; prior experience in the e-commerce sector is highly desirable.</li>\n<li>Exceptional written and verbal communication skills.</li>\n<li>Strong negotiation and relationship-building abilities.</li>\n<li>Self-motivated, goal-oriented, and capable of working independently with minimal supervision.</li>\n<li>Proficient in using CRM software (e.g., Zoho) and the Microsoft Office Suite.</li>\n<li>Resilient in the face of rejection, with the ability to maintain a positive attitude.</li>\n<li>A Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@way.com</p>\n<p>Way Dot Com (P) Ltd\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com</p>\n<p>Closing Date:16,July 2025\nJob Published: 14,July 2025</p>",
        "tags": [
            "5-8 Years",
            "B2B Sales",
            "CRM Software",
            "E-commerce"
        ],
        "summary": "Way.Com India is looking for a Business Development Manager to drive revenue growth through multi-channel outreach. The ideal candidate will have 5-8 years of B2B sales experience."
    },
    {
        "job_title": "Social Media Marketing Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21779",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Social Media Marketing Manager</h2>\n<p><strong>Way.com</strong> is seeking a dynamic <strong>Social Media Marketing Manager</strong> to lead and execute the company's social media strategy. This role involves overseeing all social media initiatives, building brand awareness, growing a loyal community, and driving user engagement across various platforms.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Strategy Development:</strong> Create and implement a comprehensive social media strategy aligned with Way.com’s business goals and brand voice.</li>\n<li><strong>Content Creation &amp; Curation:</strong> Drive content development for social media, ensuring it is engaging, on-brand, and optimized for each platform (Facebook, Instagram, X, LinkedIn, TikTok, etc.).</li>\n<li><strong>Community Engagement:</strong> Foster positive relationships with the online community, engaging with followers, responding to inquiries, and managing online conversations.</li>\n<li><strong>Brand Building:</strong> Increase brand awareness, engagement, and advocacy through social media channels.</li>\n<li><strong>Analytics &amp; Reporting:</strong> Monitor and analyze social media metrics and performance to refine strategies and report on KPIs.</li>\n<li><strong>Collaborations &amp; Partnerships:</strong> Identify and develop strategic partnerships with influencers, brands, and other third-party collaborators to enhance social media reach and engagement.</li>\n<li><strong>Trend Spotting:</strong> Stay ahead of social media trends, emerging platforms, and new technologies to maintain a competitive edge.</li>\n<li><strong>Cross-functional Collaboration:</strong> Work with content, design, product, and customer service teams to ensure seamless integration of social media efforts.</li>\n<li><strong>Budget Management:</strong> Manage the marketing budget efficiently to meet goals.</li>\n<li><strong>Crisis Management:</strong> Address any potential issues, negative feedback, or crises on social media in a timely and professional manner.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, or a related field (Master’s preferred).</li>\n<li>9+ years of experience in social media marketing, with a proven track record in leading social media campaigns and building brands.</li>\n<li>Strong understanding of social media platforms (Facebook, Instagram, X, LinkedIn, TikTok, etc.).</li>\n<li>Expertise in social media management tools (Hootsuite, Sprout Social, Buffer etc.) and analytics platforms (Google Analytics, Socialbakers, etc.).</li>\n<li>Excellent communication and leadership skills.</li>\n<li>Strong creative and strategic thinking skills.</li>\n<li>In-depth knowledge of social media advertising and paid campaign strategies.</li>\n<li>Ability to work under pressure, manage multiple projects, and meet deadlines.</li>\n<li>A passion for staying on top of digital trends, social media innovations, and new technologies.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>",
        "tags": [
            "9+ Years",
            "Social Media Marketing",
            "Content Creation",
            "Community Engagement"
        ],
        "summary": "Way.com is looking for a Social Media Marketing Manager to enhance brand awareness and drive user engagement across various platforms. The role involves strategy development, content creation, and community management."
    },
    {
        "job_title": "Content QA Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21778",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Content QA Specialist</h2>\n<p>Way.Com India Pvt Ltd is seeking a detail-oriented and quality-focused Content QA Specialist to join our content team. As the final gatekeeper before publication, this role ensures every piece of content meets the highest standards of accuracy, compliance, optimization, and credibility.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>Content Integrity Reviews</strong><ul>\n<li>Manually assess articles, blogs, and landing pages for grammar, clarity, tone, and consistency with brand style.</li>\n<li>Identify and correct issues such as awkward phrasing, factual inaccuracies, and formatting errors.</li>\n</ul>\n</li>\n<li><strong>SEO and Content Value Assessment</strong><ul>\n<li>Ensure content complies with on-page SEO standards, including meta tags, header hierarchy, keyword usage, and internal linking.</li>\n<li>Detect and flag thin or low-value content that does not serve the user effectively.</li>\n</ul>\n</li>\n<li><strong>AI and Plagiarism Monitoring</strong><ul>\n<li>Conduct manual checks and use appropriate tools to identify AI-generated or machine-written content.</li>\n<li>Run plagiarism scans to uphold originality and content authenticity.</li>\n</ul>\n</li>\n<li><strong>EEAT Compliance Audits</strong><ul>\n<li>Verify author credentials and assess the credibility of sources used.</li>\n<li>Ensure the content demonstrates subject matter expertise and includes properly cited data and expert contributions.</li>\n</ul>\n</li>\n<li><strong>Quality Feedback and Process Optimization</strong><ul>\n<li>Continuously update and maintain the QA checklist based on industry changes and best practices.</li>\n<li>Deliver constructive feedback to writers and editors to support ongoing content improvement.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Preferred Skills/Requirements</strong></p>\n<ul>\n<li>Minimum of <strong>2 years of experience</strong> in content quality assurance, editing, or SEO.</li>\n<li>Exceptional <strong>manual editing skills</strong> with <strong>strong attention to detail</strong>.</li>\n<li>Solid understanding of <strong>SEO fundamentals and Google’s content quality guidelines</strong>.</li>\n<li>Proven ability to <strong>identify AI-generated content</strong> and assess it for human readability.</li>\n<li>Proficient in using tools such as <strong>Grammarly, Copyscape, Copyleaks, Originality.ai</strong>, or similar alternatives.</li>\n<li>Skilled at identifying <strong>low-value or thin content</strong> and providing actionable improvement recommendations.</li>\n<li>Comfortable operating <strong>in a high-volume, fast-paced content production environment</strong>.</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Educational or professional background in <strong>journalism, digital marketing, or technical writing</strong>.</li>\n<li>Experience working with content management systems like <strong>WordPress</strong>.</li>\n<li>Familiarity with <strong>structured data, Yoast SEO plugin, and content scoring tools</strong>.</li>\n<li>Understanding of <strong>content compliance processes and fact-checking workflows</strong>.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>careers@way.com</p>",
        "tags": [
            "2+ Years",
            "Content Quality Assurance",
            "SEO",
            "AI Content Detection"
        ],
        "summary": "Way.Com is looking for a Content QA Specialist to ensure content meets high standards and aligns with SEO best practices. This role involves content review, AI detection, and quality feedback."
    },
    {
        "job_title": "Email Marketing Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21777",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Email Marketing Specialist</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Location:</strong> Thiruvananthapuram</p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> July 16, 2025</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Customer-Centric Campaigns:</strong></li>\n<li>Identify customer pain points and ideate innovative solutions to enhance user experiences.</li>\n<li>Develop and execute user-driven campaign strategies informed by ongoing insights.</li>\n<li>Monitor and analyze email performance metrics, with a focus on audience segmentation, list ingestion, and automation accuracy.</li>\n<li>\n<p>Implement anomaly detection procedures to maintain email deliverability and operational continuity.</p>\n</li>\n<li>\n<p><strong>Personalization at Scale:</strong></p>\n</li>\n<li>\n<p>Harness marketing automation, behavioral data, and ML-based techniques to craft highly personalized, scalable email marketing experiences.</p>\n</li>\n<li>\n<p><strong>Experimentation &amp; Optimization:</strong></p>\n</li>\n<li>Design and implement iterative testing plans to improve campaign effectiveness continually.</li>\n<li>\n<p>Analyze trends and extract actionable insights to refine strategies and share learnings organization-wide.</p>\n</li>\n<li>\n<p><strong>Data-Driven Growth:</strong></p>\n</li>\n<li>Drive key performance metrics, including MQLs, SQOs, pipeline, and revenue.</li>\n<li>\n<p>Report performance metrics on a regular cadence and optimize campaigns to exceed targets.</p>\n</li>\n<li>\n<p><strong>Cross-Functional Collaboration:</strong></p>\n</li>\n<li>Build strong relationships with senior leaders across product, engineering, compliance, marketing, and partner teams to ensure alignment between email marketing and broader business goals.</li>\n<li>Influence cross-functional roadmaps and strategies to integrate email marketing needs into product, marketing, and technical initiatives.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li>\n<p><strong>Experience:</strong> 10–15 years of expertise in email marketing, with at least 3 years in a leadership role. Proven experience designing and executing data-driven email marketing strategies at scale.</p>\n</li>\n<li>\n<p><strong>Technical Expertise:</strong> In-depth understanding of email technology, including webhooks, APIs, and ETLs. Strong ability to articulate and manage technical requirements with Product, Engineering, and Data Science teams.</p>\n</li>\n<li>\n<p><strong>Analytical Acumen:</strong> Advanced analytical skills to interpret data trends and derive actionable insights for continuous optimization. Expertise in driving experimentation roadmaps to achieve measurable improvements.</p>\n</li>\n<li>\n<p><strong>Industry Knowledge:</strong> Deep understanding of the email landscape, including deliverability, privacy regulations (e.g., GDPR, US Privacy policies), and growth marketing concepts such as attribution and incrementality.</p>\n</li>\n<li>\n<p><strong>Leadership Skills:</strong> A self-starter with the ability to manage both strategic initiatives and tactical workstreams with minimal oversight.</p>\n</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Competitive Rewards: Industry-leading compensation and benefits package.</li>\n<li>Career Growth: The opportunity to lead and scale a global email marketing charter.</li>\n<li>Prestige &amp; Impact: Collaborate with one of the most respected names in the US Startup ecosystem, driving meaningful business outcomes.</li>\n</ul>",
        "tags": [
            "10-15 Years",
            "Email Marketing",
            "Data-driven strategies",
            "Marketing Automation"
        ],
        "summary": "Way.Com is seeking an Email Marketing Specialist to drive customer-centric campaigns and data-driven growth. The role involves personalization at scale, experimentation, and cross-functional collaboration."
    },
    {
        "job_title": "Technical Lead - IOS",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21776",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>iOS Technical Lead</h2>\n<p>Way.Com India Pvt Ltd is seeking an experienced and passionate iOS Technical Lead to drive the next phase of growth and innovation within our iOS app ecosystem. We are a rapidly growing digital platform transforming the automotive services industry, offering users a unified and seamless experience across web and mobile platforms.</p>\n<p><strong>Role Overview</strong></p>\n<p>As the iOS Technical Lead, you will be responsible for leading the architecture, design, development, and optimization of our iOS applications. This is a strategic and hands-on role where you will work closely with cross-functional teams to deliver high-performing, scalable, and engaging mobile experiences. Strong technical expertise, combined with leadership and mentoring capabilities, is essential for success in this role.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Lead the architecture, design, and development of our iOS applications using Swift.</li>\n<li>Collaborate with Product and Design teams to translate business requirements into scalable technical solutions.</li>\n<li>Ensure optimal app performance, quality, and responsiveness across a wide range of iOS devices.</li>\n<li>Mentor and guide junior and mid-level iOS developers, conducting code reviews and fostering professional growth.</li>\n<li>Maintain high standards in code quality, testing, and documentation throughout the development lifecycle.</li>\n<li>Work closely with backend and API teams to design and integrate scalable services.</li>\n<li>Drive technical innovation and continuous improvement within the mobile development stack.</li>\n<li>Own the end-to-end delivery of new features and performance enhancements.</li>\n<li>Stay abreast of the latest iOS trends, best practices, and platform updates.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications</strong></p>\n<ul>\n<li>10+ years of experience in mobile application development, with a minimum of 6 years specializing in iOS development.</li>\n<li>Expertise in Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines.</li>\n<li>Strong knowledge of RESTful APIs, JSON parsing, and third-party library integration.</li>\n<li>Experience in architecting complex mobile applications using modular design patterns (MVVM, MVI, MVP).</li>\n<li>Proficiency in CI/CD pipelines, automated testing, code reviews, and App Store deployment processes.</li>\n<li>Proven track record of leading teams and mentoring iOS developers.</li>\n<li>Familiarity with tools such as Firebase, Mixpanel, or similar analytics and crash reporting platforms.</li>\n<li>Understanding of web app ecosystems and cross-platform compatibility.</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Experience with Core Bluetooth, Core Location, or real-time services integration (e.g., EV or roadside assistance).</li>\n<li>Background in mobility, transportation, or automotive technology platforms.</li>\n<li>Familiarity with Kotlin Multiplatform or other cross-platform frameworks.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>careers@way.com</p>",
        "tags": [
            "10+ Years",
            "Swift",
            "iOS Development",
            "RESTful APIs"
        ],
        "summary": "Seeking an iOS Technical Lead to lead the development of iOS applications and mentor junior developers. Requires 10+ years of mobile development experience and expertise in Swift."
    },
    {
        "job_title": "Senior iOS Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21775",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Senior iOS Developer</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>\n<p><strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a></p>\n<p><strong>Closing Date:</strong> 16, July 2025</p>\n<p><strong>Job Published:</strong> 14, July 2025</p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain robust iOS applications using <strong>Swift</strong>, <strong>Objective-C</strong>, and <strong>SwiftUI</strong>.</li>\n<li>Architect scalable and maintainable solutions leveraging <strong>MVVM</strong> and <strong>MVC</strong> design patterns.</li>\n<li>Apply <strong>SOLID principles</strong> to ensure clean code structure and maintainable architecture.</li>\n<li>Optimize application performance through efficient memory usage and advanced multithreading techniques.</li>\n<li>Build adaptive and responsive user interfaces using <strong>Auto Layout</strong> for consistency across all iOS devices.</li>\n<li>Integrate and manage push notification services to deliver timely, personalized alerts to users.</li>\n<li>Implement deep linking capabilities to support seamless navigation between in-app content and external sources.</li>\n<li>Perform thorough code reviews, uphold high coding standards, and provide mentorship to junior developers.</li>\n<li>Develop and maintain unit tests to ensure application reliability and stability.</li>\n<li>Utilize <strong>Core Location</strong> and <strong>Apple Maps</strong> frameworks to create intuitive, location-aware features.</li>\n<li>Integrate <strong>Firebase</strong> for real-time data synchronization, crash analytics, and performance tracking.</li>\n<li>Ensure compliance with App Store guidelines and manage the entire submission, review, and release lifecycle.</li>\n<li>Collaborate effectively with product managers, designers, and backend teams to deliver feature-rich, high-quality apps.</li>\n<li>Maintain a streamlined development process using version control tools such as <strong>Git</strong>.</li>\n</ul>\n<h3>Required Qualifications:</h3>\n<ul>\n<li>Minimum of <strong>5 years of hands-on experience</strong> in iOS application development.</li>\n<li>Strong proficiency in <strong>Swift</strong> and <strong>Objective-C</strong>, with the ability to write clean, efficient, and maintainable code.</li>\n<li>In-depth understanding and practical experience with architectural patterns such as <strong>MVVM</strong> and <strong>MVC</strong>.</li>\n<li>Proven ability to apply <strong>SOLID principles</strong> to build scalable, modular, and testable codebases.</li>\n<li>Strong knowledge of <strong>memory management</strong> and <strong>multithreading</strong> for optimal application performance.</li>\n<li>Extensive experience in building user interfaces using <strong>SwiftUI</strong>, <strong>Auto Layout</strong>, and creating responsive, adaptive UIs.</li>\n<li>Proficient in implementing <strong>Push Notification frameworks</strong> and enabling <strong>deep linking</strong> to enhance user engagement and navigation.</li>\n<li>Hands-on experience with version control systems, particularly <strong>Git</strong>, for collaborative development and release workflows.</li>\n<li>Demonstrated ability to conduct thorough <strong>code reviews</strong> to ensure adherence to coding standards and best practices.</li>\n<li>Skilled in writing and maintaining <strong>unit tests</strong> to support application stability, performance, and reliability.</li>\n<li>Practical experience with <strong>Apple Maps</strong>, <strong>Core Location</strong>, and building location-based services.</li>\n<li>Familiarity with <strong>Firebase</strong>, including integration of analytics, crash reporting, and real-time data features.</li>\n<li>Solid understanding of <strong>App Store guidelines</strong> and experience managing the app submission and review process.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience with <strong>Continuous Integration/Continuous Deployment (CI/CD)</strong> pipelines and tools.</li>\n<li>Working knowledge of <strong>Agile development methodologies</strong> and collaborative team practices.</li>\n<li>Strong analytical and problem-solving skills, with the ability to work independently and within a team.</li>\n<li>Experience in performance tuning and optimization of iOS applications for improved efficiency and user experience.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Swift",
            "Objective-C",
            "Firebase"
        ],
        "summary": "We are looking for a Senior iOS Developer to design and maintain iOS applications. The candidate should have strong skills in Swift, Objective-C, and Firebase."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21774",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p>Way.Com India Pvt Ltd is seeking a Senior Java Developer to join our team in Thiruvananthapuram.</p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain robust, scalable Java applications utilizing the <strong>Spring Boot</strong> framework.</li>\n<li>Collaborate with <strong>Product Owners</strong>, <strong>Solution Architects</strong>, and cross-functional teams to translate business needs into effective technical solutions.</li>\n<li>Build and integrate <strong>RESTful APIs</strong> to ensure seamless system communication and enhance application capabilities.</li>\n<li>Continuously refactor and optimize existing codebases to improve <strong>performance</strong>, <strong>scalability</strong>, and <strong>maintainability</strong>.</li>\n<li>Conduct detailed <strong>code reviews</strong>, uphold best coding practices, and mentor junior developers to support overall team growth.</li>\n<li>Stay updated with the latest tools, technologies, and best practices within the <strong>Java ecosystem</strong> to boost development efficiency.</li>\n<li>Proactively <strong>troubleshoot</strong>, identify, and resolve complex software bugs and performance issues to ensure a smooth user experience.</li>\n<li>Follow established <strong>development methodologies</strong>, coding standards, and organizational guidelines to deliver high-quality, reliable software solutions.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent professional experience).</li>\n<li>Minimum of <strong>5+ years</strong> of professional experience in <strong>Java development</strong>, with strong hands-on expertise in <strong>Spring Boot</strong> and <strong>MySQL</strong>.</li>\n<li>In-depth understanding of <strong>Java SE</strong> and <strong>Java EE</strong> concepts, including multithreading, design patterns, and JVM internals.</li>\n<li>Proven experience in <strong>RESTful API</strong> design, development, and integration.</li>\n<li>Proficient in working with <strong>MySQL</strong> or other relational databases, with the ability to write and optimize complex SQL queries.</li>\n<li>Hands-on experience with <strong>version control systems</strong>, particularly <strong>Git</strong>.</li>\n<li>Familiarity with <strong>Agile methodologies</strong> (e.g., Scrum, Kanban) and experience working in Agile development environments.</li>\n<li>Strong problem-solving, debugging, and analytical skills, capable of addressing complex technical challenges.</li>\n<li>Excellent written and verbal communication skills with the ability to thrive in a <strong>collaborative, team-oriented environment</strong>.</li>\n<li>Demonstrated ability to mentor junior developers and contribute technical leadership to development teams.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience working with <strong>microservices architecture</strong> and <strong>Docker</strong> containerization.</li>\n<li>Working knowledge of <strong>cloud platforms</strong>, such as <strong>AWS</strong> or <strong>Microsoft Azure</strong>.</li>\n<li>Familiarity with <strong>CI/CD pipelines</strong> and automation tools (e.g., Jenkins, GitLab CI).</li>\n<li>Experience with <strong>unit testing frameworks</strong>, such as <strong>JUnit</strong> or <strong>TestNG</strong>.</li>\n<li>Proven track record of building <strong>scalable, high-performance applications</strong> in production-grade environments.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Seeking a Senior Java Developer with strong Spring Boot and MySQL skills. The role involves designing, developing, and maintaining scalable Java applications within a collaborative team environment."
    },
    {
        "job_title": "Senior Android Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21773",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Senior Android Developer</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> July 16, 2025</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain high-quality Android applications using <strong>Kotlin</strong> and <strong>Jetpack Compose</strong>.</li>\n<li>Collaborate closely with cross-functional teams to conceptualize, design, and deliver innovative features.</li>\n<li>Ensure seamless performance and reliability of applications across a diverse range of Android devices.</li>\n<li>Continuously optimize application speed, scalability, and overall resource utilization.</li>\n<li>Stay current with emerging tools, frameworks, and industry best practices in Android development.</li>\n<li>Write clean, structured, and testable code that aligns with modern Android development standards.</li>\n<li>Guide and mentor junior developers, fostering a culture of learning, collaboration, and technical excellence.</li>\n<li>Proactively identify, analyze, and resolve complex bugs and performance issues to maintain a smooth user experience.</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li><strong>Innovative Culture:</strong> Work in an environment that encourages creativity, experimentation, and continuous learning.</li>\n<li><strong>Modern Tech Stack:</strong> Build with the latest technologies like Kotlin and Jetpack Compose, and stay ahead in the fast-evolving Android ecosystem.</li>\n<li><strong>Collaborative Team:</strong> Be part of a passionate and supportive team that values knowledge sharing and growth.</li>\n<li><strong>Impactful Work:</strong> Contribute to projects that reach and influence thousands of users across varied Android platforms.</li>\n<li><strong>Growth Opportunities:</strong> Enjoy access to mentorship and learning resources to help you advance in your role.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Minimum <strong>5 years</strong> of professional experience in Android application development.</li>\n<li>Proficiency in Kotlin, with practical expertise in <strong>Jetpack Compose</strong> for building modern UIs.</li>\n<li>Strong understanding of <strong>Android architecture components</strong> including <strong>ViewModel</strong>, <strong>LiveData</strong>, <strong>Room</strong>, etc.</li>\n<li>Proven experience in integrating and consuming <strong>RESTful APIs</strong> and utilizing <strong>third-party libraries</strong> effectively.</li>\n<li>Solid grasp of <strong>UI/UX design principles</strong> and <strong>Material Design</strong> guidelines, with the ability to create intuitive and responsive user interfaces.</li>\n<li>Proficient in using <strong>Android Studio</strong>, <strong>Gradle</strong>, and related development tools.</li>\n<li>Experience with <strong>unit testing</strong> and familiarity with frameworks such as <strong>JUnit</strong> and <strong>Mockito</strong>.</li>\n<li>Knowledge of <strong>CI/CD pipelines</strong> and experience with <strong>version control systems</strong>, particularly <strong>Git</strong>.</li>\n<li>Demonstrated <strong>problem-solving abilities</strong> and the capability to work independently as well as collaboratively in a team environment.</li>\n<li>Excellent <strong>verbal and written communication skills</strong>.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Hands-on experience with <strong>Kotlin Coroutines</strong> and <strong>Flows</strong> for managing asynchronous tasks.</li>\n<li>Familiarity with <strong>Android Jetpack libraries</strong> such as <strong>Navigation</strong>, <strong>Paging</strong>, and <strong>WorkManager</strong>.</li>\n<li>Experience with <strong>Firebase</strong> or other cloud-based backend services.</li>\n<li>Exposure to <strong>Kotlin Multiplatform Mobile (KMM)</strong> or experience in developing <strong>cross-platform applications</strong>.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Kotlin",
            "Jetpack Compose",
            "Android Architecture Components"
        ],
        "summary": "Seeking a Senior Android Developer to design and maintain high-quality Android applications. The role requires expertise in Kotlin, Jetpack Compose, and Android architecture."
    },
    {
        "job_title": "Software Engineer - AI/ML",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21772",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Software Engineer - AI/ML</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced AI/ML Engineer to develop and drive new business opportunities. The ideal candidate will be responsible for developing AI/ML solutions and discovering sales opportunities. </p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p><strong>Responsibilities:</strong>\n- Developing AI/ML Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and Generative AI models.\n- Designing and delivering ML architecture patterns operable in native and hybrid cloud architectures.\n- Creating Functional and technical specifications for AI/ML solutions.\n- Implementing machine learning algorithms in services and pipelines that can be used on a web scale.\n- Developing proofs of concept AI/ML based solutions and services and demonstrating them to Business.\n- Designing, developing, and implementing Generative AI models using state-of-the-art techniques.\n- Collaborating with cross-functional teams to define project goals, research requirements, and develop innovative solutions.\n- Implementing and deploying AI/ML solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)</p>\n<p><strong>Requirements:</strong>\n- 3+ years of relevant experience in AI/ML projects.\n- B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA\n- Specialization in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.\n- Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).\n- Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g., Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g., Tensorflow, Pytorch).\n- Experience in RDBMS, NoSQL, Big Data stores like Elastic, Cassandra, Hbase, Hive, HDFS, and Big Data technologies like Kafka, Apache Spark is a plus.\n- Strong knowledge of statistical concepts and techniques.\n- Knowledge in data visualization tools (Tableau, Power BI, etc.) and SQL.\n- Excellent understanding of object-oriented concepts and Python.\n- Experience in NLP models like BERT, Transformer architectures, etc.\n- Experience in leveraging Computer Vision and OCR in document extraction use cases.\n- Excellent problem-solving and analytical skills.\n- Strong communication and presentation skills.</p>\n<p><strong>Preferred Skills:</strong>\n- Experience in production software engineering routines (e.g., Continuous Integration/Continuous Deployment).\n- Experiences in cloud-based solutions (e.g., AWS, Azure, GCP).\n- Experience working using Agile-based principles and tools.\n- Familiarity with working on large data sets and distributed computing (e.g., Hive, Spark, Kafka, Airflow, Scala).\n- Certification in any of the available cloud-based AI/ML technologies is a plus.</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours</p>\n<p><strong>Contact Information:</strong>\n- Email: careers@techversantinfotech.com\n- Website: http://www.techversantinfotech.com\n- Address: Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581</p>\n<p><strong>Closing Date:</strong> 21, July 2025\n<strong>Job Published:</strong> 14, July 2025</p>",
        "tags": [
            "3+ Years",
            "AI/ML",
            "Python",
            "Tensorflow"
        ],
        "summary": "Techversant Infotech is seeking an AI/ML Engineer to develop AI/ML solutions. The role involves designing, implementing, and deploying machine learning models and collaborating with cross-functional teams."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21771",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a Senior AI/ML Engineer to develop and drive new business opportunities internationally. The ideal candidate will discover sales opportunities and create qualified leads.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. They offer expertise in Digital Transformation and various technology domains.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models.</li>\n<li>Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs).</li>\n<li>Build Scalable Recommendation Engines: Develop and optimize recommendation systems.</li>\n<li>Cloud-Native ML Engineering: Deploy and manage machine learning pipelines in cloud environments (AWS, GCP, Azure).</li>\n<li>End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering to monitoring.</li>\n<li>Collaborate Across Functions: Work with cross-functional teams to translate business goals into AI-powered solutions.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Minimum 4 years of experience in building and deploying production-level ML/DL systems.</li>\n<li>Develop proofs of concept AI/ML-based solutions and demonstrate them to stakeholders.</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines.</li>\n<li>Design, develop, and implement Generative AI models.</li>\n<li>Strong understanding of transformer architectures and deep learning model design.</li>\n<li>Hands-on experience in building at least one production-grade Deep learning or Generative AI solution.</li>\n<li>Expertise in Python programming (code optimization, multi-threading, OOP).</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices.</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops.</li>\n<li>Excellent problem-solving, analytical, communication, and presentation skills.</li>\n</ul>\n<h3>Technical Stack:</h3>\n<ul>\n<li><strong>Languages:</strong> Python.</li>\n<li><strong>ML/DL Frameworks:</strong> Scikit-learn, XGBoost, LightGBM, PyTorch, TensorFlow, Keras, Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework.</li>\n<li><strong>Cloud &amp; MLOps:</strong> AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes.</li>\n<li><strong>Data &amp; Compute:</strong> Apache Spark, BigQuery, RabbitMQ, S3, EC2.</li>\n<li><strong>Embedding Stores &amp; Vector Search:</strong> FAISS, Pinecone, ChromaDB.</li>\n<li><strong>Orchestration &amp; APIs:</strong> Apache Airflow, Docker Deployment, FastAPI.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience with multi-modal models.</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct).</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems.</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure).</li>\n</ul>\n<h3>Education:</h3>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, AI, Data Science, or related field.</li>\n<li>Equivalent practical experience considered.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities.</li>\n<li>Fixed weekday day schedule.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment.</li>\n<li>Various internal employee rewards programs.</li>\n<li>Opportunities for various Bonus programs.</li>\n<li>Work-life Balance (flexible work timings, early out Fridays, social and cultural activities).</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Closing Date:</strong> 21, July 2025</p>\n<p><strong>Job Published:</strong> 14, July 2025</p>",
        "tags": [
            "4+ Years",
            "Python",
            "ML/DL",
            "Generative AI"
        ],
        "summary": "Seeking a Senior AI/ML Engineer to develop AI solutions and drive new business opportunities. The role involves building scalable ML systems and deploying them in cloud environments."
    },
    {
        "job_title": "AI/ML – Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21770",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>AI/ML – Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a highly skilled and experienced AI/ML Lead to lead the design and implementation of our artificial intelligence and machine learning solutions. The successful candidate will work closely with cross-functional teams to understand business requirements and develop scalable, efficient, and robust AI/ML systems.</p>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>Job Description:</strong></p>\n<p>As an AI/ML Lead, you will:</p>\n<ul>\n<li>Build Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and generative models.</li>\n<li>Define, design, and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Create demos and proofs of concept, develop AI/ML based products and services.</li>\n<li>Create Functional and technical specifications for AI &amp; ML solutions.</li>\n<li>Follow SDLC process</li>\n<li>Utilize advanced analytical knowledge of data and data conditioning</li>\n<li>Program advanced computing and developing algorithms</li>\n<li>Develop software, data models and executing predictive analysis</li>\n<li>Design, develop, and implement generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements and develop innovative solutions.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).</li>\n<li>Strong proficiency in SQL, NO SQL Databases.</li>\n<li>Experience in implementing and deploying AI\\ Machine Learning solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)</li>\n<li>Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.</li>\n<li>Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g. Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience in production software engineering routines in DevOps/MLOps (e.g. Continuous Code Integration and Deployment).</li>\n<li>Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</li>\n</ul>\n<p><strong>Experience and Qualification:</strong></p>\n<ul>\n<li>B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Contact Information:</strong>\ncareers@techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 21,July 2025\n<strong>Job Published:</strong> 14,July 2025</p>\n<p><strong>Location:</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "3+ Years",
            "Python",
            "AI/ML",
            "Tensorflow"
        ],
        "summary": "Techversant Infotech is looking for an AI/ML Team Lead. You will design and implement AI/ML solutions and work with cross-functional teams."
    },
    {
        "job_title": "Lead React Native Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21769",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Lead React Native Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\n<a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 21, July 2025\n<strong>Job Published:</strong> 14, July 2025\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p>Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>What’s important to us:</h3>\n<p>As a Lead- React Native Developer, you will lead the development and maintenance of our mobile applications using React Native. You will collaborate closely with cross-functional teams, including backend developers, to deliver high-quality, scalable, and user-friendly mobile solutions. The ideal candidate should have extensive experience in React Native development, possess a deep understanding of mobile application development best practices, and demonstrate leadership abilities to guide and mentor junior team members.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Lead the development and implementation of mobile applications using React Native.</li>\n<li>Collaborate with cross-functional teams to gather and analyze project requirements.</li>\n<li>Previous ownership of app development projects is required.</li>\n<li>Develop automated tests to guarantee the product’s top-notch quality.</li>\n<li>Stay updated with the latest advancements and changes in mobile platforms and technologies.</li>\n<li>Provide technical supervision and support to mentor the team effectively.</li>\n<li>Conduct code reviews to ensure adherence to coding standards, best practices, and maintain code quality.</li>\n<li>Ensure the application is published and maintained in both the App Store and Google Play Store, adhering to their respective policies and guidelines.</li>\n<li>Participate in agile development processes, including sprint planning, estimation, and retrospectives.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>10+ years of experience in React Native Development, Minimum 3 yrs in Lead role.</li>\n<li>Expert-level proficiency in JavaScript, TypeScript, and React Native framework.</li>\n<li>Demonstrated hands-on experience in designing and developing applications using React Native, iOS and Android platforms.</li>\n<li>Capability to plan the core architecture and iteratively enhance it as needed.</li>\n<li>Strong analytical mindset to extract actionable insights from data.</li>\n<li>Excellent Team management and communication skills.</li>\n<li>Experience with RESTful APIs and integration of third-party libraries and APIs.</li>\n<li>Possess a comprehensive understanding of React Native.</li>\n<li>Capable of understanding the company’s business needs and adjusting or innovating the product accordingly.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>",
        "tags": [
            "10+ Years",
            "React Native",
            "JavaScript",
            "RESTful APIs"
        ],
        "summary": "We seek a Lead React Native Developer to lead mobile app development, collaborate with cross-functional teams, and mentor junior developers. The role requires 10+ years of React Native experience."
    },
    {
        "job_title": "Python Solution Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21768",
        "location": "Technopark",
        "closing_date": "21 Jul 2025",
        "job_description": "<h2>Python Solution Architect</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Solution Architect to design and implement scalable, high-performance AI-driven applications. The ideal candidate will have a strong background in Python development, excellent leadership skills, and a passion for mentoring and guiding team members.</p>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. We offer expertise and consultation in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, and more.</p>\n<p><strong>Job Responsibilities:</strong></p>\n<ul>\n<li>Architect and design end-to-end solutions using Python (Django/FastAPI/Flask), AI/ML models, and cloud-native technologies.</li>\n<li>Lead AI/ML-driven application development, including model deployment, data pipelines, and intelligent automation.</li>\n<li>Collaborate with data scientists, engineers, and product teams to integrate AI/ML models into scalable applications.</li>\n<li>Optimize system performance, ensuring scalability, cost efficiency, and security.</li>\n<li>Implement microservices architecture with APIs, containerization (Docker/Kubernetes), and event-driven design.</li>\n<li>Drive best DevOps practices with CI/CD pipelines, MLOps, Infrastructure as Code (Terraform, CloudFormation), and automated testing.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Python &amp; Full Stack: Django, FastAPI, Flask, React, Angular, or Vue.js.</li>\n<li>AI/ML &amp; Data Science: TensorFlow, PyTorch, Scikit-learn, NLP, Computer Vision, or MLOps.</li>\n<li>Cloud &amp; DevOps: AWS, Azure, or GCP with Kubernetes &amp; CI/CD.</li>\n<li>Big Data &amp; Databases: PostgreSQL, MongoDB, Redis, Snowflake, or Spark.</li>\n<li>Architecture &amp; Security: Microservices, API Gateway, Event-Driven Systems, and best security practices.</li>\n</ul>\n<p><strong>Ideal Experience Level:</strong></p>\n<ul>\n<li>10+ years in software development with strong Python expertise, including full-stack development.</li>\n<li>2+ years of experience as a Solution Architect, with demonstrated success in leading and delivering enterprise-level projects.</li>\n<li>Strong AI/ML experience, specifically in model deployment, data engineering, and cloud integration</li>\n</ul>\n<p><strong>Nice-to-Have Skills:</strong></p>\n<ul>\n<li>Hands-on experience with LLMs, Generative AI, or Reinforcement Learning.</li>\n<li>Expertise in GraphQL, Serverless (AWS Lambda, Firebase), and Edge AI.</li>\n<li>Experience with data engineering, real-time analytics, and feature stores.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Techversant Infotech (P) Ltd\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\nhttp://www.techversantinfotech.com\nContact Email: careers@techversantinfotech.com</p>",
        "tags": [
            "10+ Years",
            "Python",
            "AI/ML",
            "Cloud"
        ],
        "summary": "Techversant is hiring a Python Solution Architect to lead AI/ML application development and design end-to-end solutions. The role requires 10+ years of software development experience."
    },
    {
        "job_title": "React Native Developer – Fresher",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/21767",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>React Native Developer – Fresher</h2>\n<p>Spericorn Technology is looking for enthusiastic and passionate React Native Freshers eager to kick-start their careers in mobile app development. This is a fantastic opportunity to learn from experienced developers, contribute to real-world projects, and grow in a dynamic, tech-driven environment.</p>\n<p><strong>Contact:</strong> careers@spericorn.com</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Basic understanding of JavaScript/TypeScript and core mobile development concepts</li>\n<li>Familiarity with mobile UI/UX design patterns and responsive design principles and API integrations.</li>\n<li>Understanding of component-based architecture in React Native</li>\n<li>Experience with React Native core components: View, Text, FlatList, ScrollView, etc.</li>\n<li>Knowledge of basic state management using useState, useEffect, or tools like React Context and Redux</li>\n<li>Exposure to RESTful APIs, AsyncStorage, and mobile app debugging tools</li>\n<li>Familiarity with tools like VS Code, Xcode, IntelliJ, React Native Debugger, Flipper, or Chrome DevTools</li>\n<li>Basic understanding of the Android &amp; iOS ecosystems, including app configuration and build processes</li>\n</ul>\n<p><strong>Bonus Skills (Good to Have):</strong></p>\n<ul>\n<li>Exposure to other mobile or cross-platform frameworks like Flutter, or native development in Swift / Kotlin</li>\n</ul>\n<p><strong>What You’ll Do:</strong></p>\n<ul>\n<li>Work closely with senior developers to build, enhance, and maintain cross-platform mobile apps</li>\n<li>Assist in testing, debugging, and deploying new features and updates</li>\n<li>Participate in code reviews, daily stand-ups, and knowledge-sharing sessions</li>\n<li>Collaborate with design, QA, and backend teams to deliver seamless user experiences</li>\n<li>Write clean, maintainable, and well-documented code</li>\n<li>Continuously learn and adapt to new tools, technologies, and best practices in mobile development</li>\n</ul>\n<p><strong>Company:</strong> Spericorn Technology Private Limited\nAmstor Building, Technopark Phase I, Trivandrum, 695581\nhttp://www.spericorn.com</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 12, July 2025</p>",
        "tags": [
            "Fresher",
            "React Native",
            "JavaScript/TypeScript",
            "RESTful APIs"
        ],
        "summary": "Spericorn Technology is seeking enthusiastic React Native Freshers. This role involves building and maintaining mobile apps, collaborating with teams, and continuous learning in a dynamic environment."
    },
    {
        "job_title": "BUSINESS ANALYST",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/21766",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p><strong>Spericorn Technology Private Limited</strong> is a global software development firm seeking a Business Analyst to join our talented team and contribute to transforming ideas into reality. We value quality, commitment, and integrity and offer services in cutting-edge technologies like blockchain and AI.</p>\n<p><strong>Contact:</strong> careers@spericorn.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Conduct requirement gathering sessions with clients and stakeholders via calls and meetings.</li>\n<li>Translate business needs into clear, concise, and detailed functional and non-functional requirements.</li>\n<li>Prepare documentation including but not limited to BRD, FRD, SRS etc.</li>\n<li>Use case diagrams, flowcharts, and wireframes (if applicable).</li>\n<li>Act as the liaison between the client and the technical team, ensuring clarity and consistency.</li>\n<li>Participate in daily stand-ups, sprint planning, and project status meetings.</li>\n<li>Assist in backlog grooming and creation of user stories in Agile environments.</li>\n<li>Work closely with QA to define acceptance criteria and validate test cases against requirements.</li>\n<li>Ensure timely and accurate communication with internal teams and external stakeholders.</li>\n<li>Manage requirement changes using structured change control processes.</li>\n<li>Contribute to product vision, roadmap discussions, and process improvements.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>3+ years of experience</strong> as a Business Analyst in an IT or software development environment.</li>\n<li>Basic understanding of software development lifecycle (SDLC), especially Agile/Scrum methodologies.</li>\n<li>Familiarity with technical terminologies like APIs, databases, web services, UI/UX concepts, etc.</li>\n<li>Experience preparing comprehensive documentation (BRD, FRD, SRS).</li>\n<li>Proficient in tools like MS Office, Jira, Confluence, Figma/Balsamiq (or equivalent).</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong analytical thinking, attention to detail, and problem-solving capabilities.</li>\n<li>Experience working with cross-functional teams and multiple stakeholders.</li>\n<li>Ability to manage multiple priorities in a fast-paced environment.</li>\n</ul>\n<p><strong>Other Info Requested:</strong> Notice period, CTC, and Expected CTC.</p>\n<p><strong>Note:</strong> Kindly mention in the email subject \"Application for the post of Business Analyst.\"</p>",
        "tags": [
            "3+ Years",
            "Agile/Scrum",
            "Jira",
            "Confluence"
        ],
        "summary": "Spericorn Technology is seeking a Business Analyst to gather requirements, create documentation, and act as a liaison between clients and the technical team. The ideal candidate should have 3+ years of experience."
    },
    {
        "job_title": "Senior Software Architect",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/21765",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Senior Software Architect</h2>\n<p>Spericorn Technology is seeking a seasoned Senior Software Architect to lead and shape the technical direction of complex, scalable, and secure systems. This role demands a deep understanding of modern software architecture patterns and hands-on experience in building robust solutions for banking, financial platforms, and e-commerce systems with high transaction volumes. You will drive architectural decisions, lead engineering discussions, and guide the technical execution of large-scale digital products.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead architectural strategy, design, and implementation for enterprise-grade applications.</li>\n<li>Collaborate with product, DevOps, and engineering teams to translate business requirements into scalable, secure, and resilient architectures.</li>\n<li>Own the architecture lifecycle, including blueprinting, documentation, system evaluation, and refactoring.</li>\n<li>Conduct architecture reviews and ensure adherence to best practices, coding standards, and security guidelines.</li>\n<li>Evaluate and recommend tools, technologies, and frameworks aligned with architectural vision.</li>\n<li>Enable DevOps automation, CI/CD pipelines, infrastructure as code, and observability standards.</li>\n<li>Provide mentorship and technical leadership to engineering teams across domains.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>7+ years of experience in software development, with at least 3 years in a lead or architect role.</li>\n<li>Proven experience designing distributed systems, large-scale APIs, and microservices-based applications.</li>\n<li>Strong background in event-driven architecture, asynchronous processing, and domain-driven design (DDD).</li>\n<li>Experience with REST, GraphQL, and API-first design principles.</li>\n<li>Hands-on knowledge of AWS (preferred), Azure, or GCP, with practical experience in services like Lambda, ECS/EKS, S3, API Gateway, DynamoDB, SQS, etc.</li>\n<li>Proficiency in Docker, Kubernetes, Helm, and containerized deployments.</li>\n<li>Familiarity with Infrastructure as Code tools like Terraform or AWS CloudFormation.</li>\n<li>Experience building high-security systems following standards like OWASP, PCI-DSS, and GDPR.</li>\n<li>Deep knowledge of authentication, authorization protocols (OAuth2, OIDC, SAML, JWT), and IAM integration.</li>\n<li>Experience designing high-performance systems with caching (Redis, Memcached), CDN strategies, and request optimization.</li>\n<li>Strong data modeling experience with RDBMS (PostgreSQL, MySQL) and NoSQL databases (MongoDB, Cassandra).</li>\n<li>Exposure to messaging and streaming systems such as Kafka, RabbitMQ, or Amazon EventBridge.</li>\n<li>Experience with software development using one or more of the following: Java, Python, Node.js, TypeScript, .NET, or Go.</li>\n<li>Familiarity with CI/CD tools (GitHub Actions, Jenkins, GitLab CI) and version control systems like Git.</li>\n<li>Understanding of observability, monitoring, and logging using tools like Prometheus, Grafana, ELK Stack, or Datadog.</li>\n<li>Experience in architecting digital platforms in the banking, fintech, or e-commerce domains.</li>\n<li>Exposure to Blockchain technologies, smart contracts, and decentralized systems.</li>\n<li>Strong analytical, communication, and documentation skills with a leadership mindset.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Leadership role in architecting business-critical digital platforms.</li>\n<li>Exposure to cutting-edge technologies and innovation-driven teams.</li>\n<li>Competitive compensation and benefits package.</li>\n<li>Opportunities for continuous learning and certifications.</li>\n<li>A dynamic and flexible work environment.</li>\n</ul>\n<p><strong>Other Info Requested:</strong> Notice period, CTC, and Expected CTC.</p>\n<p><strong>Contact Information:</strong></p>\n<p>Spericorn Technology (P) Ltd\nAmstor Building,\nTechnopark Phase I,\nTrivandrum, 695581\nhttp://www.spericorn.com\nContact Email: careers@spericorn.com</p>\n<p><strong>Note:</strong> Kindly mention in the email subject \"Application for the post of Senior Software Architect.\"</p>\n<p>Closing Date: 31, July 2025\nJob Published: 12, July 2025</p>",
        "tags": [
            "7+ Years",
            "AWS",
            "Microservices",
            "Kafka"
        ],
        "summary": "Spericorn Technology is looking for a Senior Software Architect to lead the technical direction of scalable and secure systems. The candidate will drive architectural decisions and provide technical leadership."
    },
    {
        "job_title": "Tele caller",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/21764",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Telecaller Walk-In Interview</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong>\nSBC 22, -2, Thejaswini Building, Technopark, Thiruvananthapuram, 695581\n<a href=\"https://www.upcommune.net\">https://www.upcommune.net</a></p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> 14th July 2025 - 16th July 2025\n*   <strong>Time:</strong> 11:01 AM to 3:00 PM\n*   <strong>Published Date:</strong> 12th July 2025</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Make outbound calls to customers.</li>\n<li>Promote products and services using a prepared script.</li>\n<li>Answer customer inquiries and address concerns.</li>\n<li>Achieve sales targets and report on call activities.</li>\n<li>Maintain accurate records of customer interactions.</li>\n<li><strong>Only for Female candidates.</strong></li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Plus two or equivalent.</li>\n<li>Excellent verbal communication skills.</li>\n<li>Strong customer service and sales skills.</li>\n<li>Ability to handle rejection and stay positive.</li>\n<li>Experience in telecalling or sales is a plus.</li>\n</ul>\n<p><strong>Walk-In Venue:</strong>\nUpCommune Business Network Pvt Ltd\nForth Floor, Gayatri Building, Technopark, Thiruvananthapuram, 695581</p>\n<p><strong>Contact Information:</strong>\n*   <strong>Email:</strong> mail@upcommune.net\n*   <strong>Gate Pass Contact:</strong> +91 9074882688</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are required to apply for the entry pass to Technopark Campus to attend the Walk-In interview through mobile app/web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\n*   <a href=\"link\">Click here to download the Mobile App for Android</a>\n*   <a href=\"link\">Click here to download the Mobile App for iOS</a></p>\n<p><strong>Website URL:</strong>\n<a href=\"vms.technopark.org\">vms.technopark.org</a>\n<a href=\"link\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>",
        "tags": [
            "Entry Level",
            "Telecalling",
            "Verbal Communication",
            "Customer Service"
        ],
        "summary": "Upcommune Business Network is hiring female Telecallers for outbound calls and customer service. Walk-in interviews are from July 14-16 at Technopark, Thiruvananthapuram."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/21763",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Business Development Executive - Walk-In Interview</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong> is seeking a talented Business Development Executive to join our dynamic Sales and Marketing team.</p>\n<p><strong>Walk-In Details:</strong>\n- <strong>Date:</strong> July 14, 2025 - July 16, 2025\n- <strong>Time:</strong> 11:00 AM - 3:01 PM\n- <strong>Location:</strong> Upcommune Business Network Pvt Ltd, Forth Floor, Gayatri Building, Technopark - 695582, TVM</p>\n<p><strong>Brief Description:</strong>\nThe ideal candidate should possess a robust background in sales, conversion, and digital marketing strategies. This role is pivotal in identifying new business opportunities, converting leads into clients, and devising effective marketing strategies to foster business growth.</p>\n<p><strong>Responsibilities:</strong>\n- Identify and pursue new business opportunities through networking, cold calling, and other lead generation techniques.\n- Develop and maintain strong relationships with prospective clients and key stakeholders.\n- Collaborate with the marketing team to create compelling campaigns that align with client needs and drive revenue.\n- Analyze market trends and competitor activities to ensure the company remains competitive in the marketplace.\n- Prepare and deliver pitches and presentations to potential clients, showcasing the company's products/services and value proposition.</p>\n<p><strong>Preferred Skills:</strong>\n- Proven experience in sales and business development, preferably in a related industry.\n- Ability to work independently and as part of a team, with a proactive approach to problem-solving.\n- Degree/ Diploma in Marketing, or a related field is preferred.</p>\n<p><strong>Benefits:</strong>\n- Opportunity to work in a dynamic and innovative environment.\n- Competitive salary and performance-based incentives.\n- Career growth opportunities within the company.</p>\n<p><strong>How to Apply:</strong>\nPlease send your resume and a cover letter detailing your relevant experience to Mail@upcommune.net or call +91 9074882688.</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.\nCandidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<ul>\n<li><strong>Mobile App for Android:</strong> <a href=\"Mobile AppClick here to download the Mobile App for Android\">Click here to download</a></li>\n<li><strong>Mobile App for iOS:</strong> <a href=\"Mobile AppClick here to download the Mobile App for iOS\">Click here to download</a></li>\n<li><strong>Website URL:</strong> <a href=\"vms.technopark.org\">vms.technopark.org</a></li>\n<li><a href=\"vms.technopark.org\">Click here for the User Manual</a></li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Information:</strong>\n- <strong>Company:</strong> Upcommune Business Network (P) Ltd\n- <strong>Address:</strong> SBC 22, -2, Thejaswini Building, Technopark, Thiruvananthapuram, 695581\n- <strong>Website:</strong> <a href=\"https://www.upcommune.net\">https://www.upcommune.net</a>\n- <strong>Contact Email:</strong> mail@upcommune.net</p>",
        "tags": [
            "1+ Years",
            "Sales",
            "Business Development",
            "Digital Marketing"
        ],
        "summary": "Upcommune Business Network is hiring a Business Development Executive to identify opportunities, convert leads, and create marketing strategies. The role requires sales experience and offers career growth."
    },
    {
        "job_title": "FRESHER DEVELOPER(PHP)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21762",
        "location": "Technopark",
        "closing_date": "26 Aug 2025",
        "job_description": "<h2>Fresher Developer (PHP)</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building\nTechnopark Phase 1, 695581\nhttps://shmsolutions.in</p>\n<p><strong>Closing Date:</strong> 26, Aug 2025\n<strong>Job Published:</strong> 12, July 2025\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are looking for a Fresher Developer to join our dynamic team. This position is perfect for a graduate with a strong desire to learn and grow in the field.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to the continuous improvement of our codebase.</li>\n<li>Troubleshoot and debug issues as they arise.</li>\n<li>Work closely with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in programming with a strong grasp of core concepts.</li>\n<li>Problem-Solving Skills: Ability to analyze and solve programming problems.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<h3>Qualification</h3>\n<ul>\n<li>Bachelor's degree in Computer Science or related field.</li>\n</ul>\n<p><strong>Experience:</strong> 0-1 years of experience</p>\n<p><strong>Salary Package:</strong> 2.5 LPA - 4 LPA</p>",
        "tags": [
            "0-1 Years",
            "PHP",
            "Software Development",
            "Problem-solving"
        ],
        "summary": "Looking for a Fresher Developer to join our dynamic team. This role involves assisting in software development, troubleshooting, and staying updated with industry trends."
    },
    {
        "job_title": "FRESHER DEVELOPER",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21761",
        "location": "Technopark",
        "closing_date": "26 Aug 2025",
        "job_description": "<h2>Fresher Developer</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building\nTechnopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<p><strong>Closing Date:</strong> 26, Aug 2025\n<strong>Job Published:</strong> 12, July 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<p><strong>Brief Description:</strong>\nSubject Line: FRESHER PHP DEVELOPER</p>\n<p>We are looking for a Fresher Developer to join our dynamic team. This position is perfect for a graduate who is passionate with a strong desire to learn and grow in the field.</p>\n<p><strong>Job Responsibilities:</strong></p>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to the continuous improvement of our codebase.</li>\n<li>Troubleshoot and debug issues as they arise.</li>\n<li>Work closely with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proficiency in programming with a strong grasp of core concepts.</li>\n<li>Problem-Solving Skills: Ability to analyze and solve programming problems.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Qualification:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science or related field.</li>\n<li>Experience: 0-1 years of experience</li>\n<li>Salary Package: 2.5 LPA - 4 LPA</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Programming",
            "Problem-Solving",
            "Software Development"
        ],
        "summary": "Looking for a fresher developer to join our dynamic team. This role involves assisting in software development and troubleshooting, requiring proficiency in programming and problem-solving."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21760",
        "location": "Technopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\n<a href=\"http://www.trainonexsolutions.in/\">www.trainonexsolutions.in</a></p>\n<p><strong>Closing Date:</strong> 14, July 2025\n<strong>Job Published:</strong> 12, July 2025\n<strong>Contact Email:</strong> <a href=\"mailto:trainonexsolutions.hr@gmail.com\">trainonexsolutions.hr@gmail.com</a></p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing with sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li><strong>Experience:</strong> 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Have fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Communication",
            "Customer Interaction"
        ],
        "summary": "Join Trainonex Solutions as a Telesales Executive. Drive company growth through phone sales and customer relationship management, with fluency in Malayalam preferred."
    }
]