[
    {
        "job_title": "Senior QA Engineer (4+ Year’s)",
        "company": "Empay Software Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21391/251",
        "location": "Infopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<p><strong>Senior QA Engineer (4+ Year’s)</strong></p>\n<p>We are seeking an experienced <strong>Senior QA Engineer</strong> with expertise in <strong>Manual Testing</strong>. The role involves ensuring product quality through comprehensive testing, defect management, and collaboration with development and product teams to deliver high-quality releases.</p>\n<p><strong>Key Responsibilities</strong>\n- Review business requirements and functional specifications for clarity and testability.\n- Create and maintain QA documentation (test plans, test cases, scenarios).\n- Execute manual testing for web applications, including functional, integration, and regression testing.\n- Conduct API testing and basic database validation for accuracy and consistency.\n- Validate fixes and ensure deliverables meet quality standards during release cycles.\n- Identify, document, and track defects using defect-tracking tools; follow up with development teams.\n- Collaborate with cross-functional teams to resolve issues and streamline release processes.\n- Organize test data, results, and documentation.\n- Provide mentorship to junior QA team members as needed.</p>\n<p><strong>Required Skills &amp; Qualifications</strong>\n- Bachelor’s degree in Computer Science, IT, or related field.\n- <strong>4+ years</strong> of hands-on software testing experience.\n- Strong knowledge of SDLC, STLC, and defect lifecycle processes.\n- Proficiency in manual testing methodologies and best practices.\n- Experience with API testing and backend validation.\n- Familiarity with test management and defect-tracking tools.\n- Analytical thinking, communication skills, and attention to detail.\n- Automation tool exposure is a plus.</p>\n<p><strong>Contact</strong>\nInterested candidates should email their resume to <strong>hr@empaysoft.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "Manual Testing",
            "API Testing",
            "Defect Tracking Tools"
        ],
        "summary": "Senior QA Engineer required for manual testing, API validation, and defect management. Collaborate with development teams to ensure high-quality software releases."
    },
    {
        "job_title": "Java Team Lead (5+ years of experience in Java, with at least 2+years of experience in lead role)",
        "company": "Empay Software Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21392/251",
        "location": "Infopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<p><strong>Java Team Lead</strong></p>\n<p><strong>Location:</strong> Infopark, Kochi\n<strong>Work Mode:</strong> Work From Office (Mandatory)</p>\n<p><strong>About the Role</strong>\nWe are seeking a highly skilled and motivated Java Team Lead to join our growing technology team. The ideal candidate will have strong expertise in Java-based application development and proven experience leading development teams. If you have hands-on experience in microservices, cloud platforms, and modern frameworks, we’d like to meet you.</p>\n<p><strong>Key Responsibilities</strong>\n- Design, develop, test, and deliver high-quality software based on functional and technical requirements.\n- Review code, perform debugging, and ensure adherence to best coding practices.\n- Lead and mentor a team of Java developers, providing technical guidance and performance feedback.\n- Participate actively across all stages of the Software Development Life Cycle (SDLC).\n- Collaborate with cross-functional teams to define technical solutions and resolve project challenges.\n- Ensure timely delivery of project modules while maintaining code quality and performance standards.\n- Prepare and maintain technical documentation as needed.</p>\n<p><strong>Required Skills &amp; Experience</strong>\n- Minimum 5+ years of Java development experience.\n- At least 2+ years in a team lead or senior developer role.\n- Strong expertise in:\n  - Core Java, OOPS Concepts\n  - Spring MVC, Spring Boot, Spring Security\n  - JPA, Hibernate\n  - RESTful APIs, Microservices\n  - HTML/JSP and React (good to have)\n  - Eclipse/IntelliJ IDE\n- Strong knowledge of SQL Server or Oracle databases.\n- Solid understanding of SDLC methodologies (Agile/Scrum preferred).\n- Experience working with cloud platforms (AWS, Azure, or Google Cloud).\n- Experience in Banking, EFT, or Card Payment domains is an added advantage.\n- Bachelor’s/Master’s degree in Computer Science, Engineering, or related field.</p>\n<p><strong>Contact Information</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@empaysoft.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "Microservices"
        ],
        "summary": "Lead Java development teams with 5+ years of Java experience and 2+ years in a lead role. Requires expertise in Spring Boot, microservices, and cloud platforms."
    },
    {
        "job_title": "IT Business Analyst (4+ Year’s)",
        "company": "Empay Software Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21393/251",
        "location": "Infopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>IT Business Analyst (4+ Years)</h2>\n<p>We are seeking a highly motivated and detail-oriented <strong>IT Business Analyst</strong> to join our dynamic team.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Collaborate with stakeholders to gather, analyze, and prioritize business requirements.</li>\n<li>Perform gap analysis to align current business processes with desired outcomes based on business value and impact.</li>\n<li>Translate business requirements into detailed functional specifications, user stories, and acceptance criteria.</li>\n<li>Create clear and comprehensive documentation, including process flows, BRDs, FRDs, use cases, and data models.</li>\n<li>Work closely with development and QA teams to ensure requirements are accurately implemented.</li>\n<li>Participate in system testing and UAT, including creating test cases and validating system functionality.</li>\n<li>Coordinate with Project Managers to plan and execute project delivery and solution implementations.</li>\n<li>Assist in change management and provide user training/documentation for implemented solutions.</li>\n<li>Stay updated with industry trends and best practices to recommend process and system improvements.</li>\n</ul>\n<h3>Qualifications &amp; Requirements</h3>\n<ul>\n<li><strong>Educational Background</strong>: B.Tech, MCA, BCA, M.Sc/B.Sc in Computer Science or related field.</li>\n<li><strong>Experience</strong>: Minimum 2+ years as a Business Analyst in IT/software development environment.</li>\n<li>Prior experience in software project development or testing (minimum 2 years).</li>\n<li>Hands-on experience in client communication and requirement gathering.</li>\n<li>Excellent analytical, problem-solving, and documentation skills.</li>\n<li>Strong verbal and written communication skills.</li>\n<li>Domain knowledge in <strong>Banking / EFT / Card Payments</strong> is an added advantage.</li>\n<li>Must be willing to work full-time from the office (Infopark Kochi).</li>\n</ul>\n<h3>Work Mode</h3>\n<ul>\n<li><strong>Location</strong>: Infopark, Kochi</li>\n<li><strong>Work Mode</strong>: Work From Office (Mandatory)</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@empaysoft.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "Business Analysis",
            "Software Development",
            "Banking/EFT/Card Payments"
        ],
        "summary": "Seeking an IT Business Analyst with 4+ years of experience to collaborate with stakeholders, translate requirements into specifications, and ensure project delivery in a dynamic office environment."
    },
    {
        "job_title": "Java Backend Developer",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/21389/401",
        "location": "Infopark",
        "closing_date": "19 Jan 2026",
        "job_description": "<p><strong>Job Title:</strong> Java Backend Developer\n<strong>Location:</strong> Kochi Infopark\n<strong>Experience:</strong> 5-10 Years</p>\n<p><strong>Job Summary:</strong>\nWe are seeking an experienced Java Backend Developer to join our dynamic development team. In this role, you will be responsible for designing, developing, and maintaining high-performance backend services using Java and the Spring Framework.</p>\n<p><strong>Requirements:</strong>\n- Bachelor’s degree in Computer Science, Engineering, or a related field.\n- Proficiency in Java programming and the Spring Framework.\n- Experience with RESTful services, SQL databases, and microservices architecture.\n- Strong understanding of version control systems like Git.\n- Experience with unit testing and test-driven development.\n- Excellent problem-solving skills and attention to detail.</p>\n<p><strong>Responsibilities:</strong>\n- Design, develop, and maintain backend services and APIs using Java and Spring.\n- Collaborate with front-end developers and other team members to integrate user-facing elements with server-side logic.\n- Implement and maintain microservices architectures that are scalable, reliable, and efficient.\n- Optimize application performance, focusing on speed and scalability.\n- Write clean, maintainable, and testable code, following best practices for software development.\n- Participate in code reviews to maintain code quality and share knowledge with the team.\n- Troubleshoot and resolve issues in a timely manner, ensuring the stability and reliability of the backend systems.\n- Stay up-to-date with the latest industry trends and technologies to continuously improve our systems.</p>\n<p><strong>Soft Skills:</strong>\n- <strong>Problem-Solving:</strong> Ability to analyze complex problems and develop effective solutions.\n- <strong>Analytical Thinking:</strong> Strong analytical skills to evaluate system performance and identify areas for improvement.\n- <strong>Communication Skills:</strong> Ability to clearly communicate technical concepts to both technical and non-technical stakeholders.\n- <strong>Attention to Detail:</strong> Meticulous approach to coding and system design, ensuring high quality and performance.\n- <strong>Time Management:</strong> Capable of managing multiple tasks and deadlines in a fast-paced environment.</p>\n<p><strong>Hard Skills:</strong>\n- <strong>Java Programming:</strong> Expert-level knowledge in Java and its application in backend development.\n- <strong>Spring Framework:</strong> Proficient in Spring Boot.\n- <strong>RESTful Services:</strong> Skilled in designing and implementing robust RESTful APIs.\n- <strong>SQL:</strong> Proficient in SQL and relational database management.\n- <strong>Microservices:</strong> Experience with microservices, including deployment, scaling, and monitoring.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>jobs@pearlsofttechnologies.com</strong>.</p>",
        "tags": [
            "5-10 Years",
            "Java",
            "Spring Framework",
            "RESTful Services"
        ],
        "summary": "Java Backend Developer designs and maintains high-performance backend services using Java and Spring, collaborating with teams to ensure scalable, reliable systems."
    },
    {
        "job_title": "Shopify & WordPress Developer(2-3 Years Experience)",
        "company": "9Commerce Technologies",
        "url": "https://infopark.in/company-jobs/details/21390/261",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Shopify &amp; WordPress Developer</h2>\n<p><strong>Location:</strong> Infopark, Kochi\n<strong>Employment Type:</strong> Full-time (Work From Office)</p>\n<p>We are seeking a skilled and motivated <strong>Shopify &amp; WordPress Developer</strong> with <strong>2–3 years of hands-on experience</strong> to join our growing team. The ideal candidate will develop, customize, and maintain high-quality eCommerce and corporate websites using Shopify and WordPress platforms. You will collaborate with designers, project managers, and clients to deliver scalable, secure, and performance-optimized web solutions.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Shopify Development</strong>\n- Develop, customize, and maintain Shopify stores, themes, and templates\n- Customize Shopify themes using Liquid, HTML, CSS, and JavaScript\n- Integrate third-party apps and develop custom Shopify apps when required\n- Implement custom features, checkout flows, and product configurations\n- Optimize Shopify stores for performance, security, and scalability\n- Ensure mobile responsiveness and cross-browser compatibility</p>\n<p><strong>WordPress Development</strong>\n- Develop and maintain WordPress websites, including custom themes and plugins\n- Customize existing WordPress themes and plugins based on project requirements\n- Build websites using popular page builders (Elementor, WPBakery, Gutenberg, etc.)\n- Integrate APIs, payment gateways, forms, and third-party services\n- Ensure WordPress best practices for security, speed, and SEO</p>\n<p><strong>General Development &amp; Maintenance</strong>\n- Convert UI/UX designs (Figma, Adobe XD, PSD) into functional websites\n- Debug issues, fix bugs, and provide ongoing website support and maintenance\n- Perform website migrations, upgrades, and backups\n- Follow coding standards and version control practices (Git)\n- Collaborate with cross-functional teams to meet project timelines</p>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>2–3 years of proven experience in Shopify and WordPress development</li>\n<li>Strong knowledge of HTML5, CSS3, JavaScript, jQuery</li>\n<li>Hands-on experience with Shopify Liquid templating language</li>\n<li>Strong understanding of WordPress architecture, hooks, and custom post types</li>\n<li>Experience with WooCommerce customization and configuration</li>\n<li>Familiarity with REST APIs and third-party integrations</li>\n<li>Knowledge of website performance optimization and SEO best practices</li>\n<li>Experience with hosting environments, cPanel, and server basics</li>\n<li>Good understanding of responsive design and cross-browser compatibility</li>\n</ul>\n<h3>Preferred / Good-to-Have Skills</h3>\n<ul>\n<li>Experience in custom Shopify app development</li>\n<li>Knowledge of PHP frameworks or MVC concepts</li>\n<li>Familiarity with headless CMS or Shopify Hydrogen (a plus)</li>\n<li>Experience with payment gateways, shipping integrations, and taxes</li>\n<li>Exposure to Agile/Scrum development methodologies</li>\n<li>Basic knowledge of UI/UX principles</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates should submit their resume and a cover letter to <strong>hr@commerce9.io</strong> with the subject line <strong>\"Shopify &amp; WordPress Developer Application\"</strong>. Include the following details in the email:\n- Total Years of Exp:\n- Relevant Exp:\n- Current CTC:\n- Expected CTC:\n- Highest Qualification (Full time only):\n- Notice Period:</p>",
        "tags": [
            "2-3 Years",
            "Shopify",
            "WordPress",
            "Liquid"
        ],
        "summary": "Seeking a Shopify & WordPress Developer with 2–3 years of experience to build and maintain high-quality eCommerce and corporate websites. Responsibilities include customizing themes, integrating APIs, and collaborating with teams to ensure performance and scalability."
    },
    {
        "job_title": "Internship Opportunity (Unpaid – 6 to 12 Months)",
        "company": "Indian Institute Of Information Technology And Management - Kerala (Iiitm-K)",
        "url": "https://technopark.org/job-details/26148",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Indian Institute of Information Technology and Management - Kerala (IIITM-K)</h2>\n<p><strong>IIITM-K Campus</strong>\nTechnopark, Karyavattom PO\nThiruvananthapuram, 695581\n<a href=\"http://www.iiitmk.ac.in\">Visit Website</a></p>\n<h3>Internship Opportunity (Unpaid – 6 to 12 Months)</h3>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 20, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:jobs@iiitmk.ac.in\">jobs@iiitmk.ac.in</a></p>\n<h3>Overview</h3>\n<p>Indian Institute of Information Technology and Management – Kerala (IIITM-K), on behalf of Atal Grand Challenge and ESDM Maker Village, invites applications for an <strong>unpaid internship</strong> in <strong>VLSI, Electronics, and System Design</strong>. This 6–12 month program offers hands-on exposure to cutting-edge research, product development, and innovation ecosystems in electronics and IT, fostering entrepreneurship and advanced technical skills.</p>\n<h3>How to Apply</h3>\n<ul>\n<li>Submit applications via <a href=\"https://forms.gle/9HCx4dmdzcqV1jsr5\">Google Form</a>. </li>\n<li>Download application details from <a href=\"http://www.iiitmk.ac.in/careers\">www.iiitmk.ac.in/careers</a>. </li>\n<li>Bring original certificates/testimonials for the interview. </li>\n<li>Interview dates will be communicated via mobile/email. </li>\n<li>Applications are processed regularly as per project needs.</li>\n</ul>\n<h3>Internship Duration</h3>\n<ul>\n<li><strong>6–12 Months</strong></li>\n<li><strong>Unpaid</strong></li>\n<li><strong>Full-time / Part-time</strong> (as per project requirements and mutual agreement)</li>\n</ul>\n<h3>Areas of Work</h3>\n<p>Interns may engage in one or more of the following:\n- VLSI Design and Verification\n- Analog and Digital Electronics\n- Embedded Systems and System Design\n- Semiconductor Devices and ESDM Technologies\n- FPGA/ASIC Design Flows\n- Hardware–Software Co-design\n- Research, Prototyping, and Proof-of-Concept Development</p>\n<h3>Eligibility / Qualifications</h3>\n<p>Applicants must possess or be pursuing:\n- <strong>B.Sc / B.Tech</strong>\n- <strong>M.Sc / M.Tech</strong>\n- <strong>Ph.D.</strong> (Completed or Ongoing)</p>\n<h3>Desired Skills</h3>\n<ul>\n<li>Fundamental knowledge of electronics and system-level design</li>\n<li>Familiarity with VLSI tools, simulation software, or embedded platforms (preferred)</li>\n<li>Interest in research, innovation, and technology development</li>\n<li>Ability to work independently and collaboratively in a research environment</li>\n</ul>\n<h3>Learning Outcomes</h3>\n<ul>\n<li>Exposure to real-world R&amp;D and innovation-driven projects</li>\n<li>Collaboration with experienced researchers, engineers, and startups</li>\n<li>Hands-on experience in advanced electronics and system design</li>\n<li><strong>Certificate of Internship</strong> upon successful completion</li>\n</ul>\n<h3>Important Notes</h3>\n<ul>\n<li>This internship is <strong>unpaid</strong> and intended for academic/research purposes.</li>\n<li><strong>No accommodation or stipend</strong> will be provided.</li>\n<li>Interns must adhere to institute policies and project confidentiality norms.</li>\n</ul>",
        "tags": [
            "Fresh Graduates",
            "VLSI Design",
            "Embedded Systems",
            "FPGA/ASIC Design"
        ],
        "summary": "Unpaid 6–12 month internship at IIITM-K in VLSI, Electronics, and System Design, offering hands-on R&D and innovation experience with certificate upon completion."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26147",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd\n<strong>Location:</strong> Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a>\n<strong>Closing Date:</strong> 22, Dec 2025\n<strong>Published Date:</strong> 20, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:trainonexsolutions.hr@gmail.com\">trainonexsolutions.hr@gmail.com</a>\n<strong>Subject Line:</strong> \"Telesales Executive\"</p>\n<h3>Role Overview</h3>\n<p>We are seeking an energetic and confident <strong>Telesales Executive</strong> to join our team. In this role, you will make outbound calls, promote products/services, and close sales to drive business growth. This is an excellent opportunity for freshers or those looking to build a career in sales.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Make outbound calls to potential and existing customers</li>\n<li>Promote products/services in a simple and friendly manner</li>\n<li>Explain features, pricing, and benefits clearly</li>\n<li>Handle customer queries and provide accurate information</li>\n<li>Follow up on leads and maintain customer details</li>\n<li>Build and maintain strong customer relationships</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> 0-1 years (freshers welcome)</li>\n<li><strong>Gender:</strong> Male and female candidates preferred</li>\n<li><strong>Language:</strong> Fluency in Malayalam</li>\n<li><strong>Work Location:</strong> Work from office</li>\n<li><strong>Immediate Joiners Required</strong></li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li><strong>Basic Pay:</strong> ₹14,000</li>\n<li><strong>Performance-Based Incentives:</strong> Earn additional rewards for your achievements</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>💰 Performance-Based Incentives</li>\n<li>🎉 Fun Fridays (team games, themed dress days)</li>\n<li>🎈 Special Occasion Celebrations</li>\n<li>🤝 Supportive Team Environment</li>\n<li>📈 Career Development Opportunities</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Confident and friendly telephone manner</li>\n<li>Ability to handle rejections and stay motivated</li>\n<li>Strong customer interaction skills</li>\n<li>Excellent communication and time management</li>\n</ul>\n<p><strong>Apply now</strong> by emailing your resume to <a href=\"mailto:trainonexsolutions.hr@gmail.com\">trainonexsolutions.hr@gmail.com</a> with the subject line \"Telesales Executive\".</p>",
        "tags": [
            "0-1 Years",
            "Communication",
            "Customer Interaction",
            "Malayalam Language"
        ],
        "summary": "Telesales Executive role for 0-1 year freshers. Promote products via calls, handle queries, and build customer relationships with performance-based incentives."
    },
    {
        "job_title": "BUSINESS DEVELOPMENT EXECUTIVE (DIGITAL MARKETING)",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26146",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<p><strong>Trainonex Solutions (P) Ltd</strong></p>\n<p><strong>Location:</strong> Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a>\n<strong>Closing Date:</strong> 22, Dec 2025\n<strong>Published Date:</strong> 20, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:trainonexsolutions.hr@gmail.com\">trainonexsolutions.hr@gmail.com</a></p>\n<h3>Job Title</h3>\n<p><strong>Business Development Executive (Digital Marketing)</strong></p>\n<h3>Brief Description</h3>\n<p>We are seeking a smart, energetic, and motivated <strong>Business Development Executive</strong> to expand our digital marketing services. Your role involves connecting with businesses, understanding their needs, and offering tailored digital marketing solutions.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Identify and contact potential clients (shops, businesses, vendors)</li>\n<li>Conduct market research to analyze trends, competitors, and customer needs</li>\n<li>Build and maintain strong client relationships</li>\n<li>Follow up regularly to close deals</li>\n<li>Maintain client records and update reports</li>\n<li>Develop lead generation strategies and implement them</li>\n<li>Attend industry events and conferences for networking</li>\n<li>Prepare and present business proposals to clients</li>\n<li>Collaborate with marketing, sales, and product teams to align business goals</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Excellent communication and negotiation skills</li>\n<li>Ability to persuade and close sales</li>\n<li>Strong interpersonal and problem-solving skills</li>\n<li>Proficiency in working independently and meeting targets</li>\n<li>Friendly and professional attitude</li>\n<li>Capability to build long-term client relationships</li>\n<li>Basic computer and internet skills</li>\n<li>Quick learner with adaptability</li>\n<li>Self-motivated and positive attitude</li>\n</ul>\n<p><strong>Note:</strong> Female and male candidates are preferred. <strong>Basic Pay:</strong> ₹14,000. <strong>Experience Required:</strong> 0-2 years. <strong>Subject Line for Applications:</strong> \"Business Development Executive (Digital Marketing)\".</p>",
        "tags": [
            "0-2 Years",
            "Digital Marketing",
            "Business Development",
            "Sales"
        ],
        "summary": "Grow digital marketing services by acquiring clients, analyzing market trends, and generating leads. Requires strong sales and relationship-building skills."
    },
    {
        "job_title": "Senior Python developer (Malaysia)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26145",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong></p>\n<p><strong>Location</strong>: Malaysia\n<strong>Contact</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>\n<strong>Application Deadline</strong>: 26 Dec 2025\n<strong>Published</strong>: 19 Dec 2025</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Senior Python–Django Developer</strong> to design, develop, and maintain scalable web applications and backend services. The role demands deep expertise in Python, Django, REST APIs, and CI/CD pipelines using GitLab, alongside strong software engineering and DevOps collaboration skills.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain high-performance Django applications</li>\n<li>Build and optimize RESTful APIs using Django REST Framework</li>\n<li>Ensure application scalability, security, and performance</li>\n<li>Implement best practices for modular, maintainable, and testable code</li>\n<li>Design, implement, and maintain CI/CD pipelines using GitLab</li>\n<li>Automate build, test, and deployment processes</li>\n<li>Use GitLab for source control, merge requests, and branching strategies</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills</strong>:\n- 7+ years of experience in Python development\n- Strong expertise in Django &amp; Django REST Framework\n- Solid understanding of REST APIs, JSON, and HTTP protocols\n- Hands-on experience with GitLab CI/CD pipelines\n- Proficiency with Git version control\n- Strong SQL skills (PostgreSQL / MySQL)\n- Experience with unit testing and test automation</p>\n<p><strong>Secondary Skills</strong>:\n- Experience with Docker / Kubernetes\n- Knowledge of Celery, Redis, RabbitMQ\n- Exposure to AWS / Azure / GCP\n- Familiarity with microservices architecture\n- Experience with performance tuning and security best practices</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details. <strong>Important Note</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are conducted via the official website, LinkedIn, or the HR email ID. For clarifications, contact <strong>careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "7+ Years",
            "Django",
            "Python",
            "GitLab CI/CD"
        ],
        "summary": "Senior Python Developer with Django expertise to build scalable web apps and manage CI/CD pipelines using GitLab."
    },
    {
        "job_title": "GIS Lead (Onshore - Qatar)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26144",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong></p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a>\n<strong>Job Title:</strong> GIS Lead (Onshore - Qatar)\n<strong>Closing Date:</strong> 26, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h2>Introduction</h2>\n<p>We are seeking a highly skilled <strong>GIS Lead</strong> to own the end-to-end geospatial technology landscape for a large, mission-critical national emergency response ecosystem. The platform relies heavily on real-time geospatial processing, advanced ArcGIS capabilities, AVL (Automatic Vehicle Location), routing algorithms, incident mapping, 2D/3D visualization, spatial analytics, and complex multi-agency geodata integrations.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li><strong>GIS Architecture &amp; Modernization:</strong></li>\n<li>Define and implement the GIS modernization roadmap, including upgrades to ArcGIS Enterprise, Server, Portal, and related components.</li>\n<li>Architect and implement 2D and 3D GIS capabilities, including building models, terrain, line-of-sight analysis, and situational visualization.</li>\n<li>Lead the design of real-time GIS services, including streaming layers, geo-event processing, location tracking, and dynamic incident updates.</li>\n<li>\n<p>Oversee containerization or virtualization strategies for GIS components within the broader platform modernization framework.</p>\n</li>\n<li>\n<p><strong>Geospatial Data &amp; Services Management:</strong></p>\n</li>\n<li>Own the design and optimization of geodatabases, spatial indexing, caching strategies, versioning, and partitioning.</li>\n<li>Ensure high-quality management of base maps, operational layers, network datasets, hazard maps, cadastral data, and public infrastructure layers.</li>\n<li>\n<p>Lead the migration and transformation of existing GIS layers, widgets, and tools into the new environment.</p>\n</li>\n<li>\n<p><strong>Integration &amp; Interoperability:</strong></p>\n</li>\n<li>Oversee all GIS integrations with emergency call-taking, dispatch, incident management, crime analytics, CCTV systems, vehicle tracking systems, mobile data terminals, and external government platforms.</li>\n<li>Collaborate with the integration team on APIs, map services, feature services, caching services, and geoprocessing services.</li>\n<li>\n<p>Support microservices teams in consuming GIS services efficiently and securely.</p>\n</li>\n<li>\n<p><strong>Performance, Monitoring &amp; Reliability:</strong></p>\n</li>\n<li>Define and enforce performance benchmarks for map rendering times, geoprocessing workloads, routing calculations, and data loading.</li>\n<li>Lead the implementation of GIS monitoring tools, dashboards, and alerting mechanisms.</li>\n<li>\n<p>Work with infrastructure teams to optimize GIS performance across multiple data centers, ensuring high availability and zero-downtime operations.</p>\n</li>\n<li>\n<p><strong>GIS Development &amp; Customization:</strong></p>\n</li>\n<li>Guide development of custom GIS widgets, map tools, dashboards, and web/mobile experiences using ArcGIS API for JS, Experience Builder, Web AppBuilder, or custom frameworks.</li>\n<li>Review and optimize routing algorithms (Network Analyst) and AVL integrations.</li>\n<li>\n<p>Oversee implementation of spatial analytics and predictive geospatial intelligence solutions.</p>\n</li>\n<li>\n<p><strong>Stakeholder Collaboration &amp; Leadership:</strong></p>\n</li>\n<li>Collaborate with call takers, dispatch operators, supervisors, field agents, GIS operators, and leadership to understand daily workflows and pain points.</li>\n<li>Convert operational requirements into geospatial solutions aligned with modernization and efficiency goals.</li>\n<li>\n<p>Provide technical leadership and mentoring to GIS developers, analysts, and data engineers.</p>\n</li>\n<li>\n<p><strong>Quality Assurance &amp; Governance:</strong></p>\n</li>\n<li>Ensure compliance with data governance, security policies, and national confidentiality standards.</li>\n<li>Conduct GIS solution reviews, performance audits, and readiness assessments.</li>\n<li>Define and maintain documentation, standards, and SOPs for all GIS components.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Must-Have</h3>\n<ul>\n<li><strong>8–12+ years of experience</strong> in GIS architecture, implementation, and management.</li>\n<li>Deep expertise in <strong>Esri ArcGIS Enterprise</strong>, including:</li>\n<li>ArcGIS Server</li>\n<li>Portal for ArcGIS</li>\n<li>ArcGIS Pro</li>\n<li>ArcGIS GeoEvent / GeoAnalytics</li>\n<li>ArcGIS Network Analyst</li>\n<li>Strong experience with spatial databases (e.g., Enterprise Geodatabases, Oracle 19G).</li>\n<li>Hands-on experience with <strong>real-time GIS</strong>, vehicle tracking, routing, and operational command center mapping.</li>\n<li>Strong understanding of <strong>2D/3D visualization</strong>, geospatial modeling, and spatial analysis tools.</li>\n<li>Experience integrating GIS with large-scale enterprise systems.</li>\n<li>Ability to lead technical teams and engage directly with senior business stakeholders.</li>\n</ul>\n<h3>Preferred</h3>\n<ul>\n<li>Experience in emergency response, public safety, defense, or national security systems.</li>\n<li>Experience with containerized GIS deployments (Kubernetes / OpenShift).</li>\n<li>Familiarity with Python (ArcPy), JavaScript (ArcGIS API for JS), and microservices-based GIS consumption.</li>\n<li>Knowledge of Middle Eastern geography and operations is a plus.</li>\n<li>Arabic language skills preferred.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment-related mails are sent through the official HR email id. Please contact <a href=\"mailto:careers@reflectionsinfos.com\">careers@reflectionsinfos.com</a> for any clarification/alerts on this subject.</p>",
        "tags": [
            "8–12+ Years",
            "ArcGIS Enterprise",
            "Real-Time GIS",
            "Spatial Data Modeling"
        ],
        "summary": "Lead GIS architecture for a national emergency response system, requiring expertise in ArcGIS Enterprise and real-time geospatial solutions."
    },
    {
        "job_title": "QA Engineer (Automation+Manual)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26143",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<p><strong>QA Engineer (Automation + Manual)</strong>\n<strong>Closing Date:</strong> 26, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>4+ years experienced QA Engineer</strong> with <strong>strong expertise in Playwright automation</strong>, <strong>XRAY test management</strong>, and <strong>manual testing</strong>. The ideal candidate will ensure product quality through structured test planning, robust automation coverage, and detailed manual validation across web applications.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain automation test scripts using <strong>Playwright (TypeScript/JavaScript)</strong>.</li>\n<li>Build reusable automation frameworks and ensure high test coverage across modules.</li>\n<li>Create and manage test cases, test plans, and test cycles in <strong>XRAY</strong> integrated with <strong>Jira</strong>.</li>\n<li>Execute functional, regression, smoke, UI, API, and end-to-end tests as required.</li>\n<li>Perform manual testing for new features, edge cases, and areas not covered by automation.</li>\n<li>Collaborate in sprint ceremonies with developers, product owners, and DevOps teams.</li>\n<li>Identify defects, perform root-cause analysis, and track resolution through <strong>Jira/XRAY</strong> workflows.</li>\n<li>Integrate automation scripts with <strong>CI/CD pipelines</strong> (GitLab, Jenkins, Azure DevOps).</li>\n<li>Provide clear reporting on test results, automation metrics, and product quality.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong>\n- <strong>4+ Years</strong> of hands-on QA experience\n- <strong>Playwright</strong> for UI automation (TypeScript/JS)\n- <strong>XRAY</strong> for test management within Jira\n- <strong>Agile/Scrum</strong> QA methodologies\n- API validation using <strong>Playwright APIs</strong> or <strong>Postman</strong>\n- Strong analytical, debugging, and documentation skills\n- Ability to work in fast-paced sprints with attention to detail</p>\n<p><strong>Secondary Skills:</strong>\n- Performance testing tools (optional)\n- Cloud-based testing, containerisation, or microservices\n- <strong>Git</strong> and CI/CD best practices</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details. <strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are via official website or LinkedIn. For clarifications, contact <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "Playwright",
            "XRAY",
            "Jira"
        ],
        "summary": "QA Engineer with 4+ years of experience in Playwright automation, XRAY test management, and manual testing. Requires expertise in CI/CD integration and Agile/Scrum methodologies."
    },
    {
        "job_title": "VMware Senior Consultant",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26142",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published Date</strong>: 19, Dec 2025\n<strong>Contact</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>VMware Senior Consultant</strong> with <strong>6+ years of experience</strong> to design, deploy, and optimize VMware Cloud Foundation (VCF) solutions.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li><strong>Solution Design &amp; Architecture</strong>: Analyze customer requirements to create scalable, secure VCF architectures, including management and workload domains.</li>\n<li><strong>Deployment &amp; Configuration</strong>: Lead full VCF stack deployment (vSphere, vSAN, NSX, Aria Suite).</li>\n<li><strong>Consulting &amp; Advising</strong>: Guide clients on best practices, IT transformation, and operational strategies.</li>\n<li><strong>Troubleshooting &amp; Support</strong>: Provide expert-level (L3/L4) support for compute, storage, and networking issues.</li>\n<li><strong>Documentation &amp; Knowledge Transfer</strong>: Develop technical documentation and conduct workshops for client teams.</li>\n<li><strong>Lifecycle Management</strong>: Execute upgrades, patches, and lifecycle activities using SDDC Manager.</li>\n<li><strong>Integration</strong>: Integrate VCF with third-party tools (backup, monitoring, security, automation).</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills</strong>:\n- Extensive hands-on experience with <strong>VMware Cloud Foundation</strong> (vSphere, vSAN, NSX-T, Aria Suite).\n- Strong understanding of virtualization, networking (L2/L3), storage, and public cloud integrations (AWS, Azure).\n- Automation expertise with Ansible, Terraform, or PowerShell.\n- Certifications: VCP-VCF Architect, VCAP, or VCDX.\n- Excellent client communication, problem-solving, and leadership skills.\n- Willingness to travel for client engagements.</p>\n<p><strong>Secondary Skills</strong>:\n- API automation tools (Cypress, Postman, REST).\n- Kusto Query Language (KQL) or Azure Log Analytics.\n- Docker/Kubernetes environments.\n- Python scripting or AI-driven testing concepts.</p>\n<h3>Application Process</h3>\n<p>Interested candidates should email <strong>Careers@reflectionsinfos.com</strong> with resumes, notice period, and CTC details. <strong>Important</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are via official channels. Report suspicious activity to <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "6+ Years",
            "VMware Cloud Foundation",
            "vSphere",
            "NSX-T"
        ],
        "summary": "Senior VMware consultant designs and deploys VCF solutions, advises clients on best practices, and integrates cloud technologies with 6+ years of experience in virtualization and automation."
    },
    {
        "job_title": "Sitecore .NET Architect (Optimizely)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26141",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Sitecore .NET Architect (Optimizely)</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published Date</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Introduction</h3>\n<p>We are seeking <strong>8+ years experienced</strong> candidates for this role.</p>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>8+ years</strong> in eCommerce or enterprise web platforms.</li>\n<li>Experience with <strong>Optimizely CMS/Commerce</strong> or strong <strong>.NET commerce</strong> background (Sitecore XC, Umbraco, custom .NET).</li>\n<li>Strong understanding of <strong>catalog, pricing, promotions, cart, checkout, and order flows</strong>.</li>\n<li>Proficiency in <strong>.NET Core, C#, APIs</strong>, and <strong>cloud-native architectures</strong>.</li>\n<li>Experience with <strong>system integrations</strong> and <strong>data migration</strong>.</li>\n<li>Strong <strong>communication</strong> and <strong>leadership skills</strong>.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience in <strong>SAP Commerce (Hybris)</strong>.</li>\n<li><strong>Optimizely certifications</strong> (CMS/Commerce) or willingness to pursue them.</li>\n<li>Experience with <strong>Sitecore XC</strong> or other enterprise commerce frameworks.</li>\n<li>Understanding of modern frontend architectures (<strong>React, Next.js, Vue</strong>).</li>\n</ul>\n<h3>Who Should Apply</h3>\n<ul>\n<li><strong>Optimizely experts</strong> seeking leadership roles.</li>\n<li><strong>Sitecore XC/.NET commerce architects</strong> transitioning to Optimizely.</li>\n<li>eCommerce professionals with architecture experience leading full-scale migrations.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Forward detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does <strong>not</strong> charge fees for job applications. All communications are via official website, LinkedIn, or HR email. Contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> for clarifications.</p>",
        "tags": [
            "8+ Years",
            "Optimizely CMS/Commerce",
            ".NET Core",
            "C#"
        ],
        "summary": "Lead eCommerce architecture with 8+ years in Optimizely/.NET commerce, focusing on migrations and cloud-native solutions."
    },
    {
        "job_title": "Site Reliability Engineer (SRE)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26140",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong></p>\n<p><strong>Address</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Job Title</strong>: Site Reliability Engineer (SRE)\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published Date</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Implement and maintain observability and monitoring solutions using <strong>New Relic</strong> and <strong>Grafana</strong>.</li>\n<li>Ensure application and infrastructure reliability by applying core SRE principles (availability, performance, scalability, incident management).</li>\n<li>Manage and optimize <strong>Kubernetes</strong> clusters, containerized workloads, and <strong>Helm</strong> deployments.</li>\n<li>Automate infrastructure provisioning and configuration using <strong>Terraform</strong>.</li>\n<li>Build, maintain, and optimize CI/CD pipelines using <strong>Jenkins</strong>, <strong>ArgoCD</strong>, and <strong>GitHub Actions</strong>.</li>\n<li>Collaborate with development and operations teams to implement best practices for deployment, monitoring, and incident response.</li>\n<li>Continuously improve reliability through automation, capacity planning, and performance tuning.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills</strong>:\n- <strong>AWS</strong>: Core services (EC2, S3, RDS, IAM, VPC, EKS, CloudWatch) and best practices for scalability and security.\n- <strong>Terraform</strong>: Infrastructure automation, module creation, and state management.\n- <strong>New Relic</strong>: Application performance monitoring, custom dashboard creation, and alert configuration.\n- <strong>Grafana</strong>: Metrics visualization, dashboard setup, and alerting mechanisms.\n- <strong>SRE Concepts</strong>: Reliability engineering, incident management, capacity planning, SLIs/SLOs/SLAs, error budget management.</p>\n<p><strong>Intermediate Proficiency In</strong>:\n- <strong>EKS, Docker, Kubernetes, Helm</strong>: Cluster operations, container orchestration, and deployment automation.\n- <strong>Jenkins, ArgoCD, GitHub Workflows</strong>: CI/CD, GitOps workflows, and automated deployment pipelines.</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates should forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are conducted via the official website, LinkedIn, or the HR email ID. Report any suspicious activity to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "2+ Years",
            "Kubernetes",
            "Terraform",
            "AWS"
        ],
        "summary": "A Site Reliability Engineer role requiring 2+ years of experience in ensuring application and infrastructure reliability through SRE principles, Kubernetes, and cloud automation tools like AWS and Terraform."
    },
    {
        "job_title": "Backend Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26139",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India - 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role</strong>: Backend Developer\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published On</strong>: 19, Dec 2025\n<strong>Contact</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h2>Introduction</h2>\n<p>We are seeking <strong>8+ years</strong> experienced candidates for this role.</p>\n<h2>Job Description</h2>\n<p>We are looking for an experienced <strong>Backend Developer</strong> to implement and integrate backend services, including <strong>data migration, API development, and system integrations</strong>, while ensuring high performance and reliability. The developer will collaborate with <strong>solution architects, business analysts, and QA teams</strong> to deliver secure, scalable, and seamless migration.</p>\n<h3>Responsibilities</h3>\n<p><strong>Development &amp; Integration</strong>\n- Build and maintain backend services using <strong>.NET Core</strong> and <strong>ASP.NET Web API</strong>.\n- Implement data migration scripts for products, pricing, and customer hierarchies.\n- Ensure API security and compliance with enterprise standards.</p>\n<p><strong>Performance &amp; Scalability</strong>\n- Optimize backend services for high performance and scalability.\n- Implement caching strategies (e.g., <strong>Redis</strong>) to improve response times.\n- Monitor and troubleshoot performance bottlenecks.</p>\n<p><strong>Collaboration</strong>\n- Work with <strong>Solution Architects</strong> to align with migration frameworks.\n- Collaborate with <strong>Business Analysts</strong> to translate requirements into technical tasks.\n- Support <strong>QA teams</strong> during integration and performance testing.</p>\n<p><strong>DevOps &amp; Deployment</strong>\n- Participate in CI/CD pipeline setup using <strong>Azure DevOps</strong> or <strong>GitHub Actions</strong>.\n- Ensure <strong>Docker</strong> containerization readiness and cloud deployment compatibility.</p>\n<h2>Preferred Skills</h2>\n<h3>Primary Skills</h3>\n<ul>\n<li><strong>Data Extraction</strong>: BAPIs, RFCs, IDocs</li>\n<li><strong>.NET Core / C#</strong></li>\n<li><strong>API Development</strong></li>\n<li><strong>SQL / Entity Framework</strong></li>\n<li><strong>Unit &amp; Integration Testing</strong>: NUnit, xUnit, MSTest</li>\n<li><strong>Azure Cloud Expertise</strong>: Logic Apps, API Management, Service Bus, Functions, Key Vault, DevOps (CI/CD)</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li><strong>Middleware Tools</strong>: Azure Logic Apps, MuleSoft, Boomi</li>\n<li><strong>ETL Tools</strong>: SAP BODS, Talend, or custom scripts</li>\n<li><strong>CI/CD Pipelines</strong>: Azure DevOps, GitHub Actions, Jenkins</li>\n<li><strong>Security &amp; Compliance</strong>: GDPR, secure data handling</li>\n<li><strong>Performance Testing</strong>: JMeter, LoadRunner</li>\n<li><strong>SAP Activate Methodology</strong>: Agile-based project delivery</li>\n<li><strong>Documentation &amp; Change Management</strong>: Migration logs, stakeholder communication</li>\n<li><strong>Spire &amp; PIM Integration</strong>: Ecommerce platform integration experience</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates should send their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does <strong>not</strong> charge any fees for job applications. All communications are via official website, LinkedIn, or the HR email. Report any suspicious activity to <strong>careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "8+ Years",
            ".NET Core / C#",
            "API Development",
            "Azure Cloud Expertise"
        ],
        "summary": "Seeking a Backend Developer with 8+ years of experience in .NET Core, API development, and Azure cloud to build scalable systems and collaborate across teams."
    },
    {
        "job_title": "Business Analyst (Qatar – Onshore)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26138",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Reflections Info Systems (P) Ltd</h2>\n<p><strong>Location</strong>: Qatar (Onshore)\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Job Published</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are seeking an experienced <strong>Business Analyst</strong> with strong analytical, communication, and stakeholder-management skills to join our team in Qatar. The ideal candidate will have <strong>8–10 years of professional experience</strong>, a strong understanding of business processes, and proven expertise working with clients across the Middle East region. <strong>Fluency in Arabic</strong> and a <strong>valid Qatar Resident Permit/Qatar ID (QID)</strong> are mandatory.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Engage with business users, clients, and stakeholders to gather, analyze, and document business requirements.</li>\n<li>Translate business needs into detailed functional specifications and user stories.</li>\n<li>Drive requirement workshops, meetings, interviews, and business process reviews.</li>\n<li>Analyze existing workflows and propose process improvements, optimization opportunities, and automation strategies.</li>\n<li>Support solution design by working closely with technical, product, and development teams.</li>\n<li>Conduct impact assessments, feasibility studies, and gap analyses for new initiatives.</li>\n<li>Support project planning, testing (SIT/UAT), and deployment activities.</li>\n<li>Create documentation including BRDs, FRDs, process flows, user manuals, and test cases.</li>\n<li>Ensure alignment between business objectives and project deliverables.</li>\n<li>Maintain effective communication with key stakeholders across multiple departments.</li>\n<li>Provide ongoing analytical support for enhancements, change requests, and issue resolution.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Mandatory</strong>:\n- <strong>8–10 years</strong> of experience as a Business Analyst in a structured business or technology environment.\n- Valid Qatar ID / Resident Permit.\n- Fluency in Arabic (spoken and written).\n- Experience working with Middle East (GCC) clients, preferably Qatar.\n- Strong understanding of business analysis frameworks, methodologies, and tools (e.g., <strong>BPMN</strong>, <strong>UML</strong>, <strong>Agile</strong>, <strong>Scrum</strong>, <strong>Waterfall</strong>).\n- Proven experience conducting requirement sessions and managing diverse stakeholder groups.\n- Ability to develop clear documentation, business cases, and analytical reports.\n- Strong problem-solving, critical-thinking, and decision-making abilities.\n- Excellent communication, presentation, and interpersonal skills.\n- Experience with digital transformation, technology projects, or enterprise systems is preferred.</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does <strong>not</strong> charge any fees for job applications. Fraudsters may falsely promise jobs for a fee. We only contact candidates through our official website or LinkedIn, and all employment-related emails are sent from <strong>Careers@reflectionsinfos.com</strong>. Contact this email for any clarification or alerts.</p>",
        "tags": [
            "8–10 Years",
            "Business Analysis",
            "Arabic Language",
            "Qatar Residency"
        ],
        "summary": "Seeking a Business Analyst with 8–10 years of experience, fluent in Arabic, and holding a valid Qatar residency to analyze business processes and drive digital transformation in Qatar."
    },
    {
        "job_title": "Delivery Manager (Qatar – Onshore )",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26137",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2><strong>Company Information</strong></h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India - 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2><strong>Job Title</strong></h2>\n<p><strong>Delivery Manager (Qatar – Onshore)</strong></p>\n<h2><strong>Key Details</strong></h2>\n<ul>\n<li><strong>Closing Date</strong>: 26, Dec 2025</li>\n<li><strong>Published Date</strong>: 19, Dec 2025</li>\n<li><strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></li>\n</ul>\n<h2><strong>Job Overview</strong></h2>\n<p>Our work involves:\n- Developing applications offshore and testing at client sites with SMEs.\n- Collaborating with clients to negotiate change requests and coordinate production infrastructure readiness.\n- Managing stakeholder relationships, escalations, and senior leadership communication.\n- Implementing new applications at client sites with significant coordination with SMEs for requirements, environment setup, and feature validation.</p>\n<h2><strong>Preferred Skills</strong></h2>\n<ul>\n<li><strong>Delivery Manager (DM)</strong>: Experience working with client senior leadership, understanding application development/implementation.</li>\n<li><strong>Project Manager (PM - Development)</strong>: Exposure to application development and implementation.</li>\n<li><strong>Project Manager (PM - Infrastructure)</strong>: Expertise in setting up virtual machines and connectivity for application deployment.</li>\n</ul>\n<h2><strong>Additional Requirements</strong></h2>\n<ul>\n<li><strong>Languages</strong>: Fluent in Arabic (client prefers Arabic communication).</li>\n<li><strong>Geographic Experience</strong>: Proven experience with Middle East clients, particularly ministries.</li>\n<li><strong>Visa</strong>: Must hold a Resident Permit or Qatar ID.</li>\n</ul>\n<h2><strong>Application Process</strong></h2>\n<p>Interested candidates should email their resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details.</p>\n<h2><strong>Important Notice</strong></h2>\n<ul>\n<li><strong>Fraud Alert</strong>: No payment is required for jobs at Reflections. All communications are via official website, LinkedIn, or the HR email above. Contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> for verification.</li>\n</ul>",
        "tags": [
            "Not Specified",
            "Application Development",
            "Stakeholder Management",
            "Virtual Machines"
        ],
        "summary": "Delivery Manager in Qatar requires client leadership experience, application development/infrastructure expertise, Arabic fluency, and Middle East client experience."
    },
    {
        "job_title": "Senior Database Administrator",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26136",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Senior Database Administrator</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Closing Date:</strong> 26, Dec 2025\n<strong>Published Date:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Introduction</h3>\n<p>We are seeking candidates with <strong>8+ years</strong> of experience for this role.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Optimize database queries for fast, efficient data retrieval, especially for complex/high-volume operations.</li>\n<li>Design and implement indexing strategies to reduce query execution times and improve performance.</li>\n<li>Monitor and profile slow queries, recommending best practices for rewriting or re-architecting.</li>\n<li>Analyze SQL query execution plans to identify bottlenecks and optimize them.</li>\n<li>Schedule and execute database maintenance tasks (backups, consistency checks, index rebuilding).</li>\n<li>Implement automated monitoring systems to track performance, availability, and parameters like CPU, memory, disk I/O, and replication status.</li>\n<li>Proactively diagnose and resolve database issues (locking, deadlocks, data corruption) before impacting users.</li>\n<li>Implement high-availability solutions (e.g., SQL Server Always On, Oracle RAC, MySQL Group Replication) for disaster recovery.</li>\n<li>Monitor resource consumption and plan for scalability with increasing data volume/transaction load.</li>\n<li>Optimize resource usage (CPU, memory, disk, network) to reduce operational costs.</li>\n<li>Ensure compliance with database licensing models and identify cost-reduction opportunities.</li>\n<li>Use cloud cost analysis tools (AWS Cost Explorer, Azure Cost Management) to optimize cloud database spending.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong>\n- <strong>7+ years</strong> of Microsoft SQL Server administration experience.</p>\n<p><strong>Behavioral Competencies:</strong>\n- Communication\n- Teamwork\n- Digital Mindset\n- Operational Excellence\n- Analytical Ability\n- Customer Centricity\n- Business and Market Acumen\n- Empathy\n- Growth Mindset</p>\n<h3>Certifications</h3>\n<ul>\n<li>Bachelor's degree in computer science, software engineering, or related field.</li>\n<li>Microsoft SQL certifications (MTA Database, MCSA: SQL Server, MCSE: Data Management and Analytics) are advantageous.</li>\n</ul>\n<h3>Application Process</h3>\n<p>Interested candidates should email their resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details. <strong>Note:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are via official website, LinkedIn, or the HR email ID. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "8+ Years",
            "Microsoft SQL Server",
            "Oracle RAC",
            "AWS Cost Explorer"
        ],
        "summary": "Senior Database Administrator role requiring 8+ years of Microsoft SQL Server experience, focusing on query optimization, high availability, and cloud cost management."
    },
    {
        "job_title": "Senior Java Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26135",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong></p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<p><strong>Senior Java Architect</strong>\n<strong>Closing Date:</strong> 26, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025</p>\n<h3>Introduction</h3>\n<p>We are seeking <strong>10+ years</strong> experienced candidates for this role.</p>\n<h3>Job Description</h3>\n<p>The Senior Java Architect is responsible for designing, developing, and overseeing the architecture of <strong>enterprise-level Java applications</strong>. This role ensures systems are <strong>scalable, high-performing, and secure</strong> by leveraging modern Java frameworks and best practices. The Java Architect will collaborate with cross-functional teams to integrate technologies like <strong>messaging, caching, databases, API gateways, security infrastructures, workflow engines, and deployment mechanisms</strong> into cohesive solutions while guiding developers in implementing robust, maintainable code.</p>\n<h3>Core Responsibilities</h3>\n<ul>\n<li>Define the overall architecture for Java-based applications, including <strong>microservices, APIs, and integration patterns</strong> to meet business requirements.</li>\n<li>Select and govern Java frameworks (e.g., <strong>Spring Boot, Spring Security, Hibernate/JPA</strong>) to ensure consistency and quality.</li>\n<li>Lead end-to-end modernization of mission-critical on-premises platforms with <strong>near-zero data loss</strong> and <strong>minimal downtime</strong>.</li>\n<li>Design solutions that align with existing systems, support phased rollouts across data centers, meet <strong>SLAs</strong>, and integrate with monitoring tools.</li>\n<li>Collaborate with Database and Infrastructure teams for <strong>Oracle Database (OLTP)</strong> and <strong>Redis (caching)</strong> integration in containerized environments.</li>\n<li>Establish coding standards, conduct code reviews, and mentor teams on <strong>secure coding, error handling, and logging</strong>.</li>\n</ul>\n<h3>Technical Skills</h3>\n<ul>\n<li><strong>Expert-level Java proficiency</strong> (Java SE/EE, recent versions) and ecosystem knowledge.</li>\n<li><strong>Spring Boot</strong> for microservices, <strong>Spring Security</strong> for authentication, <strong>Hibernate/JPA</strong> for ORM.</li>\n<li>Hands-on experience with <strong>microservices architectures</strong>, <strong>RESTful APIs</strong>, and <strong>OpenAPI/Swagger</strong> documentation.</li>\n<li>Strong understanding of <strong>Oracle databases</strong> and <strong>SQL</strong>.</li>\n<li>Expertise in <strong>API security</strong> (OAuth2, OpenID Connect, JWT).</li>\n</ul>\n<h3>Experience and Soft Skills</h3>\n<ul>\n<li><strong>10+ years</strong> in software development, <strong>2–3 years</strong> in a Java architect role.</li>\n<li>Proven track record in <strong>large-scale, distributed systems</strong> and <strong>enterprise applications</strong>.</li>\n<li>Leadership in guiding teams, conducting design reviews, and enforcing architectural governance.</li>\n<li>Excellent communication skills for explaining technical concepts and producing <strong>architectural documentation</strong>.</li>\n</ul>\n<h3>Should Have</h3>\n<ul>\n<li>Design integration solutions using <strong>Apache Kafka</strong> for event streaming and <strong>IBM API Connect</strong> for API management.</li>\n<li>Collaborate with DevOps on <strong>CI/CD pipelines</strong> (Azure DevOps/Jenkins), <strong>Docker</strong>, and <strong>Kubernetes/OpenShift</strong>.</li>\n<li>Monitor and troubleshoot architectures using <strong>APM tools</strong> (e.g., Dynatrace) and <strong>Elastic Stack/ELK</strong>.</li>\n</ul>\n<h3>Secondary Skills (Nice to Have)</h3>\n<ul>\n<li>Exposure to <strong>NoSQL/multi-model databases</strong>.</li>\n<li>Experience with <strong>reactive frameworks</strong> or <strong>newer JDK features</strong>.</li>\n<li>Broader knowledge of <strong>API gateways</strong>, <strong>logging stacks</strong>, and <strong>APM tools</strong>.</li>\n</ul>\n<h3>Application Process</h3>\n<p>Interested candidates should email <strong>Careers@reflectionsinfos.com</strong> with resumes, notice period, and CTC details. <strong>Warning:</strong> Reflections does <strong>not</strong> charge fees for jobs. All communications are via official channels. Report suspicious activity to <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "10+ Years",
            "Java",
            "Spring Boot",
            "Microservices"
        ],
        "summary": "Senior Java Architect with 10+ years experience designing scalable enterprise applications, leading modernization projects, and mentoring teams in secure, high-performance Java solutions."
    },
    {
        "job_title": "Senior Front-End Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26134",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2><strong>Senior Front-End Architect</strong></h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Job Published</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking candidates with <strong>10+ years</strong> of experience for this role.</p>\n<h3><strong>Job Description</strong></h3>\n<p>The Front-End Architect will define and guide the user interface architecture for large-scale, mission-critical web applications. Responsibilities include:\n- Defining front-end architecture standards, framework selection, and integration with backend APIs/real-time services.\n- Modernizing legacy applications (e.g., Adobe Flex) into modern SPAs using Angular or React.\n- Designing reusable UI components and layout systems for complex data-rich screens (grids, dashboards, maps).\n- Collaborating with backend, GIS, and DevOps teams to ensure seamless API and mapping integrations.\n- Ensuring security practices (authentication, input validation, XSS/CSRF protection).\n- Establishing coding standards, conducting code reviews, and mentoring development teams.</p>\n<h3><strong>Preferred Skills</strong></h3>\n<p><strong>MUST HAVE</strong>:\n- Expert-level JavaScript/TypeScript and browser fundamentals (DOM, rendering, performance profiling).\n- Hands-on experience with Angular or React (SPA frameworks) and their ecosystems.\n- Large-scale front-end application architecture (component-based design, state management).\n- Legacy UI modernization strategies (e.g., Flex to SPA migration).\n- RESTful API and real-time communication (WebSockets, SignalR) integration.\n- Front-end build tools (Webpack, Vite, npm/yarn) and testing frameworks.\n- Cross-browser compatibility and responsive design.\n- 10+ years front-end/full-stack development, 3-4 years in a lead/architect role.</p>\n<p><strong>SHOULD HAVE</strong>:\n- CI/CD pipeline experience for front-end deployments.\n- UX collaboration to balance design and technical feasibility.\n- Front-end performance optimization (bundle analysis, lazy loading).\n- GIS/mapping library integration (ESRI JavaScript API).\n- Accessibility standards (WCAG, ARIA, semantic HTML).</p>\n<p><strong>NICE TO HAVE</strong>:\n- Experience with Vue/Svelte or micro-frontend architectures.\n- Design systems (Material, Bootstrap) and Storybook.\n- Analytics tools (application insights, web analytics).</p>\n<h3><strong>Application Process</strong></h3>\n<p>Interested candidates should email their resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details. <strong>Note</strong>: Reflections does not charge fees for job applications. All communications are via official channels.</p>",
        "tags": [
            "10+ Years",
            "Angular",
            "React",
            "TypeScript"
        ],
        "summary": "Senior Front-End Architect with 10+ years experience leading UI architecture, modernizing legacy applications, and collaborating with cross-functional teams to deliver secure, high-performance web solutions."
    },
    {
        "job_title": "Software Developer (PHP)",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26133",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>About Us</h2>\n<p>Founded over a decade ago, <strong>Lean Transition Solutions Ltd (LTS)</strong> is an ISO 9001:2015 certified company headquartered in the United Kingdom. We specialize in delivering <strong>Lean Industry 4.0 software solutions</strong> and <strong>Leadership 4.0 solutions</strong> to global clients, including Fortune 500 companies. With offices in India, Germany, Poland, the United States, UAE, Jordan, and Mexico, we address industrial and manufacturing challenges through innovative, bespoke software. Our core values include <strong>Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy</strong>.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a <strong>Software Developer (PHP)</strong> to join our team. In this role, you will:\n- Lead the design, development, and maintenance of software systems.\n- Write well-structured, testable, and efficient code using best practices.\n- Troubleshoot performance issues and resolve architectural challenges.\n- Integrate data from back-end services and databases.\n- Maintain, expand, and scale applications.\n- Collaborate with cross-functional teams to deliver high-quality solutions.\n- Mentor junior engineers and ensure coding standards.\n- Participate in code reviews.\n- Deploy applications in cloud environments (AWS, Azure).\n- Stay updated on PHP frameworks and industry trends.</p>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>1-2 years</strong> of web application programming experience.</li>\n<li>Strong proficiency in <strong>PHP</strong> and web-based application development.</li>\n<li>In-depth knowledge of <strong>MySQL</strong> and <strong>Object-Oriented Programming (OOP)</strong>.</li>\n<li>Experience with <strong>PHP frameworks</strong> (CodeIgniter, Laravel, Symfony).</li>\n<li>Proficiency in <strong>HTML5, CSS, JavaScript</strong>.</li>\n<li>Familiarity with front-end frameworks like <strong>Angular</strong> or <strong>React</strong>.</li>\n<li>Strong problem-solving and debugging skills.</li>\n<li>Solid understanding of <strong>Agile/Scrum</strong> methodologies.</li>\n<li>Excellent relational database skills.</li>\n<li>Strong logical thinking and attention to detail.</li>\n<li>Ability to work independently and in teams.</li>\n</ul>\n<h2>Application Details</h2>\n<p><strong>Contact Email</strong>: <a href=\"mailto:careers@ltslean.com\">careers@ltslean.com</a>\n<strong>Subject Line</strong>: \"Software Developer (PHP)\"\n<strong>Include in Email</strong>: Current CTC, Expected CTC, Notice Period, Current Location, Total Relevant Experience, Willingness to work at office.</p>\n<p><strong>Address</strong>: Lean Transition Solutions, Periyar Building, Technopark Phase 1, Trivandrum, 695581\n<strong>Closing Date</strong>: 22 Dec 2025\n<strong>Job Published</strong>: 19 Dec 2025</p>",
        "tags": [
            "1-2 Years",
            "PHP",
            "MySQL",
            "Laravel"
        ],
        "summary": "Seeking a Software Developer (PHP) with 1-2 years experience to design and develop web applications using PHP, MySQL, and Laravel, collaborating with cross-functional teams to deliver innovative solutions."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26132",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>About Us</h2>\n<p><strong>Lean Transition Solutions Ltd (LTS)</strong>, founded over a decade ago and headquartered in the United Kingdom, is an ISO 9001:2015 certified company specializing in <strong>Lean Industry 4.0 software solutions</strong> and <strong>Leadership 4.0 solutions</strong>. We serve global clients, including Fortune 500 organizations, across India, Germany, Poland, the United States, UAE, Jordan, and Mexico. Our mission is to address industrial and manufacturing challenges through innovative, bespoke software solutions.</p>\n<p><strong>Core Values</strong>: Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<p><strong>Address</strong>: Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Website</strong>: <a href=\"http://www.LeanTransitionSolutions.com\">www.LeanTransitionSolutions.com</a></p>\n<h2>About the Role</h2>\n<p>We are seeking an experienced <strong>Odoo Developer</strong> with <strong>3+ years of hands-on experience</strong> in Odoo development and customization. The ideal candidate will collaborate with cross-functional teams to deliver scalable, secure, and high-quality Odoo solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop, customize, and maintain Odoo modules to meet client-specific needs.</li>\n<li>Modify and extend core Odoo functionalities for unique business processes.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Troubleshoot and resolve issues in existing applications.</li>\n<li>Collaborate with project managers, designers, and QA teams to deliver solutions.</li>\n<li>Support data migration, cleansing, and validation.</li>\n<li>Ensure security compliance and contribute to DevOps pipelines/infrastructure automation.</li>\n<li>Document technical designs, configurations, and customizations.</li>\n<li>Advise on Odoo lifecycle management best practices.</li>\n<li>Optimize system performance and scalability.</li>\n<li>Participate in code reviews and knowledge-sharing.</li>\n<li>Stay updated on Odoo development trends and industry practices.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>3+ years</strong> of hands-on experience with Odoo ERP (Enterprise preferred).</li>\n<li>Strong knowledge of Odoo ORM, module architecture, and security framework.</li>\n<li>Proficiency in <strong>Python</strong> and <strong>PostgreSQL</strong>.</li>\n<li>Experience deploying Odoo on cloud/on-premise environments.</li>\n<li>Familiarity with <strong>Docker</strong>, <strong>Kubernetes</strong>, and cloud platforms (AWS/Azure).</li>\n<li>Agile development experience.</li>\n<li>Excellent problem-solving skills and clear communication.</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Exposure to agentic AI, RPA, or AI-driven automation.</li>\n<li>Experience with CI/CD pipelines.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their <strong>detailed resume</strong> to <strong>careers@ltslean.com</strong> with the subject line <strong>“Odoo Developer”</strong>. Include the following in the email body:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at the office</p>\n<p><strong>Closing Date</strong>: 22, Dec 2025\n<strong>Job Published</strong>: 19, Dec 2025</p>",
        "tags": [
            "3+ Years",
            "Odoo ERP",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Seeking an Odoo Developer with 3+ years of experience in Python, PostgreSQL, and Odoo framework to customize modules and collaborate with teams for scalable solutions."
    },
    {
        "job_title": "Odoo Developer (1-Year Contract)",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26131",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>Company Overview</h2>\n<p>Lean Transition Solutions Ltd (LTS), an ISO 9001:2015 certified company, specializes in Lean Industry 4.0 software solutions for global organizations, including Fortune 500 clients. With headquarters in the UK and operations in India, Germany, Poland, the US, UAE, Jordan, and Mexico, LTS delivers bespoke software to address industrial and manufacturing challenges.</p>\n<h2>Job Details</h2>\n<p><strong>Position</strong>: Odoo Developer (1-Year Contract)\n<strong>Location</strong>: Periyar Building, Technopark Phase 1, Trivandrum, 695581\n<strong>Closing Date</strong>: 22, Dec 2025\n<strong>Contact</strong>: careers@ltslean.com</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop, customize, deploy, and maintain Odoo modules to meet client-specific requirements</li>\n<li>Modify core Odoo functionalities for complex business processes</li>\n<li>Write clean, well-documented code and resolve application issues</li>\n<li>Collaborate with project managers, designers, and QA teams</li>\n<li>Support data migration, cleansing, and validation</li>\n<li>Ensure security, performance, and scalability standards</li>\n<li>Contribute to DevOps pipelines and infrastructure automation</li>\n<li>Document technical designs and customizations</li>\n<li>Provide mentorship on Odoo best practices</li>\n<li>Enhance system performance and scalability</li>\n<li>Participate in code reviews and knowledge-sharing</li>\n<li>Stay updated on Odoo advancements and industry practices</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>5+ years</strong> of hands-on Odoo ERP (Enterprise preferred) experience</li>\n<li>Strong knowledge of Odoo ORM, module architecture, and security framework</li>\n<li>Proficiency in <strong>Python</strong> and <strong>PostgreSQL</strong></li>\n<li>Proven experience in cloud/on-premise Odoo deployments</li>\n<li>Familiarity with <strong>Docker</strong>, <strong>Kubernetes</strong>, <strong>AWS</strong>, or <strong>Azure</strong></li>\n<li>Agile development environment experience</li>\n<li>Excellent problem-solving and communication skills</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Exposure to agentic AI, RPA, or AI-driven automation</li>\n<li>Experience with CI/CD pipelines</li>\n</ul>\n<h3>Contract Details</h3>\n<ul>\n<li><strong>Duration</strong>: 1 Year</li>\n</ul>\n<p><strong>Application Instructions</strong>: Email careers@ltslean.com with subject \"Odoo Developer – Contract\" and include:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at office</p>",
        "tags": [
            "5+ Years",
            "Odoo ERP",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Seeking an experienced Odoo Developer with 5+ years to customize and maintain Odoo modules using Python and PostgreSQL for a 1-year contract. Requires expertise in deployment, cloud platforms, and agile environments."
    },
    {
        "job_title": "Graphic Designer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26130",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>Who We Are</h2>\n<p>Founded over a decade ago, <strong>Lean Transition Solutions Ltd (LTS)</strong> is an ISO 9001:2015 certified company headquartered in the UK. We specialize in <strong>Lean Industry 4.0 software solutions</strong> and <strong>Leadership 4.0 solutions</strong> for global clients, including Fortune 500 organizations. With offices in India, Germany, Poland, the US, UAE, Jordan, and Mexico, we deliver bespoke software to address industrial and manufacturing challenges across diverse sectors.</p>\n<h2>About the Role</h2>\n<p>We are seeking a <strong>Graphic Designer</strong> with <strong>5+ years of experience</strong> and a passion for <strong>AI-driven design methodologies</strong>. The ideal candidate will leverage advanced AI tools like <strong>Midjourney, DALL·E, Stable Diffusion, Adobe Firefly, Pika Labs</strong>, and similar platforms to produce high-quality visual content. This role requires integrating AI technology with creative design to streamline workflows and deliver compelling assets aligned with project goals.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design captivating visuals for branding, social media, and digital campaigns using AI tools.</li>\n<li>Experiment with AI platforms to generate innovative concepts (static visuals, video animations) through creative prompting.</li>\n<li>Enhance AI-generated assets with minimal manual edits in tools like Photoshop, Illustrator, After Effects, or Figma.</li>\n<li>Collaborate to transform ideas into compelling AI-driven visual stories.</li>\n<li>Stay ahead of AI design trends and adopt new tools/techniques to enhance workflows.</li>\n<li>Deliver designs that meet brand and project goals.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>AI Enthusiasm</strong>: Passionate about AI design tools with a knack for refining AI-generated outputs.</li>\n<li><strong>Creative Mindset</strong>: Strong aesthetics and storytelling to produce impactful AI-driven designs.</li>\n<li><strong>Tool Proficiency</strong>: Skilled in AI platforms (Midjourney, DALL·E, Stable Diffusion, Adobe Firefly, Pika Labs) and familiar with Photoshop/Illustrator/After Effects/Figma for light editing.</li>\n<li><strong>Agility Over Experience</strong>: Eager to master new AI workflows; years of experience are not mandatory.</li>\n<li><strong>Portfolio-Driven</strong>: A portfolio showcasing AI-based work (visuals, videos, branding) is essential.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates should email <strong>careers@ltslean.com</strong> with the subject line <strong>'Graphic Designer'</strong> and include the following in the email body:\n- Current CTC\n- Expected CTC\n- Notice Period\n- Current Location\n- Total Relevant Experience\n- Willingness to work at the office</p>\n<p><strong>Location</strong>: Periyar Building, Technopark, Trivandrum\n<strong>Company Website</strong>: <a href=\"http://www.LeanTransitionSolutions.com\">www.LeanTransitionSolutions.com</a></p>",
        "tags": [
            "5+ Years",
            "Midjourney",
            "DALL·E",
            "Stable Diffusion"
        ],
        "summary": "Seeking a Graphic Designer with 5+ years of experience in AI-driven design tools (Midjourney, DALL·E, Stable Diffusion) to create innovative visual content for branding and campaigns."
    },
    {
        "job_title": "AI Engineer - Fresher",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/26129",
        "location": "Technopark",
        "closing_date": "22 Dec 2025",
        "job_description": "<h2>About Lean Transition Solutions Ltd (LTS)</h2>\n<p>Founded over a decade ago, <strong>Lean Transition Solutions Ltd (LTS)</strong> is an ISO 9001:2015 certified company headquartered in the United Kingdom. LTS specializes in delivering <strong>Lean Industry 4.0 software solutions</strong> and <strong>Leadership 4.0 solutions</strong> to global organizations, including Fortune 500 companies. With operations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico, LTS addresses industrial and manufacturing challenges through bespoke software solutions.</p>\n<h2>Job Location</h2>\n<p>Periyar Building, Technopark, Trivandrum</p>\n<h2>Key Responsibilities</h2>\n<h3>AI Model Development &amp; Implementation</h3>\n<ul>\n<li>Design and implement <strong>RAG (Retrieval Augmented Generation)</strong> architectures for enterprise manufacturing data</li>\n<li>Build and fine-tune <strong>Large Language Models (LLMs)</strong> for domain-specific industrial applications</li>\n<li>Develop <strong>natural language processing pipelines</strong> for query interpretation and response generation</li>\n<li>Implement <strong>embedding models</strong> and <strong>vector databases</strong> for semantic search across operational data</li>\n</ul>\n<h3>Data Engineering &amp; Integration</h3>\n<ul>\n<li>Work with structured data from industrial systems (databases, APIs, real-time feeds)</li>\n<li>Process unstructured data (operational notes, documentation)</li>\n<li>Build data pipelines integrating multiple sources for analysis</li>\n<li>Implement real-time data processing systems for alerts and anomaly detection</li>\n</ul>\n<h3>Intelligent System Development</h3>\n<ul>\n<li>Develop <strong>Q&amp;A functionality</strong> for natural language queries on manufacturing data</li>\n<li>Build automated reporting and briefing systems for operational insights</li>\n<li>Implement <strong>intelligent alerting mechanisms</strong> with threshold-based logic</li>\n<li>Create <strong>recommendation engines</strong> for process improvement and decision support</li>\n</ul>\n<h3>Technical Architecture &amp; Optimization</h3>\n<ul>\n<li>Design scalable <strong>vector database architectures</strong> for production environments</li>\n<li>Implement <strong>security controls</strong>, role-based access, and data scoping</li>\n<li>Build audit trails and logging systems</li>\n<li>Optimize model performance for real-time manufacturing requirements</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Programming &amp; Core Frameworks</h3>\n<ul>\n<li><strong>Python</strong>: Modern development practices, OOP, software design patterns</li>\n<li><strong>Deep Learning Frameworks</strong>: TensorFlow, PyTorch</li>\n<li><strong>ML/Data Libraries</strong>: scikit-learn, NumPy, Pandas</li>\n</ul>\n<h3>AI/ML Specializations</h3>\n<ul>\n<li><strong>RAG Architecture</strong>: Implementation approaches and best practices</li>\n<li><strong>Vector Databases</strong>: Pinecone, Chroma, FAISS</li>\n<li><strong>LLM Fine-tuning</strong>: LoRA, QLoRA, prompt engineering</li>\n<li><strong>NLP &amp; Embeddings</strong>: Semantic search, language model applications</li>\n</ul>\n<h3>Databases &amp; Data Management</h3>\n<ul>\n<li><strong>RDBMS</strong>: MySQL, PostgreSQL, MariaDB</li>\n<li><strong>SQL</strong>: Complex query writing for data extraction/analysis</li>\n<li><strong>Data Integration</strong>: ETL processes, API integration</li>\n</ul>\n<h3>API Development &amp; Integration</h3>\n<ul>\n<li><strong>RESTful API</strong> design and integration</li>\n<li><strong>JSON</strong> data structures and authentication patterns</li>\n<li><strong>Microservices architecture</strong> understanding</li>\n</ul>\n<h3>Cloud &amp; DevOps (Preferred)</h3>\n<ul>\n<li><strong>AWS</strong> services (EC2, S3, Lambda, RDS)</li>\n<li><strong>Docker</strong> containerization</li>\n<li><strong>Git</strong> version control</li>\n<li><strong>MLOps</strong> practices and model deployment</li>\n</ul>\n<h2>Technology Stack</h2>\n<p>Python, SQL, TensorFlow/PyTorch, Hugging Face Transformers, LangChain/LlamaIndex, MariaDB/MySQL/PostgreSQL, Vector Databases, FastAPI/Flask, AWS, Git, Docker</p>\n<h2>Application Details</h2>\n<p><strong>Contact Email</strong>: careers@ltslean.com\n<strong>Subject Line</strong>: AI Engineer - Fresher\n<strong>Closing Date</strong>: 22, Dec 2025\n<strong>Job Published</strong>: 19, Dec 2025</p>",
        "tags": [
            "Fresher",
            "Python",
            "TensorFlow/PyTorch",
            "Vector Databases"
        ],
        "summary": "AI Engineer role at LTS focuses on RAG architectures, LLMs, and data engineering for manufacturing solutions. Requires Python, deep learning frameworks, and vector database expertise."
    },
    {
        "job_title": "Graphic designer with astute qualities in Embroidery designing",
        "company": "Hiworth Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26128",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Company Overview</h2>\n<p>Hiworth Solutions (P) Ltd, located at C-23, Thejaswini Building, Technopark, Trivandrum (695581), is a company with over 15 years of experience in developing PHP and web-based applications for clients in the USA. We are seeking a <strong>Graphic Designer</strong> with expertise in <strong>Embroidery Designing</strong> to join our team.</p>\n<h2>Job Details</h2>\n<ul>\n<li><strong>Closing Date</strong>: 10, Jan 2026</li>\n<li><strong>Published Date</strong>: 19, Dec 2025</li>\n<li><strong>Contact Email</strong>: hr@hiworthsolutions.com</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Designing and developing <strong>Embroidery Designs</strong> for textile items</li>\n<li>Incorporating <strong>Graphic elements</strong> and designs for corporate gift items</li>\n<li>Creating <strong>Logo</strong> and other design works</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Minimum <strong>2 years</strong> of demonstrable design experience</li>\n<li>Working knowledge of <strong>Embroidery designs</strong></li>\n<li>Proficiency in <strong>HTML, CSS (SCSS), Illustrator</strong>, and <strong>Adobe Creative Suite</strong></li>\n<li>Strong understanding of <strong>Graphic Designing</strong></li>\n<li>Graduate with good knowledge in <strong>English</strong></li>\n</ul>\n<h2>Contact</h2>\n<p>For inquiries, reach out to hr@hiworthsolutions.com.</p>",
        "tags": [
            "2+ Years",
            "Embroidery Designing",
            "Adobe Creative Suite",
            "HTML/CSS/SCSS"
        ],
        "summary": "Graphic Designer with embroidery expertise needed to create textile and corporate gift designs. Requires 2+ years of experience and Adobe/HTML skills."
    },
    {
        "job_title": "PROJECT MANAGER TRAINEE (FRESHERS)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26127",
        "location": "Technopark",
        "closing_date": "02 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">Website</a></p>\n<h2>Job Title</h2>\n<p><strong>Project Manager Trainee (FRESHERS)</strong></p>\n<h2>Closing Date</h2>\n<p>02, Feb 2026</p>\n<h2>Job Published</h2>\n<p>19, Dec 2025</p>\n<h2>Contact Email</h2>\n<p><strong>careers@shmsolutions.in</strong></p>\n<h2>Brief Description</h2>\n<p>The Project Manager Trainee is an entry-level role designed to provide hands-on experience in project management and support. Under the guidance of senior team members, the trainee will learn and assist with essential project support functions, including documentation, scheduling, data collection, and stakeholder communication. This role is ideal for individuals looking to build a strong foundation in Project Management and to develop foundational skills in a collaborative, fast-paced environment.</p>\n<h2>Department</h2>\n<p>Project Management</p>\n<h2>Key Responsibilities</h2>\n<h3>1. Administrative Assistance</h3>\n<ul>\n<li>Assist in scheduling project meetings, preparing agendas.</li>\n<li>Help prepare and maintain project documentation, such as schedules, meeting notes, and reports.</li>\n<li>Help draft project communications, such as emails or status updates, for stakeholders.</li>\n<li>Maintain logs for project risks and issues as directed by project managers.</li>\n<li>Document potential risks, issues, and resolutions as part of project risk management.</li>\n<li>Observe and learn how the team monitors and addresses risks to ensure project success.</li>\n</ul>\n<h3>2. Data Collection and Reporting</h3>\n<ul>\n<li>Collect data from various teams to consolidate into reports or status updates.</li>\n<li>Update project trackers and dashboards with guidance from senior team members.</li>\n<li>Assist in creating basic charts or tables to support program reporting needs.</li>\n</ul>\n<h3>3. Project Management Tools and Software</h3>\n<ul>\n<li>Gain experience using project management tools like Jira, Trello, etc.</li>\n<li>Support program updates and tracking in project management software under mentorship.</li>\n<li>Learn basic resource management principles from experienced team members.</li>\n</ul>\n<h3>4. Meeting Participation</h3>\n<ul>\n<li>Attend project meetings to take notes, observe processes, and document action items.</li>\n<li>Prepare meeting agendas and distribute minutes under the supervision of a senior team member.</li>\n<li>Learn about effective meeting practices and team collaboration in a program setting.</li>\n</ul>\n<h3>5. Process Improvement</h3>\n<ul>\n<li>Assist in process improvement initiatives by handling tasks like data entry or documentation.</li>\n<li>Support the standardisation of project processes and practices across teams.</li>\n<li>Learn how senior team members identify and implement improvements in project workflows.</li>\n</ul>\n<h3>6. Additional Supportive Tasks</h3>\n<ul>\n<li>Flexibly assist with other tasks as required to support the project team.</li>\n<li>Engage in training and professional development opportunities for growth in project management.</li>\n<li>Participate in ongoing skill-building to prepare for a career in project management.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Education</strong>: Bachelor’s or Master's degree in any field.</li>\n<li>Open to candidates looking to build a strong foundation for a future career in Project Management.</li>\n<li>Candidates aspiring for Tech roles such as Developers, Testers, Data Analyst need not apply.</li>\n<li><strong>Skills</strong>: Strong organisational skills, intellectual skills, attention to detail, written skills, and effective communication.</li>\n<li><strong>Technical Proficiency</strong>: Familiarity with Microsoft Office Suite (Excel, Word, PowerPoint); willingness to learn project management tools.</li>\n<li><strong>Interest in Project Management</strong>: Open to candidates looking to build a career in Project Management.</li>\n<li><strong>Certification</strong>: In project management, such as CAPM (Certified Associate in Project Management), PMP (Project Management Professional), or Agile/Scrum certifications, is beneficial but not always required.</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Hands-on training in project management and exposure to real-world projects.</li>\n<li>Mentorship from experienced project management professionals.</li>\n<li>Opportunities for career growth and professional development.</li>\n</ul>\n<h2>Salary Package</h2>\n<p>2.5 - 4 LPA</p>\n<h2>Experience</h2>\n<p>0-2 years</p>\n<h2>Location</h2>\n<p>Trivandrum</p>",
        "tags": [
            "0-2 Years",
            "Jira/Trello",
            "Microsoft Office Suite",
            "Project Management Certifications (CAPM, PMP, Agile/Scrum)"
        ],
        "summary": "Entry-level Project Manager Trainee role offering hands-on experience in project support, mentorship, and professional development for career growth in project management."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Marvelloux Apps (P) Ltd",
        "url": "https://technopark.org/job-details/26126",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<p><strong>Marvelloux Apps (P) Ltd</strong></p>\n<p><strong>Address:</strong> Ground Floor, Gayatri Building, Technopark Phase I, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.marvelloux.com\">http://www.marvelloux.com</a>\n<strong>Closing Date:</strong> 31, Dec 2025\n<strong>Contact Email:</strong> hr@marvelloux.com</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Full Stack Developer</strong> to join our team. The ideal candidate will have experience in both frontend and backend development, with a focus on PHP, WordPress, and modern JavaScript frameworks.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Frontend</strong>\n- Proficiency in HTML, CSS, JavaScript\n- Experience with React or Vue.js\n- Responsive and mobile-first design principles</p>\n<p><strong>Backend</strong>\n- PHP (Core PHP, Laravel) or Node.js\n- API development and business logic implementation</p>\n<p><strong>Database</strong>\n- MySQL or PostgreSQL\n- Data modeling and CRUD operations</p>\n<p><strong>CMS (Mandatory)</strong>\n- WordPress expertise (custom themes, plugins, Elementor/Gutenberg, WooCommerce)\n- REST API integrations</p>\n<p><strong>APIs &amp; Integrations</strong>\n- REST APIs and JSON\n- Integration with payment gateways, SMS, email, and CRM tools</p>\n<p><strong>Security</strong>\n- Authentication and authorization\n- Secure coding practices and data protection</p>\n<p><strong>Version Control</strong>\n- Git, GitHub/GitLab</p>\n<p><strong>Deployment</strong>\n- Hosting, domain, and SSL management\n- Cloud and cPanel server deployment</p>\n<p><strong>Webflow (Added Advantage)</strong>\n- Fast development cycles\n- Clean UI/UX with animations\n- SEO-friendly and high-performance solutions</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>3+ Years</strong> of full-stack development experience</li>\n<li>Willingness to work from our Trivandrum office</li>\n<li>Immediate joiners preferred</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume to <strong>hr@marvelloux.com</strong> before the deadline of <strong>31, Dec 2025</strong>.</p>",
        "tags": [
            "3+ Years",
            "PHP",
            "WordPress",
            "React"
        ],
        "summary": "A Full Stack Developer with 3+ years of experience in PHP, WordPress, and React is sought for a Trivandrum-based role requiring immediate availability and office presence."
    },
    {
        "job_title": "Graphic Designer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26125",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>KENLAND IT SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> <a href=\"https://www.kenland.in\">https://www.kenland.in</a>\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<h3>Graphic Designer</h3>\n<p><strong>Closing Date:</strong> 31, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025</p>\n<p><strong>Brief Description</strong>\nWe are seeking a skilled and creative Graphic Designer with at least 2 years of relevant work experience to join our team. The ideal candidate should have strong expertise in design tools and hands-on experience in digital printing and visual content creation.</p>\n<p><strong>Key Responsibilities</strong>\n- Develop creative illustrations and graphic designs for print and digital requirements\n- Design and edit artwork using Adobe Photoshop, CorelDRAW, and related tools\n- Prepare print-ready files for digital printing, ensuring accuracy and quality\n- Coordinate with internal teams to understand design needs and deliver accordingly\n- Maintain brand consistency across all design outputs\n- Meet deadlines and manage multiple design tasks efficiently</p>\n<p><strong>Preferred Skills</strong>\n- Minimum 2+ years of professional experience in graphic design\n- Proficiency in Illustration, Photoshop, CorelDRAW\n- Experience in digital printing workflows\n- Strong understanding of layouts, color theory, and typography\n- Good communication and time-management skills</p>\n<p><strong>Preferred</strong>\n- Immediate joiners\n- Experience in print-oriented or production environments</p>",
        "tags": [
            "2+ Years",
            "Adobe Photoshop",
            "CorelDRAW",
            "Digital Printing"
        ],
        "summary": "Creative Graphic Designer with 2+ years experience in Adobe tools and digital printing, maintaining brand consistency and managing print/digital design tasks."
    },
    {
        "job_title": "SAP Consultant – Finance / MM / Supply Chain",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26124",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>SAP Consultant – Finance / MM / Supply Chain</h2>\n<p><strong>Company:</strong> KENLAND IT SOLUTIONS (P) Ltd\n<strong>Address:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA , 695581\n<strong>Website:</strong> <a href=\"https://www.kenland.in\">https://www.kenland.in</a>\n<strong>Closing Date:</strong> 31, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking experienced SAP Consultants with expertise in SAP Finance, SAP MM, or SAP Supply Chain to support enterprise-level SAP implementation and support projects. The role involves working closely with business stakeholders to deliver efficient, scalable, and reliable SAP solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Gather and analyze business requirements and map them to SAP solutions</li>\n<li>Configure, customize, and support SAP modules based on project requirements</li>\n<li>Participate in SAP implementation, rollout, and post-go-live support activities</li>\n<li>Conduct system testing, integration testing, and user acceptance testing</li>\n<li>Prepare functional documentation and provide end-user training</li>\n<li>Identify system gaps and recommend process improvements</li>\n<li>Troubleshoot SAP issues and ensure timely resolution</li>\n<li>Collaborate with cross-functional and technical teams to ensure smooth system operations</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Commerce, Finance, or a related field</li>\n<li>Minimum 2+ years of hands-on experience in SAP Finance, MM, or Supply Chain</li>\n<li>Strong knowledge of SAP business processes and industry best practices</li>\n<li>Experience in SAP implementation and/or support projects</li>\n<li>Good communication, analytical, and problem-solving skills</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>SAP certification in relevant module(s)</li>\n<li>Experience in an enterprise or consulting environment</li>\n<li>Ability to work independently and manage multiple priorities</li>\n</ul>",
        "tags": [
            "2+ Years",
            "SAP Finance",
            "SAP MM",
            "SAP Supply Chain"
        ],
        "summary": "Experienced SAP Consultant needed for Finance/MM/Supply Chain modules with 2+ years of hands-on experience in enterprise SAP implementations and support."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26123",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2><strong>Job Description: Delivery Manager at Reflections Info Systems (P) Ltd</strong></h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published Date</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a <strong>14+ years seasoned Technical Delivery Manager</strong> to oversee the successful delivery of complex technical projects and solutions. The ideal candidate will have a strong technology background, exceptional project management skills, and the ability to collaborate with cross-functional teams. This role requires end-to-end ownership of project delivery, ensuring alignment with business goals, managing stakeholder expectations, and driving technical excellence.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li><strong>Project Delivery Management</strong>:</li>\n<li>Oversee planning, execution, and delivery of multiple technical projects.</li>\n<li>Manage project scope, timelines, budgets, risks, and quality.</li>\n<li>\n<p>Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n</li>\n<li>\n<p><strong>Team Leadership</strong>:</p>\n</li>\n<li>Lead and mentor cross-functional technical teams, fostering collaboration and innovation.</li>\n<li>\n<p>Conduct regular performance reviews and provide growth opportunities for team members.</p>\n</li>\n<li>\n<p><strong>Stakeholder Engagement</strong>:</p>\n</li>\n<li>Act as a bridge between technical teams, business stakeholders, and clients.</li>\n<li>\n<p>Communicate project status, risks, and solutions effectively to all stakeholders.</p>\n</li>\n<li>\n<p><strong>Technical Expertise</strong>:</p>\n</li>\n<li>Collaborate with architects and engineers to define technical solutions.</li>\n<li>\n<p>Provide input on architecture, design, and implementation strategies.</p>\n</li>\n<li>\n<p><strong>Process Improvement</strong>:</p>\n</li>\n<li>Identify opportunities to improve project delivery processes and tools.</li>\n<li>\n<p>Implement best practices in software development and delivery.</p>\n</li>\n<li>\n<p><strong>Risk and Issue Management</strong>:</p>\n</li>\n<li>Proactively identify project risks and develop mitigation strategies.</li>\n<li>\n<p>Resolve technical and operational challenges in a timely manner.</p>\n</li>\n<li>\n<p><strong>Customer Focus</strong>:</p>\n</li>\n<li>Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li><strong>Experience</strong>:</li>\n<li>14+ years in technology delivery roles, including hands-on development and leadership.</li>\n<li>Proven experience in delivering large-scale, complex projects with diverse teams.</li>\n<li>Manage P&amp;L for a portfolio of accounts, ensuring revenue growth and profitability.</li>\n<li>Plan and manage team ramp-ups/downs using pyramid planning, external hiring, and internal sourcing.</li>\n<li>Drive account management activities (financial tracking, invoice collection, margin improvements, resource planning).</li>\n<li>Build strong client relationships via regular interactions, QBRs, and on-site visits.</li>\n<li>\n<p>Support account mining by identifying opportunities, preparing proposals, and influencing stakeholders.</p>\n</li>\n<li>\n<p><strong>Technical Expertise</strong>:</p>\n</li>\n<li>Strong understanding of modern software development practices, cloud technologies (AWS, Azure, GCP), and DevOps.</li>\n<li>\n<p>Proficiency in one or more programming languages (Java, Python, .NET) preferred.</p>\n</li>\n<li>\n<p><strong>Project Management</strong>:</p>\n</li>\n<li>Expertise in Agile, Scrum, Kanban, and traditional methodologies.</li>\n<li>\n<p>Certification (PMP, CSM) is an advantage.</p>\n</li>\n<li>\n<p><strong>Leadership and Communication</strong>:</p>\n</li>\n<li>Excellent team leadership, people management, and conflict resolution skills.</li>\n<li>Strong communication, presentation, and negotiation abilities.</li>\n</ul>\n<h3><strong>Education</strong></h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s is a plus).</li>\n</ul>\n<h3><strong>Secondary Skills</strong></h3>\n<ul>\n<li>Experience managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices and frameworks.</li>\n<li>Strong business acumen to align technical goals with business strategy.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates should forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with notice period, current, and expected CTC details. <strong>Important Note</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are via official website, LinkedIn, or the HR email ID. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "14+ Years",
            "Cloud Technologies (AWS, Azure, GCP)",
            "Agile/Scrum",
            "Java/Python/.NET"
        ],
        "summary": "A 14+ year seasoned Delivery Manager is required to lead complex technical projects, manage cross-functional teams, and ensure alignment with business goals using cloud technologies and Agile methodologies."
    },
    {
        "job_title": "GIS Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26122",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong></p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date:</strong> 26, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Job Description</h3>\n<p>We are seeking a <strong>GIS Architect</strong> with <strong>10+ years of experience</strong> to design and govern the geospatial architecture for a large, mission-critical enterprise platform. This role involves modernizing legacy GIS components into a scalable, high-availability geospatial platform, ensuring integration with web, desktop, mobile, and operational systems across multiple on-premises data centers and a DR site.</p>\n<h3>Core Responsibilities</h3>\n<ul>\n<li>Define GIS architecture (ArcGIS Enterprise, geodatabases, services) for scalability, security, and high availability.</li>\n<li>Modernize legacy GIS systems into an ArcGIS Enterprise-based landscape, standardizing service publishing and consumption.</li>\n<li>Design GIS services for web, desktop, mobile, and control-room applications, ensuring consistent APIs and performance.</li>\n<li>Collaborate with application, integration, and backend teams to align GIS services with business modules (e.g., call taking, dispatch).</li>\n<li>Establish spatial data modeling standards (base maps, operational layers, network datasets) for routing, proximity analysis, and spatial queries.</li>\n<li>Ensure GIS components support active-active data centers and DR, including replication and failover strategies.</li>\n<li>Optimize GIS hosting environments (ArcGIS Enterprise + Oracle) with capacity planning and performance tuning.</li>\n<li>Implement GIS security best practices (user roles, service permissions, integration with identity providers).</li>\n<li>Provide technical leadership to GIS developers, analysts, and administrators.</li>\n</ul>\n<h3>Technical Skills</h3>\n<ul>\n<li><strong>ArcGIS Enterprise</strong> (Portal, Server, Data Store) in multi-server/data-center deployments.</li>\n<li><strong>ArcGIS Pro</strong> for geodatabase management, map authoring, and spatial analysis.</li>\n<li><strong>Enterprise geodatabases</strong> (ArcGIS with Oracle) for schema design, indexing, and performance tuning.</li>\n<li>Publishing and managing map/feature/geoprocessing services for real-time operational use.</li>\n<li>GIS integration with web/mobile apps via REST/JavaScript APIs.</li>\n<li>GIS performance optimization (caching, layer optimization, map design).</li>\n<li>GIS security (authentication, SSL/TLS, enterprise identity integration).</li>\n</ul>\n<h3>Experience and Soft Skills</h3>\n<ul>\n<li><strong>8+ years</strong> in GIS solution design, with <strong>3–4 years</strong> in an architect/lead role.</li>\n<li>Proven experience in mission-critical GIS environments with strict uptime/performance requirements.</li>\n<li>Multi-datacenter/DR environment experience (replication, synchronization, high-availability patterns).</li>\n<li>Strong collaboration with application, database, infrastructure, and operations teams.</li>\n<li>Excellent communication and documentation skills for technical and non-technical stakeholders.</li>\n</ul>\n<h3>SHOULD HAVE</h3>\n<ul>\n<li>GIS data governance standards (data lifecycle, versioning, quality checks).</li>\n<li>Collaboration with analytics teams for GIS-enabled dashboards and spatial insights.</li>\n<li>Capacity planning and performance testing for high-load scenarios.</li>\n<li>Incident reviews and root cause analysis for GIS-related issues.</li>\n<li>Backup/restore strategies aligned with enterprise RPO/RTO objectives.</li>\n</ul>\n<h3>Technical Skills (Should Have)</h3>\n<ul>\n<li>Real-time GIS components (GeoEvent Server) for streaming data (vehicle locations, sensors).</li>\n<li>Scripting/automation (Python, ArcPy, PowerShell) for GIS administration and data processing.</li>\n<li>Integration with message buses (Kafka, ActiveMQ) for real-time workflows.</li>\n<li>Load balancing/clustering for GIS servers and web tiers.</li>\n</ul>\n<h3>Experience (Should Have)</h3>\n<ul>\n<li>Modernization/migration projects from legacy GIS to ArcGIS Enterprise.</li>\n<li>GIS environments with security/compliance requirements and audit support.</li>\n</ul>\n<h3>NICE TO HAVE</h3>\n<ul>\n<li>Advanced GIS analytics/big data processing (heatmaps, spatial clustering).</li>\n<li>Open-source GIS tools (QGIS, PostGIS, GeoServer) and 3D/indoor mapping.</li>\n<li>GIS integration with BI tools (data warehouses, visualization platforms).</li>\n</ul>\n<h3>Important Notice</h3>\n<ul>\n<li>Apply via <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with resume, notice period, and CTC details.</li>\n<li><strong>Warning:</strong> Reflections Info Systems does <strong>not</strong> charge fees for jobs. All communications are via official website, LinkedIn, or the HR email above.</li>\n</ul>",
        "tags": [
            "8+ Years",
            "ArcGIS Enterprise",
            "Oracle Geodatabases",
            "Python Scripting"
        ],
        "summary": "The GIS Architect designs and governs enterprise geospatial architecture, modernizing legacy systems and ensuring integration with web, desktop, and mobile platforms for real-time spatial data and mission-critical operations."
    },
    {
        "job_title": "BIM Modeller",
        "company": "Grid Engineering Services",
        "url": "https://technopark.org/job-details/26121",
        "location": "Technopark",
        "closing_date": "20 Jan 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company:</strong> Grid Engineering Services\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Website:</strong> <a href=\"https://gridengineeringservices.com\">www.grdeng.com</a>\n<strong>Contact Email:</strong> careers@grdeng.com\n<strong>Mobile:</strong> +919633888544\n<strong>Closing Date:</strong> 20, Jan 2026\n<strong>Job Published:</strong> 19, Dec 2025</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and manage 3D models for civil and infrastructure projects using <strong>Autodesk Civil 3D</strong> and related software.</li>\n<li>Prepare detailed drawings and documentation including grading plans, alignments, profiles, corridors, and pipe networks.</li>\n<li>Coordinate with architectural, structural, and MEP teams to ensure model consistency and clash-free designs.</li>\n<li>Assist in BIM coordination meetings, identify design conflicts, and provide modelling solutions.</li>\n<li>Ensure all BIM models and drawings comply with company BIM standards and client requirements.</li>\n<li>Update and maintain models throughout the design and construction phases.</li>\n<li>Support in generating quantity take-offs and as-built models.</li>\n<li>Collaborate closely with engineers and project managers to ensure timely delivery of design deliverables.</li>\n<li>Maintain proper file management and version control in the <strong>Common Data Environment (CDE)</strong>.</li>\n</ul>\n<h3>Preferred Skills and Qualifications</h3>\n<ul>\n<li><strong>Bachelor’s Degree or Diploma</strong> in Civil Engineering or related field.</li>\n<li><strong>Minimum 4–5 years</strong> of experience in civil infrastructure modeling using <strong>Autodesk Civil 3D</strong>.</li>\n<li>Strong knowledge of roads, grading, utilities, and site development modelling.</li>\n<li>Experience with <strong>AutoCAD</strong>, <strong>Navisworks</strong>, and <strong>Revit</strong> is an advantage.</li>\n<li>Familiarity with BIM execution plans, LOD requirements, and CDE platforms (e.g., <strong>BIM 360</strong>, <strong>ACC</strong>).</li>\n<li>Good understanding of survey data, coordinate systems, and topographic surfaces.</li>\n<li>Excellent attention to detail, communication, and teamwork skills.</li>\n<li>Ability to work under deadlines and manage multiple tasks efficiently.</li>\n<li>Experience working on infrastructure or mixed-use development projects in the <strong>UAE or GCC region</strong>.</li>\n<li>Knowledge of <strong>BIM standards (ISO 19650)</strong> and <strong>QA/QC procedures</strong> for model review.</li>\n<li>Certification in <strong>Autodesk Civil 3D</strong> or BIM tools is an added advantage.</li>\n</ul>",
        "tags": [
            "4-5 Years",
            "Autodesk Civil 3D",
            "Navisworks",
            "BIM 360"
        ],
        "summary": "BIM Modeller required to create civil infrastructure 3D models using Autodesk Civil 3D. Requires 4-5 years of experience in BIM coordination and model compliance with ISO 19650 standards."
    },
    {
        "job_title": "Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26120",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Infrastructure Architect</strong> with <strong>10+ years of experience</strong> to lead the design and implementation of robust, scalable, and secure infrastructure across multi-site data centers. The role focuses on virtualization, OpenShift orchestration, backup/recovery, and disaster recovery strategies, with a strong emphasis on automation, availability, and compliance.</p>\n<h3>Core Responsibilities</h3>\n<ul>\n<li>Design infrastructure blueprints for multi-site deployments with isolated yet synchronized environments.</li>\n<li>Lead VMware vSphere/vSAN clusters and Red Hat OpenShift/IBM Cloud Pak platform deployments.</li>\n<li>Plan compute, storage, and networking configurations while integrating observability tools (EFK, Dynatrace, ManageEngine, IBM Guardium).</li>\n<li>Guide infrastructure for workloads like ArcGIS Enterprise, Oracle DB, Cloudera Data Platform, and IBM Cloud Pak for Integration.</li>\n<li>Define inter-site network architecture, IP schemes, and DR solutions using Zerto and Dell RecoverPoint.</li>\n<li>Ensure high availability, performance, and redundancy for analytics, middleware, and data platforms.</li>\n<li>Establish monitoring/logging standards using Dynatrace, VMware vRealize, and EFK stack.</li>\n<li>Architect backup/recovery strategies with SAN/NAS and orchestration tools (e.g., Perpetuuiti), aligning with RTO/RPO objectives.</li>\n</ul>\n<h3>Must-Have Skills</h3>\n<ul>\n<li><strong>Technical</strong>: VMware vSphere/vSAN, Red Hat OpenShift, SAN/NAS provisioning, data center networking (firewalls, SD-WAN, DNS), Ansible/Terraform, Dynatrace/EFK, Zerto/Dell RecoverPoint.</li>\n<li><strong>Experience</strong>: 12+ years in IT infrastructure (4+ years in enterprise-scale architecture), capacity planning, infrastructure documentation (Visio, Draw.io, Confluence), cross-functional collaboration.</li>\n</ul>\n<h3>Should-Have Skills</h3>\n<ul>\n<li>Infrastructure service standards (naming, tagging, version control).</li>\n<li>Container networking (Istio, ingress controllers), persistent volume provisioning, Windows Server/RHEL hardening.</li>\n<li>High-availability setups for Oracle RAC, Hadoop, or microservices.</li>\n</ul>\n<h3>Nice-to-Have Skills</h3>\n<ul>\n<li>GitOps for infrastructure, advanced telemetry/observability, service mesh automation, zero-touch provisioning.</li>\n</ul>\n<h3>Application Process</h3>\n<p>Interested candidates should email their resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current/expected CTC details. <strong>Important</strong>: Reflections Info Systems does not charge fees for job applications. All communications are via official website, LinkedIn, or the HR email above. Report any suspicious activity to the same email.</p>",
        "tags": [
            "12+ Years",
            "VMware vSphere",
            "Red Hat OpenShift",
            "Ansible/Terraform"
        ],
        "summary": "Infrastructure Architect with 12+ years experience designing scalable, secure multi-site data center solutions using VMware, OpenShift, and automation tools to ensure high availability and compliance."
    },
    {
        "job_title": "Solution Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26119",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2><strong>Solution Architect - Reflections Info Systems (P) Ltd</strong></h2>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Company Website:</strong> <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date:</strong> 26, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a <strong>Solution Architect</strong> to design and deliver scalable, secure, and high-performing technology solutions for clients. This role combines hands-on technical expertise with architectural thinking, requiring collaboration with senior architects, delivery teams, and stakeholders to translate business needs into robust solutions.</p>\n<h3><strong>Responsibilities</strong></h3>\n<h4><strong>Architecture &amp; Design</strong></h4>\n<ul>\n<li>Create solution architectures, high-level designs, and technical diagrams.</li>\n<li>Develop and evolve technical strategies for projects.</li>\n<li>Evaluate new technologies, tools, and frameworks for client solutions.</li>\n<li>Support proof-of-concepts, prototypes, and feasibility assessments.</li>\n</ul>\n<h4><strong>Collaboration &amp; Delivery</strong></h4>\n<ul>\n<li>Ensure architectural standards are followed by development teams.</li>\n<li>Participate in code reviews, technical design sessions, and agile ceremonies.</li>\n<li>Collaborate with multidisciplinary teams (policy, product, engineering, QA) for user-centric designs.</li>\n<li>Define scalable open-source, cloud-first solutions.</li>\n</ul>\n<h4><strong>Governance &amp; Stakeholder Engagement</strong></h4>\n<ul>\n<li>Clarify requirements and support technology decisions with stakeholders.</li>\n<li>Communicate architectural vision and solution rationale across teams.</li>\n<li>Identify underlying problems and contribute to digital transformation initiatives.</li>\n<li>Define architecture standards, guidelines, and best practices.</li>\n<li>Engage in communities of practice to promote technical excellence.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<h4><strong>Technical Skills</strong></h4>\n<ul>\n<li>Solid understanding of software development principles and system design.</li>\n<li>Hands-on experience with at least one programming language (Java, Python, C#, or similar).</li>\n<li>Practical knowledge of web stacks (frontend, backend, cloud, infrastructure, networking).</li>\n<li>Experience with cloud-first architectures (AWS, Azure, or GCP) and cloud-native solutions.</li>\n<li>Knowledge of databases, integration patterns, APIs, and microservices.</li>\n<li>Familiarity with open-source technologies and modern development practices.</li>\n</ul>\n<h4><strong>Professional Skills</strong></h4>\n<ul>\n<li>Agile delivery experience with technical teams.</li>\n<li>Stakeholder collaboration for technical decision-making.</li>\n<li>Strong analytical and problem-solving skills for architectural implications.</li>\n<li>Excellent communication to simplify complex technical concepts.</li>\n</ul>\n<h3><strong>Certifications &amp; Education</strong></h3>\n<ul>\n<li>Bachelor’s degree in computer science, Software Engineering, or related fields.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates should email their resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details. <strong>Important:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are via official email or LinkedIn. Report any suspicious activity to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "Not Specified",
            "Java",
            "AWS",
            "Microservices"
        ],
        "summary": "Designs scalable tech solutions, collaborates with teams, and leverages cloud-native technologies. Requires strong architectural and agile delivery expertise."
    },
    {
        "job_title": "DevOps Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26118",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Company Info</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India 695581\n<a href=\"http://www.reflectionsinfos.com\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p><strong>DevOps Architect</strong></p>\n<h2>Key Dates</h2>\n<ul>\n<li><strong>Closing Date</strong>: 26, Dec 2025</li>\n<li><strong>Published Date</strong>: 19, Dec 2025</li>\n</ul>\n<h2>Contact</h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></li>\n</ul>\n<h2>Brief Description</h2>\n<p>We are seeking candidates with <strong>8+ years of experience</strong> for this role.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Define and drive end-to-end DevOps strategy for mission-critical on-premises/hybrid applications.</li>\n<li>Design CI/CD pipelines (Azure DevOps, Jenkins) for Java, .NET, GIS, databases, and integration services.</li>\n<li>Lead modernization of legacy systems into microservices/containerized architectures.</li>\n<li>Implement infrastructure-as-code (Terraform, Ansible) for consistent provisioning.</li>\n<li>Collaborate with cross-functional teams to align pipelines with compliance and DR strategies.</li>\n<li>Establish configuration management and observability standards (ELK/EFK, Prometheus, Grafana).</li>\n<li>Integrate DevSecOps practices (SAST, DAST, container scanning) into CI/CD.</li>\n</ul>\n<h2>Technical Skills</h2>\n<ul>\n<li><strong>CI/CD Tools</strong>: Azure DevOps, Jenkins, GitLab CI</li>\n<li><strong>Infrastructure-as-Code</strong>: Terraform, Ansible</li>\n<li><strong>Containerization</strong>: Docker, Kubernetes/OpenShift</li>\n<li><strong>Monitoring</strong>: ELK/EFK, Prometheus, Grafana</li>\n<li><strong>Security</strong>: SonarQube, OWASP ZAP, Snyk</li>\n<li><strong>Scripting</strong>: Bash, PowerShell, Python</li>\n</ul>\n<h2>Experience</h2>\n<ul>\n<li><strong>8+ years</strong> in DevOps, build/release engineering, or infrastructure engineering.</li>\n<li><strong>3–4 years</strong> in a lead/architect role.</li>\n<li>Experience with multi-datacenter/DR environments and compliance requirements.</li>\n</ul>\n<h2>Additional Notes</h2>\n<ul>\n<li>Apply via <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with resume, notice period, and CTC details.</li>\n<li><strong>Warning</strong>: No payment is required for jobs at Reflections. All communications are via official channels.</li>\n</ul>",
        "tags": [
            "8+ Years",
            "CI/CD (Azure DevOps, Jenkins)",
            "Infrastructure-as-Code (Terraform, Ansible)",
            "Containerization (Docker, Kubernetes)"
        ],
        "summary": "Lead DevOps strategy for mission-critical systems, modernizing legacy apps with CI/CD, IaC, and containerization while ensuring compliance and uptime."
    },
    {
        "job_title": "Psychology Research Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/26117",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Psychology Research Trainee</h2>\n<p><strong>Company</strong>: ZenturioTech (P) Ltd\n<strong>Location</strong>: STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website</strong>: <a href=\"https://zenturiotech.com\">zenturiotech.com</a>\n<strong>Closing Date</strong>: 10, Jan 2026\n<strong>Job Published</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: admin@zenturiotech.com</p>\n<h3>About the Role</h3>\n<p>We are seeking a vibrant and motivated <strong>Psychology Research Trainee</strong> with a strong interest in mental health, research, and community engagement. This role combines research exposure with active involvement in engagement campaigns and sessions supporting mental health and technology-driven wellness initiatives.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Assist in research planning, data collection, and analysis</li>\n<li>Conduct literature reviews and summarize research findings</li>\n<li>Support development and validation of psychological assessment tools</li>\n<li>Prepare research reports, documentation, and presentations</li>\n<li>Assist in manuscript preparation for journals and conferences</li>\n<li>Plan, conduct, and engage in mental health awareness sessions and campaigns</li>\n<li>Support community-building initiatives around mental health projects</li>\n<li>Collaborate with cross-functional teams on technology-enabled wellness initiatives</li>\n<li>Ensure adherence to ethical research and engagement guidelines</li>\n</ul>\n<h3>Eligibility &amp; Skills</h3>\n<ul>\n<li>Postgraduate degree in Psychology or a related field</li>\n<li>Interest or exposure to mental health, behavioral research, or wellness programs</li>\n<li>Energetic, proactive, and comfortable engaging with diverse audiences</li>\n<li>Strong communication, facilitation, and coordination skills</li>\n<li>Basic knowledge of research tools (SPSS/R/Python is a plus)</li>\n<li>Ability to work independently and collaboratively</li>\n</ul>\n<h3>What You’ll Gain</h3>\n<ul>\n<li>Hands-on research and field engagement experience</li>\n<li>Exposure to mental health programs and tech-driven wellness initiatives</li>\n<li>Internship certificate and potential future opportunities</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume to <strong>admin@zenturiotech.com</strong>. If you’re passionate about psychology, research, and creating real-world impact in mental health, this internship is your chance to make a difference.</p>",
        "tags": [
            "0-1 Years",
            "Psychology",
            "Research",
            "SPSS/R/Python"
        ],
        "summary": "A Psychology Research Trainee role at ZenturioTech offering hands-on research experience in mental health, community engagement, and tech-driven wellness initiatives with opportunities for future growth."
    },
    {
        "job_title": "Business Development Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/26116",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<p><strong>ZenturioTech (P) Ltd</strong></p>\n<p><strong>Location:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://zenturiotech.com\">https://zenturiotech.com</a>\n<strong>Closing Date:</strong> 10, Jan 2026\n<strong>Published Date:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> admin@zenturiotech.com</p>\n<h3>Brief Description</h3>\n<p>Are you driven, ambitious, and excited by the idea of building something big from scratch? We're a growing startup on a mission and we're looking for a <strong>Business Development Trainee</strong> who knows how to turn connections into customers. If you're a LinkedIn wizard, a self-starter, and someone who thrives in fast-paced environments, let's talk.</p>\n<h3>What You'll Be Doing:</h3>\n<ul>\n<li>Build global connections via LinkedIn &amp; digital channels</li>\n<li>Own the full sales cycle — from outreach and lead generation to closing deals</li>\n<li>Craft compelling pitches and open doors to new markets</li>\n<li>Work closely with founders and core team to shape strategy</li>\n<li>Hustle with heart, take initiative and drive growth like it's your own company</li>\n</ul>\n<h3>You're a Great Fit If You:</h3>\n<ul>\n<li>Are passionate about startups and want to be part of something early-stage</li>\n<li>Are a LinkedIn power user with proven lead-gen skills</li>\n<li>Have a go-getter mindset and don't wait to be told what to do</li>\n<li>Love sales, growth and making things happen</li>\n<li>Are self-motivated, organized, and hungry to learn</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Be part of a high-growth startup journey from day one</li>\n<li>Work directly with the founding team</li>\n<li>Massive ownership, fast learning curve and real impact</li>\n<li>Remote-friendly, flexible culture built on trust and results</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>LinkedIn power user with proven lead-gen skills</li>\n<li>Go-getter mindset and proactive attitude</li>\n<li>Passion for sales, growth, and execution</li>\n</ul>\n<p><strong>Ready to hustle with us? Send your resume to admin@zenturiotech.com</strong></p>\n<p>Let’s build something amazing together!</p>",
        "tags": [
            "Entry Level",
            "LinkedIn",
            "Lead Generation",
            "Sales"
        ],
        "summary": "ZenturioTech seeks a Business Development Trainee to drive global sales and growth. Ideal candidate is a LinkedIn expert with a go-getter mindset, working closely with founders to shape strategy."
    },
    {
        "job_title": "Security Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26115",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">www.reflectionsinfos.com</a>\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published Date</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Job Overview</h3>\n<p>The <strong>Security Architect</strong> is responsible for defining and governing the security architecture for mission-critical, on-premises enterprise platforms across multiple data centres and a dedicated disaster recovery site. This role ensures confidentiality, integrity, and availability by designing and reviewing security controls for applications, integrations, data, infrastructure, and identities. Collaboration with cross-functional teams is essential to embed security into legacy system modernization and meet regulatory, audit, and compliance requirements.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Define security architecture and reference patterns for applications, APIs, integrations, and data flows.</li>\n<li>Establish security standards for identity and access management (SSO, MFA, RBAC), network security (segmentation, firewalls, VPNs), and endpoint protection.</li>\n<li>Collaborate with Application, Integration, and API teams to secure microservices, web apps, mobile clients, and external APIs.</li>\n<li>Work with Infrastructure and Network teams to secure servers, containers, Kubernetes/OpenShift clusters, databases, load balancers, and WAFs.</li>\n<li>Define security controls for integrations with external systems (e.g., government systems, third-party services).</li>\n<li>Oversee logging, monitoring, and alerting for security events, working with SIEM/SOC teams.</li>\n<li>Drive secure SDLC and DevSecOps practices (threat modeling, SAST/DAST testing, CI/CD pipeline integration).</li>\n<li>Conduct architecture reviews for new solutions and change requests, ensuring compliance.</li>\n<li>Define security baselines, hardening guides, and configuration benchmarks.</li>\n</ul>\n<h3>Technical Skills</h3>\n<ul>\n<li>Enterprise security architecture for on-premises/hybrid environments.</li>\n<li>Identity and access management (Active Directory/LDAP, SSO, MFA, OAuth2, OpenID Connect, JWT).</li>\n<li>Application security fundamentals (OWASP Top 10, secure coding, input validation).</li>\n<li>Network security controls (firewalls, WAFs, secure remote access).</li>\n<li>Container security (Docker, Kubernetes/OpenShift, image scanning).</li>\n<li>Database security (encryption, hardening, Oracle).</li>\n<li>Security logging/monitoring (SIEM platforms, centralized analytics).</li>\n</ul>\n<h3>Experience &amp; Soft Skills</h3>\n<ul>\n<li><strong>10+ years</strong> in information security, with <strong>3–4 years</strong> in a Security Architect role.</li>\n<li>Proven experience in large-scale, mission-critical systems with uptime/compliance requirements.</li>\n<li>Multi-datacentre/DR environment expertise (failover, replication, high availability).</li>\n<li>Cross-functional collaboration (application, infrastructure, DevOps, network teams).</li>\n<li>Excellent communication skills for technical and non-technical stakeholders.</li>\n</ul>\n<h3>Additional Responsibilities</h3>\n<ul>\n<li>Lead threat modeling/risk assessments and translate findings into controls.</li>\n<li>Define secure access policies (privileged access, just-in-time access).</li>\n<li>Support incident response/forensics and business continuity/DR planning.</li>\n<li>Coach teams on security-by-design principles.</li>\n</ul>\n<h3>Technical Tools &amp; Certifications</h3>\n<ul>\n<li>CI/CD pipeline security (SAST, DAST, container scanning).</li>\n<li>Secrets management (key/certificate rotation, secure storage).</li>\n<li>Encryption technologies (TLS, certificates).</li>\n<li>Certifications: CISSP, CISM, SABSA, CCSP, GIAC, or equivalent.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email <strong>Careers@reflectionsinfos.com</strong> with resumes, notice period, and CTC details. <strong>Warning</strong>: No payments are requested for jobs at Reflections. All communications are via official channels. For fraud alerts, contact <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "10+ Years",
            "Identity & Access Management",
            "Container Security",
            "Application Security"
        ],
        "summary": "The Security Architect designs and governs enterprise security architecture across on-premises environments, ensuring compliance and collaboration with cross-functional teams."
    },
    {
        "job_title": "Test Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26114",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsinfos.com\">Reflections Global</a>\n<strong>Job Title:</strong> Test Architect\n<strong>Closing Date:</strong> 26, Dec 2025\n<strong>Published Date:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Role Overview</strong></h3>\n<p>We are seeking a <strong>Test Architect</strong> with <strong>8+ years of experience</strong> to define and govern testing strategies for mission-critical enterprise platforms. The role spans on-premises data centers, DR sites, and modernized components like microservices and containerized workloads.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Define end-to-end test strategies for functional, integration, regression, performance, security, GIS, and DR testing.</li>\n<li>Design test approaches for legacy and modernized components (web, desktop, mobile, APIs, GIS services).</li>\n<li>Establish automation frameworks for APIs, UI (web/mobile), and backend services in CI/CD pipelines.</li>\n<li>Align test environments, configurations, and data refresh strategies with deployment models (e.g., active-active DC).</li>\n<li>Define non-functional testing strategies (performance, load, stress, failover) for major releases.</li>\n<li>Govern test data management standards, including anonymization/masking for security.</li>\n<li>Provide leadership to QA teams on test processes, tools, and best practices.</li>\n</ul>\n<h3><strong>Technical Skills</strong></h3>\n<ul>\n<li><strong>Automation Frameworks:</strong> Selenium, Playwright, Cypress (UI); REST-assured, Postman/Newman, Karate (API).</li>\n<li><strong>Performance Tools:</strong> JMeter, Gatling, Locust.</li>\n<li><strong>CI/CD Integration:</strong> Azure DevOps, Jenkins, GitLab CI.</li>\n<li><strong>Testing Environments:</strong> On-premises systems with GIS (ArcGIS), Oracle databases, Kafka.</li>\n<li><strong>Test Management Tools:</strong> Azure Test Plans, JIRA/Xray, Zephyr.</li>\n</ul>\n<h3><strong>Experience &amp; Soft Skills</strong></h3>\n<ul>\n<li><strong>8+ years</strong> in software testing, <strong>3-4 years</strong> in Test Architect/QA leadership roles.</li>\n<li>Proven experience with large-scale systems, SLA-driven environments, and DR testing.</li>\n<li>Strong collaboration skills across architects, DevOps, GIS, infrastructure, and business stakeholders.</li>\n<li>Ability to document test strategies, governance models, and release readiness criteria.</li>\n</ul>\n<h3><strong>Additional Requirements</strong></h3>\n<ul>\n<li>Experience with service virtualization, desktop application testing, and observability tools (ELK/EFK, APM).</li>\n<li>Modernization project experience (legacy to microservices/web frontends).</li>\n<li>Compliance/audit traceability in regulated environments.</li>\n</ul>\n<h3><strong>Secondary Skills</strong></h3>\n<ul>\n<li>SRE/reliability engineering concepts (SLOs, SLIs).</li>\n<li>Chaos engineering/resilience testing.</li>\n<li>Model-based/property-based testing.</li>\n<li>Synthetic test data generation.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Forward resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details. <strong>Important:</strong> Reflections Info Systems does <strong>not</strong> charge any fees for job applications. All communications are via official HR email or LinkedIn. Report suspicious activity to <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "8+ Years",
            "Selenium",
            "JMeter",
            "REST-assured"
        ],
        "summary": "Test Architect with 8+ years experience to define testing strategies, automate frameworks, and ensure quality in mission-critical enterprise platforms."
    },
    {
        "job_title": "Cloud Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26113",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published Date</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain scalable cloud infrastructure solutions.</li>\n<li>Lead cloud adoption strategies, migration roadmaps, and workload assessments.</li>\n<li>Provide infrastructure expertise for cloud-native and on-premise solution architectures.</li>\n<li>Architect infrastructure solutions for AI/ML platforms (training, inference, pipelines, GPU/TPU setups).</li>\n<li>Ensure infrastructure security, compliance, and adherence to industry best practices.</li>\n<li>Design and implement integrated, end-to-end, scalable services.</li>\n<li>Collaborate with vendors, partners, and stakeholders for successful integration.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Minimum 8 years</strong> of experience in infrastructure design, implementation, and maintenance.</li>\n<li>Experience in <strong>5+ enterprise-level cloud architecture</strong> projects.</li>\n<li>Proven expertise in <strong>microservices architectures</strong>, <strong>distributed systems</strong>, and <strong>integration architectures</strong>.</li>\n<li>Hands-on experience in <strong>large-scale cloud migration</strong> projects.</li>\n<li>Experience in <strong>ML workload infrastructure</strong> (training, inference, GPU/TPU provisioning).</li>\n<li>Solid experience in <strong>data center operations</strong> (private/hybrid cloud environments).</li>\n<li>Strong experience with <strong>VMware technologies</strong> (vSphere, ESXi, vCenter).</li>\n<li>Hands-on expertise in <strong>networking, authentication, compute, and storage</strong>.</li>\n<li>Experience in <strong>RFP responses</strong>, solution design, and cost estimation.</li>\n<li>Proficiency in <strong>Docker/Kubernetes</strong> for ML workload deployment.</li>\n<li>Expertise in <strong>Infrastructure as Code (IaC)</strong> (Ansible, Terraform, ARM, CloudFormation).</li>\n<li>Knowledge of <strong>SQL/NoSQL databases</strong>.</li>\n<li>Deep understanding of <strong>DevOps</strong>, <strong>containerization</strong>, and <strong>CI/CD pipelines</strong>.</li>\n<li>Experience with <strong>monitoring tools</strong> (Nagios, Splunk, New Relic, Prometheus).</li>\n<li>Compliance expertise (GDPR, PCI DSS, HIPAA).</li>\n<li>Technical knowledge of <strong>cloud technologies</strong> (AWS, Azure, GCP) and <strong>virtualization platforms</strong> (VMware, Hyper-V, Cisco, EMC).</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Experience with <strong>LDAP, DNS, DHCP, Active Directory</strong>.</li>\n<li>Excellent <strong>communication</strong>, <strong>documentation</strong>, and <strong>presentation</strong> skills.</li>\n<li>Proficiency in <strong>scripting languages</strong> (Python, Bash, PowerShell) for automation.</li>\n</ul>\n<h3>Certifications</h3>\n<ul>\n<li><strong>AWS/Azure/GCP Architect Certifications</strong></li>\n<li><strong>Kubernetes Certifications</strong> (CKA/CKAD)</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details. <strong>Important Note</strong>: Reflections Info Systems does <strong>not</strong> charge fees for job applications. All communications are via official email or LinkedIn. For clarifications, contact <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "8+ Years",
            "Cloud Architecture",
            "Kubernetes",
            "Infrastructure as Code"
        ],
        "summary": "Cloud Infrastructure Architect with 8+ years of experience in designing scalable cloud solutions, AI/ML platforms, and DevOps practices. Requires expertise in cloud migration, Kubernetes, and infrastructure automation."
    },
    {
        "job_title": "IT Engineer -Software Development (Junior)|UI Path/RPA",
        "company": "Naga Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26112",
        "location": "Technopark",
        "closing_date": "02 Jan 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Naga Info Solutions (P) Ltd</strong>\nModule No 2505, 5th Floor, Yamuna Building, Technopark Phase III\n695583\n<a href=\"http://www.nagainfo.com\">http://www.nagainfo.com</a></p>\n<h2>Job Title</h2>\n<p><strong>IT Engineer - Software Development (Junior)</strong></p>\n<h2>Technologies</h2>\n<p><strong>UI Path/RPA</strong></p>\n<h2>Dates</h2>\n<ul>\n<li><strong>Closing Date:</strong> 02, Jan 2026</li>\n<li><strong>Job Published:</strong> 19, Dec 2025</li>\n</ul>\n<h2>Contact</h2>\n<ul>\n<li><strong>Email:</strong> <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a></li>\n</ul>\n<h2>Brief Description</h2>\n<p>We are seeking a skilled Software Development (Junior) professional to join an exciting project for our client in Abu Dhabi. If you have hands-on experience in RPA and Intelligent Automation, this is a great opportunity to grow your career in a dynamic and fast-paced environment.</p>\n<h2>Location</h2>\n<p>Abu Dhabi, UAE</p>\n<h2>Experience Required</h2>\n<p>3 to 5 Years</p>\n<h2>Role Highlights</h2>\n<ul>\n<li>Hands-on experience with RPA &amp; Intelligent Automation projects</li>\n<li>Opportunity to work with UiPath and IDP technologies</li>\n<li>Exposure to end-to-end automation lifecycle (analysis to deployment)</li>\n<li>Involvement in CI/CD pipelines and version control practices</li>\n<li>Collaborative work environment with cross-functional teams</li>\n</ul>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Develop RPA and Intelligent Automation solutions using UiPath and IDP technologies</li>\n<li>Analyze business processes and design efficient automation workflows</li>\n<li>Document As-Is processes, BRD, FSD, automation architecture, and solution designs</li>\n<li>Build, test, and deploy automation workflows ensuring quality standards</li>\n<li>Create and maintain reusable automation components</li>\n<li>Manage code repositories using Git and follow version control best practices</li>\n<li>Integrate automation solutions with CI/CD pipelines</li>\n<li>Perform code reviews and prepare review reports</li>\n<li>Support existing automation solutions and manage change requests</li>\n<li>Coordinate with L2/L3 teams for deployment and post-production support</li>\n<li>Create test procedures and test scenarios for Pre-UAT and UAT</li>\n<li>Act as the first point of contact for configuration-related issues</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Required</h3>\n<ul>\n<li>Strong experience in RPA Development</li>\n<li>Hands-on expertise with UiPath</li>\n<li>Experience working with IDP Solutions</li>\n<li>Knowledge of Git / Version Control systems</li>\n<li>Understanding of CI/CD integration</li>\n<li>Good analytical and documentation skills</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Experience working in enterprise-scale automation environments</li>\n<li>Exposure to multiple automation processes/projects</li>\n<li>Strong communication and stakeholder management skills</li>\n<li>Experience supporting production automation workflows</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Interested candidates should contact us or send their CVs to <a href=\"mailto:mail@nagainfo.com\">mail@nagainfo.com</a>.</p>",
        "tags": [
            "3 to 5 Years",
            "UiPath",
            "RPA",
            "Git"
        ],
        "summary": "Junior Software Engineer role in Abu Dhabi requiring 3-5 years of RPA experience with UiPath and IDP technologies. Focus on automation development, CI/CD pipelines, and cross-team collaboration."
    },
    {
        "job_title": "Regional Sales Manager – GCC (Software Sales)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26111",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsinfos.com\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p><strong>Regional Sales Manager – GCC (Software Sales)</strong></p>\n<h2>Application Deadline</h2>\n<p><strong>Closing Date:</strong> 26, Dec 2025\n<strong>Published:</strong> 19, Dec 2025</p>\n<h2>Contact</h2>\n<p>📧 <strong>Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic <strong>Regional Sales Manager (RSM)</strong> to lead and expand our software business operations across the <strong>Gulf Cooperation Council (GCC)</strong> region (Saudi Arabia, UAE, Qatar, Kuwait, Bahrain, Oman). The RSM will drive sustainable revenue growth, build long-term client relationships, and position our enterprise software solutions as a trusted choice for digital transformation in industries like <strong>Banking, Financial Services, Telecom, Retail, and Government</strong>.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Develop and execute comprehensive regional sales strategies to meet/exceed software and services revenue targets (software solutions, SaaS, licensing, digital transformation).</li>\n<li>Identify and secure new enterprise clients while nurturing long-term relationships with key accounts and CXO-level stakeholders.</li>\n<li>Manage the end-to-end enterprise sales cycle (prospecting, RFPs, proposals, negotiations, deal closure).</li>\n<li>Ensure timely revenue collection and follow-up with existing accounts; drive upselling/cross-selling opportunities.</li>\n<li>Expand the partner ecosystem by establishing relationships with system integrators, VARs, and channel partners across GCC.</li>\n<li>Ensure compliance with regional regulatory requirements (public tenders, data residency norms, SaaS/cloud compliance).</li>\n<li>Collaborate cross-functionally with Pre-Sales, Delivery, Product, Marketing, and Partner Management teams.</li>\n<li>Represent the company at regional trade events, summits, and conferences to enhance brand visibility.</li>\n<li>Provide accurate sales forecasts, pipeline insights, and market intelligence to senior management.</li>\n</ul>\n<h2>Travel Requirements</h2>\n<ul>\n<li>Travel across GCC as needed for client meetings, partner engagements, and industry events.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Primary Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Business, Computer Science, Engineering, or related field; MBA preferred.</li>\n<li><strong>5–8 years</strong> of enterprise software sales experience, including <strong>5+ years</strong> in a regional leadership capacity within GCC.</li>\n<li>Proven success in selling <strong>SaaS, cloud platforms, and enterprise solutions</strong> to large/mid-sized clients.</li>\n<li>Deep understanding of <strong>GCC market regulations, tendering processes, and enterprise procurement frameworks</strong>.</li>\n<li>Established network of enterprise clients and partners in key markets (KSA, Qatar, UAE).</li>\n<li>Excellent <strong>communication, negotiation, and presentation</strong> skills.</li>\n<li>Strong <strong>soft skills</strong>: resilience, adaptability, cross-cultural negotiation, leadership under pressure.</li>\n<li>Fluency in <strong>English and Arabic</strong> (mandatory).</li>\n<li>Must hold a <strong>valid GCC residency</strong> and <strong>driving license</strong>.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates should email their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details.</p>\n<p>⚠️ <strong>Fraud Alert:</strong> No payment is ever sought for jobs at Reflections. We contact candidates only via our official website or LinkedIn. For clarifications, contact <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "5-8 Years",
            "SaaS",
            "Enterprise Software Sales",
            "GCC Market Regulations"
        ],
        "summary": "Lead enterprise software sales in GCC, driving revenue growth and client relationships. Requires 5-8 years of regional sales experience with expertise in SaaS and GCC market compliance."
    },
    {
        "job_title": "Solution Architect (Optimizely)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26110",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India - 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p><strong>Solution Architect (Optimizely)</strong></p>\n<h2>Closing Date</h2>\n<p>26, Dec 2025</p>\n<h2>Contact</h2>\n<p>📧 <strong>Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h2>Job Overview</h2>\n<p>We are seeking a <strong>12+ years experienced</strong> Solution Architect to lead a large-scale migration from <strong>SAP B2B</strong> to <strong>Optimizely Commerce Cloud</strong>. This role requires technical leadership in designing scalable, secure, and future-ready architectures while managing cross-functional teams and vendor transitions.</p>\n<h3>Responsibilities</h3>\n<p><strong>Architecture &amp; Design</strong>\n- Define end-to-end migration architecture for SAP B2B to Optimizely, including CMS, Commerce, and PIM integration.\n- Design frameworks aligned with business goals for scalability, security, and performance.\n- Develop data migration strategies for products, pricing, and customer hierarchies.\n- Ensure API integration between SAP, Optimizely, and enterprise systems.</p>\n<p><strong>Technical Leadership</strong>\n- Mentor development teams on best practices and coding standards.\n- Collaborate with Optimizely consultants to validate technical approaches.\n- Drive DevOps strategies for CI/CD pipelines, containerization, and cloud deployment.</p>\n<p><strong>Project Ownership</strong>\n- Take ownership of the migration project post-vendor handover.\n- Align solutions with enterprise security and compliance standards.\n- Provide technical guidance during feasibility analysis and pilot migrations.</p>\n<p><strong>Collaboration &amp; Communication</strong>\n- Translate business requirements into technical solutions with Business Analysts.\n- Communicate architecture decisions to stakeholders in business-friendly terms.\n- Support QA teams with performance, integration, and security testing strategies.</p>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills</strong>\n- <strong>SAP B2B Architecture</strong>: Expertise in SAP Commerce Cloud, Back Office, and integration patterns.\n- <strong>B2B Platform</strong>: Hands-on experience with CMS and Commerce Cloud (Optimizely).\n- <strong>Optimizely PIM &amp; Spire</strong>: Strong knowledge of PIM and Spire framework.\n- <strong>.NET Development</strong>: Proficiency in .NET Core and ASP.NET for Optimizely development.\n- <strong>Cloud Architecture</strong>: Azure PaaS expertise for hosting Optimizely solutions.\n- <strong>Azure Active Directory</strong>: Identity and access management experience.\n- <strong>API Design</strong>: RESTful services, SAP APIs, and Optimizely endpoints.\n- <strong>Frontend Development</strong>: React expertise with CMS integration.</p>\n<p><strong>Architectural Leadership</strong>\n- Modern architecture concepts (monolithic/microservices).\n- Scalable solution design and system integration strategies.\n- Enterprise security and compliance knowledge.</p>\n<p><strong>Project Ownership</strong>\n- End-to-end project leadership from blueprint to execution.\n- Vendor transition expertise.\n- Stakeholder communication for technical-to-business alignment.</p>\n<p><strong>Secondary Skills</strong>\n- GraphQL/Headless CMS architecture.\n- DevOps tools (Azure DevOps, GitHub Actions).\n- Containerization (Docker, Kubernetes).</p>\n<h3>Soft Skills</h3>\n<ul>\n<li>Team mentoring and coaching.</li>\n<li>Agile methodology for sprint management.</li>\n<li>Analytical problem-solving and feasibility analysis.</li>\n<li>Continuous learning in SAP BTP, Optimizely, and cloud technologies.</li>\n</ul>\n<h3>Important Notice</h3>\n<ul>\n<li>Apply with resume, notice period, and CTC details to <strong>Careers@reflectionsinfos.com</strong>.</li>\n<li><strong>Fraud Alert</strong>: No payments are requested for jobs at Reflections. All communications are via official channels. Contact HR for verification.</li>\n</ul>",
        "tags": [
            "12+ Years",
            "SAP B2B",
            "Optimizely",
            ".NET Core"
        ],
        "summary": "Lead SAP B2B to Optimizely Commerce Cloud migration with 12+ years of enterprise architecture, cloud integration, and technical leadership expertise."
    },
    {
        "job_title": "SDET (.NET)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26109",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<p><strong>Job Title</strong>: SDET (.NET)\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published</strong>: 19, Dec 2025\n<strong>Contact</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<p><strong>Brief Description</strong>\nWe are seeking candidates with <strong>3+ years</strong> of experience for this role.</p>\n<p><strong>Job Description</strong>\nWe are hiring a <strong>Software Development Engineer in Test (SDET)</strong> to ensure quality and reliability during the <strong>SAP B2B to Optimizely Commerce Cloud migration</strong>. This role combines <strong>programming and QA expertise</strong> to design, develop, and execute automated/manual tests. Responsibilities include validating workflows, API integrations, data accuracy, building automation frameworks, integrating tests into <strong>CI/CD pipelines</strong>, and collaborating with developers and business teams for a <strong>robust solution</strong>.</p>\n<p><strong>Responsibilities</strong>:\n- Develop/maintain automated test suites using <strong>.NET Core/C#, Selenium, or Playwright</strong>.\n- Perform API testing for <strong>ECC-Optimizely integrations</strong> using <strong>Postman/RestSharp</strong>.\n- Validate migrated data via <strong>SQL queries</strong> and backend checks.\n- Implement unit/integration tests with <strong>xUnit, NUnit, MSTest</strong>.\n- Set up test pipelines in <strong>Azure DevOps/GitHub Actions</strong>.\n- Conduct functional, regression, and end-to-end testing for <strong>ecommerce workflows</strong>.\n- Perform performance testing using <strong>JMeter, k6</strong>.\n- Ensure secure API practices and <strong>OWASP awareness</strong>.\n- Collaborate in <strong>Agile teams</strong>, report defects in <strong>JIRA/Azure Boards</strong>.\n- Generate test reports using <strong>ExtentReports, Allure</strong>, or custom dashboards.</p>\n<p><strong>Preferred Skills</strong></p>\n<p><strong>Primary Skills</strong>:\n- <strong>Technical Testing</strong>: .NET Core/C#, API testing (Postman/RestSharp), unit testing (xUnit/NUnit/MSTest), test automation (Selenium/Playwright), SQL/data validation, CI/CD (Azure DevOps/GitHub Actions).\n- <strong>Functional &amp; Integration Testing</strong>: End-to-end scenarios (catalog, pricing, inventory, orders), regression testing, error handling/logging.\n- <strong>Quality Practices</strong>: Test strategy/planning, defect management (JIRA/Azure Boards), Git version control.</p>\n<p><strong>Secondary Skills</strong>:\n- <strong>Performance &amp; Security Testing</strong>: JMeter/k6/Locust, OWASP Top 10 awareness.\n- <strong>SAP ECC Awareness</strong>: Basic ABAP, ECC data models (MARA, KNA1, VBAK).\n- <strong>Optimizely Platform</strong>: Commerce workflows, CMS testing.\n- <strong>Collaboration &amp; DevOps</strong>: Test reporting tools, Agile methodology.</p>\n<p><strong>Soft Skills</strong>:\n- Strong communication/documentation.\n- Analytical thinking for edge cases/data issues.\n- Proactive collaboration with developers, analysts, stakeholders.</p>\n<p><strong>Application Instructions</strong>\nForward resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current/expected CTC. <strong>Warning</strong>: No payment is requested for jobs at Reflections. All communications are via official website/LinkedIn or HR email. Contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> for fraud alerts.</p>",
        "tags": [
            "3+ Years",
            ".NET Core/C#",
            "API Testing",
            "Test Automation"
        ],
        "summary": "SDET (.NET) required for SAP B2B to Optimizely migration, focusing on test automation, API validation, and CI/CD integration with 3+ years of experience."
    },
    {
        "job_title": "Lead (Full Stack - FE / BE / React)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26108",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company</strong>: Reflections Info Systems (P) Ltd\n<strong>Location</strong>: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.reflectionsinfos.com\">Reflections Global</a>\n<strong>Job Title</strong>: Lead (Full Stack - FE / BE / React)\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Job Published</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>highly skilled Full Stack Developer</strong> with <strong>6+ years of experience</strong>. This role requires deep technical expertise across front-end and back-end technologies, strong architectural understanding, and hands-on experience with e-commerce systems.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop scalable, secure, and maintainable full-stack solutions.</li>\n<li>Collaborate with architects, business analysts, QA, and DevOps teams to ensure alignment and delivery.</li>\n<li>Ensure high performance and responsiveness of applications across browsers and devices.</li>\n<li>Integrate and optimize <strong>PIM (Product Information Management)</strong> and <strong>Spire systems</strong> within the e-commerce ecosystem.</li>\n<li>Implement <strong>CI/CD pipelines</strong> for automated testing and deployment using <strong>Azure DevOps</strong> or <strong>GitHub Actions</strong>.</li>\n<li>Maintain documentation and provide technical leadership and mentoring to junior developers.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Front-End (React)</h4>\n<ul>\n<li><strong>React.js</strong> (Hooks, Context API): Building scalable, component-based UIs.</li>\n<li><strong>JavaScript (ES6+)</strong> / <strong>TypeScript</strong>: Strong scripting and typing for maintainable code.</li>\n<li><strong>HTML5 / CSS3 / SASS</strong>: Responsive design and layout skills.</li>\n<li><strong>State Management</strong>: <strong>Redux</strong> or <strong>React Query</strong> for managing complex state.</li>\n<li><strong>API Integration</strong>: Consuming RESTful APIs securely and efficiently.</li>\n<li><strong>Cross-Browser Compatibility</strong>: Ensuring consistent UI behavior across platforms.</li>\n</ul>\n<h4>Back-End (.NET)</h4>\n<ul>\n<li><strong>.NET Core / C#</strong>: Building scalable services and APIs for <strong>Optimizely</strong>.</li>\n<li><strong>Entity Framework / LINQ</strong>: Data access and manipulation.</li>\n<li><strong>RESTful API Design</strong>: Creating secure, performant endpoints for <strong>ECC-Optimizely integration</strong>.</li>\n<li><strong>Authentication &amp; Authorization</strong>: <strong>OAuth2</strong>, <strong>JWT</strong>, role-based access control.</li>\n<li><strong>Database Design</strong>: <strong>SQL Server</strong> or <strong>PostgreSQL</strong> schema modeling and optimization.</li>\n</ul>\n<h4>Business &amp; Domain Knowledge</h4>\n<ul>\n<li><strong>E-commerce Workflows</strong>: Product catalog, pricing, inventory, checkout.</li>\n<li><strong>B2B Commerce</strong>: Understanding of business customer journeys, bulk ordering, and account-based pricing.</li>\n</ul>\n<h4>Secondary Skills</h4>\n<p><strong>Front-End</strong>:\n- <strong>UI Frameworks</strong>: <strong>Material UI</strong>, <strong>Tailwind CSS</strong>, or <strong>Bootstrap</strong>.\n- <strong>Performance Optimization</strong>: Lazy loading, code splitting, caching strategies.\n- <strong>Accessibility (WCAG)</strong>: Ensuring inclusive design.</p>\n<p><strong>Back-End</strong>:\n- <strong>GraphQL</strong>: For flexible data querying if used in <strong>Optimizely extensions</strong>.\n- <strong>Message Queues</strong>: <strong>RabbitMQ</strong>, <strong>Azure Service Bus</strong> for async processing.\n- <strong>Containerization</strong>: <strong>Docker</strong>, <strong>Kubernetes</strong> for deployment and scaling.</p>\n<h4>Soft Skills</h4>\n<ul>\n<li><strong>Leadership &amp; Collaboration</strong></li>\n<li><strong>Solution Design</strong>: Translating business requirements into technical architecture.</li>\n<li><strong>Code Reviews &amp; Mentorship</strong>: Guiding developers and enforcing best practices.</li>\n<li><strong>Agile Methodology</strong>: Working in sprints, managing backlog, and leading stand-ups.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does <strong>not</strong> charge any fees for job applications. We contact candidates only through our official website or LinkedIn. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "6+ Years",
            "React.js",
            ".NET Core",
            "RESTful API Design"
        ],
        "summary": "Lead Full Stack Developer with 6+ years of experience in React and .NET, specializing in e-commerce systems and technical leadership."
    },
    {
        "job_title": "Full Stack Developer (Angular+Nodejs)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26107",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Position</strong>: Full Stack Developer (Angular+Nodejs)\n<strong>Closing Date</strong>: 26, Dec 2025\n<strong>Published</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h2>Brief Description</h2>\n<p>The full-stack software engineer’s primary job role will be to design and develop solutions using NodeJS and related technologies. This includes developing backend services and corresponding client-side counterparts.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Develop, test, and maintain high-quality web applications using Angular (version 16+).</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Ensure the technical feasibility of UI/UX designs.</li>\n<li>Participate in code reviews, providing constructive feedback to peers.</li>\n<li>Troubleshoot and debug applications, ensuring optimal performance.</li>\n<li>Stay up-to-date with emerging trends and technologies in front-end development.</li>\n<li>Mentor and guide junior developers, fostering a collaborative and productive work environment.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Minimum of 4 years of professional experience in front-end development.</li>\n<li>Strong proficiency in Angular (version 16+) and related technologies.</li>\n<li><strong>Core Technologies</strong>: Node JS, Nest JS, Kafka, Redis, JavaScript, HTML, CSS.</li>\n<li>RESTful API integration.</li>\n<li>Experience working with Docker and containerized applications.</li>\n<li>Experience working with Kubernetes or other container orchestration tools.</li>\n<li>Hands-on knowledge and understanding of AWS environments.</li>\n<li>Experience in full-stack development.</li>\n<li>Knowledge of RDBMS and Document Database.</li>\n<li>Experience with Agile and Scrum development methodologies.</li>\n<li>Exposure to continuous integration (CI/CD).</li>\n<li>Knowledge of version control systems such as Git and TFS.</li>\n<li>Good analytical and problem-solving skills.</li>\n<li>Up-to-date knowledge of latest technologies, tools, and platforms.</li>\n<li>Ability to complete tasks with minimum supervision.</li>\n<li>Ability to play a leadership role.</li>\n</ul>\n<h2>Secondary Skills</h2>\n<ul>\n<li>Knowledge in Laravel is an add-on.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are conducted through official channels. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "4+ Years",
            "Angular",
            "Node JS",
            "Nest JS"
        ],
        "summary": "Seeking a Full Stack Developer with 4+ years of experience in Angular and Node.js to design and develop scalable web applications. Requires expertise in full-stack technologies, Agile methodologies, and cloud environments."
    },
    {
        "job_title": "Senior DotNet Developer + Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/26106",
        "location": "Technopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2><strong>Company Information</strong></h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India - 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2><strong>Job Title</strong></h2>\n<p>Senior DotNet Developer + Azure</p>\n<h2><strong>Key Dates</strong></h2>\n<ul>\n<li><strong>Closing Date:</strong> 26, Dec 2025</li>\n<li><strong>Published On:</strong> 19, Dec 2025</li>\n</ul>\n<h2><strong>Contact</strong></h2>\n<ul>\n<li><strong>Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></li>\n<li><strong>Working Hours:</strong> 12:00 PM - 9:00 PM</li>\n</ul>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Design, develop, enhance, document, and maintain robust applications using <strong>.NET Core 6/8+</strong>, <strong>C#</strong>, <strong>REST APIs</strong>, <strong>T-SQL</strong>, and modern <strong>JavaScript/jQuery</strong></li>\n<li>Integrate and support third-party APIs and external services</li>\n<li>Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack</li>\n<li>Identify, prioritize, and execute tasks throughout the <strong>Software Development Life Cycle (SDLC)</strong></li>\n<li>Participate in <strong>Agile/Scrum ceremonies</strong> and manage tasks using <strong>Jira</strong></li>\n<li>Understand technical priorities, architectural dependencies, risks, and implementation challenges</li>\n<li>Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability</li>\n</ul>\n<h2><strong>Preferred Skills</strong></h2>\n<ul>\n<li><strong>8+ years</strong> of hands-on development experience with:</li>\n<li><strong>C#</strong>, <strong>.NET Core 6/8+</strong>, <strong>Entity Framework / EF Core</strong></li>\n<li><strong>JavaScript</strong>, <strong>jQuery</strong>, <strong>REST APIs</strong></li>\n<li>Expertise in <strong>MS SQL Server</strong> (Complex SQL queries, Stored Procedures, Views, Functions, etc.)</li>\n<li>Skilled in unit testing with <strong>XUnit</strong>, <strong>MSTest</strong></li>\n<li>Strong software design patterns, system architecture, and scalable solution design</li>\n<li>Leadership in technical mentorship and team ownership</li>\n<li>Problem-solving and debugging capabilities</li>\n<li>Code reusability, testability, and efficiency</li>\n<li>Framework and shared library development</li>\n<li>Technical documentation and communication</li>\n<li><strong>Microservices</strong> and <strong>Service-Oriented Architecture (SOA)</strong></li>\n<li><strong>API Integrations</strong></li>\n</ul>\n<h2><strong>Azure Cloud Experience (2+ years)</strong></h2>\n<ul>\n<li><strong>Azure Functions</strong>, <strong>Durable Functions</strong>, <strong>Service Bus</strong>, <strong>Event Grid</strong>, <strong>Storage Queues</strong></li>\n<li><strong>Blob Storage</strong>, <strong>Azure Key Vault</strong>, <strong>SQL Azure</strong></li>\n<li><strong>Application Insights</strong>, <strong>Azure Monitoring</strong></li>\n</ul>\n<h2><strong>Secondary Skills</strong></h2>\n<ul>\n<li>Familiarity with <strong>AngularJS</strong>, <strong>ReactJS</strong>, and front-end frameworks</li>\n<li>Experience with <strong>Azure API Management (APIM)</strong></li>\n<li>Knowledge of <strong>Azure Containerization</strong> (AKS/Kubernetes)</li>\n<li>Experience with <strong>Azure Data Factory (ADF)</strong> and <strong>Logic Apps</strong></li>\n<li>Exposure to <strong>Application Support</strong> and operational monitoring</li>\n<li><strong>Azure DevOps</strong> - CI/CD pipelines (Classic / YAML)</li>\n</ul>\n<h2><strong>Application Instructions</strong></h2>\n<p>Interested candidates should email their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are through the official website, LinkedIn, or the HR email. Report any suspicious activity to <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "C#",
            "Azure"
        ],
        "summary": "Senior DotNet Developer with 8+ years of experience in .NET Core, C#, and Azure cloud services. Leads scalable solution design, API integrations, and cross-functional team collaboration."
    },
    {
        "job_title": "ITES - Data Analyst / Customer Support",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26105",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Job Posting: Data Analyst / Customer Support</h2>\n<p><strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Location:</strong> Kochi\n<strong>Website:</strong> <a href=\"http://www.pitsolutions.com\">http://www.pitsolutions.com</a>\n<strong>Closing Date:</strong> 31, Dec 2025\n<strong>Published Date:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@pitsolutions.com\">careers@pitsolutions.com</a></p>\n<h3>About the Role</h3>\n<p>PIT Solutions is excited to welcome experienced graduates to join our ITES team! If you have strong communication skills and solid knowledge of MS Excel, we’d love to hear from you.</p>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> 1-4 Years</li>\n<li><strong>Qualification:</strong> Degree in any discipline</li>\n</ul>\n<h3>Key Skills</h3>\n<ul>\n<li>Strong communication and interpersonal abilities</li>\n<li>Excellent knowledge of MS Office, especially MS Excel (Pivot Tables, Lookup Functions, Macros)</li>\n<li>Analytical thinking and problem-solving mindset</li>\n<li>Ability to work under pressure and meet deadlines</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong communication and interpersonal abilities</li>\n<li>Excellent knowledge of MS Office, especially MS Excel (Pivot Tables, Lookup Functions, Macros)</li>\n<li>Analytical thinking and problem-solving mindset</li>\n<li>Ability to work under pressure and meet deadlines</li>\n</ul>",
        "tags": [
            "1-4 Years",
            "MS Excel",
            "Communication Skills",
            "Analytical Thinking"
        ],
        "summary": "Data Analyst/Customer Support role at PIT Solutions requiring 1-4 years of experience, Excel proficiency, and strong communication skills."
    },
    {
        "job_title": "Video Editing Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/26104",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>About Us</h2>\n<p>ZenturioTech (P) Ltd is a growing startup located at STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581. Visit our website at <a href=\"https://zenturiotech.com\">zenturiotech.com</a> to learn more.</p>\n<h2>What You'll Be Doing</h2>\n<ul>\n<li>Edit short-form and long-form videos for social media, marketing campaigns, and brand storytelling</li>\n<li>Create engaging content across platforms (Instagram, YouTube, LinkedIn, reels/shorts, etc.)</li>\n<li>Assist in planning, scripting, and executing content ideas</li>\n<li>Add animations, transitions, subtitles, and basic motion graphics to videos</li>\n<li>Collaborate with the marketing team to maintain brand style and messaging</li>\n<li>Stay updated on trends and bring fresh creative ideas to the table</li>\n</ul>\n<h2>You're a Great Fit If You</h2>\n<ul>\n<li>Have a passion for video editing, storytelling, and digital content</li>\n<li>Know the basics of editing tools (<strong>Premiere Pro / Final Cut Pro / Cap Cut / DaVinci Resolve</strong>)</li>\n<li>Are active on social media and understand trending content formats</li>\n<li>Have a creative mindset and strong attention to detail</li>\n<li>Are proactive, curious, and eager to learn</li>\n<li>Can handle feedback positively and improve quickly</li>\n</ul>\n<h2>Additional Advantage</h2>\n<ul>\n<li>Interest or basic skills in content creation (idea generation, scripting, captions, storytelling)</li>\n<li>Ability to think beyond editing and contribute creative content ideas</li>\n<li>Understanding of what makes content engaging on social media platforms</li>\n</ul>\n<h2>Why Join Us?</h2>\n<ul>\n<li>Be part of an exciting startup creative journey</li>\n<li>Work directly with the marketing and creative team</li>\n<li>Massive hands-on experience and fast learning curve</li>\n<li>Freedom to experiment with ideas and grow your content skills</li>\n<li>Flexible, fun, and creator-friendly work culture</li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Closing Date:</strong> 10, Jan 2026\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Email:</strong> <a href=\"mailto:admin@zenturiotech.com\">admin@zenturiotech.com</a></p>\n<p>Ready to create amazing content with us? Drop your resume or share your portfolio link. Let’s build something impactful!</p>",
        "tags": [
            "0-1 Years",
            "Premiere Pro",
            "Final Cut Pro",
            "DaVinci Resolve"
        ],
        "summary": "ZenturioTech seeks a Video Editing Trainee to create engaging social media content using editing tools. Ideal candidate has basic editing skills and a creative mindset."
    },
    {
        "job_title": ".NET Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26103",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>Polus Solutions (P) Ltd</h2>\n<p>12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\n<a href=\"https://www.polussolutions.com\">Company Website</a></p>\n<h3>.NET Developer</h3>\n<p><strong>Closing Date:</strong> 29, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a></p>\n<h4>About the Role</h4>\n<p>Polus Solutions is seeking a highly experienced <strong>.NET Developer</strong> with deep expertise in <strong>Microsoft SQL Server</strong> and enterprise-grade backend systems. This role requires strong technical leadership and hands-on development capabilities. Experience in the <strong>travel and booking domain</strong> is a strong plus.</p>\n<h4>Key Responsibilities</h4>\n<ul>\n<li>Design, develop, and maintain scalable, high-performance applications using <strong>.NET Core</strong> and <strong>C#</strong>.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Write clean, efficient, and testable code following best practices.</li>\n<li>Perform code reviews, debugging, and troubleshooting to ensure software quality.</li>\n<li>Work with databases (<strong>SQL Server</strong>, <strong>MySQL</strong>, or other RDBMS) to build efficient data-driven applications.</li>\n<li>Participate in the full software development life cycle (SDLC), from requirements gathering to deployment and support.</li>\n<li>Stay updated with the latest <strong>.NET ecosystem</strong> trends and recommend improvements where necessary.</li>\n</ul>\n<h4>Required Skills &amp; Qualifications</h4>\n<ul>\n<li><strong>3–6 years</strong> of professional software development experience.</li>\n<li>Strong knowledge of <strong>.NET Core</strong> and <strong>C#</strong>.</li>\n<li>Good understanding of <strong>OOP concepts</strong>, design patterns, and best coding practices.</li>\n<li>Experience in <strong>Web API development</strong> and integration.</li>\n<li>Hands-on experience with <strong>Entity Framework / EF Core</strong>.</li>\n<li>Proficiency in <strong>SQL</strong> and working with relational databases.</li>\n<li>Familiarity with version control systems (e.g., <strong>Git</strong>).</li>\n</ul>\n<h4>Application Instructions</h4>\n<p>Send your resume to <strong>careers@polussolutions.com</strong> with the subject line: <strong>“.NET Developer - [Your Name]”</strong>.</p>",
        "tags": [
            "3–6 Years",
            ".NET Core",
            "C#",
            "SQL Server"
        ],
        "summary": "Polus Solutions seeks a .NET Developer with 3–6 years of experience in .NET Core, C#, and SQL Server. The role involves building scalable enterprise applications and requires expertise in backend systems."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26102",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<p><strong>Polus Solutions (P) Ltd</strong>\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum, Kerala, India - 695581\n<a href=\"https://www.polussolutions.com\">Company Website</a></p>\n<p><strong>Job Title:</strong> Business Development Executive\n<strong>Closing Date:</strong> 29, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a></p>\n<h3>Role Overview</h3>\n<p>Business Development teams are the cornerstone of any successful organisation. Polus is seeking driven, proactive, and self-motivated individuals to join our team and play a key role in expanding our business footprint.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead generation, outreach, and appointment setting in a <strong>hunter role</strong>.</li>\n<li>Identify and engage potential clients through <strong>cold calls, emails, and LinkedIn outreach</strong>.</li>\n<li>Research and qualify leads based on company goals, target industries, and ICP criteria.</li>\n<li>Coordinate meetings and discovery sessions for the <strong>US sales team</strong>.</li>\n<li>Maintain follow-ups with prospects until handoff to the closing team.</li>\n<li>Track outreach activities via CRM tools and ensure accurate data entry.</li>\n<li>Attend virtual events to gather market insights and identify lead opportunities.</li>\n<li>Provide weekly reports on pipeline activity, outreach metrics, and campaign effectiveness.</li>\n<li>Collaborate with the marketing team to refine messaging and outreach strategies.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>2–5 years</strong> of Business Development experience in the <strong>IT industry</strong>.</li>\n<li>Bachelor’s degree in a relevant field.</li>\n<li>Excellent <strong>communication and interpersonal skills</strong>.</li>\n<li>Proven experience in <strong>cold calling, email, and LinkedIn outreach</strong>.</li>\n<li>Strong ability to <strong>research markets, identify decision-makers, and qualify leads</strong>.</li>\n<li>Experience in <strong>requirement analysis</strong> and basic <strong>proposal coordination</strong>.</li>\n<li>Ability to <strong>coordinate meetings across time zones</strong> (US focus).</li>\n<li>Highly organised, detail-oriented, and data-driven.</li>\n</ul>\n<h3>Key Skills</h3>\n<ul>\n<li><strong>Lead Generation &amp; Prospecting</strong>: Multi-channel outreach to connect with decision-makers.</li>\n<li><strong>Strategic Partnership Research</strong>: Build databases of potential partners.</li>\n<li><strong>Appointment Setting</strong>: Book meetings for the US sales team.</li>\n<li><strong>CRM Management</strong>: Maintain up-to-date pipeline records.</li>\n<li><strong>Digital Marketing Support</strong>: Enhance social media and SEO efforts.</li>\n<li><strong>Event Intelligence</strong>: Attend and report insights from virtual events.</li>\n</ul>\n<h3>Work Details</h3>\n<ul>\n<li><strong>Work Timing:</strong> 4:00 PM to 12:00 AM IST (Hybrid)</li>\n<li><strong>Location:</strong> Hybrid (remote/in-office)</li>\n<li><strong>Reporting To:</strong> Business Development Manager / Head of Sales</li>\n</ul>\n<p><strong>Application Instructions:</strong>\nSend your resume to <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a> with the subject line: <strong>Business Development Executive - [Your Name]</strong>.</p>",
        "tags": [
            "2-5 Years",
            "Business Development (IT)",
            "Lead Generation",
            "CRM Management"
        ],
        "summary": "A Business Development Executive role at Polus Solutions focuses on lead generation, appointment setting, and US market outreach. Requires 2-5 years of IT industry experience and strong CRM management skills."
    },
    {
        "job_title": "Technical Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26101",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>Polus Solutions (P) Ltd</h2>\n<p><strong>Address:</strong> 12B, Carnival Technopark, Technopark, Kazhakuttam, Trivandrum, Kerala, India - 695581\n<strong>Website:</strong> <a href=\"https://www.polussolutions.com\">https://www.polussolutions.com</a>\n<strong>Closing Date:</strong> 29, Dec 2025\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@polussolutions.com\">careers@polussolutions.com</a></p>\n<h3>Role Overview</h3>\n<p>Polus is seeking <strong>Technical Analysts</strong> to deliver post-implementation support and solutions to global customers. This role requires innovation, adaptability, and a commitment to customer success through timely and effective problem-solving.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Serve as the <strong>first point of contact</strong> for customers.</li>\n<li>Provide <strong>Level 2 technical support</strong> using diagnostic techniques to resolve common issues.</li>\n<li>Own issues <strong>end-to-end</strong>, escalating complex problems to Level 3 support when necessary.</li>\n<li>Adhere to <strong>SLA standards</strong> and follow Service Management processes (Incident, Problem, Change, Release, and Service Request management).</li>\n<li>Handle day-to-day operations including <strong>incident resolution, problem analysis, change management, and service requests</strong>.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in <strong>IT Service Management</strong> (Incident/Problem/Change/SR management).</li>\n<li>Proficiency in ticketing tools like <strong>ServiceNow</strong> or <strong>Jira</strong>.</li>\n<li>Strong knowledge of <strong>SQL/PL SQL</strong> and database fundamentals.</li>\n<li>Hands-on experience in <strong>database monitoring</strong>.</li>\n<li>Basic understanding of <strong>Java/JEE</strong>.</li>\n<li><strong>Analytical reasoning</strong> and <strong>lateral thinking</strong> capabilities.</li>\n<li>Excellent <strong>communication</strong> and <strong>customer handling</strong> skills.</li>\n<li><strong>ITIL V3/V4 certification</strong> is a plus.</li>\n<li>Willingness to work in <strong>rotational shifts (24/5)</strong>.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> Graduates in BE/BTech (Computer Science or related), MSC Computer Science, MCA, or equivalent.</li>\n<li><strong>Experience:</strong> 1-3 years in IT support.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Send your resume to <strong>careers@polussolutions.com</strong> with the subject line: <strong>Technical Analyst - [Your Name]</strong>.</p>",
        "tags": [
            "1-3 Years",
            "IT Service Management",
            "ServiceNow/Jira",
            "SQL/PL SQL"
        ],
        "summary": "Technical Analyst role at Polus Solutions requires 1-3 years of IT support experience, focusing on customer service, incident resolution, and database management with tools like ServiceNow and SQL."
    },
    {
        "job_title": "Senior Infrastructure Engineer – Linux",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26100",
        "location": "Technopark",
        "closing_date": "07 Jan 2026",
        "job_description": "<h2>Senior Infrastructure Engineer – Linux</h2>\n<p><strong>Location:</strong> Thiruvananthapuram / Kochi\n<strong>Company:</strong> PIT Solutions (P) Ltd\n<strong>Website:</strong> <a href=\"http://www.pitsolutions.com\">http://www.pitsolutions.com</a>\n<strong>Contact Email:</strong> careers@pitsolutions.com\n<strong>Closing Date:</strong> 07, Jan 2026\n<strong>Published Date:</strong> 19, Dec 2025</p>\n<h3>About the Role</h3>\n<p>We seek a <strong>L4 Senior Infrastructure Architect</strong> with deep expertise in <strong>Linux systems</strong>, <strong>OpenStack cloud platforms</strong>, and <strong>open-source hosting environments</strong>. This senior individual contributor role focuses on architecture, complex problem-solving, and handling <strong>P0/P1 incidents</strong>.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Architect, configure, and manage <strong>multi-tenant web hosting environments</strong> using WHM/cPanel, Cloud Linux, LiteSpeed, and related technologies.</li>\n<li>Perform advanced WHM administration: account provisioning, DNS configuration, security hardening, and backup strategy design.</li>\n<li>Manage cPanel environments end-to-end: domain management, SSL/AutoSSL setup, database administration, and resource optimization.</li>\n<li>Configure mail servers (Exim, Dovecot) with spam filtering, DKIM/SPF/DMARC setup, and secure mail transfer.</li>\n<li>Troubleshoot complex issues involving Apache/LiteSpeed, PHP-FPM, MySQL/MariaDB, DNS, and performance bottlenecks.</li>\n<li>Execute OS patching, kernel updates, PHP version upgrades, and CMS/plugin updates.</li>\n<li>Implement hosting security controls: ModSecurity/WAF rules, malware scanning, and IP filters.</li>\n<li>Ensure high availability via monitoring, log analysis, and capacity planning.</li>\n<li>Lead P0/P1 incident response, perform RCA, and implement corrective actions.</li>\n<li>Oversee automated backup/restore processes and disaster recovery readiness.</li>\n<li>Support CMS platforms (WordPress, Drupal, Joomla, Magento) across hosting environments.</li>\n<li>Drive automation and continuous improvement aligned with PITS’ Kaizen principles.</li>\n</ul>\n<h3>People &amp; Collaboration</h3>\n<ul>\n<li>Mentor junior engineers and provide technical direction.</li>\n<li>Collaborate with developers for deployment and performance optimization.</li>\n<li>Partner with cybersecurity and product teams for secure architecture design.</li>\n<li>Act as escalation point for complex production incidents.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>7–10 years</strong> of Linux systems engineering and cloud infrastructure experience.</li>\n<li>Deep proficiency in <strong>Linux (Ubuntu, CentOS, RHEL)</strong>, <strong>OpenStack services</strong>, <strong>Apache/Nginx</strong>, <strong>MySQL/MariaDB</strong>, and CMS platforms.</li>\n<li>Strong understanding of networking (DNS, VLANs, SSL/TLS) and DevOps tools (Docker, Ansible, Terraform).</li>\n<li>Security hardening experience and hybrid/multi-cloud architecture design.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Certifications: <strong>RHCE</strong>, <strong>OpenStack Administrator</strong>, <strong>AWS/Azure Architect</strong>.</li>\n<li>Experience with <strong>containerization</strong> (Docker, Kubernetes).</li>\n<li>Exposure to monitoring tools (ELK, Prometheus, Grafana).</li>\n<li>Familiarity with compliance frameworks (ISO27001, SOC2, PCI DSS).</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Excellent communication and documentation abilities.</li>\n<li>Ability to lead cross-functional teams and manage complex environments.</li>\n<li>Passion for open-source technologies and continuous learning.</li>\n</ul>",
        "tags": [
            "7-10 Years",
            "Linux",
            "OpenStack",
            "Docker"
        ],
        "summary": "Senior Linux infrastructure engineer with OpenStack expertise, driving cloud architecture, incident resolution, and hosting environment optimization."
    },
    {
        "job_title": "Digital Marketing Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/26099",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<p><strong>ZenturioTech (P) Ltd</strong></p>\n<p><strong>Location</strong>: STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website</strong>: <a href=\"https://zenturiotech.com\">https://zenturiotech.com</a>\n<strong>Closing Date</strong>: 10, Jan 2026\n<strong>Job Published</strong>: 19, Dec 2025\n<strong>Contact Email</strong>: <a href=\"mailto:admin@zenturiotech.com\">admin@zenturiotech.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>Digital Marketing Trainee at a growing tech startup in Technopark, Trivandrum. Ideal for creative thinkers passionate about social media, SEO, and digital campaigns.</p>\n<h3><strong>What You’ll Be Doing</strong></h3>\n<ul>\n<li>Assist in planning and executing digital marketing campaigns across platforms.</li>\n<li>Manage social media handles and create engaging, share-worthy content.</li>\n<li>Support social media planning by suggesting post ideas, captions, reels, and content themes.</li>\n<li>Help maintain a basic content calendar and ensure consistent posting.</li>\n<li>Stay updated with social media trends and platform features to support content creation.</li>\n<li>Conduct keyword and SEO research to improve website visibility.</li>\n<li>Track, analyze, and report on campaign performance and audience insights.</li>\n<li>Support content marketing, email campaigns, and online advertising efforts.</li>\n<li>Collaborate with the team to brainstorm fresh ideas that drive engagement and growth.</li>\n</ul>\n<h3><strong>You’re a Great Fit If You</strong></h3>\n<ul>\n<li>Have a basic understanding of digital marketing concepts (SEO, social media, analytics).</li>\n<li>Have an interest in social media management and content creation.</li>\n<li>Are familiar with tools like Google Analytics, Canva, or any social media scheduling platforms.</li>\n<li>Have strong communication skills and a knack for creativity.</li>\n<li>Love experimenting, learning fast, and taking ownership of your ideas.</li>\n<li>Thrive in a startup environment where no two days look the same.</li>\n</ul>\n<h3><strong>Why Join Us?</strong></h3>\n<ul>\n<li>Work on real-world campaigns that make an impact.</li>\n<li>Learn directly from experienced marketers and mentors.</li>\n<li>Gain hands-on exposure to multiple marketing tools and strategies.</li>\n<li>Certificate of completion or clear growth path within the company.</li>\n<li>A creative, collaborative, and growth-driven work culture.</li>\n</ul>\n<p><strong>Ready to kickstart your digital marketing journey?</strong>\nSend your resume or reach out directly at <a href=\"mailto:admin@zenturiotech.com\">admin@zenturiotech.com</a>.</p>",
        "tags": [
            "Entry Level",
            "SEO",
            "Social Media Management",
            "Google Analytics"
        ],
        "summary": "ZenturioTech seeks a Digital Marketing Trainee to execute campaigns, manage social media, and improve SEO. Gain hands-on experience in a dynamic startup environment with mentorship and growth opportunities."
    },
    {
        "job_title": "TECHNOLOGY ENGINEER (6+ YEARS)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/26098",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>REIZEND (P) Ltd</h2>\n<p><strong>SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581</strong>\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<h3>TECHNOLOGY ENGINEER (6+ YEARS)</h3>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>\n<h4>Brief Description</h4>\n<ul>\n<li><strong>Location:</strong> Trivandrum</li>\n<li><strong>Experience:</strong> 6+ Years</li>\n<li><strong>Salary:</strong> 18 - 28 LPA</li>\n<li><strong>Job Types:</strong> Full-time, Permanent</li>\n</ul>\n<h4>Responsibilities</h4>\n<ul>\n<li><strong>Designing technology systems:</strong> Plan and design technology solutions, collaborating with design and development teams.</li>\n<li><strong>Communicating:</strong> Translate system requirements to software teams and stakeholders, emphasizing solution value.</li>\n<li><strong>Managing Stakeholders:</strong> Align with clients to understand system vision and manage expectations.</li>\n<li><strong>Architectural Oversight:</strong> Develop scalable AI/ML and data science architectures, ensuring security, performance, and best practices.</li>\n<li><strong>Problem Solving:</strong> Troubleshoot technical issues in systems.</li>\n<li><strong>Ensuring Quality:</strong> Validate systems against security/quality standards and business goals.</li>\n<li><strong>Project management:</strong> Decompose project requirements and organize technical team workloads.</li>\n<li><strong>Tool &amp; Framework Expertise:</strong> Utilize LLMs, TensorFlow, PyTorch, Apache Spark, cloud platforms (AWS, Azure, GCP), web frameworks, and DevOps.</li>\n<li><strong>Continuous Improvement:</strong> Stay updated on AI/ML, data science, and web application advancements.</li>\n</ul>\n<h4>Preferred Skills</h4>\n<ol>\n<li>AI/ML frameworks (TensorFlow, PyTorch, Keras, scikit-learn)</li>\n<li>Self-hosted/managed LLMs</li>\n<li>NLP tools (SpaCy, NLTK, Hugging Face) and Computer Vision (OpenCV)</li>\n<li>Back-end frameworks (Django, Spring Boot, Node.js) and RESTful/GraphQL APIs</li>\n<li>Microservices, serverless, event-driven architectures; design patterns</li>\n<li>Front-end frameworks (React, Angular, Vue.js) and UX/UI principles</li>\n<li>SQL/NoSQL databases (PostgreSQL, MongoDB) and caching (Redis)</li>\n<li>Data processing (Apache Spark, Hadoop, Pandas)</li>\n<li>Data warehouses (Snowflake, BigQuery) and ETL tools (Airflow)</li>\n<li>Visualization tools (Tableau, Power BI)</li>\n<li>Model deployment (TensorFlow Serving, AWS SageMaker)</li>\n<li>MLOps tools (MLflow, Kubeflow)</li>\n<li>CI/CD, IaC, Cloud Native toolchains</li>\n<li>Security principles (firewalls, TLS/SSL)</li>\n<li>API Gateway, service mesh (Istio), NGINX</li>\n</ol>\n<p><strong>Submit your updated resume to:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>",
        "tags": [
            "6+ Years",
            "TensorFlow",
            "PyTorch",
            "AWS"
        ],
        "summary": "Lead AI/ML and data science solutions with architectural oversight, stakeholder management, and expertise in cloud-native tools. Requires 6+ years of experience in full-stack development and deployment."
    },
    {
        "job_title": "SENIOR TECHNOLOGY ANALYST (6+ YEARS)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/26097",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>REIZEND (P) Ltd</h2>\n<p><strong>SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581</strong>\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<h3>SENIOR TECHNOLOGY ANALYST (6+ YEARS)</h3>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 19, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>\n<p><strong>Location:</strong> Trivandrum\n<strong>Work Mode:</strong> Work from office\n<strong>Experience Required:</strong> 6+ Years\n<strong>Salary:</strong> 18 - 28 LPA\n<strong>Job Type:</strong> Full-time, Permanent</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Designing technology systems:</strong> Plan and design technology solutions, collaborating with development teams.</li>\n<li><strong>Communicating:</strong> Translate system requirements to developers and stakeholders, emphasizing solution value.</li>\n<li><strong>Managing Stakeholders:</strong> Align with clients to understand system vision and manage expectations.</li>\n<li><strong>Architectural Oversight:</strong> Develop scalable AI/ML and data science architectures with security and performance focus.</li>\n<li><strong>Problem Solving:</strong> Troubleshoot technical issues in systems.</li>\n<li><strong>Ensuring Quality:</strong> Validate systems against security standards and business goals.</li>\n<li><strong>Project Management:</strong> Decompose project requirements and organize technical team workloads.</li>\n<li><strong>Tool &amp; Framework Expertise:</strong> Utilize LLMs, TensorFlow, PyTorch, Apache Spark, cloud platforms (AWS, Azure, GCP), and DevOps practices.</li>\n<li><strong>Continuous Improvement:</strong> Stay updated on AI/ML, data science, and web application advancements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ol>\n<li>Proficiency in AI/ML frameworks (TensorFlow, PyTorch, Keras, scikit-learn).</li>\n<li>Experience with self-hosted/managed LLMs.</li>\n<li>NLP tools (SpaCy, NLTK, Hugging Face) and Computer Vision (OpenCV).</li>\n<li>Back-end frameworks (Django, Spring Boot, Node.js) and API development.</li>\n<li>Microservices, serverless, and design patterns (Factory, Singleton, Observer).</li>\n<li>Front-end frameworks (React, Angular, Vue.js) and UX/UI principles.</li>\n<li>SQL/NoSQL databases (PostgreSQL, MongoDB) and caching (Redis).</li>\n<li>Big data tools (Apache Spark, Hadoop, Pandas).</li>\n<li>Data warehouses (Snowflake, BigQuery) and ETL tools (Airflow).</li>\n<li>Visualization tools (Tableau, Power BI).</li>\n<li>Model deployment (TensorFlow Serving, FastAPI, AWS SageMaker).</li>\n<li>MLOps tools (MLflow, Kubeflow).</li>\n<li>CI/CD, IaC, and Cloud Native toolchains.</li>\n<li>Security principles (firewalls, IAM, TLS/SSL).</li>\n<li>API Gateway and traffic management (NGINX, Istio).</li>\n</ol>\n<p><strong>Submit your resume to:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>",
        "tags": [
            "6+ Years",
            "TensorFlow",
            "PyTorch",
            "AWS"
        ],
        "summary": "Senior Technology Analyst (6+ Years) in Trivandrum. Designs AI/ML systems, manages stakeholders, and ensures quality in data-driven solutions."
    },
    {
        "job_title": "Techno-Functional Consultant - Oracle Fusion HCM (Senior)",
        "company": "Naga Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/26096",
        "location": "Technopark",
        "closing_date": "02 Jan 2026",
        "job_description": "<h2>About the Role</h2>\n<p>Naga Info Solutions (P) Ltd is seeking a <strong>Senior Techno-Functional Consultant - Oracle Fusion HCM</strong> for a high-impact project in Bangalore. The role demands expertise in Oracle HCM Cloud functional modules and technical capabilities in integrations, reporting, data migration, and system enhancements.</p>\n<h3>Location</h3>\n<p>Bangalore (BCIT)</p>\n<h3>Experience Required</h3>\n<p><strong>8+ years</strong> of experience as a Techno-Functional Consultant in Oracle Fusion HCM.</p>\n<h3>Role Highlights</h3>\n<ul>\n<li>Opportunity to work on complex, enterprise-scale Oracle Fusion HCM implementations</li>\n<li>Hands-on involvement in functional configuration and technical development</li>\n<li>Exposure to multiple HCM modules and advanced cloud integrations</li>\n<li>Collaborative environment with HR and IT stakeholders</li>\n<li>Competitive salary package</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Collaborate with business stakeholders to gather HR/payroll process requirements</li>\n<li>Translate requirements into functional specifications for Oracle Fusion HCM modules</li>\n<li>Configure Core HR, Recruitment, Talent, and other modules</li>\n<li>Ensure compliance with policies, regulations, and standards</li>\n<li>Develop reports, dashboards, and workflows using OTBI, BI Publisher, Fast Formulas</li>\n<li>Design integrations via REST/SOAP APIs, HCM Extracts, HDL/FDI</li>\n<li>Manage end-to-end data migrations and validations</li>\n<li>Conduct unit/system/UAT testing</li>\n<li>Troubleshoot functional/technical issues and resolve incidents per SLA</li>\n<li>Deliver training and documentation</li>\n<li>Collaborate with HR/IT teams for system improvements</li>\n<li>Stay updated on Oracle Fusion HCM patches/releases</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Technical Skills</strong>:\n- Oracle HCM tools: BI Publisher, OTBI, HCM Extracts, Fast Formulas\n- Oracle HCM Cloud tools: HDL/HSDL, Application Security, Workflows/Alerts, Page Customizations\n- Data migration from legacy systems\n- Oracle Cloud integrations (REST/SOAP, Apex, ATP)\n- Oracle Integration Cloud (OIC)\n- SaaS extensions via VBCS\n- SQL/PL-SQL and debugging tools</p>\n<p><strong>Functional Skills</strong>:\n- HR business processes and workflows\n- Core HR/Recruitment modules\n- Additional modules: Absence, Payroll, Talent\n- Security roles, privileges, Areas of Responsibility (AOR)</p>\n<p><strong>Good to Have</strong>:\n- Compensation, Workforce, HR Help Desk, Employee Engagement modules\n- Experience in multiple Oracle HCM implementations\n- Strong communication and stakeholder management skills</p>\n<h3>How to Apply</h3>\n<p>Interested candidates should send their CVs to <strong>mail@nagainfo.com</strong>.</p>",
        "tags": [
            "8+ Years",
            "Oracle HCM Cloud",
            "BI Publisher",
            "REST/SOAP APIs"
        ],
        "summary": "Senior Techno-Functional Consultant for Oracle Fusion HCM with 8+ years of experience in enterprise implementations, integrations, and system enhancements. Requires expertise in Oracle HCM Cloud modules and technical development."
    },
    {
        "job_title": "Product Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26095",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We’re seeking a <strong>Lead Product Designer</strong> to own end-to-end product experiences, raise design standards, and drive outcomes—not just deliver screens. You’ll lead as a design authority for core products, collaborating directly with Product, Engineering, Growth, and Leadership teams. Report to the Head of Design. Apply if you’re a Lead or Senior Designer ready to elevate your career.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>End-to-end product design for key verticals.</li>\n<li>Define UX strategy, drive research, and ship high-quality flows/UI with speed.</li>\n<li>Elevate visual/UI standards across the product ecosystem.</li>\n<li>Influence product roadmap using data, customer insights, and business context.</li>\n<li>Align cross-functionally to simplify ambiguity and ensure design is prioritized.</li>\n<li>Own lean, effective design workflows.</li>\n<li>Mentor junior designers, provide critique, guide hiring, and shape team culture.</li>\n<li>Evolve Way.com’s design system for scalability.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>7–10+ years</strong> of product design experience, with <strong>3+ years</strong> in a lead/senior-lead role.</li>\n<li>Strong portfolio showcasing complex problem-solving, consumer app work, and high-quality UI.</li>\n<li>Proven ability to drive outcomes, not just outputs.</li>\n<li>Comfort with fast-paced environments, ambiguity, and data-driven decisions.</li>\n<li>Experience in discovery, research, prototyping, and iterative testing.</li>\n<li>Expertise in <strong>Figma</strong> and modern design tools.</li>\n<li>Strong communication: direct, clear, and decisive.</li>\n<li>Influence product, engineering, and leadership without compromising clarity.</li>\n<li>Bias for action: move quickly, ship, and iterate.</li>\n</ul>\n<h3>Why You’ll Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with meaningful solutions.</li>\n<li>Dynamic, innovation-driven culture in a fast-paced environment.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/lead-product-designer\">https://waydot.greythr.com/hire/jobs/lead-product-designer</a></p>\n<p><strong>Contact Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "7-10+ Years",
            "Figma",
            "Product Design",
            "Data-Driven Decision Making"
        ],
        "summary": "Lead Product Designer at Way.com, a top US auto super app, to drive end-to-end design, mentor teams, and shape user experiences for 10+ million customers."
    },
    {
        "job_title": "Finance Analyst/Finance Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26094",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p><strong>Finance Executive/Financial Analyst</strong></p>\n<h2>Work Arrangement</h2>\n<p><strong>On-site</strong></p>\n<h2>Employment Type</h2>\n<p><strong>Full-time</strong></p>\n<h2>Role Overview</h2>\n<p>We are seeking a <strong>CA-qualified</strong> Finance Professional with <strong>2–3 years of experience</strong> in <strong>FP&amp;A</strong>, accounting, financial reporting, and reconciliations. The ideal candidate will collaborate closely with businesses, prepare financial statements, manage AR/AP processes, and utilize ERP systems.</p>\n<h2>Key Responsibilities</h2>\n<h3>Financial Planning &amp; Analysis</h3>\n<ul>\n<li>Partner with business units to drive financial analysis and provide performance insights.</li>\n<li>Coordinate and lead annual/quarterly/monthly forecasts.</li>\n<li>Conduct month-close activities and analyze forecast vs. actuals.</li>\n</ul>\n<h3>Financial Accounting &amp; Reporting</h3>\n<ul>\n<li>Prepare monthly, quarterly, and annual financial statements compliant with accounting standards.</li>\n<li>Handle revenue and cost bookings using POC and contract completion methods.</li>\n<li>Perform P&amp;L, balance sheet, and cash flow analysis.</li>\n<li>Maintain general ledger accounts and balance sheet schedules.</li>\n</ul>\n<h3>Reconciliation &amp; Compliance</h3>\n<ul>\n<li>Conduct AP/AR and intercompany reconciliations.</li>\n<li>Assist with statutory, internal, and external audits by submitting documentation timely.</li>\n</ul>\n<h3>Budgeting &amp; Costing</h3>\n<ul>\n<li>Support budget preparation, cash flow forecasts, and variance analysis.</li>\n<li>Prepare cost variation reports and revenue–cost reconciliation for projects.</li>\n</ul>\n<h3>Accounts Payable / Receivable</h3>\n<ul>\n<li>Manage vendor payments, invoice processing, and staff expense claims.</li>\n<li>Track receivables, revenue entries, and client invoices.</li>\n<li>Monitor advances, inventory bookings, asset depreciation, and petty cash.</li>\n</ul>\n<h3>ERP &amp; Tools</h3>\n<ul>\n<li>Work extensively with <strong>SAP/Tally/ERP systems</strong>, <strong>MS Excel (advanced)</strong>, <strong>Power BI</strong>, and <strong>SQL</strong> for reporting and analysis.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Strong knowledge of accounting standards and financial principles.</li>\n<li>Proficiency in <strong>SAP/Tally/ERP applications</strong>.</li>\n<li>Advanced <strong>Excel</strong>, <strong>Power BI</strong>, and <strong>SQL</strong> skills.</li>\n<li>Excellent analytical, reconciliation, and problem-solving abilities.</li>\n<li>Strong attention to detail and accuracy.</li>\n<li>Ability to collaborate with cross-functional teams and meet deadlines.</li>\n</ul>\n<h2>Preferred Experience</h2>\n<ul>\n<li>Strong FP&amp;A experience.</li>\n<li>Financial reporting and project accounting expertise.</li>\n<li>Hands-on AP/AR, bank reconciliation, and intercompany reconciliation.</li>\n<li>Experience preparing audit statements and supporting auditors.</li>\n</ul>\n<h2>Why Join Us?</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super App in the US</strong>.</li>\n<li>Impact <strong>10+ million users</strong> with innovative solutions.</li>\n<li>Dynamic, fast-paced, innovation-driven culture.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Apply Here</h2>\n<p><a href=\"https://waydot.greythr.com/hire/jobs/finance-executive\">Apply Now</a></p>\n<h2>Contact</h2>\n<p><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Closing Date</strong>: 21, Dec 2025\n<strong>Job Published</strong>: 19, Dec 2025</p>",
        "tags": [
            "2-3 Years",
            "SAP/Tally",
            "Power BI",
            "SQL"
        ],
        "summary": "CA-qualified Finance Executive/Analyst with 2-3 years in FP&A, accounting, and ERP systems. Manages financial reporting, analysis, and compliance for a leading auto super app."
    },
    {
        "job_title": "IT System Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26093",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2><strong>Company Overview</strong></h2>\n<p><strong>Way.com</strong> is America’s leading automotive super app, serving over 10 million customers with solutions ranging from auto insurance and parking to EV charging. Leveraging AI, machine learning, and data analytics, we deliver personalized, innovative experiences. Recognized by Bloomberg and ranked #48 on Andreessen Horowitz’s fastest-growing companies list, we’re redefining car ownership.</p>\n<h2><strong>Job Title</strong></h2>\n<p>IT System Engineer</p>\n<h2><strong>Experience Required</strong></h2>\n<p>2–4 years</p>\n<h2><strong>Work Arrangement</strong></h2>\n<p>On-site</p>\n<h2><strong>Employment Type</strong></h2>\n<p>Full-time</p>\n<h2><strong>Role Overview</strong></h2>\n<p>We seek an experienced <strong>IT System Engineer</strong> to manage IT infrastructure, Office 365 administration, and system support. The role involves hands-on work in Linux/Windows environments, networking (Fortigate), cloud deployments (DigitalOcean, OVH), and infrastructure monitoring (Grafana, Zabbix). Opportunities exist to grow into DevOps and automation.</p>\n<h2><strong>Key Responsibilities</strong></h2>\n<ul>\n<li>Provide technical support for hardware, software, and networking issues.</li>\n<li>Maintain IT infrastructure for uptime, performance, and security.</li>\n<li>Administer Office 365 (Exchange Online, Teams, SharePoint, OneDrive).</li>\n<li>Configure Fortigate routers/firewalls and manage VPNs.</li>\n<li>Perform Linux system administration (user management, patching, updates).</li>\n<li>Support Windows environments (installation, configuration, maintenance).</li>\n<li>Deploy and manage cloud VMs on DigitalOcean and OVH.</li>\n<li>Implement infrastructure monitoring with Grafana, Zabbix, or similar tools.</li>\n<li>Maintain IT documentation and collaborate on DevOps automation.</li>\n</ul>\n<h2><strong>Preferred Skills</strong></h2>\n<ul>\n<li>Bachelor’s in Computer Science/IT or related field.</li>\n<li>2–4 years in IT Support/System Administration/Infrastructure Engineering.</li>\n<li>Office 365 administration experience.</li>\n<li>Fortigate networking expertise.</li>\n<li>Linux system administration.</li>\n<li>Cloud VM management (DigitalOcean, OVH).</li>\n<li>Monitoring tools (Grafana, Zabbix).</li>\n<li>Troubleshooting, analytical, and communication skills.</li>\n<li>Willingness to work rotational shifts.</li>\n</ul>\n<h2><strong>Why Join Us?</strong></h2>\n<ul>\n<li>Work for the #1 Auto Super App in the US.</li>\n<li>Impact 10+ million users.</li>\n<li>Dynamic, innovation-driven culture.</li>\n<li>Career growth in a scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2><strong>Contact &amp; Apply</strong></h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/it-system-engineer\">https://waydot.greythr.com/hire/jobs/it-system-engineer</a></li>\n</ul>",
        "tags": [
            "2-4 Years",
            "Office 365 Administration",
            "Fortigate Routers/Firewalls",
            "Linux System Administration"
        ],
        "summary": "An IT System Engineer with 2–4 years of experience in infrastructure management, Office 365, and cloud deployments is sought for a dynamic role at a leading automotive super app, offering growth in DevOps and automation."
    },
    {
        "job_title": "Communication Trainer - English",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26092",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> English Communication Trainer\n<strong>Work Arrangement:</strong> On-site training/WFO\n<strong>Employment Type:</strong> Contract</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced <strong>English Communication Trainer</strong> to deliver offline corporate training programs specifically designed for <strong>Customer Support teams</strong>. The trainer will enhance employees’ communication quality, customer-handling skills, grammar accuracy, and overall service language proficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct <strong>offline communication training</strong> for customer support executives across voice, email, and chat processes.</li>\n<li>Train employees on <strong>professional communication</strong>, <strong>customer empathy</strong>, <strong>tone &amp; clarity</strong>, <strong>neutral accent</strong>, and <strong>grammar usage</strong>.</li>\n<li>Develop and deliver training modules on:</li>\n<li>Spoken English</li>\n<li>Business communication</li>\n<li>Customer handling phrases &amp; scripts</li>\n<li>Call etiquette &amp; soft skills</li>\n<li>Email writing &amp; chat etiquette</li>\n<li>Evaluate learners through role plays, call simulations, mock chats/emails, and assessments.</li>\n<li>Identify communication gaps and create customized training for new hires and existing employees.</li>\n<li>Provide actionable feedback to improve language proficiency, customer interactions, and overall CSAT.</li>\n<li>Track performance, maintain training reports, and coordinate with managers and QA teams for continuous improvement.</li>\n<li>Create an engaging and professional classroom environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>4–7 years</strong> of experience as a Communication Trainer / English Trainer in <strong>BPO</strong>, <strong>Customer Support</strong>, or <strong>Corporate Training</strong>.</li>\n<li>Strong command of spoken and written English with ability to simplify concepts.</li>\n<li>Experience in voice, email, or chat process training (preferred).</li>\n<li>Excellent presentation, facilitation, and coaching skills.</li>\n<li>Ability to handle diverse learners and drive measurable improvement.</li>\n</ul>\n<h3>Preferred Attributes</h3>\n<ul>\n<li>Certification in communication training, <strong>TEFL/TESOL</strong>, or soft skills (added advantage).</li>\n<li>Experience working with customer support KPIs such as <strong>CSAT</strong>, quality scores, <strong>AHT impact</strong>, etc.</li>\n<li>Strong understanding of customer service language, tone, and escalation handling.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer\">https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer</a>\n<strong>Contact Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a></p>",
        "tags": [
            "4-7 Years",
            "English Communication Training",
            "Customer Support Training",
            "Corporate Training"
        ],
        "summary": "English Communication Trainer to enhance customer support teams' communication skills via offline training. Focus on spoken English, customer empathy, and service language proficiency for a leading US auto super app."
    },
    {
        "job_title": "Sales Expert",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26091",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title</h2>\n<p>Sales Expert</p>\n<h2>Work Arrangement</h2>\n<p>On-site</p>\n<h2>Employment Type</h2>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking dynamic, customer-focused <strong>Sales Experts</strong> to join our <strong>Refinance Team</strong>. In this role, you will be the voice of our product — engaging directly with customers, understanding their needs, and helping them choose the best refinance solutions. This is a <strong>B2C sales role</strong>, where communication skills, persuasion, and a passion for sales will make all the difference.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Engage with potential customers through <strong>inbound and outbound calls, emails, and chats</strong>.</li>\n<li>Clearly explain refinance products, features, and benefits to customers.</li>\n<li>Build <strong>trust and rapport</strong> with customers to convert inquiries into successful sales.</li>\n<li>Consistently <strong>achieve individual and team sales targets</strong>.</li>\n<li>Maintain accurate records of customer interactions and transactions in <strong>CRM systems</strong>.</li>\n<li>Collaborate with <strong>Customer Support, Product, and Marketing teams</strong> to ensure a smooth post-sale experience.</li>\n<li>Stay updated on <strong>product knowledge, process updates, and industry trends</strong>.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s or Master’s degree in any discipline (preferably Business or Engineering).</li>\n<li><strong>2–5 years of experience</strong> in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent communication skills in English (verbal and written).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and <strong>experience with CRM tools</strong>.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<h2>Why You Will Love Working with Us</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a></li>\n<li><strong>Apply Now</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/sales-expert\">https://waydot.greythr.com/hire/jobs/sales-expert</a></li>\n</ul>",
        "tags": [
            "2–5 Years",
            "B2C Sales",
            "CRM Tools",
            "Financial Products"
        ],
        "summary": "Sales Experts needed for a B2C refinance team at a leading US auto super app. Requires 2-5 years in sales, CRM proficiency, and financial product experience."
    },
    {
        "job_title": "Senior - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26090",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>About Way.com</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Details</h2>\n<ul>\n<li><strong>Position</strong>: Senior Marketing Designer</li>\n<li><strong>Location</strong>: Trivandrum</li>\n<li><strong>Type</strong>: Full-time/WFO role</li>\n<li><strong>Closing Date</strong>: 21, Dec 2025</li>\n<li><strong>Published Date</strong>: 19, Dec 2025</li>\n<li><strong>Contact Email</strong>: careers@way.com</li>\n<li><strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/senior-marketing-designer\">Senior Marketing Designer Application</a></li>\n</ul>\n<h2>Role Overview</h2>\n<p>We’re seeking a <strong>Senior Marketing Designer</strong> who loves turning ideas into visuals that perform. You’ll design high-impact campaigns, ads, and visuals across platforms — from paid media to social and email — collaborating with the creative, growth, and product teams.</p>\n<h2>Roles and Responsibilities</h2>\n<ul>\n<li>Create digital ad creatives, banners, and social visuals for ongoing campaigns.</li>\n<li>Conceptualize visuals for product launches and seasonal campaigns.</li>\n<li>Design for performance with a balance of creativity and clarity.</li>\n<li>Work with copywriters, growth managers, and product designers.</li>\n<li>Execute designs that fit Way.com’s visual brand and tone.</li>\n<li>Explore motion and storytelling to drive engagement.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>3–5 years</strong> of experience in marketing design or growth design.</li>\n<li>Proficiency in <strong>Figma, Photoshop, Illustrator, and After Effects</strong>.</li>\n<li>Strong sense of layout, typography, and storytelling.</li>\n<li>Understanding of digital marketing and ad metrics.</li>\n<li>A portfolio that shows creativity and an eye for detail.</li>\n<li>Eagerness to learn, collaborate, and grow fast in a creative environment.</li>\n</ul>\n<h2>Why You Will Love Working With Us?</h2>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Apply Here</h2>\n<p><a href=\"https://waydot.greythr.com/hire/jobs/senior-marketing-designer\">Senior Marketing Designer Application</a></p>",
        "tags": [
            "3-5 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Senior Marketing Designer needed to create high-impact campaigns and visuals across platforms. Requires 3-5 years of experience with Figma, Photoshop, and Illustrator at a leading auto super app."
    },
    {
        "job_title": "Lead - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26089",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<p><strong>Way.com India Pvt Ltd</strong></p>\n<p><strong>Position:</strong> Lead - Marketing Designer\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Closing Date:</strong> 21, Dec 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>About Way.com</h3>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Role Overview</h3>\n<p>We’re seeking a <strong>Lead Marketing Designer</strong> — a hands-on creative leader who can turn strategy into striking visuals and campaigns. You’ll lead the creative direction across digital marketing, brand campaigns, and performance ads, guiding a small team of designers while staying close to execution.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead and manage a team of marketing designers.</li>\n<li>Develop and execute creative strategy across paid, owned, and social channels.</li>\n<li>Drive campaign concepts for product launches, seasonal pushes, and partnerships.</li>\n<li>Maintain a consistent visual identity across Way.com’s global marketing ecosystem.</li>\n<li>Partner with Growth, Product, and Content teams to create high-performing visuals.</li>\n<li>Inspire creative excellence and mentor designers to elevate craft quality.</li>\n<li>Balance creativity with marketing performance and data-driven decisions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>6–10 years</strong> of experience in marketing design, art direction, or brand design.</li>\n<li>Proven experience leading creative or design teams.</li>\n<li>Strong portfolio showcasing campaign systems, digital storytelling, and ad design.</li>\n<li>Expertise in <strong>Figma, Photoshop, Illustrator, After Effects / Premiere Pro</strong>.</li>\n<li>Experience in <strong>performance design</strong> and knowledge of CTR, engagement metrics, and creative testing.</li>\n<li>Strong visual storytelling and typography skills.</li>\n<li>A passion for clean, modern, and conversion-friendly design.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/lead-marketing-designer\">https://waydot.greythr.com/hire/jobs/lead-marketing-designer</a></p>",
        "tags": [
            "6–10 Years",
            "Figma",
            "Photoshop",
            "Illustrator"
        ],
        "summary": "Lead creative strategy for global marketing campaigns and mentor a design team. Requires 6–10 years of experience in marketing design with expertise in Figma, Photoshop, and Illustrator."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26088",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<p><strong>Company:</strong> Way.com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a>\n<strong>Job Title:</strong> Manager - Project\n<strong>Closing Date:</strong> 21, Dec 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Application Link:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/project-manager\">Apply Now</a></p>\n<h3>About Us</h3>\n<p>Way.com is America’s leading automotive super app, serving over 10 million customers with solutions for auto insurance, EV charging, parking, and more. Leveraging AI and data analytics, we deliver personalized experiences and are recognized as the top Product in Insurance by UnitQ and ranked 48th on Andreessen Horowitz’s Marketplace list.</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>Project Manager</strong> with <strong>8+ years of experience</strong> to lead strategic projects from initiation to completion. The ideal candidate will demonstrate leadership, domain expertise, and hands-on execution skills to deliver projects within scope, timeline, and budget.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead the full project lifecycle across medium to large-scale initiatives.</li>\n<li>Define and manage project scope, objectives, deliverables, and success criteria.</li>\n<li>Develop detailed project plans with resource allocation, timelines, and budgets.</li>\n<li>Identify risks/dependencies, implement mitigation strategies, and escalate as needed.</li>\n<li>Manage stakeholder relationships with clear communication and alignment.</li>\n<li>Conduct project reviews and report progress, challenges, and solutions to leadership.</li>\n<li>Drive cross-functional collaboration for smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes.</li>\n<li>Mentor junior team members to build project management capabilities.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s/Master’s degree in Engineering, Business Administration, or related fields.</li>\n<li><strong>8+ years</strong> of project management experience in fintech platforms.</li>\n<li>Expertise in Agile, Waterfall, or hybrid methodologies.</li>\n<li>Proficiency in project management tools (MS Project, JIRA, Asana, Trello).</li>\n<li>Strong stakeholder management, leadership, and communication skills.</li>\n<li>Problem-solving and decision-making under pressure.</li>\n<li>Certifications: PMP, PRINCE2, Agile (Scrum Master/SAFe) preferred.</li>\n<li>Experience with tools like MPP.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super App in the US.</li>\n<li>Impact 10+ million users with innovative solutions.</li>\n<li>Dynamic, fast-paced, innovation-driven culture.</li>\n<li>Clear career growth in a rapidly scaling tech company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/project-manager\">https://waydot.greythr.com/hire/jobs/project-manager</a></p>",
        "tags": [
            "8+ Years",
            "Agile",
            "Project Management Tools",
            "PMP Certification"
        ],
        "summary": "Lead complex fintech projects for a top US auto super app. Requires 8+ years, Agile expertise, and strong stakeholder management."
    },
    {
        "job_title": "Team Lead - SEO",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26087",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<p><strong>Way.com</strong> — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Team Lead - SEO</h3>\n<p><strong>Experience:</strong> 9 - 11 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Closing Date:</strong> 21, Dec 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>Role Overview</h3>\n<p>We are seeking a highly skilled <strong>Team Lead, SEO</strong> to spearhead our organic growth initiatives and enhance our search engine presence. In this leadership role, you will drive the development and execution of comprehensive SEO strategies, manage a team of SEO specialists, and collaborate cross-functionally to optimize our digital footprint. If you have a deep understanding of search algorithms, technical SEO, and content strategy, along with a passion for driving results, we want to hear from you!</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies</strong> – Define and implement a robust SEO roadmap, ensuring alignment with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team</strong> – Manage a team of SEO professionals, fostering a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO</strong> – Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management</strong> – Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making</strong> – Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration</strong> – Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization</strong> – Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis</strong> – Conduct SEO audits, monitor competitor strategies, and identify new opportunities to stay ahead in the industry.</li>\n<li><strong>SEO Performance Reporting</strong> – Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in <strong>technical SEO</strong>, <strong>content strategy</strong>, and <strong>link-building</strong>.</li>\n<li>Strong knowledge of <strong>search engine algorithms</strong>, ranking factors, and SEO trends.</li>\n<li>Proficiency in <strong>Google Analytics</strong>, <strong>Google Search Console</strong>, <strong>SEMrush</strong>, <strong>Ahrefs</strong>, <strong>Screaming Frog</strong>, and other SEO tools.</li>\n<li>Strong understanding of <strong>mobile-first indexing</strong>, <strong>Core Web Vitals</strong>, and <strong>structured data</strong> (schema markup).</li>\n<li>Experience with <strong>A/B testing</strong>, <strong>conversion rate optimization (CRO)</strong>, and <strong>SEO for local businesses</strong> (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data to make data-driven decisions.</li>\n<li>Excellent <strong>communication</strong> and <strong>stakeholder management</strong> skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Basic knowledge of <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, and website development principles.</li>\n<li>Understanding of <strong>PPC advertising</strong> and its relationship with organic search.</li>\n<li>Experience working in a <strong>high-growth startup</strong> or fast-paced environment.</li>\n<li>Familiarity with <strong>social media marketing</strong> and its impact on SEO.</li>\n<li>Strong <strong>project management</strong> skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Opportunity to make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/seo-team-lead\">https://waydot.greythr.com/hire/jobs/seo-team-lead</a></p>",
        "tags": [
            "9-11 Years",
            "Technical SEO",
            "Content Strategy",
            "Link-Building"
        ],
        "summary": "Lead SEO team to drive organic growth, optimize technical and content strategies, and enhance search visibility for a top US automotive app serving 10M+ users."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26086",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<h2>About Us</h2>\n<p>Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers—from auto insurance and parking to EV charging and more. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide and recognized as the top Product in Insurance by UnitQ, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Role Overview</h2>\n<p>We are seeking a dynamic and customer-focused <strong>Spanish Customer Success Executive</strong> to join our on-site, full-time team. This role involves delivering excellent customer service to Spanish-speaking clients via phone, resolving inquiries professionally and efficiently.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction</strong>: Manage inbound and outbound calls to resolve queries, concerns, and complaints promptly.</li>\n<li><strong>Service Excellence</strong>: Provide empathetic, professional support to ensure positive customer experiences.</li>\n<li><strong>Issue Escalation</strong>: Identify, prioritize, and escalate complex cases to relevant departments for swift resolution.</li>\n<li><strong>Documentation</strong>: Maintain accurate records of interactions and update databases.</li>\n<li><strong>Performance Goals</strong>: Meet/exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge</strong>: Stay informed on company products/services to provide accurate information.</li>\n<li><strong>Team Collaboration</strong>: Foster a supportive, collaborative work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Fluent in Spanish &amp; English</strong> (written/spoken) for bilingual communication.</li>\n<li><strong>Customer Service Experience</strong> in voice processes.</li>\n<li>Strong interpersonal/communication skills with patience and empathy.</li>\n<li>Ability to multitask and manage time efficiently in fast-paced environments.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries.</li>\n<li>Flexibility to work shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.</li>\n<li>Make a meaningful impact across <strong>10+ million users</strong>.</li>\n<li>Dynamic, innovation-driven culture in a rapidly scaling tech company.</li>\n<li>Clear career growth pathways.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Contact Information</h3>\n<p><strong>Email</strong>: <a href=\"mailto:careers@way.com\">careers@way.com</a>\n<strong>Apply Here</strong>: <a href=\"https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive\">https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</a></p>",
        "tags": [
            "2-4 Years",
            "Spanish & English Bilingual",
            "Customer Service",
            "Automotive/Fintech Knowledge"
        ],
        "summary": "Spanish Customer Success Executive at Way.com delivers bilingual support for automotive services, ensuring customer satisfaction and driving growth in a tech-driven environment."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/26085",
        "location": "Technopark",
        "closing_date": "21 Dec 2025",
        "job_description": "<p><strong>Company:</strong> Way.com — America’s dominant automotive super app, powering every mile for over 10 million customers. Leveraging cutting-edge AI, machine learning, and advanced data analytics, we deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies worldwide, we’re making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Job Title:</strong> Customer Success Executive\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Closing Date:</strong> 21, Dec 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Role Overview</strong>\nWe are seeking a dynamic and customer-focused individual to join our team as a <strong>Customer Success Executive</strong> in our voice process. This role involves delivering excellent customer service to our clients and handling inquiries over the phone with professionalism and efficiency.</p>\n<p><strong>Key Responsibilities</strong>\n- Address customer queries through <strong>phone, email, chat, and social media channels</strong>.\n- Troubleshoot and resolve customer concerns efficiently and effectively.\n- Handle inquiries related to <strong>products, orders, returns, and general support requests</strong>.\n- Maintain accurate <strong>customer records and feedback</strong> in the CRM system.\n- Escalate complex or unresolved issues to the appropriate internal teams.\n- Contribute to tracking <strong>customer satisfaction metrics</strong> and suggest improvements.\n- Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</p>\n<p><strong>Preferred Skills</strong>\n- <strong>Proven experience (2-5 years)</strong> in customer service or a similar role.\n- Excellent verbal and written communication skills.\n- Ability to stay calm under pressure and handle difficult situations with professionalism.\n- Strong problem-solving abilities with attention to detail.\n- Knowledge of CRM systems (preferred but not required).\n- Positive attitude and a passion for helping others.\n- Ability to work effectively in a team environment.</p>\n<p><strong>Why You Will Love Working with Us</strong>\n- Opportunity to work for the <strong>#1 Auto Super app in the US</strong>.\n- Opportunity to make a meaningful impact across <strong>10+ million users</strong>.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear pathways for career growth in a rapidly scaling technology company.\n- Competitive compensation.</p>\n<p><strong>Apply Now:</strong> <a href=\"https://waydot.greythr.com/hire/jobs/customer-success-executive\">https://waydot.greythr.com/hire/jobs/customer-success-executive</a></p>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Customer Service",
            "Problem-Solving"
        ],
        "summary": "Customer Success Executive at Way.com, a leading US auto super app, to manage customer queries and ensure satisfaction. Requires 2-5 years of experience with CRM systems and strong communication skills."
    }
]