[
    {
        "job_title": "React Front-End Developer (with UI/UX Knowledge)",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/20942/296",
        "location": "Infopark",
        "closing_date": "03 Nov 2025",
        "job_description": "<h2>React Front-End Developer (with UI/UX Knowledge)</h2>\n<p><strong>Experience:</strong> 2 – 4 Years\n<strong>Location:</strong> Infopark Kakkanad\n<strong>Employment Type:</strong> Full-time work from office</p>\n<p><strong>About the Role:</strong>\nWe are looking for a skilled React front-end developer with an eye for design and user experience. The ideal candidate will bridge the gap between design and technical implementation — translating UI/UX ideas into engaging, responsive, and high-performing web applications.</p>\n<p><strong>Required Skills &amp; Qualifications:</strong>\n- 2–4 years of experience in React.js development.\n- Proficiency in JavaScript (ES6+), HTML5, and CSS3.\n- Experience with state management (Redux, Context API, etc.).\n- Hands-on knowledge of UI/UX design principles and tools such as Figma/ Adobe XD/Sketch.\n- Familiarity with responsive and mobile-first design.\n- Understanding of version control systems (Git/GitHub).\n- Basic knowledge of REST APIs and JSON.</p>\n<p><strong>Contact:</strong>\nInterested candidates, please share your CVs at hr@grapelime.in</p>",
        "tags": [
            "2-4 Years",
            "React.js",
            "UI/UX",
            "JavaScript"
        ],
        "summary": "Seeking a React front-end developer with 2-4 years of experience and UI/UX knowledge. Responsibilities include translating design ideas into responsive, high-performing web applications."
    },
    {
        "job_title": "AWS Architect",
        "company": "Pagematics India Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/20944/467",
        "location": "Infopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>AWS Architect</h2>\n<p><strong>Job Summary:</strong></p>\n<p>We are seeking a skilled AWS Architect to design, implement, and optimize secure, scalable, and cost-efficient cloud solutions on Amazon Web Services (AWS). The ideal candidate will have deep technical expertise in AWS architecture, cloud-native design, and DevOps practices, with a strong ability to translate business requirements into robust technical solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and architect cloud solutions leveraging AWS services such as EC2, S3, Lambda, RDS, ECS, EKS, and CloudFormation.</li>\n<li>Define and implement cloud architecture best practices, security standards, and governance frameworks.</li>\n<li>Lead cloud migration initiatives, including application modernization, containerization, and re-platforming strategies.</li>\n<li>Collaborate with cross-functional teams (DevOps, Security, Data, and Application teams) to deliver scalable and resilient cloud systems.</li>\n<li>Automate deployment and infrastructure management using Infrastructure as Code (IaC) tools like Terraform or AWS CloudFormation.</li>\n<li>Optimize cloud performance, cost, and resource utilization through monitoring and tuning.</li>\n<li>Ensure compliance with security, risk, and data protection policies across all cloud environments.</li>\n<li>Stay current with emerging AWS technologies and recommend innovative solutions for continuous improvement.</li>\n<li>Provide technical leadership and mentorship to engineers and developers within the team.</li>\n</ul>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field (or equivalent practical experience).</li>\n<li>5+ years of experience in cloud architecture, with at least 3 years focused on AWS.</li>\n<li>Proven experience designing and implementing enterprise-scale AWS solutions.</li>\n<li>Hands-on experience with networking, storage, compute, and security services on AWS.</li>\n<li>Proficiency in DevOps tools and practices (Jenkins, GitLab CI/CD, Docker, Kubernetes).</li>\n<li>Strong knowledge of Infrastructure as Code (IaC) tools (Terraform, CloudFormation, CDK).</li>\n<li>Experience in monitoring and observability (CloudWatch, Prometheus, Grafana, etc.).</li>\n<li>AWS Certification (AWS Certified Solutions Architect – Professional) is highly preferred.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Familiarity with multi-cloud or hybrid-cloud environments.</li>\n<li>Knowledge of serverless architectures and event-driven design.</li>\n<li>Experience with data architecture and analytics services (Redshift, Glue, Athena).</li>\n<li>Strong problem-solving, analytical, and communication skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at remya.ps@pagematics.in</p>",
        "tags": [
            "5+ Years",
            "AWS",
            "Cloud Architecture",
            "DevOps"
        ],
        "summary": "Seeking an AWS Architect to design and implement secure, scalable cloud solutions. Requires 5+ years of experience in AWS architecture and DevOps practices."
    },
    {
        "job_title": "Jr AWS Engineer",
        "company": "Pagematics India Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/20945/467",
        "location": "Infopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>Junior AWS Engineer</h2>\n<p><strong>Job Summary</strong></p>\n<p>We are looking for a motivated Junior AWS Engineer to join our cloud engineering team. The ideal candidate has a foundational understanding of cloud computing concepts, basic AWS services, and an eagerness to learn and grow within a fast-paced, collaborative environment. You will assist in the design, deployment, and maintenance of AWS infrastructure that supports our applications and services.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Assist in provisioning and configuring AWS cloud resources (EC2, S3, RDS, IAM, VPC, Lambda).</li>\n<li>Support the migration of on-premises workloads to AWS.</li>\n<li>Monitor and maintain cloud environments using AWS CloudWatch and other monitoring tools.</li>\n<li>Help implement security best practices, including IAM policies and role-based access.</li>\n<li>Support CI/CD pipelines and infrastructure-as-code using tools such as AWS CloudFormation or Terraform.</li>\n<li>Collaborate with development and operations teams to ensure reliable and efficient cloud solutions.</li>\n<li>Document system configurations, procedures, and troubleshooting steps.</li>\n<li>Participate in on-call rotations and respond to cloud-related incidents under supervision.</li>\n</ul>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field (or equivalent experience).</li>\n<li>Basic understanding of cloud computing and networking concepts.</li>\n<li>Familiarity with core AWS services (EC2, S3, RDS, IAM, Lambda, VPC).</li>\n<li>Exposure to scripting languages (Python, Bash, or PowerShell).</li>\n<li>Knowledge of version control (Git).</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Excellent communication and teamwork abilities.</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li>AWS Certified Cloud Practitioner or AWS Certified Solutions Architect – Associate (in progress or completed).</li>\n<li>Hands-on experience through internships, coursework, or personal projects involving AWS.</li>\n<li>Familiarity with DevOps tools such as Jenkins, Docker, Kubernetes, or Terraform.</li>\n<li>Understanding of Linux/Windows system administration.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at remya.ps@pagematics.in</p>",
        "tags": [
            "0-2 Years",
            "AWS",
            "Cloud Computing",
            "IAM"
        ],
        "summary": "Junior AWS Engineer needed to assist in cloud infrastructure design, deployment, and maintenance. Requires basic AWS knowledge and eagerness to learn and grow."
    },
    {
        "job_title": "SAP Consultant",
        "company": "Fingent Global Solutions",
        "url": "https://infopark.in/company-jobs/details/20941/83",
        "location": "Infopark",
        "closing_date": "14 Nov 2025",
        "job_description": "<h2>SAP Consultant</h2>\n<p>At Fingent, we believe that technology can make a meaningful difference to the lives around us. The lives of those who use it, the lives of those who build it and to society at large. We create and provide software which is beautiful, usable and compelling, to solve complex business challenges. We nurture smart people who bring out the best in themselves, their peers, and their clients.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Execute troubleshooting for master/transactional data errors, configuration issues, and access-related problems.</li>\n<li>Escalate complex issues to L2/L3 support with complete documentation.</li>\n<li>Provide first-level support for multiple SAP modules.</li>\n<li>Handle user account management (password resets, user unlocks, access provisioning).</li>\n<li>Monitor background job failures.</li>\n<li>Diagnose and resolve common SAP issues using SAP Notes and knowledge base resources.</li>\n<li>Document resolutions and update knowledge base with troubleshooting steps.</li>\n<li>Maintain incident logs with detailed tracking information.</li>\n<li>Create simple user guides and FAQs for recurring issues.</li>\n<li>Participate in root cause analysis for recurring problems.</li>\n<li>Work with technical teams and senior consultants to resolve issues.</li>\n<li>Communicate status updates to stakeholders and end users.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>Bachelor's degree in IT, Computer Science, or related field.</li>\n<li>3-5 years in SAP support, help desk, or consulting roles.</li>\n<li>Hands-on experience with 2-3 SAP modules (FI/CO, MM, SD, PP, PM, or others).</li>\n<li>Familiarity with incident management and ticketing systems.</li>\n<li>SAP module knowledge (SAP S/4HANA / ECC).</li>\n<li>Understanding of common SAP transaction codes.</li>\n<li>Knowledge of module integrations and basic business processes.</li>\n<li>Proficiency in Windows/Office tools and ticketing platforms.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication skills (verbal and written).</li>\n<li>Customer-focused service orientation.</li>\n<li>Ability to manage multiple priorities.</li>\n<li>Team collaboration and adaptability.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>SAP Certified Application Associate in one module.</li>\n<li>Experience with end-to-end SAP ECC / S/4HANA implementation/support projects.</li>\n<li>Knowledge of data migration tools (LSMW, BDC).</li>\n<li>Industry experience (retail, finance, sales).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@fingent.com</p>",
        "tags": [
            "3-5 Years",
            "SAP Support",
            "SAP FI/CO",
            "SAP MM"
        ],
        "summary": "Seeking an SAP Consultant with 3-5 years of experience to provide first-level support for SAP modules. Responsibilities include troubleshooting, issue resolution, and user account management."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Apps Team Technologies Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/20940/272",
        "location": "Infopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Position:</strong> Business Development Executive\n<strong>Experience:</strong> 2+ years\n<strong>Location:</strong> Infopark, Kochi\n<strong>Preference:</strong> Immediate joiners</p>\n<h3>Role Summary:</h3>\n<p>As a Business Development Executive, you will be responsible for generating leads, nurturing client relationships, and closing sales deals with new and existing clients. Your deep understanding of IT products and services, coupled with a talent for sales, will drive the expansion of our client base and help us achieve our sales targets. Experience in product sales and a working knowledge of digital marketing/SEO strategies will be considered an added advantage, enabling more effective targeting and engagement of our prospective customer base.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Identify and develop new business opportunities with potential clients in the IT sector.</li>\n<li>Maintain and expand relationships with existing clients, ensuring their satisfaction and exploring upselling opportunities.</li>\n<li>Understand customer needs and recommend appropriate IT solutions and services, leveraging your experience in product sales to tailor your approach.</li>\n<li>Prepare and deliver presentations and demonstrations of our IT products/services to clients and prospects, incorporating digital marketing/SEO insights to enhance message delivery and engagement.</li>\n<li>Negotiate contract terms and close sales deals.</li>\n<li>Achieve and exceed monthly and quarterly sales targets.</li>\n<li>Stay up-to-date with industry trends, market conditions, and competitor activities, including trends in digital marketing and SEO that can impact sales strategies.</li>\n<li>Collaborate with the marketing team to develop sales strategies and initiatives, particularly those involving digital marketing and SEO to enhance lead generation and brand visibility.</li>\n<li>Attend industry conferences, networking events, and trade shows to promote our products/services and gather market intelligence, with an eye towards digital marketing trends and opportunities.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in Business Administration, Marketing, IT, or a related field.</li>\n<li>Minimum 2 years of experience in a relevant field.</li>\n<li>Proven sales experience in the IT industry, with a solid track record of achieving sales targets and experience in product sales.</li>\n<li>Strong understanding of IT products and services.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to build and maintain strong client relationships.</li>\n<li>Self-motivated with a results-driven approach.</li>\n<li>Proficiency in CRM software and Microsoft Office Suite.</li>\n<li>Knowledge in digital marketing/SEO strategies is a significant advantage.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>If you are an experienced Business Development Executive looking to contribute to challenging IT projects, please mail your resume to careers@appsteamtechnologies.com. Please include \"Business Development Executive\" in the subject line. If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@appsteamtechnologies.com.</p>",
        "tags": [
            "2+ Years",
            "Sales",
            "IT Products",
            "Digital Marketing"
        ],
        "summary": "Seeking a Business Development Executive with 2+ years of IT sales experience to generate leads and close deals. Role requires client relationship building and understanding of IT services."
    },
    {
        "job_title": "Sr. React JS Developer",
        "company": "Global Infonet Inc",
        "url": "https://infopark.in/company-jobs/details/20943/28",
        "location": "Infopark",
        "closing_date": "29 Nov 2025",
        "job_description": "<h2>Senior Developer – React.js / Node.js</h2>\n<p><strong>Location:</strong> Kochi, Kerala (On-site / Hybrid)\n<strong>Experience:</strong> 4 – 8 years\n<strong>Employment Type:</strong> Full-time</p>\n<h3>About the Role:</h3>\n<p>We are looking for a talented and experienced Senior Developer proficient in React.js, Node.js, and Express.js to join our development team. The ideal candidate should have strong front-end expertise in React.js along with solid backend knowledge in Node.js and Express.js, enabling them to contribute to end-to-end web application development.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable web applications using React.js, Node.js, and Express.js.</li>\n<li>Build reusable, efficient, and high-quality code for both front-end and backend components.</li>\n<li>Integrate RESTful APIs and ensure seamless data flow between client and server.</li>\n<li>Collaborate with designers, product managers, and other developers to define and implement new features.</li>\n<li>Optimize applications for performance, responsiveness, and scalability.</li>\n<li>Conduct code reviews and mentor junior developers when needed.</li>\n<li>Debug, troubleshoot, and resolve issues throughout the development lifecycle.</li>\n<li>Stay updated with emerging web technologies and best practices.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field.</li>\n<li>4+ years of experience in full-stack development using React.js, Node.js, and Express.js.</li>\n<li>Proficiency in JavaScript (ES6+), HTML5, CSS3, and related front-end tools.</li>\n<li>Strong understanding of React hooks, state management (Redux / Context API), and component-based architecture.</li>\n<li>Experience in developing and consuming RESTful APIs.</li>\n<li>Hands-on experience with backend frameworks such as Express.js.</li>\n<li>Familiarity with MongoDB or other NoSQL databases.</li>\n<li>Strong understanding of version control systems (Git / GitHub).</li>\n<li>Knowledge of JSON, AJAX, and web performance optimization techniques.</li>\n</ul>\n<h3>Good to Have:</h3>\n<ul>\n<li>Experience with TypeScript, Next.js, or GraphQL.</li>\n<li>Exposure to AWS, Docker, or cloud deployment environments.</li>\n<li>Familiarity with Agile/Scrum methodologies.</li>\n<li>Basic understanding of database design and optimization.</li>\n</ul>\n<h3>Soft Skills:</h3>\n<ul>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and teamwork abilities.</li>\n<li>Ability to work independently and take ownership of tasks.</li>\n<li>Attention to detail and commitment to delivering high-quality work.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@global-infonet.com</p>",
        "tags": [
            "4-8 Years",
            "React.js",
            "Node.js",
            "Express.js"
        ],
        "summary": "Seeking a Senior Full-Stack Developer with 4+ years in React.js, Node.js, and Express.js. Responsibilities include end-to-end application development and API integration."
    },
    {
        "job_title": "Full Stack Developer (Node & React J S) (4+ years)",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24742",
        "location": "Technopark",
        "closing_date": "16 Nov 2025",
        "job_description": "<h2>SRS Global Technologies (P) Ltd - Full Stack Developer (Node &amp; React JS)</h2>\n<p><strong>Company:</strong> SRS Global Technologies (P) Ltd\n<strong>Location:</strong> Technopark, Thiruvananthapuram, Kerala\n<strong>Website:</strong> https://srsglobaltechnologies.com</p>\n<p><strong>Job Title:</strong> Full Stack Developer (Node &amp; React JS)\n<strong>Years of Experience Required:</strong> 4+ years\n<strong>Application Closing Date:</strong> November 16, 2025\n<strong>Job Published Date:</strong> November 02, 2025</p>\n<p><strong>Contact Email:</strong> hr@srswebsolutions.com, ananthu.m@srswebsolutions.in</p>\n<hr />\n<h2>Brief Description</h2>\n<p>We are seeking a proven hands-on experienced Full Stack Developer to design and develop complex and secure React JS + Node JS based applications. This role requires expertise across front-end, middleware, and database technologies, along with a strong understanding of design principles and patterns.</p>\n<h2>Responsibilities and Technologies:</h2>\n<h3>Front End:</h3>\n<ul>\n<li>Design and development of adaptive and responsive front-end.</li>\n<li>Hands-on experience with:<ul>\n<li>React JS</li>\n<li>HTML 5</li>\n<li>CSS</li>\n<li>Bootstrap 5</li>\n<li>JavaScript</li>\n<li>TypeScript</li>\n<li>Webpack</li>\n</ul>\n</li>\n</ul>\n<h3>Middleware:</h3>\n<ul>\n<li>Design and development of complex middleware.</li>\n<li>Strong expertise required in:<ul>\n<li>Node JS</li>\n<li>Express JS</li>\n<li>REST API development</li>\n<li>Microservices architecture</li>\n</ul>\n</li>\n</ul>\n<h3>Database:</h3>\n<ul>\n<li>Design and development of databases.</li>\n<li>Working knowledge of databases such as:<ul>\n<li>PostgreSQL / SQLite / Redis / relational databases</li>\n</ul>\n</li>\n<li>Ability to read and write SQL queries, stored procedures, views, and functions.</li>\n</ul>\n<h3>Other Requirements:</h3>\n<ul>\n<li>Working experience with Docker.</li>\n<li>Experience in design principles and design patterns.</li>\n</ul>\n<h2>Preferred Skills &amp; Requirements:</h2>\n<ul>\n<li>4+ years of hands-on experience in full stack development using Node.js and React.js.</li>\n<li>Ability to work independently and collaboratively in a fast-paced environment.</li>\n<li>Excellent problem-solving, debugging, and analytical skills.</li>\n<li>Strong communication skills and attention to detail.</li>\n<li>Immediate joiners are highly preferred.</li>\n</ul>\n<h2>How to Apply:</h2>\n<p>Send your resumes to hr@srswebsolutions.com or ananthu.m@srswebsolutions.in.</p>",
        "tags": [
            "4+ Years",
            "Node.js",
            "React JS",
            "REST API"
        ],
        "summary": "Seeking a Full Stack Developer with 4+ years of experience in Node.js and React JS. Must be proficient in front-end, middleware, and database development, with strong problem-solving skills."
    },
    {
        "job_title": "Process Associate Trainee",
        "company": "Ecesis Care (P) Ltd",
        "url": "https://technopark.org/job-details/24741",
        "location": "Technopark",
        "closing_date": "06 Nov 2025",
        "job_description": "<h2>Process Associate Trainee at ECESIS CARE (P) Ltd</h2>\n<p><strong>Company:</strong> ECESIS CARE (P) Ltd\n<strong>Location:</strong> 4th FLOOR, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Work Location:</strong> First Floor, PPK Rd, Buildings, Marthandam, Tamil Nadu 629165\n<strong>Website:</strong> https://www.ecesistech.com\n<strong>Contact Email:</strong> amrithas@ecesistech.com</p>\n<p><strong>Job Published:</strong> 01, Nov 2025\n<strong>Closing Date:</strong> 06, Nov 2025</p>\n<h3>About Ecesis:</h3>\n<p>At Ecesis, we specialize in Broker Price Opinion (BPO) services that empower real estate professionals across the United States. We are a trusted leader in the real estate valuation industry, recognized for our precision, reliability, and innovative solutions.</p>\n<p>Ecesis is the only IT firm in Kerala to have received Government funding under the India BPO Promotion Scheme (IBPS) for employment generation in 2018. We are also a NASSCOM-affiliated organization, demonstrating our credibility and commitment to industry standards.</p>\n<p>For over a decade, Ecesis has provided accurate property valuations and Comparative Market Analysis (CMA) reports to realtors, brokers, and real estate companies. We combine data-driven insights with advanced technology to help clients stay informed and competitive.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Support daily operations and documentation.</li>\n<li>Coordinate with teams to ensure smooth workflow.</li>\n<li>Maintain accuracy and efficiency in all assigned tasks.</li>\n<li>Contribute to process improvement initiatives.</li>\n</ul>\n<h3>Eligibility Criteria:</h3>\n<ul>\n<li>Willing to work in night shifts (allowances provided).</li>\n<li>Freshers preferred from in and around Marthandam.</li>\n<li><strong>Eligible Courses:</strong> Graduates / Postgraduates in Engineering (Civil, ECE, EEE, ME) or Arts &amp; Science.</li>\n<li><strong>Batch:</strong> 2024–2025 only.</li>\n<li>Immediate joiners required.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong attention to detail and ability to handle large volumes of data accurately.</li>\n<li>Good understanding of documentation and report preparation.</li>\n<li>Ability to multitask and meet tight deadlines.</li>\n<li>Eagerness to learn business processes and adapt quickly to new tools or systems.</li>\n<li>Basic knowledge of the real estate domain or BPO process (added advantage).</li>\n</ul>\n<p><strong>Google Map:</strong> https://share.google/x55xjHcAoA0ACCP1C</p>",
        "tags": [
            "0-1 Years",
            "BPO",
            "Real Estate",
            "Documentation"
        ],
        "summary": "Process Associate Trainee at Ecesis Care. Support daily operations, documentation, and process improvement. Freshers preferred for night shifts."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd Old",
        "url": "https://technopark.org/job-details/24740",
        "location": "Technopark",
        "closing_date": "04 Nov 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd\n<strong>Website:</strong> www.trainonexsolutions.in\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com\n<strong>Job Published:</strong> 01, Nov 2025\n<strong>Closing Date:</strong> 04, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. The role involves contacting potential and existing customers over the phone to promote products or services, explain features and benefits, and close deals. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Contact potential customers via phone calls to promote company products/services.</li>\n<li>Explain product features, pricing, and benefits clearly to customers.</li>\n<li>Handle customer inquiries and provide accurate information.</li>\n<li>Follow up on leads and maintain a database of customer contacts.</li>\n<li>Build and maintain positive relationships with customers.</li>\n</ul>\n<h3>Requirements &amp; Preferences</h3>\n<ul>\n<li><strong>Experience:</strong> 0-1 years required. Freshers can also apply.</li>\n<li><strong>Availability:</strong> Need Immediate Joiners.</li>\n<li><strong>Work Location:</strong> Work from office opportunity.</li>\n<li><strong>Candidates:</strong> Male and Female Candidates preferred.</li>\n<li><strong>Language:</strong> Fluency with Malayalam Language required.</li>\n<li><strong>Application:</strong> Mention subject line as \"Telesales Executive\".</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Confident and friendly telephone manner.</li>\n<li>Ability to handle rejections and remain motivated.</li>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Communication"
        ],
        "summary": "Seeking a motivated Telesales Executive to drive sales over the phone. Responsibilities include contacting customers, explaining products, and closing deals to foster company growth."
    },
    {
        "job_title": "Machine Operator cum driver (Heavy Vehicle)",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/24739",
        "location": "Technopark",
        "closing_date": "22 Nov 2025",
        "job_description": "<h2>Machine Operator cum driver (Heavy Vehicle) at GENROBOTIC INNOVATIONS (P) Ltd</h2>\n<p><strong>Company:</strong> GENROBOTIC INNOVATIONS (P) Ltd\n<strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.genrobotics.org\n<strong>Contact Email:</strong> career@genrobotics.org</p>\n<p><strong>Closing Date:</strong> 22, November 2025\n<strong>Job Published:</strong> 01, November 2025</p>\n<h3>Job Summary:</h3>\n<p>We are looking for a responsible and proactive individual to operate and maintain robots, manage site activities, and lead a small team. The role includes basic robot maintenance, regular communication with clients for billing updates, and coordination with the manager to ensure smooth and efficient operations.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Operating Robot.</li>\n<li>Communicating with clients and taking bill updates.</li>\n<li>Communicating with manager on a regularly basis.</li>\n<li>Handle the site with complete responsibility.</li>\n<li>Team handling.</li>\n<li>Basic Robot maintenance works.</li>\n</ul>\n<h3>Additional Requirements:</h3>\n<ul>\n<li>HMV License.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Hardworking</li>\n<li>Efficient</li>\n<li>Team handling</li>\n<li>Team Spirit</li>\n<li>Mathematical skills</li>\n<li>Communication</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Robot Operation",
            "Client Communication",
            "Team Handling"
        ],
        "summary": "Operate and maintain robots, manage site activities, and lead a team. Requires HMV license and strong communication skills for client and manager coordination."
    },
    {
        "job_title": "Machine Operator cum driver (1yr experience)",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/24738",
        "location": "Technopark",
        "closing_date": "21 Nov 2025",
        "job_description": "<h2>Machine Operator cum Driver</h2>\n<p><strong>Company:</strong> GENROBOTIC INNOVATIONS (P) Ltd\n<strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.genrobotics.org\n<strong>Contact Email:</strong> career@genrobotics.org</p>\n<p><strong>Job Published:</strong> 01, Nov 2025\n<strong>Closing Date:</strong> 21, Nov 2025</p>\n<h3>Job Summary:</h3>\n<p>We are looking for a responsible and proactive individual to operate and maintain robots, manage site activities, and lead a small team. The role includes basic robot maintenance, regular communication with clients for billing updates, and coordination with the manager to ensure smooth and efficient operations.</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Operating Robot</li>\n<li>Communicating with clients and taking bill updates</li>\n<li>Communicating with manager on a regular basis</li>\n<li>Handling the site with complete responsibility</li>\n<li>Team handling</li>\n<li>Basic Robot maintenance works</li>\n</ul>\n<h3>Skills Required:</h3>\n<ul>\n<li>Hardworking</li>\n<li>Efficient</li>\n<li>Team handling</li>\n<li>Team Spirit</li>\n<li>Mathematical skills</li>\n<li>Communication</li>\n</ul>\n<h3>Additional Requirements:</h3>\n<ul>\n<li>LMV License</li>\n</ul>\n<h3>Experience:</h3>\n<ul>\n<li>0 - 1 year</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Hardworking, Efficient, Team handling, Team Spirit, Mathematical skills, Communication.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Robot Operation",
            "Client Communication",
            "Team Handling"
        ],
        "summary": "Operate and maintain robots, manage site activities, and lead a team. Requires client communication and basic robot maintenance."
    },
    {
        "job_title": "Travel Admin ( 1 -2 Years)",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/24737",
        "location": "Technopark",
        "closing_date": "19 Nov 2025",
        "job_description": "<h2>Travel Admin</h2>\n<p><strong>Company:</strong> GENROBOTIC INNOVATIONS (P) Ltd\n<strong>Location:</strong> Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.genrobotics.org\n<strong>Contact Email:</strong> career@genrobotics.org\n<strong>Job Published:</strong> 01, Nov 2025\n<strong>Closing Date:</strong> 19, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>GENROBOTIC INNOVATIONS (P) Ltd is seeking a Travel Admin to manage all organizational travel activities. This role focuses on booking transportation (flights, buses, trains, cabs) and accommodation, including international travel, for business meetings and official visits. The ideal candidate will coordinate with vendors, ensure cost-effectiveness, and timely travel arrangements.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Manage flight, bus, train, cab, and accommodation bookings (including International).</li>\n<li>Arrange travel and stay for business meetings and official visits.</li>\n<li>Coordinate with vendors for travel, accommodation, and facilities.</li>\n<li>Ensure cost-effective and timely travel arrangements.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Good communication and interpersonal abilities</li>\n<li>Problem-solving skills</li>\n<li>Time management skills</li>\n<li>Critical Thinking</li>\n<li>Ability to adapt to fast-changing plans</li>\n<li>Relevant experience in Corporate travel management</li>\n<li>Negotiation Skills</li>\n<li>Ability to communicate in English, Hindi, Malayalam</li>\n<li>Ability to collaborate and work with different departments, closely working with Management</li>\n<li><strong>Added Advantage:</strong> IATA certification</li>\n</ul>\n<h3>Qualifications &amp; Experience:</h3>\n<ul>\n<li><strong>Qualification:</strong> Any Degree</li>\n<li><strong>Experience:</strong> 1 - 2 Years</li>\n</ul>\n<h3>Job Location:</h3>\n<ul>\n<li>Technopark, Thiruvananthapuram</li>\n</ul>\n<p><strong>To Apply:</strong>\nClick here to Apply</p>",
        "tags": [
            "1-2 Years",
            "Travel Management",
            "Booking",
            "Vendor Coordination"
        ],
        "summary": "Seeking a Travel Admin for GENROBOTIC INNOVATIONS to manage all travel bookings and arrangements. Requires coordinating vendors and ensuring timely, cost-effective travel for business needs."
    },
    {
        "job_title": "Senior Software Quality Analyst",
        "company": "Shellsquare Softwares (P) Ltd",
        "url": "https://technopark.org/job-details/24736",
        "location": "Technopark",
        "closing_date": "16 Dec 2025",
        "job_description": "<h2>Senior Software Quality Analyst</h2>\n<p><strong>Company:</strong> ShellSquare Softwares (P) Ltd\n<strong>Location:</strong> Technopark, Kerala\n<strong>Contact Email:</strong> careers@Shellsquare.com\n<strong>Website:</strong> http://www.shellsquare.com\n<strong>Job Published:</strong> 01, Nov 2025\n<strong>Closing Date:</strong> 16, Dec 2025</p>\n<h3>Job Summary:</h3>\n<p>We are seeking an experienced and detail-oriented Senior Software Quality Analyst to ensure the quality and reliability of our software products. The ideal candidate will have strong expertise in manual testing, functional testing, database testing (including SQL queries), and API testing. Knowledge of automation testing, security testing, and cloud platforms like AWS or Azure is a plus.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and execute manual test cases for web applications.</li>\n<li>Perform functional testing, database testing (including writing and validating SQL queries), and API testing.</li>\n<li>Collaborate with development teams to identify, report, and track defects.</li>\n<li>Prepare and maintain detailed test documentation, including test plans, test cases, and test reports.</li>\n<li>Ensure compliance with quality standards and best practices throughout the SDLC.</li>\n<li>Participate in requirement analysis and provide feedback on testability.</li>\n<li>Work closely with cross-functional teams to deliver high-quality releases.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Minimum 5+ years of experience in software quality assurance.</li>\n<li>Strong expertise in Manual Testing and Functional Testing.</li>\n<li>Hands-on experience in Database Testing and writing SQL queries.</li>\n<li>Proficiency in API Testing tools (e.g., Postman, SoapUI).</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>Strong communication and documentation abilities.</li>\n</ul>\n<h3>Good-to-Have Skills:</h3>\n<ul>\n<li>Experience in Automation Testing (Selenium, Cypress, or similar tools).</li>\n<li>Knowledge of Security Testing fundamentals.</li>\n<li>Familiarity with Cloud Platforms like AWS or Azure.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong expertise in Manual Testing and Functional Testing.</li>\n<li>Hands-on experience in Database Testing and writing SQL queries.</li>\n<li>Proficiency in API Testing tools (e.g., Postman, SoapUI).</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Manual Testing",
            "SQL",
            "API Testing"
        ],
        "summary": "Seeking a Senior Software Quality Analyst with 5+ years of experience in manual, functional, database, and API testing. Responsibilities include test design, execution, defect tracking, and documentation."
    },
    {
        "job_title": "Software Engineer - Fresher",
        "company": "Diagnal Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/24735",
        "location": "Technopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>Software Engineer - Fresher at DIAGNAL TECHNOLOGIES (P) Ltd</h2>\n<p><strong>Company:</strong> DIAGNAL TECHNOLOGIES (P) Ltd\n<strong>Address:</strong> 2801, Yamuna Building, Technopark Phase III, Trivandrum, 695583\n<strong>Website:</strong> https://www.diagnal.com\n<strong>Contact Email:</strong> vivekkumar.jaiswal@diagnal.com\n<strong>Application Link:</strong> https://forms.gle/i3qBEFDTKpAMdPDf9\n<strong>Closing Date:</strong> 30, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025</p>\n<h3>Job Description</h3>\n<p>You will:</p>\n<ul>\n<li>Learn and understand project requirements, architecture, and software development practices under the guidance of senior engineers.</li>\n<li>Participate in real-world web development projects using modern technologies and frameworks.</li>\n<li>Shadow senior developers to observe best practices in coding, debugging, testing, and deployment.</li>\n<li>Conduct research and build small proof-of-concepts (PoCs) to explore new technologies or solve specific problems.</li>\n<li>Collaborate with team members during code reviews, estimation sessions, and technical discussions.</li>\n<li>Assist in designing, developing, and testing features for web applications following established standards.</li>\n<li>Learn about REST APIs, front-end and back-end integration, and performance optimization.</li>\n<li>Support documentation, reporting, and analysis of assigned tasks and findings.</li>\n<li>Maintain professionalism, curiosity, and a continuous learning mindset while contributing to team goals.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p>You have:</p>\n<ul>\n<li>A Bachelor’s degree in Computer Science, Information Technology, or a related discipline.</li>\n<li>Strong analytical and problem-solving skills, with good knowledge of data structures, algorithms, and mathematics.</li>\n<li>Familiarity with at least one programming language: JavaScript, Python, Java, or C++.</li>\n<li>Basic understanding of web technologies (HTML, CSS, JavaScript) and modern frameworks (React, Node.js, etc.) from academics or self-learning.</li>\n<li>Understanding of object-oriented programming and database concepts (SQL, relational models).</li>\n<li>Curiosity about how web systems work, from front-end UI to APIs and databases.</li>\n<li>Eagerness to learn new tools, frameworks, and processes quickly.</li>\n<li>Ability to work collaboratively in a team, communicate clearly, and adapt to a fast-paced environment.</li>\n</ul>\n<h3>What You’ll Gain:</h3>\n<ul>\n<li>Hands-on exposure to real-world web applications, frameworks, and tools used in professional engineering teams.</li>\n<li>Mentorship from experienced engineers and opportunities to contribute to live projects.</li>\n<li>Experience with modern engineering practices like code reviews, version control, and Agile collaboration.</li>\n<li>A strong foundation to grow into a full-stack or specialized web developer role within the organisation.</li>\n</ul>\n<p>If you have gone through the JD and feel you are a good fit, please fill out the form below to apply.</p>",
        "tags": [
            "0-1 Years",
            "JavaScript",
            "React",
            "Python"
        ],
        "summary": "Learn and develop web applications using modern technologies under senior guidance. Gain hands-on experience and mentorship to grow into a full-stack developer role."
    },
    {
        "job_title": "Solution Architect - Java & Cloud",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24734",
        "location": "Technopark",
        "closing_date": "08 Nov 2025",
        "job_description": "<h2>Solution Architect - Java &amp; Cloud</h2>\n<p><strong>Company:</strong> TRENSER Technology Solutions (P) Ltd\n<strong>Location:</strong> Thejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.trenser.com\n<strong>Contact Email:</strong> careers@trenser.com</p>\n<p><strong>Job Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 08 Nov 2025</p>\n<h3>Overview:</h3>\n<p>TRENSER Technology Solutions is seeking a highly skilled Solution Architect with extensive expertise in Java technologies and Cloud platforms. The role involves designing, developing, and implementing scalable, high-performance solutions. A deep understanding of Spring Boot, microservices architecture, and modern cloud infrastructures is essential. Prior experience in the Healthcare domain is considered a significant advantage.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design and architect end-to-end solutions leveraging Java, Spring Boot, and cloud technologies (AWS / Azure / GCP).</li>\n<li>Define solution architecture, integration patterns, and technical roadmaps that align with business objectives.</li>\n<li>Collaborate effectively with product owners, developers, and stakeholders to translate business requirements into scalable technical solutions.</li>\n<li>Provide technical leadership and mentorship to development teams, guiding them in implementing architectural best practices.</li>\n<li>Ensure all designed solutions adhere to stringent performance, security, and compliance standards.</li>\n<li>Evaluate and recommend appropriate tools, frameworks, and cloud services to enhance development and deployment efficiency.</li>\n<li>Conduct thorough architecture and code reviews to uphold technical quality and consistency.</li>\n<li>Offer technical guidance and leadership throughout the entire project lifecycle.</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Minimum of 9 years of hands-on experience in Java/J2EE, Spring Boot, and Microservices architecture.</li>\n<li>Strong proficiency in Cloud platforms (AWS / Azure / GCP), including experience in designing and deploying cloud-native solutions.</li>\n<li>Good knowledge of both relational databases (MySQL, PostgreSQL, Oracle) and NoSQL databases (MongoDB, DynamoDB).</li>\n<li>Solid understanding of API design principles, various integration patterns, and DevOps practices (CI/CD, containerization using Docker/Kubernetes).</li>\n<li>Excellent communication, analytical thinking, and stakeholder management capabilities.</li>\n<li>Proven ability to clearly document and present architecture designs to both technical and non-technical audiences.</li>\n<li>Healthcare domain knowledge is highly desirable, with experience in HL7, FHIR, and HIPAA compliance being advantageous.</li>\n</ul>\n<h3>Nice to Have:</h3>\n<ul>\n<li>Experience with Event-Driven Architecture patterns using technologies like Kafka or RabbitMQ.</li>\n<li>Familiarity with Serverless computing and Cloud-native design patterns.</li>\n<li>Exposure to established architecture frameworks such as TOGAF or Zachman.</li>\n<li>Holding a professional certification in AWS, Azure, or GCP.</li>\n</ul>",
        "tags": [
            "9+ Years",
            "Java",
            "Cloud (AWS/Azure/GCP)",
            "Microservices"
        ],
        "summary": "Seeking a Solution Architect with 9+ years in Java & Cloud (AWS/Azure/GCP). Design scalable solutions using Spring Boot, microservices, and cloud-native principles."
    },
    {
        "job_title": "Regional Sales Officer (Male)",
        "company": "Refined It Solutions And Marketing (P) Ltd",
        "url": "https://technopark.org/job-details/24733",
        "location": "Technopark",
        "closing_date": "21 Nov 2025",
        "job_description": "<h2>Regional Sales Officer (Male)</h2>\n<p><strong>Company:</strong> REFINED IT SOLUTIONS AND MARKETING (P) Ltd\n<strong>Location:</strong> Cochin Region\n<strong>Contact Email:</strong> hr@refined.co.in\n<strong>Website:</strong> http://www.refined.co.in\n<strong>Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 21 Nov 2025</p>\n<h3>Overview</h3>\n<p>We are seeking a Male Regional Sales Officer responsible for devising and executing the company’s sales strategies to achieve revenue targets in the Cochin region. This role is ideal for individuals who are enthusiastic about sales, eager to learn, and thrive in a fast-paced environment.</p>\n<p>The ideal candidate will possess strong analytical thinking, effective communication skills, and prior experience in sales management. The role involves frequent client interactions and travel, with full ownership of the sales cycle—from prospecting to closing. A proactive and self-motivated approach, combined with the ability to deliver tailored communication solutions, is essential.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify, qualify, and convert high-value leads into long-term clients across targeted industries.</li>\n<li>Manage the entire sales cycle: prospecting, needs analysis, proposal, negotiation, and closing.</li>\n<li>Develop and maintain a robust pipeline through CRM tools, outbound strategies, and networking.</li>\n<li>Deliver compelling product presentations and demos tailored to client needs.</li>\n<li>Conduct market research and competitive analysis to identify trends and growth opportunities.</li>\n<li>Collaborate with internal teams to ensure seamless client onboarding and an excellent customer experience.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>Bachelor’s degree with 1+ year of experience in the sales industry.</li>\n<li>1–2 years of experience in the communication technology or customer engagement platform sector preferred.</li>\n<li>Excellent communication, negotiation, and relationship-building skills.</li>\n<li>High energy, proactive, and target-driven attitude.</li>\n<li>Ability to work independently and manage multiple opportunities simultaneously.</li>\n<li>Willingness to travel frequently.</li>\n<li>Strong networking ability with a proven record of closing deals.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Sales",
            "CRM",
            "Communication Technology"
        ],
        "summary": "Seeking a Male Regional Sales Officer for the Cochin region to drive sales strategies and revenue targets. Requires strong communication, sales cycle management, and travel in a fast-paced environment."
    },
    {
        "job_title": "Senior Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24732",
        "location": "Technopark",
        "closing_date": "22 Nov 2025",
        "job_description": "<h2>Senior Marketing Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Contact Email:</strong> careers@way.com\n<strong>Closing Date:</strong> November 22, 2025\n<strong>Job Published:</strong> October 31, 2025</p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. Utilizing cutting-edge AI, machine learning, and advanced data analytics, Way.com provides innovative, personalized solutions to transform car ownership. Recognized by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Senior Marketing Designer who excels at transforming ideas into high-performing visuals. This role involves designing impactful campaigns, ads, and visuals across various platforms including paid media, social media, and email. You will collaborate closely with creative, growth, and product teams.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Create digital ad creatives, banners, and social visuals for ongoing campaigns.</li>\n<li>Conceptualize visuals for product launches and seasonal campaigns.</li>\n<li>Design for performance, balancing creativity with clarity.</li>\n<li>Collaborate with copywriters, growth managers, and product designers.</li>\n<li>Execute designs that align with Way.com’s visual brand and tone.</li>\n<li>Explore motion and storytelling techniques to enhance engagement.</li>\n</ul>\n<h3>Preferred Skills and Qualifications</h3>\n<ul>\n<li><strong>Experience:</strong> 2–5 years of experience in marketing design or growth design.</li>\n<li><strong>Software Proficiency:</strong> Figma, Photoshop, Illustrator, and After Effects.</li>\n<li><strong>Design Skills:</strong> Strong sense of layout, typography, and storytelling.</li>\n<li><strong>Marketing Knowledge:</strong> Understanding of digital marketing and ad metrics.</li>\n<li><strong>Portfolio:</strong> A portfolio showcasing creativity and attention to detail.</li>\n<li><strong>Attitude:</strong> Eagerness to learn, collaborate, and grow rapidly in a creative environment.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact on over 10 million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/senior-marketing-designer</p>",
        "tags": [
            "2-5 Years",
            "Figma",
            "Photoshop",
            "After Effects"
        ],
        "summary": "Seeking a Senior Marketing Designer for Way.com's Trivandrum office. Design high-impact visuals for campaigns across platforms, collaborating with creative and growth teams. Requires 2-5 years experience and proficiency in design software."
    },
    {
        "job_title": "Lead Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24731",
        "location": "Technopark",
        "closing_date": "22 Nov 2025",
        "job_description": "<h2>Lead Marketing Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 22, Nov 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/lead-marketing-designer</p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to offer innovative, personalized solutions for car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, we aim to simplify and enhance the car ownership experience.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Lead Marketing Designer</strong>, a hands-on creative leader responsible for translating strategy into compelling visuals and impactful campaigns. This role involves leading creative direction across digital marketing, brand campaigns, and performance advertising, managing a small design team while remaining involved in execution.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead and manage a team of marketing designers.</li>\n<li>Develop and execute creative strategy across paid, owned, and social channels.</li>\n<li>Drive campaign concepts for product launches, seasonal promotions, and partnerships.</li>\n<li>Ensure a consistent visual identity across Way.com’s global marketing ecosystem.</li>\n<li>Collaborate with Growth, Product, and Content teams to create high-performing visuals.</li>\n<li>Inspire creative excellence and mentor designers to enhance craft quality.</li>\n<li>Balance creative innovation with marketing performance and data-driven decision-making.</li>\n</ul>\n<h3>Preferred Skills and Qualifications</h3>\n<ul>\n<li>6–10 years of experience in marketing design, art direction, or brand design.</li>\n<li>Proven experience leading creative or design teams.</li>\n<li>Strong portfolio showcasing campaign systems, digital storytelling, and ad design.</li>\n<li>Expertise in Figma, Photoshop, Illustrator, After Effects / Premiere Pro.</li>\n<li>Experience in performance design, including understanding CTR, engagement metrics, and creative testing.</li>\n<li>Strong visual storytelling and typography skills.</li>\n<li>A passion for clean, modern, and conversion-friendly design.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact on over 10 million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth paths in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "6-10 Years",
            "Figma",
            "Photoshop",
            "After Effects"
        ],
        "summary": "Lead Marketing Designer at Way.com. Drive creative strategy and visual campaigns across multiple channels. Requires 6-10 years of experience and expertise in design tools."
    },
    {
        "job_title": "Business Development Executive (Software Sales)",
        "company": "Alp Turnkey Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24730",
        "location": "Technopark",
        "closing_date": "08 Nov 2025",
        "job_description": "<h2>Business Development Executive (Software Sales) at Alp Turnkey Solutions (P) LTD</h2>\n<p><strong>Company:</strong> Alp Turnkey Solutions (P) LTD\n<strong>Location:</strong> Module No.5, 4th floor, Gayatri Building, Phase I, Technopark, Kerala\n<strong>Contact Email:</strong> info@alp-ts.com\n<strong>Website:</strong> https://www.alp-ts.com\n<strong>Job Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 08, Nov 2025</p>\n<h3>About the Role:</h3>\n<p>Alp Turnkey Solutions (P) LTD is seeking a dynamic and result-oriented Business Development Executive to drive sales of our diverse software products. This includes LMS, ERP, Websites, Parish Management Software, and other customized software solutions. The ideal candidate will be passionate about sales, comfortable engaging directly with clients, and adept at understanding and articulating the value of our software offerings.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Identify and generate new business opportunities for company software products.</li>\n<li>Conduct client meetings, product demonstrations, and presentations.</li>\n<li>Understand customer requirements and collaborate with the technical team to provide tailored solutions.</li>\n<li>Achieve monthly and quarterly sales targets.</li>\n<li>Maintain strong client relationships and ensure overall customer satisfaction.</li>\n<li>Conduct a minimum of 5 direct client meetings daily.</li>\n</ul>\n<h3>Preferred Skills &amp; Experience:</h3>\n<ul>\n<li>Minimum 1 year of experience in software or IT product sales. Freshers are also encouraged to apply.</li>\n<li>Solid understanding of software products such as ERP, LMS, websites, or similar solutions.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Proactive, target-driven attitude with the ability to work independently.</li>\n<li>Fluency in English and Malayalam is essential. Tamil proficiency is an added advantage.</li>\n<li>A two-wheeler is mandatory for this role.</li>\n</ul>\n<h3>Salary &amp; Job Type:</h3>\n<ul>\n<li><strong>Salary:</strong> ₹10,000 per month + Attractive Incentives</li>\n<li><strong>Job Type:</strong> Full-time</li>\n<li><strong>Urgent Opening</strong></li>\n</ul>",
        "tags": [
            "1+ Years",
            "Software Sales",
            "ERP",
            "LMS"
        ],
        "summary": "Seeking a sales executive to drive software product sales, including ERP and LMS. Must meet clients, present solutions, and achieve targets. Two-wheeler required."
    },
    {
        "job_title": "Email Marketing Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24729",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd - Senior B2C Email Marketing Specialist</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/senior-product-email-marketing-specialist-b2c\n<strong>Closing Date:</strong> 02, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering every mile for over 10 million customers through services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions that transform car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies, and awarded top Product in Insurance by UnitQ, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Senior B2C Email Marketing Specialist</h3>\n<p><strong>Experience:</strong> 4 to 6 Years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a results-driven, detail-oriented Senior B2C Email Marketing Specialist to lead our product-focused email marketing efforts. This role demands deep expertise in Mailchimp, a strategic approach to customer engagement, and the ability to drive product growth, retention, and conversions through data-backed, high-impact campaigns.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Email Strategy &amp; Execution:</strong> Design and implement impactful email marketing strategies that drive engagement, retention, and conversions.</li>\n<li><strong>Campaign Management:</strong> Plan, launch, and optimize campaigns, automations, and workflows using Mailchimp and other platforms.</li>\n<li><strong>Audience Segmentation:</strong> Utilize customer insights to build segmented lists and deliver personalized, targeted messaging.</li>\n<li><strong>Performance Optimization:</strong> Conduct A/B testing on subject lines, content, and CTAs to continuously enhance performance.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner with product, design, and content teams to create visually compelling, high-impact email campaigns.</li>\n<li><strong>Analytics &amp; Reporting:</strong> Track key performance indicators, analyze campaign results, and provide actionable recommendations to improve ROI.</li>\n<li><strong>Compliance &amp; Best Practices:</strong> Ensure all campaigns align with regulations such as CCPA and CAN-SPAM while following industry standards.</li>\n<li><strong>Market Awareness:</strong> Stay informed on emerging email marketing trends, tools, and best practices to maintain a competitive edge.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>4–6 years of hands-on experience in B2C email marketing, ideally within digital product or SaaS environments.</li>\n<li>Proven expertise in Mailchimp, including automation setup, audience segmentation, and performance reporting.</li>\n<li>Solid understanding of customer journey mapping and lifecycle marketing strategies.</li>\n<li>Working knowledge of HTML/CSS for email design is a plus, though not mandatory.</li>\n<li>Strong data-driven approach, with experience using tools such as Google Analytics, UTM tracking, and campaign reporting dashboards.</li>\n<li>Ability to craft engaging, action-oriented email copy that drives conversions.</li>\n<li>Excellent analytical skills with a focus on tracking, measuring, and optimizing campaign performance.</li>\n<li>Proficient in A/B testing and iterative experimentation to improve results.</li>\n<li>Exceptional communication and cross-functional collaboration skills.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "4-6 Years",
            "Mailchimp",
            "B2C Email Marketing",
            "Digital Product"
        ],
        "summary": "Seeking a Senior B2C Email Marketing Specialist with 4-6 years of experience in Mailchimp. Drive product growth and conversions through data-backed, high-impact campaigns."
    },
    {
        "job_title": "Support Engineer/Software Tester Trainee",
        "company": "Alp Turnkey Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24728",
        "location": "Technopark",
        "closing_date": "07 Nov 2025",
        "job_description": "<h2>Support Engineer/Software Tester Trainee</h2>\n<p><strong>Company:</strong> Alp Turnkey Solutions (P) LTD\n<strong>Location:</strong> Module No.5, 4th floor, Gayatri Building, Phase I, Technopark , 695581\n<strong>Website:</strong> https://www.alp-ts.com\n<strong>Contact Email:</strong> info@alp-ts.com</p>\n<p><strong>Closing Date:</strong> 07, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025</p>\n<h3>About the Role:</h3>\n<p>We are looking for motivated trainees to assist in manual and automation testing of our in-house applications, including our LMS, ERP, and other software products. The trainees will also support our clients by conducting product demos, software training sessions, and ensuring smooth usage of our solutions.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Perform manual and automation testing for all applications developed by the company.</li>\n<li>Identify, document, and track software defects.</li>\n<li>Work closely with the development team to ensure product quality and reliability.</li>\n<li>Conduct product demos and training sessions for clients.</li>\n<li>Provide first-level support and feedback for continuous product improvement.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Basic understanding of software testing (manual or automation).</li>\n<li>Good communication and presentation skills.</li>\n<li>Eagerness to learn and adapt to new tools and technologies.</li>\n<li>Attention to detail and problem-solving mindset.</li>\n</ul>\n<h3>Training Duration:</h3>\n<ul>\n<li>6 months (No salary during training period)</li>\n</ul>\n<h3>Post-Training:</h3>\n<ul>\n<li>Eligible for a full-time paid position based on performance.</li>\n</ul>\n<h3>Preferred Skills &amp; Knowledge:</h3>\n<ul>\n<li>Understanding of software testing life cycle (STLC) and bug tracking tools (e.g., Jira, Trello, or similar).</li>\n<li>Familiarity with manual testing and basic knowledge of automation tools (e.g., Selenium, Postman).</li>\n<li>Basic understanding of web technologies (HTML, CSS, databases, APIs).</li>\n<li>Strong analytical and documentation skills.</li>\n<li>Good communication, presentation, and client interaction skills.</li>\n<li>Ability to learn quickly and work in a team-oriented environment.</li>\n</ul>\n<h3>Eligibility:</h3>\n<ul>\n<li>Graduates in Computer Science, IT, Electronics, or related fields preferred.</li>\n<li>Freshers passionate about software testing and client support are welcome.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Software Testing",
            "Manual Testing",
            "Automation Testing"
        ],
        "summary": "Seeking motivated trainees for manual and automation testing of in-house applications. Responsibilities include defect tracking, client demos, and training, with potential for a paid role post-training."
    },
    {
        "job_title": "Product Team Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24725",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Product Manager</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/product-manager\n<strong>Job Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 02 Nov 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions. Recognized by Bloomberg and Andreessen Horowitz, we are transforming car ownership.</p>\n<h3>Job Title</h3>\n<p>Product Manager</p>\n<h3>Work Arrangement</h3>\n<p>On-site</p>\n<h3>Employment Type</h3>\n<p>Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for a Product Manager to lead the development and launch of impactful product features. You will collaborate with engineering, design, and data teams to bring innovative ideas to market swiftly and enhance user experience and business growth.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>End-to-End Product Ownership:</strong> Oversee product features from conception through launch, ensuring alignment with business objectives and delivering high-quality results.</li>\n<li><strong>Data-Driven Decision Making:</strong> Utilize analytics and user feedback to identify opportunities and implement effective product enhancements.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Partner closely with engineering, design, and data teams to ensure seamless and timely product releases.</li>\n<li><strong>Performance Management:</strong> Monitor product performance metrics and implement strategies to optimize growth, retention, and user engagement.</li>\n<li><strong>Stakeholder Alignment:</strong> Maintain clear communication regarding priorities, timelines, and progress with all stakeholders to ensure transparency and alignment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 3–7 years in product management.</li>\n<li><strong>Product Strategy &amp; Roadmapping:</strong> Define product vision, goals, and long-term plans, translating them into a prioritized roadmap.</li>\n<li><strong>Data-Driven Decision Making:</strong> Use quantitative and qualitative data to inform choices, validate assumptions, and measure product performance.</li>\n<li><strong>User-Centric Design Thinking:</strong> Apply a creative, iterative approach focused on user needs and experience.</li>\n<li><strong>Stakeholder Management:</strong> Build and maintain positive relationships with stakeholders, ensuring alignment and effective communication.</li>\n<li><strong>Agile Product Development:</strong> Employ flexible, iterative methods for rapid development and adaptation to feedback.</li>\n<li><strong>Market &amp; Competitive Analysis:</strong> Research industry trends, customer behavior, and competitor offerings.</li>\n<li><strong>A/B Testing &amp; Experimentation:</strong> Compare product variations to determine optimal performance.</li>\n<li><strong>Go-To-Market Execution:</strong> Plan and execute successful product launches, including positioning, messaging, and channel selection.</li>\n<li><strong>Wireframing &amp; Prototyping:</strong> Create visual blueprints and interactive mockups for concept testing and development guidance.</li>\n<li><strong>User Research:</strong> Gather and analyze user feedback, observations, and data to understand needs and behaviors.</li>\n<li><strong>Education:</strong> Bachelor’s degree in Engineering or an MBA from a Tier 1 institute.</li>\n<li><strong>Track Record:</strong> Proven experience launching successful user-facing products.</li>\n</ul>\n<h3>Why You Will Love Working With Us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear career growth pathways in a rapidly scaling company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "3-7 Years",
            "Product Management",
            "Data-Driven Decision Making",
            "Agile"
        ],
        "summary": "Product Manager to lead feature development and launch. Requires 3-7 years of experience and strong skills in product strategy, data analysis, and cross-functional collaboration."
    },
    {
        "job_title": "Senior UX/UI Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24724",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Senior UX/UI Designer at Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com</p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<p><strong>Closing Date:</strong> 02, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded Top Product in Insurance by UnitQ, Way.com is revolutionizing car ownership.</p>\n<h3>Job Title: Senior UX Designer</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Senior UX Designer with exceptional UX thinking and a strong eye for UI to create world-class experiences for Way.com's car super-app, impacting millions of users.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead the end-to-end design of core product experiences.</li>\n<li>Solve complex user problems using simple, intuitive interfaces.</li>\n<li>Collaborate closely with Product, Engineering, and Marketing teams to align business goals and user needs.</li>\n<li>Enhance design quality by mentoring team members and establishing design standards.</li>\n<li>Build and validate design solutions through research, prototyping, and usability testing.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>6+ years of experience in UX design with strong UI design capabilities.</li>\n<li>Expertise in user-centered design principles and modern design tools (e.g., Figma).</li>\n<li>A strong portfolio demonstrating impactful product design work.</li>\n<li>Ability to clearly communicate design rationale to stakeholders.</li>\n<li>Experience in leading design for large-scale web and mobile products is a plus.</li>\n</ul>\n<h3>Why You Will Love Working With Us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Receive competitive compensation.</li>\n</ul>\n<h3>Apply Now</h3>\n<p>https://waydot.greythr.com/hire/jobs/senior-uxui-designer</p>",
        "tags": [
            "6+ Years",
            "UX Design",
            "UI Design",
            "Figma"
        ],
        "summary": "Seeking a Senior UX/UI Designer to shape world-class experiences for Way.com's automotive super app. Responsibilities include end-to-end design, problem-solving, and collaboration with cross-functional teams."
    },
    {
        "job_title": "Team Lead - SEO",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24723",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd - Team Lead - SEO</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact:</strong> careers@way.com\n<strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead\n<strong>Job Published:</strong> October 31, 2025\n<strong>Closing Date:</strong> November 02, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to offer innovative, personalized solutions that revolutionize car ownership. Recognized by Bloomberg, Andreessen Horowitz, and UnitQ, we aim to make car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Team Lead - SEO</h3>\n<p><strong>Experience:</strong> 9 - 11 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for a skilled Team Lead, SEO to lead our organic growth and enhance search engine presence. This leadership role involves developing and executing comprehensive SEO strategies, managing a team of SEO specialists, and collaborating cross-functionally to optimize our digital footprint. The ideal candidate has a deep understanding of search algorithms, technical SEO, content strategy, and a passion for driving results.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies:</strong> Define and implement a robust SEO roadmap aligned with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team:</strong> Manage SEO professionals, fostering a culture of learning and performance.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO:</strong> Improve keyword rankings, content performance, and backlink quality for enhanced organic visibility.</li>\n<li><strong>Technical SEO Management:</strong> Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making:</strong> Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration:</strong> Work with content creators, developers, and product teams to integrate SEO best practices.</li>\n<li><strong>Local &amp; Mobile SEO Optimization:</strong> Enhance local search presence and mobile-first indexing strategies.</li>\n<li><strong>Competitive &amp; Market Analysis:</strong> Conduct SEO audits, monitor competitor strategies, and identify new opportunities.</li>\n<li><strong>SEO Performance Reporting:</strong> Provide insights and actionable recommendations through detailed reports and dashboards.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data for data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li>Understanding of PPC advertising and its relationship with organic search.</li>\n<li>Experience in a high-growth startup or fast-paced environment.</li>\n<li>Familiarity with social media marketing and its impact on SEO.</li>\n<li>Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "9-11 Years",
            "SEO",
            "Google Analytics",
            "SEMrush"
        ],
        "summary": "Lead SEO strategies and team for Way.com, a dominant US auto super app. Requires 9-11 years of experience in SEO, technical optimization, and data analysis."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24722",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com\n<strong>Closing Date:</strong> 02, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025</p>\n<h2>About Us</h2>\n<p>Way.com is America's dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h2>Job Title: Project Manager</h2>\n<ul>\n<li><strong>Experience:</strong> 8+ years</li>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n</ul>\n<h2>Role Overview</h2>\n<p>We are seeking a seasoned Project Manager with over 8 years of experience to lead and execute strategic projects from inception to completion. The ideal candidate will possess strong leadership, domain expertise, and hands-on execution skills to ensure successful project delivery within scope, timeline, and budget.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Lead the full project lifecycle across multiple medium to large-scale initiatives.</li>\n<li>Define and manage project scope, objectives, deliverables, and success criteria.</li>\n<li>Develop and execute detailed project plans, including resource allocation, timelines, and budgets.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate when required.</li>\n<li>Manage stakeholder relationships, ensuring clear communication and alignment at all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams to ensure smooth execution.</li>\n<li>Ensure quality standards and compliance with organizational processes and policies.</li>\n<li>Mentor and guide junior team members to build project management capability within the team.</li>\n<li>Promote best practices and continuous improvement in project delivery.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s degree in Engineering, Business Administration, or a related field (Master’s degree is an advantage).</li>\n<li>8+ years of proven project management experience, preferably in a fintech platform.</li>\n<li>Strong expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in project management tools (e.g., MS Project, JIRA, Asana, Trello).</li>\n<li>In-depth knowledge of Agile, Waterfall, or hybrid project management methodologies.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities under pressure.</li>\n<li>Certifications such as PMP, PRINCE2, or Agile (Scrum Master/SAFe) are highly preferred.</li>\n<li>Experience with tools like MPP is a plus.</li>\n<li>Ability to work with multiple teams, driving execution and results.</li>\n</ul>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h2>Apply Now:</h2>\n<p>https://waydot.greythr.com/hire/jobs/project-manager</p>",
        "tags": [
            "8+ Years",
            "Agile",
            "Fintech",
            "Project Management"
        ],
        "summary": "Project Manager needed with 8+ years experience to lead strategic projects. Must manage full lifecycle, stakeholders, and cross-functional teams for successful delivery."
    },
    {
        "job_title": "Python Developer 2-4Yrs",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24721",
        "location": "Technopark",
        "closing_date": "09 Nov 2025",
        "job_description": "<h2>Python Developer</h2>\n<p><strong>Company:</strong> GNX Digital Solutions (P) Ltd\n<strong>Location:</strong> Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, Kerala, 695581\n<strong>Website:</strong> https://gnxsolutions.in</p>\n<p><strong>Closing Date:</strong> 09, November 2025\n<strong>Job Published:</strong> 31, October 2025\n<strong>Contact Email:</strong> hr@gnxsolutions.in</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop, test, and maintain efficient, reusable, and reliable Python code.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Work with frameworks such as Django, Flask, or FastAPI for web and API development.</li>\n<li>Integrate data storage solutions including PostgreSQL, MySQL, or MongoDB.</li>\n<li>Build and consume RESTful APIs and handle JSON data.</li>\n<li>Participate in code reviews and contribute to continuous improvement of code quality.</li>\n<li>Debug, troubleshoot, and optimize performance of existing applications.</li>\n<li>Work with version control tools like Git and follow Agile/Scrum development methodologies.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>2–4 years of hands-on experience in Python development.</li>\n<li>Strong knowledge of OOP concepts and design patterns.</li>\n<li>Experience with web frameworks such as Django/Flask/FastAPI.</li>\n<li>Proficiency in working with databases (SQL &amp; NoSQL).</li>\n<li>Familiarity with front-end technologies (HTML, CSS, JavaScript) is an added advantage.</li>\n<li>Understanding of RESTful APIs, unit testing, and CI/CD pipelines.</li>\n<li>Good problem-solving and analytical skills.</li>\n<li>Excellent communication and teamwork abilities.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "Python",
            "Django/Flask/FastAPI",
            "SQL/NoSQL"
        ],
        "summary": "Python Developer needed for GNX Digital Solutions. Responsibilities include coding, API development, and database integration using Python frameworks. Requires 2-4 years of experience."
    },
    {
        "job_title": "SAP BW Consultant",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24720",
        "location": "Technopark",
        "closing_date": "07 Nov 2025",
        "job_description": "<h2>SAP BW Consultant at Reflections Info Systems (P) Ltd</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Job Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 07, Nov 2025</p>\n<h3>Introduction</h3>\n<p>We are looking for candidates with 7+ years of experience for this SAP BW Consultant role.</p>\n<h3>Job Description</h3>\n<p>We are seeking an experienced SAP BW Consultant with a robust background in ABAP development, ECC extractors, and SAP HANA. The ideal candidate will have experience in designing, developing, and implementing SAP BW solutions and BI reporting. A sound understanding of the retail business domain, with desirable knowledge of BW/MM/SD SAP modules and data warehousing concepts &amp; dimensional modeling, is essential.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Understand existing design and implementation of BW data models (InfoProviders, DSO/ADSOs, CompositeProviders, MultiProviders, InfoCubes).</li>\n<li>Document BW transformation rules, BEX formulas, and maintain documentation.</li>\n<li>Integrate BW with front-end tools (BO, Analysis for Office, etc.).</li>\n<li>Work with standard and custom ECC extractors (e.g., extractors 2LIS<em>, 0FI</em>, 0CO*).</li>\n<li>Debug and troubleshoot data extraction and load issues.</li>\n<li>Document ABAP routines in BW transformations.</li>\n<li>Integrate data sources from non-SAP systems via BODS or SD.</li>\n<li>Design and optimize data flows using BW/4HANA or embedded BW.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong>\n- 7+ years of hands-on SAP BW development and support experience.\n- Proficiency in SAP ABAP skills.\n- Proven experience with ECC extractors (standard &amp; custom) across SD, MM, FI, CO modules.\n- Strong understanding of SAP data dictionary objects, modules, and integration with other SAP modules.\n- Strong knowledge of data extraction, transformation, and loading (ETL) processes.\n- Experience with Process Chain, scheduling, and monitoring.\n- Strong knowledge of InfoProviders, InfoCubes, DSOs, and Query Design.</p>\n<p><strong>Secondary Skills:</strong>\n- Good analytical and problem-solving skills, with attention to detail.\n- Effective communication and interpersonal skills to collaborate with cross-functional teams.\n- Ability to work independently and as part of a team in a fast-paced environment.</p>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field.</li>\n<li>SAP BW related certification or relevant SAP certifications are desirable but not mandatory.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice Regarding Fraudulent Job Offers:</strong>\nThis is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment-related emails are sent through the official HR email ID. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "7+ Years",
            "SAP BW",
            "ABAP",
            "SAP HANA"
        ],
        "summary": "Seeking a 7+ years experienced SAP BW Consultant with ABAP, ECC extractors, and SAP HANA skills. Responsibilities include designing, developing, and implementing BW solutions and BI reporting."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24718",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd / Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to offer innovative, personalized solutions that redefine car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, we are dedicated to making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Spanish Customer Success Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused individual to join our team as a Spanish Customer Success Executive in our voice process. This role involves providing excellent customer service to our Spanish-speaking clients and efficiently handling inquiries over the phone with professionalism.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction:</strong> Manage inbound and outbound calls, providing prompt and effective resolutions to customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence:</strong> Deliver empathetic, professional support to ensure a positive customer experience in every interaction.</li>\n<li><strong>Issue Escalation:</strong> Identify, prioritize, and escalate complex cases to the appropriate departments for swift resolution.</li>\n<li><strong>Documentation:</strong> Maintain accurate records of customer interactions and keep databases up to date.</li>\n<li><strong>Performance Goals:</strong> Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge:</strong> Stay informed on company products and services to provide customers with accurate and up-to-date information.</li>\n<li><strong>Team Collaboration:</strong> Work closely with colleagues to foster a supportive, collaborative, and high-performing work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Fluency in both <strong>Spanish and English</strong> (written and spoken) for effective bilingual communication.</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong interpersonal and communication skills, with a patient and empathetic approach.</li>\n<li>Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Spanish",
            "Customer Service",
            "Voice Process"
        ],
        "summary": "Seeking a Spanish Customer Success Executive for a voice process role. This position requires bilingual fluency and excellent customer service skills to support Way.com's US automotive super app users."
    },
    {
        "job_title": "Sales Head - Parking Vertical (India Office)",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24717",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Sales Head - Parking Vertical (India Office)</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/sales-head</p>\n<p><strong>Closing Date:</strong> 02, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to deliver innovative, personalized solutions. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, Way.com is simplifying car ownership.</p>\n<h3>Job Title</h3>\n<p>Head of Sales - Parking Vertical (India Office)</p>\n<h3>Work Arrangement</h3>\n<p>On-site</p>\n<h3>Employment Type</h3>\n<p>Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced and results-oriented Head of Sales to lead our Parking Vertical in the India office. This senior leadership role involves overseeing Business Development Managers, driving revenue growth, setting performance targets, and cultivating a high-performance culture. The ideal candidate must have a proven background in sales strategy, team leadership, and client relationship management.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Develop and implement effective sales strategies to achieve business growth objectives.</li>\n<li>Lead, mentor, and manage a team of Business Development Managers, focusing on accountability, productivity, and performance excellence.</li>\n<li>Build and maintain strong relationships with key clients, stakeholders, and strategic partners.</li>\n<li>Monitor market trends, competitor activities, and customer needs to refine sales approaches and maintain a competitive edge.</li>\n<li>Provide accurate forecasts, pipeline updates, and performance reports to senior leadership.</li>\n<li>Collaborate cross-functionally with marketing, operations, and product teams to ensure the delivery of seamless and customer-centric solutions.</li>\n</ul>\n<h3>Qualifications &amp; Experience</h3>\n<ul>\n<li>Minimum of 10 years of proven sales experience.</li>\n<li>At least 5 years in a senior leadership role.</li>\n<li>Demonstrated success in meeting and exceeding revenue and growth targets.</li>\n<li>Experience managing and developing high-performing sales teams with multiple Business Development Managers.</li>\n<li>Exceptional leadership, negotiation, and communication skills.</li>\n<li>Industry experience in mobility, parking, real estate, or related sectors is preferred.</li>\n</ul>\n<h3>Key Attributes</h3>\n<ul>\n<li>Strategic thinker with a results-driven and growth-oriented mindset.</li>\n<li>Decisive leader who motivates teams and upholds accountability.</li>\n<li>Strong interpersonal skills with the ability to build and sustain long-term client and team relationships.</li>\n<li>Professional, adaptable, and driven to deliver measurable business success.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Sales Strategy",
            "Team Leadership",
            "Client Relationship Management"
        ],
        "summary": "Lead the Parking Vertical sales team to drive revenue growth and implement effective strategies. Requires 10+ years of sales experience and proven leadership skills."
    },
    {
        "job_title": "Digital Marketing & SEO Specialist",
        "company": "Naga Info Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24716",
        "location": "Technopark",
        "closing_date": "28 Nov 2025",
        "job_description": "<h2>Digital Marketing &amp; SEO Specialist</h2>\n<p><strong>Company:</strong> Naga Info Solutions (P) Ltd\n<strong>Location:</strong> Module No 2505, 5th Floor, Yamuna Building, Technopark Phase III, 695583\n<strong>Website:</strong> http://www.nagainfo.com\n<strong>Contact Email:</strong> mail@nagainfo.com</p>\n<p><strong>Job Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 28, Nov 2025</p>\n<h3>About Naga Info Solutions Pvt Ltd</h3>\n<p>Founded in 2009, Naga Info Solutions Pvt Ltd is a fast-growing AI and technology company delivering innovative digital solutions, SaaS products, and automation services to clients across the globe. As we expand our digital presence, we are looking for a passionate and hands-on Digital Marketing &amp; SEO Specialist to drive traffic, engagement, and conversions across channels.</p>\n<h3>Role Overview</h3>\n<p>This role involves planning and executing comprehensive SEO strategies, managing multi-platform content, and producing high-impact content using AI tools. You will play a key role in growing our online visibility, lead generation efforts, and content-driven brand storytelling.</p>\n<p><strong>Note:</strong> Training will be provided on the required AI-based content creation tools.</p>\n<h3>Key Responsibilities</h3>\n<h4>SEO Strategy &amp; Execution</h4>\n<ul>\n<li>Implement on-page, off-page, and technical SEO</li>\n<li>Conduct keyword research, SEO audits, and competitor analysis</li>\n<li>Optimize web pages, meta data, site speed, and internal linking</li>\n<li>Monitor rankings and organic traffic performance</li>\n</ul>\n<h4>AI-Based Content Creation</h4>\n<p>Use tools like ChatGPT, Canva, Pictory, Synthesia, Runway, Jasper, etc. to:\n- Write SEO-optimized blog posts and social copy\n- Create eye-catching visuals and carousels\n- Produce short-form and long-form marketing videos</p>\n<p><em>(Training on these tools will be provided, if needed)</em></p>\n<h4>Multi-Platform Campaign Management</h4>\n<p>Plan, schedule, and publish content across:\n- Website / Blog\n- LinkedIn, Instagram, X (Twitter), Facebook, TikTok\n- YouTube and YouTube Shorts</p>\n<ul>\n<li>Tailor content to suit platform formats and audiences</li>\n<li>Ensure consistency of brand voice and design across channels</li>\n</ul>\n<h4>Analytics &amp; Paid Campaigns</h4>\n<ul>\n<li>Track performance via Google Analytics (GA4), Search Console, SEMrush, Ahrefs</li>\n<li>Run and optimize Google Ads and X (Twitter) Ads</li>\n<li>Measure campaign ROI, lead generation metrics, and traffic KPIs</li>\n<li>Report insights with data-driven recommendations</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>2–4 years of proven experience in digital marketing and SEO</li>\n<li>Solid knowledge of Google tools, SEO practices, and basic HTML/CSS</li>\n<li>Basic familiarity with content creation using tools like Canva or AI platforms</li>\n<li>Strong writing and editing skills with a focus on SEO optimization</li>\n<li>Data-driven mindset with attention to detail</li>\n<li>Excellent communication skills and ability to meet deadlines</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Experience working in AI, SaaS, or tech-driven businesses</li>\n<li>Familiarity with email marketing, webinars, or CRM-based campaigns</li>\n<li>Previous exposure to international SEO and multi-language content</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>A flexible remote/hybrid work model</li>\n<li>Training and hands-on exposure to leading AI marketing tools</li>\n<li>A high-growth role</li>\n<li>A collaborative and forward-thinking team culture</li>\n</ul>\n<h3>To Apply:</h3>\n<p>Send your CV + 2–3 content/campaign samples (blogs, visuals, or video links) to mail@nagainfo.com</p>",
        "tags": [
            "2-4 Years",
            "SEO",
            "AI Content Creation",
            "Google Analytics"
        ],
        "summary": "Seeking a Digital Marketing & SEO Specialist to boost online visibility and lead generation. Responsibilities include SEO strategy, AI-powered content creation, campaign management, and analytics."
    },
    {
        "job_title": "Cloud DevOps Engineer_GCP",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/24715",
        "location": "Technopark",
        "closing_date": "10 Nov 2025",
        "job_description": "<h2>Cloud DevOps Engineer - GCP</h2>\n<p><strong>Company:</strong> GNX Digital Solutions (P) Ltd\n<strong>Location:</strong> Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581\n<strong>Website:</strong> https://gnxsolutions.in\n<strong>Contact Email:</strong> hr@gnxsolutions.in\n<strong>Job Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 10, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>As a GCP Cloud DevOps Engineer, you will own the deployment and operations side of product delivery. You will design scalable GCP infrastructure, build automation pipelines, and manage Kubernetes-based deployments to deliver high availability and faster release cycles. This role involves close collaboration with development, QA, and security teams in a continuous improvement environment.</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Architect, deploy &amp; maintain cloud infrastructure on Google Cloud Platform</li>\n<li>Implement CI/CD pipelines for continuous delivery (Jenkins/GitHub Actions/Cloud Build)</li>\n<li>Manage container platforms using Docker &amp; Kubernetes (GKE)</li>\n<li>Infrastructure as Code automation using Terraform (primary requirement)</li>\n<li>Production monitoring, performance tuning &amp; incident support</li>\n<li>Cloud networking administration: VPC, Subnets, Load Balancers, Cloud DNS, Firewalls</li>\n<li>Implement security controls using IAM, Service Accounts &amp; Secrets Manager</li>\n<li>Automate tasks with Bash / Python</li>\n<li>Ensure zero-downtime deployments and smooth rollback plans</li>\n<li>Optimize cloud costs, resource utilization &amp; logging strategies</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Technical Expertise Required:</strong></p>\n<ul>\n<li>GKE, Cloud Run, Cloud Functions, Compute Engine</li>\n<li>Cloud Storage, Filestore, PV/PVC</li>\n<li>IAM roles/policies, VPC Service Controls, Cloud Armor</li>\n<li>Cloud NAT, Cloud Load Balancers (L4/L7), Cloud DNS</li>\n<li>Cloud Monitoring, Cloud Logging, Alerting</li>\n<li>Deployment strategies, HPA, Ingress, ConfigMaps &amp; Secrets</li>\n<li>Experience with Helm (plus point)</li>\n<li>Jenkins, GitHub Actions, GitLab CI, Cloud Build</li>\n<li>Automated deployments for microservices</li>\n</ul>\n<p><strong>Additional Skills:</strong></p>\n<ul>\n<li>Linux administration</li>\n<li>Bash / Python scripting skills</li>\n<li>DNS, SSL/TLS, routing, troubleshooting latency &amp; connectivity issues</li>\n</ul>\n<p><strong>Certifications &amp; Advanced Practices:</strong></p>\n<ul>\n<li>GCP Certifications (ACE / Professional DevOps)</li>\n<li>Experience with Prometheus + Grafana</li>\n<li>FinOps basics – cost optimization</li>\n<li>SRE practices – SLIs, SLOs, Error Budgets</li>\n</ul>",
        "tags": [
            "5+ Years",
            "GCP",
            "Kubernetes",
            "Terraform"
        ],
        "summary": "GCP Cloud DevOps Engineer to design, deploy, and operate scalable cloud infrastructure. Implement CI/CD pipelines, manage Kubernetes, and ensure high availability."
    },
    {
        "job_title": "Senior Engineer - QA",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24714",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Senior QA Automation Engineer at Way Dot Com (P) Ltd</h2>\n<p><strong>Location:</strong> Thiruvananthapuram, India\n<strong>Date Published:</strong> 31-Oct-2025\n<strong>Closing Date:</strong> 02-Nov-2025\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-qa-engineer</p>\n<h3>About Us</h3>\n<p>Way.com is America's leading automotive super app, serving over 10 million customers with services including auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to offer innovative and personalized solutions that redefine car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz's list of fastest-growing companies, and awarded UnitQ's top Product in Insurance, Way.com simplifies and enhances the car ownership experience.</p>\n<h3>Job Title: Senior QA Automation Engineer</h3>\n<ul>\n<li><strong>Experience Required:</strong> 5–8 years</li>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n</ul>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced Senior QA Automation Engineer with strong expertise in Java-based test automation. This role involves designing and maintaining scalable automation frameworks, developing robust testing strategies, and collaborating with cross-functional teams to integrate quality throughout the software development lifecycle.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Test Strategy &amp; Design:</strong> Translate complex business requirements into detailed test strategies and plans, ensuring thorough test coverage.</li>\n<li><strong>Automation Frameworks:</strong> Design, build, and enhance scalable automation frameworks using Core Java and modern testing tools.</li>\n<li><strong>Collaboration &amp; Quality Ownership:</strong> Work closely with developers, product managers, and QA teams to embed quality throughout the software development lifecycle.</li>\n<li><strong>Functional &amp; E2E Testing:</strong> Perform comprehensive functional and end-to-end testing to validate accuracy, performance, and user experience.</li>\n<li><strong>Automation Execution:</strong> Develop and execute automated test scripts for web and API testing using Selenium WebDriver, Rest Assured, and related technologies.</li>\n<li><strong>CI/CD Enablement:</strong> Integrate test automation into CI/CD pipelines (e.g., Jenkins) to support continuous testing and accelerated release cycles.</li>\n<li><strong>Issue Resolution:</strong> Monitor, troubleshoot, and resolve automation failures to maintain test suite reliability.</li>\n<li><strong>Documentation &amp; Standards:</strong> Create and maintain reusable test cases, structured scripts, and clear documentation to support scalability.</li>\n<li><strong>Defect Tracking:</strong> Record, track, and collaborate with engineering teams to ensure timely defect resolution and quality delivery.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>5+ years of experience in test automation using Java.</li>\n<li>Strong knowledge of Core Java, including object-oriented principles, exception handling, multi-threading, and file handling.</li>\n<li>Proficiency in Java Collections (Lists, Sets, Maps, Queues) with a solid understanding of data structures and algorithms.</li>\n<li>Hands-on experience with Selenium WebDriver, including dynamic element handling, custom wait strategies, and cross-browser compatibility.</li>\n<li>Proficiency in REST API testing using Rest Assured, including request modeling, authentication, and API validation.</li>\n<li>Experience with Jenkins or similar CI/CD tools for test suite integration and automation pipeline maintenance.</li>\n<li>Familiarity with load and performance testing tools (e.g., JMeter, K6, Locust) and the ability to identify performance bottlenecks.</li>\n<li>Strong attention to detail, problem-solving skills, and the ability to work both independently and collaboratively in a fast-paced environment.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Seeking a Senior QA Automation Engineer with 5-8 years of Java experience. Design and maintain automation frameworks, conduct testing, and integrate quality into the SDLC."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/24712",
        "location": "Technopark",
        "closing_date": "02 Nov 2025",
        "job_description": "<h2>Senior Java Engineer at Way Dot Com</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact:</strong> careers@way.com</p>\n<p><strong>About Us:</strong>\nWay.com is America's dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide innovative solutions. Recognized by Bloomberg and Andreessen Horowitz, we are making car ownership easier, more affordable, and rewarding.</p>\n<p><strong>Job Title:</strong> Senior Java Engineer\n<strong>Experience Required:</strong> 5–12 years\n<strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Role Overview:</strong>\nWe are seeking an experienced Senior Java Developer with deep expertise in Java, Spring Boot, MySQL, and RESTful APIs. This role involves architecting, developing, and optimizing high-performance, scalable applications, establishing technical standards, and mentoring junior team members.</p>\n<p><strong>Roles and Responsibilities:</strong></p>\n<ul>\n<li>Build, enhance, and maintain Java applications leveraging the Spring Boot framework, ensuring robust, scalable, and high-quality solutions.</li>\n<li>Partner with Product Owners, Architects, and other stakeholders to convert business needs into effective technical designs.</li>\n<li>Develop and integrate RESTful APIs to support application features and streamline system interoperability.</li>\n<li>Continuously improve application performance through code optimization, refactoring, and scalability enhancements.</li>\n<li>Lead code reviews, guide and mentor junior developers, and help drive adoption of best engineering practices.</li>\n<li>Keep abreast of advancements in the Java ecosystem and proactively apply relevant technologies.</li>\n<li>Diagnose, troubleshoot, and resolve complex technical issues to maintain system stability and reliability.</li>\n<li>Uphold industry standards and organizational guidelines throughout the software development lifecycle.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent work experience).</li>\n<li>Minimum of 5+ years of professional Java development experience, with strong proficiency in Spring Boot and MySQL.</li>\n<li>In-depth knowledge of Java SE and Java EE concepts, including multi-threading, design patterns, and JVM internals.</li>\n<li>Solid experience in designing and implementing RESTful APIs.</li>\n<li>Proficiency in MySQL (or other relational databases) and writing efficient SQL queries.</li>\n<li>Familiarity with modern version control tools, particularly Git.</li>\n<li>Experience working within Agile methodologies (Scrum, Kanban, etc.).</li>\n<li>Strong problem-solving, debugging, and troubleshooting skills.</li>\n<li>Excellent communication skills and ability to collaborate in a team environment.</li>\n<li>Proven ability to mentor and guide junior developers.</li>\n</ul>\n<p><strong>Why you will love working with us?</strong></p>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/senior-java-developer</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "Seeking a Senior Java Engineer with 5-12 years experience in Java, Spring Boot, and MySQL. Responsibilities include developing scalable applications, mentoring, and optimizing performance."
    },
    {
        "job_title": "SAP ABAP Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24710",
        "location": "Technopark",
        "closing_date": "07 Nov 2025",
        "job_description": "<h2>SAP ABAP Developer</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, Kerala, India\n<strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<h3>Job Description</h3>\n<p>Reflections Info Systems is seeking experienced SAP ABAP Developers to join their team. This role requires strong proficiency in SAP ABAP (Advanced Business Application Programming) and experience in designing, developing, and implementing SAP ABAP programs, reports, interfaces, and enhancements.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and enhance SAP applications using ABAP programming language based on functional specifications.</li>\n<li>Debug and fix ABAP programs for incident resolution.</li>\n<li>Work with functional teams to design technical solutions.</li>\n<li>Design and implement custom reports, interfaces, enhancements, and forms (RICEF objects) in SAP systems.</li>\n<li>Perform unit testing, debugging, and troubleshooting of ABAP programs to ensure quality and performance.</li>\n<li>Collaborate with functional consultants and business users to gather requirements and deliver solutions aligned with business needs.</li>\n<li>Provide technical support and expertise for SAP ABAP development activities.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Primary Skills:</strong></li>\n<li>3-5 years of experience as an SAP ABAP Developer, with hands-on experience in ABAP development and customization.</li>\n<li>Proficiency in SAP ABAP (Advanced Business Application Programming) development.</li>\n<li>Experience in designing, developing, and implementing SAP ABAP programs, reports, interfaces, and enhancements.</li>\n<li>Strong understanding of SAP data dictionary objects, modules, and integration with other SAP modules.</li>\n<li>Knowledge of SAP development tools and methodologies.</li>\n<li>Develop OData services, CDS Views for integration with Fiori/UI5 and optimize HANA code.</li>\n<li>Experience with SAP ECC (ERP Central Component) or S/4HANA is preferred.</li>\n<li>Perform code reviews and enforce development standards (SAP Clean Core principles).</li>\n<li>Collaborate in migration projects (ECC to S/4 HANA conversions).</li>\n<li>\n<p>Knowledge of ABAP on HANA optimization techniques preferred.</p>\n</li>\n<li>\n<p><strong>Secondary Skills:</strong></p>\n</li>\n<li>Good analytical and problem-solving skills, with attention to detail.</li>\n<li>Effective communication and interpersonal skills to collaborate with cross-functional teams.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n<li>ABAP on HANA and Fiori/UI5.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field.</li>\n<li>SAP Certified Development Associate – ABAP for SAP NetWeaver or S/4 HANA.</li>\n</ul>\n<p><strong>Application Process:</strong></p>\n<p>Interested candidates should forward their detailed resumes to Careers@reflectionsinfos.com, including their notice period, current, and expected CTC details.</p>\n<p><strong>Important Note:</strong></p>\n<p>Reflections Info Systems (P) Ltd. strictly warns jobseekers against fraudsters demanding payment for job offers. All legitimate communication comes from official company channels (website, LinkedIn, official HR email). Please contact careers@reflectionsinfos.com for any clarifications or to report suspicious activity.</p>",
        "tags": [
            "4+ Years",
            "SAP ABAP",
            "Fiori/UI5",
            "ABAP on HANA"
        ],
        "summary": "Seeking an experienced SAP ABAP Developer with 4+ years of experience. Responsibilities include developing, enhancing, and debugging SAP applications using ABAP and collaborating with functional teams."
    },
    {
        "job_title": "Full Stack Developer (Angular+Nodejs)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24709",
        "location": "Technopark",
        "closing_date": "07 Nov 2025",
        "job_description": "<h2>Full Stack Developer (Angular + Node.js)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com\n<strong>Job Published:</strong> 31, Oct 2025\n<strong>Closing Date:</strong> 07, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>The full-stack software engineer’s primary job role will be to design and develop solutions using NodeJS, and related technologies. This includes developing backend services and corresponding client-side counterparts.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, test, and maintain high-quality web applications using Angular (version 16+).</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Ensure the technical feasibility of UI/UX designs.</li>\n<li>Participate in code reviews, providing constructive feedback to peers.</li>\n<li>Troubleshoot and debug applications, ensuring optimal performance.</li>\n<li>Stay up-to-date with emerging trends and technologies in front-end development.</li>\n<li>Mentor and guide junior developers, fostering a collaborative and productive work environment.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Minimum of 4 years of professional experience in front-end development.</li>\n<li>Strong proficiency in Angular (version 16+) and related technologies.</li>\n<li>Node JS, Nest JS, Kafka, Redis, Javascript, HTML, CSS</li>\n<li>RESTful API integration</li>\n<li>Experience working with Docker and containerized applications</li>\n<li>Experience working with Kubernetes or other container orchestration tools</li>\n<li>Hands-on knowledge and understanding of AWS environments</li>\n<li>Experience in full-stack development</li>\n<li>Knowledge of RDBMS and Document Database</li>\n<li>Experience with Agile and Scrum development methodologies</li>\n<li>Exposure to continuous integration (CI/CD)</li>\n<li>Knowledge of version control systems such as Git and TFS</li>\n<li>Good analytical and problem-solving skills</li>\n<li>Up to date knowledge of latest technologies, tools, and platforms</li>\n<li>Ability to complete tasks with minimum supervision</li>\n<li>Ability to play a leadership role</li>\n</ul>\n<p><strong>Key Technologies:</strong></p>\n<ul>\n<li>Node JS</li>\n<li>Nest JS framework</li>\n<li>Angular</li>\n<li>Kafka / Event architecture / RabbitMQ</li>\n<li>Redis / Caching</li>\n<li>Javascript</li>\n<li>HTML, CSS</li>\n<li>Microservices &amp; Cloud</li>\n<li>Knowledge / Understanding in continuous integration (CI/CD)</li>\n<li>RDBMS/NoSQL/MongoDB</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Knowledge in Laravel is an addon.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact <strong>careers@reflectionsinfos.com</strong> for any clarification/ alerts on this subject.</p>",
        "tags": [
            "4+ Years",
            "Angular",
            "Node.js",
            "AWS"
        ],
        "summary": "Seeking a Full Stack Developer with Angular (16+) and Node.js expertise. Responsibilities include designing, developing, and optimizing web applications, collaborating with teams, and mentoring junior developers."
    },
    {
        "job_title": "Senior DotNet Developer + Azure",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24708",
        "location": "Technopark",
        "closing_date": "07 Nov 2025",
        "job_description": "<h2>Senior DotNet Developer + Azure</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Closing Date:</strong> 07, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Working Hours:</strong> 12:00 PM - 9:00 PM</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, enhance, document, and maintain robust applications using .NET Core 6/8+, C#, REST APIs, T-SQL, and modern JavaScript/jQuery.</li>\n<li>Integrate and support third-party APIs and external services.</li>\n<li>Collaborate across cross-functional teams to deliver scalable solutions across the full technology stack.</li>\n<li>Identify, prioritize, and execute tasks throughout the Software Development Life Cycle (SDLC).</li>\n<li>Participate in Agile/Scrum ceremonies and manage tasks using Jira.</li>\n<li>Understand technical priorities, architectural dependencies, risks, and implementation challenges.</li>\n<li>Troubleshoot, debug, and optimize existing solutions with a strong focus on performance and reliability.</li>\n</ul>\n<h3>Required Qualifications &amp; Skills:</h3>\n<ul>\n<li>8+ years of hands-on development experience with C#, .NET Core 6/8+, Entity Framework / EF Core.</li>\n<li>Experience with JavaScript, jQuery, REST APIs.</li>\n<li>Expertise in MS SQL Server, including complex SQL queries, Stored Procedures, Views, Functions, Packages, Cursors, Tables, and Object Types.</li>\n<li>Skilled in unit testing with XUnit, MSTest.</li>\n<li>Strong in software design patterns, system architecture, and scalable solution design.</li>\n<li>Ability to lead and inspire teams through clear communication, technical mentorship, and ownership.</li>\n<li>Strong problem-solving and debugging capabilities.</li>\n<li>Ability to write reusable, testable, and efficient code.</li>\n<li>Develop and maintain frameworks and shared libraries to support large-scale applications.</li>\n<li>Excellent technical documentation, communication, and leadership skills.</li>\n<li>Experience with Microservices and Service-Oriented Architecture (SOA).</li>\n<li>Experience in API Integrations.</li>\n</ul>\n<h3>Azure Cloud Services Experience (2+ years):</h3>\n<ul>\n<li>Azure Functions</li>\n<li>Azure Durable Functions</li>\n<li>Azure Service Bus, Event Grid, Storage Queues</li>\n<li>Blob Storage, Azure Key Vault, SQL Azure</li>\n<li>Application Insights, Azure Monitoring</li>\n</ul>\n<h3>Secondary Skills (Familiarity/Experience):</h3>\n<ul>\n<li>AngularJS, ReactJS, and other front-end frameworks.</li>\n<li>Azure API Management (APIM).</li>\n<li>Azure Containerization and Orchestration (e.g., AKS/Kubernetes).</li>\n<li>Azure Data Factory (ADF) and Logic Apps.</li>\n<li>Application Support and operational monitoring.</li>\n<li>Azure DevOps - CI/CD pipelines (Classic / YAML).</li>\n</ul>\n<h3>Application Process:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Be aware of potential fraudsters demanding fees for job offers. Reflections Info Systems (P) Ltd never asks for payment. Official communication is solely through the company website or LinkedIn, and all employment-related emails originate from the official HR email ID. For any clarifications or alerts, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "8+ Years",
            ".NET Core",
            "Azure",
            "SQL Server"
        ],
        "summary": "Seeking an experienced Senior DotNet Developer with 8+ years in .NET Core, C#, and SQL Server. Must have 2+ years of Azure cloud services experience. Apply to Careers@reflectionsinfos.com."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24707",
        "location": "Technopark",
        "closing_date": "07 Nov 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 07, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a seasoned Technical Delivery Manager with 14+ years of experience to oversee the successful delivery of complex technical projects and solutions. The ideal candidate will have a strong background in technology, exceptional project management skills, and the ability to collaborate effectively with cross-functional teams. This role requires end-to-end ownership of project delivery, ensuring alignment with business goals, managing stakeholder expectations, and driving technical excellence.</p>\n<h3>Responsibilities:</h3>\n<p><strong>Project Delivery Management:</strong>\n- Oversee the planning, execution, and delivery of multiple technical projects.\n- Manage project scope, timelines, budgets, risks, and quality.\n- Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n<p><strong>Team Leadership:</strong>\n- Lead and mentor cross-functional technical teams, fostering collaboration and innovation.\n- Conduct regular performance reviews and provide growth opportunities for team members.</p>\n<p><strong>Stakeholder Engagement:</strong>\n- Act as a bridge between technical teams, business stakeholders, and clients.\n- Communicate project status, risks, and solutions effectively to all stakeholders.</p>\n<p><strong>Technical Expertise:</strong>\n- Collaborate with architects and engineers to define technical solutions.\n- Provide input on architecture, design, and implementation strategies.</p>\n<p><strong>Process Improvement:</strong>\n- Identify opportunities to improve project delivery processes and tools.\n- Implement best practices in software development and delivery.</p>\n<p><strong>Risk and Issue Management:</strong>\n- Proactively identify project risks and develop mitigation strategies.\n- Resolve technical and operational challenges in a timely manner.</p>\n<p><strong>Customer Focus:</strong>\n- Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</p>\n<h3>Preferred Skills:</h3>\n<p><strong>Experience:</strong>\n- 14 years of experience in technology delivery roles, including hands-on development and leadership responsibilities.\n- Proven experience in delivering large-scale, complex projects with diverse teams.\n- Manage P&amp;L for a portfolio of accounts, ensuring revenue growth and profitability.\n- Plan and manage team ramp-ups and ramp-downs using a mix of pyramid planning, external hiring, and internal sourcing.\n- Drive account management activities including financial tracking, invoice collection, margin improvements, and resource planning.\n- Build strong client relationships through regular interactions, QBRs, and on-site visits.\n- Support account mining by identifying new opportunities, preparing proposals, and influencing stakeholders to grow the business.</p>\n<p><strong>Technical Expertise:</strong>\n- Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.\n- Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</p>\n<p><strong>Project Management:</strong>\n- Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.\n- Certification such as PMP, CSM, or equivalent is an advantage.</p>\n<p><strong>Leadership and Communication:</strong>\n- Excellent team leadership, people management, and conflict resolution skills.\n- Strong communication, presentation, and negotiation abilities.</p>\n<h3>Education:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Experience in managing geographically distributed teams.</li>\n<li>Familiarity with ITIL practices and frameworks.</li>\n<li>Strong business acumen with the ability to align technical goals with business strategy.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Job Scams:</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "14+ Years",
            "Project Management",
            "Cloud Technologies",
            "Agile"
        ],
        "summary": "Seeking a seasoned Technical Delivery Manager with 14+ years of experience to lead complex project delivery. Responsibilities include team leadership, stakeholder management, and ensuring technical excellence."
    },
    {
        "job_title": "Technical Project Manager (Application Development)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/24706",
        "location": "Technopark",
        "closing_date": "07 Nov 2025",
        "job_description": "<h2>Technical Project Manager (Application Development)</h2>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Closing Date:</strong> 07, Nov 2025\n<strong>Job Published:</strong> 31, Oct 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>We are looking for a Technical Project Manager (Tech PM) with 13+ years of experience to lead the end-to-end execution of custom application development and integration projects. The role primarily focuses on projects built on .NET stacks with modern client frameworks and integration platforms. The ideal candidate will possess a strong technical foundation coupled with project delivery expertise, enabling them to drive complex, cross-functional initiatives from discovery through production rollout. This position requires hands-on experience across the entire software/product development lifecycle, including planning, estimation, design, development, testing, and release, while collaborating closely with engineering, product, and client stakeholders.</p>\n<h3>Job Description</h3>\n<ul>\n<li>Manage end-to-end delivery of custom software development and integration projects using Java, .NET, and related technologies.</li>\n<li>Create and maintain project plans, define timelines, identify dependencies, and track progress.</li>\n<li>Coordinate with cross-functional teams including developers, QA, UI/UX, and DevOps to ensure smooth execution.</li>\n<li>Oversee all stages of the SDLC: requirements finalization, development, integration, testing (unit, system, UAT, NFR), and deployment.</li>\n<li>Work closely with architects and leads to ensure alignment with technical direction and design.</li>\n<li>Identify and manage risks, scope changes, and schedule adjustments proactively.</li>\n<li>Serve as the primary point of contact for clients and stakeholders, providing regular updates and resolving issues.</li>\n<li>Ensure quality and timely delivery through effective team coordination and clear communication.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Technical &amp; Delivery Expertise</strong></p>\n<ul>\n<li>13+ years of overall IT experience, with 4–6 years of Technical Project Management experience.</li>\n<li>Strong understanding of custom application development on Java/.NET stacks.</li>\n<li>Experience managing:</li>\n<li>Backend/API development</li>\n<li>Integration using tools like Apache Camel, IBM Integration Stack</li>\n<li>Database interactions (Oracle, SQL Server)</li>\n<li>Client-side development using React/Angular</li>\n<li>Deployment on cloud platforms (AWS, Azure)</li>\n<li>Familiarity with Microservices architecture, CI/CD pipelines, and DevOps practices.</li>\n</ul>\n<p><strong>Project Management</strong></p>\n<ul>\n<li>Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li>Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.</li>\n<li>Tools: Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</li>\n</ul>\n<p><strong>Secondary Skills</strong></p>\n<ul>\n<li>Experience managing globally distributed teams.</li>\n<li>Strong understanding of enterprise-level integrations and technology ecosystems.</li>\n</ul>\n<p><strong>Soft Skills</strong></p>\n<ul>\n<li>Excellent communication and stakeholder engagement capabilities.</li>\n<li>Strong leadership, problem-solving, and organizational skills.</li>\n<li>Ability to articulate technical topics to both technical and non-technical audiences.</li>\n</ul>\n<h3>Important Notes for Applicants:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Job Scams Alert:</strong> Please be aware that some fraudsters may promise jobs with Reflections Info Systems for a fee. Reflections Info Systems never solicits payment for job opportunities. We contact candidates exclusively through our official website or LinkedIn, and all employment-related communications are sent from our official HR email address. For any clarification or alerts regarding this subject, please contact careers@reflectionsinfos.com.</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Project Management",
            "Java"
        ],
        "summary": "Seeking an experienced Technical Project Manager for application development and integration projects. Must lead end-to-end delivery, manage SDLC, and collaborate with stakeholders."
    }
]