[
    {
        "job_title": "Digital Marketing Intern",
        "company": "Valoriz Digital Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21222/410",
        "location": "Infopark",
        "closing_date": "03 Dec 2025",
        "job_description": "<h2>Digital Marketing Intern</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Assist in social media content creation and basic digital marketing activities.</li>\n<li>Conduct market research and analysis across various domains and websites, including TAM/SAM/SOM assessments, to identify business opportunities.</li>\n<li>Support lead generation efforts across digital platforms.</li>\n<li>Help with SEO, keyword research, and campaign coordination.</li>\n<li>Track basic performance metrics and prepare reports.</li>\n<li>Stay updated with current digital marketing trends.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Strong interest in digital marketing and willingness to learn.</li>\n<li>Basic understanding of social media, SEO, and lead generation.</li>\n<li>MBA in Marketing is mandatory for this role.</li>\n<li>Good communication and analytical skills.</li>\n<li>Ability to work collaboratively in a fast-paced environment.</li>\n</ul>\n<p><strong>Duration:</strong> 3 months (Unpaid)</p>\n<p><strong>Location:</strong> Valoriz Digital, Technopark, Trivandrum</p>\n<p><strong>Note:</strong> Interns who demonstrate exceptional performance during the internship will be offered a full-time opportunity with strong career growth in marketing.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@valoriz.com</p>",
        "tags": [
            "MBA in Marketing",
            "Digital Marketing",
            "SEO",
            "Social Media"
        ],
        "summary": "Digital Marketing Intern to assist with content creation, market research, and lead generation. Requires MBA in Marketing and basic digital marketing knowledge."
    },
    {
        "job_title": "Senior Software Engineer – Trade Finance Systems",
        "company": "KL Koncepts Lab Media and IT Park",
        "url": "https://infopark.in/company-jobs/details/21220/332",
        "location": "Infopark",
        "closing_date": "05 Dec 2025",
        "job_description": "<h2>Senior Software Engineer – Trade Finance Systems</h2>\n<p><strong>About the Role:</strong></p>\n<p>We’re looking for a seasoned software developer with strong expertise in both Java and Python to join our engineering team building mission-critical systems in the trade finance space. You’ll work on high-throughput applications, intelligent document processing pipelines, and backend services that support banks and financial institutions globally. This role requires deep technical versatility and an understanding of the unique demands of financial services software.</p>\n<p><strong>What You’ll Do:</strong></p>\n<ul>\n<li>Design, develop, and maintain enterprise applications supporting trade finance operations including letters of credit, guarantees, documentary collections, and compliance workflows.</li>\n<li>Build performant APIs and integration layers.</li>\n<li>Contribute to data processing and automation capabilities.</li>\n<li>Work closely with product and domain experts to translate business requirements into robust solutions.</li>\n<li>Participate in architectural decisions as we scale our platform.</li>\n</ul>\n<p><strong>Required Experience:</strong></p>\n<p><strong>Java Skills:</strong></p>\n<ul>\n<li>5+ years of professional Java development (Java 8+, preferably Java 11+)</li>\n<li>Strong experience with Spring Framework (Spring Boot, Spring MVC, Spring Security)</li>\n<li>Proficiency with Java EE/Jakarta EE ecosystems including JSP and Servlets</li>\n<li>Understanding of JVM internals, garbage collection tuning, and performance optimization</li>\n</ul>\n<p><strong>Python Skills:</strong></p>\n<ul>\n<li>5+ years of professional Python development (Python 3.8+)</li>\n<li>Experience with web frameworks such as Django, Flask, or FastAPI</li>\n<li>Familiarity with data processing libraries (pandas, NumPy) and async patterns (asyncio, Celery)</li>\n<li>Understanding of Python performance optimization and profiling</li>\n</ul>\n<p><strong>Core Technical Skills:</strong></p>\n<ul>\n<li>Experience designing and building RESTful APIs and microservices</li>\n<li>Strong proficiency with relational databases (PostgreSQL, Oracle, or MySQL) and writing performant SQL</li>\n<li>Familiarity with messaging systems (Kafka, RabbitMQ, or JMS)</li>\n<li>Experience with caching strategies (Redis, Ehcache)</li>\n<li>Solid understanding of build tools, version control (Git), and CI/CD pipelines</li>\n</ul>\n<p><strong>Performance &amp; Systems:</strong></p>\n<ul>\n<li>Demonstrated experience building or maintaining high-performance, low-latency systems</li>\n<li>Experience with profiling, optimization, and debugging in both Java and Python environments</li>\n<li>Understanding of concurrent and parallel processing patterns</li>\n</ul>\n<p><strong>Domain Experience:</strong></p>\n<ul>\n<li>3+ years working in BFSI (Banking, Financial Services, and Insurance)</li>\n<li>Exposure to trade finance, payments, or capital markets systems is highly desirable</li>\n<li>Understanding of financial messaging standards (SWIFT MT/MX, ISO 20022) is a plus</li>\n</ul>\n<p><strong>Good to Have:</strong></p>\n<ul>\n<li>Experience with microservices architecture and containerization (Docker, Kubernetes)</li>\n<li>Familiarity with cloud platforms (AWS, Azure, or GCP)</li>\n<li>Exposure to ML/NLP pipelines or document processing systems (OCR, text extraction)</li>\n<li>Knowledge of API security patterns (OAuth2, JWT)</li>\n<li>Understanding of regulatory compliance in financial services (AML, KYC, sanctions)</li>\n<li>Experience integrating with enterprise systems via SOAP, XML, or legacy protocols</li>\n</ul>\n<p><strong>What We Value:</strong></p>\n<ul>\n<li>Ability to choose the right tool for the job and move fluidly between languages and paradigms</li>\n<li>Strong problem-solving skills with attention to both performance and maintainability</li>\n<li>Clear communication when explaining technical decisions or collaborating across teams</li>\n<li>Genuine interest in the trade finance domain and willingness to learn its complexities</li>\n<li>Self-driven approach balanced with collaborative teamwork</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@konceptslab.com</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Python",
            "Trade Finance"
        ],
        "summary": "Seeking a Senior Software Engineer proficient in Java and Python for trade finance systems. Design, develop, and maintain high-throughput applications and backend services globally."
    },
    {
        "job_title": "CRM Manager & Performance Marketer",
        "company": "Titan Tech Emirates Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21223/313",
        "location": "Infopark",
        "closing_date": "07 Dec 2025",
        "job_description": "<h2>CRM Manager &amp; Performance Marketer</h2>\n<p><strong>1. CRM &amp; Lead Management (Zoho Preferred)</strong>\n- Manage CRM operations, preferably using Zoho CRM.\n- Handle all aspects of lead management, including capture, segmentation, scoring, and nurturing.\n- Build automated workflows to ensure a seamless handoff of qualified leads to the Sales team.\n- Generate weekly funnel reports and dashboards to track progress and identify trends.</p>\n<p><strong>2. Email Automation &amp; Campaign Management</strong>\n- Develop and implement drip campaigns and automated email workflows.\n- Conduct A/B testing to continuously optimize email performance.\n- Monitor key metrics such as deliverability, open rates, click-through rates (CTR), and conversion rates.</p>\n<p><strong>3. Webinar Marketing &amp; Coordination</strong>\n- Set up registration pages, send automated reminders, and manage follow-up communications.\n- Coordinate with speakers and provide backend support for webinars.\n- Analyze attendee behavior and conversion funnel to improve webinar effectiveness.</p>\n<p><strong>4. Paid Performance Marketing (PPC)</strong>\n- Execute and manage paid campaigns across Meta, Google, and LinkedIn platforms.\n- Monitor Cost Per Lead (CPL), budget utilization, and audience targeting strategies.\n- Build retargeting funnels to engage high-intent users and drive conversions.</p>\n<p><strong>Skills Required</strong>\n- Proficiency in Zoho CRM (highly preferred).\n- Experience with various email automation tools.\n- Hands-on experience managing paid campaigns on Meta and Google Ads.\n- Strong analytical and reporting skills.\n- Excellent communication and coordination abilities.</p>\n<p><strong>What Success Looks Like</strong>\n- Clean CRM data and seamless marketing automation.\n- Increased engagement through effective email workflows.\n- Improved webinar attendance rates and conversion performance.\n- Reduced CPL and a stronger Return on Investment (ROI) for PPC campaigns.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@titantechemirates.com.</p>",
        "tags": [
            "Experience Required",
            "Zoho CRM",
            "PPC",
            "Email Automation"
        ],
        "summary": "Manage CRM and lead nurturing, build email automations, coordinate webinars, and run PPC campaigns across multiple platforms for optimized marketing performance."
    },
    {
        "job_title": "Automation Tester (Selenium c#)",
        "company": "SE-Mentor Solutions",
        "url": "https://infopark.in/company-jobs/details/21219/483",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Automation Tester (Selenium C#)</h2>\n<p>We are hiring Automation Testers.</p>\n<p><strong>Skillsets:</strong></p>\n<ul>\n<li>Relevant experience in Selenium C#</li>\n<li>Good to have experience working in an Automation Test Framework</li>\n<li>Excellent communication skills</li>\n</ul>\n<p><strong>Location:</strong> Thiruvananthapuram/Kochi</p>\n<p><strong>Years of Experience:</strong> 3+ Years</p>\n<p><strong>Notice Period:</strong> Immediate to within 30 Days</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@se-mentor.com</p>",
        "tags": [
            "3+ Years",
            "Selenium",
            "C#",
            "Automation Test Framework"
        ],
        "summary": "Seeking an Automation Tester with 3+ years of experience in Selenium C#. Must have excellent communication skills and immediate availability."
    },
    {
        "job_title": "Technical/Application Support Executive",
        "company": "Ynot Infosolutions",
        "url": "https://infopark.in/company-jobs/details/21215/262",
        "location": "Infopark",
        "closing_date": "13 Dec 2025",
        "job_description": "<h2>Technical/Application Support Executive</h2>\n<p>We are seeking a Technical/Application Support Executive with strong knowledge of e-commerce platforms, website workflows, and web application features. The primary role is to handle customer queries, guide users through various e-commerce functionalities, and explain how websites and web applications operate. Candidates should be able to clearly communicate processes, provide functional support, and ensure a smooth customer experience.</p>\n<p>Basic technical knowledge (web development or mobile app concepts) is an added advantage, but not mandatory.</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Responsible for addressing customer inquiries, delivering accurate information, guiding users on product or service utilization, and providing necessary operational support.</li>\n<li>Understand the customer requirements and provide step-by-step technical guidance.</li>\n<li>Follow up with customers to ensure issue resolution and satisfaction.</li>\n<li>Maintain records of customer interactions and update and prepare basic reports.</li>\n<li>Explain technical steps clearly to non-technical customers.</li>\n<li>Handle calls and emails professionally.</li>\n<li>Provide product walkthroughs and functional support to clients.</li>\n<li>Assist with deployments, basic configurations, and app updates (if required).</li>\n<li>Guide customers in using web and mobile app features effectively.</li>\n<li>Ensure a positive and seamless customer experience.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Customer-oriented approach with patience and professionalism.</li>\n</ul>\n<h3>Job Requirements:</h3>\n<ul>\n<li>Strong knowledge of e-commerce platforms and their key features, such as product catalogs, categories, payment gateways, checkout flow, inventory management, order tracking, user accounts, and notifications.</li>\n<li>Ability to explain the complete e-commerce workflow clearly to customers (from product browsing to order completion).</li>\n<li>Understanding of web applications, their modules, and how different features function in an online platform.</li>\n<li>Knowledge of websites (both static and dynamic) and the ability to guide customers on how these sites work.</li>\n<li>Ability to explain processes and features in simple terms to non-technical customers.</li>\n<li>Strong communication skills and customer-handling skills for calls, emails, and chats.</li>\n<li>Good problem-solving abilities and attention to detail.</li>\n<li>Ability to manage and respond to multiple customer queries professionally.</li>\n<li>Prior experience in application support, customer support, or e-commerce support is preferred.</li>\n</ul>\n<h3>Skills that are a plus (not mandatory):</h3>\n<ul>\n<li>Basic understanding of web development concepts such as HTML, CSS, JavaScript, PHP, Laravel, or similar frameworks.</li>\n<li>Basic knowledge of mobile app concepts (Android/iOS), app navigation, and feature understanding.</li>\n<li>Familiarity with website hosting, domains, deployments, or basic configuration tasks.</li>\n</ul>\n<h3>Required Qualifications:</h3>\n<ul>\n<li>Graduates with degrees related to the computer science field.</li>\n</ul>\n<h3>Experience:</h3>\n<ul>\n<li>6 months to 1 year in Technical support preferred.</li>\n</ul>\n<p>Interested candidates are invited to submit their resumes, portfolios, and cover letters with the subject line: “Technical/Application Support Executive Application”.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@ynotinfo.com.</p>",
        "tags": [
            "0-1 Years",
            "E-commerce Platforms",
            "Application Support",
            "Customer Service"
        ],
        "summary": "Seeking a Technical/Application Support Executive for an e-commerce role. Responsibilities include handling customer queries, guiding users, and ensuring a smooth experience."
    },
    {
        "job_title": "NOC Technician (0–2 Years)",
        "company": "Braddock Infotech Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21212/51",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>NOC Technician (0-2 Years)</h2>\n<p>Join our 24/7 Network Operations Center (NOC) team and gain hands-on experience in networking, VoIP, system administration, and media streaming support.</p>\n<h3>What You’ll Do:</h3>\n<ul>\n<li>Monitor network, servers, VoIP, and live streaming systems.</li>\n<li>Troubleshoot LAN/WAN, TCP/IP, server, and streaming issues.</li>\n<li>Manage support tickets and communicate with customers.</li>\n<li>Perform routine system administration tasks and escalate issues when needed.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Diploma or Graduate degree in IT, Computer Science, Electronics, or a related IT field.</li>\n<li>0-2 years of experience in a NOC or IT support role.</li>\n<li>Knowledge of networking concepts (DNS, DHCP, TCP/IP), VoIP, and operating systems (Windows/Linux).</li>\n<li>Experience with ticketing tools and strong English communication skills.</li>\n<li>Knowledge of firewalls, routing, and switches is considered a plus.</li>\n<li>Certifications such as CCNA or Network+ are advantageous.</li>\n</ul>\n<h3>Why Join Us:</h3>\n<ul>\n<li>Opportunities for career growth and professional training.</li>\n<li>Exposure to VoIP, media streaming, and diverse network infrastructure.</li>\n<li>A friendly and supportive work environment.</li>\n</ul>\n<h3>Apply Now:</h3>\n<p>Send your CV to careers@braddockinfotech.com with the subject line: “NOC Technician – [Your Name]”. If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@braddockinfotech.com.</p>",
        "tags": [
            "0-2 Years",
            "NOC",
            "Networking",
            "VoIP"
        ],
        "summary": "Seeking a NOC Technician with 0-2 years of experience. Responsibilities include monitoring, troubleshooting network/VoIP/streaming systems, and ticket management. Apply now!"
    },
    {
        "job_title": "Jr. Network Technician – Trainees",
        "company": "Braddock Infotech Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21213/51",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h1>Jr. Network Technician – Trainee</h1>\n<h2>Qualifications:</h2>\n<ul>\n<li>BCA / BSc Computer Science / Diploma in Computer Science/Electronics.</li>\n<li>Certification like CCNA / CCENT / RHCE.</li>\n<li>Knowledge in VoIP / Network problems will be an added advantage.</li>\n</ul>\n<h2>Contact:</h2>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@braddockinfotech.com</p>",
        "tags": [
            "0-2 Years",
            "CCNA",
            "RHCE",
            "VoIP"
        ],
        "summary": "Seeking a Jr. Network Technician trainee with a relevant degree and certifications like CCNA or RHCE. VoIP knowledge is a plus. Apply at careers@braddockinfotech.com."
    },
    {
        "job_title": "Full-Stack Developer (.NET Core + Angular)",
        "company": "Softspace Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21227/361",
        "location": "Infopark",
        "closing_date": "18 Dec 2025",
        "job_description": "<h2>Full-Stack Developer (.NET Core + Angular)</h2>\n<p><strong>Job Title:</strong> Full Stack Developer (.NET Core &amp; Angular)</p>\n<p><strong>Experience:</strong> 3+ Years</p>\n<p><strong>Location:</strong> Cochin</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Type:</strong> Full-time • Experience: 3+ years in .NET Core and Angular</p>\n<p><strong>Primary Stack:</strong>\n- C# .NET Core 8\n- ASP.NET Core Web API\n- Angular 15+\n- TypeScript\n- RxJS\n- SQL Server/EF Core</p>\n<p><strong>Role Summary:</strong>\nWe are seeking an experienced Senior Full Stack Developer with a proven track record in designing and developing scalable web applications using .NET Core and Angular.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at carrer@softspace.ae</p>",
        "tags": [
            "3+ Years",
            ".NET Core",
            "Angular",
            "TypeScript"
        ],
        "summary": "Seeking an experienced Full Stack Developer with 3+ years in .NET Core and Angular. Design and develop scalable web applications using C#, ASP.NET Core, and Angular."
    },
    {
        "job_title": "QA Analyst(2-3 years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/21224/109",
        "location": "Infopark",
        "closing_date": "19 Dec 2025",
        "job_description": "<h2>QA Analyst</h2>\n<p><strong>Company Name:</strong> NewAgeSys IT, (a division of NewAgeSys)\n<strong>Location:</strong> Carnival Infopark, Phase 2, Kakkanad, Ernakulam\n<strong>Job Type:</strong> Onsite\n<strong>Shift Timing:</strong> 11 AM to 8 PM</p>\n<p><strong>About the Company:</strong>\nNewAgeSys IT, a division of NewAgeSys, Inc. established in 1994 and based in New Jersey, specializes in mobile app development and consulting. We help clients maximize their business reach and effectiveness by leveraging the latest technology. As a full-service mobile and web development firm, NewAgeSMB serves clients across North America, UK, Europe, the Middle East, Singapore, and Australia. We build long-term client relationships, from brainstorming initial ideas and strategizing project plans to building and deploying cost-effective solutions with robust support and maintenance.</p>\n<p>We are seeking a Quality Assurance Analyst with 2-3 years of relevant experience.</p>\n<h2>Responsibilities of an Experienced Software Tester:</h2>\n<ul>\n<li>Perform manual testing of mobile and mobile web applications developed by the team.</li>\n<li>Review and analyze requirements, specifications, and technical design documents to provide timely feedback.</li>\n<li>Create, maintain, and execute test plans, test cases, and test scripts.</li>\n<li>Identify, document, and track bugs and defects using standard bug-tracking tools.</li>\n<li>Collaborate closely with developers, project managers, and UI/UX teams to ensure product quality throughout the development lifecycle.</li>\n<li>Conduct regression testing, UI/UX testing, and cross-platform testing (iOS, Android, mobile web).</li>\n<li>Participate in QA reviews, stand-up meetings, and sprint retrospectives.</li>\n<li>Contribute to process improvement and QA best practices.</li>\n<li>(Preferred) Support automation testing efforts by assisting in test script design and maintenance if familiar with automation tools (e.g., Selenium, Appium, TestNG, etc.).</li>\n</ul>\n<h2>Qualifications:</h2>\n<ul>\n<li>2–3 years of experience in QA and software testing, preferably in mobile applications.</li>\n<li>Strong understanding of SDLC, STLC, and Defect Life Cycle.</li>\n<li>Experience testing Android and iOS mobile apps and mobile web platforms.</li>\n<li>Proficiency with tools such as JIRA, TestLink, or equivalent bug and test case management tools.</li>\n<li>Familiarity with API testing (using Postman or similar tools) is a plus.</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>Strong attention to detail and ability to multitask.</li>\n<li>Good communication and collaboration skills.</li>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at career@newagesysindia.com</p>",
        "tags": [
            "2-3 Years",
            "Mobile Testing",
            "QA",
            "JIRA"
        ],
        "summary": "Seeking a QA Analyst with 2-3 years of mobile testing experience. Responsibilities include manual testing, bug tracking, and collaborating with development teams."
    },
    {
        "job_title": "Senior Full-Stack Developer (.NET Core + Angular)",
        "company": "Softspace Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21226/361",
        "location": "Infopark",
        "closing_date": "20 Dec 2025",
        "job_description": "<h2>Senior Full-Stack Developer (.NET Core + Angular)</h2>\n<p><strong>Job Title:</strong> Senior Full Stack Developer (.NET Core &amp; Angular)\n<strong>Location:</strong> Cochin\n<strong>Employment Type:</strong> Full-time</p>\n<p><strong>Experience:</strong> Minimum 6+ Years</p>\n<p><strong>Primary Stack:</strong>\n- C# .NET Core 8\n- ASP.NET Core Web API\n- Angular 15+\n- TypeScript\n- RxJS\n- SQL Server/EF Core</p>\n<p><strong>Role Summary:</strong>\nWe are seeking an experienced Senior Full Stack Developer with a proven track record in designing and developing scalable web applications using .NET Core and Angular.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at career@softspace.ae</p>",
        "tags": [
            "6+ Years",
            ".NET Core",
            "Angular",
            "TypeScript"
        ],
        "summary": "Seeking an experienced Senior Full Stack Developer with 6+ years in .NET Core and Angular. Must have a proven track record in designing and developing scalable web applications."
    },
    {
        "job_title": "Senior React.js Developer",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21216/95",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Senior React.js Developer</h2>\n<h3>Key Responsibilities</h3>\n<p><strong>Front-End Development</strong>\n- Develop responsive, high-quality, and scalable user interfaces using React.js, TypeScript, and modern front-end tooling.\n- Build reusable components and front-end libraries for future use.\n- Optimize components for maximum performance across a wide range of devices and browsers.\n- Integrate RESTful APIs and GraphQL endpoints with front-end applications.</p>\n<p><strong>Architecture &amp; Code Quality</strong>\n- Participate in architectural discussions and drive best practices for front-end engineering.\n- Conduct code reviews to maintain code quality, performance, and security.\n- Ensure adherence to UI/UX design standards and accessibility best practices.\n- Work with state management libraries such as Redux, MobX, Recoil, or Context API.</p>\n<p><strong>Collaboration &amp; Delivery</strong>\n- Work closely with Product Managers, UX/UI Designers, and Backend Developers to translate requirements into high-quality features.\n- Participate in Agile ceremonies (sprint planning, daily stand-ups, retros, etc.).\n- Provide technical guidance, mentorship, and support to junior developers.</p>\n<p><strong>Troubleshooting &amp; Optimization</strong>\n- Debug complex issues and optimize application performance.\n- Implement front-end testing (unit, integration, end-to-end) using tools such as Jest, React Testing Library, Cypress, etc.\n- Ensure cross-browser compatibility and responsive design compliance.</p>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Engineering, or related field (or equivalent experience).</li>\n<li>4–5 years of experience in front-end development, with at least 3+ years specifically in React.js.</li>\n</ul>\n<p><strong>Strong proficiency in:</strong>\n- React.js (Hooks, Context, Functional Components)\n- JavaScript (ES6+) / TypeScript\n- HTML5 / CSS3 / SASS / Styled Components\n- Redux or other state management tools</p>\n<p><strong>Experience with:</strong>\n- REST APIs / GraphQL\n- Node.js\n- Git, CI/CD pipelines\n- Strong understanding of front-end architecture, modular design, and performance optimization.\n- Knowledge of UI/UX best practices and accessibility (WCAG).</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com</p>",
        "tags": [
            "3+ Years",
            "React.js",
            "TypeScript",
            "Redux"
        ],
        "summary": "Seeking a Senior React.js Developer with 3+ years of experience to build scalable user interfaces. Responsibilities include component development, API integration, and code quality assurance."
    },
    {
        "job_title": "Junior .NET Developer",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21217/95",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Junior .NET Developer</h2>\n<h3>Roles &amp; Responsibilities</h3>\n<p><strong>Development &amp; Coding</strong>\n- Assist in developing backend services and APIs using .NET Core / ASP.NET Core.\n- Write clean, maintainable, and efficient code following best practices.\n- Work with Entity Framework Core for database interactions.\n- Help in implementing RESTful APIs and basic microservice components.\n- Participate in debugging, fixing bugs, and optimizing application performance.</p>\n<p><strong>Project Support</strong>\n- Work closely with senior developers to understand technical requirements.\n- Convert assigned tasks and user stories into workable code.\n- Ensure timely delivery of assigned modules with proper quality.\n- Support the team in basic design discussions and documentation.</p>\n<p><strong>Collaboration</strong>\n- Participate in daily standups, sprint planning, and review meetings.\n- Coordinate with Product, QA, and DevOps teams to ensure smooth development flow.\n- Clearly communicate progress, blockers, and task updates to leads or mentors.\n- Contribute to a positive learning and team-oriented environment.</p>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>2-3 years of experience in .NET development (internship or academic project experience accepted).</li>\n</ul>\n<p>Good understanding of:\n- .NET Core / ASP.NET Core\n- Entity Framework Core\n- REST API concepts\n- SQL Server / PostgreSQL basics</p>\n<p>Familiarity with:\n- Version control (Git)\n- CI/CD concepts\n- Cloud basics (Azure / AWS preferred)\n- Docker fundamentals\n- Understanding of OOP, SOLID principles, and basic design patterns.\n- Strong problem-solving skills, willingness to learn, and good communication abilities.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com</p>",
        "tags": [
            "2-3 Years",
            ".NET Core",
            "ASP.NET Core",
            "Entity Framework Core"
        ],
        "summary": "Junior .NET Developer sought for backend services and API development using .NET Core. Requires 2-3 years of experience and understanding of Entity Framework, REST, and SQL."
    },
    {
        "job_title": ".NET Core Team Lead",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21221/95",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>.NET Core Team Lead</h2>\n<h3>Technical Leadership</h3>\n<ul>\n<li>Lead and mentor a team of .NET developers, ensuring best coding practices and high-quality output.</li>\n<li>Drive architectural decisions, design reviews, and code reviews.</li>\n<li>Develop high-performance APIs and backend services using .NET Core.</li>\n<li>Ensure adherence to software standards, security protocols, and engineering best practices.</li>\n</ul>\n<h3>Project &amp; Delivery Management</h3>\n<ul>\n<li>Plan and manage project tasks, timelines, and deliverables.</li>\n<li>Collaborate closely with Product Owners, QA, DevOps, and UX teams.</li>\n<li>Convert business requirements into technical specifications and actionable tasks.</li>\n<li>Ensure timely delivery of features while maintaining high quality.</li>\n</ul>\n<h3>Hands-on Development</h3>\n<ul>\n<li>Participate in coding, debugging, and optimizing backend components.</li>\n<li>Implement microservices, RESTful APIs, and cloud-native designs.</li>\n<li>Troubleshoot complex issues across the applications stack.</li>\n</ul>\n<h3>Collaboration &amp; Communication</h3>\n<ul>\n<li>Conduct regular team meetings, sprint planning, and retrospectives.</li>\n<li>Communicate project status, risks, and dependencies to stakeholders.</li>\n<li>Foster a culture of continuous improvement and innovation.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>5+ years of experience in software development with at least 1-2 years in a team lead role.</li>\n<li>Strong proficiency in:<ul>\n<li>.NET Core / ASP.NET Core</li>\n<li>Entity Framework Core</li>\n<li>REST API design</li>\n<li>Microservices architecture</li>\n</ul>\n</li>\n<li>Experience with:<ul>\n<li>SQL Server / PostgreSQL</li>\n<li>CI/CD pipelines (Azure DevOps, GitHub Actions, Jenkins)</li>\n<li>Cloud services (Azure / AWS)</li>\n<li>Containerization (Docker, Kubernetes)</li>\n</ul>\n</li>\n<li>Strong understanding of SOLID principles, design patterns, and clean architecture.</li>\n<li>Excellent analytical, problem-solving, and communication skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com</p>",
        "tags": [
            "5+ Years",
            ".NET Core",
            "Microservices",
            "REST API"
        ],
        "summary": "Lead a .NET Core development team, driving technical decisions and project delivery. Requires 5+ years of experience with .NET Core, microservices, and APIs. Contact career@aabasoft.com."
    },
    {
        "job_title": "Shopify Developer(1-2 Years Experience)",
        "company": "9Commerce Technologies",
        "url": "https://infopark.in/company-jobs/details/21225/261",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Shopify Developer - Infopark, Kochi</h2>\n<p><strong>Employment Type:</strong> Full-time (Work From Office)</p>\n<p><strong>Job Responsibilities:</strong>\n- Customize and modify existing Shopify themes to align with brand guidelines and enhance user experience.\n- Develop custom Shopify themes, templates, and components based on project requirements.\n- Optimize website performance, ensuring fast loading times and responsive design across different devices.\n- Integrate third-party applications and plugins to extend Shopify's functionality.\n- Troubleshoot and resolve issues related to website functionality, payment gateways, and other e-commerce components.\n- Stay updated with the latest Shopify trends, best practices, and industry standards to suggest improvements and innovations.\n- Participate in code reviews and provide constructive feedback to maintain code quality and consistency.</p>\n<p><strong>Qualifications / Requirements:</strong>\n- Bachelor's degree in Computer Science, Web Development, or a related field (or equivalent experience).\n- 1+ years of hands-on experience with Shopify development, including theme customization, app integration, and performance optimization.\n- Proficiency in HTML, CSS, JavaScript, and liquid templating language.\n- Proficiency in PHP, MySQL, and server architecture (Apache or Nginix).\n- Experience with front-end frameworks like React or Vue.js is a plus.\n- Strong understanding of responsive web design principles and cross-browser compatibility.\n- Familiarity with version control systems (e.g., Git) and development workflows.\n- Ability to work collaboratively in a team environment, as well as independently on projects.\n- Excellent problem-solving skills and attention to detail.\n- Effective communication skills to articulate technical concepts to non-technical team members.</p>\n<p><strong>How to Apply:</strong>\nInterested candidates are invited to submit their resume and a cover letter outlining their qualifications and experience to hr@commerce9.io. Please include \"Shopify Developer Application\" in the subject line with below details:</p>\n<blockquote>\n<p>Total Years of Exp:\nRelevant Exp:\nCurrent CTC:\nExpected CTC:\nHighest Qualification (Full time only):\nNotice Period:</p>\n</blockquote>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@commerce9.io.</p>",
        "tags": [
            "1-2 Years Experience",
            "Shopify",
            "HTML/CSS/JavaScript",
            "PHP"
        ],
        "summary": "Shopify Developer needed for theme customization, development, and optimization. Requires 1+ years of experience with Shopify, HTML, CSS, JavaScript, and PHP."
    },
    {
        "job_title": "Content and Branding Associate Intern",
        "company": "mitz AI Minds Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21214/393",
        "location": "Infopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Content and Branding Associate Intern</h2>\n<p>We are seeking highly motivated and creative individuals to join us as Content and Branding Associate Interns. This role is ideal for candidates who have a passion for storytelling, design thinking, and creating meaningful content that strengthens brand identity. As part of our team, you will contribute directly to the development of branding materials, short-form content, and communication assets that reflect the company’s voice, values, and strategic direction.</p>\n<p>This internship is a hands-on opportunity for individuals who are proactive, detail-oriented, and eager to learn. You will work closely with our leadership team to conceptualize and execute content that enhances brand presence, supports campaigns, and communicates effectively with a B2B tech audience. Strong communication skills, creativity, and initiative are essential for success in this role.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop clear, engaging, and brand-aligned content for internal and external communication.</li>\n<li>Script, ideate, and plan short-form video concepts that convey strong storytelling and brand messaging.</li>\n<li>Support the creation of visual assets and branded materials using tools such as Canva.</li>\n<li>Collaborate with the leadership and tech teams to maintain a consistent brand identity across all communication.</li>\n<li>Brainstorm and contribute fresh ideas for content themes, brand touchpoints, and creative concepts.</li>\n<li>Assist in preparing content for social medias, campaigns, knowledge-sharing materials, and branding assets.</li>\n<li>Ensure all content created reflects accuracy, clarity, and alignment with the company’s tone and objectives.</li>\n<li>Stay updated on industry trends and apply relevant concepts to enhance content quality.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Strong interest in content creation, branding, and storytelling.</li>\n<li>Ability to script, plan, and ideate creative short-form content.</li>\n<li>Good understanding of communication styles relevant to B2B tech audiences.</li>\n<li>Good in Canva.</li>\n<li>Excellent English writing skills with attention to clarity and structure.</li>\n<li>Basic video editing skills for creating short clips, reels, and marketing stories.</li>\n<li>Proactive, self-driven, and capable of taking ownership of tasks.</li>\n<li>Ability to bring new ideas and approach challenges creatively.</li>\n</ul>\n<h3>Preferred</h3>\n<ul>\n<li>Active online presence showcasing writing, design, or creative work.</li>\n</ul>\n<h3>Internship Details</h3>\n<ul>\n<li><strong>Location:</strong> Infopark, Kochi</li>\n<li><strong>Duration:</strong> 3 Months (Onsite)</li>\n<li><strong>Stipend:</strong> Provided</li>\n<li><strong>Opportunity:</strong> High-performing interns may be offered a full-time role based on performance and overall contribution.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates may send their resume and sample work (if available) to:\n📩 careers@mitz.ai</p>\n<p>We look forward to working with driven individuals who are ready to contribute creatively and grow with us.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@mitz.ai</p>",
        "tags": [
            "0-1 Years",
            "Content Creation",
            "Branding",
            "Canva"
        ],
        "summary": "Seeking creative Content and Branding Associate Interns to develop engaging content and enhance brand identity. This hands-on role involves content creation, visual asset support, and collaboration for a B2B tech audience."
    },
    {
        "job_title": "Finance Executive",
        "company": "Itwagon (P) Ltd",
        "url": "https://technopark.org/job-details/25592",
        "location": "Technopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Finance Executive</h2>\n<p><strong>Company:</strong> ITWAGON (P) Ltd\n<strong>Location:</strong> Trivandrum, India (Client based in Singapore)\n<strong>Contact Email:</strong> priya@itwagon.com\n<strong>Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 08, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>ITWAGON (P) Ltd is seeking a Finance Executive to manage the day-to-day finance functions for a distribution company based in Singapore. This role involves developing and maintaining financial controls and systems aligned with organizational needs, providing financial management, expertise, and guidance to ensure effective monitoring, control, and reporting.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Consolidate and finalize the organization's books of accounts.</li>\n<li>Develop, implement, and ensure compliance with internal financial and accounting policies and procedures.</li>\n<li>Maintain a thorough understanding of statutory and legal aspects related to payroll and income tax compliance.</li>\n<li>Oversee month-end closing processes and corporate reporting.</li>\n<li>Lead and coordinate audits, preparing necessary documents for tax auditors to ensure timely completion.</li>\n<li>Prepare accurate and timely financial statements.</li>\n<li>Document and maintain complete and accurate supporting information for all financial transactions.</li>\n<li>Oversee and coordinate annual internal, external, and statutory audits, collaborating with auditors to resolve any issues.</li>\n<li>Conduct finance, accounting, and business analysis, providing insights to management.</li>\n</ul>\n<h3>Mandatory Skills:</h3>\n<ul>\n<li>Strong knowledge of Generally Accepted Accounting Principles (GAAP).</li>\n<li>Proficient technical accounting skills and expertise.</li>\n<li>Excellent financial analysis and reporting capabilities.</li>\n<li>Familiarity with financial controls and risk management practices.</li>\n<li>Highly computer literate, with proficiency in financial and IT systems.</li>\n<li>Advanced skills in Microsoft Excel.</li>\n<li>Proficiency in computerized accounting packages (e.g., QuickBooks, Xero).</li>\n<li>Strong interpersonal and communication skills, with effective presentation abilities.</li>\n<li>Candidates with 2-3 years of relevant experience.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Prior experience managing international accounts.</li>\n<li>Familiarity with advanced financial modeling and forecasting techniques.</li>\n<li>Knowledge of ERP systems (e.g., SAP, Oracle).</li>\n<li>Experience in a multi-currency accounting environment.</li>\n<li>Ability to thrive in a fast-paced, dynamic setting.</li>\n<li>Knowledge in XERO and DEAR systems will be an advantage.</li>\n</ul>\n<p><strong>Company Address:</strong>\n6th Floor, STPI Building, Technopark Phase 1, Trivandrum, 695581\n<strong>Website:</strong> https://www.itwagon.com</p>",
        "tags": [
            "2-3 Years",
            "GAAP",
            "Excel",
            "Xero"
        ],
        "summary": "Finance Executive needed to manage daily finance functions for a Singapore-based client. Responsibilities include financial controls, reporting, and audits. Requires strong accounting and Excel skills."
    },
    {
        "job_title": "Hiring Freshers for the Process Associate/Financial Associate role (Voice/Non Voice Process)",
        "company": "Rr Donnelley India Outsource (P) Ltd",
        "url": "https://technopark.org/job-details/25590",
        "location": "Technopark",
        "closing_date": "16 Dec 2025",
        "job_description": "<h2>RR Donnelley India Outsource (P) Ltd - Hiring Freshers</h2>\n<p><strong>Location:</strong> 6th Floor, Thejaswini Building, Technopark, Kariavattom (PO), Trivandrum, 695581\n<strong>Website:</strong> http://www.rrdonnelley.com\n<strong>Contact Email:</strong> careers.trivandrum@rrd.com\n<strong>Closing Date:</strong> 16 December 2025\n<strong>Job Published:</strong> 01 December 2025</p>\n<h3>Job Positions:</h3>\n<ul>\n<li>Process Associate / Financial Associate (Voice/Non Voice Process)</li>\n</ul>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Provide high-quality, real-time assistance in support of client projects.</li>\n<li>Complete all assigned jobs as per committed time, in an accurate and client-specific manner.</li>\n<li>Check incoming and outgoing correspondence and ensure requested information is provided in the most appropriate and effective manner.</li>\n<li>Opportunities are available in Insurance / Utility services domains.</li>\n</ul>\n<h3>Required Candidate Profile:</h3>\n<ul>\n<li>Prefer candidates with excellent communication skills.</li>\n<li>Willingness to work in all shifts, including night shifts.</li>\n<li>Prefer candidates with a long-term career aspiration.</li>\n</ul>\n<h3>Role Details:</h3>\n<ul>\n<li><strong>Type:</strong> Voice/Non-voice client support</li>\n<li><strong>Industry:</strong> ITES</li>\n<li><strong>Employment Type:</strong> Permanent</li>\n<li><strong>Education:</strong> Any graduate (Except technical &amp; MBA graduates)</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Excellent English communication skills</li>\n<li>Proficient in MS Office (Word, Excel, PowerPoint)</li>\n<li>Basic Mathematical analysis</li>\n<li>Business email writing</li>\n<li>Strong attention to detail</li>\n<li>Strong analytical skills</li>\n<li>Adaptable to process/product changes</li>\n<li>Team Player</li>\n</ul>\n<p>Interested candidates can fill out the application using the provided Google Form: Applicant Registration Form</p>",
        "tags": [
            "Fresher",
            "Customer Support",
            "Communication Skills",
            "MS Office"
        ],
        "summary": "RR Donnelley is hiring freshers for Process Associate/Financial Associate roles in voice and non-voice processes. The job requires excellent communication and willingness to work in shifts."
    },
    {
        "job_title": "VFX Artist",
        "company": "Storygame (P) Ltd",
        "url": "https://technopark.org/job-details/25589",
        "location": "Technopark",
        "closing_date": "28 Dec 2025",
        "job_description": "<h2>VFX Artist</h2>\n<p><strong>Company:</strong> Storygame (P) Ltd\n<strong>Location:</strong> Ground floor, Tejaswini building, Technopark Phase 1 Kazakootam trivandrum kerala , 695581\n<strong>Website:</strong> https://storygame.io\n<strong>Closing Date:</strong> 28, Dec 2025\n<strong>Job Published:</strong> 01, Dec 2025\n<strong>Contact Email:</strong> hr@storygame.io</p>\n<h3>Overview</h3>\n<p>We are seeking a talented VFX Artist to design, create, and implement high-quality visual effects that enhance the storytelling and overall aesthetic of our project. The ideal candidate is both creative and technically skilled, with a strong understanding of real-time or pre-rendered workflows.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conceptualize, design, and produce visually compelling effects such as explosions, fire, smoke, magic, weather, destruction, particles, simulations, and environmental effects.</li>\n<li>Work closely with art directors, animators, designers, and technical teams to ensure effects match the artistic vision and technical requirements.</li>\n<li>Create real-time VFX using game engines (e.g., Unreal Engine, Unity) or produce high-fidelity simulations using software such as Houdini, Maya, Nuke, or After Effects.</li>\n<li>Optimize VFX assets to maintain performance standards without compromising visual quality.</li>\n<li>Troubleshoot and refine effects based on feedback from directors, leads, and QA teams.</li>\n<li>Maintain organized project files, documentation, and version control practices.</li>\n<li>Stay current with industry trends, tools, and techniques to continually improve the quality of effects.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience as a VFX Artist in film, TV, games, or advertising.</li>\n<li>Strong portfolio/reel demonstrating a range of visual effects.</li>\n<li>Proficiency with VFX software such as Houdini, Maya, Blender, Nuke, Embergen, Substance Designer, or equivalent tools.</li>\n<li>Experience with particle systems, simulations, shaders, and compositing.</li>\n<li>Good understanding of real-time engine workflows (Unreal Engine, Unity), if applicable.</li>\n<li>Strong artistic eye for motion, timing, scale, composition, and color.</li>\n<li>Ability to work collaboratively in a team environment while meeting deadlines.</li>\n<li>Solid problem-solving skills and attention to detail.</li>\n</ul>",
        "tags": [
            "N/A Years",
            "Houdini",
            "Unreal Engine",
            "Maya"
        ],
        "summary": "Seeking a creative and technical VFX Artist to design and implement high-quality visual effects. Must have experience with VFX software and game engines for compelling storytelling."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Breeze Brain Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/25588",
        "location": "Technopark",
        "closing_date": "20 Dec 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Company:</strong> Breeze Brain Technologies (P) Ltd\n<strong>Location:</strong> Module 20, SBC, - 2 Floor, Thejaswini Building, Technopark, Trivandrum , 695581\n<strong>Website:</strong> https://www.breezebrain.com\n<strong>Contact Email:</strong> careers@breezebrain.com\n<strong>Job Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 20, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Breeze Brain Technologies Pvt. Ltd. is seeking a dynamic, energetic, and results-driven Business Development Executive to join our growing team. The role involves driving sales, building strong client relationships, and identifying new business opportunities in the IT sector. This is a field-intensive position for self-motivated individuals who thrive in a fast-paced environment and are passionate about achieving targets.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and execute strategic sales and marketing initiatives to achieve business growth.</li>\n<li>Identify and pursue new business opportunities through market research, lead generation, and networking.</li>\n<li>Build and maintain long-term client relationships by understanding their needs and providing tailored IT solutions.</li>\n<li>Consistently achieve and exceed sales targets through effective engagement and negotiation.</li>\n<li>Collaborate with internal teams to ensure sales strategies align with company objectives.</li>\n<li>Prepare reports on sales performance, client feedback, and market trends.</li>\n<li>Conduct field visits and client meetings as a core part of daily operations.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, or a related field.</li>\n<li>1–3 years of proven experience in sales/business development, preferably in the IT industry.</li>\n<li>Strong communication, negotiation, and interpersonal skills.</li>\n<li>Ability to work independently and manage fieldwork efficiently.</li>\n<li>Fluency in Malayalam, English, Tamil, and Hindi.</li>\n<li>Strong organisational and time-management abilities.</li>\n</ul>\n<h3>Additional Requirements</h3>\n<ul>\n<li>Young and energetic male candidates only.</li>\n<li>Must own a two-wheeler and have a valid driving license.</li>\n<li>Fieldwork is a major part of the role.</li>\n<li>Immediate joiners will be given preference.</li>\n<li>Must be currently based in Tamil Nadu or Kerala.</li>\n</ul>\n<h3>Compensation &amp; Benefits</h3>\n<ul>\n<li>Competitive salary based on experience.</li>\n<li>Attractive performance-based incentives.</li>\n<li>Travel and Food Allowances.</li>\n<li>Insurance benefits and other perks.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your updated resume to careers@breezebrain.com with the Subject line: “Business Development Executive”. Applications without the correct subject line may be delayed or rejected.</p>",
        "tags": [
            "1-3 Years",
            "Sales",
            "Business Development",
            "IT Sector"
        ],
        "summary": "Seeking an energetic Business Development Executive for IT sales. Role involves client relations, identifying opportunities, and achieving sales targets in a field-intensive position."
    },
    {
        "job_title": "Digital Marketing Intern",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/25587",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Digital Marketing Intern</h2>\n<p><strong>Company:</strong> Valoriz Digital (P) Ltd</p>\n<p><strong>Location:</strong> L2, -1 Floor, Thejaswini Building, Technopark, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.valoriz.com</p>\n<p><strong>Contact Email:</strong> careers@valoriz.com</p>\n<p><strong>Job Published:</strong> 01, Dec 2025</p>\n<p><strong>Closing Date:</strong> 31, Dec 2025</p>\n<p><strong>Duration:</strong> 3 months (Unpaid)</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Assist in social media content creation and basic digital marketing activities.</li>\n<li>Conduct market research and analysis across various domains and websites, including TAM/SAM/SOM assessments, to identify business opportunities.</li>\n<li>Support lead generation efforts across digital platforms.</li>\n<li>Help with SEO, keyword research, and campaign coordination.</li>\n<li>Track basic performance metrics and prepare reports.</li>\n<li>Stay updated with current digital marketing trends.</li>\n</ul>\n<h3>Preferred Skills and Requirements:</h3>\n<ul>\n<li>Strong interest in digital marketing and willingness to learn.</li>\n<li>Basic understanding of social media, SEO, and lead generation.</li>\n<li>MBA in Marketing is mandatory for this role.</li>\n<li>Good communication and analytical skills.</li>\n<li>Ability to work collaboratively in a fast-paced environment.</li>\n</ul>\n<p><strong>Note:</strong> Interns who demonstrate exceptional performance during the internship will be offered a full-time opportunity with strong career growth in marketing.</p>",
        "tags": [
            "0-1 Years",
            "Digital Marketing",
            "SEO",
            "Social Media"
        ],
        "summary": "Seeking a Digital Marketing Intern to assist with content, research, and lead generation. Must have an MBA in Marketing and a strong interest in learning."
    },
    {
        "job_title": "Java Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25586",
        "location": "Technopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Java Developer</h2>\n<p><strong>Company:</strong> Polus Solutions (P) Ltd\n<strong>Location:</strong> 12B, Carnival Technopark, Technopark, Kazhakuttam, Trivandrum Kerala, India, 695581\n<strong>Website:</strong> https://www.polussolutions.com</p>\n<p><strong>Job Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 08, Dec 2025</p>\n<p><strong>Contact Email:</strong> careers@polussolutions.com</p>\n<h3>Brief Description</h3>\n<p>Java Developers are the visionaries behind information solutions. Polus Solutions is seeking experienced, passionate, and self-driven candidates to join our team with full dedication and cooperation.</p>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> Graduates in BE/BTech (Computer science or related), MSC Computer science, MCA, or equivalent.</li>\n<li><strong>Experience:</strong> 2-4 years of total software development experience in Java/JEE with good knowledge of design patterns.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Good knowledge in Spring Boot/Spring Web Services.</li>\n<li>Exposure to frameworks like Spring and Hibernate is required.</li>\n<li>Must possess strong technical development experience, including effectively writing code, code reviews, best practices on configuration management, and code refactoring.</li>\n<li>Strong logical &amp; technical problem-solving skills.</li>\n<li>Good communication skills.</li>\n</ul>\n<p><strong>To Apply:</strong>\nSend your resume to careers@polussolutions.com. Please include \"Java Developer - [Your Name]\" in the subject line.</p>",
        "tags": [
            "2-4 Years",
            "Java",
            "Spring Boot",
            "Hibernate"
        ],
        "summary": "Seeking a passionate Java Developer with 2-4 years of experience in Java/JEE. Must have Spring Boot/Web Services and Hibernate knowledge."
    },
    {
        "job_title": ".NET Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25585",
        "location": "Technopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>.NET Developer at Polus Solutions (P) Ltd</h2>\n<p><strong>Location:</strong> Trivandrum, Kerala, India\n<strong>Company:</strong> Polus Solutions (P) Ltd\n<strong>Website:</strong> https://www.polussolutions.com\n<strong>Contact Email:</strong> careers@polussolutions.com\n<strong>Job Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 08, Dec 2025</p>\n<h3>About the Role</h3>\n<p>Polus Solutions is seeking a highly experienced .NET Developer with profound expertise in Microsoft SQL Server and enterprise-grade backend systems. This position demands strong technical leadership and hands-on development skills. Prior experience in the travel and booking domain is considered a significant advantage.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain scalable and high-performance applications utilizing .NET Core and C#.</li>\n<li>Collaborate with cross-functional teams for the definition, design, and delivery of new features.</li>\n<li>Write clean, efficient, and testable code that adheres to best practices.</li>\n<li>Conduct code reviews, debugging, and troubleshooting to guarantee software quality.</li>\n<li>Develop data-driven applications by working with databases such as SQL Server, MySQL, or other RDBMS.</li>\n<li>Participate in the complete Software Development Life Cycle (SDLC), from requirements gathering through to deployment and support.</li>\n<li>Stay abreast of the latest trends in the .NET ecosystem and propose relevant improvements.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Experience:</strong> 3–6 years of professional software development experience.</li>\n<li><strong>Core Technologies:</strong> Strong knowledge of .NET Core and C#.</li>\n<li><strong>Fundamentals:</strong> Good understanding of Object-Oriented Programming (OOP) concepts, design patterns, and best coding practices.</li>\n<li><strong>API Development:</strong> Experience in Web API development and integration.</li>\n<li><strong>Data Access:</strong> Hands-on experience with Entity Framework / EF Core.</li>\n<li><strong>Database Skills:</strong> Proficiency in SQL and working with relational databases.</li>\n<li><strong>Version Control:</strong> Familiarity with version control systems like Git.</li>\n</ul>\n<p><strong>To Apply:</strong></p>\n<p>Please send your resume to careers@polussolutions.com. Ensure your email subject line is formatted as \".NET Developer - [Your Name]\".</p>",
        "tags": [
            "3-6 Years",
            ".NET Core",
            "C#",
            "SQL Server"
        ],
        "summary": "Experienced .NET Developer sought for backend systems using .NET Core and SQL Server. Requires strong leadership and development skills."
    },
    {
        "job_title": "Automation Tester (Selenium c#)",
        "company": "Se-Mentor Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25584",
        "location": "Technopark",
        "closing_date": "13 Dec 2025",
        "job_description": "<h2>Automation Tester (Selenium C#)</h2>\n<p><strong>Company:</strong> SE-Mentor Solutions (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram/Kochi, Kerala, India\n<strong>Address:</strong> 2nd Floor, Gayathri Building, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> http://www.se-mentor.com</p>\n<p><strong>Job Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 13, Dec 2025\n<strong>Contact Email:</strong> careers@se-mentor.com</p>\n<h3>Brief Description:</h3>\n<p>We are hiring Automation Testers with 3+ years of experience.</p>\n<h3>Requirements:</h3>\n<ul>\n<li><strong>Years of Experience:</strong> 3+ Years</li>\n<li><strong>Notice Period:</strong> Immediate to within 30 Days</li>\n<li><strong>Required Skillsets:</strong><ul>\n<li>Relevant experience in Selenium C#</li>\n<li>Good to have experience working in an Automation Test Framework</li>\n<li>Excellent communication skills</li>\n</ul>\n</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Selenium",
            "C#",
            "Automation Test Framework"
        ],
        "summary": "SE-Mentor Solutions is hiring Automation Testers with 3+ years of experience in Selenium C#. Must have relevant experience and excellent communication skills."
    },
    {
        "job_title": "UX Designer",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/25583",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h1>UX Designer</h1>\n<p><strong>Company:</strong> Valoriz Digital (P) Ltd\n<strong>Location:</strong> L2, -1 Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> http://www.valoriz.com</p>\n<p><strong>Contact Email:</strong> careers@valoriz.com</p>\n<p><strong>Job Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 31, Dec 2025</p>\n<h2>Brief Description</h2>\n<p>We are looking for a passionate and creative UX Designer to join our dynamic team. The ideal candidate should have a strong eye for design, a user-first mindset, and the ability to transform complex ideas into intuitive and engaging experiences.</p>\n<h2>Key Responsibilities:</h2>\n<ul>\n<li>Design and deliver wireframes, prototypes, and user interfaces that align with project goals.</li>\n<li>Conduct user research and translate insights into impactful design solutions.</li>\n<li>Collaborate closely with cross-functional teams to ensure seamless design implementation.</li>\n<li>Present design concepts effectively through clear storytelling and visual communication.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ul>\n<li>Minimum 2 years of experience in UX Design.</li>\n<li>Hands-on experience with design tools such as Figma, Adobe XD, Adobe Illustrator, or similar.</li>\n<li>Strong understanding of user research, wireframing, and prototyping.</li>\n<li>Ability to collaborate with project teams to implement user-friendly interfaces.</li>\n<li>Excellent communication and storytelling skills.</li>\n<li>Experience in the retail domain will be an added advantage.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "UX Design",
            "Figma",
            "User Research"
        ],
        "summary": "Seeking a creative UX Designer to create intuitive experiences. Responsibilities include user research, wireframing, prototyping, and collaborating with teams."
    },
    {
        "job_title": "Full Stack Developer – Java | Spring Boot | React",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/25582",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Full Stack Developer – Java | Spring Boot | React</h2>\n<p><strong>Company:</strong> Valoriz Digital (P) Ltd\n<strong>Location:</strong> L2, -1 Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> http://www.valoriz.com\n<strong>Contact Email:</strong> careers@valoriz.com\n<strong>Job Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 31, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Valoriz Digital is seeking a Full Stack Engineer to design and build web-based software solutions. The ideal candidate will be adaptable, capable of learning, and able to mentor on new technologies. You will collaborate with architects and product owners to develop technology solutions using state-of-the-art web technologies and frameworks.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Work with a high-performing agile team using the latest tools for rapid development, continuous integration, and deployment.</li>\n<li>Ensure user experience, availability, scalability, responsiveness, and security software quality standards are achieved.</li>\n</ul>\n<h3>Preferred Skills and Qualifications</h3>\n<ul>\n<li><strong>Experience:</strong> Minimum 2+ years of experience in software development, with a mandatory 2 years in Springboot and React.</li>\n<li><strong>Web Technologies:</strong> Strong proficiency in SpringBoot, ReactJS, HTML, CSS, and MongoDB, with full stack development experience.</li>\n<li><strong>Web Services:</strong> Experience in software design and engineering of REST-based web services.</li>\n<li><strong>Methodologies:</strong> Experience in Agile development methodologies.</li>\n<li><strong>Tools:</strong> Experience working with source control like GIT and build tools like Maven, Gradle, etc.</li>\n<li><strong>Domain Knowledge:</strong> Experience in the e-commerce/retail domain is an added advantage.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "SpringBoot",
            "ReactJS",
            "MongoDB"
        ],
        "summary": "Seeking a Full Stack Developer to design and build web solutions. Must have 2+ years of experience in Springboot and React, with strong web technology skills."
    },
    {
        "job_title": "Sales Development Representative",
        "company": "Valoriz Digital (P) Ltd",
        "url": "https://technopark.org/job-details/25581",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Sales Development Representative</h2>\n<p><strong>Company:</strong> Valoriz Digital (P) Ltd</p>\n<p><strong>Location:</strong> L2, -1 Floor, Thejaswini Building, Technopark, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.valoriz.com</p>\n<p><strong>Contact Email:</strong> careers@valoriz.com</p>\n<p><strong>Job Published:</strong> 01, Dec 2025</p>\n<p><strong>Closing Date:</strong> 31, Dec 2025</p>\n<h3>Brief Description:</h3>\n<ul>\n<li>Understand Valoriz Digital's service offerings, eCommerce solutions, and accelerator portfolio.</li>\n<li>Generate leads through inbound and outbound efforts, including LinkedIn, emails, and calls, to engage decision-makers (including C-level) across target organizations.</li>\n<li>Maintain active follow-up with leads to nurture relationships and build interest.</li>\n<li>Collaborate with senior leadership to refine sales strategies, build partnerships, and drive pipeline growth.</li>\n<li>Track performance via sales reports/dashboards and work towards achieving monthly/quarterly targets.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proven track record of success as an SDR in a B2B technology firm.</li>\n<li>2 - 3 years of experience in selling enterprise solutions to CxOs/ Heads of Department.</li>\n<li>Prior experience in lead generation through cold/warm calling in developed markets.</li>\n<li>Strong interpersonal and communication skills.</li>\n<li>Previous tech industry experience or experience in sales development in the digital commerce/eCommerce space is a bonus.</li>\n<li>Experience in identifying and nurturing partnership opportunities to support business growth.</li>\n<li>Strong track record in acquiring new clients and expanding business through strategic collaborations.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "Lead Generation",
            "eCommerce",
            "Sales Development"
        ],
        "summary": "Generate leads and drive pipeline growth for Valoriz Digital's eCommerce solutions. Engage decision-makers and nurture relationships to achieve sales targets."
    },
    {
        "job_title": "Technical Analyst",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25580",
        "location": "Technopark",
        "closing_date": "05 Dec 2025",
        "job_description": "<h2>Technical Analyst</h2>\n<p><strong>Company:</strong> Polus Solutions (P) Ltd\n<strong>Location:</strong> 12B, Carnival Technopark, Technopark, Kazhakuttam, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> https://www.polussolutions.com</p>\n<p><strong>Contact Email:</strong> careers@polussolutions.com</p>\n<p><strong>Closing Date:</strong> 05, Dec 2025\n<strong>Job Published:</strong> 01, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Polus is looking for talented, experienced, and innovative candidates to be part of our support organization. Your focus is to deliver post-implementation support and solutions to our various customers across the globe.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>You will be innovative, energetic, and able to adapt to new processes and procedures quickly.</li>\n<li>You will also be committed to customer success with excellent listening and timely response skills.</li>\n<li>In this role, you will be handling day-to-day operations which includes incident management, problem management, change management, release management, and service request handling.</li>\n<li>Act as the first point of contact for customers.</li>\n<li>Provide Level 2 technical support.</li>\n<li>Apply basic diagnostic techniques to identify issues, investigate causes, and recommend solutions to correct common failures.</li>\n<li>Take end-to-end ownership of issues until resolution.</li>\n<li>Escalate complex problems to Level 3 technical support if needed.</li>\n<li>Ensure SLA adherence and follow established Service Management processes.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Prior experience in IT Service Management (Incident/Problem/Change/SR management).</li>\n<li>Experience in any of the ticketing tools (ServiceNow, Jira, etc.).</li>\n<li>Good working knowledge of SQL commands and PL/SQL.</li>\n<li>Overall knowledge of database fundamentals.</li>\n<li>Hands-on experience in all generic database monitoring.</li>\n<li>Basic understanding of Java/JEE is good to have.</li>\n<li>Good analytical reasoning skills and lateral thinking capability.</li>\n<li>Good communication skills.</li>\n<li>Good customer handling skills.</li>\n<li>ITIL V3/V4 foundation certification is desirable.</li>\n<li>Willingness to work in rotational shifts (24/5).</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> Graduates in BE/BTech (Computer Science or related) or MSc Computer Science/MCA or equivalent.</li>\n<li><strong>Experience:</strong> 1-3 years of experience in IT support.</li>\n</ul>\n<p><strong>To Apply:</strong>\nSend your resume to careers@polussolutions.com. Please include \"Technical Analyst - [Your Name]\" in the subject line.</p>",
        "tags": [
            "1-3 Years",
            "IT Service Management",
            "SQL",
            "Ticketing Tools"
        ],
        "summary": "Polus seeks an innovative Technical Analyst for post-implementation support. Responsibilities include incident, problem, and change management, acting as the first point of contact for customers."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25579",
        "location": "Technopark",
        "closing_date": "05 Dec 2025",
        "job_description": "<h2>Business Development Executive at Polus Solutions (P) Ltd</h2>\n<p><strong>Company:</strong> Polus Solutions (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala, India (Hybrid)\n<strong>Website:</strong> https://www.polussolutions.com\n<strong>Closing Date:</strong> December 05, 2025\n<strong>Job Published:</strong> December 01, 2025</p>\n<p><strong>Contact Email:</strong> careers@polussolutions.com</p>\n<h3>Brief Description</h3>\n<p>Business Development teams are the cornerstone of any successful organisation. Polus is seeking driven, proactive, and self-motivated individuals to join our team and play a key role in expanding our business footprint. The ideal candidate will be responsible for lead generation, outreach, and appointment setting. This is a hunter role—focused on identifying, engaging, and qualifying new business opportunities. The candidate should have experience in the IT industry and be comfortable working in a fast-paced, target-driven environment aligned with US business hours.</p>\n<h3>Required Qualifications</h3>\n<ul>\n<li>2–5 years of Business Development experience in the IT industry.</li>\n<li>Bachelor’s degree in a relevant field.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Proven experience in cold calling, email and LinkedIn outreach, and appointment setting.</li>\n<li>Strong ability to research target markets, identify decision-makers, and qualify leads.</li>\n<li>Experience in requirement analysis and basic proposal coordination.</li>\n<li>Ability to coordinate meetings across time zones, especially for the US team.</li>\n<li>Highly organised, detail-oriented, and data-driven.</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Identify and engage potential clients through strategic outreach campaigns (cold calls, emails, and LinkedIn).</li>\n<li>Research and qualify leads based on company goals, target industries, and ICP criteria.</li>\n<li>Coordinate meetings and discovery sessions for the US sales team.</li>\n<li>Maintain regular follow-ups to keep prospects engaged until handoff to the closing team.</li>\n<li>Track and manage outreach activities through CRM tools and ensure accurate data entry.</li>\n<li>Attend relevant virtual events to gather market insights and identify new lead opportunities.</li>\n<li>Provide weekly reports on pipeline activity, outreach metrics, and campaign effectiveness.</li>\n<li>Collaborate with the marketing team to refine messaging, outreach strategies, and target lists.</li>\n</ul>\n<h3>Key Skills</h3>\n<ul>\n<li>Lead Generation &amp; Prospecting: Identify and connect with key decision-makers through multi-channel outreach.</li>\n<li>Strategic Partnership Research: Build databases of potential business partners and initiate meaningful contact.</li>\n<li>Appointment Setting: Book qualified meetings for the US sales team with relevant stakeholders.</li>\n<li>CRM Management: Maintain up-to-date records of outreach and pipeline data.</li>\n<li>Digital Marketing Support: Assist in improving the company’s social media presence and SEO efforts.</li>\n<li>Event Intelligence: Attend and report insights from industry-related virtual events.</li>\n</ul>\n<h3>Work Details</h3>\n<ul>\n<li><strong>Work Timing:</strong> 4:00 PM to 12:00 AM IST (Hybrid)</li>\n<li><strong>Location:</strong> Hybrid – flexibility for remote and in-office work.</li>\n<li><strong>Reporting To:</strong> Business Development Manager / Head of Sales</li>\n</ul>\n<p><strong>To Apply:</strong>\nSend your resume to careers@polussolutions.com. Please include \"Business Development Executive - [Your Name]\" in the subject line.</p>",
        "tags": [
            "2-5 Years",
            "Lead Generation",
            "Cold Calling",
            "CRM"
        ],
        "summary": "Seeking a Business Development Executive for lead generation and appointment setting in the IT industry. Requires 2-5 years experience, strong communication, and US business hours alignment."
    },
    {
        "job_title": "Financial Analyst/Finance Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25578",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Address:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>Job Title: Finance Executive/ Financial Analyst</h3>\n<p><strong>Closing Date:</strong> December 04, 2025\n<strong>Job Published:</strong> December 01, 2025</p>\n<p><strong>About Us:</strong>\nWay.com is America’s dominant automotive super app, powering every mile for over 10 million customers with services including auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership. Featured by Bloomberg and ranked 48th on Andreessen Horowitz’s Marketplace list, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h2>Role Overview:</h2>\n<p>We are seeking a results-driven, CA-qualified Finance Professional with 2-3 years of experience in FP&amp;A, accounting, financial reporting, and reconciliations. The ideal candidate will have hands-on expertise in business partnering, preparing financial statements, AR/AP processes, and working with ERP systems.</p>\n<h2>Key Responsibilities:</h2>\n<h3>Financial Planning &amp; Analysis:</h3>\n<ul>\n<li>Act as a strong business partner to drive financial analysis and provide insights on financial performance.</li>\n<li>Coordinate and lead annual, quarterly, and monthly forecasts.</li>\n<li>Manage month-end close activities.</li>\n<li>Analyze forecast vs. actuals and identify the drivers.</li>\n</ul>\n<h3>Financial Accounting &amp; Reporting:</h3>\n<ul>\n<li>Prepare monthly, quarterly, and annual financial statements in compliance with accounting standards.</li>\n<li>Handle revenue and cost booking, including the POC method and contract completion method.</li>\n<li>Perform monthly P&amp;L, balance sheet, and cash flow analysis.</li>\n<li>Maintain accurate general ledger accounts and prepare balance sheet schedules.</li>\n</ul>\n<h3>Reconciliation &amp; Compliance:</h3>\n<ul>\n<li>Conduct AP/AR reconciliation and intercompany reconciliation.</li>\n<li>Assist in statutory, internal, and external audits with timely submission of documentation.</li>\n</ul>\n<h3>Budgeting &amp; Costing:</h3>\n<ul>\n<li>Support the preparation of monthly budgets, cash flow forecasts, and variance analysis.</li>\n<li>Prepare cost variation reports and perform revenue–cost reconciliation for ongoing projects.</li>\n</ul>\n<h3>Accounts Payable / Receivable:</h3>\n<ul>\n<li>Manage vendor payments, invoice processing, and staff expense claims.</li>\n<li>Track receivables, revenue entries, and client invoice preparation.</li>\n<li>Monitor advances, inventory booking, asset depreciation updates, and petty cash statements.</li>\n</ul>\n<h3>ERP &amp; Tools:</h3>\n<ul>\n<li>Work extensively with SAP/Tally/ERP systems, MS Excel (advanced), Power BI, and SQL for financial reporting and analysis.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ul>\n<li>Strong knowledge of accounting standards and financial principles.</li>\n<li>Proficiency in SAP/Tally/ERP applications.</li>\n<li>Advanced Excel, Power BI, SQL skills.</li>\n<li>Excellent analytical, reconciliation, and problem-solving abilities.</li>\n<li>Strong attention to detail and accuracy.</li>\n<li>Ability to work with cross-functional teams and meet monthly deadlines.</li>\n</ul>\n<h2>Preferred Experience:</h2>\n<ul>\n<li>Strong experience in FP&amp;A.</li>\n<li>Experience in financial reporting &amp; project accounting.</li>\n<li>Hands-on experience in AP/AR, bank reconciliation, and intercompany reconciliation.</li>\n<li>Experience in preparing statements for audit and supporting auditors.</li>\n</ul>\n<h2>Why you will love working with us?</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/finance-executive</p>",
        "tags": [
            "2-3 Years",
            "FP&A",
            "SAP/Tally/ERP",
            "Financial Reporting"
        ],
        "summary": "Seeking a CA-qualified Finance Executive/Analyst with 2-3 years of FP&A and accounting experience. Responsibilities include financial analysis, reporting, reconciliation, and ERP system usage."
    },
    {
        "job_title": "Communication Trainer - English",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25577",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd - English Communication Trainer</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/corporate-english-communication-trainer\n<strong>Closing Date:</strong> 04, Dec 2025\n<strong>Job Published:</strong> 01, Dec 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering over 10 million customers with services like auto insurance, parking, and EV charging. We utilize AI, machine learning, and data analytics to provide innovative solutions, making car ownership easier, affordable, and more rewarding. Featured by Bloomberg and ranked highly among fast-growing companies, we are recognized as a top product in insurance.</p>\n<h3>Job Title: English Communication Trainer</h3>\n<p><strong>Work Arrangement:</strong> On-site training/WFO\n<strong>Employment Type:</strong> Contract</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced English Communication Trainer to deliver offline corporate training programs for Customer Support teams. The goal is to enhance employees’ communication quality, customer-handling skills, grammar accuracy, and overall service language proficiency.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Conduct offline communication training for customer support executives across voice, email, and chat processes.</li>\n<li>Train employees on professional communication, customer empathy, tone &amp; clarity, neutral accent, and grammar usage.</li>\n<li>Develop and deliver training modules covering:</li>\n<li>Spoken English</li>\n<li>Business communication</li>\n<li>Customer handling phrases &amp; scripts</li>\n<li>Call etiquette &amp; soft skills</li>\n<li>Email writing &amp; chat etiquette</li>\n<li>Evaluate learners through role plays, call simulations, mock chats/emails, and assessments.</li>\n<li>Identify communication gaps and create customized training for new hires and existing employees.</li>\n<li>Provide actionable feedback to improve language proficiency, customer interactions, and overall CSAT.</li>\n<li>Track performance, maintain training reports, and coordinate with managers and QA teams for continuous improvement.</li>\n<li>Create an engaging and professional classroom environment.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>4–7 years of experience as a Communication Trainer / English Trainer in BPO, Customer Support, or Corporate Training.</li>\n<li>Strong command of spoken and written English with the ability to simplify concepts.</li>\n<li>Experience in voice, email, or chat process training (preferred).</li>\n<li>Excellent presentation, facilitation, and coaching skills.</li>\n<li>Ability to handle diverse learners and drive measurable improvement.</li>\n</ul>\n<h3>Preferred Attributes:</h3>\n<ul>\n<li>Certification in communication training, TEFL/TESOL, or soft skills (added advantage).</li>\n<li>Experience working with customer support KPIs such as CSAT, quality scores, AHT impact, etc.</li>\n<li>Strong understanding of customer service language, tone, and escalation handling.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "4-7 Years",
            "English Communication",
            "Customer Support Training",
            "BPO Training"
        ],
        "summary": "Experienced English Communication Trainer needed for offline corporate training. Enhance customer support teams' communication, grammar, and service skills. On-site role with contract employment."
    },
    {
        "job_title": "Performance Marketing Manager - SEM",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25576",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Performance Marketing Manager - SEM</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Website:</strong> http://www.way.com</p>\n<p><strong>Closing Date:</strong> 04, Dec 2025\n<strong>Job Published:</strong> 01, Dec 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions that enhance car ownership. Recognized by Bloomberg and ranked among the fastest-growing companies worldwide, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title:</h3>\n<p>Digital Marketing Manager / Performance Marketing Manager</p>\n<h3>Experience:</h3>\n<p>6 to 8 Years</p>\n<h3>Work Arrangement:</h3>\n<p>On-site</p>\n<h3>Employment Type:</h3>\n<p>Full-time</p>\n<h3>Role Overview:</h3>\n<p>We are seeking a data-driven and results-oriented Digital Marketing / Performance Marketing Manager to lead our paid media efforts, primarily focused on Search Engine Marketing (SEM) across Google Ads, Bing Ads, and other relevant platforms. You will drive performance across key verticals including Airport Parking, City Parking, Auto Insurance, Car Repair &amp; Maintenance, and more. This role is ideal for individuals with experience managing high-scale budgets, testing beta products, and delivering award-winning campaigns.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, launch, and optimize high-performance SEM campaigns to achieve traffic, conversion, and revenue goals.</li>\n<li>Conduct comprehensive keyword research, create well-structured campaigns, and execute A/B testing across ads and landing pages.</li>\n<li>Track and analyze key performance metrics (CTR, CPC, CVR, ROAS) to identify opportunities for scalability and efficiency improvements.</li>\n<li>Collaborate with cross-functional teams (analytics, product, content, and design) to ensure effective campaign execution and iteration.</li>\n<li>Leverage beta features, automation tools, and emerging ad formats to maintain a competitive edge.</li>\n<li>Develop and present detailed performance reports, insights, and strategic recommendations to stakeholders.</li>\n<li>Maintain full compliance with platform advertising policies while ensuring strong quality scores.</li>\n<li>Stay updated on AI-driven innovations in digital advertising, adopting new features and tools launched by Google, Meta, Microsoft, and other major platforms.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>6+ years of hands-on experience in digital/performance marketing with a strong focus on SEM.</li>\n<li>Experience managing $100K+/month in paid media spend, preferably for US-based markets.</li>\n<li>Strong command of platforms including Google Ads, Bing Ads, and tools such as Google Analytics, Looker Studio, SA360, etc.</li>\n<li>Proven expertise with AI-powered advertising solutions (e.g., Google Performance Max, Meta Advantage+, DSA, automated audience expansion).</li>\n<li>Google Ads Certification required; Meta Blueprint or multi-channel expertise is a plus.</li>\n<li>Prior experience in e-commerce, mobility, or booking-based platforms is highly desirable.</li>\n<li>Exposure to beta product testing, new feature launches, or award-winning campaigns is a strong advantage.</li>\n<li>Agency background with multi-client and multi-platform experience is a plus.</li>\n<li>Excellent analytical, project management, and communication skills.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/digital-marketing-manager</p>",
        "tags": [
            "6-8 Years",
            "SEM",
            "Google Ads",
            "Bing Ads"
        ],
        "summary": "Seeking a Performance Marketing Manager with 6-8 years of experience to lead SEM efforts for Way.com's automotive super app. Drive growth across key verticals using data-driven strategies and AI-powered solutions."
    },
    {
        "job_title": "Product Team Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25575",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Product Team Manager</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Contact Email:</strong> careers@way.com\n<strong>Closing Date:</strong> December 4, 2025\n<strong>Job Published:</strong> December 1, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and advanced data analytics to deliver innovative, personalized solutions that transform car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list of fastest-growing companies, and awarded top Product in Insurance by UnitQ, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Job Title: Product Manager</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Product Manager to own the development and delivery of impactful product features that enhance user experience and drive business growth. You will collaborate closely with engineering, design, and data teams to transform innovative ideas into market-ready solutions rapidly.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>End-to-End Product Ownership:</strong> Drive product features from ideation to launch, ensuring alignment with business goals and delivery of high-quality outcomes.</li>\n<li><strong>Data-Driven Decision Making:</strong> Leverage analytics and user feedback to identify opportunities and implement impactful product enhancements.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with engineering, design, and data teams to deliver seamless, timely product releases.</li>\n<li><strong>Performance Management:</strong> Track product performance metrics and execute strategies to maximize growth, retention, and engagement.</li>\n<li><strong>Stakeholder Alignment:</strong> Clearly communicate priorities, timelines, and progress to stakeholders, ensuring transparency and alignment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 3–7 years of experience in product management.</li>\n<li><strong>Product Strategy &amp; Roadmapping:</strong> Defining a clear vision, goals, and long-term plan for a product, and translating them into a prioritized roadmap that guides development and release.</li>\n<li><strong>Data-Driven Decision Making:</strong> Using quantitative and qualitative data to inform choices, validate assumptions, and measure product performance for better business outcomes.</li>\n<li><strong>User-Centric Design Thinking:</strong> Applying a creative, iterative problem-solving approach focused on understanding user needs and delivering solutions that enhance their experience.</li>\n<li><strong>Stakeholder Management:</strong> Building and maintaining positive relationships with individuals or groups who have an interest in the product, ensuring alignment and effective communication.</li>\n<li><strong>Agile Product Development:</strong> Using flexible, iterative methods to develop and deliver product features quickly, adapting to feedback and changing requirements.</li>\n<li><strong>Market &amp; Competitive Analysis:</strong> Researching industry trends, customer behavior, and competitor offerings to identify opportunities and threats for product positioning.</li>\n<li><strong>A/B Testing &amp; Experimentation:</strong> Comparing two or more variations of a product element with real users to determine which performs best.</li>\n<li><strong>Go-To-Market Execution:</strong> Planning and carrying out the strategies needed to launch a product successfully, including positioning, messaging, and channel selection.</li>\n<li><strong>Wireframing &amp; Prototyping:</strong> Creating visual blueprints and interactive mockups of a product to test concepts and guide development before final build.</li>\n<li><strong>User Research:</strong> Collecting and analyzing feedback, observations, and data from real users to understand their behaviors, needs, and motivations.</li>\n<li><strong>Education:</strong> Bachelor’s degree in Engineering or an MBA from a Tier 1 institute.</li>\n<li><strong>Track Record:</strong> Proven track record of launching successful user-facing products.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Apply Here:</h3>\n<p>https://waydot.greythr.com/hire/jobs/product-manager</p>",
        "tags": [
            "3-7 Years",
            "Product Strategy",
            "Data-Driven Decision Making",
            "Agile Product Development"
        ],
        "summary": "Seeking a Product Manager to develop impactful features for America's #1 auto super app. Collaborate cross-functionally to drive products from ideation to launch, enhancing user experience and business growth."
    },
    {
        "job_title": "Sales Expert",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25574",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Job Title: Sales Expert</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/sales-expert\n<strong>Closing Date:</strong> December 4, 2025\n<strong>Job Published:</strong> December 1, 2025</p>\n<h3>About Us:</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and Andreessen Horowitz, we are making car ownership easier, more affordable, and rewarding.</p>\n<h3>Role Overview:</h3>\n<p>We are looking for dynamic, customer-focused Sales Experts to join our Refinance Team. As the voice of our product, you will engage directly with customers, understand their needs, and guide them to the best refinance solutions. This is a B2C sales role emphasizing communication, persuasion, and a passion for sales.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Engage with potential customers via inbound and outbound calls, emails, and chats.</li>\n<li>Clearly explain refinance products, features, and benefits.</li>\n<li>Build trust and rapport to convert inquiries into sales.</li>\n<li>Consistently achieve individual and team sales targets.</li>\n<li>Maintain accurate customer interaction and transaction records in CRM systems.</li>\n<li>Collaborate with Customer Support, Product, and Marketing teams for a smooth post-sale experience.</li>\n<li>Stay updated on product knowledge, process updates, and industry trends.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Bachelor’s or Master’s degree in any discipline (preferably Business or Engineering).</li>\n<li>2–5 years of experience in B2C sales, telesales, or customer acquisition (preferably in financial products, banking, insurance, or fintech).</li>\n<li>Excellent communication skills (verbal and written English).</li>\n<li>Strong persuasion and negotiation abilities.</li>\n<li>Proven ability to understand customer needs and convert interest into sales.</li>\n<li>Target-driven mindset with a passion for customer engagement.</li>\n<li>Basic computer proficiency and experience with CRM tools.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience selling refinance, loan, or insurance products.</li>\n<li>Exposure to US or international customer processes (voice or non-voice).</li>\n</ul>\n<h3>Why You Will Love Working with Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "B2C Sales",
            "CRM",
            "Customer Acquisition"
        ],
        "summary": "Seeking dynamic B2C Sales Experts for Way.com's Refinance Team. Engage customers, explain refinance solutions, and drive sales. Opportunity to impact millions on the #1 Auto Super App."
    },
    {
        "job_title": "Senior - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25573",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Senior Marketing Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO role\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/senior-marketing-designer</p>\n<p><strong>About Way.com</strong>\nWay.com is America’s dominant automotive super app, serving over 10 million customers with services like auto insurance, parking, and EV charging. Utilizing cutting-edge AI, machine learning, and data analytics, Way.com provides innovative, personalized solutions to simplify car ownership. Recognized by Bloomberg and ranked highly among fast-growing companies, Way.com is making car ownership easier, more affordable, and more rewarding.</p>\n<p><strong>Role Overview</strong>\nWay.com is seeking a Senior Marketing Designer to transform ideas into high-performing visuals. This role involves designing impactful campaigns, ads, and graphics across various platforms, including paid media, social media, and email. The designer will collaborate closely with creative, growth, and product teams.</p>\n<p><strong>Roles and Responsibilities</strong>\n- Create digital ad creatives, banners, and social visuals for ongoing campaigns.\n- Conceptualize visuals for product launches and seasonal campaigns.\n- Design for performance, balancing creativity with clarity.\n- Collaborate with copywriters, growth managers, and product designers.\n- Execute designs that align with Way.com’s visual brand and tone.\n- Explore motion graphics and storytelling techniques to enhance engagement.</p>\n<p><strong>Preferred Skills</strong>\n- 3–5 years of experience in marketing design or growth design.\n- Proficiency in Figma, Photoshop, Illustrator, and After Effects.\n- Strong understanding of layout, typography, and visual storytelling.\n- Knowledge of digital marketing principles and ad metrics.\n- A compelling portfolio showcasing creativity and attention to detail.\n- Eagerness to learn, collaborate, and thrive in a fast-paced creative environment.</p>\n<p><strong>Why you will love working with us?</strong>\n- Opportunity to work for the #1 Auto Super app in the US.\n- Chance to make a significant impact on over 10 million users.\n- Dynamic, fast-paced, and innovation-driven work culture.\n- Clear career growth pathways in a rapidly scaling technology company.\n- Competitive compensation.</p>",
        "tags": [
            "3-5 Years",
            "Figma",
            "Photoshop",
            "After Effects"
        ],
        "summary": "Senior Marketing Designer needed for Way.com in Trivandrum. Design high-impact visuals for campaigns and ads, collaborating with creative and growth teams."
    },
    {
        "job_title": "Lead - Marketing Designer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25572",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Lead - Marketing Designer</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> Trivandrum\n<strong>Type:</strong> Full-time/WFO\n<strong>Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 04, Dec 2025</p>\n<p><strong>Contact Email:</strong> careers@way.com\n<strong>Apply Here:</strong> https://waydot.greythr.com/hire/jobs/lead-marketing-designer</p>\n<h3>About Way.com</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. Utilizing cutting-edge AI, machine learning, and data analytics, Way.com delivers innovative, personalized solutions that transform car ownership. Recognized by Bloomberg and Andreessen Horowitz, and a top Product in Insurance by UnitQ, we are dedicated to making car ownership easier, more affordable, and more rewarding.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Lead Marketing Designer</strong>, a hands-on creative leader responsible for translating strategy into compelling visuals and campaigns. This role involves leading creative direction across digital marketing, brand campaigns, and performance ads, guiding a small design team while actively participating in execution.</p>\n<h3>Roles and Responsibilities</h3>\n<ul>\n<li>Lead and manage a team of marketing designers.</li>\n<li>Develop and execute creative strategy across paid, owned, and social channels.</li>\n<li>Drive campaign concepts for product launches, seasonal pushes, and partnerships.</li>\n<li>Maintain a consistent visual identity across Way.com’s global marketing ecosystem.</li>\n<li>Partner with Growth, Product, and Content teams to create high-performing visuals.</li>\n<li>Inspire creative excellence and mentor designers to elevate craft quality.</li>\n<li>Balance creativity with marketing performance and data-driven decisions.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 6–10 years in marketing design, art direction, or brand design.</li>\n<li>Proven experience leading creative or design teams.</li>\n<li>Strong portfolio showcasing campaign systems, digital storytelling, and ad design.</li>\n<li><strong>Technical Expertise:</strong> Expertise in Figma, Photoshop, Illustrator, After Effects / Premiere Pro.</li>\n<li>Experience in performance design, including understanding CTR, engagement metrics, and creative testing.</li>\n<li>Strong visual storytelling and typography skills.</li>\n<li>A passion for clean, modern, and conversion-friendly design.</li>\n</ul>\n<h3>Why you will love working with us?</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "6-10 Years",
            "Figma",
            "Photoshop",
            "After Effects"
        ],
        "summary": "Lead Marketing Designer needed for Way.com, America's auto super app. Drive creative strategy and visuals for campaigns, leading a design team with a focus on performance and brand consistency."
    },
    {
        "job_title": "Team Lead - SEO",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25571",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Team Lead - SEO</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Date Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 04, Dec 2025\n<strong>Contact:</strong> careers@way.com</p>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/seo-team-lead</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, Way.com is revolutionizing car ownership.</p>\n<h3>Job Title: Team Lead - SEO</h3>\n<ul>\n<li><strong>Experience:</strong> 9 - 11 years</li>\n<li><strong>Work Arrangement:</strong> On-site</li>\n<li><strong>Employment Type:</strong> Full-time</li>\n</ul>\n<h3>Role Overview</h3>\n<p>We are seeking a skilled Team Lead, SEO to lead our organic growth efforts and enhance our search engine presence. This leadership role involves developing and executing comprehensive SEO strategies, managing a team of SEO specialists, and collaborating across departments to optimize our digital footprint. Ideal candidates possess a deep understanding of search algorithms, technical SEO, content strategy, and a passion for driving results.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Develop &amp; Execute SEO Strategies:</strong> Define and implement a robust SEO roadmap aligned with Way.com’s business objectives.</li>\n<li><strong>Lead &amp; Mentor the SEO Team:</strong> Manage a team of SEO professionals, fostering a culture of continuous learning and performance excellence.</li>\n<li><strong>Optimize On-Page &amp; Off-Page SEO:</strong> Improve keyword rankings, content performance, and backlink quality to enhance organic visibility.</li>\n<li><strong>Technical SEO Management:</strong> Identify and resolve site architecture issues, crawl errors, indexing problems, and page speed optimizations.</li>\n<li><strong>Data-Driven Decision Making:</strong> Analyze traffic trends, keyword performance, and search visibility using tools like Google Analytics, Search Console, SEMrush, and Ahrefs.</li>\n<li><strong>Content &amp; Product Collaboration:</strong> Work closely with content creators, developers, and product teams to integrate SEO best practices into website enhancements.</li>\n<li><strong>Local &amp; Mobile SEO Optimization:</strong> Enhance local search presence and mobile-first indexing strategies to improve search rankings.</li>\n<li><strong>Competitive &amp; Market Analysis:</strong> Conduct SEO audits, monitor competitor strategies, and identify new opportunities.</li>\n<li><strong>SEO Performance Reporting:</strong> Provide insights and actionable recommendations through detailed SEO reports and dashboards.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>9-11 years of SEO experience, with at least 2 years in a team lead role.</li>\n<li>Proven expertise in technical SEO, content strategy, and link-building.</li>\n<li>Strong knowledge of search engine algorithms, ranking factors, and SEO trends.</li>\n<li>Proficiency in Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, and other SEO tools.</li>\n<li>Strong understanding of mobile-first indexing, Core Web Vitals, and structured data (schema markup).</li>\n<li>Experience with A/B testing, conversion rate optimization (CRO), and SEO for local businesses (Google My Business optimization).</li>\n<li>Ability to analyze and interpret SEO data to make data-driven decisions.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Basic knowledge of HTML, CSS, JavaScript, and website development principles.</li>\n<li>Understanding of PPC advertising and its relationship with organic search.</li>\n<li>Experience working in a high-growth startup or fast-paced environment.</li>\n<li>Familiarity with social media marketing and its impact on SEO.</li>\n<li>Strong project management skills, with the ability to prioritize and execute multiple SEO initiatives.</li>\n</ul>\n<h3>Why You Will Love Working With Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@way.com</p>",
        "tags": [
            "9+ Years",
            "SEO",
            "Technical SEO",
            "Google Analytics"
        ],
        "summary": "Lead SEO strategy and team for Way.com, America's auto super app. Drive organic growth and enhance search presence through data-driven optimization and collaboration."
    },
    {
        "job_title": "Manager - Project",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25570",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Project Manager at Way Dot Com (P) Ltd</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Closing Date:</strong> December 4, 2025\n<strong>Job Published:</strong> December 1, 2025\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/project-manager</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize cutting-edge AI, machine learning, and data analytics to offer innovative, personalized solutions for car ownership. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded top Product in Insurance by UnitQ, we are simplifying car ownership.</p>\n<h3>Job Title</h3>\n<p>Project Manager</p>\n<h3>Experience Required</h3>\n<p>8+ years</p>\n<h3>Work Arrangement</h3>\n<p>On-site</p>\n<h3>Employment Type</h3>\n<p>Full-time</p>\n<h2>Role Overview</h2>\n<p>We are seeking a seasoned Project Manager with over 8 years of experience to lead strategic projects from inception to completion. The ideal candidate will possess strong leadership, domain expertise, and execution skills to ensure successful project delivery within scope, timeline, and budget.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Lead the full project lifecycle for multiple medium to large-scale initiatives.</li>\n<li>Define and manage project scope, objectives, deliverables, and success criteria.</li>\n<li>Develop and execute detailed project plans, including resource allocation, timelines, and budgets.</li>\n<li>Identify risks and dependencies, implement mitigation strategies, and escalate issues as needed.</li>\n<li>Manage stakeholder relationships, ensuring clear communication and alignment across all levels.</li>\n<li>Conduct regular project reviews, reporting progress, challenges, and solutions to leadership.</li>\n<li>Drive collaboration across cross-functional teams for smooth execution.</li>\n<li>Ensure adherence to quality standards and compliance with organizational processes and policies.</li>\n<li>Mentor and guide junior team members to enhance project management capabilities.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s degree in Engineering, Business Administration, or a related field (Master’s degree is advantageous).</li>\n<li>8+ years of proven project management experience, preferably within a fintech platform.</li>\n<li>Strong expertise in managing complex, cross-functional projects.</li>\n<li>Proficiency in project management tools such as MS Project, JIRA, Asana, Trello, or similar.</li>\n<li>In-depth knowledge of Agile, Waterfall, or hybrid project management methodologies.</li>\n<li>Excellent stakeholder management, leadership, and communication skills.</li>\n<li>Strong problem-solving and decision-making abilities under pressure.</li>\n<li>Certifications like PMP, PRINCE2, or Agile (Scrum Master/SAFe) are highly preferred.</li>\n<li>Experience with tools like MPP.</li>\n<li>Ability to collaborate effectively with multiple teams and drive for results.</li>\n</ul>\n<h2>Why You Will Love Working With Us</h2>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Make a significant impact across 10+ million users.</li>\n<li>Experience a dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Benefit from clear career growth pathways in a rapidly scaling tech company.</li>\n<li>Competitive compensation package.</li>\n</ul>\n<p><strong>Apply Now:</strong> https://waydot.greythr.com/hire/jobs/project-manager</p>",
        "tags": [
            "8+ Years",
            "Project Management",
            "Agile",
            "Fintech"
        ],
        "summary": "Seeking an experienced Project Manager to lead strategic initiatives. Requires 8+ years of experience, strong leadership, and project management skills for successful delivery."
    },
    {
        "job_title": "Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25569",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Way Dot Com (P) Ltd - Customer Success Executive</h2>\n<p><strong>Company:</strong> Way.Com India Pvt Ltd\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/customer-success-executive\n<strong>Closing Date:</strong> December 4, 2025\n<strong>Job Published:</strong> December 1, 2025</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services including auto insurance, parking, and EV charging. We utilize cutting-edge AI, machine learning, and data analytics to offer innovative and personalized solutions. Recognized by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and awarded Top Product in Insurance by UnitQ, Way.com is simplifying and enhancing car ownership.</p>\n<h3>Job Title: Customer Success Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and customer-focused Customer Success Executive for our voice process team. This role is crucial for delivering excellent customer service via phone, handling inquiries with professionalism and efficiency.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Address customer queries through phone, email, chat, and social media channels.</li>\n<li>Troubleshoot and resolve customer concerns efficiently and effectively.</li>\n<li>Handle inquiries related to products, orders, returns, and general support requests.</li>\n<li>Maintain accurate customer records and feedback in the CRM system.</li>\n<li>Escalate complex or unresolved issues to the appropriate internal teams.</li>\n<li>Contribute to tracking customer satisfaction metrics and suggest improvements.</li>\n<li>Ensure every interaction reflects professionalism, empathy, and a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience (2-5 years) in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to stay calm under pressure and handle difficult situations with professionalism.</li>\n<li>Strong problem-solving abilities with attention to detail.</li>\n<li>Knowledge of CRM systems (preferred but not required).</li>\n<li>Positive attitude and a passion for helping others.</li>\n<li>Ability to work effectively in a team environment.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Opportunity to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "Customer Service",
            "CRM",
            "Communication Skills"
        ],
        "summary": "Seeking a Customer Success Executive for a voice process role to deliver excellent customer service. Responsibilities include handling inquiries, resolving issues, and maintaining records."
    },
    {
        "job_title": "Spanish Customer Success - Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25568",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Spanish Customer Success Executive</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.Com India Pvt Ltd)\n<strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com\n<strong>Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 04, Dec 2025\n<strong>Contact Email:</strong> careers@way.com</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, powering over 10 million customers with services like auto insurance, parking, and EV charging. Utilizing AI, machine learning, and data analytics, we offer innovative solutions. Way.com has been featured by Bloomberg, ranked 48th on Andreessen Horowitz’s Marketplace list, and recognized by UnitQ for product excellence in Insurance.</p>\n<h3>Job Title: Spanish Customer Success Executive</h3>\n<p><strong>Work Arrangement:</strong> On-site\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Role Overview</h3>\n<p>Way.com is seeking a dynamic and customer-focused Spanish Customer Success Executive for our voice process team. This role involves providing excellent customer service to Spanish-speaking clients via phone, handling inquiries professionally and efficiently.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Customer Interaction:</strong> Manage inbound and outbound calls, providing prompt and effective resolutions for customer queries, concerns, and complaints.</li>\n<li><strong>Service Excellence:</strong> Deliver empathetic, professional support to ensure positive customer experiences.</li>\n<li><strong>Issue Escalation:</strong> Identify, prioritize, and escalate complex cases to appropriate departments for swift resolution.</li>\n<li><strong>Documentation:</strong> Maintain accurate records of customer interactions and update databases.</li>\n<li><strong>Performance Goals:</strong> Consistently meet or exceed targets for customer satisfaction, first-call resolution, and productivity.</li>\n<li><strong>Product Knowledge:</strong> Stay informed about company products and services to provide accurate information.</li>\n<li><strong>Team Collaboration:</strong> Work with colleagues to foster a supportive, collaborative, and high-performing environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Fluency in both <strong>Spanish and English</strong> (written and spoken).</li>\n<li>Proven experience in a customer service role, preferably in a voice process.</li>\n<li>Strong interpersonal and communication skills, with a patient and empathetic approach.</li>\n<li>Ability to multitask and manage time efficiently in a fast-paced environment.</li>\n<li>Familiarity with automotive services, fintech platforms, or similar industries is an advantage.</li>\n<li>Flexibility to work in shifts and adapt to changing schedules.</li>\n</ul>\n<h3>Why You Will Love Working with Us</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a meaningful impact across 10+ million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear pathways for career growth in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>\n<h3>Apply Here:</h3>\n<p>https://waydot.greythr.com/hire/jobs/spanish-customer-success-executive</p>",
        "tags": [
            "0-1 Years",
            "Spanish",
            "Customer Service",
            "Voice Process"
        ],
        "summary": "Seeking a Spanish Customer Success Executive for an on-site, full-time role. Handle customer inquiries via phone, resolve issues, and ensure service excellence. Fluency in Spanish and English required."
    },
    {
        "job_title": "Event Parking - Operations Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/25567",
        "location": "Technopark",
        "closing_date": "04 Dec 2025",
        "job_description": "<h2>Operations Executive - Event Parking</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd\n<strong>Location:</strong> Thiruvananthapuram, India\n<strong>Contact Email:</strong> careers@way.com\n<strong>Application Link:</strong> https://waydot.greythr.com/hire/jobs/operations-executive-event-parking</p>\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize AI, machine learning, and data analytics to provide innovative, personalized solutions for car ownership. Recognized by Bloomberg and ranked among the fastest-growing companies worldwide, Way.com is simplifying car ownership.</p>\n<h3>Job Title:</h3>\n<p>Operations Executive - Event Parking</p>\n<h3>Work Arrangement:</h3>\n<p>On-site</p>\n<h3>Employment Type:</h3>\n<p>Full-time</p>\n<h3>Role Overview</h3>\n<p>We are looking for an experienced Operations Executive specializing in Event Parking, with a background in Operations management and process optimization.</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Manage daily operations within the Event Parking vertical.</li>\n<li>Ensure operational efficiency and effectiveness.</li>\n<li>Oversee and improve various operational processes.</li>\n<li>Coordinate with diverse teams and stakeholders to achieve operational objectives.</li>\n<li>Deliver excellent customer service to our clients.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>MBA in any discipline (Operations/Analytics preferred).</li>\n<li>Minimum 1-2 years of prior experience in a related field.</li>\n<li>Proficiency in Excel and experience handling data sets.</li>\n<li>Strong attention to detail, with the ability to identify and rectify inconsistencies.</li>\n<li>Process-driven mindset, with the capacity to suggest improvements.</li>\n<li>Problem-solving skills and ownership of outcomes.</li>\n<li>Strong communication abilities for cross-team coordination.</li>\n<li>Flexibility to work evenings and weekends as required by business needs.</li>\n</ul>\n<h3>Why You Will Love Working With Us:</h3>\n<ul>\n<li>Opportunity to work for the #1 Auto Super app in the US.</li>\n<li>Chance to make a significant impact on over 10 million users.</li>\n<li>Dynamic, fast-paced, and innovation-driven work culture.</li>\n<li>Clear career growth pathways in a rapidly scaling technology company.</li>\n<li>Competitive compensation.</li>\n</ul>",
        "tags": [
            "1-2 Years",
            "Operations Management",
            "Excel",
            "Process Optimization"
        ],
        "summary": "Operations Executive - Event Parking sought for Way.com. Responsibilities include managing daily event parking operations, ensuring efficiency, and improving processes. Requires MBA, 1-2 years experience, and Excel proficiency."
    },
    {
        "job_title": "Senior QA Engineer",
        "company": "Icore Pioneer Business Solution Pvt Ltd",
        "url": "https://technopark.org/job-details/25566",
        "location": "Technopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Senior QA Engineer</h2>\n<p><strong>Company:</strong> iCore Pioneer Business Solution Pvt Ltd\n<strong>Location:</strong> T-TBI A(10), Ground Floor, Thejaswini Building, Technopark Campus, 695581\n<strong>Website:</strong> http://www.icorepioneer.com\n<strong>Contact Email:</strong> hariprabha@icorepioneer.com\n<strong>Job Published:</strong> 01,Dec 2025\n<strong>Closing Date:</strong> 08,Dec 2025</p>\n<h3>About the Role</h3>\n<p>We are hiring a skilled and detail-oriented Senior QA Engineer to lead our quality assurance processes. The candidate will be responsible for managing both manual and automation testing, ensuring product quality, stability, and performance across multiple modules. This role includes team leadership, mentoring junior QA members, and establishing best practices for testing workflows.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Manual Testing</strong>\n- Create and execute detailed test plans, test cases, and test scenarios\n- Perform functional, regression, smoke, UI, and usability testing\n- Document defects clearly with detailed steps and collaborate with developers for resolution\n- Validate frontend, backend, API, and database workflows</p>\n<p><strong>Automation Testing</strong>\n- Develop and maintain automation test scripts (Selenium / Cypress / Playwright / Appium)\n- Build automation frameworks and test environments\n- Implement CI/CD-based automated test execution\n- Maintain test cases, test coverage, and test documentation</p>\n<p><strong>Team Leadership</strong>\n- Lead and mentor junior QA engineers\n- Allocate tasks, track progress, and ensure on-time delivery\n- Conduct training sessions and enforce QA best practices\n- Coordinate with product, development, and management teams</p>\n<p><strong>Process &amp; Quality Ownership</strong>\n- Establish QA processes, metrics, and standard operating procedures\n- Drive quality initiatives to minimize bugs in production\n- Work closely with the release team for version validation and sign-off\n- Ensure high coverage across functional, performance, and security testing</p>\n<h3>Preferred Skills</h3>\n<p><strong>Required Skills</strong>\n- Minimum 4+ years in QA (Manual + Automation)\n- Strong knowledge of QA methodologies, SDLC &amp; STLC\n- Strong command in automation tools: Selenium, Cypress, Playwright, Appium, Postman\n- Experience with API testing and tools like Postman, Swagger, JMeter\n- Knowledge of SQL for data validation\n- Experience working with Agile/Scrum teams\n- Ability to write detailed bug reports and perform RCA (Root Cause Analysis)\n- Knowledge of performance testing tools (JMeter, LoadRunner)\n- Experience in mobile application testing (Android &amp; iOS)\n- Understanding of version control (Git)\n- Experience with CI/CD: GitHub Actions, Azure DevOps, Jenkins</p>\n<p><strong>Soft Skills</strong>\n- Strong leadership and mentoring ability\n- Excellent communication and documentation skills\n- Highly analytical and detail-oriented\n- Proactive, responsible, and self-organizing personality</p>",
        "tags": [
            "4+ Years",
            "Selenium",
            "Cypress",
            "Playwright"
        ],
        "summary": "Seeking a Senior QA Engineer to lead manual and automation testing efforts. Responsibilities include team leadership, process establishment, and ensuring product quality."
    },
    {
        "job_title": "Flutter Developer",
        "company": "Icore Pioneer Business Solution Pvt Ltd",
        "url": "https://technopark.org/job-details/25565",
        "location": "Technopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Flutter Developer at iCore Pioneer Business Solution Pvt Ltd</h2>\n<p><strong>Location:</strong> T-TBI A(10), Ground Floor, Thejaswini Building, Technopark Campus, 695581\n<strong>Contact Email:</strong> hariprabha@icorepioneer.com\n<strong>Website:</strong> http://www.icorepioneer.com</p>\n<p><strong>Job Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 08, Dec 2025</p>\n<h3>About the Role</h3>\n<p>We are seeking an experienced Flutter Developer who will be responsible for developing high-performance mobile applications for Android and iOS. You will work closely with backend developers, UI/UX designers, and product teams to deliver smooth, scalable, and visually appealing mobile experiences.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop advanced cross-platform mobile apps using Flutter &amp; Dart</li>\n<li>Write efficient, maintainable, and reusable code following best practices</li>\n<li>Collaborate with the team to define, design, and ship new features</li>\n<li>Integrate RESTful APIs, WebSockets, Firebase, and third-party libraries</li>\n<li>Optimize application performance, speed, and memory usage</li>\n<li>Maintain code quality through code reviews and proper testing</li>\n<li>Troubleshoot and debug issues related to performance, UI, and functional flows</li>\n<li>Stay up-to-date with the latest trends in mobile app development</li>\n<li>Deploy apps to Play Store and App Store, including handling release cycles</li>\n<li>Work in an Agile/Scrum environment</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Required Skills</h4>\n<ul>\n<li>Minimum 3 years of hands-on Flutter development experience</li>\n<li>Strong command over Dart language</li>\n<li>Experience with State Management (Provider, Bloc, Riverpod, GetX, etc.)</li>\n<li>Strong experience in integrating APIs, JSON, authentication flows</li>\n<li>Familiarity with native Android/iOS is a plus</li>\n<li>Proficiency in working with Firebase (Cloud Firestore, FCM, Auth)</li>\n<li>Experience in writing unit tests and maintaining code quality</li>\n<li>Knowledge of CI/CD pipelines for mobile apps</li>\n<li>Experience with mobile analytics and performance monitoring tools</li>\n<li>Understanding of clean architecture and design patterns</li>\n</ul>\n<h4>Soft Skills</h4>\n<ul>\n<li>Strong communication and team collaboration</li>\n<li>Ability to work independently with minimal supervision</li>\n<li>Excellent problem-solving and debugging skills</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Flutter",
            "Dart",
            "Firebase"
        ],
        "summary": "Seeking an experienced Flutter Developer to build high-performance Android/iOS apps. Responsibilities include coding, API integration, optimization, and deployment in an Agile environment."
    },
    {
        "job_title": "Software Developer",
        "company": "Icore Pioneer Business Solution Pvt Ltd",
        "url": "https://technopark.org/job-details/25564",
        "location": "Technopark",
        "closing_date": "08 Dec 2025",
        "job_description": "<h2>Software Developer (Fresher)</h2>\n<p><strong>Company:</strong> iCore Pioneer Business Solution Pvt Ltd\n<strong>Location:</strong> T-TBI A(10), Ground Floor, Thejaswini Building, Technopark Campus, 695581\n<strong>Website:</strong> http://www.icorepioneer.com\n<strong>Contact Email:</strong> hariprabha@icorepioneer.com\n<strong>Job Published:</strong> 01, Dec 2025\n<strong>Closing Date:</strong> 08, Dec 2025</p>\n<h3>About the Role</h3>\n<p>We are looking for a passionate and ambitious Software Developer (Fresher) to join our growing engineering team. The ideal candidate is enthusiastic about learning, has strong fundamentals in programming, and basic hands-on exposure to HTML, JavaScript, and .NET technologies. You will work with senior developers and get the opportunity to build high-quality applications and contribute to real-world projects.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Assist in the design, development, and testing of software applications using .NET, C#, HTML, and JavaScript</li>\n<li>Write clean, maintainable, and efficient code under senior developer guidance</li>\n<li>Support the development team in debugging, troubleshooting, and resolving software defects</li>\n<li>Participate in peer reviews and follow coding standards</li>\n<li>Work with databases, APIs, and web services</li>\n<li>Learn and adopt new tools, frameworks, and technologies based on project requirements</li>\n<li>Collaborate with cross-functional teams including QA, UI/UX, and product</li>\n<li>Contribute to documentation and reporting</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li>Strong understanding of HTML, CSS, JavaScript</li>\n<li>Fundamental knowledge of .NET / C#</li>\n<li>Good understanding of OOPs concepts, data structures, and algorithms</li>\n<li>Basic knowledge of SQL or any relational database</li>\n<li>Strong analytical and problem-solving abilities</li>\n<li>Ability to learn quickly and adapt to fast-paced environments</li>\n<li>Personal projects, GitHub portfolio, or coding certifications</li>\n<li>Exposure to cloud platforms (Azure/AWS/GCP)</li>\n</ul>\n<p><strong>Soft Skills</strong></p>\n<ul>\n<li>Excellent communication and interpersonal skills</li>\n<li>Team player with a positive learning attitude</li>\n<li>Strong attention to detail and ability to follow instructions</li>\n</ul>",
        "tags": [
            "Fresher",
            ".NET",
            "JavaScript",
            "HTML"
        ],
        "summary": "Seeking an ambitious Software Developer (Fresher) with HTML, JavaScript, and .NET exposure. You will assist in development, testing, and debugging of applications under senior guidance."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25563",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Company:</strong> KENLAND IT SOLUTIONS (P) Ltd</p>\n<p><strong>Location:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA , 695581</p>\n<p><strong>Website:</strong> https://www.kenland.in</p>\n<p><strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p><strong>Job Published:</strong> 29,Nov 2025</p>\n<p><strong>Closing Date:</strong> 31,Dec 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a proactive and experienced Business Development Executive with 2–10 years of experience. The ideal candidate will manage sales calls, generate qualified leads, build strong client relationships, conduct market research, and collaborate closely with internal teams to drive business growth and ensure client satisfaction.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Attend and manage sales calls and client inquiries professionally.</li>\n<li>Generate high-quality leads through research, networking, cold calling, email outreach, and digital platforms.</li>\n<li>Develop and implement strategies for sustainable business growth.</li>\n<li>Build and maintain strong relationships with clients and vendors.</li>\n<li>Conduct market research to identify trends, competitor activities, and opportunities in target regions.</li>\n<li>Work cross-functionally with marketing, operations, and product teams to ensure successful client onboarding and satisfaction.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>BE/B.Tech in CSE, IT, or a related field (Preferred).</li>\n<li>Experience working with IT services companies delivering digital transformation solutions.</li>\n<li>Exceptional relationship-building, negotiation, and client management skills.</li>\n<li>Proficiency in market research, proposal development, and strategic planning.</li>\n<li>Excellent written and verbal communication and presentation skills.</li>\n<li>Ability to collaborate effectively with technical and non-technical teams.</li>\n</ul>",
        "tags": [
            "2-10 Years",
            "Business Development",
            "Client Relationship Management",
            "Market Research"
        ],
        "summary": "Seeking a Business Development Executive with 2-10 years experience to manage sales, generate leads, and build client relationships. Drive business growth and ensure client satisfaction through strategic planning and collaboration."
    },
    {
        "job_title": "FIELD SALES COORDINATOR (MALE CANDIDATES)",
        "company": "Hyz Ventures Intl (P) Ltd",
        "url": "https://technopark.org/job-details/25562",
        "location": "Technopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Field Sales Coordinator (Male Candidates)</h2>\n<p><strong>Company:</strong> HYZ VENTURES INTL (P) Ltd\n<strong>Address:</strong> GE, Ground Floor, Padmanabham, Technopark, Karyavattom P.O, TVPM, 695581\n<strong>Website:</strong> http://www.hyzventures.com</p>\n<p><strong>Job Published:</strong> 29, November 2025\n<strong>Closing Date:</strong> 15, December 2025</p>\n<p><strong>Contact Email:</strong> hr@hyzventures.com</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Deliver excellent customer service to clients and customers.</li>\n<li>Oversee and improve various operational processes.</li>\n<li>Acquire new clients and retain existing ones, acting as the key point of contact.</li>\n<li>Conduct product/service demonstrations and presentations to prospective clients, negotiate contracts, and finalize sales deals.</li>\n<li>Identify new sales opportunities through cold calling, emailing, and networking events, initiating contact with prospects.</li>\n<li>List new customers in developing sites.</li>\n<li>Solve customer queries by resolving errors/bugs in the application.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Education: Plus Two / Any degree</li>\n<li>Experience: Minimum 0 - 1 years of prior experience in a related field.</li>\n<li>Possess a problem-solving mindset with ownership of outcomes.</li>\n<li>Strong communication skills for coordination across teams.</li>\n<li>Proficiency in handling tablets/smartphones.</li>\n<li>Eager to learn and adapt to new challenges.</li>\n<li>Ability to work well in a team and collaborate effectively.</li>\n</ul>\n<p><strong>Application Instructions:</strong>\nInterested candidates are requested to send their resumes to hr@hyzventures.com with the subject line \"Field Sales Coordinator\".</p>",
        "tags": [
            "0-1 Years",
            "Sales",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "Seeking a Field Sales Coordinator to deliver customer service, acquire clients, and conduct sales demonstrations. Requires strong communication and problem-solving skills with 0-1 years of experience."
    },
    {
        "job_title": "Digital Marketing Executive",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25561",
        "location": "Technopark",
        "closing_date": "20 Dec 2025",
        "job_description": "<h2>Digital Marketing Executive</h2>\n<p><strong>Company:</strong> Globcom Solutions (P) Ltd\n<strong>Location:</strong> Technopark Trivandrum (Work From Office)\n<strong>Contact Email:</strong> rajesh@globcomsolution.com\n<strong>Website:</strong> http://www.globcomsolution.com\n<strong>Address:</strong> Module 2502, 5th floor, Yamuna Building, Technopark Phase -3, Thiruvananthapuram, 695583\n<strong>Job Published:</strong> 29,Nov 2025\n<strong>Closing Date:</strong> 20,Dec 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a proactive, enthusiastic, and creative Digital Marketing Executive to join our dynamic marketing team. This role is ideal for individuals who have a passion for digital trends, social media, and online brand building. The candidate will work closely with the marketing team to support digital campaigns, improve online presence, and enhance brand visibility across various digital platforms.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Assist in planning and executing digital marketing campaigns across social media, email, and content marketing channels.</li>\n<li>Manage, schedule, and publish posts across all social media platforms.</li>\n<li>Monitor campaign performance and prepare basic analytics reports.</li>\n<li>Conduct market research and competitor analysis to support strategy development.</li>\n<li>Help create, edit, and optimize content for SEO and user engagement.</li>\n<li>Maintain and update marketing databases, mailing lists, and digital assets.</li>\n<li>Learn and contribute to basic SEO activities, email marketing, and online advertisement setups.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Hands-on exposure to tools like Canva, Google Analytics, Mailchimp, Meta Business Suite, or similar.</li>\n<li>Basic familiarity with website CMS platforms (e.g., WordPress).</li>\n<li>Creative mindset with an eye for design and visual content.</li>\n<li>Ability to generate simple creatives, captions, and content ideas.</li>\n<li>Need graphic designing skills (Photoshop, Illustrator).</li>\n</ul>\n<h3>Required Qualification</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or related field.</li>\n<li>Engineering graduates preferred.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Digital Marketing",
            "SEO",
            "Content Creation"
        ],
        "summary": "Seeking a Digital Marketing Executive to support campaigns, manage social media, and enhance online presence. Requires a Bachelor's degree and creative skills in digital marketing tools."
    },
    {
        "job_title": "TECHNOLOGY ENGINEER",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/25560",
        "location": "Technopark",
        "closing_date": "13 Jan 2026",
        "job_description": "<h2>Technology Engineer at REIZEND (P) Ltd</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Address:</strong> SBC Module 15, 2nd Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Date Published:</strong> 29, Nov 2025\n<strong>Closing Date:</strong> 13, Jan 2026</p>\n<h3>Job Overview</h3>\n<ul>\n<li><strong>Location:</strong> Trivandrum</li>\n<li><strong>Work Arrangement:</strong> Work from office</li>\n<li><strong>Experience Required:</strong> 6+ Years</li>\n<li><strong>Salary:</strong> 18 LPA</li>\n<li><strong>Job Type:</strong> Full-time, Permanent</li>\n</ul>\n<h3>Key Responsibilities:</h3>\n<ol>\n<li><strong>Designing Technology Systems:</strong> Plan and design the structure of technology solutions, and collaborate with design and development teams.</li>\n<li><strong>Communication:</strong> Convey system requirements to software development teams, explain plans to developers and designers, and communicate the value of solutions to stakeholders and clients.</li>\n<li><strong>Stakeholder Management:</strong> Understand client and stakeholder visions for systems and manage their expectations.</li>\n<li><strong>Architectural Oversight:</strong> Develop and implement robust architectures for AI/ML and data science solutions, ensuring scalability, security, and performance. Oversee architecture for data-driven web applications and data science projects, providing guidance on best practices in data processing, model deployment, and end-to-end workflows.</li>\n<li><strong>Problem Solving:</strong> Identify and troubleshoot technical problems in existing or new systems, and assist in resolving them.</li>\n<li><strong>Ensuring Quality:</strong> Verify that systems meet security and quality standards, and monitor them to ensure they align with user needs and business goals.</li>\n<li><strong>Project Management:</strong> Break down project requirements into manageable tasks and organize the workloads of technical teams.</li>\n<li><strong>Tool &amp; Framework Expertise:</strong> Utilize relevant tools and technologies, including LLMs, TensorFlow, PyTorch, Apache Spark, cloud platforms (AWS, Azure, GCP), Web App development frameworks, and DevOps practices.</li>\n<li><strong>Continuous Improvement:</strong> Stay updated on emerging technologies and methods in AI, ML, data science, and web applications, sharing insights to foster team improvement.</li>\n</ol>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li><strong>AI/ML Frameworks:</strong> Proficiency in TensorFlow, PyTorch, Keras, scikit-learn for developing ML and deep learning models.</li>\n<li><strong>LLMs:</strong> Experience with self-hosted or managed LLMs.</li>\n<li><strong>NLP &amp; Computer Vision:</strong> Knowledge of NLP tools (e.g., SpaCy, NLTK, Hugging Face Transformers) and Computer Vision frameworks (e.g., OpenCV).</li>\n<li><strong>Back-end Development:</strong> Experience with frameworks like Django, Spring Boot, Node.js, Express, and building RESTful/GraphQL APIs.</li>\n<li><strong>Architecture:</strong> Familiarity with microservices, serverless, event-driven architectures, and design patterns.</li>\n<li><strong>Front-end Development:</strong> Proficiency in React, Angular, or Vue.js, with an understanding of responsive design, UX/UI, and state management (e.g., Redux).</li>\n<li><strong>Databases:</strong> In-depth knowledge of SQL and NoSQL databases (e.g., PostgreSQL, MongoDB, Cassandra) and caching solutions (e.g., Redis, Memcached).</li>\n<li><strong>Big Data Processing:</strong> Expertise in tools like Apache Spark, Hadoop, Pandas, and Dask.</li>\n<li><strong>Data Warehousing &amp; ETL:</strong> Understanding of data warehouses and ETL tools (e.g., Snowflake, BigQuery, Redshift, Airflow).</li>\n<li><strong>Visualization Tools:</strong> Familiarity with tools like Tableau, Power BI, Plotly.</li>\n<li><strong>Model Deployment:</strong> Knowledge of deploying models using TensorFlow Serving, Flask, FastAPI, or cloud-native services (e.g., AWS SageMaker, Google AI Platform).</li>\n<li><strong>MLOps:</strong> Familiarity with MLOps tools and practices (e.g., MLflow, Kubeflow, TFX).</li>\n<li><strong>DevOps &amp; Cloud Native:</strong> Knowledge of CI/CD, IaC, and Cloud Native toolchains.</li>\n<li><strong>Security:</strong> Understanding of security principles (e.g., firewalls, VPC, IAM, TLS/SSL).</li>\n<li><strong>API Management:</strong> Familiarity with API Gateway, service mesh (e.g., Istio), and NGINX.</li>\n</ul>",
        "tags": [
            "6+ Years",
            "AI/ML",
            "Cloud Platforms",
            "LLMs"
        ],
        "summary": "Technology Engineer needed with 6+ years of experience in AI/ML, data science, and web applications. Responsibilities include system design, architecture, and stakeholder management."
    },
    {
        "job_title": "SENIOR TECHNOLOGY ANALYST (6+ YEARS)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/25559",
        "location": "Technopark",
        "closing_date": "13 Jan 2026",
        "job_description": "<h2>Senior Technology Analyst (6+ Years)</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> Trivandrum (Work from office)\n<strong>Experience:</strong> 6+ Years\n<strong>Salary:</strong> 18 LPA\n<strong>Job Type:</strong> Full-time, Permanent\n<strong>Closing Date:</strong> January 13, 2026\n<strong>Job Published:</strong> November 29, 2025\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>About REIZEND (P) Ltd:</strong>\nREIZEND (P) Ltd\nSBC Module 15, -2 Floor, Thejaswini Building,\nTechnopark phase 1, Trivandrum , 695581\nhttp://www.reizendretail.in</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li><strong>Designing technology systems:</strong> Plan and design the structure of technology solutions, and work with design and development teams to assist with the process.</li>\n<li><strong>Communicating:</strong> Communicate system requirements to software development teams, and explain plans to developers and designers. They also communicate the value of a solution to stakeholders and clients.</li>\n<li><strong>Managing Stakeholders:</strong> Work with clients and stakeholders to understand their vision for the systems. Should also manage stakeholder expectations.</li>\n<li><strong>Architectural Oversight:</strong> Develop and implement robust architectures for AI/ML and data science solutions, ensuring scalability, security, and performance. Oversee architecture for data-driven web applications and data science projects, providing guidance on best practices in data processing, model deployment, and end-to-end workflows.</li>\n<li><strong>Problem Solving:</strong> Identify and troubleshoot technical problems in existing or new systems. Assist with solving technical problems when they arise.</li>\n<li><strong>Ensuring Quality:</strong> Ensure if systems meet security and quality standards. Monitor systems to ensure they meet both user needs and business goals.</li>\n<li><strong>Project management:</strong> Break down project requirements into manageable pieces of work, and organise the workloads of technical teams.</li>\n<li><strong>Tool &amp; Framework Expertise:</strong> Utilise relevant tools and technologies, including but not limited to LLMs, TensorFlow, PyTorch, Apache Spark, cloud platforms (AWS, Azure, GCP), Web App development frameworks and DevOps practices.</li>\n<li><strong>Continuous Improvement:</strong> Stay current on emerging technologies and methods in AI, ML, data science, and web applications, bringing insights back to the team to foster continuous improvement.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ol>\n<li>Proficiency in AI/ML frameworks such as TensorFlow, PyTorch, Keras, and scikit-learn for developing machine learning and deep learning models.</li>\n<li>Knowledge or experience working with self-hosted or managed LLMs.</li>\n<li>Knowledge or experience with NLP tools and libraries (e.g., SpaCy, NLTK, Hugging Face Transformers) and familiarity with Computer Vision frameworks like OpenCV and related libraries for image processing and object recognition.</li>\n<li>Experience or knowledge in back-end frameworks (e.g., Django, Spring Boot, Node.js, Express etc.) and building RESTful and GraphQL APIs.</li>\n<li>Familiarity with microservices, serverless, and event-driven architectures. Strong understanding of design patterns (e.g., Factory, Singleton, Observer) to ensure code scalability and reusability.</li>\n<li>Proficiency in modern front-end frameworks such as React, Angular, or Vue.js, with an understanding of responsive design, UX/UI principles, and state management (e.g., Redux).</li>\n<li>In-depth knowledge of SQL and NoSQL databases (e.g., PostgreSQL, MongoDB, Cassandra), as well as caching solutions (e.g., Redis, Memcached).</li>\n<li>Expertise in tools such as Apache Spark, Hadoop, Pandas, and Dask for large-scale data processing.</li>\n<li>Understanding of data warehouses and ETL tools (e.g., Snowflake, BigQuery, Redshift, Airflow) to manage large datasets.</li>\n<li>Familiarity with visualisation tools (e.g., Tableau, Power BI, Plotly) for building dashboards and conveying insights.</li>\n<li>Knowledge of deploying models with TensorFlow Serving, Flask, FastAPI, or cloud-native services (e.g., AWS SageMaker, Google AI Platform).</li>\n<li>Familiarity with MLOps tools and practices for versioning, monitoring, and scaling models (e.g., MLflow, Kubeflow, TFX).</li>\n<li>Knowledge or experience in CI/CD, IaC and Cloud Native toolchains.</li>\n<li>Understanding of security principles, including firewalls, VPC, IAM, and TLS/SSL for secure communication.</li>\n<li>Knowledge of API Gateway, service mesh (e.g., Istio), and NGINX for API security, rate limiting, and traffic management.</li>\n</ol>\n<p><strong>To Apply:</strong>\nSubmit your updated resume to careers@reizend.ai</p>",
        "tags": [
            "6+ Years",
            "AI/ML",
            "Data Science",
            "Cloud Platforms"
        ],
        "summary": "Seeking a Senior Technology Analyst with 6+ years of experience in Trivandrum. Responsibilities include designing technology systems, managing stakeholders, and providing architectural oversight for AI/ML and data science solutions."
    },
    {
        "job_title": "Quality Manager – BPO Valuation",
        "company": "Ecesis Care (P) Ltd",
        "url": "https://technopark.org/job-details/25558",
        "location": "Technopark",
        "closing_date": "29 Dec 2025",
        "job_description": "<h2>Quality Manager – BPO Valuation</h2>\n<p><strong>Company:</strong> ECESIS CARE (P) Ltd\n<strong>Location:</strong> Nagercoil/ Marthandam\n<strong>Employment Type:</strong> Full-time\n<strong>Closing Date:</strong> December 29, 2025\n<strong>Published Date:</strong> November 29, 2025</p>\n<p><strong>Contact Email:</strong> recruitment@ecesistech.com\n<strong>Website:</strong> https://www.ecesistech.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a Quality Manager – BPO / BPO Valuation to lead, manage, and enhance the quality framework within our operations. The ideal candidate will be responsible for driving process excellence, ensuring compliance with client and industry standards, and implementing continuous improvement initiatives across the BPO/BPO Valuation functions. This role requires a strong eye for detail, exceptional analytical skills, and the ability to collaborate with cross-functional teams to monitor performance, identify gaps, and improve overall service delivery.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Perform end-to-end quality audits of BPO reports, ensuring accuracy in comp selection, adjustments, photos, and commentary.</li>\n<li>Monitor KPIs including accuracy, SLA compliance, productivity, and error reduction; publish daily/weekly/monthly reports.</li>\n<li>Lead RCA and CAPA initiatives for recurring issues and strengthen process excellence.</li>\n<li>Develop and maintain SOPs, quality guidelines, and compliance documentation.</li>\n<li>Conduct training, coaching, and calibration sessions to improve analyst performance.</li>\n<li>Collaborate with operations and clients on quality expectations, updates, and escalations.</li>\n<li>Track market trends, workflow patterns, and identify continuous improvement opportunities.</li>\n</ul>\n<h3>Experience:</h3>\n<ul>\n<li>3–7 years of experience in Quality Assurance within KPO/BPO (BPO valuation experience mandatory).</li>\n<li>Experience with RCA, CAPA, Lean/Six Sigma frameworks preferred.</li>\n</ul>\n<h3>Educational Qualification:</h3>\n<ul>\n<li>Post Graduation in Business Management/ MBA</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong understanding of U.S. real estate valuation, comp analysis, adjustments, and audit workflows.</li>\n<li>Proficiency in Excel/Google Sheets, portals used for BPO processing, and tools like Zillow/MLS.</li>\n<li>Strong analytical ability, communication skills, and stakeholder management.</li>\n<li>Ability to work under tight deadlines with high attention to detail.</li>\n</ul>\n<h3>Characteristics:</h3>\n<ul>\n<li>Self-starter</li>\n<li>Quick learner</li>\n<li>Strong communicator in English</li>\n<li>Well organized</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates can send their updated resume to recruitment@ecesistech.com with the subject line: \"Application for Quality Manager- BPO Valuation @ Ecesis\".</p>",
        "tags": [
            "3-7 Years",
            "BPO",
            "Quality Assurance",
            "RCA"
        ],
        "summary": "Seeking a Quality Manager for BPO Valuation to lead quality frameworks and drive process excellence. Requires 3-7 years experience in BPO QA with strong analytical and collaboration skills."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25557",
        "location": "Technopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>UI/UX Designer</h2>\n<p><strong>Company:</strong> KENLAND IT SOLUTIONS (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala\n<strong>Address:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> https://www.kenland.in</p>\n<p><strong>Contact Email:</strong> recruiter@kenland.in</p>\n<p><strong>Job Published:</strong> 29, Nov 2025\n<strong>Closing Date:</strong> 31, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a creative UI/UX Designer with 2+ years of experience and strong skills in HTML, CSS, and design tools to join our team. The ideal candidate should be able to design visually appealing user interfaces and support digital creative requirements for web and mobile applications.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design and develop user-friendly interfaces for web and mobile applications.</li>\n<li>Create wireframes, mockups, and prototypes using Figma, Adobe XD, or similar tools.</li>\n<li>Convert designs into responsive layouts using HTML, CSS, and Bootstrap.</li>\n<li>Create digital creatives for websites, social platforms, and online campaigns.</li>\n<li>Work closely with developers and the marketing team to ensure design consistency and smooth implementation.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proficiency in HTML5, CSS3, and Bootstrap.</li>\n<li>Expertise in Figma, Adobe XD, Photoshop, or Illustrator.</li>\n<li>Experience in UI/UX design for web and mobile applications.</li>\n<li>Understanding of responsive design principles.</li>\n</ul>\n<h3>Qualification:</h3>\n<ul>\n<li>Bachelor’s degree in Design, Computer Science, or a related field.</li>\n</ul>\n<p><strong>Note:</strong> Immediate joiner preferred.</p>",
        "tags": [
            "2+ Years",
            "UI/UX Design",
            "Figma",
            "HTML/CSS"
        ],
        "summary": "Seeking a creative UI/UX Designer with 2+ years of experience in HTML, CSS, and design tools. Responsibilities include designing user interfaces and creating digital creatives for web and mobile applications."
    },
    {
        "job_title": "Technical Recruiter",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/25556",
        "location": "Technopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Spericorn Technology (P) Ltd</h2>\n<p><strong>Company:</strong> Spericorn Technology Private Limited\n<strong>Address:</strong> Amstor Building, Technopark Phase I, Trivandrum, 695581\n<strong>Website:</strong> http://www.spericorn.com</p>\n<h2>Technical Recruiter</h2>\n<p><strong>Closing Date:</strong> 15, Dec 2025\n<strong>Job Published:</strong> 29, Nov 2025\n<strong>Contact Email:</strong> careers@spericorn.com</p>\n<h3>Brief Description</h3>\n<p>We are looking for a Technical Recruiter who can help us find top talent and build a strong tech team. The ideal candidate should have hands-on experience in tech hiring, a good understanding of technologies, and excellent communication skills.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Source, screen, and shortlist candidates for technical positions</li>\n<li>Understand job requirements and match them with the right profiles</li>\n<li>Conduct initial HR interviews</li>\n<li>Coordinate with hiring managers and schedule interviews</li>\n<li>Maintain candidate database and follow up regularly</li>\n<li>Manage end-to-end recruitment cycle</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>1+ years of experience in technical recruitment</li>\n<li>Strong understanding of technologies (programming languages, frameworks, tools)</li>\n<li>Ability to evaluate technical resumes and communicate with tech candidates confidently</li>\n<li>Excellent English communication skills (spoken &amp; written)</li>\n<li>Good negotiation and coordination skills</li>\n<li>Knowledge of various job portals and sourcing techniques</li>\n<li>Experience hiring for multiple domains (Frontend, Backend, Full Stack, DevOps, Cloud, Data, QA, etc.)</li>\n</ul>\n<p><strong>Note:</strong> Kindly mention in the email subject \"Application for the post of Technical Recruiter”.</p>",
        "tags": [
            "1+ Years",
            "Technical Recruitment",
            "Sourcing",
            "HR Interview"
        ],
        "summary": "Seeking a Technical Recruiter to find top tech talent. Requires experience in tech hiring, understanding of technologies, and excellent communication skills for end-to-end recruitment."
    }
]