[
    {
        "job_title": "Graphic Designer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21783/312",
        "location": "Infopark",
        "closing_date": "27 Jan 2026",
        "job_description": "<h2>Job Description</h2>\n<p>We are seeking a <strong>Creative Designer</strong> who demonstrates strong visual thinking, originality, and full ownership of their work. The ideal candidate will stay connected to marketing and design trends, think beyond briefs, and deliver high-quality visuals that strengthen brand identity and audience engagement. You will collaborate with Marketing, Creative, and Development teams to produce impactful digital and offline design assets.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design engaging and high-quality creatives for branding, marketing, and promotional use</li>\n<li>Create marketing assets (brochures, flyers, posters, social media creatives, website visuals, presentations, email campaigns)</li>\n<li>Conceptualize ideas and translate them into clear visual communication</li>\n<li>Own design deliverables from concept to final output</li>\n<li>Ensure visual consistency across brand touchpoints via brand guidelines</li>\n<li>Manage multiple projects simultaneously while meeting timelines</li>\n<li>Collaborate with Marketing teams, Creative Leads, and Project Managers on updates and revisions</li>\n<li>Stay updated on design, branding, marketing trends, and creative tools</li>\n<li>Use modern design tools to support ideation while maintaining originality and brand alignment</li>\n<li>Maintain organized design files, versions, and documentation</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Diploma or Bachelor’s Degree in Graphic Design, Visual Arts, or related field</li>\n<li><strong>2 to 4 years</strong> of professional experience in a creative/design role</li>\n<li>Strong proficiency in Adobe Photoshop, Illustrator, InDesign, Premiere Pro, After Effects</li>\n<li>Working knowledge of MS Office (PowerPoint, Word)</li>\n<li>Basic HTML/CSS understanding</li>\n<li>Strong typography skills and layout/design principles</li>\n<li>High attention to detail and visual judgment</li>\n<li>Excellent verbal/written communication</li>\n</ul>\n<h3>Creativity, Ownership, and Mindset</h3>\n<ul>\n<li>Demonstrate quick creative thinking</li>\n<li>Take ownership and accountability for work</li>\n<li>Self-discipline in reviewing submissions</li>\n<li>Accept feedback and iterate efficiently</li>\n<li>Confidence in presenting/explaining design concepts</li>\n<li>Think beyond briefs and suggest innovative ideas</li>\n</ul>\n<h3>Portfolio Requirement</h3>\n<ul>\n<li>Mandatory strong portfolio showcasing branding, marketing creatives, and originality</li>\n<li>Ability to explain design intent, approach, and execution</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li><strong>2 to 4 years</strong> of relevant industry experience</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Growth-driven environment with opportunities to lead, innovate, and upskill</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at careers@2basetechnologies.com</p>",
        "tags": [
            "2-4 Years",
            "Adobe Creative Suite",
            "HTML/CSS",
            "Branding/Marketing"
        ],
        "summary": "Creative Graphic Designer with 2-4 years experience in Adobe tools, creating marketing assets and collaborating with teams to enhance brand identity."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21784/312",
        "location": "Infopark",
        "closing_date": "27 Jan 2026",
        "job_description": "<h2>Senior Business Analyst</h2>\n<p>At 2Base, we are rebuilding the Business Analyst function into a world-class, product-minded, clarity-driven team. This role is <strong>not</strong> a documentation, screen-updating, or support role. It is a <strong>core Business Analyst position</strong> responsible for functional modeling, system reasoning, requirement clarity, and building the foundation for correct development.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.</li>\n<li>Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.</li>\n<li>Convert ambiguous client inputs into structured, logical, and actionable functional understanding.</li>\n<li>Break large features into modules, workflows, components, and clear dependencies.</li>\n<li>Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.</li>\n<li>Translate business processes into functional logic that development teams can execute.</li>\n<li>Decompose requirements into use-case flows, system behaviors, edge cases, alternate paths, validation rules, and dependencies.</li>\n<li>Prepare high-quality documentation (BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API specs, acceptance criteria).</li>\n<li>Collaborate with developers, architects, QA, and product owners to validate feasibility and align understanding.</li>\n<li>Ensure QA teams derive test cases effectively from functional logic and acceptance criteria.</li>\n<li>Communicate confidently with clients, handle requirement discussions, and clarify misunderstandings immediately.</li>\n<li>Push back politely on unclear or changing requirements and document final decisions.</li>\n<li>Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover.</li>\n<li>Own the entire requirement lifecycle from discovery to development readiness with high accountability.</li>\n<li>Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>Minimum 4+ years</strong> of core Business Analyst experience with strong analytical and system-level thinking.</li>\n<li>Ability to break down complex requirements into clear components, workflows, and functional logic.</li>\n<li>Excellent verbal and written communication with confidence in client interactions.</li>\n<li>Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria.</li>\n<li>Ability to challenge assumptions, ask the right questions, and ensure zero ambiguity.</li>\n<li>Strong collaboration with development, QA, architects, and cross-functional teams.</li>\n<li>Understanding of API behaviors, integrations, data flows, and multi-module systems.</li>\n<li>Ability to run requirement discussions, workshops, and lead discovery sessions independently.</li>\n<li>Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.</li>\n<li>Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.</li>\n<li>Not suitable for UI-only thinkers, passive communicators, template-based writers, or AI-dependent individuals.</li>\n<li>Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.</li>\n<li>Must align with 2Base’s structured thinking, clarity-driven culture, and transformation of the BA function.</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, Business, or related field.</li>\n<li>4 to 8 years of experience as a Business Analyst or Product Analyst.</li>\n<li>Experience in SaaS or scalable product environments.</li>\n<li>Exposure to AI/Automation, integrations, or multi-module systems.</li>\n<li>Ability to run independent client workshops.</li>\n<li>Must have independently handled requirement ownership for at least one full project lifecycle.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at careers@2basetechnologies.com.</p>",
        "tags": [
            "4+ Years",
            "SaaS",
            "API",
            "BRD/FRD/SRS"
        ],
        "summary": "A Senior Business Analyst role focused on functional modeling, system reasoning, and requirement clarity to drive aligned development. Requires 4+ years of experience and expertise in SaaS, API, and structured documentation."
    },
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21785/312",
        "location": "Infopark",
        "closing_date": "27 Jan 2026",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p><strong>Company:</strong> 2Base Technologies</p>\n<p>We are seeking a high-performing, self-driven <strong>Senior Business Development Executive</strong> to join our team. In this role, you will drive revenue by generating leads, building client relationships, and selling IT services and digital solutions. This individual contributor role requires full ownership of the sales process from prospecting to closure. If you thrive in a tech-driven environment and are passionate about consultative selling and business growth, we want to hear from you!</p>\n<p><strong>Responsibilities</strong>\n- Identify and generate qualified leads via outbound channels, referrals, and market research.\n- Drive new business opportunities for web, mobile, and enterprise software development services.\n- Manage the full sales cycle: lead qualification, client communication, requirement analysis, proposal preparation, pricing, negotiation, and closure.\n- Propose tailored IT and digital transformation solutions aligned with client objectives.\n- Build relationships with Founders, CXOs, and Product Owners.\n- Collaborate with delivery, design, and marketing teams to create compelling proposals.\n- Maintain CRM records and provide sales forecasts/reports.\n- Represent the company at networking events and client meetings.\n- Meet/exceed monthly/quarterly revenue targets.</p>\n<p><strong>Requirements</strong>\n- Bachelor’s degree or equivalent in education/training/experience.\n- <strong>2–5 years</strong> of B2B sales experience in IT services/digital solutions.\n- Proven ability to manage sales pipelines and close deals independently.\n- Strong knowledge of software development (web/mobile apps, SaaS, enterprise solutions).\n- Experience with international clients preferred.\n- Proficiency in CRM systems (Zoho, HubSpot, Salesforce) and outbound tools (LinkedIn Sales Navigator).\n- Excellent communication, presentation, and negotiation skills.\n- Ability to work autonomously and own sales targets.\n- Strategic thinking to address client pain points and position solutions.</p>\n<p><strong>Education &amp; Certifications</strong>\n- Bachelor’s/BSc IT/CS/BCA/B-Tech/CS/EC/MBA/Diploma in CS/IT.\n- Certifications in sales, digital marketing, or business consulting are a plus.</p>\n<p><strong>Apply:</strong> Send your resume to <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "B2B Sales",
            "IT Services/Digital Solutions"
        ],
        "summary": "A Senior Business Development Executive is needed to drive IT services sales, manage full sales cycles, and meet revenue targets. Requires 2–5 years of B2B sales experience and CRM proficiency."
    },
    {
        "job_title": "Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21786/312",
        "location": "Infopark",
        "closing_date": "27 Jan 2026",
        "job_description": "<h2>Business Analyst</h2>\n<p>The Business Analyst plays a key role in ensuring requirements are clearly understood, accurately documented, and traceable throughout the software development lifecycle. This role focuses on translating business and functional inputs into structured, standardized documentation that supports effective development, testing, and delivery. Working closely with business analysts, design teams, and technical stakeholders, the role ensures consistency, clarity, and alignment across all requirement artifacts.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Create Software Requirement Specifications (SRS) based on inputs from Core Business Analysts, stakeholder discussions, and requirement walkthroughs</li>\n<li>Prepare Business Requirement Documents (BRD) using approved templates while ensuring business intent and system behavior are clearly documented</li>\n<li>Participate in requirement discussions to understand business objectives, functional flows, dependencies, and assumptions before documentation</li>\n<li>Analyze requirements to identify gaps, ambiguities, and inconsistencies, and work with Core BAs to resolve them</li>\n<li>Document functional flows, business rules, and acceptance criteria where applicable to support development and QA teams</li>\n<li>Document wireframes, UI flows, validations, and UI specifications in collaboration with design and product teams</li>\n<li>Maintain change logs, version history, and document updates throughout the project lifecycle</li>\n<li>Create and manage traceability matrices linking business, functional, and technical requirements</li>\n<li>Maintain cross-references across BRD, SRS, UI, API, and related documentation</li>\n<li>Ensure documentation consistency, completeness, and alignment with approved scope and delivery timelines</li>\n<li>Ensure accurate and timely PMS updates with structured documentation details</li>\n<li>Support development, QA, UAT, and audit processes through clear, traceable, and up-to-date documentation</li>\n<li>Assist in requirement reviews, walkthroughs, and validation sessions with internal and client stakeholders</li>\n</ul>\n<h3>Requirements</h3>\n<h4>Required Skills and Experience</h4>\n<ul>\n<li>1 to 4 years of experience in Business Analysis documentation or related roles</li>\n<li>Strong experience in BRD and SRS creation</li>\n<li>Hands-on experience with documentation templates, standards, and version control</li>\n<li>Ability to document UI wireframes and functional flows clearly</li>\n<li>Working knowledge of APIs and system integrations for documentation purposes</li>\n<li>Experience with project management systems and documentation tools</li>\n<li>Strong attention to detail and ability to manage multiple documents in parallel</li>\n<li>Excellent written communication and stakeholder coordination skills</li>\n</ul>\n<h4>Minimum Qualifications</h4>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field</li>\n<li>1 to 4 years of experience as a Business Analyst or Product Analyst</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "1-4 Years",
            "BRD/SRS Documentation",
            "API/System Integration",
            "Project Management Tools"
        ],
        "summary": "Translates business requirements into structured documentation, ensuring alignment across teams. Maintains traceability and supports development/testing through clear, up-to-date artifacts."
    },
    {
        "job_title": "PHP MySQL Internship",
        "company": "SaNDS Lab",
        "url": "https://infopark.in/company-jobs/details/21790/39",
        "location": "Infopark",
        "closing_date": "30 Jan 2026",
        "job_description": "<p><strong>PHP MySQL Internship</strong></p>\n<p>We are seeking a motivated and enthusiastic intern to join our team as a <strong>PHP trainee</strong>. In this role, you will work closely with our development team to assist in various web development projects, utilizing your skills in PHP programming languages. This training offers a hands-on opportunity to gain valuable experience in real-world projects and enhance your skills in web development.</p>\n<p><strong>Responsibilities:</strong>\n- Design, develop, and maintain web-based applications using PHP framework\n- Collaborate with the team to identify, troubleshoot, and resolve software issues\n- Write clean, well-designed, and efficient code following best practices\n- Participate in all phases of software development life cycle\n- Develop and maintain database schemas, queries, and scripts\n- Collaborate with the team to design, develop, and integrate APIs\n- Work with cross-functional teams to develop software solutions that meet client requirements</p>\n<p><strong>Training &amp; Selection:</strong>\n- The first two months will be provided as training at no cost\n- Candidates will be selected based on their performance\n- The number of positions available is three to four</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@sandslab.com</strong>.</p>",
        "tags": [
            "0-1 Years",
            "PHP",
            "MySQL",
            "APIs"
        ],
        "summary": "Seeking a PHP trainee intern for hands-on web development and database projects. Selected after two months of training based on performance."
    },
    {
        "job_title": "Academic Associate - Operations ( Freshers)",
        "company": "TutorComp Infotech (I) Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21795/44",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Academic Associate - Operations (Freshers)</h2>\n<p><strong>Dear Applicant,</strong></p>\n<p>We are seeking a <strong>Dynamic &amp; Enthusiastic</strong> individual to join our team as an <strong>Academic Associate</strong>.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Demonstrate <strong>strong problem-solving</strong> and <strong>client interaction skills</strong> in a result-oriented team environment.</li>\n<li>Maintain client relationships by providing <strong>support, information, and guidance</strong>, while researching and recommending new opportunities.</li>\n<li><strong>Identify business opportunities</strong> by analyzing prospects and sales options.</li>\n<li>Prepare reports by <strong>collecting, analyzing, and summarizing information</strong>.</li>\n<li>Ensure <strong>quality service</strong> by establishing and enforcing organizational standards.</li>\n<li>Contribute to team efforts by accomplishing related tasks as needed.</li>\n<li>Communicate with clients/employers regarding <strong>project, event, or campaign expectations and goals</strong>.</li>\n<li>Answer telephones and respond to client/participant inquiries.</li>\n<li>Create, compile, and export databases for event information.</li>\n<li>Address <strong>customer complaints or issues</strong>.</li>\n<li>Support other teams with administrative tasks (e.g., call redirection, correspondence dissemination, meeting scheduling).</li>\n<li>Actively contribute to the <strong>collective well-being</strong> of the organization and team to deliver quality educational services globally.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li><strong>Graduate/Postgraduate</strong> degree.</li>\n<li><strong>0–6 months</strong> of experience in customer handling.</li>\n<li><strong>Strong written and oral communication skills</strong> in English.</li>\n<li><strong>Organized</strong> with the ability to prioritize and multitask.</li>\n<li><strong>Reliable</strong>, patient, and professional.</li>\n<li><strong>Willing to work in shifts</strong>.</li>\n<li><strong>Job Location</strong>: Infopark Cochin Phase-I</li>\n</ul>\n<h3>About Us:</h3>\n<p>TutorComp is a <strong>global leader in online tutoring</strong>, connecting students with expert tutors worldwide. Our mission is to make learning accessible by leveraging technology and global talent. We operate in markets across the <strong>United States, United Kingdom, Hong Kong, Singapore, Australia, France, India, UAE, Kuwait, Bahrain, Qatar, Saudi Arabia, and Malaysia</strong>.</p>\n<p><strong>Interested candidates</strong> can apply by sending their resume to <strong>hr@tutorcomp.com</strong>.</p>",
        "tags": [
            "0-6 Months",
            "Communication Skills",
            "Client Interaction",
            "Organizational Skills"
        ],
        "summary": "Support academic operations by managing client relations, administrative tasks, and data analysis. Requires fresh graduates with basic customer handling experience."
    },
    {
        "job_title": "Full Stack Developer(2 -3 Years Experience)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/21796/109",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Full Stack Developer (2 - 3 Years Experience)</h2>\n<p><strong>Company Name</strong>: NewAgeSys IT, (a division of NewAgeSys)\n<strong>Location</strong>: Carnival Infopark, Phase 2, Kakkanad, Ernakulam\n<strong>Job Type</strong>: Onsite\n<strong>Shift Timing</strong>: 11 AM - 8 PM</p>\n<h3>About the Company</h3>\n<p>NewAgeSys IT, a division of NewAgeSys, Inc. (established in 1994), specializes in mobile app development and consulting. Based in New Jersey, the company serves clients globally, focusing on creating cost-effective solutions through long-term partnerships and leveraging cutting-edge technology.</p>\n<h3>About the Job</h3>\n<p>As a Full Stack Developer at NewAgeSys, you will build end-to-end platforms using diverse technologies. Your responsibilities include:\n- Developing front-end and back-end applications using <strong>Node.js</strong>, <strong>React.js</strong>, and <strong>Angular</strong>.\n- Designing and maintaining databases (<strong>MySQL</strong>, <strong>PostgreSQL</strong>, <strong>MongoDB</strong>).\n- Optimizing web design for mobile and ensuring cross-platform responsiveness.\n- Collaborating with UI/UX designers and testing applications for performance.\n- Implementing CI/CD pipelines and working with cloud platforms (<strong>AWS</strong>, <strong>GCP</strong>, <strong>Azure</strong>).\n- Staying updated on emerging technologies and mentoring team members.</p>\n<h3>Requirements</h3>\n<ul>\n<li><strong>2+ years</strong> of software development experience.</li>\n<li>Proficiency in <strong>Node.js</strong> (Next.js or similar frameworks).</li>\n<li>Hands-on experience with <strong>React.js</strong> or <strong>Angular</strong>.</li>\n<li>Knowledge of <strong>TypeScript</strong>, <strong>REST/SOAP APIs</strong>, and <strong>microservices</strong>.</li>\n<li>Familiarity with <strong>Agile/Scrum</strong> methodologies and <strong>GitHub</strong>.</li>\n<li>Strong problem-solving skills and a proactive, self-driven attitude.</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Excellent communication and collaboration abilities.</li>\n<li>Passion for delivering high-quality software.</li>\n<li>Organized, detail-oriented, and adaptable to challenges.</li>\n</ul>\n<p><strong>Contact</strong>: Email your resume to <strong>career@newagesysindia.com</strong>.</p>",
        "tags": [
            "2-3 Years",
            "Node.js",
            "React.js",
            "AWS"
        ],
        "summary": "NewAgeSys IT seeks a Full Stack Developer with 2-3 years of experience in Node.js, React/Angular, and cloud platforms. The role involves building end-to-end solutions, collaborating with teams, and ensuring optimal user experience."
    },
    {
        "job_title": "Technical Project Manager",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21797/41",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Technical Project Manager</strong></p>\n<p>We are seeking a <strong>Technical Project Manager</strong> to oversee the planning, execution, and delivery of technical projects. This role combines project management skills with technical understanding to ensure timely, high-quality outcomes.</p>\n<p><strong>Key Responsibilities:</strong>\n- Plan, organize, and manage technical projects from initiation to delivery\n- Coordinate with developers, QA, product, and other teams to ensure smooth execution\n- Track project progress, risks, and milestones, and report to stakeholders\n- Review technical designs and provide input to ensure feasibility and quality\n- Facilitate communication between technical and non-technical teams\n- Ensure projects are delivered on time, within scope, and on budget\n- Maintain project documentation, timelines, and status reports</p>\n<p><strong>Requirements:</strong>\n- Bachelor’s degree in Computer Science, Engineering, or related field\n- 3 - 5+ years of experience in technical project management or technical delivery\n- Strong technical background, preferably with experience in <strong>.NET</strong>, <strong>Angular</strong>, or similar technologies\n- Exposure to <strong>AI/ML</strong> technologies or experience managing AI-driven projects is an added advantage\n- Proven experience in project management or technical delivery\n- Familiarity with <strong>Agile/Scrum</strong> methodologies and project management tools\n- Excellent communication and stakeholder management skills\n- Strong problem-solving and organizational skills</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume at <strong>career@lucidplus.com</strong>.</p>",
        "tags": [
            "3-5+ Years",
            ".NET",
            "Angular",
            "Agile/Scrum"
        ],
        "summary": "Lead technical projects from planning to delivery, coordinating cross-functional teams and ensuring quality outcomes using Agile methodologies."
    },
    {
        "job_title": "Angular Developer",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21798/41",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>Angular Developer</strong></p>\n<p>We are seeking an experienced Angular Developer to join our team. The ideal candidate will develop high-quality, responsive web applications and collaborate with cross-functional teams to deliver solutions within project timelines.</p>\n<p><strong>Key Responsibilities:</strong>\n- Develop and maintain dynamic, responsive web applications using Angular.\n- Write clean, modular, and reusable code following best practices.\n- Integrate RESTful APIs and manage application data with RxJS / services.\n- Participate in code reviews and maintain code quality standards.\n- Collaborate with designers, backend developers, and QA teams to deliver features on time.\n- Troubleshoot, debug, and optimize applications for performance.</p>\n<p><strong>Requirements:</strong>\n- <strong>2 - 4 years</strong> of professional experience in Angular development (Angular 10+ preferred).\n- Strong proficiency in <strong>TypeScript</strong>, <strong>HTML5</strong>, <strong>CSS3</strong>, and <strong>SCSS</strong>.\n- Experience with <strong>RxJS</strong>, state management (<strong>NgRx preferred</strong>), and component-based architecture.\n- Hands-on experience with RESTful APIs, JSON, and asynchronous programming.\n- Familiarity with <strong>Git</strong> and version control workflows.\n- Understanding of responsive design, cross-browser compatibility, and performance optimization.\n- Familiarity with <strong>.NET technologies</strong> will be an added advantage.\n- Good communication skills and ability to work in a collaborative environment.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>career@lucidplus.com</strong>.</p>",
        "tags": [
            "2-4 Years",
            "Angular",
            "TypeScript",
            "RxJS"
        ],
        "summary": "Angular Developer with 2-4 years of experience to build responsive web apps using Angular, TypeScript, and RxJS, collaborating with cross-functional teams for high-quality solutions."
    },
    {
        "job_title": "Flutter Trainee",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21799/41",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Flutter Trainee</h2>\n<p>We are seeking a <strong>Flutter Development Trainee</strong> who is passionate about mobile app development and eager to build high-quality, cross-platform applications using Flutter.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Contribute to the development and enhancement of Flutter-based mobile applications</li>\n<li>Collaborate with the development team to understand requirements</li>\n<li>Write clean, maintainable, and well-structured code</li>\n<li>Participate in debugging, testing, and improving application performance</li>\n<li>Integrate third-party services and APIs under guidance</li>\n<li>Follow best practices for UI/UX implementation across platforms</li>\n<li>Continuously learn new tools, technologies, and Flutter best practices</li>\n</ul>\n<h3>Skills &amp; Requirements:</h3>\n<ul>\n<li>Basic understanding of Flutter &amp; Dart</li>\n<li>Familiarity with state management concepts</li>\n<li>Exposure to Riverpod or GetX</li>\n<li>Understanding of Flutter widget lifecycle</li>\n<li>Basic knowledge of Flutter Channels (MethodChannel) for native communication</li>\n<li>Understanding of REST APIs &amp; JSON</li>\n<li>Knowledge of Git/version control tools</li>\n<li>Basic UI development using Material and Cupertino widgets</li>\n<li>Knowledge of Firebase basics (Authentication, Firestore)</li>\n<li>Awareness of clean code practices and proper folder structure</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates can apply by sharing their resume along with a work portfolio, GitHub profile, or links to any Flutter projects/apps they have worked on. Submit your application to <strong>career@lucidplus.com</strong>.</p>",
        "tags": [
            "0-1 Years",
            "Flutter",
            "Dart",
            "Firebase"
        ],
        "summary": "Seeking a Flutter Development Trainee to build cross-platform apps with guidance. Requires basic Flutter/Dart knowledge and eagerness to learn."
    },
    {
        "job_title": "Flutter Developer",
        "company": "LucidPlus IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21800/41",
        "location": "Infopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<h2>Flutter Developer</h2>\n<p>We are seeking an <strong>Experienced Flutter Developer</strong> who can design, develop, and maintain scalable mobile applications with clean architecture and strong performance.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and maintain cross-platform mobile applications using Flutter</li>\n<li>Collaborate with designers, backend developers, and product teams to implement requirements</li>\n<li>Write clean, reusable, and maintainable code</li>\n<li>Implement and manage application state effectively</li>\n<li>Integrate APIs, third-party services, and Firebase features</li>\n<li>Participate in code reviews and follow version control best practices</li>\n<li>Debug issues and assist in performance improvements</li>\n<li>Continuously learn and apply Flutter best practices</li>\n</ul>\n<h3>Skills &amp; Requirements:</h3>\n<ul>\n<li><strong>2+ years of experience</strong> with Flutter &amp; Dart</li>\n<li>Strong understanding of state management concepts with experience in Riverpod (preferred), Provider, and GetX (state, navigation, and dependency injection)</li>\n<li>Experience working with REST APIs, WebSockets, and JSON</li>\n<li>Hands-on experience with Firebase (Authentication, Firestore, Push Notifications)</li>\n<li>Understanding of Flutter widget lifecycle, performance considerations, and debugging</li>\n<li>Basic to intermediate experience with Flutter Channels (MethodChannel / EventChannel)</li>\n<li>Exposure to native integration with Android (Kotlin/Java) and iOS (Swift/Objective-C)</li>\n<li>Experience following Clean Architecture, MVVM, or feature-based architecture</li>\n<li>Understanding of dependency injection principles</li>\n<li>Ability to write reusable, testable, and maintainable code</li>\n<li>Familiarity with unit testing and widget testing</li>\n<li>Proficient with Git, pull requests, and collaborative development workflows</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>career@lucidplus.com</strong>.</p>",
        "tags": [
            "2+ Years",
            "Flutter & Dart",
            "Riverpod/Provider/GetX",
            "Firebase"
        ],
        "summary": "Experienced Flutter Developer needed to design and maintain cross-platform apps with clean architecture. Requires 2+ years in Flutter, state management, and Firebase integration."
    },
    {
        "job_title": "Project Coordinator",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21787/95",
        "location": "Infopark",
        "closing_date": "06 Feb 2026",
        "job_description": "<h2>Project Coordinator</h2>\n<h3>Responsibilities</h3>\n<ul>\n<li><strong>Project Planning &amp; Execution</strong></li>\n<li>Assist HOD/Project Manager in planning &amp; scheduling activities.</li>\n<li>Coordinate with teams, vendors, and clients for smooth execution.</li>\n<li>Support resource allocation (materials &amp; manpower).</li>\n<li>Identify risks/delays and escalate for resolution.</li>\n<li>Schedule and coordinate daily project meetings and circulate minutes.</li>\n<li>\n<p>Monitor and track site updates received intermittently through WhatsApp or other channels.</p>\n</li>\n<li>\n<p><strong>Procurement &amp; Material Management</strong></p>\n</li>\n<li>Coordinate with Procurement Dept. for pricing &amp; vendor selection.</li>\n<li>Ensure minimum 3 price comparisons for purchases/subcontracting.</li>\n<li>Obtain technical clarifications from Site Engineers/PM/HOD.</li>\n<li>Manage &amp; track purchase orders from Infra Head.</li>\n<li>\n<p>Coordinate deliveries with site team and ensure signed delivery notes.</p>\n</li>\n<li>\n<p><strong>Financial Coordination</strong></p>\n</li>\n<li>Assist in preparing &amp; maintaining project budgets.</li>\n<li>Track project expenses and align with budget.</li>\n<li>Collect, verify &amp; consolidate vendor quotations/invoices.</li>\n<li>Coordinate with Finance for payments &amp; reimbursements.</li>\n<li>Maintain records (POs, bills, DCs, contracts).</li>\n<li>Prepare financial comparison sheets for approvals.</li>\n<li>\n<p>Monitor milestones &amp; update project cost reports.</p>\n</li>\n<li>\n<p><strong>Reporting &amp; Documentation</strong></p>\n</li>\n<li>Prepare &amp; maintain reports, MOMs, and logs.</li>\n<li>Submit project-related documents to clients.</li>\n<li>Generate periodic progress &amp; financial reports.</li>\n<li>\n<p>Ensure accurate documentation &amp; audit compliance.</p>\n</li>\n<li>\n<p><strong>Stakeholder Coordination &amp; Compliance</strong></p>\n</li>\n<li>Liaise between project teams, vendors, procurement &amp; finance.</li>\n<li>Escalate stock/invoice discrepancies.</li>\n<li>Facilitate approvals for budget revisions &amp; variations.</li>\n<li>\n<p>Ensure compliance with policies, quality &amp; safety standards.</p>\n</li>\n<li>\n<p><strong>Attendance &amp; Workforce Management</strong></p>\n</li>\n<li>Maintain and monitor staff attendance records.</li>\n<li>Coordinate with HR/Finance for attendance submission and payroll processing.</li>\n<li>Track workforce deployment at project sites and report discrepancies.</li>\n<li>Ensure timely reporting of absences, late arrivals, or shift changes.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li><strong>Experience</strong>: 2-3 years</li>\n</ul>\n<p>Contact: Share your resume at <strong>career@aabasoft.com</strong>.</p>",
        "tags": [
            "2-3 Years",
            "Project Management",
            "Procurement",
            "Financial Coordination"
        ],
        "summary": "Coordinates project execution, procurement, and financials. Requires 2-3 years of experience in project coordination."
    },
    {
        "job_title": "Program Manager – IT Backend Schemes",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21788/95",
        "location": "Infopark",
        "closing_date": "06 Feb 2026",
        "job_description": "<h2>Program Manager – IT Backend Schemes</h2>\n<p><strong>Role Overview</strong>\nProgram Manager will be responsible for end-to-end management of various OEM, Distributors &amp; Partners sales schemes. This includes planning, execution, monitoring, and optimization of multiple schemes from OEM, Distributors &amp; Partners.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Manage OEM, distributor, and partner sales schemes, rebates, and incentive programs</li>\n<li>Coordinate deal registration with OEMs and distributors</li>\n<li>Track scheme eligibility, validity, and pay-out status</li>\n<li>Support front-end sales teams with scheme benefits</li>\n<li>Maintain scheme documentation and approvals</li>\n<li>Prepare weekly/monthly scheme performance and pay-out reports</li>\n<li>Coordinate with finance for claims, credit notes, and reconciliations</li>\n<li>Ensure compliance with OEM program guidelines</li>\n<li>Visit various locations and assign clear targets to the Program Manager</li>\n<li>Manage vendors, SIs, and consultants for implementing schemes</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, IT, or equivalent</li>\n<li>Master’s degree / MBA (IT, Systems, Operations) – preferred</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li>Minimum 3-5 years of overall IT experience</li>\n<li>Minimum 1 year in program management with cloud-based organizations</li>\n</ul>\n<h3>Key Competencies</h3>\n<ul>\n<li>Strong leadership &amp; stakeholder management</li>\n<li>Excellent communication and documentation skills</li>\n<li>Strategic thinking with execution focus</li>\n<li>Risk management &amp; problem-solving ability</li>\n<li>Ability to work in highly regulated, multi-stakeholder environments</li>\n</ul>\n<p><strong>Contact</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume at <strong>career@aabasoft.com</strong>.</p>",
        "tags": [
            "3-5 Years",
            "Program Management",
            "Cloud-Based Systems",
            "Stakeholder Management"
        ],
        "summary": "Program Manager oversees end-to-end management of sales schemes, ensuring compliance and coordination with stakeholders. Requires 3-5 years IT experience with program management expertise."
    },
    {
        "job_title": "Accounts Intern",
        "company": "Mantra IT Solutions",
        "url": "https://infopark.in/company-jobs/details/21789/383",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Accounts Intern</h2>\n<p><strong>Mantra IT Solutions</strong> is seeking a motivated and detail-oriented <strong>Accounts Intern</strong> to support our finance and accounts team. The intern will gain hands-on experience in accounting operations, financial documentation, and compliance processes.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Assist in maintaining accounting records and financial data</li>\n<li>Support day-to-day bookkeeping activities</li>\n<li>Help with invoice processing, billing, and expense tracking</li>\n<li>Assist in preparing vouchers, bills, and basic financial reports</li>\n<li>Support GST, TDS, and other statutory compliance documentation</li>\n<li>Coordinate with internal teams for financial data and clarifications</li>\n<li>Maintain proper documentation and filing of financial records</li>\n</ul>\n<h3>Skills &amp; Requirements</h3>\n<ul>\n<li>Basic knowledge of accounting principles</li>\n<li>Familiarity with <strong>MS Excel</strong> and <strong>accounting software</strong> is an advantage</li>\n<li>Strong attention to detail and accuracy</li>\n<li>Good analytical and organizational skills</li>\n<li>Ability to meet deadlines and work in a team</li>\n<li><strong>B.Com / M.Com / MBA (Finance)</strong> students or recent graduates preferred</li>\n</ul>\n<h3>Internship Benefits</h3>\n<ul>\n<li>Practical exposure to real-time accounting processes</li>\n<li>Mentorship from experienced finance professionals at Mantra IT Solutions</li>\n<li>Certificate of Internship</li>\n<li>Opportunity for full-time employment based on performance</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates are requested to send their updated resume and, if available, a portfolio to <strong>hr@mantraitsolutions.in</strong></p>\n<p>Alternatively, apply directly through the <strong>Careers</strong> section on our website: 🌐 <a href=\"https://mantraitsolutions.in\">https://mantraitsolutions.in</a></p>",
        "tags": [
            "0-1 Year",
            "Accounting Software",
            "MS Excel",
            "GST/TDS Compliance"
        ],
        "summary": "Mantra IT Solutions seeks an Accounts Intern for hands-on accounting, compliance, and reporting. Internship offers mentorship and potential full-time role."
    },
    {
        "job_title": "HR Executive   (Recruitment & Operations)",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/21794/4",
        "location": "Infopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>HR Executive (Recruitment &amp; Operations)</h2>\n<p><strong>Location:</strong> Kochi\n<strong>Work Mode:</strong> Work from Office (Full-time)\n<strong>Experience:</strong> 1–2 Years\n<strong>Department:</strong> Human Resources</p>\n<h3>Role Overview</h3>\n<p>We are seeking an HR Executive to manage end-to-end recruitment and support daily HR operations. The ideal candidate should be proactive, organized, and comfortable working from the office while coordinating with internal teams.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Recruitment (Primary Responsibility)</strong>\n- Handle end-to-end recruitment for junior to mid-level positions\n- Understand job requirements and coordinate with hiring managers\n- Source candidates via job portals, LinkedIn, referrals, and databases\n- Screen resumes and conduct initial HR interviews\n- Schedule interviews and coordinate with candidates and interviewers\n- Follow up with candidates to ensure a smooth hiring experience\n- Prepare and release offer letters and assist in onboarding</p>\n<p><strong>HR Operations</strong>\n- Maintain employee records, files, and HR documentation\n- Support joining formalities, induction, and exit processes\n- Assist in attendance tracking and basic payroll coordination\n- Ensure HR policies and processes are followed\n- Support engagement activities and internal HR communications\n- Handle basic employee queries related to HR processes</p>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>1–2 years of experience in HR recruitment and operations</li>\n<li>Strong verbal and written communication skills</li>\n<li>Ability to work independently and manage multiple tasks</li>\n<li>Proficiency in MS Excel, Word, and email communication</li>\n<li>Excellent coordination and follow-up skills</li>\n</ul>\n<p><strong>Contact:</strong> Share your updated resume at jamshiya@arttechgroup.com</p>",
        "tags": [
            "1–2 Years",
            "Recruitment",
            "HR Operations",
            "MS Excel"
        ],
        "summary": "An HR Executive is needed to manage end-to-end recruitment and support HR operations, including candidate sourcing, onboarding, and policy adherence. Requires 1–2 years of HR experience with strong communication and organizational skills."
    },
    {
        "job_title": "Graphic Design Intern",
        "company": "Dynamed Healthcare Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21793/132",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Graphic Design Intern</h2>\n<p><strong>Internship Duration:</strong> 3 Months\n<strong>Internship Type:</strong> Unpaid Internship</p>\n<h3>Job Description</h3>\n<p>We are seeking a creative and enthusiastic <strong>Graphic Design Intern</strong> to support our design and marketing team. This internship is ideal for students or fresh graduates aiming to gain hands-on experience in real-time projects and build a strong design portfolio.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Assist in creating visual content for social media, websites, and marketing campaigns</li>\n<li>Design creatives such as posters, banners, brochures, and presentations</li>\n<li>Support branding and promotional design requirements</li>\n<li>Collaborate with the marketing/content team to understand design briefs</li>\n<li>Make revisions based on feedback and meet deadlines</li>\n<li>Maintain consistency with brand guidelines</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Basic knowledge of graphic design tools (Adobe Photoshop, Illustrator, Canva, etc.)</li>\n<li>Creative mindset with an eye for detail</li>\n<li>Willingness to learn and accept feedback positively</li>\n<li>Ability to manage multiple tasks and meet timelines</li>\n<li>A portfolio (academic or personal work) is an added advantage</li>\n</ul>\n<h3>What You’ll Gain</h3>\n<ul>\n<li>Hands-on experience with real projects</li>\n<li>Exposure to professional work culture</li>\n<li>Portfolio-building opportunities</li>\n<li>Certificate of Internship upon successful completion</li>\n<li>Mentorship and learning support from experienced designers</li>\n</ul>\n<h3>Contact</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>anoop.rajan@dynamedhealth.com</strong>.</p>",
        "tags": [
            "0-1 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Canva"
        ],
        "summary": "Graphic Design Intern supports marketing team with creative visuals, gains hands-on experience, and builds a portfolio through real projects."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Cabot Technology Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21801/64",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p>We are hiring a Business Development Executive (BDE) who will be employed by <strong>Cabot Technology Solutions</strong> and work closely with <strong>Fine Art Design Agency</strong>, Cabot’s creative division, to drive growth for design-led digital modernization services. The role requires a consultative sales approach, strong communication skills, and the ability to connect design outcomes with business impact.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Lead Generation &amp; Prospecting</strong>\n- Identify and qualify opportunities for:\n  - UI/UX &amp; Product Design\n  - Website Revamps &amp; CMS Platforms (Webflow, WordPress, Headless)\n  - Branding &amp; Digital Marketing\n- Generate leads via:\n  - LinkedIn &amp; outbound outreach\n  - Email campaigns\n  - Website &amp; inbound inquiries\n  - Events, partnerships, and referrals\n- Research target accounts and decision-makers (CXOs, CMOs, Heads of Marketing/Product)</p>\n<p><strong>Sales &amp; Client Engagement</strong>\n- Conduct discovery calls to understand:\n  - Business goals and challenges\n  - Current digital experience gaps\n  - Design, branding, and marketing needs\n- Position Fineart’s services as strategic business enablers, not isolated design deliverables\n- Collaborate with Cabot teams where technology, AI, or engineering support is required</p>\n<p><strong>Proposal &amp; Pipeline Management</strong>\n- Coordinate with internal teams to prepare:\n  - Proposals, scopes, and timelines\n  - Pricing and engagement models\n- Drive structured follow-ups to move deals across sales stages\n- Maintain accurate CRM records (Pipedrive / HubSpot / Zoho)</p>\n<p><strong>Relationship Management &amp; Handover</strong>\n- Build long-term relationships with prospects and clients\n- Identify cross-sell and upsell opportunities across:\n  - Fineart Design Agency services\n  - Cabot Technology Solutions offerings\n- Ensure smooth transition from sales to delivery teams</p>\n<h3>Skills &amp; Qualifications</h3>\n<p><strong>Must-Have</strong>\n- Solid experience in Business Development / Sales (Digital agency, IT services, or SaaS)\n- Strong verbal and written communication skills\n- Ability to engage with senior stakeholders and decision-makers\n- High-level understanding of:\n  - UI/UX &amp; website design\n  - Branding &amp; digital marketing\n- Experience with outbound prospecting and CRM-driven sales</p>\n<p><strong>Good-to-Have</strong>\n- Experience selling design-led or technology services\n- Exposure to international clients (US, Canada, UK, Middle East)\n- Familiarity with structured proposals and pricing discussions\n- Knowledge of CRM tools and sales automation</p>\n<h3>KPIs &amp; Performance Metrics</h3>\n<ul>\n<li>Qualified leads generated</li>\n<li>Discovery calls completed</li>\n<li>Proposals sent</li>\n<li>Deals closed</li>\n<li>Pipeline value created</li>\n<li>Follow-up discipline &amp; CRM accuracy</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Employment with Cabot Technology Solutions</li>\n<li>Opportunity to work with Fineart Design Agency, Cabot’s creative division</li>\n<li>Competitive salary + performance-based incentives</li>\n<li>Exposure to global clients and multi-disciplinary projects</li>\n<li>Clear career growth path within Cabot’s sales organization</li>\n</ul>\n<h3>Ideal Candidate Profile</h3>\n<ul>\n<li>Comfortable selling value and outcomes, not price</li>\n<li>Process-driven and consistent with follow-ups</li>\n<li>Curious about design, branding, and digital trends</li>\n<li>Long-term mindset toward relationships and growth</li>\n</ul>\n<p><strong>Experience</strong>: 1-4 years</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@cabotsolutions.com</strong>.</p>",
        "tags": [
            "1-4 Years",
            "UI/UX & Product Design",
            "Website Revamps & CMS Platforms",
            "Branding & Digital Marketing"
        ],
        "summary": "A Business Development Executive drives growth for design-led digital services by generating leads, engaging clients, and collaborating with Cabot Technology Solutions and Fineart Design Agency."
    },
    {
        "job_title": "Customer Service Executive - Trainee",
        "company": "Muthoot Mercantile Ltd-It Wing",
        "url": "https://technopark.org/job-details/27116",
        "location": "Technopark",
        "closing_date": "08 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Muthoot Mercantile Limited is a leading Non-Banking Financial Company (NBFC) headquartered in Thiruvananthapuram, Kerala. The company is registered with the RBI as an NBFC and primarily operates in the gold loan sector, emphasizing trust, transparency, and customer relationships. With a wide branch network across several Indian states, Muthoot Mercantile handles customer gold assets with care and professionalism.</p>\n<h2>Position Overview</h2>\n<p>We are seeking motivated and customer-focused <strong>Customer Service Executive – Trainee</strong> candidates for an entry-level role. This position is ideal for fresh graduates or individuals starting a career in customer support. Trainees will receive structured training while assisting customers via calls, emails, or chats and learning company products, processes, and service standards.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Identify potential clients and provide accurate information about products, services, and policies.</li>\n<li>Collect and verify customer documents and financial information.</li>\n<li>Maintain strong follow-up for loan disbursal and repayment collection.</li>\n<li>Ensure compliance with RBI and internal lending norms.</li>\n<li>Prepare and maintain accurate loan documentation and MIS reports.</li>\n<li>Collaborate with team members to improve customer satisfaction.</li>\n<li>Learn and apply product knowledge through training sessions.</li>\n<li>Escalate complex issues to senior team members as needed.</li>\n<li>Meet individual and team performance targets.</li>\n</ul>\n<h2>Preferred Skills &amp; Qualifications</h2>\n<ul>\n<li>Bachelor’s degree in any discipline.</li>\n<li>Strong verbal and written communication skills.</li>\n<li>Male candidates preferred.</li>\n<li>Basic computer knowledge (MS Office, email, CRM tools preferred).</li>\n<li>Positive attitude with strong listening, problem-solving, and interpersonal skills.</li>\n<li>Willingness to learn and adapt in a fast-paced environment.</li>\n</ul>\n<h2>Employment Type</h2>\n<p>Full-time / Fresher</p>\n<h2>What We Offer</h2>\n<ul>\n<li>Comprehensive training and mentorship to develop skills.</li>\n<li>Competitive benefits and opportunities for advancement based on performance.</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Send your application to <strong>hr@muthootenterprises.com</strong> with the subject line \"Application for Customer Service Executive - Trainee\". Application deadline: <strong>08 Feb 2026</strong>.</p>",
        "tags": [
            "Fresher",
            "Customer Service",
            "MS Office",
            "CRM Tools"
        ],
        "summary": "Muthoot Mercantile seeks Customer Service Executive Trainees for an entry-level role in a leading NBFC, offering training in customer support, loan processes, and compliance."
    },
    {
        "job_title": "Junior AI Sales Specialist",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/27115",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2><strong>REIZEND (P) Ltd</strong></h2>\n<p><strong>Address:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<h3><strong>Junior AI Sales Specialist</strong></h3>\n<p><strong>Closing Date:</strong> 13, Mar 2026\n<strong>Job Published:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are hiring a <strong>Junior AI Sales Specialist</strong> to drive marketing initiatives for our AI products and services, contributing to business growth. The role demands excellent communication, a proactive attitude, and the ability to achieve sales targets. The ideal candidate should have strong academic performance and a results-driven mindset.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Develop and implement strategic sales plans to meet company targets.</li>\n<li>Identify new opportunities, prospect clients, and generate leads.</li>\n<li>Build and maintain relationships with key clients, providing tailored solutions.</li>\n<li>Execute marketing programs for AI products/services aligned with GTM strategies.</li>\n<li>Analyze market trends and advise on marketing strategies.</li>\n<li>Collaborate with product and sales teams on strategic initiatives.</li>\n<li>Monitor campaign performance and efficiency.</li>\n<li>Create marketing materials adhering to brand guidelines.</li>\n<li>Partner with external agencies to execute programs.</li>\n<li>Write/proofread content for marketing initiatives.</li>\n<li>Advise on branding, positioning, and communications.</li>\n<li>Stay updated on industry trends and share insights.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong academic record.</li>\n</ul>\n<h3><strong>Compensation</strong></h3>\n<ul>\n<li>₹3.6 LPA</li>\n</ul>\n<h3><strong>Qualifications</strong></h3>\n<ul>\n<li>B.Tech in Non-IT disciplines <strong>OR</strong> Bachelor’s/Master’s in Mathematics/Statistics <strong>OR</strong> Technical degree with MBA.</li>\n<li><strong>Experience Required:</strong> 0-2 years.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "AI Sales",
            "Marketing Strategy",
            "Communication"
        ],
        "summary": "Junior AI Sales Specialist at REIZEND drives marketing for AI products, requiring 0-2 years of experience and strong communication skills."
    },
    {
        "job_title": "SALES SPECIALIST - AI",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/27114",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark Phase 1, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.reizendretail.in\">www.reizendretail.in</a>\n<strong>Job Title:</strong> Sales Specialist - AI\n<strong>Closing Date:</strong> 13, Mar 2026\n<strong>Published Date:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Sales Specialist</strong> to lead marketing initiatives for our AI products and services, driving business growth. The ideal candidate must possess excellent communication skills, a results-oriented mindset, and the ability to achieve sales targets.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and implement strategic sales plans to meet company objectives.</li>\n<li>Identify new opportunities, prospect clients, and generate leads.</li>\n<li>Build and maintain strong client relationships with tailored solutions.</li>\n<li>Execute marketing programs for AI products/services across channels aligned with GTM strategy.</li>\n<li>Analyze market trends and advise on marketing strategy.</li>\n<li>Collaborate with product and sales teams on strategic initiatives.</li>\n<li>Monitor campaign performance and efficiency.</li>\n<li>Create marketing materials adhering to brand guidelines.</li>\n<li>Partner with external agencies to execute programs.</li>\n<li>Write/proofread creative and technical content.</li>\n<li>Provide expert advice on branding, positioning, and communications.</li>\n<li>Stay updated on industry trends and share insights.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong academic record.</li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li><strong>9–14 LPA</strong> (Competitive fixed salary + Attractive performance-based incentives + ESOPs)</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>B.Tech in Non-IT disciplines OR Bachelor’s/Master’s in Mathematics/Statistics OR Technical degree with MBA.</li>\n<li><strong>Experience Required:</strong> 0-3 years.</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "AI Products",
            "Marketing Strategy",
            "Sales Planning"
        ],
        "summary": "A Sales Specialist role at REIZEND (P) Ltd focuses on driving AI product growth through strategic sales and marketing. Requires 0-3 years of experience, strong communication, and a technical/analytical background."
    },
    {
        "job_title": "Application Maintenance Support Engineer (4+Yrs Exp).",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27113",
        "location": "Technopark",
        "closing_date": "03 Feb 2026",
        "job_description": "<h2>GNX Digital Solutions (P) Ltd</h2>\n<p><strong>Module No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581</strong>\n<a href=\"https://gnxsolutions.in\">https://gnxsolutions.in</a></p>\n<p><strong>Application Maintenance Support Engineer (4+Yrs Exp)</strong>\n<strong>Closing Date:</strong> 03, Feb 2026\n<strong>Job Published:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> hr@gnxsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking an Application Maintenance Support Engineer with <strong>4+ years of experience</strong> to support, maintain, and enhance existing applications. The role involves incident management, bug fixing, performance monitoring, and coordination with development and business teams to ensure smooth application operations.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Provide L2/L3 application support for production and staging environments</li>\n<li>Monitor application health, performance, and availability</li>\n<li>Analyze, troubleshoot, and resolve application issues and incidents within defined SLAs</li>\n<li>Perform root cause analysis (RCA) and implement permanent fixes</li>\n<li>Handle bug fixing, minor enhancements, and configuration changes</li>\n<li>Support application deployments, patches, and version upgrades</li>\n<li>Coordinate with development, QA, infrastructure, and business teams</li>\n<li>Maintain application documentation, SOPs, and knowledge base</li>\n<li>Support database-related activities such as data validation and basic queries</li>\n<li>Participate in on-call/shift support as required</li>\n<li>Ensure compliance with security, audit, and operational standards</li>\n</ul>\n<h3>Technical Skills</h3>\n<ul>\n<li>Experience in application support or maintenance roles</li>\n<li>Working knowledge of one or more programming languages (<strong>Java / .NET / Python / Node.js, etc.</strong>)</li>\n<li>Hands-on experience with <strong>SQL</strong> and basic database troubleshooting</li>\n<li>Familiarity with ticketing tools (<strong>Jira, ServiceNow, Freshdesk, etc.</strong>)</li>\n<li>Experience with log analysis and monitoring tools</li>\n<li>Basic understanding of <strong>Linux/Unix commands</strong></li>\n<li>Knowledge of <strong>SDLC, ITIL processes</strong>, and incident/change management</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li><strong>Bachelor’s degree</strong> in Computer Science, IT, or a related field</li>\n<li><strong>4+ years of experience</strong> in Application Maintenance / Production Support</li>\n<li>Strong problem-solving and analytical skills</li>\n<li>Good communication and stakeholder management skills</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Experience in cloud environments (<strong>AWS / Azure / GCP</strong>)</li>\n<li>Exposure to <strong>CI/CD pipelines</strong> and <strong>DevOps tools</strong></li>\n<li>Experience in domain-specific applications (<strong>Banking, Healthcare, E-commerce, etc.</strong>)</li>\n<li><strong>ITIL certification</strong></li>\n</ul>",
        "tags": [
            "4+ Years",
            "Java",
            "SQL",
            "Jira"
        ],
        "summary": "Application Maintenance Support Engineer with 4+ years experience to manage application support, troubleshoot issues, and collaborate with teams to ensure operational excellence."
    },
    {
        "job_title": "FLUTTER DEVELOPER | 1-3 YRS EXP",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27112",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>Job Description</h2>\n<p><strong>Company:</strong> SMARTHMS &amp; SOLUTIONS (P) Ltd\n<strong>Location:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a>\n<strong>Job Title:</strong> Flutter Developer\n<strong>Experience Required:</strong> 1-3 Years\n<strong>Closing Date:</strong> 13, Mar 2026\n<strong>Published Date:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Develop mobile applications using the Flutter framework and Dart programming language.</li>\n<li>Collaborate with designers to create user-friendly and visually appealing interfaces.</li>\n<li>Test and debug application code to ensure functionality.</li>\n<li>Optimize app performance, including reducing size and improving speed.</li>\n<li>Work with backend developers and other team members to integrate services.</li>\n<li>Use Git for version control and collaborative code management.</li>\n<li>Document code, processes, and project requirements.</li>\n<li>Stay updated on mobile app development trends and advancements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in Flutter framework and Dart.</li>\n<li>Knowledge of mobile app development best practices.</li>\n<li>Familiarity with HTML, CSS, and JavaScript.</li>\n<li>Understanding of UI/UX design principles.</li>\n<li>Experience with RESTful APIs and backend integration.</li>\n<li>Git version control expertise.</li>\n<li>Agile development methodology knowledge.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Excellent communication and teamwork abilities.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's or Master's degree in computer science or related fields.</li>\n</ul>\n<h3>Salary</h3>\n<ul>\n<li>₹35,000 - ₹40,000 per month</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Flutter",
            "Dart",
            "RESTful APIs"
        ],
        "summary": "Flutter Developer role requiring 1-3 years of experience in mobile app development with Flutter, Dart, and RESTful APIs. Responsibilities include designing, testing, and optimizing apps while collaborating with cross-functional teams."
    },
    {
        "job_title": "JR PROJECT MANAGER TRAINEE | 2025/2026 Freshers",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27111",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a>\n<strong>Job Title:</strong> JR PROJECT MANAGER TRAINEE | 2025/2026 Freshers\n<strong>Closing Date:</strong> 13th March 2026\n<strong>Job Published:</strong> 27th January 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>The Project Manager Trainee is an entry-level role designed to provide hands-on experience in project management and support. Under the guidance of senior team members, the trainee will learn and assist with essential project support functions, including documentation, scheduling, data collection, and stakeholder communication. This role is ideal for individuals looking to build a strong foundation in Project Management and to develop foundational skills in a collaborative, fast-paced environment.</p>\n<h3>Department</h3>\n<p>Project Management</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Administrative Assistance</strong></li>\n<li>Assist in scheduling project meetings, preparing agendas.</li>\n<li>Help prepare and maintain project documentation, such as schedules, meeting notes, and reports.</li>\n<li>Help draft project communications, such as emails or status updates, for stakeholders.</li>\n<li>Maintain logs for project risks and issues as directed by project managers.</li>\n<li>Document potential risks, issues, and resolutions as part of project risk management.</li>\n<li>\n<p>Observe and learn how the team monitors and addresses risks to ensure project success.</p>\n</li>\n<li>\n<p><strong>Data Collection and Reporting</strong></p>\n</li>\n<li>Collect data from various teams to consolidate into reports or status updates.</li>\n<li>Update project trackers and dashboards with guidance from senior team members.</li>\n<li>\n<p>Assist in creating basic charts or tables to support program reporting needs.</p>\n</li>\n<li>\n<p><strong>Project Management Tools and Software</strong></p>\n</li>\n<li>Gain experience using project management tools like Jira, Trello, etc.</li>\n<li>Support program updates and tracking in project management software under mentorship.</li>\n<li>\n<p>Learn basic resource management principles from experienced team members.</p>\n</li>\n<li>\n<p><strong>Meeting Participation</strong></p>\n</li>\n<li>Attend project meetings to take notes, observe processes, and document action items.</li>\n<li>Prepare meeting agendas and distribute minutes under the supervision of a senior team member.</li>\n<li>\n<p>Learn about effective meeting practices and team collaboration in a program setting.</p>\n</li>\n<li>\n<p><strong>Process Improvement</strong></p>\n</li>\n<li>Assist in process improvement initiatives by handling tasks like data entry or documentation.</li>\n<li>Support the standardisation of project processes and practices across teams.</li>\n<li>\n<p>Learn how senior team members identify and implement improvements in project workflows.</p>\n</li>\n<li>\n<p><strong>Additional Supportive Tasks</strong></p>\n</li>\n<li>Flexibly assist with other tasks as required to support the project team.</li>\n<li>Engage in training and professional development opportunities for growth in project management.</li>\n<li>Participate in ongoing skill-building to prepare for a career in project management.</li>\n</ol>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Education:</strong> Bachelor’s or Master's degree in any field.</li>\n<li>Open to candidates looking to build a strong foundation for a future career in Project Management.</li>\n<li>Candidates aspiring for Tech roles such as Developers, Testers, Data Analyst need not apply.</li>\n<li><strong>Skills:</strong> Strong organisational skills, intellectual skills, attention to detail, written skills, and effective communication.</li>\n<li><strong>Technical Proficiency:</strong> Familiarity with Microsoft Office Suite (Excel, Word, PowerPoint); willingness to learn project management tools.</li>\n<li><strong>Interest in Project Management:</strong> Open to candidates looking to build a career in Project Management.</li>\n<li><strong>Certifications:</strong> CAPM (Certified Associate in Project Management), PMP (Project Management Professional), or Agile/Scrum certifications are beneficial but not required.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Hands-on training in project management and exposure to real-world projects.</li>\n<li>Mentorship from experienced project management professionals.</li>\n<li>Opportunities for career growth and professional development.</li>\n</ul>\n<h3>Salary Package</h3>\n<p>4-6 LPA</p>\n<h3>Experience</h3>\n<p>0-2 years</p>\n<h3>Location</h3>\n<p>Trivandrum</p>",
        "tags": [
            "0-2 Years",
            "Jira",
            "Trello",
            "Microsoft Office Suite"
        ],
        "summary": "Entry-level Project Manager Trainee role offering hands-on experience in project support, mentorship, and career growth opportunities in Trivandrum."
    },
    {
        "job_title": "2025/2026 FRESHERS | IMPLEMENTATION MANAGER",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27110",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2><strong>Company Information</strong></h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">Visit Website</a></p>\n<h2><strong>Job Details</strong></h2>\n<p><strong>Role</strong>: 2025/2026 FRESHERS | IMPLEMENTATION MANAGER\n<strong>Closing Date</strong>: 13, Mar 2026\n<strong>Published On</strong>: 27, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<h2><strong>Brief Description</strong></h2>\n<p>We are seeking a high-potential fresher to join our Implementation Team. You will learn our healthcare ERP product, understand hospital workflows, and assist in onboarding and training new implementation engineers under senior guidance. This role offers a career path in healthcare technology delivery.</p>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Participate in structured training to learn healthcare ERP modules (Billing, Lab, EMR, etc.)</li>\n<li>Understand hospital workflows and compliance standards (e.g., NABH)</li>\n<li>Shadow senior team members during client implementations</li>\n<li>Maintain and update onboarding materials, SOPs, templates, and checklists</li>\n<li>Assist in creating and improving training content (slides, videos, FAQs)</li>\n<li>Document challenges, feedback, and resolutions from field projects</li>\n<li>Support onboarding and internal training for new engineers</li>\n<li>Conduct mock demos and sandbox configurations for practice sessions</li>\n<li>Track training progress using structured checklists</li>\n<li>Learn technical deployment basics and data preparation steps</li>\n<li>Collaborate with project managers and client-side stakeholders</li>\n<li>Participate in team retrospectives and identify process improvement areas</li>\n</ul>\n<h2><strong>Preferred Skills</strong></h2>\n<p><strong>Qualifications</strong>:\n- Recent graduate in Engineering, IT, Business, or Life Sciences\n- Strong logical reasoning and fast learning ability\n- Excellent written and verbal communication skills\n- Attention to detail and proactive documentation habits\n- Eagerness to learn healthcare processes and ERP delivery</p>\n<p><strong>Good-to-Have</strong>:\n- Exposure to ERP or enterprise systems via internships or projects\n- Basic understanding of hospital operations\n- Proficiency in MS Office or Google Suite</p>\n<h2><strong>Salary</strong></h2>\n<p>7-11 LPA</p>",
        "tags": [
            "Freshers (2025/2026)",
            "Healthcare ERP Modules",
            "NABH Compliance",
            "MS Office/Google Suite"
        ],
        "summary": "Fresher role for healthcare ERP implementation, offering training in hospital workflows and collaboration with senior teams. Focus on onboarding, training, and process improvement in healthcare technology delivery."
    },
    {
        "job_title": "Senior Cloud & Infrastructure Security Engineer | 3-6 Yrs Exp",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27109",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>Senior Cloud &amp; Infrastructure Security Engineer</h2>\n<p><strong>Company</strong>: SMARTHMS &amp; SOLUTIONS (P) Ltd\n<strong>Location</strong>: SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website</strong>: <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a>\n<strong>Closing Date</strong>: 13, Mar 2026\n<strong>Published Date</strong>: 27, Jan 2026\n<strong>Contact Email</strong>: careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<ul>\n<li><strong>Experience</strong>: 3–6 Years</li>\n<li><strong>Type</strong>: Hands-on | High Ownership</li>\n<li><strong>Salary Package</strong>: 7-12 LPA</li>\n</ul>\n<h3>Why This Role</h3>\n<p>We’re building and scaling critical infrastructure that must be fast, secure, resilient, and always available. We’re looking for a senior engineer who takes ownership, thrives in hands-on problem solving, and can design, secure, and operate systems end-to-end. This role demands end-to-end ownership, where you design, automate, fix, and continuously improve production systems.</p>\n<h3>What You’ll Own</h3>\n<ul>\n<li>End-to-end Linux server setup, hardening, and performance tuning</li>\n<li>Implementation of security controls and proactive vulnerability mitigation</li>\n<li>Database installation, configuration, backup, and recovery</li>\n<li>Design and maintain AWS services (EC2, S3, IAM etc) and equivalent services in Azure</li>\n<li>Monitoring, alerting, and incident response for servers and networks</li>\n<li>Network design and troubleshooting</li>\n<li>Backup, restore, and disaster recovery (DR) planning and execution</li>\n<li>Ensuring systems are production-ready, fault-tolerant, and auditable</li>\n</ul>\n<h3>What We Expect From You</h3>\n<ul>\n<li>Deep, practical understanding of Linux internal</li>\n<li>Strong grasp of networking fundamentals</li>\n<li>Security-first mindset with hands-on cybersecurity implementation</li>\n<li>Real-world experience handling production incidents</li>\n<li>Ability to work independently and own outcomes</li>\n<li>Comfort working in a fast-moving, evolving environment</li>\n</ul>\n<h3>Preferred Skills (Nice to Have)</h3>\n<ul>\n<li>Hands-on MongoDB deployment on on-premise servers</li>\n<li>Experience with MongoDB Atlas</li>\n<li>Experience designing DR architectures</li>\n<li>Exposure to compliance-driven environments (healthcare, finance, enterprise)</li>\n</ul>\n<h3>What You’ll Get</h3>\n<ul>\n<li>High ownership and direct impact on core systems</li>\n<li>Opportunity to influence architecture and security decisions</li>\n<li>Work with both on-prem and multi-cloud infrastructure</li>\n<li>A role that can grow into Lead Infrastructure / Cloud Architect</li>\n</ul>",
        "tags": [
            "3-6 Years",
            "Linux",
            "AWS",
            "Security"
        ],
        "summary": "Senior engineer to design, secure, and operate cloud/infrastructure systems with hands-on ownership. Requires Linux, AWS, and security expertise."
    },
    {
        "job_title": "IT Operations & Asset Management Executive | 0-3 Years",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27108",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<p><strong>Company</strong>: SMARTHMS &amp; SOLUTIONS (P) Ltd\n<strong>Address</strong>: SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website</strong>: <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a>\n<strong>Job Title</strong>: IT Operations &amp; Asset Management Executive\n<strong>Experience</strong>: 0-3 Years\n<strong>Closing Date</strong>: 13, Mar 2026\n<strong>Published Date</strong>: 27, Jan 2026\n<strong>Contact Email</strong>: careers@shmsolutions.in</p>\n<h3>Role Overview</h3>\n<p>We are seeking an <strong>IT Operations &amp; Asset Management Executive</strong> to manage IT assets, coordinate with vendors, support endpoint systems, and assist with day-to-day office IT and administrative operations. The role requires strong coordination skills, attention to detail, and hands-on system support.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Manage and track IT assets including laptops, servers, and networking devices</li>\n<li>Maintain asset inventory, tagging, and lifecycle records</li>\n<li>Coordinate with vendors and service providers for:</li>\n<li>AMC contracts</li>\n<li>Software subscriptions</li>\n<li>Hardware services and renewals</li>\n<li>Perform OS installation and configuration for laptops and endpoint systems</li>\n<li>Configure and maintain end-user systems, including security and basic software setup</li>\n<li>Provide IT support for office administration activities</li>\n<li>Assist in onboarding and offboarding of employees from an IT perspective</li>\n<li>Ensure timely resolution of IT operational issues</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Experience in IT asset management</li>\n<li>Basic understanding of hardware, servers, and networking devices</li>\n<li>Hands-on experience with OS installation and endpoint configuration</li>\n<li>Good coordination skills with vendors and internal teams</li>\n<li>Basic troubleshooting and user support skills</li>\n<li>Ability to manage multiple operational tasks efficiently</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience handling AMC and subscription-based services</li>\n<li>Familiarity with asset tracking tools or spreadsheets</li>\n<li>Exposure to IT support in office environments</li>\n</ul>\n<h3>Who Should Apply</h3>\n<ul>\n<li>Candidates looking to build or grow a career in IT operations</li>\n<li>Professionals comfortable handling both technical and administrative responsibilities</li>\n<li>Individuals who enjoy hands-on support and coordination roles</li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li><strong>CTC</strong>: ₹3 to ₹4.5 LPA</li>\n<li><strong>Experience</strong>: Any relevant industry experience</li>\n<li><strong>Qualification</strong>: Degree/Diploma</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "IT Asset Management",
            "OS Installation/Configuration",
            "Vendor Coordination"
        ],
        "summary": "Manages IT assets, coordinates vendors, and supports office IT operations. Requires asset management experience and vendor coordination skills."
    },
    {
        "job_title": "Software Testing | 2025/2026 Passouts",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27107",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>About the Company</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">Visit Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role</strong>: Software Testing | <strong>Eligibility</strong>: 2025/2026 Passouts\n<strong>Closing Date</strong>: 13, Mar 2026\n<strong>Published On</strong>: 27, Jan 2026\n<strong>Contact</strong>: <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<h2>Job Description</h2>\n<p>We are seeking a highly motivated and passionate individual to join our team as a <strong>Test and Implementation Engineer</strong>. This position is perfect for a graduate who is passionate with a strong desire to learn and grow in the field.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Configure, implement, and demonstrate software products.</li>\n<li>Validate requirements, oversee projects with specific development needs, conduct internal testing, and guide clients through user acceptance to go-live status.</li>\n<li>Develop and deliver training for administrators and end-users.</li>\n<li>Document all customer interactions in designated CRM systems and ensure excellent customer experiences.</li>\n<li>Analyze existing systems, interface requirements, and business processes.</li>\n<li>Partner with clients to understand their business needs.</li>\n<li>Conduct functional/component, system, performance, regression, and service testing.</li>\n<li>Collaborate with development teams to design test plans, develop test cases/scenarios, and execute testing.</li>\n<li>Provide feedback on usability and serviceability, trace results to quality risks, and report findings.</li>\n</ul>\n<h2>Required Skills</h2>\n<ul>\n<li><strong>0 to 1 year</strong> of experience (freshers welcome)</li>\n<li>Strong communication skills with command over English</li>\n<li>Proficiency in test case development, QA/QC processes, and CRM documentation</li>\n</ul>\n<h2>Compensation</h2>\n<ul>\n<li><strong>Salary</strong>: ₹4-6 LPA</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Submit your resume to <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a>.</p>",
        "tags": [
            "0 to 1 Year",
            "Software Testing",
            "Test Case Development",
            "CRM Documentation"
        ],
        "summary": "Test and Implementation Engineer role for 2025/2026 graduates with 0-1 year experience, focusing on software testing, client training, and QA/QC processes."
    },
    {
        "job_title": "AI Sales Engineer | Freshers",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/27106",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>REIZEND (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark Phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p><strong>AI Sales Engineer | Freshers</strong></p>\n<h2>Key Dates</h2>\n<ul>\n<li><strong>Closing Date:</strong> 13, Mar 2026</li>\n<li><strong>Published Date:</strong> 27, Jan 2026</li>\n</ul>\n<h2>Contact</h2>\n<ul>\n<li><strong>Email:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Develop and implement strategic sales plans to achieve company targets.</li>\n<li>Identify new opportunities, prospect clients, and generate leads.</li>\n<li>Build/maintain client relationships with tailored solutions.</li>\n<li>Execute marketing programs for AI products/services aligned with GTM strategy.</li>\n<li>Analyze market trends and advise on marketing strategy.</li>\n<li>Collaborate with product/sales teams on initiatives.</li>\n<li>Monitor campaign performance and efficiency.</li>\n<li>Create marketing materials (sales collateral, product guides) adhering to brand guidelines.</li>\n<li>Partner with external agencies/vendors for program execution.</li>\n<li>Write/edit technical/creative content for marketing.</li>\n<li>Advise on branding, positioning, and communications.</li>\n<li>Direct marketing efforts using effective tools/methods.</li>\n<li>Stay updated on industry trends and share insights.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Strong analytical and problem-solving abilities</li>\n<li>Excellent communication and interpersonal skills</li>\n<li>Strong academic record</li>\n</ul>\n<h2>Compensation</h2>\n<ul>\n<li><strong>9-14 LPA</strong></li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>B.Tech in Non-IT disciplines <strong>OR</strong> Bachelor’s/Master’s in Mathematics/Statistics <strong>OR</strong> Technical degree with MBA</li>\n<li><strong>Experience Required:</strong> 0-3 years</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "AI",
            "Marketing Strategy",
            "Sales Planning"
        ],
        "summary": "AI Sales Engineer driving business growth through strategic marketing and sales initiatives. Requires 0-3 years experience with focus on AI product marketing and client relationship management."
    },
    {
        "job_title": "PHP DEVELOPER | 2025/2026 Passouts",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27105",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<h3>PHP DEVELOPER | 2025/2026 Passouts</h3>\n<p><strong>Closing Date:</strong> 13, Mar 2026\n<strong>Job Published:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> <strong>careers@shmsolutions.in</strong></p>\n<p><strong>Brief Description</strong>\nWe are seeking a Fresher Developer to join our dynamic team. This role is ideal for a graduate passionate about learning and growing in the field.</p>\n<p><strong>Job Responsibilities</strong>\n- Assist in the design, development, testing, and deployment of software applications.\n- Write clean, efficient, and maintainable code.\n- Participate in code reviews and contribute to codebase improvements.\n- Troubleshoot and debug issues as they arise.\n- Collaborate with team members to understand project requirements and deliver solutions.\n- Stay updated with the latest industry trends and technologies.</p>\n<p><strong>Preferred Skills</strong>\n- Proficiency in programming with a strong grasp of core concepts.\n- Strong problem-solving and analytical skills.\n- Excellent communication and presentation abilities.\n- Basic knowledge of statistical concepts and techniques.</p>\n<p><strong>Qualifications</strong>\n- Bachelor's/Master's degree in Computer Science or a related field.\n- <strong>Experience:</strong> 0-1 years.\n- <strong>Salary Package:</strong> 4-6 LPA</p>",
        "tags": [
            "0-1 Years",
            "PHP",
            "Problem-Solving",
            "Communication"
        ],
        "summary": "SMARTHMS & SOLUTIONS seeks fresh graduates for a PHP Developer role, emphasizing software development and problem-solving. Candidates need 0-1 years experience and strong communication skills."
    },
    {
        "job_title": "Node.js Developer",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27103",
        "location": "Technopark",
        "closing_date": "02 Feb 2026",
        "job_description": "<h2>Node.js Developer</h2>\n<p><strong>Company:</strong> Revyrie Global\n<strong>Location:</strong> 17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a>\n<strong>Closing Date:</strong> 02, Feb 2026\n<strong>Published Date:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Brief Description</h3>\n<ul>\n<li>Design, develop, test, and maintain scalable backend services using Node.js.</li>\n<li>Build and optimize RESTful and/or GraphQL APIs for web and mobile applications.</li>\n<li>Implement secure authentication and authorization mechanisms (JWT, OAuth).</li>\n<li>Integrate third-party APIs and external services.</li>\n<li>Collaborate with frontend developers, product managers, and QA teams to deliver high-quality solutions.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Perform code reviews and contribute to best development practices.</li>\n<li>Troubleshoot, debug, and optimize application performance.</li>\n<li>Participate in architecture discussions and technical decision-making.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>4+ years of experience in backend development using Node.js.</li>\n<li>Strong proficiency in JavaScript (ES6+) and/or TypeScript.</li>\n<li>Experience with frameworks such as Express.js, NestJS.</li>\n<li>Solid understanding of RESTful API design principles.</li>\n<li>Experience with databases: MySQL, PostgreSQL, or MongoDB.</li>\n<li>Knowledge of ORMs/ODMs.</li>\n<li>Familiarity with Git and modern CI/CD pipelines.</li>\n<li>Experience with cloud platforms such as AWS, Azure, or GCP.</li>\n<li>Understanding of Docker and containerized deployments.</li>\n</ul>\n<p><strong>Information Requested:</strong> Kindly mention Job code in the Subject line - ND/2026</p>",
        "tags": [
            "4+ Years",
            "Node.js",
            "Express.js/NestJS",
            "MySQL/PostgreSQL/MongoDB"
        ],
        "summary": "Develop scalable backend services using Node.js, build RESTful/GraphQL APIs, and collaborate with cross-functional teams to deliver secure, high-performance solutions."
    },
    {
        "job_title": "ACCOUNTS MANAGER (CA PURSUING)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27102",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong></p>\n<p><strong>Address:</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581</p>\n<p><strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<p><strong>Job Title:</strong> ACCOUNTS MANAGER (CA PURSUING)</p>\n<p><strong>Closing Date:</strong> 13, Mar 2026\n<strong>Published Date:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Lead company share issue procedures, including valuation processes, projections, and statutory document preparation for stakeholders and ROC.</li>\n<li>Communicate with valuers to explain projections and detail the logic used.</li>\n<li>Prepare share issue offer documents, statutory meeting documentation, resolution passing, and ROC intimation.</li>\n<li>Develop realistic cash flow projections considering statutory requirements, payment prioritization, and receivables.</li>\n<li>Prepare budgets and analyze actual financial performance periodically.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Qualification:</strong> CA Pursuing</li>\n<li><strong>Experience:</strong> 3 years of quality Articleship experience in a Chartered Accountants firm (No post-CA Articleship experience required)</li>\n<li>Confident in using Excel to intermediate level</li>\n<li>Ability to work independently</li>\n<li>Strong team leadership to guide the finance team</li>\n<li>Excellent attention to detail and analytical skills</li>\n<li>Strong verbal and written communication skills</li>\n</ul>\n<p><strong>Salary:</strong> ₹60,000 per month</p>",
        "tags": [
            "3 Years",
            "CA Pursuing",
            "Excel",
            "Financial Projections"
        ],
        "summary": "Lead financial procedures for share issues and cash flow projections. Requires 3 years of Articleship experience and CA Pursuing status with strong Excel skills."
    },
    {
        "job_title": "ACCOUNTS MANAGER (CA Semi Qualified)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/27101",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>REIZEND (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role</strong>: Accounts Manager (CA Semi Qualified)\n<strong>Closing Date</strong>: 13, Mar 2026\n<strong>Published</strong>: 27, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Lead company share issue procedures, including valuation processes, projections, and statutory document preparation for stakeholders and ROC</li>\n<li>Communicate with valuers to explain projections and detail logic used</li>\n<li>Prepare share issue offer documents, statutory meeting documentation, resolution passing, and ROC intimation</li>\n<li>Create realistic cash flow projections considering statutory requirements, payment prioritization, and receivables</li>\n<li>Prepare budgets and analyze periodic financial performance against actuals</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Qualification</strong>: CA Semi Qualified</li>\n<li><strong>Experience</strong>: 3 years of quality Articleship experience in a Chartered Accountants firm</li>\n<li>Confident in using Excel to intermediate level</li>\n<li>Ability to work independently</li>\n<li>Strong team leadership skills for finance teams</li>\n<li>Excellent attention to detail and analytical capabilities</li>\n<li>Strong verbal and written communication skills</li>\n</ul>\n<h2>Salary</h2>\n<ul>\n<li>₹60,000 per month</li>\n</ul>\n<p><strong>Submit your updated resume to</strong>: <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>",
        "tags": [
            "3 Years",
            "CA Semi Qualified",
            "Excel",
            "Financial Projections"
        ],
        "summary": "CA Semi Qualified professional to lead share issue procedures, financial projections, and statutory documentation with 3 years' Articleship experience required."
    },
    {
        "job_title": "ACCOUNTS MANAGER (CA PURSUING)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/27100",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>REIZEND (P) Ltd</h2>\n<p><strong>Address:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a>\n<strong>Closing Date:</strong> 13, Mar 2026\n<strong>Job Published:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@reizend.ai\">careers@reizend.ai</a></p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Lead company share issue procedures, including valuation processes, projections, and statutory document preparation for stakeholders and ROC.</li>\n<li>Communicate with valuers to explain projections and detail logic used.</li>\n<li>Prepare share issue offer documents, statutory meeting documentation, resolution passing, and ROC intimation.</li>\n<li>Create realistic cash flow projections considering statutory requirements, prioritizing payments and receivables.</li>\n<li>Prepare budgets and analyze periodic financial performance against actual results.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Qualification:</strong> CA Pursuing</li>\n<li><strong>Experience:</strong> 3 years of quality Articleship experience in a Chartered Accountants firm (no post-CA experience required)</li>\n<li>Confident in using Excel at an intermediate level</li>\n<li>Ability to work independently</li>\n<li>Strong team leadership to guide the finance team</li>\n<li>Excellent attention to detail and analytical skills</li>\n<li>Strong verbal and written communication skills</li>\n</ul>\n<p><strong>Salary:</strong> ₹60,000 per month</p>",
        "tags": [
            "3 Years",
            "CA Pursuing",
            "Excel (Intermediate)",
            "Company Valuation"
        ],
        "summary": "Seeking an Accounts Manager (CA Pursuing) with 3 years of Articleship experience to lead financial projections, statutory compliance, and team leadership. Responsibilities include share issue procedures, budgeting, and cash flow analysis."
    },
    {
        "job_title": "Junior Java Developer",
        "company": "Sequoiaat India (P) Ltd",
        "url": "https://technopark.org/job-details/27099",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>SequoiaAT India (P) Ltd</strong>\nModule No.1A, Ground Floor, PERIYAR Building, Phase-I Campus, Technopark, 695581\n<a href=\"http://www.sequoiaat.com\">Visit Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Junior Java Developer</strong>\n- <strong>Closing Date</strong>: 20, Feb 2026\n- <strong>Published</strong>: 27, Jan 2026\n- <strong>Contact Email</strong>: <a href=\"mailto:recruitment@sequoiaat.com\">recruitment@sequoiaat.com</a></p>\n<h2>Brief Description</h2>\n<p>We are seeking a passionate and creative <strong>Java Software Developer</strong> to join our dynamic team.</p>\n<h2>Job Summary</h2>\n<ul>\n<li>Talented and experienced Java Software Developer with <strong>2-4 years</strong> of professional experience in Java-based application development.</li>\n<li>Expertise in <strong>Spring Boot</strong>, <strong>MySQL</strong>, and <strong>RESTful API development</strong>.</li>\n<li>Collaborate with cross-functional teams to deliver high-quality solutions.</li>\n<li>Familiarity with cloud technologies, API testing, and front-end integration is desirable.</li>\n</ul>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design, develop, and maintain robust Java applications.</li>\n<li>Implement and integrate RESTful APIs with internal and third-party systems.</li>\n<li>Perform database design, management, and optimization using MySQL.</li>\n<li>Collaborate with product managers, designers, and developers to deliver features.</li>\n<li>Conduct unit testing and code reviews for quality assurance.</li>\n<li>Diagnose and resolve software bugs and performance issues on Windows platforms.</li>\n<li>Document development processes, architecture, and features.</li>\n</ul>\n<h2>Must-Have Skills</h2>\n<ul>\n<li>Proficiency in <strong>Java</strong> and <strong>Spring Boot</strong> with object-oriented programming knowledge.</li>\n<li>Hands-on experience with <strong>MySQL</strong> (query writing/optimization).</li>\n<li>Experience with <strong>RESTful web services</strong>.</li>\n<li>Solid understanding of <strong>Windows-based development environments</strong>.</li>\n<li>Familiarity with version control systems (SVN, GitHub).</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Cloud services experience (AWS, etc.).</li>\n<li>API testing tools (Postman) and documentation (Swagger).</li>\n<li>Front-end technologies (React Native).</li>\n<li>Linux OS for development/deployment.</li>\n<li>DevOps practices and CI/CD pipelines.</li>\n<li>Containerization tools (Docker, Kubernetes).</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li><strong>3-6 years</strong> of professional software development experience.</li>\n<li>Strong problem-solving skills and teamwork capabilities.</li>\n</ul>",
        "tags": [
            "3-6 Years",
            "Java",
            "Spring Boot",
            "MySQL"
        ],
        "summary": "SequoiaAT India seeks a Java Developer with 3-6 years experience in Java, Spring Boot, and MySQL to design and maintain applications. Responsibilities include API development, database optimization, and cross-team collaboration."
    },
    {
        "job_title": "Python Developer (3+ Years)",
        "company": "Gnx Digital Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27098",
        "location": "Technopark",
        "closing_date": "02 Feb 2026",
        "job_description": "<p><strong>GNX Digital Solutions (P) Ltd</strong></p>\n<p><strong>Location:</strong> Trivandrum\n<strong>Contact Email:</strong> hr@gnxsolutions.in\n<strong>Website:</strong> <a href=\"https://gnxsolutions.in\">https://gnxsolutions.in</a></p>\n<h3><strong>Job Title:</strong> Python Developer (3+ Years)</h3>\n<p><strong>Closing Date:</strong> 02, Feb 2026\n<strong>Published:</strong> 27, Jan 2026</p>\n<p><strong>Notice Period:</strong> Immediate to 15 days</p>\n<p><strong>Brief Description</strong>\nWe’re hiring a Python Developer with strong expertise in <strong>FastAPI</strong>, <strong>microservices</strong>, and <strong>LLM projects</strong>.</p>\n<p><strong>Responsibilities:</strong>\n- Build and scale APIs using <strong>FastAPI</strong>.\n- Develop and deploy microservices (<strong>Docker/Kubernetes</strong>).\n- Work on LLM integrations (<strong>OpenAI</strong>, <strong>Hugging Face</strong>, <strong>LangChain</strong>).</p>\n<p><strong>Preferred Skills/Requirements:</strong>\n- 3+ years of Python development.\n- Hands-on experience with <strong>FastAPI</strong> &amp; microservices.\n- Exposure to <strong>LLM-based projects</strong>.\n- Familiarity with <strong>cloud platforms</strong> &amp; <strong>databases</strong>.</p>\n<p><strong>Nice to Have:</strong>\n- ML pipelines\n- Event-driven systems\n- DevOps practices</p>\n<p><strong>Contact:</strong>\nModule No.244, 2nd Floor, Nila Building, Phase-I Campus, TECHNOPARK, 695581</p>",
        "tags": [
            "3+ Years",
            "FastAPI",
            "Microservices",
            "LLM"
        ],
        "summary": "Python Developer with 3+ years in FastAPI, microservices, and LLM projects. Requires cloud/databases and LLM integration expertise."
    },
    {
        "job_title": "Python developer ( 2 - 4 years exp.)",
        "company": "Quadance Technologies Pvt. Ltd.",
        "url": "https://technopark.org/job-details/27097",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Quadance Technologies Pvt. Ltd.</h2>\n<p><strong>1st Floor, Amstor House, Plot No. 5, Technopark Campus, Kazhakuttom, Trivandrum, 695581</strong>\n<strong>Website</strong>: <a href=\"http://www.quadance.com\">http://www.quadance.com</a></p>\n<h3>Python Developer (2 - 4 Years Exp.)</h3>\n<p><strong>Closing Date</strong>: 27, Feb 2026\n<strong>Published</strong>: 27, Jan 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@quadance.com\">careers@quadance.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a Python Developer to contribute to end-to-end application development, design, and build scalable backend components while maintaining high technical quality.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Own backend features from requirement understanding through design, development, and deployment</li>\n<li>Design and implement scalable, maintainable backend services and APIs</li>\n<li>Break down functional requirements into technical tasks and deliver within timelines</li>\n<li>Write production-grade Python code with error handling, logging, and performance optimization</li>\n<li>Build and consume RESTful APIs and integrate with external services</li>\n<li>Ensure code quality, reusability, and engineering best practices</li>\n<li>Participate in code reviews and technical design discussions</li>\n<li>Debug complex issues and improve system stability/performance</li>\n<li>Collaborate with frontend, QA, and product stakeholders</li>\n<li>Proactively identify technical gaps and improvement opportunities</li>\n<li>Support junior developers through technical reviews and knowledge sharing</li>\n<li>Follow Git-based version control and Agile/Scrum practices</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong hands-on experience in Core Python for backend development</li>\n<li>Experience with Python web frameworks (Django, FastAPI, or Flask)</li>\n<li>Solid understanding of OOP, data structures, and algorithms</li>\n<li>Experience designing scalable backend services</li>\n<li>Strong RESTful API development and consumption skills</li>\n<li>Exposure to SQL/NoSQL databases</li>\n<li>Git and collaborative development workflows</li>\n<li>Ability to debug and optimize backend performance</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Familiarity with Python libraries (Pandas, NumPy)</li>\n<li>Exposure to image processing/data processing modules</li>\n<li>Experience with LLMs, AI/ML APIs, or GenAI integrations</li>\n<li>Agile/Scrum environment experience</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "Python",
            "Django",
            "RESTful APIs"
        ],
        "summary": "Python Developer with 2-4 years experience required to design scalable backend services, build RESTful APIs, and collaborate across teams for high-quality software delivery."
    },
    {
        "job_title": "Angular Developer",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27096",
        "location": "Technopark",
        "closing_date": "02 Feb 2026",
        "job_description": "<p><strong>Revyrie Global</strong>\n17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a></p>\n<p><strong>Angular Developer</strong></p>\n<p><strong>Closing Date:</strong> 02, Feb 2026\n<strong>Job Published:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Brief Description</h3>\n<ul>\n<li>Contribute to the growth and development by writing and maintaining quality code.</li>\n<li>Develop application code and unit test in <strong>Angular</strong>, <strong>REST Web Services</strong>.</li>\n<li>Provide adequate test coverage including unit and integration tests.</li>\n<li>Work with the entire engineering team to improve the current code and with the DevOps team on the product architecture.</li>\n<li>Advocate for modern software engineering best practices and use accurate reporting and metrics to measure change.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>2-4 years</strong> of relevant experience is required.</li>\n<li>Strong knowledge of <strong>Angular</strong>, <strong>JavaScript</strong>, and <strong>TypeScript</strong>.</li>\n<li>Bachelor's degree in Computer Science, Computer Engineering, or related field.</li>\n<li>Strong expertise with <strong>HTML5</strong>, <strong>CSS3</strong>, <strong>SASS</strong>, and writing cross-browser compatible code.</li>\n<li>Ability to work autonomously and communicate well in a remote environment across cultures and time zones.</li>\n<li>Willingness to learn and improve by staying up to date on the latest developments in Angular, JavaScript, and front-end engineering.</li>\n</ul>\n<h3>Information Requested</h3>\n<p>Kindly mention <strong>Job code AD/2026</strong> in the subject line of your application email.</p>",
        "tags": [
            "2-4 Years",
            "Angular",
            "JavaScript",
            "TypeScript"
        ],
        "summary": "Angular Developer with 2-4 years of experience in Angular, JavaScript, and TypeScript. Requires collaboration on code quality, testing, and modern engineering practices."
    },
    {
        "job_title": "Java Developer",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27095",
        "location": "Technopark",
        "closing_date": "02 Feb 2026",
        "job_description": "<h2>Revyrie Global</h2>\n<p>17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a></p>\n<p><strong>Closing Date:</strong> 02 Feb 2026\n<strong>Job Published:</strong> 27 Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Brief Description</h3>\n<ul>\n<li>Develop, test, and maintain scalable Java-based applications using <strong>Spring Boot</strong>.</li>\n<li>Design and implement <strong>microservices architecture</strong> to support high-performance and distributed systems.</li>\n<li>Build and integrate <strong>RESTful APIs</strong> to ensure seamless communication between components.</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Optimize application performance and resolve complex technical issues.</li>\n<li>Participate in code reviews to ensure code quality and adherence to best practices.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>4+ years</strong> of experience in Java development.</li>\n<li>Proficiency in <strong>Spring Boot</strong> and building enterprise-grade microservices.</li>\n<li>Strong understanding of <strong>RESTful API</strong> design and implementation.</li>\n<li>Hands-on experience with JavaScript and front-end frameworks (optional).</li>\n<li>Familiarity with databases (MySQL, PostgreSQL, MongoDB).</li>\n<li>Experience with version control tools (Git) and build tools (Maven/Gradle).</li>\n<li>Knowledge of cloud platforms (AWS, Azure, GCP).</li>\n<li>Strong problem-solving skills and ability to work in an agile environment.</li>\n<li>Excellent communication and teamwork abilities.</li>\n</ul>\n<p><strong>Information Requested:</strong> Mention the subject code: <strong>JD/2025</strong></p>",
        "tags": [
            "4+ Years",
            "Spring Boot",
            "RESTful APIs",
            "Java"
        ],
        "summary": "Java Developer role at Revyrie Global involves building scalable applications using Spring Boot and RESTful APIs, with 4+ years of experience required."
    },
    {
        "job_title": "Implementation & Technical Support Engineer",
        "company": "Edify Datascience (P) Ltd",
        "url": "https://technopark.org/job-details/27094",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>EDIFY DATASCIENCE (P) Ltd</h2>\n<p><strong>Module No 19, 2nd Floor, Gayatri Building, Phase I, Technopark, Trivandrum, 695581</strong>\n<a href=\"https://edifydata.com\">https://edifydata.com</a></p>\n<h3>Implementation &amp; Technical Support Engineer</h3>\n<p><strong>Closing Date:</strong> 23, Feb 2026\n<strong>Job Published:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@edifydata.com\">hr@edifydata.com</a></p>\n<h4>Brief Description</h4>\n<p>We are seeking an <strong>Implementation &amp; Technical Support Engineer</strong> to lead customer onboarding, product implementation, and ongoing technical support. This role plays a critical part in ensuring customers successfully adopt and operate our platform through seamless deployment, issue resolution, and continuous technical assistance. The ideal candidate combines strong technical expertise with customer-facing skills, working closely with engineering, product, and customer success teams.</p>\n<p><strong>Location:</strong> Technopark, Trivandrum\n<strong>Experience:</strong> 2–3 Years\n<strong>Employment Type:</strong> Full-time</p>\n<h4>Key Responsibilities</h4>\n<p><strong>Implementation &amp; Onboarding</strong>\n- Own end-to-end product implementation for new and existing customers.\n- Configure system settings, integrations, workflows, and environments based on client requirements.\n- Support data migration, API integrations, and third-party system connections.\n- Ensure successful go-live, stabilization, and post-implementation support.\n- Provide technical guidance and best practices during onboarding.</p>\n<p><strong>Technical Support</strong>\n- Provide L2/L3 technical support for customer issues via tickets, calls, and emails.\n- Troubleshoot application, API, database, and infrastructure-related issues.\n- Perform root cause analysis (RCA) and work on permanent fixes with engineering teams.\n- Monitor production systems and proactively identify and mitigate issues.\n- Support release deployments and post-release validations.</p>\n<p><strong>Cross-Functional Collaboration</strong>\n- Work closely with Engineering, Product, and QA teams to resolve customer issues.\n- Raise detailed bug reports and track issues to closure.\n- Validate fixes in staging/production and communicate resolutions to customers.</p>\n<p><strong>Documentation &amp; Training</strong>\n- Create and maintain implementation guides, technical documentation, and FAQs.\n- Maintain internal runbooks and troubleshooting guides.\n- Conduct technical walkthroughs and training sessions for customers when required.</p>\n<p><strong>Process &amp; Continuous Improvement</strong>\n- Identify opportunities to improve implementation and support processes.\n- Automate repetitive tasks related to deployment, monitoring, and support.\n- Provide feedback on product gaps and usability improvements.</p>\n<h4>Preferred Skills</h4>\n<p><strong>Technical Skills</strong>\n- Hands-on experience with REST APIs, JSON, and API testing tools (Postman, cURL)\n- Working knowledge of databases (PostgreSQL / MySQL / MongoDB)\n- Familiarity with cloud platforms (AWS / Azure / GCP)\n- Basic experience with Docker and containerized deployments\n- Experience in log analysis, monitoring, and debugging\n- Scripting knowledge (Python / Bash) is a plus</p>\n<p><strong>Soft Skills</strong>\n- Strong problem-solving and analytical abilities\n- Excellent written and verbal communication skills\n- Ability to explain technical concepts to non-technical stakeholders\n- Customer-centric mindset with attention to detail\n- Ability to handle multiple priorities in a fast-paced environment</p>\n<h4>Application Instructions</h4>\n<p>Mention subject line as <strong>\"Implementation &amp; Technical Support Engineer\"</strong>\nInterested candidates can send resumes to: <a href=\"mailto:hr@edifydata.com\">hr@edifydata.com</a></p>",
        "tags": [
            "2–3 Years",
            "REST APIs",
            "PostgreSQL",
            "AWS"
        ],
        "summary": "Lead customer onboarding and technical support for product implementation, troubleshooting, and cross-functional collaboration. Requires 2-3 years of experience with REST APIs, databases, and cloud platforms."
    },
    {
        "job_title": "Frontend Developer - React JS & Native",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27093",
        "location": "Technopark",
        "closing_date": "02 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Revyrie Global\n<strong>Location:</strong> 17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a>\n<strong>Job Title:</strong> Frontend Developer - React JS &amp; Native\n<strong>Closing Date:</strong> 02, Feb 2026\n<strong>Published Date:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and maintain scalable, high-performance web applications using React.js.</li>\n<li>Build reusable components and frontend libraries for future use.</li>\n<li>Collaborate with backend developers, UI/UX designers, and product managers to implement user-facing features.</li>\n<li>Optimize applications for maximum speed, scalability, and responsiveness.</li>\n<li>Implement state management using Redux, Context API, or other modern libraries.</li>\n<li>Ensure cross-browser compatibility and responsive UI design.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Participate in code reviews and follow best frontend development practices.</li>\n<li>Troubleshoot, debug, and resolve frontend issues.</li>\n<li>Contribute to mobile app development using React Native.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>3+ years</strong> of experience in frontend development with React.js.</li>\n<li>Strong proficiency in JavaScript (ES6+), HTML5, and CSS3.</li>\n<li>Hands-on experience with React Hooks, functional components, and modern React patterns.</li>\n<li>Hands-on experience with React Native for building mobile applications.</li>\n<li>Strong experience using TypeScript in React/React Native projects.</li>\n<li>Experience with RESTful APIs and API integration.</li>\n<li>Familiarity with state management libraries such as Redux or Context API.</li>\n<li>Experience with modern build tools like Webpack, Vite, or Babel.</li>\n<li>Knowledge of Git and version control workflows.</li>\n<li>Strong problem-solving and debugging skills.</li>\n</ul>\n<p><strong>Information Requested:</strong> Kindly mention Job code in the Subject line - RD/2026</p>",
        "tags": [
            "3+ Years",
            "React.js",
            "React Native",
            "TypeScript"
        ],
        "summary": "Frontend Developer needed to build scalable web and mobile apps using React.js and React Native. Requires 3+ years of experience and expertise in modern frontend technologies."
    },
    {
        "job_title": "Technical Support Specialist – Voice Process (US Region)",
        "company": "Phykon Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27092",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Technical Support Specialist – Voice Process (US Region)</h2>\n<p><strong>Company:</strong> Phykon Solutions (P) Ltd\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Experience:</strong> 0 to 1 Year\n<strong>Shift Timings:</strong>\n- 8:30 PM to 5:30 AM\n- 4:30 AM to 1:30 PM\n- 12:30 PM to 9:30 PM\n- 24/7 Rotational shift</p>\n<h3>Job Overview</h3>\n<p>Phykon is seeking dynamic and technically adept candidates to join our team as Technical Support Executives for a US-based project. The role involves providing top-notch technical and customer support through various communication channels.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Respond promptly to customer requests via telephone, email, and chat.</li>\n<li>Maintain high levels of quality, productivity, and customer satisfaction.</li>\n<li>Appropriately escalate issues and coordinate with supervisors for timely resolution.</li>\n<li>Consistently meet productivity, quality, and sales targets.</li>\n<li>Log and report all customer issues in the customer relationship management (CRM) database.</li>\n<li>Promote sales of technology equipment and devices.</li>\n<li>Deliver an excellent customer experience and contribute to brand promotion.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Must Have:</strong>\n- A neutral English accent (free from Mother Tongue Influence)\n- Exceptional verbal and written communication skills in English\n- Willingness to work in any shift within a 24/7/365 environment</p>\n<p><strong>Good to Have:</strong>\n- Working knowledge of LAN/WAN, basic troubleshooting, and technical issues\n- Networking certifications\n- Candidates from Trivandrum</p>\n<h3>Contact</h3>\n<p>Email: <a href=\"mailto:hiring@phykon.com\">hiring@phykon.com</a>\nApply: <a href=\"https://phykon.keka.com/careers/applyjob/7258\">https://phykon.keka.com/careers/applyjob/7258</a></p>\n<p>Join Phykon and be part of an enthusiastic team dedicated to providing high-quality technical and customer support.</p>",
        "tags": [
            "0 to 1 Year",
            "English Communication",
            "LAN/WAN Troubleshooting",
            "Networking Certifications"
        ],
        "summary": "Phykon seeks Technical Support Specialists for a US project in Trivandrum. Requires 0-1 years experience, English communication, and basic technical troubleshooting skills."
    },
    {
        "job_title": "Sales Executive",
        "company": "Resonance Engineering (P) Ltd",
        "url": "https://technopark.org/job-details/27091",
        "location": "Technopark",
        "closing_date": "15 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Resonance Engineering (P) Ltd\n<strong>Address:</strong> SBC, Thejaswini Building, Phase -1 Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.resonanceengineering.com\">www.resonanceengineering.com</a>\n<strong>Closing Date:</strong> 15, Feb 2026\n<strong>Published Date:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> hr@resonanceengineering.com</p>\n<h3>Brief Description</h3>\n<p>Resonance Engineering is a specialized firm dedicated exclusively to serving Government Departments. We are seeking a high-caliber <strong>Sales Executive</strong> to act as the primary interface between our engineering solutions and public sector decision-makers. This role is for a strategic professional who understands the unique pace, technical rigor, and procedural requirements of government business.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Government Account Management:</strong> Drive sales of our full engineering portfolio by building and maintaining strong relationships within various Government Departments.</li>\n<li><strong>End-to-End Sales Lifecycle:</strong> Take ownership of the process, from identifying department-specific needs and lead generation to technical demonstrations, closing, and ensuring final payment collection.</li>\n<li><strong>Technical Domain Expertise:</strong> Develop and maintain a deep understanding of our solutions to consult with government engineers and officials on complex projects.</li>\n<li><strong>Strategic Representation:</strong> Act as the face of the company in high-stakes presentations and negotiations, aligning solutions with public sector mandates.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 2+ years of relevant sales experience (Direct experience with government procurement is a significant advantage).</li>\n<li><strong>Education:</strong> MBA, BBA, B.Tech, or BE; candidates with a proven track record regardless of degree specialization are encouraged to apply.</li>\n<li><strong>Linguistic Proficiency:</strong> Exceptional communication and negotiation skills in English and Malayalam. Knowledge of additional regional languages is a plus.</li>\n<li><strong>Independence:</strong> Proven ability to work autonomously, manage high-priority timelines, and travel extensively across states.</li>\n<li><strong>Personal Attributes:</strong> Self-motivated, highly organized, and passionate about learning new technologies in the engineering space.</li>\n</ul>\n<h3>Application</h3>\n<p>Interested candidates should submit their resume to <strong>hr@resonanceengineering.com</strong>.</p>",
        "tags": [
            "2+ Years",
            "Government Procurement",
            "Technical Sales",
            "Communication Skills"
        ],
        "summary": "Resonance Engineering seeks a Sales Executive with 2+ years of experience to manage government accounts and drive engineering solutions sales. Requires strong government procurement knowledge, technical sales skills, and bilingual communication abilities."
    },
    {
        "job_title": "Business Development Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/27090",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>ZenturioTech (P) Ltd</strong>\n<strong>Location</strong>: STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website</strong>: <a href=\"https://zenturiotech.com\">zenturiotech.com</a></p>\n<p><strong>Closing Date</strong>: 13th February 2026\n<strong>Job Published</strong>: 27th January 2026\n<strong>Contact Email</strong>: <a href=\"mailto:admin@zenturiotech.com\">admin@zenturiotech.com</a></p>\n<h3>About Us</h3>\n<p>We are a high-growth startup on a mission to build something big from scratch. We’re seeking a <strong>Business Development Trainee</strong> who can turn connections into customers and thrive in a fast-paced environment.</p>\n<h3>What You'll Be Doing</h3>\n<ul>\n<li>Build global connections via LinkedIn &amp; digital channels</li>\n<li>Own the full sales cycle (outreach, lead generation, closing deals)</li>\n<li>Craft compelling pitches and open doors to new markets</li>\n<li>Collaborate with founders and the core team to shape strategy</li>\n<li>Drive growth with initiative and ownership</li>\n</ul>\n<h3>You're a Great Fit If You</h3>\n<ul>\n<li>Are passionate about startups and early-stage opportunities</li>\n<li>Excel at LinkedIn lead generation with proven skills</li>\n<li>Possess a go-getter mindset and self-starter attitude</li>\n<li>Love sales, growth, and making things happen</li>\n<li>Are self-motivated, organized, and hungry to learn</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Be part of a startup’s journey from day one</li>\n<li>Work directly with the founding team</li>\n<li>Experience massive ownership, rapid learning, and real impact</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Smart &amp; proactive</li>\n<li>A true go-getter with a startup mindset</li>\n<li>Energetic, positive, and strong in attitude</li>\n<li>Obsessed with learning, growth, and ownership</li>\n<li>Focused on speed with quality</li>\n</ul>\n<p><strong>Ready to hustle with us?</strong> Send your resume to <a href=\"mailto:admin@zenturiotech.com\">admin@zenturiotech.com</a>. Let’s build something amazing together!</p>",
        "tags": [
            "0-2 Years",
            "LinkedIn",
            "Sales",
            "Startups"
        ],
        "summary": "Business Development Trainee at ZenturioTech drives sales and growth via LinkedIn. Ideal candidate is a proactive startup enthusiast with strong lead-gen skills."
    },
    {
        "job_title": "Python Developer (1-4 years exp)",
        "company": "Aadiltech Solutions Pvt. Ltd",
        "url": "https://technopark.org/job-details/27089",
        "location": "Technopark",
        "closing_date": "01 Feb 2026",
        "job_description": "<p><strong>Company:</strong> AADILTECH SOLUTIONS PVT. LTD\n<strong>Location:</strong> KUNDARA, KOLLAM, 691501\n<strong>Website:</strong> <a href=\"https://aadiltech.com\">https://aadiltech.com</a>\n<strong>Job Title:</strong> Python Developer (1-4 years exp)\n<strong>Closing Date:</strong> 01, Feb 2026\n<strong>Published Date:</strong> 27, Jan 2026\n<strong>Contact Email:</strong> hr@aadiltech.com</p>\n<h3>Job Description</h3>\n<p>We are seeking a <strong>passionate and skilled Full Stack Developer</strong> with <strong>1–4 years of experience</strong> in developing scalable web applications. The role requires expertise in <strong>Python (Django/Flask/FastAPI)</strong> for backend and <strong>React with TypeScript</strong> for frontend. The ideal candidate should possess strong problem-solving skills, the ability to work in a fast-paced environment, and a keen interest in building high-quality, maintainable software.</p>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Software Engineering, Information Technology, or a related field</li>\n<li><strong>1+ years of hands-on experience</strong> with Python (Django/Flask/FastAPI)</li>\n<li>Strong knowledge of React.js with TypeScript</li>\n<li>Proficiency in HTML5, CSS3, JavaScript (ES6+), REST APIs</li>\n<li>Experience with relational databases (PostgreSQL/MySQL)</li>\n<li>Familiarity with version control systems like Git</li>\n<li>Understanding of Agile/Scrum methodologies</li>\n<li>Good communication and problem-solving skills</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>AWS Services: Lambda, EC2, Lightsail, S3, SQS, DynamoDb</li>\n<li>Kubernetes</li>\n<li>Jenkins</li>\n</ul>",
        "tags": [
            "1-4 Years",
            "Python (Django/Flask/FastAPI)",
            "React (TypeScript)",
            "AWS Services"
        ],
        "summary": "Seeking a Full Stack Developer with 1-4 years of experience in Python (Django/Flask/FastAPI) and React (TypeScript) to build scalable web applications. Requires strong problem-solving skills and proficiency in REST APIs, databases, and Agile methodologies."
    },
    {
        "job_title": "Senior Back End Engineer - Node.js",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27088",
        "location": "Technopark",
        "closing_date": "31 Jan 2026",
        "job_description": "<p><strong>iBoson Innovations (P) Ltd</strong>\nACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<a href=\"http://www.iboson.io\">http://www.iboson.io</a></p>\n<p><strong>Senior Back End Engineer - Node.js</strong></p>\n<p><strong>Closing Date:</strong> 31, Jan 2026\n<strong>Job Published:</strong> 26, Jan 2026\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<h3>Brief Description</h3>\n<p>iBoson is shaping the future of AR and AI. We’re growing our engineering team and seeking a skilled Node.js Developer to design and scale backend systems that power cutting-edge, next-gen products.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable backend services using Node.js</li>\n<li>Build and maintain RESTful APIs (and/or GraphQL)</li>\n<li>Optimize application performance, security, and reliability</li>\n<li>Design and manage databases (PostgreSQL, MySQL, MongoDB, etc.)</li>\n<li>Collaborate with frontend, product, and DevOps teams</li>\n<li>Write clean, maintainable, and well-tested code</li>\n<li>Review code and mentor junior engineers</li>\n<li>Participate in architecture and technical decision-making</li>\n<li>Troubleshoot and resolve production issues</li>\n</ul>\n<h3>Preferred Skills/Requirements:</h3>\n<ul>\n<li>5+ years of experience in back-end development, with a focus on Node.js</li>\n<li>Strong understanding of JavaScript, TypeScript, and asynchronous programming</li>\n<li>Experience in building and managing RESTful APIs and microservices architecture</li>\n<li>Proficiency in databases (MongoDB, MySQL, or PostgreSQL)</li>\n<li>Strong understanding of OOP (Object-Oriented Programming) Concepts</li>\n<li>Knowledge of authentication and authorization mechanisms (JWT, OAuth)</li>\n<li>Experience with server-side frameworks like Express.js, Nest.js, or similar</li>\n<li>Familiarity with cloud platforms (AWS, Google Cloud, or Azure) is a plus</li>\n<li>Understanding of Agile methodologies and CI/CD pipelines</li>\n<li>Exposure to AI integrations in back-end applications is an advantage</li>\n<li>AR technology exposure is a plus</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>Work-life balance – flexible work timings</li>\n<li>Opportunity to work on challenging, high-impact projects</li>\n<li>Learning and career growth opportunities</li>\n<li>Collaborative and engineering-driven culture</li>\n</ul>\n<p><strong>Be part of a team where innovation meets impact.</strong> At iBoson, you’ll work with emerging AR and AI technologies, tackle exciting challenges, and grow alongside a passionate, tech-driven team. Interested? Share your resume at career@ibosoninnov.com</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "JavaScript/TypeScript",
            "RESTful APIs"
        ],
        "summary": "Senior Back End Engineer at iBoson Innovations designs scalable backend systems using Node.js, RESTful APIs, and databases. Requires 5+ years experience in backend development with expertise in JavaScript, TypeScript, and cloud platforms."
    }
]