[
    {
        "job_title": "Dot Net Developer",
        "company": "Thoughtline Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21580",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>.Net Developer</h2>\n<p>ThoughtLine Technologies is seeking dynamic and technically strong candidates for their growing team in Technopark, Trivandrum.</p>\n<p><strong>Contact:</strong> careers@thoughtlinetech.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work independently.</li>\n<li>Analyze and interpret business/functional requirements into technical specifications.</li>\n<li>Interpret business/technical requirements and develop solutions.</li>\n<li>Ensure deadlines are met while ensuring quality.</li>\n<li>Work on multiple assignments simultaneously.</li>\n<li>Attend conference calls with clients in the US during late evening hours.</li>\n<li>Follow prescribed client standards and processes.</li>\n<li>Communicate progress/priorities/issues proactively to the tech lead and project manager.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>3+ years of solid hands-on experience in coding, designing, and architecting solutions in a Microsoft-based PC or web environment.</li>\n<li>Expertise in at least one of the following Microsoft Technologies: .Net framework, C#, ASP.NET, Web services, VB 6.0, MS SQL Server.</li>\n<li>Good verbal &amp; written communication skills.</li>\n</ul>\n<p><strong>Ideal Candidate:</strong></p>\n<p>An ideal candidate will have at least 3+ years of extensive hands-on experience in designing and developing enterprise-strength IT solutions. The individual should be pro-active with an attitude that keeps looking for solutions for the toughest of issues. Solid hands-on experience in coding, designing, and architecting solutions in a Microsoft-based PC or web environment. Excellent communication skills will be a big plus.</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 05, July 2025</p>\n<p><strong>Company Address:</strong>\nThoughtLine Technologies (P) Ltd\n111, 11th Floor, Ganga\nETP Phase III, SEZ\nTechnopark, Kulathur P.O.\nTrivandrum, Kerala, India, 695583\nhttp://www.thoughtlinetech.com</p>",
        "tags": [
            "3+ Years",
            ".NET Framework",
            "C#",
            "ASP.NET"
        ],
        "summary": "ThoughtLine Technologies is hiring a .Net Developer to design and develop enterprise IT solutions. The role requires expertise in Microsoft technologies and strong communication skills."
    },
    {
        "job_title": "Telesales Executive",
        "company": "Azinova Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/21579",
        "location": "Technopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>Azinova Technologies (P) Ltd</strong>\nC-14b, Basement Floor 2, Thejaswini, Technopark, Trivandrum, 695581\n<a href=\"http://www.azinovatechnologies.com\">http://www.azinovatechnologies.com</a></p>\n<p><strong>Contact Email:</strong> careers@azinova.info</p>\n<p><strong>Closing Date:</strong> 20, July 2025</p>\n<p><strong>Job Published:</strong> 05, July 2025</p>\n<p><strong>Brief Description</strong></p>\n<p>We are looking for a motivated and results-driven Telesales Executive with prior experience in customer-facing sales roles. This position is ideal for candidates from the banking, insurance, or real estate sectors who are passionate about sales and client acquisition.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Make outbound calls to acquire new clients only and generate leads.</li>\n<li>Promote and explain products/services clearly and persuasively.</li>\n<li>Understand customer needs and provide appropriate solutions.</li>\n<li>Maintain strong knowledge of offerings to handle queries effectively.</li>\n<li>Keep detailed and accurate records of customer interactions and sales outcomes.</li>\n<li>Consistently meet or exceed daily and monthly sales targets.</li>\n<li>Collaborate with the sales team to improve lead conversion and identify upselling opportunities.</li>\n<li>Follow communication scripts and ensure compliance with company policies and sales ethics.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Minimum 1 year of telesales or telecalling experience.</li>\n<li>Experience in banking, insurance, or real estate is mandatory.</li>\n<li>Excellent verbal communication skills in [English / Hindi / Regional language].</li>\n<li>Strong persuasion and negotiation skills.</li>\n<li>Goal-oriented mindset with the ability to perform under pressure.</li>\n<li>Familiarity with CRM tools, Excel, and basic computer operations.</li>\n<li>High levels of persistence, patience, and confidence.</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Telesales",
            "CRM Tools",
            "Sales"
        ],
        "summary": "Azinova Technologies is seeking a Telesales Executive to acquire clients through outbound calls. The ideal candidate will have telesales experience and strong communication skills."
    },
    {
        "job_title": "Web developer (1-5year exp)",
        "company": "Aadiltech Solutions Pvt. Ltd",
        "url": "https://technopark.org/job-details/21578",
        "location": "Technopark",
        "closing_date": "12 Jul 2025",
        "job_description": "<h2>Web Developer</h2>\n<p><strong>AADILTECH SOLUTIONS PVT. LTD</strong>\nKUNDARA, KOLLAM, 691501\n<a href=\"https://aadiltech.com\">https://aadiltech.com</a></p>\n<p><strong>Closing Date:</strong> 12, July 2025\n<strong>Job Published:</strong> 05, July 2025</p>\n<p><strong>Contact Email:</strong> hr@aadiltech.com</p>\n<p><strong>Brief Description:</strong>\nDesign and develop web pages and sites according to business requirements and with the latest trend.\nAbility to interpret requirements and handle projects individually.\nOpenings for our office Technopark Kollam.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>1-5 years of experience in web designing.</li>\n<li>Create perfect designs that are visually appealing.</li>\n<li>Good knowledge in typography and have good color sense.</li>\n<li>Experience and knowledge for developing responsive websites.</li>\n<li>Expert in HTML5, CSS3, jQuery, and JavaScript.</li>\n<li>Proficiency in Adobe CS6, Photoshop, Dreamweaver, Corel Draw, Flash, and Illustrator. Others a plus.</li>\n<li>Must know the current design trends.</li>\n</ul>",
        "tags": [
            "1-5 Years",
            "HTML5",
            "CSS3",
            "JavaScript"
        ],
        "summary": "Aadiltech Solutions is seeking a Web Developer to design and develop web pages. The candidate should have experience in web designing and proficiency in relevant technologies."
    },
    {
        "job_title": "PHP DEVELOPER (0-3)",
        "company": "Aadiltech Solutions Pvt. Ltd",
        "url": "https://technopark.org/job-details/21577",
        "location": "Technopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>PHP Developer</h2>\n<p><strong>AADILTECH SOLUTIONS PVT. LTD</strong></p>\n<p>KUNDARA, KOLLAM, 691501</p>\n<p><a href=\"https://aadiltech.com\">https://aadiltech.com</a></p>\n<p><strong>Closing Date:</strong> 20, July 2025</p>\n<p><strong>Job Published:</strong> 05, July 2025</p>\n<p><strong>Contact Email:</strong> hr@aadiltech.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Understanding the fully synchronous behavior of PHP</li>\n<li>Knowledge of object-oriented PHP programming</li>\n<li>Knowledge of MySQL, web services, Javascript/jQuery, CSS, AJAX</li>\n<li>Strong knowledge of MySQL database and SQL commands</li>\n<li>Experience with web applications</li>\n<li>Should be able to work in a target-oriented environment</li>\n<li>This vacancy is for our office in Technopark Kollam</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Understanding the fully synchronous behavior of PHP</li>\n<li>Knowledge of object-oriented PHP programming</li>\n<li>Knowledge of MySQL, web services, Javascript/jQuery, CSS, AJAX</li>\n<li>Strong knowledge of MySQL database and SQL commands</li>\n<li>Experience with web applications</li>\n<li>Should be able to work in a target-oriented environment</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "PHP",
            "MySQL",
            "JavaScript"
        ],
        "summary": "Aadiltech Solutions is seeking a PHP Developer. The role involves object-oriented PHP programming and working in a target-oriented environment at Technopark Kollam."
    },
    {
        "job_title": "REBAR DETAILER",
        "company": "Grid Engineering Services",
        "url": "https://technopark.org/job-details/21576",
        "location": "Technopark",
        "closing_date": "06 Aug 2025",
        "job_description": "<h2>Rebar Detailer</h2>\n<p><strong>Grid Engineering Services</strong>\nNila, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\nhttps://gridengineeringservices.com</p>\n<p><strong>Contact Email:</strong> hr@grdeng.com</p>\n<h3>Brief Description</h3>\n<p>Rebar detailers are responsible for creating reinforcement shop drawings using CADS RC or other computer-aided design programs. These drawings describe specifications for rebar or other steel construction materials. They develop shop drawings indicating types of rebar or structural reinforcements necessary for a project, whether it's a building construction project or sets of prefabricated components. Drawings include detailed rebar shapes and explanations for how builders plan to use rebar.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Prepare Shop drawings and Bar bending schedule of reinforced concrete elements.</li>\n<li>Understand and follow ACI, BS, or IS code-based detailing standards.</li>\n<li>Produce rebar drawings that conform to industry and company standards for various structures.</li>\n<li>Ability to manage Structural steel, Architectural drawings will be added an advantages</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Degree in Civil Diploma/B. Tech with 4+ years' experience in Building services industry as a Draftsman</li>\n<li>Experience in BS codes and standards</li>\n<li>Experience in working for an international client / projects a plus</li>\n<li>Experience in BIM (Building information modelling would be a plus</li>\n<li>Should be able to learn and understand a variety of structures and construction sequence</li>\n</ul>\n<p><strong>Location:</strong> Technopark, Trivandrum</p>\n<p><strong>Salary:</strong> Between 25,000 to 60,000(Based on skills and experience).</p>\n<p><strong>Closing Date:</strong> 06, Aug 2025</p>\n<p><strong>Job Published:</strong> 05, July 2025</p>",
        "tags": [
            "4+ Years",
            "Rebar Detailing",
            "CADS RC",
            "ACI/BS/IS Codes"
        ],
        "summary": "Seeking a Rebar Detailer to create reinforcement shop drawings using CADS RC. Requires 4+ years' experience and familiarity with ACI, BS, or IS codes."
    },
    {
        "job_title": "STRUCTURAL ENGINEER/ CHECKER",
        "company": "Grid Engineering Services",
        "url": "https://technopark.org/job-details/21575",
        "location": "Technopark",
        "closing_date": "06 Aug 2025",
        "job_description": "<h2>Structural Engineer/Checker</h2>\n<p><strong>Grid Engineering Services</strong>\nNila, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<a href=\"https://gridengineeringservices.com\">https://gridengineeringservices.com</a></p>\n<p><strong>Closing Date:</strong> 06, Aug 2025\n<strong>Job Published:</strong> 05, July 2025\n<strong>Contact Email:</strong> hr@grdeng.com</p>\n<p><strong>Brief Description:</strong>\nThe Structural Engineer/Checker will lead and oversee the rebar detailing team, ensuring accurate, efficient, and timely production of rebar shop drawings and schedules. This role requires a deep understanding of rebar detailing practices, industry standards, and project requirements, coupled with the ability to check the drawings, optimize workflows, manage team, and deliver high-quality drawings.</p>\n<p><strong>Responsibilities:</strong>\n- Possess a strong understanding of rebar detailing standards and procedures to meet the quality.\n- Review and approve shop drawings and schedules for accuracy, completeness, and compliance with project specifications.\n- Assign tasks, set performance expectations, and supervise the rebar detailing team.\n- Stay updated on the latest industry standards and technologies related to rebar detailing.\n- Monitor project progress and ensure timely delivery of shop drawings and schedules.\n- Communicate effectively with clients to understand their requirements and address their concerns.</p>\n<p><strong>Preferred Skills:</strong>\n- BE/BTech in Civil Engineering.\n- Minimum of 3-5 years of experience as a structural engineer expertized in shop drawing checking.\n- Strong understanding of rebar detailing codes and standards.\n- Proficiency in rebar detailing software (e.g., AutoCAD, CADS RC, ZW CAD, Rebar CAD etc).\n- Excellent communication in English and interpersonal skills.</p>\n<p><strong>Location:</strong>\nTechnopark, Trivandrum</p>\n<p><strong>Salary:</strong>\nBetween 25,000 to 60,000 (Based on skills and experience).</p>",
        "tags": [
            "3-5 Years",
            "Rebar Detailing",
            "AutoCAD",
            "Structural Engineering"
        ],
        "summary": "Seeking a Structural Engineer/Checker to lead a rebar detailing team, ensuring accurate drawings and schedules. Requires 3-5 years experience and proficiency in rebar detailing software."
    },
    {
        "job_title": "UX Designer",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21574",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>UX Designer</h2>\n<p>ECS BUSINESS SOLUTIONS (P) Ltd is seeking a UX Designer to join our team.</p>\n<p><strong>Contact Information:</strong>\n*   Email: <a href=\"mailto:careers@ecsfin.com\">careers@ecsfin.com</a>\n*   Website: <a href=\"https://www.ecsfin.com\">https://www.ecsfin.com</a>\n*   Address: Module No. 422, 423 and 424, Nila Building, 4th Floor, Phase 1 Campus, Technopark, 695581</p>\n<p><strong>About ECS Fin:</strong>\nECS Fin is an engineering enterprise specializing in process optimization. Our software solutions, including an enterprise messaging management system, a SWIFT certified transaction processing system, a post-trade processing application, and a treasury management system, are used by Financial Institutions and Corporates worldwide.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Conduct user research, usability testing, and stakeholder interviews to gather insights.</li>\n<li>Analyze user behavior and feedback to inform design decisions.</li>\n<li>Create wireframes, prototypes, and user flows to communicate design ideas.</li>\n<li>Collaborate with product managers, developers, and designers to implement UX strategies.</li>\n<li>Audit existing products and recommend UX improvements.</li>\n<li>Advocate for user-centered design principles across the organization.</li>\n<li>Stay up-to-date with UX trends, tools, and best practices.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>3+ years of experience in UX design or consulting roles.</li>\n<li>Strong portfolio showcasing UX research and design projects.</li>\n<li>Proficiency in design and prototyping tools (e.g., Figma, Sketch, Adobe XD).</li>\n<li>Excellent communication and presentation skills.</li>\n<li>Experience with accessibility standards and responsive design.</li>\n<li>Familiarity with front-end development (HTML/CSS/JavaScript)</li>\n</ul>\n<p><strong>Closing Date:</strong> 18, Aug 2025</p>\n<p><strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "3+ Years",
            "UX Design",
            "Figma",
            "User Research"
        ],
        "summary": "ECS Fin is looking for a UX Designer to conduct research, create prototypes, and implement UX strategies. The ideal candidate has 3+ years of UX design experience."
    },
    {
        "job_title": "Senior Digital Marketing Executive",
        "company": "Ecs Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21573",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Senior Digital Marketing Executive</h2>\n<p>ECS Fin is seeking a creative, data-driven, and globally oriented Senior Digital Marketing Executive for our digital initiatives across global markets including the US, UK, Europe, Middle East, and APAC. This role will be responsible for designing and executing digital marketing strategies to elevate brand presence, drive qualified traffic, and generate enterprise-level leads for our core fintech platforms &amp; solutions. You will be a core member of our growth strategy, working closely with product, sales, and design teams.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute integrated digital marketing plans aligned with company goals.</li>\n<li>Identify target segments in corporate/fintech verticals and tailor campaigns for maximum impact.</li>\n<li>Strategize and manage B2B marketing campaigns across SEO, SEM, email, display ads, and paid social.</li>\n<li>Create and optimize lead generation funnels, marketing automation workflows, and nurture sequences.</li>\n<li>Run performance campaigns across Google Ads, LinkedIn, and programmatic platforms to maximize lead quality and ROI.</li>\n<li>Optimize website UX, conversion paths, and ensure SEO best practices across content.</li>\n<li>Monitor and improve key metrics (CTR, CPC, MQLs, bounce rate, etc.) using Google Analytics, Search Console, and campaign dashboards.</li>\n<li>Collaborate with cross-functional teams to create high-impact digital content (blogs, whitepapers, case studies, videos, etc.).</li>\n<li>Manage and grow ECS Fin’s online presence on LinkedIn, Twitter, and other relevant channels.</li>\n<li>Track digital trends, markets, tools, and recommend improvements to stay ahead of the curve.</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>3–7 years of proven experience in digital marketing, preferably in B2B software, fintech, or enterprise solutions.</li>\n<li>Strong exposure to international markets (especially US, UK, Europe, UAE, Malaysia) and global campaign execution.</li>\n<li>Experience in corporate-level lead generation, not limited to local SEO or small business promotion.</li>\n<li>Demonstrated ability to design and execute digital strategies that impact the enterprise sales pipeline.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Solid grasp of SEO (technical + content), SEM/PPC, social media (especially LinkedIn for B2B), and display ads.</li>\n<li>Hands-on experience with tools such as Google Ads, LinkedIn Campaign Manager, HubSpot, Mailchimp, WordPress, and Google Analytics.</li>\n<li>Familiarity with marketing automation and CRM integration (HubSpot, Marketo, or similar).</li>\n<li>Content marketing capabilities – ability to drive messaging for fintech audiences through thought leadership content.</li>\n<li>Strong analytical mindset with ability to translate data into strategy and action.</li>\n<li>Proactive, collaborative, and comfortable taking initiative in a fast-moving environment.</li>\n<li>Strong written and verbal communication skills with a flair for positioning technical solutions for business stakeholders.</li>\n</ul>\n<p><strong>Contact Information</strong>\nEmail: careers@ecsfin.com</p>",
        "tags": [
            "3-7 Years",
            "Digital Marketing",
            "SEO/SEM",
            "Google Analytics"
        ],
        "summary": "ECS Fin is hiring a Senior Digital Marketing Executive to drive brand presence and generate enterprise leads. The role involves creating and executing digital strategies across various global markets."
    },
    {
        "job_title": "Senior Database Administrator",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21571",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Senior Database Administrator</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Senior Database Administrator to oversee the management, maintenance, and optimization of our databases. The ideal candidate will work on strategic initiatives to align the database infrastructure with long-term business goals and ensure that best practices in database management are consistently followed.</p>\n<p><strong>Location:</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>\n<p><strong>Main Duties/Responsibilities:</strong></p>\n<ul>\n<li>Optimize database queries to ensure fast and efficient data retrieval, particularly for complex or high-volume operations.</li>\n<li>Design and implement effective indexing strategies to reduce query execution times and improve overall database performance.</li>\n<li>Monitor and profile slow or inefficient queries and recommend best practices for rewriting or re-architecting queries.</li>\n<li>Continuously analyze execution plans for SQL queries to identify bottlenecks and optimize them.</li>\n<li>Schedule and execute regular maintenance tasks, including backups, consistency checks, and index rebuilding.</li>\n<li>Implement automated monitoring systems to track database performance, availability, and critical parameters such as CPU usage, memory, disk I/O, and replication status.</li>\n<li>Diagnose and resolve database issues (e.g., locking, deadlocks, data corruption) proactively, before they impact users or operations.</li>\n<li>Implement and manage database clustering, replication, and failover strategies to ensure high availability and disaster recovery (e.g., using tools like SQL Server Always On, Oracle RAC, MySQL Group Replication).</li>\n<li>Monitor resource consumption and plan for growth to ensure the database can scale effectively with increasing data volume and transaction load.</li>\n<li>Analyze and optimize resource usage (CPU, memory, disk, network) to reduce operational costs.</li>\n<li>Ensure that database licensing models are properly adhered to and identify opportunities for reducing licensing costs.</li>\n<li>Use cost analysis tools (e.g., AWS Cost Explorer, Azure Cost Management) to monitor and optimize cloud database spend, identifying opportunities for right sizing or reserving instances</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5-7 years of experience in Microsoft SQL Server administration</li>\n<li>Experience in MySQL, PostgreSQL, and Oracle database administration.</li>\n<li>Exposure to Data Lake, Hadoop, and Azure technologies</li>\n<li>Exposure to DevOps or ITIL</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in computer science, software engineering, or a related field</li>\n<li>Microsoft SQL certifications (MTA Database, MCSA: SQL Server, MCSE: Data Management and Analytics) will be an advantage</li>\n</ul>\n<p><strong>Behavioral Competencies:</strong></p>\n<ul>\n<li>Communication</li>\n<li>Teamwork</li>\n<li>Digital Mindset</li>\n<li>Operational Excellence</li>\n<li>Analytical Ability</li>\n<li>Customer Centricity</li>\n<li>Business and Market Acumen</li>\n<li>Empathy</li>\n<li>Growth Mindset</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not seek payment for job opportunities. Contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "5+ Years",
            "SQL Server",
            "Database Administration",
            "Database Management"
        ],
        "summary": "Reflections Info Systems is looking for a Senior Database Administrator. The candidate will manage, maintain, and optimize databases, aligning infrastructure with business goals."
    },
    {
        "job_title": "Finance Executive",
        "company": "Itwagon (P) Ltd",
        "url": "https://technopark.org/job-details/21570",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Finance Executive</h2>\n<p><strong>ITWAGON (P) Ltd</strong>\n6th Floor, STPI Building, Technopark Phase 1, Trivandrum, 695581\n<a href=\"https://www.itwagon.com\">https://www.itwagon.com</a></p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> priya@itwagon.com</p>\n<p>We are seeking a Finance Executive to manage the day-to-day finance functions of our client, a distribution company based in Singapore. This role involves developing and maintaining financial controls and systems in alignment with organizational requirements. The Finance Executive will provide financial management, expertise, and guidance, ensuring effective monitoring, control, and reporting.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Consolidate and finalize the organization's books of accounts.</li>\n<li>Develop, implement, and ensure compliance with internal financial and accounting policies and procedures.</li>\n<li>Maintain a thorough understanding of statutory and legal aspects related to payroll and income tax compliance.</li>\n<li>Oversee month-end closing processes and corporate reporting.</li>\n<li>Lead and coordinate audits, preparing necessary documents for tax auditors to ensure timely completion.</li>\n<li>Prepare accurate and timely financial statements.</li>\n<li>Document and maintain complete and accurate supporting information for all financial transactions.</li>\n<li>Oversee and coordinate annual internal, external, and statutory audits, collaborating with auditors to resolve any issues.</li>\n<li>Conduct finance, accounting, and business analysis, providing insights to management.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Mandatory Skills:</strong></p>\n<ul>\n<li>Strong knowledge of Generally Accepted Accounting Principles (GAAP).</li>\n<li>Proficient technical accounting skills and expertise.</li>\n<li>Excellent financial analysis and reporting capabilities.</li>\n<li>Familiarity with financial controls and risk management practices.</li>\n<li>Highly computer literate, with proficiency in financial and IT systems.</li>\n<li>Advanced skills in Microsoft Excel.</li>\n<li>Proficiency in computerized accounting packages (e.g., QuickBooks, Xero).</li>\n<li>Strong interpersonal and communication skills, with effective presentation abilities.</li>\n<li>Candidates with 2-3 years of relevant experience.</li>\n</ul>\n<p><strong>Nice to have:</strong></p>\n<ul>\n<li>Prior experience managing international accounts.</li>\n<li>Familiarity with advanced financial modeling and forecasting techniques.</li>\n<li>Knowledge of ERP systems (e.g., SAP, Oracle).</li>\n<li>Experience in a multi-currency accounting environment.</li>\n<li>Ability to thrive in a fast-paced, dynamic setting.</li>\n<li>Knowledge in XERO and DEAR systems will be an advantage</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "GAAP",
            "Financial Analysis",
            "Xero"
        ],
        "summary": "Seeking a Finance Executive to handle daily finance tasks for a Singapore-based distribution company. The role involves financial management, reporting, and ensuring regulatory compliance."
    },
    {
        "job_title": "Technical Project Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21569",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Technical Project Manager</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Technical Project Manager (Tech PM) to lead the end-to-end execution of custom application development and integration projects, primarily built on .NET stacks with modern client frameworks and integration platforms. </p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage end-to-end delivery of custom software development and integration projects using Java, .NET, and related technologies.</li>\n<li>Create and maintain project plans, define timelines, identify dependencies, and track progress.</li>\n<li>Coordinate with cross-functional teams including developers, QA, UI/UX, and DevOps to ensure smooth execution.</li>\n<li>Oversee all stages of the SDLC: requirements finalization, development, integration, testing (unit, system, UAT, NFR), and deployment.</li>\n<li>Work closely with architects and leads to ensure alignment with technical direction and design.</li>\n<li>Identify and manage risks, scope changes, and schedule adjustments proactively.</li>\n<li>Serve as the primary point of contact for clients and stakeholders, providing regular updates and resolving issues.</li>\n<li>Ensure quality and timely delivery through effective team coordination and clear communication.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>13+ years of overall IT experience, with 4–6 years of Technical Project Management experience.</li>\n<li>Strong understanding of custom application development on Java/.NET stacks.</li>\n</ul>\n<p><strong>Experience managing:</strong></p>\n<ul>\n<li>Backend/API development</li>\n<li>Integration using tools like Apache Camel, IBM Integration Stack</li>\n<li>Database interactions (Oracle, SQL Server)</li>\n<li>Client-side development using React/Angular</li>\n<li>Deployment on cloud platforms (AWS, Azure)</li>\n<li>Familiarity with Microservices architecture, CI/CD pipelines, and DevOps practices.</li>\n<li>Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li>Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.</li>\n</ul>\n<p><strong>Tools:</strong> Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</p>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience managing globally distributed teams.</li>\n<li>Strong understanding of enterprise-level integrations and technology ecosystems.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Excellent communication and stakeholder engagement capabilities.</li>\n<li>Strong leadership, problem-solving, and organizational skills.</li>\n<li>Ability to articulate technical topics to both technical and non-technical audiences.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details. Reflections Info Systems does not ask for any payment for jobs. They contact candidates only through their official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Jira",
            "Project Management"
        ],
        "summary": "Seeking a Technical Project Manager to lead custom application development projects using .NET stacks. Requires 13+ years of experience, strong project management, and communication skills."
    },
    {
        "job_title": "Apps & Integration Architect (.Net)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21568",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Apps &amp; Integration Architect (.Net)</h2>\n<p>Reflections Info Systems (P) Ltd is seeking an experienced Apps &amp; Integration Architect (.Net) to join our team. This role requires a strong technical background, excellent communication skills, and hands-on experience in .Net coding and Azure development.</p>\n<p><strong>Contact Information:</strong>\n*   Email: Careers@reflectionsinfos.com\n*   Website: <a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a>\n*   Address: 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Designing and overseeing the architecture of software solutions.</li>\n<li>Leading and mentoring teams effectively with a strong technical foundation and understanding of architectural principles.</li>\n<li>Designing scalable, secure, and robust .NET applications using Azure Cloud services.</li>\n<li>Leading the cloud infrastructure design using Azure IaaS, PaaS, and other Azure services.</li>\n<li>Developing and implementing Azure DevOps CI/CD pipelines for continuous integration and delivery, ensuring best practices for automation and security.</li>\n<li>Identifying, prioritizing, and executing tasks in the software development life cycle.</li>\n<li>Guiding the team to write reusable, testable, performant, and efficient code.</li>\n<li>Leading the development team and collaborating closely with stakeholders to align the architectural vision with business goals.</li>\n<li>Leading by example by designing and implementing clean, best-practices maintainable code.</li>\n<li>Troubleshooting and resolving architectural and infrastructure issues, ensuring high availability and disaster recovery setups.</li>\n<li>Managing stakeholders and client relationships effectively.</li>\n<li>Applying experience in large-scale software development.</li>\n<li>Demonstrating excellent communication and organizational skills.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li><strong>.NET Framework &amp; .NET Core:</strong><ul>\n<li>Expertise in C#, .Net Core, Entity framework, EF core, Microservices.</li>\n<li>Expertise in RDBMS including MS SQL Server with thorough knowledge in writing SQL queries, Stored Procedures.</li>\n</ul>\n</li>\n<li><strong>Architectural Skills:</strong><ul>\n<li>Familiarity with design patterns (e.g., Singleton, Factory, Repository, etc.) and architectural patterns (e.g., MVC, MVVM, Clean Architecture, DDD).</li>\n<li>Understanding of microservices principles, including service decomposition, inter-service communication, and API design.</li>\n<li>Knowledge of event-driven systems and messaging patterns, including using technologies like RabbitMQ or Azure Service Bus.</li>\n<li>Proficiency in cloud services (e.g., Azure, AWS) and understanding of cloud-native application design, including serverless architectures and containers (Docker, Kubernetes).</li>\n<li>Minimum 2 years of experience in an architectural role or as a lead developer with architectural responsibilities.</li>\n</ul>\n</li>\n<li><strong>Azure Cloud Services:</strong><ul>\n<li>Experience in designing and implementing cloud architectures using:<ul>\n<li>Azure App Services (Web Apps, API Apps), Azure Key Vault</li>\n<li>Azure Functions, Durable Functions</li>\n<li>Docker, &amp; containerization practices.</li>\n<li>Azure Logic Apps</li>\n<li>Messaging service - Service Bus &amp; Event Grid</li>\n<li>Azure SQL Database, Cosmos DB, Blob Storage</li>\n</ul>\n</li>\n<li>Design, implement, and deploy microservices on Azure.</li>\n<li>Implement monitoring solutions using Azure Monitor, Application Insights, and Log Analytics.</li>\n</ul>\n</li>\n<li><strong>Azure DevOps:</strong><ul>\n<li>Experience setting up and managing CI/CD pipelines, deployment automation, and release management.</li>\n<li>Proficiency in using Azure Repos, Azure Pipelines, Azure Artifacts, and integrating with Git.</li>\n</ul>\n</li>\n<li><strong>Others:</strong><ul>\n<li>Knowledge of architectural styles and design patterns, experience in designing solutions.</li>\n<li>Broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum model, Jira models.</li>\n<li>Designing, developing, and executing software solutions to address business issues.</li>\n<li>Experience with RESTful APIs</li>\n</ul>\n</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience with PowerShell or Bash scripting for automation.</li>\n<li>Knowledge of Event Hub.</li>\n<li>Experience with GraphQL.</li>\n<li>Front-end JavaScript frameworks used for building dynamic, responsive, and interactive web applications (React/Angular/Vue.js)</li>\n<li>Experience in Azure Active Directory (AAD), Managed Identities, Role-Based Access Control (RBAC), and API security.</li>\n<li>Kubernetes, and containerization practices.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>Working hours: 8 hours (12 PM - 9 PM)</li>\n<li>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</li>\n<li>Reflections Info Systems does not seek payment for jobs. Contact candidates only through the official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</li>\n</ul>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "12+ Years",
            ".NET Core",
            "Azure DevOps",
            "Microservices"
        ],
        "summary": "Reflections Info Systems is hiring an Apps & Integration Architect to design and oversee software solutions using .NET, Azure, and related technologies. The role involves leading teams, ensuring best practices, and aligning architectural vision with business goals."
    },
    {
        "job_title": "Senior .Net Lead",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21567",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Senior .Net Lead</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a skilled and experienced Senior .Net Lead to join our team.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop, enhance, document, and maintain application features in .Net Core 5/6+, C#, /REST API/T-SQL and AngularJS/React JS</li>\n<li>Application Support &amp; API Integrations with third party solutions/services</li>\n<li>Understand technical project priorities, implementation dependencies, risks and issues</li>\n<li>Participate and develop code as part of a unified development group, working the whole technological stack</li>\n<li>Identify, prioritize and execute tasks in the software development life cycle</li>\n<li>Work with the team to define, design, and deliver on new features</li>\n<li>Broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum model, Jira models.</li>\n<li>Effective communication skill, technical documentation, leadership and ownership quality</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Develop high-quality software design and architecture</li>\n<li>6+ years of development experience in C#, .Net technologies, SQL and at least two year working with Azure Cloud Services</li>\n<li>Expertise in C#, .Net Core 3.0/6.0 or higher, Entity framework, EF core, Microservices, Azure Cloud services, Azure DevOps and SOA</li>\n<li>Ability to lead, inspire and motivate teams through effective communication and established credibility</li>\n<li>Guide team to write reusable, testable, performant and efficient code</li>\n<li>Proficient in writing Unit Test Cases using X-Unit, MS-Test</li>\n<li>Build standards based frameworks and libraries to support a large-scale application</li>\n<li>Expertise in RDBMS including MS SQL Server with thorough knowledge in writing SQL queries, Stored Procedures, Views, Functions, Packages, Cursors &amp; tables and objects types.</li>\n<li>Experience in large scale software development.</li>\n<li>Prior experience in Application Support &amp; API Integrations</li>\n<li>Knowledge of architectural styles and design patterns, experience in designing solutions</li>\n<li>Strong debugging and problem-solving skills</li>\n</ul>\n<p><strong>Azure Skills:</strong></p>\n<ul>\n<li>Azure Messaging services - Service Bus or Event Grid, Event hub</li>\n<li>Azure Storage Account - Blobs, Tables, Queue etc</li>\n<li>Azure Function / Durable Functions</li>\n<li>Azure DevOps - CI/CD pipelines (classic / YAML)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Good knowledge of JavaScript, React JS, jQuery, Angular and other front end technologies</li>\n<li>API Management - APIM</li>\n<li>Expertise in Microsoft Azure Cloud Service, Application Insights, Azure Monitoring, KeyVault and SQL Azure.</li>\n<li>Azure DevOps - CI/CD pipelines (classic / YAML)</li>\n<li>Hands on experience in building and deploying applications by adopting Azure DevOps practices such as Continuous Integration (CI) and Continuous Deployment (CD) in runtime with Git, Docker, Kubernetes and managing Azure Cloud Services.</li>\n<li>Azure Container Apps/Docker /Azure Container Registry</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>Working hours: 8 hours (12 PM - 9 PM)</li>\n<li>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</li>\n<li>Reflections Info Systems does not ask for fees for job opportunities. Be cautious of fraudulent job offers.</li>\n</ul>\n<p><strong>Company Information:</strong></p>\n<ul>\n<li>Reflections Info Systems (P) Ltd</li>\n<li>9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581</li>\n<li><a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></li>\n</ul>",
        "tags": [
            "8+ Years",
            ".Net Core",
            "Azure Cloud",
            "C#"
        ],
        "summary": "Reflections Info Systems is hiring a Senior .Net Lead with strong .Net, Azure Cloud, and communication skills. The role involves development, support, and leading a development team."
    },
    {
        "job_title": "Technical Project Manager(Data)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21566",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Technical Project Manager (Data)</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Brief Description</strong></p>\n<p>We are looking for candidates with 13+ years of experience for this role.</p>\n<p><strong>Responsibilities include:</strong></p>\n<ul>\n<li>Own the end-to-end delivery of data platform, AI, BI, and analytics projects, ensuring alignment with business objectives and stakeholder expectations.</li>\n<li>Develop and maintain comprehensive project plans, roadmaps, and timelines for data ingestion, transformation, governance, AI/ML models, and analytics deliverables.</li>\n<li>Lead cross-functional teams including data engineers, data scientists, BI analysts, architects, and business stakeholders to deliver high-quality, scalable solutions on time and within budget.</li>\n<li>Define, prioritize, and manage product and project backlogs covering data pipelines, data quality, governance, AI services, and BI dashboards or reporting tools.</li>\n<li>Collaborate closely with business units to capture and translate requirements into actionable user stories and acceptance criteria for data and analytics solutions.</li>\n<li>Oversee BI and analytics area including dashboard development, embedded analytics, self-service BI enablement, and ad hoc reporting capabilities.</li>\n<li>Ensure data quality, lineage, security, and compliance requirements are integrated throughout the project lifecycle, in collaboration with governance and security teams.</li>\n<li>Coordinate UAT, performance testing, and user training to ensure adoption and successful rollout of data and analytics products.</li>\n<li>Act as the primary point of contact for all project stakeholders, providing regular status updates, managing risks and issues, and escalating as necessary.</li>\n<li>Facilitate agile ceremonies such as sprint planning, backlog grooming, demos, and retrospectives, fostering a culture of continuous improvement.</li>\n<li>Drive post-deployment monitoring and optimization of data and BI solutions to meet evolving business needs and performance standards.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Overall 13+ Years of Experience in IT with 6+ years of experience as a Technical Product Manager, Technical Program Manager, or Delivery Lead.</li>\n<li>Hands-on development experience in data engineering, including data pipelines, ETL processes, and data integration workflows</li>\n<li>Proven track record managing data engineering, analytics, or AI/ML projects end to end</li>\n<li>Solid understanding of modern data architecture: data lakes, warehouses, pipelines, ETL/ELT, governance, and AI tooling</li>\n<li>Hands-on familiarity with cloud platforms (e.g., Azure, AWS, GCP) and DataOps/MLOps practices</li>\n<li>Strong knowledge of Agile methodologies, sprint planning, and backlog grooming</li>\n<li>Excellent communication and stakeholder management skills, including working with senior execs and technical leads</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Background in computer science, engineering, data science, or analytics</li>\n<li>Experience or Solid Understanding with data engineering tools and services in AWS, Azure &amp; GCP</li>\n<li>Exposure or Solid Understanding of BI, Analytics, LLMs, RAG, prompt engineering, or agent-based AI systems</li>\n<li>Experience leading cross-functional teams in matrixed environments</li>\n<li>Certifications: PMP, CSM, SAFe, or equivalent are a plus</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems never seeks payment for jobs. Contact is only through the official website or LinkedIn, and employment-related emails are sent through the official HR email ID. Contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "13+ Years",
            "Data Engineering",
            "Cloud Platforms",
            "Agile Methodologies"
        ],
        "summary": "Reflections Info Systems is seeking a Technical Project Manager to lead data platform and AI projects. The role involves managing cross-functional teams and ensuring data solution delivery."
    },
    {
        "job_title": "iOS Developer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/21565",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>iOS Developer</h2>\n<p>Lean Transitions Solutions Ltd (LTS) is seeking a motivated and skilled iOS Developer with 3+ years of experience to join our dynamic team in Technopark, Trivandrum. LTS, an ISO 9001:2015 certified company with headquarters in the United Kingdom, delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions for world-class organizations globally.</p>\n<p><strong>About LTS</strong></p>\n<p>Founded over a decade ago, LTS has global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico. LTS nurtures core values – Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<p><strong>About the Role</strong></p>\n<p>As an iOS Developer, you will design, build, and maintain robust, high-quality iOS applications. You will collaborate with senior developers and cross-functional teams to bring innovative solutions to life, ensuring seamless and user-friendly mobile experiences.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>App Development:</strong> Design, develop, and maintain iOS applications. Collaborate with senior developers to build scalable and efficient solutions.</li>\n<li><strong>Code Quality:</strong> Write clean, efficient, and maintainable code, adhering to iOS development best practices. Conduct unit and UI tests to maintain high app quality.</li>\n<li><strong>Feature Implementation:</strong> Work closely with UX/UI designers to implement new features, improving app functionality and user experience.</li>\n<li><strong>Troubleshooting &amp; Debugging:</strong> Identify and resolve performance issues, bugs, and crashes to ensure smooth user experiences.</li>\n<li><strong>Collaboration:</strong> Participate in cross-functional team meetings to define project requirements, roadmaps, and timelines. Communicate effectively with team members, designers, and project managers.</li>\n<li><strong>Continuous Improvement:</strong> Engage in regular code reviews, stay updated on new iOS development trends, and share knowledge within the team.</li>\n<li><strong>App Performance:</strong> Ensure that apps are optimized for speed and scalability, using performance monitoring tools to troubleshoot and resolve issues.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Programming Languages &amp; iOS Frameworks:</strong> Strong proficiency in Swift. Knowledge of Objective-C is a plus.</li>\n<li><strong>UI/UX Design:</strong> Proficient in Auto Layout, Storyboards, SwiftUI, and implementing responsive UIs.</li>\n<li><strong>API Integration:</strong> Experience with integrating RESTful APIs.</li>\n<li><strong>Development Tools:</strong> Expertise in Xcode and using version control tools such as Git.</li>\n<li><strong>Debugging &amp; Performance:</strong> Solid understanding of debugging techniques and optimizing app performance.</li>\n<li><strong>OOP Principles:</strong> Strong knowledge of Object-Oriented Programming (OOP) and design patterns.</li>\n<li><strong>Testing:</strong> Familiarity with writing unit tests and UI tests, along with experience in multi-device testing.</li>\n<li><strong>Firebase Integration:</strong> Experience with Firebase services such as Firestore, Realtime Database, Firebase Authentication, Cloud Messaging (FCM), Crashlytics, and Remote Config.</li>\n<li><strong>Multi-Device Testing:</strong> Ability to test and optimize applications across various iPhone and iPad models.</li>\n<li><strong>Experience:</strong> 3+ years of hands-on iOS development experience.</li>\n<li><strong>Learning Mindset:</strong> Passion for continuous learning.</li>\n<li><strong>Communication:</strong> Strong written and verbal communication skills.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates can send their updated resume to careers@ltslean.com with the subject line \"iOS Developer\". Please include the following details:</p>\n<ul>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li>Current Location</li>\n<li>Total Relevant Experience</li>\n<li>Willingness to work at Office</li>\n</ul>\n<p><strong>Closing Date:</strong> 09, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>\n<p><strong>Address:</strong> Lean Transition Solutions, Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581. http://www.LeanTransitionSolutions.com</p>",
        "tags": [
            "3+ Years",
            "Swift",
            "Firebase",
            "RESTful APIs"
        ],
        "summary": "We're seeking a skilled iOS Developer to design, build, and maintain high-quality iOS applications. Requires 3+ years of experience and proficiency in Swift, and RESTful APIs."
    },
    {
        "job_title": "Mid Data Scientist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21564",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Mid Data Scientist</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Mid Data Scientist to join our team. We are looking for candidates with 5+ years of experience.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the development and deployment of machine learning/deep learning models to address key business challenges.</li>\n<li>Apply statistical modeling, data preprocessing, feature engineering, machine learning, and deep learning techniques to build and improve models.</li>\n<li>Have expertise in at least two of the following areas: computer vision, predictive analytics, natural language processing, time series analysis, recommendation systems.</li>\n<li>Expertise in GenAI models is a must.</li>\n<li>Design, implement, and optimize data pipelines for model training and deployment.</li>\n<li>Experience with any one of the model serving frameworks (e.g.,TensorFlow Serving, TorchServe, KServe, or similar).</li>\n<li>Design and implement APIs for model serving and integration with other systems.</li>\n<li>Collaborate with cross-functional teams to define project requirements, develop solutions, and communicate results.</li>\n<li>Mentor junior data scientists, providing guidance on technical skills and project execution.</li>\n<li>Stay up-to-date with the latest advancements in data science and machine learning, particularly in generative AI, and evaluate their potential applications.</li>\n<li>Communicate complex technical concepts and analytical findings to both technical and non-technical audiences.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Strong knowledge of statistical modeling, machine learning, deep learning and GenAI.</li>\n<li>Proficiency in Python and experience optimizing code for performance.</li>\n<li>Experience with data preprocessing, feature engineering, data visualization and hyperparameter tuning.</li>\n<li>Solid understanding of database concepts and experience working with large datasets.</li>\n<li>Experience deploying and scaling machine learning models in a production environment.</li>\n<li>Familiarity with machine learning operations (MLOps) and related tools.</li>\n<li>Good understanding of Generative AI concepts and LLM finetuning.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Bachelor's or Master's degree in a quantitative field such as statistics, mathematics, computer science, or a related area.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Python</li>\n<li>Data Science concepts</li>\n<li>Generative AI</li>\n<li>Pandas, NumPy, Matplotlib</li>\n<li>Artificial Intelligence</li>\n<li>Statistical Modeling</li>\n<li>Machine Learning, Natural Language Processing (NLP), Deep Learning</li>\n<li>Model Serving Frameworks (e.g., TensorFlow Serving, TorchServe)</li>\n<li>MLOps(e.g; MLflow, Tensorboard, Kubeflow etc)</li>\n<li>Computer Vision</li>\n<li>Predictive Analytics</li>\n<li>Time Series Analysis</li>\n<li>Anomaly Detection</li>\n<li>Recommendation Systems</li>\n<li>SQL</li>\n<li>Proficient in any of Cloud Computing Platforms (e.g., AWS, Azure, GCP)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please Note:</strong> Reflections Info Systems never asks for payment for job opportunities. Contact careers@reflectionsinfos.com for any clarification.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "5+ Years",
            "Generative AI",
            "Python",
            "Machine Learning"
        ],
        "summary": "Reflections Info Systems is hiring a Mid Data Scientist to develop and deploy ML models, with a focus on Generative AI. Proficiency in Python and experience with model deployment are required."
    },
    {
        "job_title": "Software Developer (PHP)",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/21563",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Software Developer (PHP)</h2>\n<p><strong>Lean Transitions Solutions Ltd (LTS)</strong> is seeking a talented Software Developer (PHP) to join our team. As an ISO 9001:2015 certified company, LTS advocates Industry 4.0 and delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions for world-class organizations globally.</p>\n<p><strong>About the Role:</strong></p>\n<p>In this role, you will lead the design, development, and maintenance of software systems, collaborating closely with cross-functional teams to deliver innovative solutions that drive business growth.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and code web applications according to business requirements.</li>\n<li>Write well-designed, testable, and efficient code using best software development practices.</li>\n<li>Troubleshoot and resolve complex performance problems and architectural challenges.</li>\n<li>Improve the performance of existing applications.</li>\n<li>Integrate data from various back-end services and databases.</li>\n<li>Be responsible for maintaining, expanding, and scaling applications.</li>\n<li>Collaborate with cross-functional teams to deliver high-quality software solutions.</li>\n<li>Lead and mentor junior engineers, helping them grow their technical skills and ensuring adherence to coding standards.</li>\n<li>Participate in code reviews to maintain high-quality code standards.</li>\n<li>Work with DevOps teams to deploy and maintain applications in cloud environments (AWS, Azure, etc.).</li>\n<li>Stay up to date with PHP frameworks, new technologies, and industry trends.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>2+ years of experience in web application programming.</li>\n<li>Strong proficiency in PHP and web-based application development.</li>\n<li>In-depth knowledge of relational database systems (MySQL) and Object-Oriented Programming (OOP).</li>\n<li>Experience with PHP frameworks such as CodeIgniter, Laravel, or Symfony.</li>\n<li>Proficiency in front-end technologies such as HTML5, CSS, and JavaScript.</li>\n<li>Experience with front-end frameworks like Angular or React is a plus.</li>\n<li>Strong problem-solving and debugging skills.</li>\n<li>Solid understanding of Agile/Scrum development methodologies.</li>\n<li>Excellent relational database skills, particularly with MySQL.</li>\n<li>Strong logical thinking and attention to detail.</li>\n<li>Ability to maintain a strong work ethic and produce high-quality, scalable code.</li>\n<li>Ability to work independently and as part of a team.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line “ Software Developer ( PHP)” and include the following information in the email content:</p>\n<ul>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li>Current Location</li>\n<li>Total Relevant Experience</li>\n<li>Willingness to work at office</li>\n</ul>\n<p><strong>Company Address:</strong></p>\n<p>Lean Transitions Solutions\nBasement Floor, Periyar Building, Technopark Phase -1\nTrivandrum, 695581\nhttp://www.LeanTransitionSolutions.com</p>",
        "tags": [
            "2+ Years",
            "PHP",
            "MySQL",
            "JavaScript"
        ],
        "summary": "LTS is hiring a Software Developer (PHP) to design, develop, and maintain innovative software solutions. The role requires proficiency in PHP, MySQL, and front-end technologies."
    },
    {
        "job_title": "Senior Software Engineer (PHP)",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/21562",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Senior Software Engineer (PHP)</h2>\n<p>Lean Transitions Solutions Ltd (LTS) is looking for a talented Senior Software Engineer to join our team in Technopark, Trivandrum. LTS is an ISO 9001:2015 certified company with headquarters in the United Kingdom, advocating Industry 4.0 solutions for world-class organizations globally.</p>\n<p><strong>About LTS:</strong></p>\n<p>Founded over a decade ago, LTS delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions for various world-class organisations across the globe, including Fortune 500 companies. Our global locations include India, Germany, Poland, the United States, UAE, Jordan, and Mexico. We pride ourselves on meeting client requirements with bespoke software solutions that address industrial and manufacturing challenges. Our core values are: Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<p><strong>Address:</strong> Lean Transition Solutions, Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and code web applications according to business requirements.</li>\n<li>Write well-designed, testable, and efficient code using best software development practices.</li>\n<li>Troubleshoot and resolve complex performance problems and architectural challenges.</li>\n<li>Improve the performance of existing applications.</li>\n<li>Integrate data from various back-end services and databases.</li>\n<li>Be responsible for maintaining, expanding, and scaling applications.</li>\n<li>Collaborate with cross-functional teams to deliver high-quality software solutions.</li>\n<li>Lead and mentor junior engineers, helping them grow their technical skills and ensuring adherence to coding standards.</li>\n<li>Participate in code reviews to maintain high-quality code standards.</li>\n<li>Work with DevOps teams to deploy and maintain applications in cloud environments (AWS, Azure, etc.).</li>\n<li>Stay up to date with PHP frameworks, new technologies, and industry trends.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>4+ years of experience in web application programming.</li>\n<li>Strong proficiency in PHP and web-based application development.</li>\n<li>In-depth knowledge of relational database systems (MySQL) and Object-Oriented Programming (OOP).</li>\n<li>Experience with PHP frameworks such as CodeIgniter, Laravel, or Symfony.</li>\n<li>Proficiency in front-end technologies such as HTML5, CSS, and JavaScript.</li>\n<li>Experience with front-end frameworks like Angular or React is a plus.</li>\n<li>Strong problem-solving and debugging skills.</li>\n<li>Solid understanding of Agile/Scrum development methodologies.</li>\n<li>Excellent relational database skills, particularly with MySQL.</li>\n<li>Strong logical thinking and attention to detail.</li>\n<li>Ability to maintain a strong work ethic and produce high-quality, scalable code.</li>\n<li>Ability to work independently and as part of a team.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line “Senior Software Engineer-PHP” and include the following information in the email content:</p>\n<ul>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li>Current Location</li>\n<li>Total Relevant Experience</li>\n<li>Willingness to work at office</li>\n</ul>\n<p><strong>Closing Date:</strong> 09, July 2025</p>",
        "tags": [
            "4+ Years",
            "PHP",
            "MySQL",
            "JavaScript"
        ],
        "summary": "LTS is seeking a Senior Software Engineer to design, develop, and maintain web applications. The role requires strong PHP skills and experience with database systems."
    },
    {
        "job_title": "SAP BW Technical Consultant (with Data migration Experience)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21561",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>SAP BW Technical Consultant (with Data migration Experience)</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a Senior SAP BW Technical Consultant to lead and execute a complex data migration project from SAP BW to Snowflake for a global headwear and retail business. </p>\n<p>The SAP BW/HANA Solution Architect translates business requirements into a detailed architecture design and delivers the requirements by developing, enhancing SAP BW/BOBJ &amp; HANA solutions for business. This role involves all aspects of delivering BW solutions from design and development to implementation. The position also leads the implementation of reporting analytics solutions focused on managing data integrity, aggregating, reconciling, and integrating data from multiple data sources (SAP and Non-SAP) into a global consolidated SAP BW HANA reporting platform with Industry Best Practices to enable informed decision-making capabilities for Client Functions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead and execute a complex data migration project from SAP BW to Snowflake.</li>\n<li>Evaluate the current SAP BW HANA system capabilities to identify changes and determine the impact on business.</li>\n<li>Develop technical specifications/detailed design for BW HANA Technical Development of Data Modeling, HANA Calculation Views in Control Reports.</li>\n<li>Develop backend Bex Queries, Composite Providers in SAP BW HANA.</li>\n<li>Design &amp; develop frontend visualization tools and dashboards using Business Objects WEBI, SAP Lumira/SAP Analytics on Cloud.</li>\n<li>Develop SAP HANA data model using ADSO, Attribute View, Analytic View, and Calculation View.</li>\n<li>Develop and enhance BW objects such as InfoObjects, InfoCubes, Insources/Data Sources, Master Data, Transformations, Update Rules, DSO, Extractors, Infosets, Aggregates, Process Chains, DTPs, User Exits, BADI and HANA objects like Schemas, Calculated, Analytical or Scripted Views using HANA Modeler.</li>\n<li>Lead the solution design, development, and implementation of SAP BW HANA &amp; Cloud solutions.</li>\n<li>Lead SAP HANA data modeling efforts and provide hands-on technical expertise on overall architecture, technical design, configuration, development and implementation of the SAP BI/BW and NATIVE HANA solutions.</li>\n<li>Responsible for performance tuning of BW systems utilizing best practices.</li>\n<li>Provide guidance on BW HANA security setup and enforces data governance standards and processes.</li>\n<li>Responsible for root cause analysis and providing solutions for SAP BW Reporting production and development issues.</li>\n<li>Determine the BW architectural standards and the right data ingestion approach from disparate source applications using different real-time and batch enabling technologies into Native HANA.</li>\n<li>Mentor a team of junior HANA BW resources, participate in sharing expertise on HANA, and be willing to drive HANA growth initiatives internally.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Deep understanding of SAP HANA Data Modeling techniques and HANA Studio using Attribute View, Analytic View, and Calculation Views. Modeling experience along with HANA related development languages (SQL Script, HTML5, Javascript, Java).</li>\n<li>Experience in Visualization &amp; Reporting tools such as BO Webi, Analysis for Office, SAP Lumira/SAP Analytics.</li>\n<li>Experience in design and development of MultiProviders, InfoCubes, InfoSources, Transfer Structures, DataStore Objects (DSO), Transformations and Data Transfer Process (DTPs), InfoPackages, Transfer Rules and Update Rules.</li>\n<li>General understanding and technical expertise of enterprise-class ETL/BI tools (Oracle BIEE, IBM Cognos, SAS, Informatica, Tableau).</li>\n<li>Exposure to BODS / ETL / SQL Script Tool HANA.</li>\n<li>Understanding of BW HANA Security Model.</li>\n<li>Experience in SAP BPC/BPS project implementations is preferred. Knowledge of BPC Excel, and BPC Web UI is a plus.</li>\n<li>Experience in a multi-cultural, global organization; fluent in English with other spoken languages a plus.</li>\n<li>Strong functional knowledge of ECC Extraction in the areas of Finance, Supply Chain, SD/MM/PP -Logistics.</li>\n<li>Experience with SAP Analytics Cloud (SAC), Power BI, or Tableau integrated with Snowflake.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Understanding of Agile delivery and DevOps principles in BI projects.</li>\n<li>Knowledge of data governance, data security, and compliance in cloud and hybrid environments.</li>\n<li>Good analytical and problem-solving skills, with attention to detail.</li>\n<li>Effective communication and interpersonal skills to collaborate with cross-functional teams.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n</ul>\n<p><strong>Working Hours:</strong></p>\n<ul>\n<li>8 hours, with a few hours of overlap during EST Time zone (12 PM - 9 PM). This overlap is mandatory for meetings.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Company Information:</strong>\nReflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "10+ Years",
            "SAP BW",
            "SAP HANA",
            "Data Migration"
        ],
        "summary": "Seeking a Senior SAP BW Technical Consultant to lead data migration from SAP BW to Snowflake. Requires 10+ years of SAP BW experience and expertise in SAP HANA data modeling."
    },
    {
        "job_title": "Senior Technology Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21560",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Senior Technology Architect</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a versatile and hands-on Senior Technology Architect to join our dynamic engineering teams.</p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Brief Description:</strong>\nThe ideal candidate is a pragmatic leader who thrives on bridging the gap between high-level strategy and practical implementation. You will be responsible for driving our technical vision, building, guiding, and delivering robust solutions that directly contribute to business growth. This role requires a unique blend of deep, multi-technology expertise (.NET/Core, Azure, modern JavaScript, SharePoint), DevOps proficiency, customer-facing acumen, and a relentless focus on creating tangible value.</p>\n<p><strong>Responsibilities include:</strong></p>\n<ul>\n<li><strong>Pragmatic Solution Design:</strong> Lead the architecture and hands-on design of scalable, secure, and resilient enterprise applications.</li>\n<li><strong>Hands-On Technical Leadership:</strong> Mentor and guide development teams through complex technical challenges; lead with hands-on prototyping and coding.</li>\n<li><strong>Client Engagement &amp; Trusted Advisory:</strong> Work directly with customers to lead technical assessments and understand their business challenges.</li>\n<li><strong>Business &amp; Account Growth:</strong> Contribute to growing key accounts by identifying new opportunities and assisting with pre-sales activities.</li>\n<li><strong>Delivery Assurance &amp; Support:</strong> Partner closely with delivery and DevOps teams to ensure the architectural vision is translated into a practical, working solution.</li>\n<li><strong>Service Offering &amp; Capability Development:</strong> Proactively explore new technologies and methods. Develop new service offerings and build reusable assets for the organization.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li><strong>Architectural Expertise:</strong> Apply architectural principles and patterns (Microservices, Domain-Driven Design, Clean Architecture, Event-Driven Architecture, SOLID, OOAD).</li>\n<li><strong>API Design:</strong> Deep expertise in API design (e.g., REST, GraphQL) and ability to design and implement complex hybrid integration solutions.</li>\n<li><strong>Technical Assessments:</strong> Demonstrated experience in performing technical assessments and creating strategic technology roadmaps for clients.</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li><strong>Microsoft Stack:</strong></li>\n<li>Extensive hands-on development experience with .NET and .NET Core.</li>\n<li>Proven ability to design and deploy solutions on Microsoft Azure, leveraging IaaS, PaaS, and serverless architectures (e.g., Azure Functions, App Services, AKS).</li>\n<li><strong>Frontend Technologies:</strong></li>\n<li>Hands-on expertise in Angular, React, or Node.js.</li>\n<li><strong>SharePoint:</strong></li>\n<li>In-depth, hands-on experience with SharePoint Online/On-Premises, including custom solution design.</li>\n<li>Proficiency in the SharePoint Framework (SPFx), custom web parts, and other SharePoint customizations.</li>\n<li><strong>DevOps:</strong></li>\n<li>Hands-on experience with DevOps practices and tools for building and managing CI/CD pipelines.</li>\n<li>Proficiency with containerization technologies (Docker, Kubernetes) and infrastructure as code (IaC).</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>10+ years of progressive, hands-on experience in software development and solution architecture.</li>\n<li>4+ years in a senior role responsible for technical leadership and architectural decisions on complex projects.</li>\n<li>A strong portfolio showcasing successfully designed and delivered enterprise-scale solutions.</li>\n</ul>\n<p><strong>What We're Looking For:</strong></p>\n<ul>\n<li>A Pragmatic Problem-Solver</li>\n<li>An Excellent Communicator</li>\n<li>A Business-Minded Technologist</li>\n<li>A Proactive and Self-Driven Leader</li>\n<li>A Collaborative Mentor</li>\n</ul>\n<p><strong>Contact Information:</strong>\nInterested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not ask for payment for jobs. Contact careers@reflectionsinfos.com for any clarification/ alerts on this subject.</p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "10+ Years",
            ".NET/Core",
            "Azure",
            "SharePoint"
        ],
        "summary": "Reflections Info Systems is hiring a Senior Technology Architect. This role involves driving technical vision, leading development teams, and delivering robust solutions, and requires expertise in .NET, Azure, and DevOps."
    },
    {
        "job_title": "Android Developer",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/21559",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Android Developer</h2>\n<p><strong>Lean Transitions Solutions</strong>\nBasement Floor, Periyar Building, Technopark Phase -1, Trivandrum , 695581\nhttp://www.LeanTransitionSolutions.com</p>\n<p><strong>About Lean Transition Solutions Ltd (LTS)</strong></p>\n<p>Founded over a decade ago, Lean Transition Solutions Ltd (LTS) has its headquarters in the United Kingdom. LTS being an ISO 9001:2015 certified company, advocates Industry 4.0 - the future realm of manufacturing.</p>\n<p>LTS delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions for various world-class organizations across the globe, including Fortune 500 companies, and has our global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico.</p>\n<p>At LTS, they uphold their company’s culture and nurture their core values – Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<p><strong>Location:</strong> Basement Floor, Periyar Building, Technopark</p>\n<p><strong>Job Description:</strong></p>\n<p>As an Android Developer, you will be responsible for designing and building advanced applications for the Android platform. You will work with cross-functional teams to define, design, and ship new features, while also focusing on bug fixing and improving application performance. Ensuring code quality through unit testing and code reviews is crucial.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design and build advanced applications for the Android platform using Java and Kotlin</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features</li>\n<li>Work on bug fixing and improving application performance</li>\n<li>Ensure code quality through unit testing and code reviews</li>\n<li>Integrate third-party APIs and work with Firebase for push notifications and database interactions</li>\n<li>Utilize Android Studio for development and deployment to the Play Store</li>\n<li>Manage source code using Git</li>\n<li>Adhere to Agile methodologies, CI/CD practices, and Test-Driven Development (TDD) where applicable</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>3+ years of hands-on Android development experience</li>\n<li>Strong expertise in Java and Kotlin</li>\n<li>Proficient with Android Studio and Play Store deployment</li>\n<li>Deep understanding of OOP concepts, memory management, and Android frameworks</li>\n<li>Strong debugging and performance tuning skills</li>\n<li>Familiarity with Agile methodologies, CI/CD, and Test-Driven Development (TDD) is a plus</li>\n<li>Demonstrated ability to take initiative and responsibility in a team environment</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates may forward their detailed resume to the contact email careers@ltslean.com with the subject line \"Android Developer\".</p>\n<p><strong>Application must contain the following information in the email content:</strong></p>\n<ul>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li>Current Location</li>\n</ul>\n<p><strong>Closing Date:</strong> 09, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> careers@ltslean.com</p>",
        "tags": [
            "3+ Years",
            "Java",
            "Kotlin",
            "Android Studio"
        ],
        "summary": "Seeking an Android Developer to design and build advanced Android applications. Requires expertise in Java, Kotlin, and Android Studio, and a passion for creating high-quality mobile experiences."
    },
    {
        "job_title": "Senior Quality Analyst",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/21558",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Senior Quality Analyst</h2>\n<p><strong>Lean Transitions Solutions (LTS)</strong> is an ISO 9001:2015 certified company headquartered in the United Kingdom, advocating Industry 4.0. LTS delivers Lean Industry 4.0 software solutions and Leadership 4.0 solutions to world-class organizations, including Fortune 500 companies, with global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico.</p>\n<p><strong>Location:</strong> Periyar Building, Basement Floor, Technopark Phase 1, Trivandrum</p>\n<p><strong>About The Role:</strong></p>\n<ul>\n<li>Lead, mentor, and manage a team of QA analysts.</li>\n<li>Develop and implement QA strategies, test plans, and test cases.</li>\n<li>Oversee functional, performance, security, and usability testing of web and mobile applications across platforms (Windows, Android, Mac, iOS).</li>\n<li>Monitor and maintain the quality of test documentation (test cases, bug reports, metrics).</li>\n<li>Collaborate with project managers, developers, and stakeholders.</li>\n<li>Drive the defect lifecycle process: identify, report, track, and validate bug fixes.</li>\n<li>Coordinate release and deployment planning, providing updates on testing progress and risks.</li>\n<li>Establish and maintain test environments and test data.</li>\n<li>Ensure adherence to software engineering best practices and QA processes.</li>\n<li>Promote and enforce QA methodologies, tools, and standards.</li>\n<li>Stay updated on industry trends and technologies relevant to QA and testing.</li>\n<li>Support continuous improvement initiatives and optimize QA processes.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>4-6 years of experience in Manual Testing (functional, performance, security, usability).</li>\n<li>Proven experience managing QA teams in an Agile/Scrum environment.</li>\n<li>Strong understanding of software QA methodologies, testing tools, and best practices.</li>\n<li>Proficient in creating test scenarios and cases.</li>\n<li>Experience with defect tracking tools and test management systems.</li>\n<li>Solid knowledge of SQL and scripting languages.</li>\n<li>Familiarity with UX guidelines and platform-specific configuration requirements.</li>\n<li>Knowledge in performance testing, load testing, and UX compliance testing.</li>\n<li>Excellent communication and leadership skills.</li>\n<li>Ability to analyse complex requirements and translate them into test cases and plans.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Demonstrated ability to work collaboratively in a dynamic environment.</li>\n<li>Experience with test automation tools and frameworks is a plus.</li>\n<li>Certifications in QA (e.g., ISTQB) are advantageous.</li>\n</ul>\n<p><strong>Application Details:</strong>\nInterested candidates should send their resume to careers@ltslean.com with the subject line \"Senior Quality Analyst\" and include the following information in the email body:</p>\n<ul>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li>Current Location</li>\n<li>Total Relevant Experience</li>\n<li>Willingness to Work at office</li>\n</ul>\n<p><strong>Closing Date:</strong> 09, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> careers@ltslean.com\n<strong>Website:</strong> http://www.LeanTransitionSolutions.com\n<strong>Address:</strong> Basement Floor, Periyar Building, Technopark Phase -1, Trivandrum, 695581</p>",
        "tags": [
            "4-6 Years",
            "Manual Testing",
            "Agile/Scrum",
            "SQL"
        ],
        "summary": "Lean Transition Solutions is seeking a Senior Quality Analyst to lead a QA team and ensure efficient testing of software solutions. The role involves creating test strategies, overseeing testing activities, and driving the defect lifecycle."
    },
    {
        "job_title": "Business Analyst",
        "company": "Lean Transitions Solutions",
        "url": "https://technopark.org/job-details/21557",
        "location": "Technopark",
        "closing_date": "09 Jul 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p>Lean Transitions Solutions Ltd (LTS) is seeking a highly motivated and detail-oriented Business Analyst to join our team. As an ISO 9001:2015 certified company, LTS advocates Industry 4.0 and delivers intelligent, lean-driven software solutions for clients in the manufacturing sector.</p>\n<p><strong>About LTS:</strong></p>\n<p>Founded over a decade ago, LTS has global locations in India, Germany, Poland, the United States, UAE, Jordan, and Mexico. Our dedicated team ensures that client requirements are met and that our bespoke software solutions address industrial and manufacturing challenges. We uphold our core values – Respect for All, Integrity, Collaboration, Creativity, Inclusiveness, and Empathy.</p>\n<p><strong>Address:</strong> Lean Transition Solutions, Periyar Building, Technopark Phase 1, Trivandrum</p>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for a Business Analyst with a strong understanding of manufacturing processes, excellent communication skills, and the ability to turn complex client requirements into actionable, user-friendly, and scalable business solutions. The ideal candidate will have hands-on experience working with manufacturing clients, solid knowledge of Lean Manufacturing principles, and the ability to collaborate across business and technical teams to deliver high-quality software products.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Customer &amp; Stakeholder Communication:</strong></li>\n<li>Act as a key communication bridge between business users, clients, and internal development teams.</li>\n<li>Gather, structure, and validate detailed requirements through active collaboration.</li>\n<li>Clearly articulate business needs to both technical and non-technical audiences.</li>\n<li>Manage stakeholder alignment and help resolve ambiguities.</li>\n<li><strong>Understanding of Manufacturing Operations:</strong></li>\n<li>Develop a deep understanding of client-specific manufacturing operations, workflows, and system dependencies.</li>\n<li>Analyse current business processes and suggest improvements aligned with Lean principles.</li>\n<li><strong>Lean-Based Process Analysis &amp; Optimisation:</strong></li>\n<li>Apply Lean Manufacturing techniques to design efficient solutions.</li>\n<li>Identify areas where automation or digital tools can reduce manual effort.</li>\n<li>Recommend improvements based on real-world use cases and data-driven insights.</li>\n<li><strong>Business Solution Definition &amp; Design:</strong></li>\n<li>Translate business needs into comprehensive documentation (BRDs, FSDs, user stories, process flows).</li>\n<li>Define and maintain user journeys, system workflows, and data models.</li>\n<li>Collaborate with solution architects and developers to ensure proposed solutions are scalable.</li>\n<li><strong>User Interface (UI) Contribution:</strong></li>\n<li>Provide input to UI/UX teams to ensure interface designs are intuitive.</li>\n<li>Participate in reviewing wireframes or prototypes.</li>\n<li>Collect and incorporate user feedback into iterative UI improvements.</li>\n<li><strong>Testing &amp; Documentation Support:</strong></li>\n<li>Support test case creation, user acceptance testing (UAT), and issue validation.</li>\n<li>Assist in identifying defects or gaps and coordinate with development and QA teams.</li>\n<li>Maintain and update user manuals, training materials, release notes, and knowledge bases.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Engineering, Business, Information Systems, or a related field.</li>\n<li>Minimum 2 years of experience as a Business Analyst, preferably within a manufacturing-focused IT environment.</li>\n<li>Strong understanding of manufacturing operations and exposure to Lean Manufacturing principles.</li>\n<li>Proven ability to document and translate business requirements into clear technical specifications.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Familiarity with Software Development Life Cycle (SDLC) and methodologies such as Agile, Scrum, or Waterfall.</li>\n<li>Proficiency with tools such as Jira, Confluence, Azure DevOps, Microsoft Visio, and Lucidchart.</li>\n<li>Experience with wireframing/prototyping tools (e.g., Balsamiq, Figma).</li>\n<li>Experience with data visualization or reporting tools (e.g., Tableau, Power BI).</li>\n<li>Certification in Lean Six Sigma or related areas is an added advantage.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resume to careers@ltslean.com with the subject line “Business Analyst” and include the following information in the email content:</p>\n<ul>\n<li>Current CTC</li>\n<li>Expected CTC</li>\n<li>Notice Period</li>\n<li>Current Location</li>\n<li>Total Relevant Experience</li>\n<li>Willingness to work at office</li>\n</ul>\n<p><strong>Closing Date:</strong> 09, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "2+ Years",
            "Lean Manufacturing",
            "Jira",
            "Azure DevOps"
        ],
        "summary": "Lean Transition Solutions is hiring a Business Analyst. This role requires 2+ years of experience, strong manufacturing operations knowledge, and excellent communication skills to translate client needs into actionable solutions."
    },
    {
        "job_title": "Data Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21556",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Data Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Data Architect with 10+ years of experience to join our team. This role involves designing and architecting large data platforms, analytics, and AI solutions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work as part of a team to design and architect large data platforms, analytics, and AI solutions.</li>\n<li>Participate in the development of cloud data warehouses, data as a service, and business intelligence solutions.</li>\n<li>Provide forward-thinking solutions for data integration.</li>\n<li>Programming in Scala or Python, SQL.</li>\n<li>Working experience in Apache Spark is highly preferred.</li>\n<li>Familiarity with AWS and Azure Services like S3, ADLS Gen2, AWS, Redshift, AWS Glue, Azure Data Factory, Azure Synapse.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor's or Master's degree in Computer Science or a related field.</li>\n<li>7+ years of hands-on experience in Data Engineering, Building Data Pipelines, Warehouses, Architecting Data platforms, Data Models, Data Science, AI use cases etc.</li>\n<li>Proven experience as a Data Architect or in a similar role.</li>\n<li>Proficiency in developing and maintaining our data architecture, ensuring its scalability, security, and alignment with business objectives.</li>\n<li>Good experience in MDM/PIM Solution Implementation.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Clear and effective documentation skills.</li>\n<li>Strong collaboration skills.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Efficient time management skills.</li>\n<li>Understanding of end-user needs and expectations.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>AWS/ other Cloud Services Architect Certifications</li>\n<li>SnowPro Core Certification</li>\n<li>Databricks Professional level Certification</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Company Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Important Dates:</strong></p>\n<ul>\n<li>Closing Date: July 11, 2025</li>\n<li>Job Published: July 04, 2025</li>\n</ul>\n<p><strong>Fraud Alert:</strong> Please note that Reflections Info Systems does not ask for fees for job opportunities. Contact careers@reflectionsinfos.com for any clarification.</p>",
        "tags": [
            "10+ Years",
            "Data Architecture",
            "Cloud Data Warehouse",
            "Apache Spark",
            "Scala or Python"
        ],
        "summary": "Reflections Info Systems is seeking a Data Architect to design large data platforms. The role requires 10+ years of experience and proficiency in cloud technologies."
    },
    {
        "job_title": "SharePoint Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21555",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>SharePoint Developer</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a skilled SharePoint Developer to join our team. We are looking for candidates with 6+ years of experience.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Platform Administration &amp; Governance:</strong></li>\n<li>Administer and maintain SharePoint Online, including site collections, subsites, lists, libraries, and permissions.</li>\n<li>Enforce governance policies and ensure compliance with organizational standards.</li>\n<li>Monitor system performance, availability, and usage analytics; generate regular reports.</li>\n<li>\n<p>Manage metadata and content types in response to user needs and in accordance with Microsoft information architecture best practices.</p>\n</li>\n<li>\n<p><strong>Solution Development &amp; Support:</strong></p>\n</li>\n<li>Design and implement SharePoint solutions using out-of-the-box features, Power Automate, Power Apps, PowerShell, and SharePoint Framework (SPFx).</li>\n<li>Provide Tier-2 support and troubleshoot complex issues related to SharePoint and integrated M365 services (Teams, OneDrive, etc.).</li>\n<li>\n<p>Collaborate with onsite resource to refine requirements and translate them into functional SharePoint solutions.</p>\n</li>\n<li>\n<p><strong>Migration &amp; Integration:</strong></p>\n</li>\n<li>Lead or support migration projects from legacy platform (Jive) to SharePoint Online.</li>\n<li>\n<p>Support consolidation of old SharePoint sites in the tenant; move data, notify any affected users.</p>\n</li>\n<li>\n<p><strong>Training &amp; Documentation:</strong></p>\n</li>\n<li>Develop and deliver training materials and sessions for end users and content owners.</li>\n<li>Maintain documentation for configurations, processes, and support procedures.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Systems, or related field (or equivalent experience).</li>\n<li>6+ years of experience in SharePoint administration, with at least 3 years in SharePoint Online.</li>\n<li>Strong knowledge of Microsoft 365 ecosystem, including Teams, OneDrive, Power Platform, and Azure AD.</li>\n<li>Proficiency in PowerShell scripting for automation and administration tasks.</li>\n<li>Experience with SharePoint migrations and third-party tools (e.g., ShareGate, Metalogix).</li>\n<li>Excellent communication, documentation, and stakeholder engagement skills.</li>\n<li>Proficiency in written and spoken English.</li>\n<li>Pluses: Any proficiency in PowerBI.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong></p>\n<p>Please note that Reflections Info Systems never asks for payment for job opportunities. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. Contact careers@reflectionsinfos.com for any clarifications/alerts on this subject.</p>",
        "tags": [
            "6+ Years",
            "SharePoint",
            "PowerShell",
            "Microsoft 365"
        ],
        "summary": "Reflections Info Systems is hiring a SharePoint Developer with 6+ years of experience. The role involves SharePoint administration, solution development, migration, and providing user training."
    },
    {
        "job_title": "Enterprise Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21554",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Enterprise Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking an experienced Enterprise Architect to design, develop, and manage the organization’s overall technology infrastructure. The ideal candidate will align IT strategies with business goals, ensure effective system integration, and create a robust, scalable IT landscape.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Strategic Planning:</strong><ul>\n<li>Collaborate with senior management to formulate a comprehensive IT strategy.</li>\n<li>Define and articulate the enterprise architecture vision, roadmap, and standards.</li>\n<li>Assess the current IT landscape, identifying gaps, risks, and opportunities.</li>\n<li>Conduct feasibility studies and evaluate risks and benefits of new technology initiatives.</li>\n</ul>\n</li>\n<li><strong>Architecture Design:</strong><ul>\n<li>Design and document enterprise architecture blueprints.</li>\n<li>Develop and oversee solution architectures for new projects.</li>\n<li>Define technology standards, guidelines, and best practices.</li>\n<li>Ensure the adoption of architectural principles across all IT projects.</li>\n</ul>\n</li>\n<li><strong>Technical Leadership:</strong><ul>\n<li>Provide technical expertise and guidance to project teams.</li>\n<li>Lead architecture review boards to ensure solutions meet quality, scalability, and compliance standards.</li>\n<li>Stay updated on emerging technologies and industry trends.</li>\n<li>Evaluate and recommend new technologies.</li>\n</ul>\n</li>\n<li><strong>Communication and Collaboration:</strong><ul>\n<li>Act as a bridge between business stakeholders, IT teams, and vendors.</li>\n<li>Present complex technical concepts to non-technical audiences.</li>\n<li>Collaborate with architects across data, security, and cloud disciplines.</li>\n<li>Advise senior management on the business impact of technology decisions.</li>\n</ul>\n</li>\n<li><strong>Governance and Compliance:</strong><ul>\n<li>Ensure the enterprise architecture complies with industry regulations and security standards.</li>\n<li>Monitor the implementation of architectural standards and enforce governance policies.</li>\n<li>Conduct regular architecture reviews to identify risks and recommend mitigation strategies.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Technical Expertise:</strong><ul>\n<li>Proficiency in enterprise architecture frameworks (e.g., TOGAF, Zachman) and modeling tools.</li>\n<li>In-depth knowledge of cloud computing, distributed systems, data management, application development, and network architecture.</li>\n<li>Familiarity with programming languages and development methodologies.</li>\n</ul>\n</li>\n<li><strong>Business Acumen:</strong><ul>\n<li>Strong analytical skills to translate business needs into technical solutions.</li>\n<li>Comprehensive understanding of business processes and technology optimization opportunities.</li>\n<li>Excellent communication and presentation skills.</li>\n</ul>\n</li>\n<li><strong>Leadership and Collaboration:</strong><ul>\n<li>Demonstrated ability to lead cross-functional teams.</li>\n<li>Strong collaboration skills.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>Proven experience as an Enterprise Architect, preferably within IT services.</li>\n<li>A successful track record in designing and implementing enterprise-wide IT solutions.</li>\n<li>Experience managing large-scale technology transformations and migration projects.</li>\n</ul>\n<p><strong>Domain Expertise:</strong></p>\n<ul>\n<li>Proven exposure to the BFSI (Banking, Financial Services, and Insurance) domain. Experience in Retail and Healthcare domains is also preferred.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Certification in enterprise architecture frameworks such as TOGAF or Zachman.</li>\n<li>Knowledge of DevOps practices and tools.</li>\n<li>Experience with modern technology stacks and microservices-based architectures.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p>Closing Date: 11, July 2025\nJob Published: 04, July 2025</p>\n<p><strong>Note:</strong> Reflections Info Systems never asks for payment for jobs. Contact careers@reflectionsinfos.com for any clarification.</p>",
        "tags": [
            "10+ Years",
            "TOGAF",
            "BFSI Domain",
            "Cloud Computing"
        ],
        "summary": "Reflections Info Systems is looking for an Enterprise Architect to manage the organization's technology infrastructure and align IT strategies with business goals. The role requires 10+ years of experience and expertise in the BFSI domain."
    },
    {
        "job_title": "Senior UI Technology Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21553",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Senior UI Technology Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Senior UI Technology Architect.</p>\n<p><strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581</p>\n<p><strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 11, July 2025</p>\n<p><strong>Job Published:</strong> 04, July 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a UI Architect with 12+ years of experience.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Preferably a holistic architect but specializing in UI Architecture</li>\n<li>Specialist in Angular, React etc.</li>\n<li>Mandatory to be hands-on as this role might need them to do coding as well (as needed)</li>\n<li>Good thinking and communication skills – would have to manage customer interactions, do assessments, suggest roadmaps, define architecture.</li>\n<li>Good to have at least some functional domain knowledge (banking or manufacturing/retail).</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "12+ Years",
            "UI Architecture",
            "Angular",
            "React"
        ],
        "summary": "Reflections Info Systems is looking for a Senior UI Technology Architect with extensive experience in UI architecture and expertise in modern web technologies. This role involves customer interaction, architecture definition, and hands-on coding."
    },
    {
        "job_title": "Data Engineer- MDM/PIM/Atacama/Informatica",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21552",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Data Engineer - MDM/PIM/Atacama/Informatica</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Data Engineer with 6+ years of experience to join our team. You will be responsible for developing data and analytics solutions, including cloud data warehouses and business intelligence solutions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work as part of a team to develop Data and Analytics solutions.</li>\n<li>Participate in the development of cloud data warehouses, data as a service, business intelligence solutions</li>\n<li>Ability to provide solutions that are forward-thinking in data integration.</li>\n<li>Deliver a quality product.</li>\n<li>Developing Modern Data Warehouse solutions using Azure or AWS Stack</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>6+ Yrs experience as a Data Engineer, who played a key/lead role in implementing one or two large data solutions</li>\n<li>Programming experience in Scala or Python, SQL</li>\n<li>Min 1+ years experience in MDM/PIM Solution Implementation with tools like Ataccama, Syndigo, Informatica</li>\n<li>Min 2+ years experience in Data Engineering Pipelines, Solutions implementation in Snowflake</li>\n<li>Min 2+ years experience in Data Engineering Pipelines, Solutions implementation in Databricks</li>\n<li>Working knowledge of with some of these AWS and Azure Services like S3, ADLS Gen2, AWS Redshift, AWS Glue, Azure Data Factory, Azure Synapse</li>\n<li>Demonstrated analytical and problem-solving skills</li>\n<li>Excellent written and verbal skills (English)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Familiar with Agile Practices</li>\n<li>Familiar with Version control platforms GIT, CodeCommit etc.</li>\n<li>Problem Solving – Think of various options to solve the problem. Focus on completion, and not on duration spent.</li>\n<li>Ownership</li>\n<li>Proactive rather than reactive</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science &amp; engineering or equivalent demonstrable experience</li>\n<li>Desirable to have Cloud Certifications in Data, Analytics, or Ops/Architect space.</li>\n</ul>\n<p><strong>Contact:</strong>\nInterested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "6+ Years",
            "MDM/PIM",
            "Informatica",
            "Data Engineering"
        ],
        "summary": "Reflections Info Systems is hiring a Data Engineer to develop data solutions. The ideal candidate should have experience with MDM/PIM tools and cloud data warehouses."
    },
    {
        "job_title": "Cloud Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21551",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Cloud Infrastructure Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Cloud Infrastructure Architect to design, develop, and maintain scalable cloud infrastructure solutions. The ideal candidate will lead cloud adoption strategies, migration roadmaps, and workload assessments.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable cloud infrastructure solutions.</li>\n<li>Lead cloud adoption strategies, migration roadmaps, and workload assessments.</li>\n<li>Provide infrastructure expertise to design cloud-native and on-premise solution architectures.</li>\n<li>Architect infrastructure solutions for AI/ML platforms, including training, inference, pipelines, and GPU/TPU setups.</li>\n<li>Ensure infrastructure security, compliance, and adherence to industry best practices.</li>\n<li>Design and implement new capabilities that address gaps and provide an integrated, end-to-end, scalable service.</li>\n<li>Collaborate with external vendors, partners, and stakeholders to ensure successful integration and implementation of infrastructure solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 8 years of experience in the design, implementation, and maintenance of infrastructure solutions.</li>\n<li>Experience in at least 5 projects involving enterprise-level cloud architecture and implementation.</li>\n<li>Proven expertise in designing and implementing large-scale microservices architectures, distributed systems, and integration architectures.</li>\n<li>Hands-on experience in large-scale cloud migration projects.</li>\n<li>Experience in setting up infrastructure for ML workloads, including training, inference, and GPU/TPU provisioning.</li>\n<li>Solid experience in data center operations, including the implementation and support of private and hybrid cloud environments.</li>\n<li>Strong experience with VMware technologies such as vSphere, ESXi, and vCenter.</li>\n<li>Hands-on expertise in infrastructure domains including networking, authentication, compute, and storage.</li>\n<li>Experience in responding to RFPs, preparing solution designs, and performing estimations and costing.</li>\n<li>Strong knowledge of Docker and Kubernetes, with hands-on experience deploying ML workloads.</li>\n<li>Proficient in Infrastructure as Code (IaC) using tools such as Ansible, Terraform, ARM Templates, and CloudFormation.</li>\n<li>Good understanding of SQL and NoSQL databases.</li>\n<li>Deep expertise in DevOps practices, containerization, and CI/CD pipelines.</li>\n<li>Experience with monitoring tools such as Nagios, Splunk, New Relic, or Prometheus.</li>\n<li>Experience working on projects with compliance requirements such as GDPR, PCI DSS, and HIPAA.</li>\n<li>Strong technical knowledge of cloud technologies and virtualization platforms (e.g., VMware, Hyper-V, Cisco, Microsoft, EMC, AWS).</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience with infrastructure services such as LDAP, DNS, DHCP, and Active Directory.</li>\n<li>Excellent communication, documentation, and presentation skills.</li>\n<li>Proficiency in scripting languages such as Python, Bash, or PowerShell for automation tasks.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>AWS/Azure/GCP Architect Certifications</li>\n<li>Kubernetes Certifications (CKA/CKAD)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current, and expected CTC details.</p>\n<p><strong>Company Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p>Closing Date: July 11, 2025\nJob Published: July 04, 2025</p>",
        "tags": [
            "8+ Years",
            "Cloud Architecture",
            "Kubernetes",
            "VMware"
        ],
        "summary": "Reflections Info Systems is hiring a Cloud Infrastructure Architect to design and maintain scalable cloud solutions. This role requires expertise in cloud migration, AI/ML platforms, and security."
    },
    {
        "job_title": "Lead Data Scientist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21550",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Lead Data Scientist</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p>We are seeking a highly experienced Lead Data Scientist to provide technical leadership and strategic direction for our AI initiatives. The ideal candidate will have a strong background in statistical modeling, machine learning, deep learning, and GenAI, with a proven track record of leading high-performance teams and deploying AI solutions in a production environment.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead a high-performance team, guiding and mentoring them on the latest technology landscape, patterns, and design standards.</li>\n<li>Provide strategic direction and technical leadership for AI initiatives.</li>\n<li>Lead the design and architecture of complex AI systems, ensuring scalability, reliability, and performance.</li>\n<li>Lead the development and deployment of machine learning/deep learning models to address key business challenges.</li>\n<li>Apply statistical modeling, data preprocessing, feature engineering, machine learning, and deep learning techniques to build and improve models.</li>\n<li>Utilize expertise in at least two of the following areas: computer vision, predictive analytics, natural language processing, time series analysis, recommendation systems.</li>\n<li>Design, implement, and optimize data pipelines for model training and deployment.</li>\n<li>Experience with model serving frameworks (e.g., TensorFlow Serving, TorchServe, KServe, or similar).</li>\n<li>Design and implement APIs for model serving and integration with other systems.</li>\n<li>Collaborate with cross-functional teams to define project requirements, develop solutions, and communicate results.</li>\n<li>Mentor junior data scientists, providing guidance on technical skills and project execution.</li>\n<li>Stay up-to-date with the latest advancements in data science and machine learning, particularly in generative AI, and evaluate their potential applications.</li>\n<li>Communicate complex technical concepts and analytical findings to both technical and non-technical audiences.</li>\n<li>Serve as a primary point of contact for client managers and liaise frequently with internal stakeholders to gather data or inputs needed for project work.</li>\n</ul>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Python</li>\n<li>Data Science concepts</li>\n<li>Pandas, NumPy, Matplotlib</li>\n<li>Artificial Intelligence</li>\n<li>Statistical Modeling</li>\n<li>Machine Learning, Natural Language Processing (NLP), Deep Learning</li>\n<li>Model Serving Frameworks (e.g., TensorFlow Serving, TorchServe)</li>\n<li>MLOps(e.g; MLflow, Tensorboard, Kubeflow etc)</li>\n<li>Computer Vision, Predictive Analytics, Time Series Analysis, Anomaly Detection, Recommendation Systems (Atleast 2)</li>\n<li>Generative AI, RAG, Finetuning(LoRa, QLoRa)</li>\n<li>Proficient in any of Cloud Computing Platforms (e.g., AWS, Azure, GCP)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Expertise in designing scalable and efficient model architectures.</li>\n<li>Ability to assess and forecast the financial requirements of data science projects.</li>\n<li>Strong communication skills.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>A minimum of 8 years of professional experience, with at least 6 years in a data science role.</li>\n<li>Strong knowledge of statistical modeling, machine learning, deep learning, and GenAI.</li>\n<li>Proficiency in Python and hands-on experience optimizing code for performance.</li>\n<li>Experience with data preprocessing, feature engineering, data visualization, and hyperparameter tuning.</li>\n<li>Solid understanding of database concepts and experience working with large datasets.</li>\n<li>Experience deploying and scaling machine learning models in a production environment.</li>\n<li>Familiarity with machine learning operations (MLOps) and related tools.</li>\n<li>Good understanding of Generative AI concepts and LLM finetuning.</li>\n<li>Excellent communication and collaboration skills.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current, and expected CTC details.</p>\n<p><strong>Fraud Alert:</strong></p>\n<p>Please note that Reflections Info Systems never seeks payment for jobs. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            "Machine Learning",
            "Python",
            "Generative AI"
        ],
        "summary": "Seeking a Lead Data Scientist to provide technical leadership for AI initiatives. This role involves leading a team to design and deploy machine learning models."
    },
    {
        "job_title": "QA Practice Lead (Handson, Domain Specialist)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21549",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>QA Practice Lead</h2>\n<p>Reflections Info Systems is seeking an experienced and innovative QA Practice Lead to enhance testing capabilities by designing reusable accelerators, supporting delivery teams, and forging strategic partnerships. The ideal candidate will have strong business acumen to engage with clients and prospects, identify new opportunities, and create customized proposals showcasing business value. A solid understanding of engagement models, pricing models, and experience working in a CoE environment is highly desirable.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Testing Accelerator Development and Frameworks</strong></li>\n<li>Design and build reusable testing accelerators and frameworks to improve testing efficiency and reduce time-to-market.</li>\n<li>Introduce and integrate cutting-edge testing tools, methodologies, and technologies, including AI/ML, into TCoE practices.</li>\n<li>\n<p>Drive continuous improvement by identifying gaps in existing testing processes and recommending scalable solutions.</p>\n</li>\n<li>\n<p><strong>Delivery Team Support</strong></p>\n</li>\n<li>Collaborate with delivery teams to address complex testing challenges in functional, automation, performance, and security testing domains.</li>\n<li>Provide expert guidance on tool selection, testing approaches, and problem resolution for critical projects.</li>\n<li>\n<p>Conduct training sessions and workshops to enable delivery teams to adopt advanced testing strategies.</p>\n</li>\n<li>\n<p><strong>Strategic Partnerships</strong></p>\n</li>\n<li>Establish and maintain partnerships with tool vendors, technology providers, and service organizations to strengthen the company’s testing offerings.</li>\n<li>\n<p>Evaluate and integrate new tools and platforms to stay ahead in the competitive landscape.</p>\n</li>\n<li>\n<p><strong>Client Engagement and Business Development</strong></p>\n</li>\n<li>Present TCoE capabilities to clients and prospects, highlighting innovative testing solutions and their business impact.</li>\n<li>Collaborate with account teams to uncover new opportunities for testing services within existing and prospective clients.</li>\n<li>Create customized responses to RFI/RFPs, including solution designs, value propositions, and competitive pricing models.</li>\n<li>Develop compelling pitch decks and proposals that demonstrate the ROI and strategic benefits of testing services.</li>\n<li>\n<p>Partner with sales teams to engage with stakeholders and position the company as a leader in testing services.</p>\n</li>\n<li>\n<p><strong>Understanding Engagement and Pricing Models</strong></p>\n</li>\n<li>Provide expertise on various engagement models (e.g., managed services, time and material, outcome-based models) and recommend suitable options based on client needs.</li>\n<li>\n<p>Design pricing models that align with business objectives and ensure competitiveness in the market.</p>\n</li>\n<li>\n<p><strong>Leadership and Reporting</strong></p>\n</li>\n<li>Serve as a thought leader within the TCoE, influencing the direction of the organization’s testing strategy.</li>\n<li>Have good understanding of new trends in Testing.</li>\n<li>Define KPIs and success metrics to measure the performance and adoption of testing accelerators and initiatives.</li>\n<li>Regularly report progress, key achievements, and areas for improvement to senior management.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li>12+ years of experience in software testing, with at least 5 years in test automation, test strategy, or test architecture roles.</li>\n<li>Demonstrated expertise in a specific domain (e.g., banking, finance, or retail).</li>\n<li>Proven experience leading cross-functional teams to deliver scalable and domain-aligned solutions.</li>\n<li>Prior experience working in a Testing Centre of Excellence is highly desirable.</li>\n<li>Proficiency in test automation tools (e.g., Selenium, Appium, Cypress) and performance testing tools (e.g., JMeter, LoadRunner).</li>\n<li>Experience with CI/CD pipelines, DevOps, and modern testing approaches (e.g., Agile, Shift-Left Testing).</li>\n<li>Familiarity with AI/ML-based testing solutions and testing in cloud environments.</li>\n<li>Strong understanding of engagement models and pricing strategies for testing services.</li>\n<li>Expertise in responding to RFPs/RFIs and creating compelling business value proposals.</li>\n<li>Excellent communication, presentation, and client engagement skills.</li>\n<li>Strong problem-solving, analytical thinking, and decision-making abilities.</li>\n</ul>\n<p><strong>Contact Information:</strong>\nInterested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Company Information:</strong>\nReflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "5+ Years",
            "Test Automation",
            "AI/ML Testing",
            "CI/CD"
        ],
        "summary": "Seeking a QA Practice Lead to design testing accelerators, support delivery teams, and forge strategic partnerships. Requires strong business acumen for client engagement and innovative proposal creation."
    },
    {
        "job_title": "Lead Full Stack Developer (Node JS + Angular)",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21548",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Lead Full Stack Developer (Node JS + Angular)</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\n<a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 15, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>What’s important to us:</h3>\n<p>We are seeking a Lead Full Stack Developer who will understand the need to achieve a balance between innovation and the most appropriate solution for our clients. One should be passionate about their work, eager to learn and grow, and who is committed to delivering exceptional results.</p>\n<h3>Job description:</h3>\n<ul>\n<li>Collaborate with cross-functional teams to gather and analyze project requirements, and then translate them into technical specifications and development plans.</li>\n<li>Design and develop responsive and intuitive frontend interfaces using Angular, ensuring seamless user experiences across different devices.</li>\n<li>Create and maintain robust backend APIs and services using Node.js, Express, and related technologies.</li>\n<li>Implement secure authentication and authorization mechanisms for both frontend and backend components.</li>\n<li>Write clean, modular, and efficient code that follows coding standards and best practices.</li>\n<li>Debug and troubleshoot complex issues across the application stack, ensuring optimal performance and reliability.</li>\n<li>Integrate third-party APIs and external services into the applications as needed.</li>\n<li>Work closely with UI/UX Designers to implement visually appealing and user-centric interfaces.</li>\n<li>Collaborate with other developers to conduct code reviews and maintain code quality.</li>\n<li>Mentor and assist junior developers in their technical growth and skill development.</li>\n<li>Stay updated with emerging trends and technologies in full stack development and share insights with the team.</li>\n<li>Experience in relational and non-relation databases and ability to write complex queries.</li>\n<li>Ability to understand business requirement and model it as database entities.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience)</li>\n<li>Minimum of 6 years of hands-on experience in full stack development using Angular and Node.js.</li>\n<li>Proficiency in TypeScript for frontend development and JavaScript for backend development.</li>\n<li>Strong expertise in building responsive single-page applications (SPAs) using Angular, including components, services, and state management.</li>\n<li>Experience in developing RESTful APIs and backend services using Node.js, Express, and related technologies.</li>\n<li>Familiarity with databases such as MongoDB, MySQL, or PostgreSQL.</li>\n<li>Solid understanding of version control systems, especially Git.</li>\n<li>Knowledge of frontend build tools and bundlers (e.g., Webpack, Babel).</li>\n<li>Strong problem-solving skills and the ability to tackle complex technical challenges.</li>\n<li>Excellent teamwork and communication skills.</li>\n<li>A portfolio of completed projects showcasing your proficiency in Angular and Node.js development.</li>\n<li>Experience with other frontend or backend frameworks is a plus.</li>\n</ul>",
        "tags": [
            "6+ Years",
            "Node.js",
            "Angular",
            "RESTful APIs"
        ],
        "summary": "Seeking a Lead Full Stack Developer to design and develop intuitive frontend interfaces using Angular and create robust backend APIs using Node.js. Requires 6+ years of experience."
    },
    {
        "job_title": "Dot Net Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21547",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Dot Net Architect</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong></p>\n<p>Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581</p>\n<p><a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 15, July 2025</p>\n<p><strong>Job Published:</strong> 04, July 2025</p>\n<p><strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>What’s important to us:</h3>\n<p>As a Dot Net Architect, you will play a critical role in designing and implementing complex, scalable, and high-performance solutions using .NET technology stack. You will be closely working with stakeholders, including business users, project managers, and development teams, to understand requirements and provide technical leadership throughout the software development lifecycle. Your expertise in C#, .NET, Azure, and .NET Core will be essential in delivering high-quality solutions that align with business needs.</p>\n<h3>Job Description</h3>\n<ul>\n<li>Overall experience of 12+ years in architecture and design of large-scale applications running on .NET Frameworks.</li>\n<li>Experience in working with Service-oriented Architecture (SOA) and Microservices Architecture.</li>\n<li>Good understanding in Design Patterns, Solid Principles, Clean Architecture etc.</li>\n<li>Should be competent in code Optimization techniques, Coding practices and Static code analysis tools.</li>\n<li>Strong knowledge in REST API design principles and experience in building REST API’s.</li>\n<li>Designing and developing Database architecture and structures based on business requirements.</li>\n<li>Monitor and optimize performance issues at the application and database level.</li>\n<li>Experience in relational and non-relational databases and ability to write complex queries.</li>\n<li>Ability to analyze business requirements, prepare work breakdown structure and provide technical estimates.</li>\n<li>Advises delivery team leadership on technical solutions and development of team member competencies, skills, and overall productivity.</li>\n<li>Designs and builds scalable Cloud Infrastructure using Azure.</li>\n<li>Provides guidance and leadership on designing performance solutions within a cloud platform.</li>\n<li>Responsible for implementing design patterns for distributed systems, configuring, and managing CI/CD pipelines.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience (3+ years) as a Technical Architect with a strong focus on .NET development.</li>\n<li>Experience with cloud platforms such as Azure or AWS and containerization technologies like Docker.</li>\n<li>C#, .Net Framework, .NET Core, ASP.Net, REST APIHTML5, Angular, jQuery, React, Bootstrap.</li>\n<li>MS-SQL, PostgreSQL/MySQL. Bootstrap, REST API, ASP.Net, MS-SQL, etc.</li>\n<li>WCF, Web API, REST, and Multi-tier distributed systems.</li>\n<li>Unity IoC, AutoMapper, Dapper, Enterprise Library.</li>\n<li>Azure App Services, Functions, Key Vault, Blobs etc.</li>\n<li>Microsoft Dynamics 365, Power BI.</li>\n<li>Excellent communication skills.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>",
        "tags": [
            "12+ Years",
            ".NET",
            "Azure",
            "C#"
        ],
        "summary": "We are seeking a Dot Net Architect to design and implement scalable solutions using .NET. Requires 12+ years experience, expertise in C#, .NET, and Azure."
    },
    {
        "job_title": "React Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21546",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>React Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced React.js Developer to join our global technology services and solutions company. With over 15 years of experience, we provide high-quality end-to-end IT solutions and services to clients worldwide.</p>\n<p><strong>About Techversant:</strong>\nTechversant specializes in Digital Transformation and offers expertise in various technologies, including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, and Business Intelligence.</p>\n<p><strong>What’s important to us:</strong>\nWe value innovation and seek candidates who can balance creativity with practical solutions. A willingness to learn and integrate into our team is essential. We encourage new ideas and proactive contributions to improve our approaches, processes, and technology.</p>\n<p><strong>Job description:</strong>\n- Write well-documented, clean Javascript code.\n- Implement code using Web services, Web API, REST services, HTML, and CSS.\n- Analyze user requirements and envision system features and functionality.\n- Responsible for the development, support, maintenance, and implementation of complex project modules.\n- Apply standard software development principles effectively.\n- Work independently as a team member.\n- Respond to technical queries and requests from team members and customers.\n- Manage multiple priorities and projects, defining different delivery options.</p>\n<p><strong>Preferred Skills:</strong>\n- Minimum 4+ years of relevant experience working on React-JS.\n- Minimum 1-year experience in Node.Js.\n- Fluent in Javascript and Jquery.\n- Experience in data streaming is an added advantage.\n- Good experience in Redux and related concepts/technologies.\n- Ability to engage and work productively within the team.\n- Strong troubleshooting skills and self-motivation with attention to detail and strong analytical skills.\n- Excellent interpersonal, written, and verbal communication skills.</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule (weekends off!).\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various Bonus programs (training hours, certifications, special value to business).\n- Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities.\n- Company Sponsored International Tours</p>\n<p><strong>Contact Information:</strong>\n- Email: careers@techversantinfotech.com\n- Website: http://www.techversantinfotech.com</p>",
        "tags": [
            "4+ Years",
            "ReactJS",
            "Node.js",
            "JavaScript"
        ],
        "summary": "Techversant is looking for a React Developer with 4+ years of experience. The role involves developing and maintaining complex project modules using modern web technologies."
    },
    {
        "job_title": "Angular Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21545",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Angular Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\n<a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 15, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years. Techversant provides Technology services in key areas of Digital Transformation, understanding evolving industrial scenarios, investment priorities, and technology disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>What’s important to us:</h3>\n<p>We are seeking an experienced Angular Developer. The successful applicant will understand the need to achieve a balance between innovation and the most appropriate solution for our clients. Fundamental to this role is a willingness to learn, become an integral part of the team, and adopt the languages, tools, and applications that form part of our environment.</p>\n<h3>Job description:</h3>\n<ul>\n<li>Design, implement, and support the technical solution.</li>\n<li>Participate actively in all phases of the application development lifecycle.</li>\n<li>Work with user experience designers to ensure all user interactions are implemented correctly and optimized for performance so that we can build an amazing user experience.</li>\n<li>Work within an agile group for varying degrees to deliver solutions.</li>\n<li>You will be responsible for writing server-side web application logic in JavaScript and/or variants of it.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>4+ years of experience as a developer using Angular.</li>\n<li>Experience designing, implementing, and using RESTful Web Services.</li>\n<li>Experience in Event Driven Programming</li>\n<li>Expertise in RXJS</li>\n<li>Excellent knowledge of HTML5, CSS3, cross-browser layout skills, and responsive design knowledge.</li>\n<li>Attention to detail and an ability to build reliable, scalable, and flexible software.</li>\n<li>Ability to work as an individual contributor as well as a good team player.</li>\n<li>Solid understanding of version control principles, preferably using Git.</li>\n<li>Good Communication Skills.</li>\n<li>Knowledge and experience with modern JavaScript frameworks and libraries such as AngularJS, React, D3, etc will be an added advantage.</li>\n</ul>\n<p><strong>Job location:</strong> Trivandrum/ Cochin</p>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Angular",
            "RESTful Web Services",
            "RXJS"
        ],
        "summary": "Techversant Infotech is seeking an experienced Angular Developer to design, implement, and support technical solutions. The candidate will work in an agile environment, contributing to all phases of application development."
    },
    {
        "job_title": "Node Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21544",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Node Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Design, implement, and support the technical solution.</li>\n<li>Participate actively in all phases of the application development lifecycle.</li>\n<li>Work with user experience designers to ensure all user interactions are implemented correctly and optimized for performance.</li>\n<li>Work within an agile group for varying degrees to deliver solutions.</li>\n<li>Write server-side web application logic in JavaScript and/or variants of it.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>3 years of experience as Full stack developer using Node.js and Angular.</li>\n<li>Experience designing, implementing, and using RESTful Web Services.</li>\n<li>Excellent knowledge on HTML5, CSS3, cross-browser layout skills, and responsive design knowledge.</li>\n<li>Ability to build reliable, scalable, and flexible software with attention to detail.</li>\n<li>Ability to work as individual contributor as well as a good team player.</li>\n<li>Solid understanding of version control principles, preferably using Git.</li>\n<li>Good Communication Skills.</li>\n<li>Knowledge and experience with modern JavaScript frameworks and libraries such as AngularJS, React, D3, etc. will be an added advantage</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@techversantinfotech.com</li>\n<li>Website: http://www.techversantinfotech.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 15, July 2025</p>",
        "tags": [
            "3+ Years",
            "Node.js",
            "Angular",
            "RESTful Web Services"
        ],
        "summary": "Techversant Infotech is seeking a Node Developer with 3+ years of experience. Responsibilities include designing technical solutions and developing server-side logic."
    },
    {
        "job_title": "ColdFusion Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21543",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>ColdFusion Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced ColdFusion Developer to join our team. We are a Global Technology Services and Solutions Company with over 15 years of experience, providing high-quality end-to-end IT Solutions and Services to clients across the globe. We offer expertise in multiple technology domains, including ColdFusion, Python, Java, and more.</p>\n<p><strong>Closing Date:</strong> 15, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>\n<h3>About the Role</h3>\n<p>We are looking for a candidate with a strong background in Web Application Development and a proven ability to deliver efficient, reliable, and user-friendly solutions using ColdFusion technologies.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Collaborate with cross-functional teams to gather project requirements and translate them into technical specifications and development plans.</li>\n<li>Develop, maintain, and enhance web applications using ColdFusion and related technologies.</li>\n<li>Write efficient, secure, and maintainable code following coding standards and best practices.</li>\n<li>Debug and troubleshoot issues in existing applications to ensure optimal performance and functionality.</li>\n<li>Integrate frontend interfaces with backend systems, ensuring seamless data flow and user experiences.</li>\n<li>Create and maintain databases and database interactions using SQL or other relevant technologies.</li>\n<li>Work closely with UI/UX designers to implement user-friendly and visually appealing interfaces.</li>\n<li>Conduct code reviews and ensure code quality.</li>\n<li>Stay updated with emerging trends and advancements in ColdFusion Development.</li>\n<li>Assist in planning and estimation for projects and contribute to documentation processes.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience).</li>\n<li>Minimum of 3 years of hands-on experience in web application development using ColdFusion.</li>\n<li>Proficiency in ColdFusion markup language (CFML) and ColdFusion components (CFCs).</li>\n<li>Strong expertise in frontend technologies such as HTML, CSS, and JavaScript.</li>\n<li>Experience in integrating frontend interfaces with backend systems and APIs.</li>\n<li>Familiarity with Databases and SQL queries for data manipulation and retrieval.</li>\n<li>Solid understanding of version control systems, especially Git.</li>\n<li>Strong problem-solving skills and the ability to troubleshoot and resolve complex technical issues.</li>\n<li>Excellent teamwork and communication skills.</li>\n<li>Ability to work independently and collaboratively in a fast-paced environment.</li>\n<li>A portfolio of completed projects demonstrating your ColdFusion development skills.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs.</li>\n<li>Work-life Balance: flexible work timings, early out Fridays, various social and cultural activities</li>\n<li>Company Sponsored International Tours</li>\n</ul>\n<p><strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<p><strong>Address:</strong> Techversant Infotech (P) Ltd, Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\n<strong>Website:</strong> http://www.techversantinfotech.com</p>",
        "tags": [
            "3+ Years",
            "ColdFusion",
            "SQL",
            "JavaScript"
        ],
        "summary": "Techversant Infotech is hiring a ColdFusion Developer to develop and maintain web applications. The role requires 3+ years of experience and expertise in related technologies."
    },
    {
        "job_title": "Dot Net Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21542",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Dot Net Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a proactive and results-driven Team Lead with a strong background in .NET development to provide technical leadership to a talented group of developers. Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead a team of developers and provide technical guidance, mentoring, and performance management.</li>\n<li>Lead code reviews to ensure code quality, consistency, and adherence to coding standards.</li>\n<li>Design and develop high-quality software solutions using .NET Core, Angular or React, MS SQL and Azure technologies.</li>\n<li>Collaborate with cross-functional teams to understand project requirements and translate them into technical specifications.</li>\n<li>Stay up-to-date with the latest .NET technologies, frameworks, and best practices.</li>\n<li>Troubleshoot and resolve complex technical issues across the application stack.</li>\n<li>Work closely with product managers and designers to ensure successful project delivery.</li>\n<li>Manage and prioritize project tasks, ensuring deadlines are met and milestones achieved.</li>\n<li>Architect scalable and maintainable solutions that align with the company’s technical vision.</li>\n<li>Participate in project planning, estimation, and documentation processes.</li>\n<li>Understand the code in other technology project and convert the project into dotnet project, if such requirement comes.</li>\n<li>Ready to learn new technologies.</li>\n<li>Ensures code reviews, unit testing and integration testing is completed efficiently and effectively.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in computer science, Engineering, or a related field (or equivalent practical experience).</li>\n<li>Minimum 7+ years of experience in the dotnet technology.</li>\n<li>Fluent in English</li>\n<li>Proficiency in .NET Core, C#, ASP.NET MVC, Web API.</li>\n<li>Strong expertise in frontend technologies including Angular or React, TypeScript, HTML, CSS and JavaScript.</li>\n<li>Experience in implementing design patterns and solid principles.</li>\n<li>Experience in cloud technologies, particularly Azure services (e.g., Azure App Service, Azure Functions).</li>\n<li>Knowledge in the Azure DevOps will add more value to the role.</li>\n<li>Experience in leading development teams and providing technical guidance.</li>\n<li>Knowledge in NoSQL database will be an added advantage</li>\n<li>Excellent problem-solving skills and the ability to troubleshoot complex technical challenges.</li>\n<li>Strong communication skills and the ability to collaborate effectively with cross-functional teams.</li>\n<li>Familiarity with version control systems, especially Git.</li>\n<li>Ability to balance technical leadership and hands-on development.</li>\n<li>Ability to work as an individual contributor.</li>\n<li>Proven ability to manage project tasks, priorities, and deadlines.</li>\n<li>Experience with Agile methodologies like scrum and practices is a plus.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>",
        "tags": [
            "7+ Years",
            ".NET Core",
            "Angular",
            "Azure"
        ],
        "summary": "Techversant Infotech is hiring a .NET Team Lead to guide developers and design software solutions using .NET Core, Angular, and Azure. The role requires 7+ years of experience and leadership skills."
    },
    {
        "job_title": "Senior Software Engineer- Dot Net",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21541",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Senior Software Engineer - .NET</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a proactive and results-driven Senior Software Engineer with a strong background in .NET development to join our team. As a global technology services and solutions company with over 15 years of experience, Techversant provides high-quality end-to-end IT solutions to clients worldwide.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead a team of developers and provide technical guidance, mentoring, and performance management.</li>\n<li>Lead code reviews to ensure code quality, consistency, and adherence to coding standards.</li>\n<li>Design and develop high-quality software solutions using .NET Core, Angular or React, MS SQL and Azure technologies</li>\n<li>Collaborate with cross-functional teams to understand project requirements and translate them into technical specifications.</li>\n<li>Stay up-to-date with the latest .NET technologies, frameworks, and best practices.</li>\n<li>Troubleshoot and resolve complex technical issues across the application stack.</li>\n<li>Work closely with product managers and designers to ensure successful project delivery.</li>\n<li>Manage and prioritize project tasks, ensuring deadlines are met and milestones achieved.</li>\n<li>Architect scalable and maintainable solutions that align with the company’s technical vision.</li>\n<li>Participate in project planning, estimation, and documentation processes.</li>\n<li>Should take effort to understand the code in other technology project and convert the project into dotnet project, if such requirement comes.</li>\n<li>Ready to learn new technologies.</li>\n<li>Ensures code reviews, unit testing and integration testing is completed efficiently and effectively.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science, Engineering, or a related field (or equivalent practical experience).</li>\n<li>Minimum 7+ years of experience in the dotnet technology.</li>\n<li>Fluent in English</li>\n<li>Proficiency in .NET Core, C#, ASP.NET MVC, Web API.</li>\n<li>Strong expertise in frontend technologies including Angular or React, TypeScript, HTML, CSS and JavaScript.</li>\n<li>Experience in implementing design patterns and solid principles.</li>\n<li>Experience in cloud technologies, particularly Azure services (e.g., Azure App Service, Azure Functions).</li>\n<li>Knowledge in the Azure Devops will add more value to the role.</li>\n<li>Experience in leading development teams and providing technical guidance.</li>\n<li>Knowledge in NoSQL database will be an added advantage</li>\n<li>Excellent problem-solving skills and the ability to troubleshoot complex technical challenges.</li>\n<li>Strong communication skills and the ability to collaborate effectively with cross-functional teams.</li>\n<li>Familiarity with version control systems, especially Git.</li>\n<li>Ability to balance technical leadership and hands-on development.</li>\n<li>Ability to work as an individual contributor.</li>\n<li>Proven ability to manage project tasks, priorities, and deadlines.</li>\n<li>Experience with Agile methodologies like scrum and practices is a plus.</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>",
        "tags": [
            "7+ Years",
            ".NET Core",
            "Angular/React",
            "Azure"
        ],
        "summary": "Techversant Infotech is hiring a Senior Software Engineer (.NET) to lead a development team. The role involves designing and developing high-quality software solutions using .NET technologies."
    },
    {
        "job_title": "Internship-Telesales",
        "company": "Septa Milles (P) Ltd (Lifology)",
        "url": "https://technopark.org/job-details/21540",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Telesales Internship - Lifology</h2>\n<p><strong>Lifology</strong>, a Guinness World Record-winning career guidance organization, is offering an exciting telesales internship opportunity. This is a <strong>paid internship</strong> for motivated individuals eager to start their sales career.</p>\n<p><strong>Contact Information:</strong>\n*   Email: <a href=\"mailto:nidhi@lifology.com\">nidhi@lifology.com</a>\n*   Website: <a href=\"http://www.lifology.com\">http://www.lifology.com</a></p>\n<p><strong>Location:</strong>\nM SQUARED BUILDING,\nTECHNOPARK CAMPUS,\nKARIYAVATTOM,\nTRIVANDRUM, KERALA - 695581</p>\n<p><strong>Key Dates:</strong>\n*   Closing Date: July 25, 2025\n*   Published Date: July 4, 2025</p>\n<p><strong>What You’ll Be Doing:</strong>\n- Contacting potential or existing customers to inform them about our products or services using scripts.\n- Answering customer questions about products or the company.\n- Entering and updating customer information in our database.\n- Keeping records of calls and sales, and noting useful information.\n- Engaging potential clients and closing business deals.\n- Contributing to a fast-paced, target-driven environment.</p>\n<p><strong>What We Offer:</strong>\n- Competitive pay during the internship.\n- Hands-on experience in sales.\n- Opportunities for growth within the company.</p>\n<p><strong>Requirements and Skills:</strong>\n- Ability to learn about products and services and explain them to prospects.\n- Excellent communication skills in English.\n- Cool-tempered and able to handle rejection.\n- Outstanding negotiation skills with the ability to resolve issues and address complaints.\n- Strong communication skills, positive attitude, and eagerness to learn.</p>\n<p><strong>How to Apply:</strong>\nShare your resume with us at <a href=\"mailto:nidhi@lifology.com\">nidhi@lifology.com</a> to take the first step toward a successful career in sales.</p>\n<p>Jumpstart your career with Lifology and thrive in a supportive, growth-oriented environment!</p>",
        "tags": [
            "Entry Level",
            "Telesales",
            "Communication Skills",
            "Negotiation Skills"
        ],
        "summary": "Lifology is seeking a telesales intern to contact customers, answer questions and close deals. This paid internship offers hands-on experience and growth opportunities within the company."
    },
    {
        "job_title": "Senior QA Engineer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21539",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Senior QA Engineer</h2>\n<p>Way.Com India Pvt Ltd is seeking a proactive and detail-focused Senior QA Automation Engineer with a solid background in Java and practical experience in test automation. The ideal candidate should be adept at interpreting complex business requirements and transforming them into effective, well-structured test strategies and cases.</p>\n<p><strong>Responsibilities and Requirements:</strong></p>\n<ul>\n<li>5+ years of experience in test automation using Java, with a strong foundation in designing, developing, and maintaining robust and scalable test automation frameworks.</li>\n<li>In-depth knowledge of Core Java, including solid understanding of object-oriented principles, exception handling, multi-threading, and File handling.</li>\n<li>Proficient in Java Collections Frameworks (Lists, Sets, Maps, Queues), DSA with the ability to write efficient, optimized, and maintainable code for complex scenarios.</li>\n<li>Demonstrated ability to comprehend and break down complex business requirements, identify key testing scenarios, and design end-to-end functional test cases that ensure high coverage and quality.</li>\n<li>Hands-on experience with Selenium WebDriver, including advanced features like handling dynamic elements, custom wait conditions, and cross-browser testing.</li>\n<li>Experience in REST API testing using Rest Assured, including Request modelling, authentication mechanisms, and integration with automation suites.</li>\n<li>Exposure to Jenkins or other CI/CD tools, with experience integrating automated test suites into pipelines for continuous feedback and faster releases.</li>\n<li>Familiarity with load and performance testing tools such as JMeter, K6, Locust or similar, and the ability to analyze bottlenecks and suggest improvements.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Way Dot Com (P) Ltd\nWay.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram , 695583 , 695583\nhttp://www.way.com\nContact Email: careers@way.com</p>\n<p>Closing Date: 11, July 2025\nJob Published: 04, July 2025</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Selenium WebDriver",
            "Rest Assured"
        ],
        "summary": "Way.com is looking for a Senior QA Automation Engineer to design and implement effective test automation strategies. The role requires expertise in Java, Selenium, and API testing."
    },
    {
        "job_title": "Oracle DBA",
        "company": "E Team Informatica India (P) Ltd",
        "url": "https://technopark.org/job-details/21538",
        "location": "Technopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Oracle DBA</h2>\n<p>E-Team Informatica India (P) Ltd, a subsidiary of Gruppo Zenit, is seeking an experienced Oracle DBA to join our team in Technopark, Trivandrum. We offer software solutions and IT services to major clients primarily in Europe. We focus on digital and infrastructure transformation, providing comprehensive support throughout the entire application lifecycle, including maintenance services.</p>\n<p><strong>Contact:</strong> careers@eteamindia.com</p>\n<p><strong>Website:</strong> http://www.gruppozenit.com</p>\n<p><strong>Closing Date:</strong> 30, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Strong DBA skills and relevant working experience with Oracle Database 11gc/12c/18c/19C environments.</li>\n<li>Experience in installation, configuration administration on UNIX environments to support Oracle DB with RAC, RMAN, Dataguard.</li>\n<li>Experience in Oracle DB Performance Tuning.</li>\n<li>Expertise in analyzing AWR, ADDM, ASH &amp; TKPROF.</li>\n<li>Experience in Clusterware (GRID Infrastructure) - CRS management, RAC Administration, ASM, Dataguard administration, Backup &amp; Recovery.</li>\n<li>Knowledge in DB Upgrades, Patching Tasks.</li>\n<li>Knowledge in using backup tools like CommVault is an added advantage.</li>\n<li>Experience in Unix/Linux including basic commands and shell scripting.</li>\n<li>Critical events SLA management and response.</li>\n<li>Strong Experience in Oracle DB Performance Tuning &amp; Query Optimization skills.</li>\n<li>Experience in Oracle cloud control configuration and management.</li>\n<li>Oracle application management knowledge is an added advantage.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>ORACLE CERTIFICATION: OCP 11g or OCP 10g</li>\n<li>Added preference will be given to the Candidate who has ITIL v3 certificate and who can coordinate a team</li>\n<li>Good Communication Skills in English is a must.</li>\n<li>Should have good attitude towards work and should be a good team player.</li>\n<li>Knowledge in any monitoring software is an added advantage.</li>\n</ul>\n<p><strong>Important Note:</strong> Please mention the Post you are applying with Experience / Current Location in the subject line of your application.</p>\n<h3>Job Profile:</h3>\n<ul>\n<li><strong>Role:</strong> Database Administrator</li>\n<li><strong>Industry Type:</strong> IT Services &amp; Consulting</li>\n<li><strong>Functional Area:</strong> Engineering - Software</li>\n<li><strong>Employment Type:</strong> Full Time, Permanent</li>\n<li><strong>Position Type:</strong> 24/7</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Oracle DBA",
            "Performance Tuning",
            "RAC"
        ],
        "summary": "Seeking an Oracle DBA to manage Oracle databases and ensure optimal performance. Responsibilities include installation, configuration, performance tuning, and maintaining database environments."
    },
    {
        "job_title": "Manager, Digital Services Sales - MS30092402",
        "company": "Zyxware Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21537",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Manager, Digital Services Sales</h2>\n<p>Zyxware Technologies is seeking a highly motivated Sales Manager to join our Sales team. This role is responsible for generating revenue from assigned geographies by identifying potential new customers, presenting our brand, and building long-term client relationships.</p>\n<p><strong>Contact:</strong> careers@zyxware.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute sales strategies to achieve target revenue and margins.</li>\n<li>Sales planning and accurate forecasting, including identifying potential accounts, sizing opportunities, and GTM planning.</li>\n<li>Determine clients' needs through a consultative selling approach.</li>\n<li>Manage the end-to-end buying cycles of clients.</li>\n<li>Manage sales pipeline, ensuring it is full of qualified leads &amp; prospects.</li>\n<li>Present the organization's values, commitments, knowledge, and capabilities to clients and at events.</li>\n<li>Manage revenue booking and collections, maintain reports, and minimize payment defaults.</li>\n<li>Manage escalations from client accounts.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li>A graduate degree in engineering or computer science (MBA preferred).</li>\n<li>Familiarity with frameworks and tools for understanding markets and international trade.</li>\n<li>Ability to construct value chains and define industry structure.</li>\n<li>Experience in developing and executing a sales plan that addresses market realities.</li>\n<li>Experience in designing and executing a sales process that resonates with mid-sized and large businesses.</li>\n<li>Experience in partnering with HR to build a sales team.</li>\n<li>Consistent track record of revenue generation, risk management, and ability to access new markets.</li>\n<li>Experience in handling B2B clients from US/Europe/UK/ME/APAC regions.</li>\n<li>Knowledge of Google Workspace / MS Office, CRM, and Bid Management.</li>\n<li>Candidates with US Business Visa preferred.</li>\n<li>Strong communication &amp; presentation skills (written and oral).</li>\n<li>Prior experience in dealing with decision-makers in service sectors.</li>\n<li>5+ years of relevant international sales experience in IT or Digital Services.</li>\n</ul>\n<p><strong>To Apply:</strong></p>\n<p>Mail your resume with the subject ‘Application for the post of Manager, Digital Services Sales (MS30092402) to careers@zyxware.com.</p>\n<p><strong>Company Information:</strong>\nZyxware Technologies (P) Ltd\nSBC 2205, II Floor, Yamuna Building, Technopark Phase III, Trivandrum , 695583\nhttp://www.zyxware.com</p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "5+ Years",
            "B2B Sales",
            "CRM",
            "Digital Services"
        ],
        "summary": "Seeking a Sales Manager to generate revenue by identifying new customers and building client relationships. Requires 5+ years of international sales experience in IT or Digital Services."
    },
    {
        "job_title": "Social Media Executive",
        "company": "Srs Global Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21536",
        "location": "Technopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Social Media Executive</h2>\n<p><strong>SRS Global Technologies (P) Ltd</strong>\n1 level Floor, Thejaswini Building,\nTechnopark, Karyavattom PO,\nThirivananthapuram, Kerala, 695581\n<a href=\"https://srsglobaltechnologies.com\">https://srsglobaltechnologies.com</a></p>\n<p><strong>Closing Date:</strong> 14, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> ananthu.m@srswebsolutions.in</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage and grow the company's social media presence across platforms (Facebook, LinkedIn, Instagram, etc.).</li>\n<li>Create and maintain a social media calendar; coordinate with the creative team for timely post delivery.</li>\n<li>Engage with audiences in relevant Facebook and LinkedIn groups to generate qualified inquiries.</li>\n<li>Research and use social media tools to support the company’s digital strategy.</li>\n<li>Monitor, respond to, and report on online reviews and feedback.</li>\n<li>Track social media performance and generate insights to improve ROI.</li>\n<li>Stay updated on the latest trends, tools, and best practices in social media.</li>\n<li>Develop and implement a cohesive social media strategy aligned with business objectives.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>1–3 years of experience in social media marketing or a related field.</li>\n<li>Strong written and verbal communication skills.</li>\n<li>Experience with social media tools, analytics, and email platforms.</li>\n<li>Ability to work independently and collaborate with cross-functional teams.</li>\n<li>Creativity, attention to detail, and a proactive approach.</li>\n<li>Knowledge of email marketing and SEO will be considered an added advantage.</li>\n<li>Proficiency in AI-based tools (e.g., ChatGPT, Canva AI, etc.) for content creation and productivity.</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Social Media Marketing",
            "Social Media Tools",
            "Content Creation"
        ],
        "summary": "Seeking a Social Media Executive to manage and grow the company's online presence. The role involves creating content, engaging audiences, and implementing social media strategies."
    },
    {
        "job_title": "Data Scientist",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21535",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Data Scientist</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\n<a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p>Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption. We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>What’s important to us:</strong>\nWe are seeking experienced Data Scientist Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Key Responsibilities:</strong>\n- Collect, clean, and analyze data from various sources (e.g., databases, spreadsheets, APIs)\n- Build dashboards and reports using tools like Power BI, Tableau, or similar tools\n- Identify, analyze, and interpret trends or patterns in complex datasets\n- Collaborate with stakeholders to understand data requirements and deliver actionable insights\n- Create and maintain documentation on data sources, methodologies, and definitions\n- Support A/B testing and statistical analyses for experiments and business strategies\n- Ensure data accuracy and integrity in reporting and analysis</p>\n<p><strong>Preferred Skills:</strong>\n- Proficiency in SQL and experience with data visualization tools (e.g., Tableau, Power BI, or similar)\n- Strong Excel/Google Sheets skills\n- Strong analytical thinking and problem-solving skills\n- Excellent communication skills, both written and verbal\n- 4+ Yrs of experience as data scientist.</p>\n<p><strong>Preferred Qualifications:</strong>\n- Experience working with large datasets\n- Knowledge of statistical techniques and concepts (e.g., regression, distributions, forecasting)\n- Experience with data warehousing and ETL processes</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours</p>",
        "tags": [
            "4+ Years",
            "SQL",
            "Power BI",
            "Tableau"
        ],
        "summary": "Techversant Infotech is seeking a Data Scientist to analyze data, build dashboards, and provide actionable insights. The role involves statistical analysis and collaboration with stakeholders."
    },
    {
        "job_title": "Office Administrator (EdTech)",
        "company": "Juniordec25 (P) Ltd",
        "url": "https://technopark.org/job-details/21534",
        "location": "Technopark",
        "closing_date": "08 Jul 2025",
        "job_description": "<h2>Office Administrator (EdTech) - Walk-In</h2>\n<p><strong>JUNIORDEC25 (P) Ltd</strong> - Trivandrum, Kerala</p>\n<p>We are an EdTech company in Trivandrum's Technopark seeking an Office Administrator to join our growing team. This is a walk-in opportunity.</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> 08, July 2025\n*   <strong>Time:</strong> 10:30:00 to 14:00:00\n*   <strong>Venue:</strong> JUNIORDEC25 PVT LTD, Ground Floor, Carnival Technopark, Technopark Campus, Thiruvananthapuram, Kerala 695581</p>\n<p><strong>Responsibilities:</strong>\n- Manage phone calls, emails, and correspondence, leaving a positive impression.\n- Maintain and update student information systems, educational resource databases, and filing systems.\n- Assist in scheduling appointments, meetings, and travel arrangements.\n- Coordinate and support office operations like data management and handling deliveries.\n- Help organize company events and meetings (workshops, webinars).\n- Ensure adherence to company policies and procedures.</p>\n<p><strong>Preferred Skills:</strong>\n- Excellent communication skills.\n- Strong attention to detail and organizational skills.\n- Ability to multitask and prioritize tasks effectively.\n- Knowledge of general office procedures and operations.\n- Positive attitude and willingness to learn.\n- General computer knowledge, including software applications and basic hardware understanding.</p>\n<p><strong>How to Apply:</strong>\nInterested candidates, share your updated resume with hr@scalevel.in with the subject line \"Office Administrator.\"</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\n*   <a href=\"link\">Click here to download the Mobile App for Android</a>\n*   <a href=\"link\">Click here to download the Mobile App for iOS</a></p>\n<p><strong>Website URL:</strong>\n<a href=\"vms.technopark.org\">vms.technopark.org</a></p>\n<p><a href=\"link\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Contact Email:</strong> hr@scalevel.in\n<strong>Website:</strong> https://www.juniordec25.com</p>",
        "tags": [
            "0-1 Year",
            "Communication Skills",
            "Office Administration",
            "Data Management"
        ],
        "summary": "Seeking an Office Administrator for an EdTech company in Trivandrum. Responsibilities include office management, coordination, and supporting company events."
    },
    {
        "job_title": "User Experience Designer - UX02042401",
        "company": "Zyxware Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21533",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>User Experience Designer</h2>\n<p><strong>Zyxware Technologies (P) Ltd</strong>\nSBC 2205, II Floor, Yamuna Building, Technopark Phase III, Trivandrum, 695583\n<a href=\"http://www.zyxware.com\">http://www.zyxware.com</a></p>\n<p><strong>Job Code:</strong> UX02042401</p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 04, July 2025</p>\n<p><strong>Contact Email:</strong> <a href=\"mailto:careers@zyxware.com\">careers@zyxware.com</a></p>\n<h3>Brief Description</h3>\n<p>As a User Experience Designer in the Digital Consulting team, you will work closely with potential clients during the sales cycle and ongoing engagements. You will design and deliver high-quality User Experiences for the end-users of the products/solutions we develop. You are expected to understand the client's vertical and the end-users of the product/solution. This opportunity is for a UX Designer looking to make a mark in digital transformation. As a User Experience Designer at Zyxware Technologies, you will be primarily responsible for the UX designs proposed to clients.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Gather and evaluate user requirements in collaboration with business analysts, functional consultants, and engineers.</li>\n<li>Conduct user research to understand the target audience.</li>\n<li>Create UI concepts for selling to clients as part of presales.</li>\n<li>Illustrate design ideas using storyboards, process flows, and sitemaps.</li>\n<li>Design graphic user interface elements, like menus, tabs, and widgets.</li>\n<li>Build page navigation buttons and search fields.</li>\n<li>Develop UI mockups and prototypes that clearly illustrate how sites function and look.</li>\n<li>Create original graphic designs (e.g., images, sketches, and tables).</li>\n<li>Prepare and present rough drafts to internal teams and key stakeholders.</li>\n<li>Identify and troubleshoot UX problems (e.g., responsiveness).</li>\n<li>Conduct layout adjustments based on user feedback.</li>\n<li>Adhere to style standards on fonts, colors, and images.</li>\n<li>Train and mentor team members.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Skills Required:</strong></p>\n<ul>\n<li><strong>Education:</strong> Bachelor of Design (B.Des)</li>\n<li>3+ years of proven work experience as a UI/UX Designer or similar role.</li>\n<li>Good knowledge in web standards - accessibility, Semantic web etc.</li>\n<li>Good understanding of how Grid systems, HTML/CSS frameworks like bootstrap, foundation etc works. (hands-on experience desirable, but not mandatory)</li>\n<li>Knowledge in designing themes for CMS systems (Drupal, WordPress, Magento etc) is a good skill to have.</li>\n<li>Portfolio of design projects.</li>\n<li>Up-to-date knowledge of wireframe/prototyping tools. (e.g., Axure, InVision)</li>\n<li>Up-to-date knowledge of design software like Adobe Illustrator, Sketch, Photoshop</li>\n<li>Team spirit; strong communication skills to collaborate with various stakeholders</li>\n<li>Good time-management skills</li>\n</ul>\n<p>If you meet the above requirements, please mail your resume with the subject ‘Application for the post of User Experience Designer (UX02042401) to <a href=\"mailto:careers@zyxware.com\">careers@zyxware.com</a>.</p>",
        "tags": [
            "3+ Years",
            "UI/UX Design",
            "Wireframing",
            "Prototyping"
        ],
        "summary": "Zyxware Technologies is seeking a User Experience Designer to collaborate with clients, design user interfaces, and solve UX problems. The candidate will create innovative design solutions."
    },
    {
        "job_title": "Senior Business Analyst- BA15022401",
        "company": "Zyxware Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21532",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Senior Business Analyst - BA15022401</h2>\n<p><strong>Zyxware Technologies (P) Ltd</strong> is seeking a Senior Business Analyst to review, analyze, and evaluate business systems and user needs. The ideal candidate will be responsible for generating required solutions, defining scope and objectives, and formulating solutions to implement business strategies. This role is crucial for understanding the needs to address business challenges across various digital/e-commerce initiatives. The role involves reviewing assigned business processes end-to-end to identify and address operational, financial, and technological risks in the digital marketing and e-commerce sectors.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Partner with customers, the digital marketing team, and engineering teams to maintain a cohesive design and experience throughout our solution offerings.</li>\n<li>Demonstrate expertise in Information Systems within Zyxware's verticals and apply this to develop, execute, and improve action plans.</li>\n<li>Support and align efforts to meet customer and business needs.</li>\n<li>Manage customer relationships and expectations through effective communication.</li>\n<li>Stay current with customer needs and strategies, utilizing formal and informal communication methods.</li>\n<li>Lead or participate in multiple projects, managing project scope, schedules, and ensuring on-time delivery.</li>\n<li>Provide leadership to team members and peers, fostering collaboration and accountability.</li>\n<li>Coach, mentor, motivate, and supervise the team.</li>\n<li>Identify, create, and facilitate process design changes, focusing on quality improvement and data management.</li>\n<li>Provide and support the implementation of business solutions by building relationships with key stakeholders.</li>\n<li>Provide project-level analysis and documentation (business requirements, scope matrix, use cases, etc.).</li>\n<li>Collaborate with developers to implement requirements and guide testers during the QA process.</li>\n<li>Identify improvement opportunities (proactive and reactive).</li>\n<li>Elicit and clearly document business and systems requirements.</li>\n<li>Assess business process and system inefficiencies.</li>\n<li>Identify ways to increase adoption and customer satisfaction.</li>\n<li>Demonstrate fluency in business processes and process differentiation.</li>\n<li>Analyze and synthesize business requirements, recognizing patterns and conceptualizing processes.</li>\n<li>Understand and negotiate needs and expectations of multiple stakeholders.</li>\n<li>Serve as a liaison between Operations and IT.</li>\n<li>Assist with and test implementation for payer and vendor relationships.</li>\n<li>Create and maintain issue logs, meeting minutes, project schedules, and updates.</li>\n<li>Develop and execute test plans with customers for solution acceptance.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5+ years of experience working on large-scale digital marketing or e-commerce projects.</li>\n<li>Experience in building solutions in digital marketing or e-commerce sectors.</li>\n<li>Experience with Content Management (Drupal, WordPress, Magento).</li>\n<li>Experience in building solutions on behalf of customer requirements (Out of the box, Custom build etc.).</li>\n<li>Experienced in providing use cases around the latest changes in market (technology, business domains).</li>\n<li>Experienced in multiple tools like JIRA, Trello, Redmine, Draw.io, Visio, Google Drive, Google Analytics, Lucidchart, Pencil, Invision, Zeplin, etc.</li>\n<li>Strong critical thinking and analytical skills.</li>\n<li>Strong time management skills.</li>\n<li>Ability to analyze and document complex business processes.</li>\n<li>Ability to make effective decisions under pressure.</li>\n<li>Ability to think analytically and should be a problem solver.</li>\n<li>Ability to communicate and collaborate with personnel at all levels.</li>\n<li>Ability to work with minimal supervision.</li>\n<li>Applicable knowledge of the technologies used by the team.</li>\n<li>Strong facilitation skills.</li>\n<li>Motivates the team to work together efficiently.</li>\n<li>Build, develop, and grow relationships with the project team.</li>\n<li>Experience with agile/scrum techniques (CSPO/PSPO 2 certification preferred).</li>\n<li>CBAP, CCBA certification preferred.</li>\n</ul>\n<p><strong>Additional Competencies:</strong></p>\n<ul>\n<li>Critical thinking and problem-solving.</li>\n<li>Excellent decision-making and leadership capabilities.</li>\n<li>Conflict resolution experience &amp; an excellent team player.</li>\n<li>Adaptability and ability to tolerate stress.</li>\n<li>Client management capabilities with leadership traits.</li>\n<li>Experience in Agile methodologies and building Continuous Delivery, High Availability designs with DevOps.</li>\n</ul>\n<p><strong>Qualification:</strong></p>\n<ul>\n<li>MBA or equivalent from a reputed institution. Preference for candidates from top 100 NIRF-ranked institutions in India. A B.Tech or B.E undergraduate degree is also valued.</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If you meet the above requirements, please mail your resume with the subject ‘Application for the post of Senior Business Analyst (BA15022401)’ to careers@zyxware.com.</p>\n<p><strong>Zyxware Technologies (P) Ltd</strong>\nSBC 2205, II Floor, Yamuna Building, Technopark Phase III, Trivandrum, 695583\nhttp://www.zyxware.com</p>",
        "tags": [
            "5+ Years",
            "Digital Marketing",
            "E-commerce",
            "JIRA"
        ],
        "summary": "Zyxware Technologies seeks a Senior Business Analyst to enhance digital/e-commerce solutions. This role involves analyzing systems, defining strategies, and ensuring alignment with business needs."
    },
    {
        "job_title": "Odoo Technical Developer",
        "company": "Azinova Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/21531",
        "location": "Technopark",
        "closing_date": "20 Jul 2025",
        "job_description": "<h2>Odoo Technical Developer</h2>\n<p><strong>Azinova Technologies (P) Ltd</strong>\nC-14b, Basement Floor 2, Thejaswini, Technopark, Trivandrum, 695581\nhttp://www.azinovatechnologies.com</p>\n<p><strong>Closing Date:</strong> 20, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> careers@azinova.info</p>\n<p>We are looking for a skilled Odoo Technical Developer with 3+ years of hands-on experience to join our growing development team. You will be responsible for designing, customizing, and implementing Odoo ERP modules to meet business requirements. The ideal candidate has solid Python skills and experience working with the Odoo framework and its modular architecture.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and customize Odoo modules using Python, XML, and QWeb.</li>\n<li>Modify existing Odoo modules and create new modules based on functional requirements.</li>\n<li>Collaborate with functional consultants to translate business needs into technical solutions.</li>\n<li>Develop and maintain APIs and integrations with third-party systems.</li>\n<li>Work with front-end technologies to create user-friendly interfaces in Odoo.</li>\n<li>Perform data migration and version upgrades of the Odoo platform.</li>\n<li>Debug issues and provide technical support for existing Odoo implementations.</li>\n<li>Optimize performance and ensure code quality through best practices.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>3+ years of experience as an Odoo Developer (technical).</li>\n<li>Proficient in Python, XML, QWeb, PostgreSQL, and JavaScript.</li>\n<li>Solid understanding of Odoo architecture, ORM, and MVC framework.</li>\n<li>Experience with core Odoo modules such as Sales, Inventory, Accounting, CRM, and HR.</li>\n<li>Familiar with Git version control and collaborative development workflows.</li>\n<li>Experience with API integration (REST/JSON).</li>\n<li>Ability to work independently and manage tasks effectively.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Odoo",
            "Python",
            "XML"
        ],
        "summary": "Azinova Technologies is seeking an Odoo Technical Developer to design, customize, and implement Odoo ERP modules. The role involves using Python, XML, and QWeb to meet business needs."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/21530",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Odoo Developer</h2>\n<p><strong>PromptTech Global (P) Ltd</strong> is seeking a skilled Odoo Developer with hands-on experience in the implementation, customization, and maintenance of various Odoo modules. The ideal candidate will have a strong understanding of the Odoo framework and the ability to configure and optimize modules to support critical business functions.</p>\n<p><strong>About Us:</strong>\nPromptTech is a visionary organization empowering global small and medium enterprises with innovative technologies and expertise. We optimize operations, enhance customer experiences, and drive growth. Our commitment to quality ensures reliable services that exceed expectations. Our domain expertise lies in Business Process Integration, InsurTech Solutions, and Business Support Services.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and implement Odoo solutions across key modules.</li>\n<li>Customize Odoo modules to meet unique client needs while ensuring seamless integration and operational efficiency.</li>\n<li>Work with internal teams and clients to gather requirements, provide technical support, and develop effective implementation strategies.</li>\n<li>Perform debugging and resolve technical issues within the Odoo ecosystem to maintain system performance and reliability.</li>\n<li>Conduct routine audits and manage updates to ensure optimal system performance.</li>\n<li>Provide training and support to users for effective utilization of Odoo modules.</li>\n<li>Provide complete &amp; professional documentation for tasks needing development.</li>\n<li>Analyze customers’ needs and business processes in order to map them properly with Odoo.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong proficiency in Python, JavaScript, XML, and SQL.</li>\n<li>Hands-on experience with Odoo's core framework.</li>\n<li>Excellent problem-solving skills and a customer-focused approach.</li>\n<li>Strong ability to communicate effectively with team members and clients.</li>\n</ul>\n<p><strong>Required Experience:</strong>\n- Minimum 3 years</p>\n<p><strong>Contact Information:</strong>\nModule No 315,\nNila Building,\nTechnopark Campus, 695581\nhttps://prompttechsolutions.com\nContact Email: hr@prompttechglobal.com</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "3+ Years",
            "Odoo",
            "Python",
            "JavaScript"
        ],
        "summary": "PromptTech Global is looking for an Odoo Developer to customize and maintain Odoo modules. The role involves designing solutions, debugging, and providing user support."
    },
    {
        "job_title": "Senior AI Engineer/ Data Analyst",
        "company": "Appfabs Innovation (P) Ltd",
        "url": "https://technopark.org/job-details/21529",
        "location": "Technopark",
        "closing_date": "18 Aug 2025",
        "job_description": "<h2>Senior AI Engineer/ Data Analyst</h2>\n<p><strong>Appfabs Innovation (P) Ltd</strong> is seeking a versatile and highly skilled Senior Data Analyst / AI Engineer to join our innovative team. This unique role combines the strengths of a data scientist with the capabilities of an AI engineer, allowing you to dive deep into data, extract meaningful insights, and then build and deploy cutting-edge Machine Learning, Deep Learning, and Generative AI models. You will play a crucial role in transforming raw data into strategic assets and intelligent applications.</p>\n<p><strong>Experience Required:</strong> 3 years to 6 years</p>\n<p><strong>Location:</strong> Appfabs Innovation, Technopark, TVM</p>\n<p><strong>Open Positions:</strong> 6</p>\n<p><strong>Employment Type:</strong> Full-Time</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Data Analysis &amp; Insight Generation:</strong></li>\n<li>Perform in-depth Exploratory Data Analysis (EDA) to identify trends, patterns, and anomalies in complex datasets.</li>\n<li>Clean, transform, and prepare data from various sources for analysis and model development.</li>\n<li>Apply statistical methods and hypothesis testing to validate findings and support data-driven decision-making.</li>\n<li>\n<p>Create compelling and interactive BI dashboards (e.g., Power BI, Tableau) to visualize data insights and communicate findings to stakeholders.</p>\n</li>\n<li>\n<p><strong>Machine Learning &amp; Deep Learning Model Development:</strong></p>\n</li>\n<li>Design, build, train, and evaluate Machine Learning models (e.g., regression, classification, clustering) to solve specific business problems.</li>\n<li>Develop and optimize Deep Learning models, including CNNs for computer vision tasks and Transformers for Natural Language Processing (NLP).</li>\n<li>\n<p>Implement feature engineering techniques to enhance model performance.</p>\n</li>\n<li>\n<p><strong>Generative AI Implementation:</strong></p>\n</li>\n<li>Explore and experiment with Large Language Models (LLMs) and other Generative AI techniques.</li>\n<li>Implement and fine-tune LLMs for specific use cases (e.g., text generation, summarization, Q&amp;A).</li>\n<li>Develop and integrate Retrieval Augmented Generation (RAG) systems using vector databases and embedding models.</li>\n<li>Apply Prompt Engineering best practices to optimize LLM interactions.</li>\n<li>Contribute to the development of Agentic AI systems that leverage multiple tools and models.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li><strong>Data Science &amp; Analytics:</strong></li>\n<li>Strong proficiency in Python and its data science libraries (Pandas, NumPy, Scikit-learn, Matplotlib, Seaborn).</li>\n<li>Proven experience with Exploratory Data Analysis (EDA) and statistical analysis.</li>\n<li>Hands-on experience developing BI Dashboards using tools like Power BI or Tableau.</li>\n<li>\n<p>Understanding of data warehousing and data lake concepts.</p>\n</li>\n<li>\n<p><strong>Machine Learning:</strong></p>\n</li>\n<li>Solid understanding of various ML algorithms (e.g., Regression, Classification, Clustering, Tree-based models).</li>\n<li>\n<p>Experience with model evaluation, validation, and hyperparameter tuning.</p>\n</li>\n<li>\n<p><strong>Deep Learning:</strong></p>\n</li>\n<li>Proficiency with Deep Learning frameworks such as TensorFlow, Keras, or PyTorch.</li>\n<li>Experience with CNNs (Convolutional Neural Networks) and computer vision concepts (e.g., OpenCV, object detection).</li>\n<li>\n<p>Familiarity with Transformer architectures for NLP tasks.</p>\n</li>\n<li>\n<p><strong>Generative AI:</strong></p>\n</li>\n<li>Practical experience with Large Language Models (LLMs).</li>\n<li>Understanding and application of RAG (Retrieval Augmented Generation) systems.</li>\n<li>Experience with Fine-tuning LLMs and Prompt Engineering.</li>\n<li>\n<p>Familiarity with frameworks like LangChain or LlamaIndex.</p>\n</li>\n<li>\n<p><strong>Problem-Solving:</strong> Excellent analytical and problem-solving skills with a strong ability to approach complex data challenges.</p>\n</li>\n</ul>\n<p><strong>Good to Have:</strong></p>\n<ul>\n<li>Experience with cloud-based AI/ML services (e.g., Azure ML, AWS SageMaker, Google Cloud AI Platform).</li>\n<li>Familiarity with MLOps principles and tools (e.g., MLflow, DVC, CI/CD for models).</li>\n<li>Experience with big data technologies (e.g., Apache Spark).</li>\n</ul>\n<p><strong>Educational Qualification:</strong></p>\n<p>Bachelor’s or Master's degree in Computer Science, Information Technology, or a related field (or equivalent experience).</p>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates please drop your resume to: careers@appfabs.in\nPlease mention the position you are applying for in the subject line.</p>\n<p><strong>Company Information:</strong></p>\n<p>Appfabs Innovation (P) Ltd\nModules No. 11, Gayathri Building, Phase I, Technopark Campus, Thiruvanthapuram , 695581\nhttps://www.appfabs.ca</p>\n<p><strong>Closing Date:</strong> 18, Aug 2025\n<strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "3-6 Years",
            "Generative AI",
            "Deep Learning",
            "Python"
        ],
        "summary": "Appfabs Innovation is hiring a Senior AI Engineer/Data Analyst to extract data insights. They will build and deploy Machine Learning, Deep Learning, and Generative AI models."
    },
    {
        "job_title": "TECHNOLOGY TRAINER –Junior Consultants",
        "company": "Faith Infotech India (P) Ltd",
        "url": "https://technopark.org/job-details/21528",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Technology Trainer – Junior Consultants</h2>\n<p><strong>Faith InfoTech India (P) Ltd</strong>\nABE2- Thejaswini Extension\nTechopark Campus, Thiruvananthapuram, 695581\n<a href=\"https://www.faithinfotechacademy.com\">https://www.faithinfotechacademy.com</a></p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> hr@faithinfotech.in</p>\n<p><strong>Brief Description:</strong></p>\n<p>Due to the high demand for Technology professionals, there is a growing need for Technology Trainers and Consultants to train the next generation of the IT workforce. Technology Trainers should have exposure to multiple programming languages/technology stacks like Java, .NET/Node/Python, UI development using Angular/React, and databases, in addition to emerging technology stacks like Data Science and AI/ML. They are also expected to have exposure to Software Application Development and the Software Development Life Cycle, good communication and presentation skills, and a passion for learning new technologies.</p>\n<p>Technology Training and consulting provides a rewarding, fulfilling, flexible, and transformative career. Selected candidates will be immersed in various programming and technology stacks over 6 months to develop their technical and professional competency. After completing the training period, you will be initially deployed as Junior consultants and Technology Trainers for entry-level professionals. You would transition to train corporate customers and working professionals to build a career in grooming and mentoring the Next Generation Global Digital Workforce with one of the most successful training service providers.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Keen interest in Programming and Technology</li>\n<li>Interest to build a career as Technology Trainers and Consultants</li>\n<li>Degree in Engineering (BE/B Tech) in any discipline or Postgraduate in Computer Science (MCA/MSc)</li>\n<li>Good logical and analytical skills</li>\n<li>Excellent communication, presentation, and mentoring skills</li>\n</ul>\n<p>Mail your resume with “Technology Trainer- Junior consultants” and preferred location in the subject line.</p>\n<p>Freshers or experienced professionals with experience in Non-IT jobs willing to shift to an IT career can also apply.</p>\n<p><strong>Age limit:</strong> Max 35 Yrs as on Dec 31 2025.</p>\n<p><strong>Job locations:</strong> Technopark Trivandrum / Infopark Kochi / Nagercoil\n(Work from Home Option not available)</p>\n<p><strong>Salary:</strong> 3L pa after 6 months of training at Technopark Trivandrum</p>",
        "tags": [
            "Fresher",
            "Java",
            "Python",
            "Communication Skills"
        ],
        "summary": "Seeking a Technology Trainer to train the next IT workforce generation. Ideal candidates have programming knowledge and strong communication skills to train professionals."
    },
    {
        "job_title": "Embedded System Engineer",
        "company": "Zybo Tech Lab (P) Ltd",
        "url": "https://technopark.org/job-details/21527",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Embedded System Engineer</h2>\n<p><strong>Zybo Tech Lab (P) Ltd</strong> is looking for an Embedded System Engineer to join our team in Trivandrum. You will be responsible for developing and integrating firmware and hardware components for our IoT-based projects, with a specific focus on UWB module integration, low-level communication protocols, and low-power embedded systems.</p>\n<p><strong>Location:</strong> On-site\n<strong>Experience:</strong> 1–2 Years\n<strong>Type:</strong> Full-Time\n<strong>Salary:</strong> As per industry standards</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and debug embedded software using C/C++ or MicroPython.</li>\n<li>Integrate UWB modules (e.g., Decawave, Pozyx) with custom hardware.</li>\n<li>Work with communication protocols such as UART, I2C, SPI, and serial interfaces.</li>\n<li>Collaborate with hardware and software teams to build and test embedded prototypes.</li>\n<li>Optimize for low-power performance in embedded designs.</li>\n<li>Support PCB-level debugging and sensor/module interfacing.</li>\n<li>Maintain technical documentation and contribute to testing and validation procedures.</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>1–2 years of experience in embedded system development.</li>\n<li>Hands-on experience with IoT projects and microcontroller-based systems.</li>\n<li>Proficiency in C/C++ or MicroPython.</li>\n<li>Experience integrating UWB modules (Decawave DWM1000/1001, Pozyx, etc.).</li>\n<li>Strong knowledge of UART, I2C, SPI, and other serial communication protocols.</li>\n<li>Basic understanding of low-power system design principles.</li>\n<li>Ability to read and interpret circuit schematics and datasheets.</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li>Experience with STM32, ESP32, or similar MCUs.</li>\n<li>Familiarity with RTOS or FreeRTOS.</li>\n<li>Debugging tools like logic analyzers, oscilloscopes, etc.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates can send their updated resume to:</p>\n<p>📧 jobs@zybotechlab.com</p>\n<p><strong>Contact Information:</strong></p>\n<p>Zybo Tech Lab (P) Ltd\n3rd Floor, Amstor Building, Technopark, Kazhakoottam, Trivandrum, 695581\nhttps://zybotechlab.com</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> jobs@zybotechlab.com</p>",
        "tags": [
            "1-2 Years",
            "Embedded Systems",
            "UWB Modules",
            "C/C++"
        ],
        "summary": "Zybo Tech Lab is seeking an Embedded System Engineer for IoT projects, focusing on UWB integration and low-power systems. The role involves firmware development, debugging, and collaboration with hardware teams."
    },
    {
        "job_title": "Angular Developer",
        "company": "Polus Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21526",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Angular Developer</h2>\n<p>Polus Solutions is seeking experienced and passionate Angular Developers to join our team. As an Angular Developer, you will be responsible for software design, writing maintainable code, and providing support to clients and teams.</p>\n<p><strong>Contact Information:</strong> careers@polussolutions.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Produce software designs.</li>\n<li>Write maintainable code.</li>\n<li>Provide support to clients and teams.</li>\n</ul>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li><strong>Experience:</strong> 3-8 years of total software development experience in Angular with good knowledge of design patterns.</li>\n<li><strong>Education:</strong> Graduates in BE/BTech (Computer science or related) or Msc Computer science /MCA or equivalent.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Design and implementation of low-latency, high-availability, and performance applications.</li>\n<li>Writing reusable code and libraries, optimizing applications for performance and scalability.</li>\n<li>Proactivity with a focus on getting things done, strong attention to detail, and ability to produce high-quality work within set deadlines.</li>\n<li>In-depth knowledge of modern HTML, CSS, Angular, Json, JQuery, Bootstrap.</li>\n<li>Understanding the nature of asynchronous programming and its quirks and workarounds.</li>\n<li>Understanding of Spring Framework, ASP.NET, MVC, MongoDB will be an added advantage.</li>\n<li>Strong proficiency with Angular / React JS and JavaScript.</li>\n<li>Knowledge of Node.js and frameworks available for it such as Express, Sails etc.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your resume to careers@polussolutions.com. Please include “Angular Developer - [Your Name]” in the subject line.</p>\n<p><strong>Company Information:</strong></p>\n<p>Polus Solutions (P) Ltd\n12B, Carnival Technopark\nTechnopark, Kazhakuttam\nTrivandrum Kerala, India, 695581\nhttps://www.polussolutions.com</p>\n<p><strong>Closing Date:</strong> 11, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "3-8 Years",
            "Angular",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "summary": "Polus Solutions is hiring an Angular Developer to design software, write code and support clients. The ideal candidate will have 3-8 years of experience in Angular."
    },
    {
        "job_title": "Full Stack Developer – Intern / Fresher",
        "company": "Zybo Tech Lab (P) Ltd",
        "url": "https://technopark.org/job-details/21525",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Full Stack Developer – Intern / Fresher</h2>\n<p><strong>Zybo Tech Lab (P) Ltd</strong>\n3rd Floor, Amstor Building, Technopark, Kazhakoottam, Trivandrum, 695581\n<a href=\"https://zybotechlab.com\">https://zybotechlab.com</a></p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> jobs@zybotechlab.com</p>\n<p><strong>Brief Description</strong></p>\n<ul>\n<li><strong>Location:</strong> Onsite / Hybrid</li>\n<li><strong>Stipend/CTC:</strong> Paid</li>\n<li><strong>Duration:</strong> 3–6 Months (with possible full-time offer)</li>\n<li><strong>Experience:</strong> Intern / Fresher</li>\n<li><strong>Type:</strong> Internship / Entry-Level</li>\n</ul>\n<h3>Role Overview:</h3>\n<p>As a Full Stack Developer Intern, you will work alongside our development team on real-time client and internal projects using Python (Django) on the backend and React.js / Next.js on the frontend. You will get exposure to the full software development lifecycle, from requirement analysis to deployment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in developing and maintaining full stack web applications.</li>\n<li>Write clean, scalable, and well-documented code.</li>\n<li>Support in integration of APIs and third-party services.</li>\n<li>Collaborate with UI/UX designers and backend developers.</li>\n<li>Participate in code reviews and debugging tasks.</li>\n<li>Learn and adapt quickly in a team-oriented environment.</li>\n</ul>\n<h3>Eligibility:</h3>\n<ul>\n<li>Final year students / Freshers (B.Tech, BCA, MCA, etc.)</li>\n<li>Candidates who have done training/projects in Django &amp; React will be preferred.</li>\n</ul>\n<h3>Perks &amp; Benefits:</h3>\n<ul>\n<li>Internship Certificate</li>\n<li>Real-time project experience</li>\n<li>Mentorship from senior developers</li>\n<li>Chance for full-time placement based on performance</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates can send their updated resume to:</p>\n<p>📧 <a href=\"mailto:jobs@zybotechlab.com\">jobs@zybotechlab.com</a></p>\n<h3>Preferred Skills/Required Skills:</h3>\n<ul>\n<li>Basic to intermediate knowledge of Python and Django.</li>\n<li>Familiarity with React.js and Next.js.</li>\n<li>Understanding of REST APIs, Git, and version control.</li>\n<li>Problem-solving attitude and eagerness to learn.</li>\n<li>Good communication and teamwork skills.</li>\n</ul>",
        "tags": [
            "0 Years",
            "React.js",
            "Django",
            "Python"
        ],
        "summary": "Full Stack Developer Intern to assist in web application development using Python (Django), React.js, and Next.js. Ideal for final year students/freshers to gain real-time project experience."
    },
    {
        "job_title": "Sales Head – IT Services",
        "company": "Zybo Tech Lab (P) Ltd",
        "url": "https://technopark.org/job-details/21524",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Sales Head – IT Services</h2>\n<p><strong>Zybo Tech Lab (P) Ltd</strong>\n3rd Floor, Amstor Building, Technopark, Kazhakoottam, Trivandrum, 695581\n<a href=\"https://zybotechlab.com\">https://zybotechlab.com</a></p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 04, July 2025\n<strong>Contact Email:</strong> jobs@zybotechlab.com</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li><strong>Location:</strong> Onsite / Hybrid</li>\n<li><strong>Salary:</strong> As per industry standards</li>\n<li><strong>Experience:</strong> 4+ Years</li>\n<li><strong>Type:</strong> Full-Time</li>\n</ul>\n<p><strong>Role Overview:</strong>\nWe are seeking an experienced Sales Head with a strong background in IT Services sales to lead our sales team. The candidate will be responsible for creating and executing sales strategies, managing a team of executives, nurturing client relationships, and ensuring sustainable revenue and fund flow.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>Sales Strategy &amp; Execution:</strong></p>\n<ul>\n<li>Develop and implement effective sales strategies to meet revenue targets.</li>\n<li>Identify new business opportunities in domestic and international markets.</li>\n<li>Set sales targets and ensure the team meets or exceeds them.</li>\n<li>Prepare weekly/monthly sales forecasts and performance reports.</li>\n</ul>\n<p><strong>Team Leadership &amp; Management:</strong></p>\n<ul>\n<li>Lead, guide, and mentor the sales team to improve performance and close rates.</li>\n<li>Conduct regular sales meetings, reviews, and performance evaluations.</li>\n<li>Foster a target-driven, energetic team culture.</li>\n</ul>\n<p><strong>Client Relationship &amp; Business Development:</strong></p>\n<ul>\n<li>Handle key client relationships, pitch solutions, and negotiate contracts.</li>\n<li>Build strong networks with potential customers and business partners.</li>\n<li>Participate in client meetings, proposals, and deal closures.</li>\n</ul>\n<p><strong>Revenue &amp; Fund Flow Management:</strong></p>\n<ul>\n<li>Ensure timely client payments and maintain consistent fund inflow.</li>\n<li>Work closely with finance and project teams for cash flow planning.</li>\n<li>Monitor overdue payments and resolve bottlenecks proactively.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Competitive salary with performance incentives.</li>\n<li>Dynamic and collaborative work environment.</li>\n<li>Opportunity to lead a growing sales division and influence company strategy.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li>4+ years of proven experience in IT sales, B2B client handling, and team management.</li>\n<li>Strong knowledge of web/app development services and IT products.</li>\n<li>Excellent communication, negotiation, and leadership skills.</li>\n<li>Experience in CRM tools and sales reporting systems.</li>\n<li>High accountability for sales targets and financial performance.</li>\n</ul>\n<p><strong>How to Apply</strong>\nInterested candidates can send their updated resume to:</p>\n<p>📧 jobs@zybotechlab.com</p>",
        "tags": [
            "4+ Years",
            "IT Sales",
            "B2B Client Handling",
            "Team Management"
        ],
        "summary": "Zybo Tech Lab is seeking a Sales Head to lead their IT Services sales team. The role involves creating sales strategies, managing client relationships, and ensuring revenue targets are met."
    },
    {
        "job_title": "Junior Project Manager - Full Stack Developer",
        "company": "Zybo Tech Lab (P) Ltd",
        "url": "https://technopark.org/job-details/21523",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Junior Project Manager - Full Stack Developer</h2>\n<p><strong>Zybo Tech Lab (P) Ltd</strong> is seeking a Junior Project Manager with Full Stack Development skills to join our team. This role combines technical development with project coordination and client communication.</p>\n<p><strong>Location:</strong> Onsite at Amstor Building, Technopark, Kazhakoottam, Trivandrum, 695581\n<strong>Salary:</strong> ₹2.4 – ₹3.4 LPA\n<strong>Experience:</strong> 1–2 Years\n<strong>Type:</strong> Full-Time</p>\n<p><strong>Role Overview:</strong>\nThe ideal candidate should be able to actively code, manage day-to-day development tasks, coordinate with internal teams, and effectively communicate project requirements and progress to clients.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>Project Management:</strong>\n- Assist the senior project manager in managing sprint timelines and deliverables.\n- Prepare requirement documents, project briefs, and user stories based on client inputs.\n- Coordinate with cross-functional teams (Frontend, Flutter, UI/UX, WordPress, Testing, Backend).\n- Ensure deadlines, quality standards, and scope are maintained.\n- Communicate effectively with clients during meetings, status calls, and requirement clarifications.</p>\n<p><strong>Technical/Development:</strong>\n- Write clean, efficient code across frontend and backend stacks.\n- Contribute to projects using Python (Django/Flask), React.js, Next.js, and Flutter.\n- Participate in code reviews, debugging, and resolving production issues.\n- Support integrations, testing, and deployment processes.</p>\n<p><strong>Required Skills &amp; Experience:</strong>\n- 1–3 years of hands-on experience in Full Stack Development.\n- Strong command of:\n  - Backend: Python (Django/Flask)\n  - Frontend: React.js, Next.js\n  - Mobile: Flutter (basic to intermediate preferred)\n- Understanding of REST APIs and database design.\n- Excellent verbal and written communication in English.\n- Knowledge of project management methodologies (Agile/Scrum) is a plus.\n- Basic understanding of Jira, Trello, or similar tools.\n- Client-facing experience is highly desirable.</p>\n<p><strong>What We Offer:</strong>\n- Opportunity to grow into a mid-level project management or tech lead role.\n- Work across diverse tech stacks and real-world applications.\n- Friendly and supportive team environment.</p>\n<p><strong>Who Should Apply:</strong>\n- Developers aspiring to transition into tech leadership or project management roles.\n- Full stack developers with strong organizational and communication skills.\n- Individuals who enjoy multitasking between coding, coordinating, and communicating.</p>\n<p><strong>Contact Information:</strong>\n- Email: jobs@zybotechlab.com\n- Website: https://zybotechlab.com</p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "1-3 Years",
            "Full Stack Development",
            "Python",
            "React.js"
        ],
        "summary": "Zybo Tech Lab is hiring a Junior Project Manager - Full Stack Developer. This role involves coding, project coordination, and client communication, requiring experience in relevant technologies."
    },
    {
        "job_title": "Full Stack Developer- Lead",
        "company": "Appfabs Innovation (P) Ltd",
        "url": "https://technopark.org/job-details/21522",
        "location": "Technopark",
        "closing_date": "04 Aug 2025",
        "job_description": "<h2>Full Stack Developer - Lead</h2>\n<p><strong>Appfabs Innovation (P) Ltd</strong> is seeking a passionate and skilled Full Stack Developer - Lead to join our growing team in Technopark, Thiruvananthapuram.</p>\n<p><strong>About the Role:</strong></p>\n<p>The ideal candidate will have hands-on experience with both frontend and backend technologies, and a strong foundation in programming principles. You will be responsible for developing and maintaining scalable web applications across the full stack.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, test, and deploy high-quality, scalable, and secure web applications using a variety of technologies.</li>\n<li>Contribute to both front-end (React/Angular) and back-end (ASP.NET Core, Java Spring Boot, Python) development.</li>\n<li>Collaborate with product managers, designers, and other engineers to understand requirements and translate them into technical solutions.</li>\n<li>Implement and maintain CI/CD pipelines to ensure efficient and automated deployments.</li>\n<li>Work with containerization technologies (Docker) and orchestration platforms (Kubernetes) to build and deploy microservices.</li>\n<li>Utilize cloud services (Azure, AWS) for infrastructure, deployment, and scaling of applications.</li>\n<li>Participate in code reviews, promote best practices, and mentor junior engineers (if applicable).</li>\n<li>Troubleshoot and debug production issues, ensuring application stability and performance.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul>\n<li><strong>Backend:</strong> Asp .Net Core, Java Spring Boot, Flask, FastAPI</li>\n<li><strong>Frontend:</strong> React.js, Redux/Context API, and modern JavaScript (ES6+) or Angular</li>\n<li><strong>Containers:</strong> Knowledge in Docker and Kubernetes</li>\n<li><strong>Cloud Platform:</strong> Hands-on experience with at least one major cloud provider: Microsoft Azure or Amazon Web Services (AWS)</li>\n<li><strong>Database Knowledge:</strong> Experience with relational databases (e.g., SQL Server, PostgreSQL, MySQL) and/or NoSQL databases (e.g., MongoDB, Cosmos DB).</li>\n<li>Strong programming fundamentals and logical reasoning.</li>\n<li>Experience working with RESTful APIs and third-party integrations.</li>\n<li>Familiarity with version control tools like Git.</li>\n<li>Ability to write unit tests and perform code reviews.</li>\n</ul>\n<p><strong>Good to Have:</strong></p>\n<ul>\n<li>Exposure to Python frameworks and libraries.</li>\n<li>Experience Node.js</li>\n<li>Understanding of DevOps tools and CI/CD pipelines.</li>\n<li>Agile/Scrum methodology experience.</li>\n</ul>\n<p><strong>Educational Qualification:</strong></p>\n<ul>\n<li>Bachelor’s or Master's degree in Computer Science, Information Technology, or a related field (or equivalent experience).</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates please drop your resume to careers@appfabs.in. Please mention the position you are applying for in the subject line.</p>\n<p><strong>Closing Date:</strong> 04, Aug 2025</p>\n<p><strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "6-10 Years",
            "React.js",
            "ASP.NET Core",
            "Docker"
        ],
        "summary": "Appfabs Innovation is hiring a Full Stack Developer - Lead. The role involves developing scalable web applications using technologies like React, ASP.NET Core, and Docker."
    },
    {
        "job_title": "District Coordinators (MBA freshers)",
        "company": "4Labs Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21521",
        "location": "Technopark",
        "closing_date": "10 Jul 2025",
        "job_description": "<h2>District Coordinators (MBA freshers)</h2>\n<p>4Labs Technologies (P) Ltd is seeking District Coordinators.</p>\n<p><strong>Contact Information:</strong>\n*   Email: careers@4labsinc.com\n*   Website: <a href=\"https://www.4labsinc.com/\">https://www.4labsinc.com/</a></p>\n<p><strong>Address:</strong>\n2501(a), 5th Floor, Yamuna Building, Phase III, Technopark, Trivandrum, 695583</p>\n<p><strong>Job Locations:</strong>\n- Thiruvananthapuram\n- Kollam\n- Pathanamthitta\n- Alappuzha\n- Kottayam\n- Idukki\n- Ernakulam\n- Thrissur\n- Palakkad\n- Malappuram\n- Kozhikode\n- Wayanad\n- Kannur</p>\n<p><strong>Selection Criteria:</strong></p>\n<ul>\n<li>The candidate must be a resident of Kerala, specifically from the district they are applying for.</li>\n<li>The candidate must be under 25 years of age at the time of application.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>The candidate should have completed their MBA in 2023 or later from a recognized university. Candidates who completed their MBA before 2023 are not eligible.</li>\n<li>Preference is given to those with up to one year of relevant work experience.</li>\n</ul>\n<p><strong>Closing Date:</strong> 10, July 2025</p>\n<p><strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "0-1 Year",
            "MBA",
            "Coordination",
            "Kerala Residency"
        ],
        "summary": "4Labs Technologies is hiring District Coordinators, and MBA freshers are encouraged to apply. Candidates must be Kerala residents and under 25 years old."
    },
    {
        "job_title": "Presales Analyst",
        "company": "Dcube Ai Systems & Services (P) Ltd",
        "url": "https://technopark.org/job-details/21520",
        "location": "Technopark",
        "closing_date": "11 Jul 2025",
        "job_description": "<h2>Presales Analyst</h2>\n<p>DCUBE Ai Systems &amp; Services (P) Ltd is seeking an experienced and dynamic Presales Analyst with 3 years of experience to align customer needs with tailored solutions, ensuring successful client engagements, and driving business growth at our Trivandrum location.</p>\n<p><strong>Contact Information:</strong> careers@dcubeai.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Prepare detailed and customized proposals and presentations that address client needs.</li>\n<li>Work closely with technical and business teams to gather business inputs for proposals.</li>\n<li>Follow up on leads from the sales team and track their progress through the sales pipeline.</li>\n<li>Coordinate with sales and marketing teams to prioritize high-potential opportunities.</li>\n<li>Build and maintain strong, long-term relationships with prospective clients.</li>\n<li>Collaborate with technical teams to design solutions that align with customer expectations.</li>\n<li>Conduct product demonstrations and technical walkthroughs for clients.</li>\n<li>Keep updated on market trends, competitor offerings, and industry best practices.</li>\n<li>Provide inputs for product improvement and positioning based on client feedback.</li>\n<li>Establish and optimize processes for managing presales activities.</li>\n<li>Develop templates, tools, and best practices to enhance productivity.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>3+ years of experience in pre-sales, business development, or a related role.</li>\n<li>Excellent verbal, written, and presentation skills.</li>\n<li>Proven ability to build and sustain strong client relationships.</li>\n<li>Strong organizational and multitasking skills to manage multiple leads and deadlines.</li>\n<li>Collaborative mindset to work with cross-functional teams effectively.</li>\n</ul>\n<p><strong>Location:</strong></p>\n<p>DCUBE Ai Systems &amp; Services (P) Ltd</p>\n<h1>2702, 7th Floor, Yamuna Building,</h1>\n<p>Phase III, Technopark, Thiruvananthapuram. , 695583\nhttp://www.dcubeai.com</p>\n<p><strong>Closing Date:</strong> 11, July 2025</p>\n<p><strong>Job Published:</strong> 04, July 2025</p>",
        "tags": [
            "3+ Years",
            "Pre-Sales",
            "Business Development",
            "Client Relationship"
        ],
        "summary": "Seeking a Presales Analyst to align client needs with solutions, driving business growth. Responsibilities include preparing proposals, building client relationships, and optimizing presales activities in Trivandrum."
    }
]