[
    {
        "job_title": "Marketing Support Executive",
        "company": "Global Surf IT Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20538/421",
        "location": "Infopark",
        "closing_date": "28 Sep 2025",
        "job_description": "<h2>Marketing Support Executive</h2>\n<p>Global Surf IT Pvt Ltd is seeking a Marketing Support Executive to join their team. In this role, you will be instrumental in supporting the marketing and sales departments by managing customer interactions, maintaining lead records, and generating performance reports. The ideal candidate possesses strong communication skills, meticulous attention to detail, and a proactive approach to ensure seamless marketing operations and customer engagement.</p>\n<p>Learn more about our company: <a href=\"https://www.gs-it.ae/\">https://www.gs-it.ae/</a></p>\n<h3>KEY RESPONSIBILITIES</h3>\n<ol>\n<li>\n<p><strong>CHAT &amp; CALL SUPPORT</strong></p>\n<ul>\n<li>Manage multiple chat and call interactions efficiently and professionally.</li>\n<li>Provide clear, timely, and effective responses to customer inquiries, ensuring a positive experience.</li>\n</ul>\n</li>\n<li>\n<p><strong>LEAD MANAGEMENT &amp; CRM OVERSIGHT</strong></p>\n<ul>\n<li>Utilize CRM platforms to track, update, and manage customer leads and interactions.</li>\n<li>Ensure all lead data is accurately recorded and maintained for easy reference and follow-up.</li>\n<li>Monitor CRM entries for completeness and coordinate with the sales team to correct or update missing information.</li>\n<li>Generate regular lead reports to support data-driven decision-making.</li>\n<li>Assist the marketing team in any support activities as required.</li>\n</ul>\n</li>\n<li>\n<p><strong>DATA ANALYSIS &amp; REPORTING</strong></p>\n<ul>\n<li>Assist in compiling and analyzing marketing data to identify patterns, trends, and opportunities.</li>\n<li>Support the preparation of performance reports highlighting key metrics and insights for management review.</li>\n</ul>\n</li>\n</ol>\n<h3>QUALIFICATIONS</h3>\n<ul>\n<li>Bachelor’s degree in any discipline.</li>\n<li>Basic understanding of any CRM tool and Microsoft Office (Word, Excel).</li>\n<li>Foundational knowledge of IT products and services is an added advantage.</li>\n<li>Prior experience in call handling or customer service is a plus.</li>\n</ul>\n<h3>SKILLS REQUIRED</h3>\n<ul>\n<li>Excellent written and verbal communication skills.</li>\n<li>Strong attention to detail and commitment to accuracy.</li>\n<li>Eagerness to learn and adapt in a dynamic work environment.</li>\n<li>Ability to remain focused and efficient during repetitive tasks.</li>\n<li>Proficiency in Microsoft Office tools.</li>\n</ul>\n<h3>HOW TO APPLY</h3>\n<p>Interested candidates who meet the above qualifications are invited to apply by submitting their updated resume.</p>\n<p>Please email your application to talenthunt@globalsurf.ae with the subject line: “Application for Marketing Support Executive – Global Surf IT Pvt Ltd”.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at talenthunt@globalsurf.ae.</p>",
        "tags": [
            "0-1 Years",
            "CRM",
            "Customer Service",
            "Microsoft Office"
        ],
        "summary": "Seeking a Marketing Support Executive to manage customer interactions and lead data. Responsibilities include chat/call support, CRM oversight, and data reporting for marketing and sales."
    },
    {
        "job_title": "ICT Regulatory Officer",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20550/4",
        "location": "Infopark",
        "closing_date": "28 Sep 2025",
        "job_description": "<h2>ICT Regulatory Officer</h2>\n<p>As an ICT Regulatory Officer, you will be responsible for overseeing IT risk management and ensuring regulatory compliance across our IT landscape. You will play a crucial role in safeguarding our systems and data, while also ensuring adherence to industry standards and frameworks.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Ensuring compliance with relevant regulatory requirements and industry standards, including GDPR, DORA, and PCI-DSS.</li>\n<li>Conducting regular audits and assessments to identify and mitigate potential risks.</li>\n<li>Collaborating with cross-functional teams to ensure security measures are integrated into all IT projects.</li>\n<li>Maintaining up-to-date knowledge of regulatory changes and emerging security threats.</li>\n<li>Developing and maintaining documentation related to IT policies and procedures.</li>\n<li>Ensuring policies and procedures are up-to-date and reflect current regulations and best practices.</li>\n<li>Participating in incident response activities related to IT security breaches and compliance violations.</li>\n<li>Being responsible for business continuity planning and disaster recovery testing.</li>\n<li>Monitoring and reporting on compliance status.</li>\n<li>Analyzing audit findings and recommend corrective actions.</li>\n<li>Working closely with IT, Risk, and other departments to ensure alignment of IT security and compliance efforts.</li>\n<li>Collaborating with external auditors and regulatory agencies.</li>\n<li>Staying informed of emerging IT risks and compliance requirements.</li>\n</ul>\n<h3>Experience and Skills:</h3>\n<ul>\n<li>Bachelor's degree in Information Technology, Computer Science, or a related field.</li>\n<li>Minimum of 2 years of experience in IT risk management and regulatory compliance.</li>\n<li>Knowledge of ITIL/COBIT framework and other relevant industry standards.</li>\n<li>Strong knowledge of IT security principles, risk management frameworks, and compliance regulations.</li>\n<li>Understanding of GDPR, DORA, and PCI-DSS regulations.</li>\n<li>Familiarity with business continuity planning and disaster recovery.</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Relevant certifications (e.g., CISSP, CISM, CRISC, CISA) are a plus.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at merin.cb@arttechgroup.com</p>",
        "tags": [
            "2+ Years",
            "Regulatory Compliance",
            "IT Risk Management",
            "GDPR"
        ],
        "summary": "ICT Regulatory Officer needed for IT risk management and regulatory compliance. Responsibilities include audits, policy development, and incident response. Requires a degree and 2+ years of experience."
    },
    {
        "job_title": "AI Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20542/312",
        "location": "Infopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>AI Engineer</h2>\n<p>We are looking for a talented and passionate AI Engineer to join our team. The AI Engineer will be responsible for designing, developing, and deploying AI models and algorithms to solve complex problems and drive business value. The ideal candidate will have a strong background in machine learning, deep learning, and data science, along with excellent programming skills.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and implement AI models and algorithms to solve real-world problems.</li>\n<li>Collaborate with cross-functional teams to understand business requirements and translate them into technical solutions.</li>\n<li>Conduct data analysis and preprocessing to ensure high-quality input for AI models.</li>\n<li>Train, test, and validate AI models to ensure accuracy and performance.</li>\n<li>Deploy AI models into production environments and monitor their performance.</li>\n<li>Continuously improve AI models by incorporating new data and feedback.</li>\n<li>Stay up-to-date with the latest advancements in AI and machine learning technologies.</li>\n<li>Document AI models, processes, and results for knowledge sharing and future reference.</li>\n<li>Participate in code reviews and provide constructive feedback to peers.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Proven experience as an AI Engineer, Machine Learning Engineer, or similar role.</li>\n<li>Strong understanding of machine learning algorithms, deep learning frameworks, and statistical methods.</li>\n<li>Experience with LLMs (GPT-4, Llama-2)</li>\n<li>Experience with NLP and RAG (Retrieval-Augmented Generation)</li>\n<li>Proficiency in programming languages such as Python, R, or Java.</li>\n<li>Experience with machine learning libraries and frameworks such as TensorFlow, Keras, PyTorch, or Scikit-learn.</li>\n<li>Familiarity with data preprocessing, feature engineering, and data visualization techniques.</li>\n<li>Familiarity with vector databases such as Pinecone and ChromaDB</li>\n<li>Knowledge of cloud platforms such as AWS, Google Cloud, or Azure.</li>\n<li>Experience with version control systems like Git.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Excellent communication and collaboration skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@2basetechnologies.com</p>",
        "tags": [
            "Proven experience",
            "Machine Learning",
            "Deep Learning",
            "Python"
        ],
        "summary": "AI Engineer needed to design, develop, and deploy AI models. Requires strong ML/DL background, programming skills, and experience with LLMs, NLP, and cloud platforms."
    },
    {
        "job_title": "Java Developer (Fraud)",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20546/4",
        "location": "Infopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Java Developer (Fraud)</h2>\n<p><strong>Company:</strong> Panasa Technology\n<strong>Workmode:</strong> Work from Home (WFH)\n<strong>Location:</strong> Kochi, Infopark\n<strong>Designation:</strong> Java Developer (Fraud)</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Support of existing functionality for fraud products line.</li>\n<li>Developing and testing new functionality.</li>\n<li>Implementing new functionality on the customer side.</li>\n<li>Providing functional consulting to business analysts and technical writers.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Core Java (backend) development for fraud management solution.</li>\n<li><strong>3+ years of experience</strong>.</li>\n<li>Multithreading.</li>\n<li><strong>Technologies:</strong> Java 11, Spring Framework 5, Spring Boot 2.</li>\n<li><strong>Databases:</strong> Oracle, PostgreSQL.</li>\n<li><strong>Interfaces:</strong> ISO-8583, REST API, Swagger.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates, please share your resume to: merin.cb@arttechgroup.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at merin.cb@arttechgroup.com.</p>",
        "tags": [
            "3+ Years",
            "Java",
            "Spring Boot",
            "Oracle"
        ],
        "summary": "Seeking a Java Developer with 3+ years of experience for fraud product development. Responsibilities include supporting existing functionality and implementing new features using Java 11, Spring Boot, and Oracle/PostgreSQL."
    },
    {
        "job_title": "Data Science Intern",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20573/157",
        "location": "Infopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Data Science Intern</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Explain predictive models to various business users and make recommendations to drive business strategy.</li>\n<li>Make recommendations to resolve application performance problems.</li>\n<li>Implement data processing methods and tools.</li>\n<li>Collaborate with product leaders, subject matter experts, and decision-makers to develop success criteria and optimize new products, features, policies, and models.</li>\n<li>Leverage experience in analytics tools and scientific rigor to produce actionable insights.</li>\n<li>Distill and communicate key insights to senior management in verbal, visual, and written media.</li>\n<li>Together with the Co-op department lead, determine an appropriate data science problem statement and toolset to apply during the co-op term.</li>\n<li>Determine strengths and weaknesses of data science toolsets and procedures.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Working on a degree in Computer Science, or a related field, with project experience in data analysis.</li>\n<li>Knowledge of Machine Learning concepts (cross-validation, regularization, boosting, bootstrapping) is a plus.</li>\n<li>Experience with big data technologies (Hadoop, Hive, MongoDB, Spark).</li>\n<li>Experience with statistical analysis and data mining using tools such as R, SAS, Matlab, Stata, or SPSS.</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com.</p>",
        "tags": [
            "0-1 Years",
            "Machine Learning",
            "Big Data Technologies",
            "Data Analysis"
        ],
        "summary": "Data Science Intern to explain models, drive strategy, and resolve issues. Collaborate on new products and leverage analytics for actionable insights."
    },
    {
        "job_title": "Project Manager (Data & Analytics)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20574/157",
        "location": "Infopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Project Manager (Data &amp; Analytics)</h2>\n<p>We are looking for an experienced Project Manager – Data &amp; Analytics to lead and manage data-driven projects across various business domains. The ideal candidate will have strong experience in managing data engineering, business intelligence, and analytics projects, with a proven ability to collaborate with technical and business stakeholders to deliver high-impact solutions on time and within budget.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Lead end-to-end project management for data and analytics initiatives.</li>\n<li>Define project scope, goals, deliverables, timelines, and resource plans.</li>\n<li>Work closely with data engineers, data scientists, analysts, and business stakeholders.</li>\n<li>Manage project risks, issues, and dependencies proactively.</li>\n<li>Ensure quality assurance, timely reporting, and documentation throughout the project lifecycle.</li>\n<li>Communicate project status, updates, and escalations to leadership and stakeholders.</li>\n<li>Drive Agile/Scrum ceremonies and ensure timely sprint deliverables.</li>\n<li>Coordinate across cross-functional teams to ensure alignment with business objectives.</li>\n<li>Track KPIs, ROI, and business impact of analytics solutions.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Engineering, or a related field.</li>\n<li>PMP/PRINCE2 certification is a plus.</li>\n<li>7+ years of total experience with at least 3+ years in managing data analytics or data engineering projects.</li>\n<li>Strong understanding of data warehousing, ETL pipelines, data visualization, and analytics platforms.</li>\n<li>Hands-on experience working with tools/technologies like SQL, Power BI/Tableau, Python/R (preferred), and cloud data platforms (AWS/GCP/Azure).</li>\n<li>Strong project management skills, including planning, budgeting, and stakeholder management.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "7+ Years",
            "Data Analytics",
            "Project Management",
            "SQL"
        ],
        "summary": "Experienced Project Manager needed for data & analytics projects. Must have 7+ years of experience and strong skills in managing data initiatives. Apply with resume to lakshmi@team.tranzmeo.com."
    },
    {
        "job_title": "Junior Geophysicist- Fiber-optic Sensing & AI (Fresher)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20575/157",
        "location": "Infopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Junior Geophysicist - Fiber-optic Sensing &amp; AI (Fresher)</h2>\n<p>We are seeking a motivated Junior Geophysicist (recent graduate) to dive into projects involving Distributed Acoustic Sensing (DAS), fiber‑optic sensor data, and Python‑driven AI analysis. You’ll work closely with geophysicists, data scientists, and engineers to drive data‑centric insights and support field deployments.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Support data acquisition, preprocessing, and interpretation from fiber‑optic sensing systems (DAS/DTS).</li>\n<li>Analyze large time‑series datasets using Python (NumPy, Pandas, SciPy, Matplotlib).</li>\n<li>Collaborate with AI/ML experts to build models for signal classification, event detection, or anomaly identification.</li>\n<li>Participate in field activities, including deploying sensors, monitoring systems, and validating datasets.</li>\n<li>Document workflows, results, and technical insights clearly in reports or code comments.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>Bachelor's or Master's degree in Geophysics, Geoscience, Physics, Engineering, or related discipline.</li>\n<li>Fundamental understanding of seismic wave behavior and fiber‑optic sensing principles.</li>\n<li>Basic proficiency in Python and experience with data‑analysis libraries.</li>\n<li>Interest in machine learning—any exposure to scikit‑learn, TensorFlow, or PyTorch is a plus.</li>\n<li>Excellent analytical thinking, communication skills, and collaborative mindset.</li>\n</ul>\n<h3>Preferred (Nice-to-Have)</h3>\n<ul>\n<li>Experience with signal processing, time‑series analysis, or seismic inversion methods.</li>\n<li>Familiarity with version control systems (e.g., Git) and Jupyter notebooks.</li>\n<li>Willingness and physical ability to participate in occasional fieldwork and travel.</li>\n</ul>\n<h3>What You’ll Gain</h3>\n<ul>\n<li>Hands‑on experience at the intersection of geophysics, fiber‑optic sensing, and AI.</li>\n<li>Mentorship from industry professionals and cross‑disciplinary collaboration.</li>\n<li>Exposure to real‑world problems in energy, infrastructure, and environmental monitoring.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0-2 Years",
            "Python",
            "Fiber-Optic Sensing",
            "Geophysics"
        ],
        "summary": "Seeking a Junior Geophysicist for fiber-optic sensing and AI projects. Responsibilities include data analysis, model building, and fieldwork. Recent graduates welcome."
    },
    {
        "job_title": "Junior Business Development Executive - B2B Sales",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20576/157",
        "location": "Infopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Junior Business Development Executive - B2B Sales</h2>\n<p><strong>Experience:</strong> 0 to 3 years (Freshers are welcome to apply)</p>\n<p><strong>Qualifications:</strong>\n*   Engineering Degree\n*   MBA (Optional)</p>\n<p><strong>Preferred Experience:</strong>\n*   Prior experience in B2B Inside Sales, Lead Generation, or Customer Acquisition is preferred.\n*   Must be proactive, committed, ambitious, and possess good interpersonal skills.\n*   A smart negotiator with excellent grasping power.\n*   Must have good presentation skills.\n*   Familiarity with MS Office (Google Docs, PowerPoint).\n*   Willingness to travel approximately 80-20% of the time.\n*   Must have good communication skills in English (both verbal and written).\n*   Open to working in a young and dynamic culture.\n*   Candidates should reside within a 30-minute radius of the office.\n*   Must possess a valid passport.</p>\n<p><strong>Job Details:</strong>\n*   <strong>Employment Type:</strong> Full-time\n*   <strong>Industry:</strong> Software Development</p>\n<p><strong>How to Apply:</strong>\nInterested candidates are encouraged to submit their resumes to hr@tranzmeo.com or lakshmi@team.tranzmeo.com.</p>\n<p><strong>Key Skills and Traits:</strong>\nProactive, Ambitious, Interpersonal Skills, Negotiation Skills, Presentation Skills, MS Office, Willing To Travel, Communication Skills, Dynamic Culture, Passport Required.</p>",
        "tags": [
            "0-3 Years",
            "B2B Sales",
            "Lead Generation",
            "Customer Acquisition"
        ],
        "summary": "Seeking a Junior Business Development Executive with 0-3 years of experience in B2B sales. Role involves lead generation, customer acquisition, and requires strong communication and negotiation skills."
    },
    {
        "job_title": "Technical Lead- Data Science & Machine Learning",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20577/157",
        "location": "Infopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Technical Lead - Data Science &amp; Machine Learning</h2>\n<p>Tranzmeo is an innovative leader in the fiber optic sensing industry, dedicated to developing cutting-edge solutions that optimize pipeline monitoring, well monitoring, railway, aerospace, defense, and other applications. We harness the power of AI, ML, and Big Data to push the boundaries of sensing technology and provide real-time insights that matter.</p>\n<p>We're hiring a passionate and experienced Technical Lead to head our Data Science &amp; Machine Learning initiatives. If you're excited about applying AI/ML to advanced sensing technologies and want to make a tangible impact, we want to hear from you!</p>\n<h3>What You'll Do:</h3>\n<ul>\n<li>Lead the design, development, and deployment of scalable AI/ML models tailored to fiber optic sensing data.</li>\n<li>Architect Big Data solutions for processing vast amounts of sensing data in real-time.</li>\n<li>Collaborate with product teams, sensor engineers, and stakeholders on innovative projects.</li>\n<li>Mentor and manage a talented team of data scientists and engineers.</li>\n<li>Ensure data quality, model performance, and security standards.</li>\n<li>Stay ahead of developments in AI/ML and fiber optic sensing fields to foster innovation.</li>\n</ul>\n<h3>What We're Looking For:</h3>\n<ul>\n<li>B.Tech in Computer Science, Data Science, or related fields.</li>\n<li>6+ years of experience in data science, machine learning, and Big Data, preferably in the sensing or telecom sectors.</li>\n<li>Proven leadership and team management skills.</li>\n<li>Strong programming skills (Python).</li>\n<li>Experience with cloud platforms (AWS, GCP, Azure).</li>\n<li>Hands-on experience with ML frameworks (TensorFlow, PyTorch, scikit-learn).</li>\n<li>Skilled in Big Data tools (Hadoop, Spark, Kafka, Airflow).</li>\n<li>Good understanding of fiber optic sensing technologies and data characteristics is a plus.</li>\n<li>Excellent problem-solving, communication, and collaboration skills.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Work on innovative sensing technology projects with real-world impact.</li>\n<li>Lead the AI and ML strategies in a pioneering industry.</li>\n<li>Dynamic and growth-oriented work environment.</li>\n<li>Opportunity to shape the future of fiber optic sensing solutions.</li>\n</ul>\n<h3>Job Details:</h3>\n<ul>\n<li><strong>Employment:</strong> Full-time</li>\n<li><strong>Industry:</strong> Software Development</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@tranzmeo.com.</p>",
        "tags": [
            "6+ Years",
            "Data Science",
            "Machine Learning",
            "Big Data"
        ],
        "summary": "Lead Data Science & Machine Learning initiatives for fiber optic sensing. Requires 6+ years experience in AI/ML, Big Data, and team leadership. Drive innovation in cutting-edge technology."
    },
    {
        "job_title": "Customer Success Manager",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20578/157",
        "location": "Infopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Customer Success Manager</h2>\n<p>We are seeking an experienced Customer Success Manager to join our team. The candidate will play a key role in ensuring customer satisfaction, delivering client engagement excellence, and driving customer success through proactive measures.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Act as the primary point of contact and trusted advisor for customers</li>\n<li>Develop and nurture long-term relationships with the Customer stakeholders</li>\n<li>Understand Customer requirements and business goals</li>\n<li>Ensure frictionless onboarding &amp; adoption of Tranzmeo’s product/solution.</li>\n<li>Proactively review and manage customer accounts for greater Customer satisfaction and long-term retention.</li>\n<li>Track &amp; get the customer issues resolved promptly and effectively, escalating when necessary.</li>\n<li>Conduct regular review meetings with the customer to provide insights on product usage and best practices.</li>\n<li>Collaborate with cross-functional Tranzmeo teams (Sales, Product, Support) to ensure a seamless customer experience.</li>\n<li>Regularly monitor customer account health metrics and implement strategies to mitigate business risks</li>\n<li>Develop new knowledge assets based on experiential insights from Customer engagements</li>\n<li>Gather business insights of Customer needs and drive upsell/cross-sell opportunities</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Education</strong>: B.Tech degree (mandatory).</li>\n<li><strong>Experience</strong>: Minimum 7 years of relevant experience in Customer Success Management, Customer Delivery Management, or Customer Relationship Management.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li><strong>Language Proficiency</strong>: Fluency in English and Hindi is mandatory.</li>\n<li>Strong problem-solving and negotiation abilities.</li>\n<li>Ability to manage multiple clients and priorities effectively.</li>\n<li>Ability to quickly learn about the software products/solutions to guide clients in their business context</li>\n<li>Familiarity with CRM tools and customer success platforms.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary and benefits.</li>\n<li>A dynamic, respectful, and growth-oriented professional environment.</li>\n<li>Opportunities for Career development and skill enhancement</li>\n<li>Opportunities to gain highly valued professional experiences</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "7+ Years",
            "Customer Success Management",
            "CRM",
            "Client Relationship Management"
        ],
        "summary": "Experienced Customer Success Manager needed to drive customer satisfaction and retention. Responsibilities include client engagement, issue resolution, and onboarding. Requires B.Tech degree and 7 years of experience."
    },
    {
        "job_title": "Java Developer..",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20525/4",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Java Developer</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Development and engineering of a highly effective authorization system for transaction flows management.</li>\n<li>Research and development of prototypes for new framework platform options.</li>\n<li>Discussing system requirements with stakeholders.</li>\n<li>Taking part in code reviews.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Database engineering skills.</li>\n<li>Experience working with non-relational DBMS like Cassandra, Hadoop, Redis.</li>\n<li>Functional programming language skills (Scala).</li>\n<li>Understanding of asynchronous/event-driven principles of computer program development (Akka, Quasar).</li>\n<li>Experience working with BPEL language.</li>\n<li>Skills in working with UML and implementing information systems engineering.</li>\n<li>Experience working with plastic bank card technology and electronic payments.</li>\n<li>Experience in applied cryptography and world’s leading providers’ hardware cryptographic solutions (Thales, SafeNet, HP).</li>\n<li>Ability to read and analyze code from previous product versions in C language.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at shabeek.s@arttechgroup.com.</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Cassandra",
            "Scala"
        ],
        "summary": "Seeking a Java Developer for authorization system development. Requires experience with NoSQL, Scala, and asynchronous programming principles."
    },
    {
        "job_title": "C Developer (not ++)",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20526/4",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>C Developer</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain high-quality C code for software applications, adhering to coding standards and best practices.</li>\n<li>Troubleshoot and debug software defects, identifying and implementing solutions to ensure optimal performance and functionality.</li>\n<li>Initial test of developed functionality.</li>\n<li>Document software design, code, and functionality, ensuring clear and concise documentation for reference and future maintenance.</li>\n<li>Collaborate with developers, QA engineers, implementation engineers, system and business analysts, product owner, and project managers.</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul>\n<li>Excellent knowledge of C (not ++).</li>\n<li>Solid knowledge of data structures, algorithms, and memory management techniques.</li>\n<li>Experience in developing high-load systems.</li>\n<li>Experience in developing multi-threaded applications.</li>\n<li>Basic UNIX administration skills.</li>\n<li>Good knowledge of UNIX inter-process communication methods.</li>\n<li>Understanding the mechanisms of interaction between nodes in data networks.</li>\n<li>Experience in developing network applications using TCP/IP stack protocols.</li>\n<li>Experience in developing of shell scripts.</li>\n<li>Good understanding of code versioning tools SVN and Git.</li>\n<li>Knowledge of SQL, Oracle database, PostgreSQL.</li>\n<li>Strong analytical and problem-solving abilities, with a keen eye for detail.</li>\n<li>Excellent debugging and troubleshooting skills to identify and resolve software defects.</li>\n<li>Proficient in writing efficient and optimized code, ensuring high performance and scalability.</li>\n<li>Ability to prioritize tasks and manage time effectively to meet project deadlines.</li>\n<li>Ability to quickly switch between several tasks.</li>\n<li>Experience with software development methodologies and practices (Agile, Scrum, etc.).</li>\n<li>English at the level of reading technical documentation.</li>\n</ul>\n<p><strong>Technologies:</strong></p>\n<p>C, Unix, shell-scripts, SQL, Oracle, PostgreSQL, TCP/IP, svn, git</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at shabeek.s@arttechgroup.com</p>",
        "tags": [
            "0-2 Years",
            "C",
            "Unix",
            "TCP/IP"
        ],
        "summary": "C Developer needed to create and debug high-load, multi-threaded applications. Requires strong C, Unix, and network protocol knowledge. Apply at shabeek.s@arttechgroup.com."
    },
    {
        "job_title": "Governance, Risk, and Compliance Lead",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20540/4",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Governance, Risk, and Compliance (GRC) Lead</h2>\n<h3>Position Summary</h3>\n<p>The GRC Lead will spearhead the strategic governance, risk management, and compliance agenda to enhance the organization's cybersecurity resilience and ensure adherence to regulatory requirements. As a pivotal leader and collaborator, this role is responsible for developing, implementing, and continuously improving the GRC framework, ensuring its alignment with business objectives, regulatory mandates, and industry best practices. The GRC Lead will oversee GRC operations, guide cross-functional teams, engage with executive leadership, and direct strategic risk decisions to protect organizational resilience.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Strategic Governance &amp; Leadership</strong></p>\n<ul>\n<li>Lead the design, execution, and maturation of the organization’s comprehensive GRC strategy, including policy governance, risk management frameworks, compliance programs, and continuous improvement initiatives.</li>\n<li>Own the governance structure, encompassing policy lifecycle management, control frameworks, and compliance awareness programs.</li>\n<li>Align GRC objectives with business goals and ensure they are met.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@arttechgroup.com</p>",
        "tags": [
            "0-2 Years",
            "GRC",
            "Risk Management",
            "Compliance"
        ],
        "summary": "Lead GRC strategy for cybersecurity resilience and regulatory compliance. Drive framework development, implementation, and continuous improvement, aligning with business goals and best practices."
    },
    {
        "job_title": "QA Intern",
        "company": "Zoiteckh Informations Solutions",
        "url": "https://infopark.in/company-jobs/details/20562/466",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h1>QA Intern</h1>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Gain hands-on experience in software testing.</li>\n<li>Work with industry-standard tools such as Selenium, Postman, and JMeter.</li>\n<li>Explore and learn about AI testing tools like Testim and Applitools.</li>\n<li>Participate in real-time projects to apply and enhance testing skills.</li>\n</ul>\n<h2>Qualifications:</h2>\n<ul>\n<li>Basic understanding of software testing principles.</li>\n<li>Familiarity with testing tools like Selenium, Postman, or JMeter is a plus.</li>\n<li>Exposure to AI testing tools (Testim, Applitools) is optional but beneficial.</li>\n<li>Must be eager to learn, explore new technologies, and contribute to projects.</li>\n</ul>\n<h2>How to Apply:</h2>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@zoiteckh.com.</p>",
        "tags": [
            "0-1 Years",
            "Selenium",
            "Postman",
            "JMeter"
        ],
        "summary": "QA Intern position offering hands-on experience in software testing with tools like Selenium. Opportunity to learn AI testing and work on real-time projects. Apply with resume to careers@zoiteckh.com."
    },
    {
        "job_title": "Support Engineer",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20568/4",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Support Engineer</h2>\n<p><strong>Job Summary:</strong>\nAs a Support Engineer, you will report to the Team Leader or Support Manager of the client's Global Support Center and will be responsible for the support of all client solutions to clients worldwide.</p>\n<p>The position requires the following attributes:\n- Very good understanding of the support process cycle\n- Strong team coordination and communication skills\n- Proactive approach to problem-solving</p>\n<p><strong>General Duties:</strong>\n- Provide telephone and on-site support of software products.\n- Diagnose software problems, localize problem sources, and identify bugs.\n- Coordinate the analysis and reproduction of client issues, involving other groups as required.\n- Install and configure SmartVista products.\n- Communicate with clients regarding the steps necessary to maintain and update software products.\n- Assist in the documentation of SmartVista products and installation instructions.\n- Assist in testing new releases and updates.\n- Maintain the operational support environment.\n- Maintain a good knowledge of client products (software and documentation).\n- Participate in building the knowledge base and Q&amp;A for SmartVista products.\n- Provide professional support and assistance to clients to understand their issues and open incidents for resolution by the client support organization with all the relevant and required information.\n- Monitor incident resolution progress and regularly interact with resolver groups for updates and resolution as per the defined product or client SLA.\n- Review client request history to assess risk and update internal teams as required.\n- Take ownership of updating client environments to be used in internal testing and verifications and check that this information is available on the relevant Confluence pages.\n- Work proactively to take cases from the inbox queue to ensure they are managed as required by the SLA.\n- Any other duties and/or responsibilities as may be assigned.</p>\n<p><strong>Requirements:</strong>\n- Fair knowledge of SQL/PLSQL\n- Fair knowledge of C language\n- Fair knowledge in Unix/Linux operation systems as a confident user\n- Self-motivated\n- Excellent people skills\n- Positive attitude\n- Understanding of J2EE (WebLogic)\n- Oracle database administration\n- Understanding of basic principles of e-payments and cards payment technologies\n- Testing</p>\n<p><strong>Experience and Qualification:</strong>\nThe following qualifications are required for the position:\n- Three or more years’ experience with software development or support.\n- Solid experience in ORACLE database administration, SQL/PLSQL, Unix, and WebLogic.\n- Solid experience with ISO8583 messaging or card transaction processing, e-commerce, and mobile remittance.\n- Experience in payment and card processing software.\n- College degree preferred.\n- Post-secondary credit hours in a technical related field such as ORACLE or Unix.\n- Fluent in written and spoken English.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@arttechgroup.com</p>",
        "tags": [
            "3+ Years",
            "SQL/PLSQL",
            "Unix/Linux",
            "Oracle"
        ],
        "summary": "Support Engineer needed for worldwide client solutions. Requires 3+ years of experience in software support, SQL/PLSQL, Unix/Linux, and Oracle databases."
    },
    {
        "job_title": "Digital Marketing Project Manager",
        "company": "Inspite Technologies Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/20570/442",
        "location": "Infopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Digital Marketing Project Manager</h2>\n<p><strong>Company:</strong> Inspite Technologies Pvt Ltd\n<strong>Location:</strong> Infopark, Kochi\n<strong>Employment Type:</strong> Full-time</p>\n<h3>About Us</h3>\n<p>Inspite Technologies Pvt Ltd is a fast-growing IT company specializing in Web Development, Mobile App Development, E-commerce Solutions, and 360° Digital Marketing Services. We work with diverse clients across industries to deliver impactful digital strategies and cutting-edge technology solutions.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Digital Marketing Project Manager who will be responsible for planning, executing, and delivering digital marketing campaigns while also managing web and mobile app development projects. The ideal candidate should have hands-on experience in SEO, SEM, SMM, and campaign management, along with the ability to handle cross-functional teams of designers, developers, and marketers.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Digital Marketing</strong></p>\n<ul>\n<li>Develop, implement, and manage digital marketing strategies (SEO, SEM, PPC, SMM, Email, Content Marketing).</li>\n<li>Monitor, analyze, and report campaign performance with actionable insights.</li>\n<li>Coordinate with the creative team for ad creatives, landing pages, and social media content.</li>\n<li>Manage client expectations, prepare monthly reports, and ensure measurable ROI.</li>\n<li>Stay updated with the latest trends, tools, and technologies in digital marketing.</li>\n</ul>\n<p><strong>Web &amp; App Development Project Management</strong></p>\n<ul>\n<li>Coordinate with developers, designers, and QA teams to ensure timely project delivery.</li>\n<li>Translate client requirements into technical briefs and task lists.</li>\n<li>Track project timelines, budgets, and deliverables, ensuring on-time and quality delivery.</li>\n<li>Conduct regular project review meetings with clients and internal teams.</li>\n<li>Ensure seamless integration between digital marketing campaigns and technology platforms.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, IT, Business Management, or related field.</li>\n<li>2+ years of experience in Digital Marketing with exposure to project management.</li>\n<li>Proven track record of handling SEO/SEM campaigns, social media, and paid ads.</li>\n<li>Experience in managing IT projects (websites, apps, or custom software).</li>\n<li>Strong understanding of Google Ads, Meta Ads, Analytics, SEO tools, and CRMs.</li>\n<li>Excellent communication, leadership, and client-handling skills.</li>\n<li>Ability to multitask and manage multiple projects simultaneously.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Knowledge of Agile/Scrum methodologies.</li>\n<li>Familiarity with tools like Trello, Jira, Asana, or ClickUp.</li>\n<li>Basic technical understanding of WordPress, PHP, Flutter, Angular, React.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n</ul>\n<h3>Salary &amp; Benefits</h3>\n<ul>\n<li>Competitive Salary (based on experience &amp; industry standards).</li>\n<li>Performance-based incentives.</li>\n<li>Opportunity to work with international clients.</li>\n<li>Professional growth through challenging and diverse projects.</li>\n<li>Positive and collaborative work environment at Infopark Kochi.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at hr@inspitetech.com</p>",
        "tags": [
            "2+ Years",
            "Digital Marketing",
            "Project Management",
            "SEO/SEM"
        ],
        "summary": "Digital Marketing Project Manager needed for IT company to manage campaigns and tech projects. Requires 2+ years experience in digital marketing and project management."
    },
    {
        "job_title": "Digital Marketing Manager",
        "company": "Inspite Technologies Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/20571/442",
        "location": "Infopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Digital Marketing Manager</h2>\n<p><strong>Company:</strong> Inspite Technologies Pvt Ltd\n<strong>Location:</strong> Infopark, Kochi\n<strong>Employment Type:</strong> Full-time</p>\n<h3>About the Company</h3>\n<p>Inspite Technologies Pvt Ltd is a leading IT and Digital Solutions provider specializing in Web Development, Mobile App Development, E-commerce Solutions, and 360° Digital Marketing Services. We help businesses grow through data-driven digital strategies and cutting-edge technology solutions.</p>\n<h3>Role Overview</h3>\n<p>We are looking for a Digital Marketing Manager with a minimum of 2 years of experience in managing digital marketing campaigns, leading a team, and handling client projects. The candidate should be well-versed in SEO, SEM, SMM, Paid Ads, and Content Strategies, with the ability to manage multiple projects and deliver measurable results.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Plan, develop, and execute digital marketing strategies across SEO, SEM, Social Media, Email, and Content Marketing.</li>\n<li>Manage and optimize Google Ads, Meta Ads, and other paid campaigns for ROI-driven results.</li>\n<li>Lead, mentor, and guide a team of digital marketers, designers, and content creators.</li>\n<li>Coordinate with clients, understand requirements, and deliver on project goals.</li>\n<li>Track, measure, and analyze campaign performance using Google Analytics, Search Console, and other tools.</li>\n<li>Oversee social media management and content calendars for client accounts.</li>\n<li>Stay updated on the latest digital marketing trends, tools, and technologies.</li>\n<li>Prepare monthly reports and present performance insights to clients and management.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Minimum 2 years of experience in Digital Marketing (agency or client-side).</li>\n<li>Proven expertise in SEO, SEM, Google Ads, Meta Ads, and Social Media Marketing.</li>\n<li>Strong understanding of Google Analytics, Search Console, and SEO tools.</li>\n<li>Ability to manage multiple client projects simultaneously.</li>\n<li>Excellent communication, presentation, and client-handling skills.</li>\n<li>Team management and leadership experience preferred.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience in content strategy and copywriting.</li>\n<li>Familiarity with tools like Trello, Asana, or ClickUp.</li>\n<li>Knowledge of basic WordPress/Website management.</li>\n<li>Certification in Google Ads / Analytics / Digital Marketing is a plus.</li>\n</ul>\n<h3>Salary &amp; Benefits</h3>\n<ul>\n<li>Salary: ₹15,000 – ₹25,000 (based on experience &amp; performance).</li>\n<li>Performance-based incentives.</li>\n<li>Exposure to diverse client projects across industries.</li>\n<li>Career growth and professional development opportunities.</li>\n<li>Friendly and collaborative work culture at Infopark, Kochi.</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@inspitetech.com</p>",
        "tags": [
            "2+ Years",
            "SEO",
            "SEM",
            "Google Ads"
        ],
        "summary": "Digital Marketing Manager needed for Inspite Technologies. Requires 2+ years experience in SEO, SEM, SMM, and Paid Ads, with team leadership skills."
    },
    {
        "job_title": "Digital Marketing Executive Freshers",
        "company": "SayOne Technologies Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/20551/129",
        "location": "Infopark",
        "closing_date": "11 Oct 2025",
        "job_description": "<h1>Digital Marketing Executive (Freshers)</h1>\n<h2>Key Responsibilities:</h2>\n<ul>\n<li>Assist in planning and executing digital marketing campaigns across multiple channels (SEO, SEM, Social Media, Email, Content Marketing).</li>\n<li>Support in managing and updating company website and social media handles.</li>\n<li>Research industry-related topics and contribute ideas for engaging digital content.</li>\n<li>Monitor social media trends, online reviews, and competitors’ activities.</li>\n<li>Assist in preparing performance reports and analyzing campaign results.</li>\n<li>Work closely with the marketing team to brainstorm and implement creative growth strategies.</li>\n</ul>\n<h2>Required Skills &amp; Competencies:</h2>\n<ul>\n<li>Bachelor’s/Master’s degree.</li>\n<li>Basic understanding of digital marketing concepts such as SEO, Google Ads, and Social Media Marketing.</li>\n<li>Familiarity with digital tools is an added advantage.</li>\n<li>Good written and verbal communication skills.</li>\n<li>Creativity, eagerness to learn, and a positive attitude.</li>\n</ul>\n<h2>Job Location:</h2>\n<p>Infopark, Kochi</p>\n<h2>Experience:</h2>\n<p>Freshers or upto 1 year</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@sayonetech.com</p>",
        "tags": [
            "0-1 Years Experience",
            "SEO",
            "Social Media Marketing",
            "Content Marketing"
        ],
        "summary": "Digital Marketing Executive role for freshers assisting in campaign execution, content creation, and performance analysis. Requires a degree and basic digital marketing knowledge."
    },
    {
        "job_title": "Angular Developer",
        "company": "SparkSupport Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20541/63",
        "location": "Infopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Angular Developer</h2>\n<p><strong>Location:</strong> Infopark, Kochi, Kerala\n<strong>Experience:</strong> 2 to 4 Years\n<strong>Employment Type:</strong> Full-Time\n<strong>Work Mode:</strong> On-site/Hybrid/Flexible Timing\n<strong>Shift:</strong> Regular Shift</p>\n<h3>Job Summary</h3>\n<p>We are looking to hire an experienced AngularJS Developer to join our dynamic team. You will be responsible for creating a top-level coding-base using Angular best practices.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Designing and developing user interfaces using AngularJS best practices.</li>\n<li>Adapting interface for modern internet applications using the latest front-end technologies.</li>\n<li>Writing JavaScript, CSS, and HTML.</li>\n<li>Developing product analysis tasks.</li>\n<li>Making complex technical and design decisions for AngularJS projects.</li>\n<li>Developing application codes and unit tests in AngularJS and Rest Web Services.</li>\n<li>Conducting performance tests.</li>\n<li>Consulting with the design team.</li>\n<li>Ensuring high performance of applications and providing support.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor’s degree in computer science, computer engineering or similar.</li>\n<li>Previous work experience as an AngularJS developer.</li>\n<li>Proficient in CSS, HTML, and writing cross-browser compatible code.</li>\n<li>Experience using JavaScript building tools like Gulp or Grunt.</li>\n<li>Knowledge of JavaScript MV-VM/MVC frameworks including AngularJS.</li>\n<li>Excellent project management skills.</li>\n<li>Proven experience implementing front-end and back-end JavaScript applications.</li>\n<li>Excellent communication skills.</li>\n<li>Critical thinker and good problem-solver.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Opportunity to work on challenging and impactful projects.</li>\n<li>Collaborative and supportive team culture.</li>\n<li>Scope for professional growth and skill enhancement.</li>\n<li>Hybrid working environment.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@sparksupport.com</p>",
        "tags": [
            "2-4 Years",
            "AngularJS",
            "JavaScript",
            "CSS"
        ],
        "summary": "Seeking an experienced AngularJS Developer to create a top-level codebase using Angular best practices. Responsibilities include UI design, coding, and performance testing."
    },
    {
        "job_title": "Senior Frontend Developer (Angular)",
        "company": "Softspace Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20552/361",
        "location": "Infopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Senior Frontend Developer (Angular)</h2>\n<p><strong>Job Title:</strong> Senior Frontend Developer (Angular)</p>\n<p><strong>Experience:</strong> 5+ Years (Angular 15+)</p>\n<p><strong>Location:</strong> Cochin</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Key Skills:</strong> Angular (15+), TypeScript, RxJS, Angular Material / PrimeNG, Deployment Experience</p>\n<p><strong>Role Summary:</strong></p>\n<p>We’re looking for an experienced Senior Frontend Developer with strong expertise in Angular 15+ to build and enhance responsive, high-performance web applications.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@softspace.ae</p>",
        "tags": [
            "5+ Years",
            "Angular",
            "TypeScript",
            "RxJS"
        ],
        "summary": "Seeking an experienced Senior Frontend Developer with Angular 15+ expertise to build high-performance web applications. Send your resume to hr@softspace.ae for consideration."
    },
    {
        "job_title": "Senior Full-Stack Developer (.NET Core + Angular)",
        "company": "Softspace Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20553/361",
        "location": "Infopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Senior Full Stack Developer (.NET Core &amp; Angular)</h2>\n<p><strong>Job Title:</strong> Senior Full Stack Developer (.NET Core &amp; Angular)</p>\n<p><strong>Location:</strong> Cochin</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Experience:</strong> 7+ Years</p>\n<h3>Role Summary</h3>\n<p>We are seeking an experienced Senior Full Stack Developer with a proven track record in designing and developing scalable web applications using .NET Core and Angular.</p>\n<h3>Primary Stack:</h3>\n<ul>\n<li>C# .NET 6/7/8</li>\n<li>ASP.NET Core Web API</li>\n<li>Angular 15+</li>\n<li>TypeScript</li>\n<li>RxJS</li>\n<li>SQL Server/EF Core</li>\n<li>Angular Material/PrimeNG</li>\n<li>CI/CD (Azure DevOps/GitHub)</li>\n<li>Docker</li>\n<li>Cloud (Azure/AWS)</li>\n</ul>\n<h3>Contact Information:</h3>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@softspace.ae</p>",
        "tags": [
            "7+ Years",
            ".NET Core",
            "Angular",
            "Full Stack Development"
        ],
        "summary": "Seeking an experienced Senior Full Stack Developer skilled in .NET Core and Angular. Design and develop scalable web applications with a focus on modern technologies."
    },
    {
        "job_title": "Marketing Interns (Male)",
        "company": "NDimensionZ Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/20564/209",
        "location": "Infopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Marketing Intern (Male)</h2>\n<p><strong>Experience:</strong> Fresher</p>\n<p><strong>Qualification:</strong> B.Tech &amp; MBA</p>\n<p><strong>Number of Openings:</strong> 2</p>\n<p><strong>Gender Preference:</strong> Male</p>\n<p><strong>Compensation:</strong> Unpaid</p>\n<p><strong>Benefits:</strong> Travel allowance will be provided, Incentives upon achieving sales.</p>\n<p><strong>About the Role:</strong>\nWe are seeking two enthusiastic marketing interns to assist with on-the-ground sales for three of our products. This is a fantastic opportunity for individuals looking to gain practical experience in field marketing.</p>\n<p><strong>Responsibilities:</strong>\n- Assist with on-the-ground sales activities for designated products.\n- Engage with potential customers and promote products.\n- Gather customer feedback and report findings.\n- Support the marketing team in various field initiatives.</p>\n<p><strong>Qualifications:</strong>\n- Must be a B.Tech and MBA graduate (or pursuing).\n- Strong communication skills are essential.\n- A positive and proactive attitude is required.\n- Ability to work independently and as part of a team.\n- Willingness to engage in direct field marketing.</p>\n<p><strong>Contact Information:</strong>\n- For any queries, please contact: 0484-6689999\n- Email your resume to: hr@ndimensionz.com\n- To apply, please share your updated resume with athira.r@ndimensionz.com</p>",
        "tags": [
            "Fresher",
            "Sales",
            "Marketing",
            "Communication Skills"
        ],
        "summary": "Seeking two marketing interns for on-the-ground sales of three products. Requires strong communication and a positive attitude for field marketing."
    },
    {
        "job_title": "Flutter Intern position",
        "company": "Planet Media India ( PMIN Agency Pvt.Ltd.)",
        "url": "https://infopark.in/company-jobs/details/20567/266",
        "location": "Infopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Flutter Intern Position</h2>\n<p>We’re looking for passionate Flutter Interns to join our team and gain hands-on experience in cross-platform app development.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Assist in designing and developing mobile applications using Flutter.</li>\n<li>Collaborate with the team to build responsive UIs for Android and iOS platforms.</li>\n<li>Integrate APIs, third-party libraries, and backend services.</li>\n<li>Debug, test, and optimize application performance.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Basic understanding of Flutter and Dart.</li>\n<li>Knowledge of mobile app development concepts (Android/iOS).</li>\n<li>Familiarity with Git/GitHub and version control systems.</li>\n<li>Understanding of OOP concepts and UI/UX principles.</li>\n<li>Problem-solving mindset and eagerness to learn new technologies.</li>\n</ul>\n<p><strong>Nice to Have (Optional)</strong></p>\n<ul>\n<li>Experience with Firebase, REST APIs, and GraphQL.</li>\n<li>Knowledge of state management techniques (Provider, GetX, Riverpod, etc.).</li>\n<li>Exposure to responsive UI design and layouts for mobile/web.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@planetmedia.in</p>",
        "tags": [
            "Intern",
            "Flutter",
            "Dart",
            "Mobile App Development"
        ],
        "summary": "Seeking passionate Flutter Interns for cross-platform app development. Gain hands-on experience with Flutter, Dart, and UI design for Android and iOS."
    },
    {
        "job_title": "Content Creator",
        "company": "MarketBytes WebWorks Private Limited",
        "url": "https://infopark.in/company-jobs/details/20569/460",
        "location": "Infopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Content Creator</h2>\n<p><strong>Company:</strong> MarketBytes WebWorks Private Limited\n<strong>Location:</strong> Infopark, Cherthala\n<strong>Job Type:</strong> Full-Time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a creative and detail-oriented Content Creator to join our team at MarketBytes WebWorks Private Limited. In this role, you will be responsible for producing high-quality, engaging, and SEO-friendly content across various platforms. From blog writing and website content to managing content calendars, social media captions, and creative visuals, you will play a key role in strengthening our brand presence and driving audience engagement. This role is ideal for someone who has a passion for storytelling, a strong grasp of SEO, and the ability to adapt content strategies to meet business goals.</p>\n<h3>Key Responsibilities</h3>\n<ol>\n<li><strong>Content Development:</strong> Create well-structured, original, and engaging content for websites, blogs, newsletters, case studies, and social media.</li>\n<li><strong>SEO Content Writing:</strong> Conduct keyword research, optimize content for SEO, and ensure best practices for on-page SEO (meta tags, headings, readability, and keyword placement).</li>\n<li><strong>Content Calendar Management:</strong> Plan, organize, and maintain a content calendar for blogs, social media, and campaigns.</li>\n<li><strong>Social Media Content:</strong> Write compelling posts, captions, and short-form content for platforms such as Facebook, Instagram, LinkedIn, and YouTube.</li>\n<li><strong>Visual &amp; Creative Support:</strong> Collaborate with designers to create supporting graphics, reels, videos, and infographics using tools like Canva or Photoshop.</li>\n<li><strong>Brand Storytelling:</strong> Craft content that reflects the brand voice and enhances audience connection.</li>\n<li><strong>Research &amp; Trend Analysis:</strong> Stay updated with industry trends, competitors, and digital content practices to generate fresh and relevant ideas.</li>\n<li><strong>Performance Tracking:</strong> Monitor and analyze content performance (engagement, reach, SEO ranking) and provide actionable insights for improvement.</li>\n</ol>\n<h3>Skills and Qualifications</h3>\n<p><strong>Content Creation Skills:</strong>\n*   Strong writing, editing, and storytelling abilities with attention to detail.\n*   Ability to write both long-form and short-form content tailored to different audiences.</p>\n<p><strong>SEO Skills:</strong>\n*   Proficiency in keyword research, on-page SEO optimization, and content structuring for search engines.\n*   Familiarity with SEO tools such as Google Analytics, Google Search Console, SEMrush, or Ahrefs.\n*   Understanding of backlink strategies and content optimization for ranking.</p>\n<p><strong>Communication Skills:</strong>\n*   Excellent verbal and written communication skills with a creative flair.</p>\n<p><strong>Technical &amp; Creative Tools:</strong>\n*   Proficiency in Microsoft Office/Google Docs.\n*   Experience with Canva, Photoshop, or video editing tools is a plus.</p>\n<p><strong>Creativity &amp; Trend Awareness:</strong>\n*   Passion for digital storytelling and the ability to generate innovative ideas.\n*   Up-to-date knowledge of social media and content marketing trends.</p>\n<p><strong>Organizational &amp; Analytical Skills:</strong>\n*   Ability to manage multiple projects, meet deadlines, and use insights to optimize content.</p>\n<h3>What We Offer</h3>\n<ol>\n<li><strong>Professional Growth:</strong> Opportunities to enhance your expertise in SEO and content marketing.</li>\n<li><strong>Hands-On Experience:</strong> Exposure to creating impactful content across digital platforms.</li>\n<li><strong>Creative Work Culture:</strong> A collaborative and flexible environment that values innovation and creativity.</li>\n<li><strong>Career Development:</strong> Long-term growth opportunities within the company.</li>\n<li><strong>Learning Resources:</strong> Access to training materials, SEO tools, and industry insights to sharpen your skills.</li>\n</ol>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@marketbyteswebworks.com</p>",
        "tags": [
            "Content Creation",
            "SEO",
            "Social Media",
            "Canva"
        ],
        "summary": "Seeking a creative Content Creator to produce engaging, SEO-friendly content. Responsibilities include writing, social media, and visual creation for MarketBytes WebWorks Private Limited."
    },
    {
        "job_title": "Digital Marketing Specialist",
        "company": "MindLabs Systems Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20545/501",
        "location": "Infopark",
        "closing_date": "25 Oct 2025",
        "job_description": "<h2>Digital Marketing Specialist</h2>\n<p><strong>Company:</strong> MindLabs Systems Pvt. Ltd.</p>\n<p><strong>Job Summary:</strong>\nMindLabs Systems Pvt. Ltd. is seeking a talented Digital Marketing Specialist to elevate our online presence, execute impactful campaigns, and expand brand visibility across digital channels. This position demands strategic acumen, leadership capabilities, and a proven history of achieving quantifiable results.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute comprehensive digital marketing strategies from inception to completion.</li>\n<li>Lead and guide a team of digital marketing professionals and content creators.</li>\n<li>Manage marketing budgets effectively across diverse digital platforms.</li>\n<li>Track key performance indicators (KPIs), measure return on investment (ROI), and recommend optimization tactics.</li>\n<li>Foster collaboration with internal departments and external collaborators/vendors.</li>\n<li>Supervise and manage SEO, SEM, email marketing, and paid advertising initiatives.</li>\n<li>Drive lead generation efforts and enhance customer engagement.</li>\n<li>Enhance the brand's presence across all digital touchpoints.</li>\n<li>Possess experience managing international clients and coordinating worldwide campaigns.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>3–5 years of demonstrable experience in digital marketing.</li>\n<li>Exceptional leadership, communication, and project management abilities.</li>\n<li>Superior written and verbal English communication skills.</li>\n<li>Profound understanding of analytics, SEO, PPC, and marketing automation tools.</li>\n<li>Proven track record of successfully planning and implementing digital marketing campaigns.</li>\n<li>Bachelor's or Master's degree in Marketing, Digital Media, or a related academic discipline.</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<ul>\n<li>Applicants must submit their updated resume and a portfolio showcasing relevant work to the application email.</li>\n<li>Eligible candidates should forward their applications to: hrteam@mindlabssys.com</li>\n<li>Candidates available for immediate joining will be given preference.</li>\n<li><strong>Application Deadline:</strong> 26th October 2025</li>\n<li>This is a <strong>full-time, onsite</strong> position.</li>\n</ul>\n<p>If this role matches your career aspirations, please send your updated resume to hrteam@mindlabssys.com.</p>",
        "tags": [
            "3-5 Years",
            "Digital Marketing",
            "SEO",
            "SEM"
        ],
        "summary": "Digital Marketing Specialist to enhance online presence and drive campaigns. Requires strategic thinking, team leadership, and proven success in digital marketing strategies and analytics."
    },
    {
        "job_title": "Inbound Sales Executive",
        "company": "Techware Lab Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/20565/268",
        "location": "Infopark",
        "closing_date": "26 Oct 2025",
        "job_description": "<h2>Inbound IT Sales Executive</h2>\n<p><strong>Location:</strong> Infopark-Phase 2 (Onsite)</p>\n<p><strong>Experience Required:</strong> 2–4 years</p>\n<h3>About the Role:</h3>\n<p>We are seeking a motivated and dynamic Inbound IT Sales Executive with prior experience in IT services. The ideal candidate will excel at managing inbound leads, fostering strong client relationships, and closing sales opportunities. This role involves working with global clients, making strong international client handling experience and excellent communication skills essential.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage and follow up on inbound leads generated through various channels.</li>\n<li>Establish initial contact with prospective clients, understand their requirements, and present relevant IT service offerings.</li>\n<li>Convert inbound inquiries into qualified sales opportunities and closures.</li>\n<li>Maintain effective communication with global clients and ensure a smooth client experience.</li>\n<li>Build and nurture long-term relationships with prospects and clients.</li>\n<li>Maintain sales pipeline and CRM records, ensuring timely updates and follow-ups.</li>\n<li>Collaborate with internal teams to align client requirements with service delivery.</li>\n<li>Proactively identify potential opportunities and address client needs.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>2–4 years of experience in IT services sales, with proven exposure to international client handling.</li>\n<li>Strong track record of managing inbound leads and converting them into successful sales.</li>\n<li>Excellent communication, negotiation, and interpersonal skills.</li>\n<li>Strong follow-up skills with the ability to manage multiple client interactions effectively.</li>\n<li>Problem-solving mindset with initiative to drive results.</li>\n<li>Ability to work independently as well as in a team environment.</li>\n<li>Familiarity with CRM tools and sales pipeline management is an added advantage.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates shall send the updated profile with the notice period details and current CTC with the subject \"Application for inbound IT sales Executive\" to careers@techwarelab.com.</p>",
        "tags": [
            "2-4 Years",
            "IT Sales",
            "Inbound Leads",
            "Client Handling"
        ],
        "summary": "Seeking an IT Sales Executive with 2-4 years of experience to manage inbound leads and global clients. The role involves converting inquiries into sales and building long-term client relationships."
    },
    {
        "job_title": "Consultant SAP EWM",
        "company": "CCS Technologies (P) Ltd",
        "url": "https://infopark.in/company-jobs/details/20533/43",
        "location": "Infopark",
        "closing_date": "30 Oct 2025",
        "job_description": "<h2>Consultant SAP EWM</h2>\n<p><strong>About CCS</strong></p>\n<p>CCS Technologies has decades of experience delivering technology-driven solutions for their customers. Based out of Kerala, India and with offices in the US and Middle East, we are on a growth path like never before. Working alongside a close-knit team with tremendous exposure to various technologies, this is a place where you will have plenty of opportunities to learn, contribute, and grow!</p>\n<p><strong>What you can expect from the job</strong></p>\n<ul>\n<li>Work on end-to-end warehouse processes: inbound (goods receipt), outbound (goods issue), internal movements, and inventory.</li>\n<li>Configure and optimize warehouse structures (storage types, bins, activity areas).</li>\n<li>Support integration with ERP modules (MM for goods receipt, SD for deliveries, PP for production supply, QM for quality checks).</li>\n<li>Handle RF framework setups and mobile device transactions for warehouse operations.</li>\n<li>Participate in issue resolution (L2/L3 support), debugging with ABAP team when needed.</li>\n<li>Prepare functional specifications for custom developments (reports, enhancements, interfaces).</li>\n<li>Execute testing (Unit, SIT, UAT) and support go-live &amp; hypercare.</li>\n</ul>\n<p><strong>What will help you do the job well</strong></p>\n<p><strong>Must-have skills/ characteristics</strong></p>\n<ul>\n<li>Strong knowledge of warehouse/logistics processes (inbound, outbound, putaway, picking, replenishment, inventory).</li>\n<li>Hands-on SAP EWM configuration skills (warehouse structure, RF framework, HU management, waves, slotting).</li>\n<li>Integration know-how with MM, SD, PP, QM (ERP), and awareness of TM/GTS.</li>\n<li>Basic technical skills: ability to debug ABAP, work with IDocs, BAPIs, RFCs, and troubleshoot interfaces.</li>\n<li>Analytical problem-solving skills to quickly identify root causes and suggest solutions.</li>\n<li>Requirement gathering &amp; documentation – capturing business needs and translating them into SAP solutions.</li>\n<li>Testing &amp; validation skills – ability to design test cases, perform SIT/UAT, and validate business scenarios.</li>\n<li>Certification on EWM</li>\n<li>4+ Years of experience in EWM</li>\n</ul>\n<p><strong>Other desirable skills/characteristics</strong></p>\n<ul>\n<li>Exposure to Automation &amp; Robotics integration (e.g., conveyors, ASRS, MFS).</li>\n<li>Experience with Yard Management and Labor Management.</li>\n<li>Familiarity with Fiori apps/UI5 for warehouse operations.</li>\n<li>Knowledge of decentralized vs. embedded EWM on S/4HANA.</li>\n<li>Understanding of performance tuning and handling large-volume warehouses</li>\n<li>Knowledge of ISMS principles and best practices.</li>\n<li>Willingness to travel domestic/international.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Thank you for your interest with CCS. We hope you find a meaningful career! Please send your profiles to careers@ccs-technologies.com</p>\n<p>We will – Trust, Recognize, Care\nYou will – Learn, Contribute, Grow</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@ccs-technologies.com</p>",
        "tags": [
            "4+ Years",
            "SAP EWM",
            "Warehouse Management",
            "ABAP Debugging"
        ],
        "summary": "Seeking an SAP EWM Consultant with 4+ years of experience in warehouse processes and configuration. Responsibilities include end-to-end warehouse solutions and integration support."
    },
    {
        "job_title": "Sr. Flutter Developer",
        "company": "Portrave Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20566/384",
        "location": "Infopark",
        "closing_date": "30 Oct 2025",
        "job_description": "<h2>Sr. Flutter Developer</h2>\n<p><strong>Knowledge, Skills, and Experience Required:</strong></p>\n<ul>\n<li><strong>Communication:</strong> Ability to communicate clearly and accurately on technical topics in English (verbal and written).</li>\n<li><strong>Mobile Development Experience:</strong> 10+ years of proven commercial mobile development experience.</li>\n<li><strong>Flutter Development:</strong> 4+ years of commercial experience in Flutter development, with the ability to write performant, testable, and maintainable Dart code.</li>\n<li><strong>Native Development:</strong> 3+ years of commercial experience in native Android or iOS development, with expertise in extensive native capabilities.</li>\n<li><strong>Flutter Best Practices:</strong> Knowledge of best practices and patterns for implementation, build, and deployment of mobile applications using Flutter.</li>\n<li><strong>Flutter Tooling:</strong> Extensive experience with Flutter widgets, frameworks, and automated testing suites like Widget testing.</li>\n<li><strong>Testing Methodologies:</strong> Fluent in Test-Driven Development (TDD) and familiar with Behavior-Driven Development (BDD) within the context of Flutter.</li>\n<li><strong>Plugins &amp; Packages:</strong> Exposure to working with Flutter plugins and packages.</li>\n<li><strong>Performance Optimization:</strong> Experience with performance monitoring and improvement of Flutter applications.</li>\n<li><strong>Collaboration Tools:</strong> Knowledge of Git, JIRA, and Confluence.</li>\n<li><strong>API Integration:</strong> Solid experience working with RESTful services and integrating them in mobile environments.</li>\n<li><strong>Cloud Infrastructure:</strong> Experience with cloud-based infrastructure, ideally Firebase and AWS, as relevant to mobile development.</li>\n<li><strong>Real-time Functionality:</strong> Experience in building applications with real-time functionalities using WebSockets or similar technologies.</li>\n<li><strong>Computer Science Fundamentals:</strong> Thorough understanding of Computer Science fundamentals and software patterns.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li><strong>CI/CD:</strong> Experience with building and maintaining CI/CD Pipelines.</li>\n<li><strong>Firebase Crash Reporting:</strong> Experience with Firebase crash reporting.</li>\n<li><strong>Push Notifications:</strong> Experience with OneSignal.</li>\n<li><strong>Build Configuration:</strong> Skills with build configuration using Gradle and Cocoapods.</li>\n<li><strong>Server-Driven UI:</strong> Knowledge with Server driven UI.</li>\n<li><strong>DevOps:</strong> Knowledge of Docker and using Jenkins.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at hr@portrave.com</p>",
        "tags": [
            "10+ Years",
            "Flutter",
            "Dart",
            "Native Android/iOS"
        ],
        "summary": "Senior Flutter Developer with 10+ years of mobile experience. Requires 4+ years Flutter and 3+ years native Android/iOS. Familiar with TDD, CI/CD, and cloud services."
    },
    {
        "job_title": "Senior Data Engineer",
        "company": "Experion Technologies",
        "url": "https://infopark.in/company-jobs/details/20529/103",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Data Engineer</h2>\n<p><strong>Location:</strong> Cochin/TVM / Remote\n<strong>Experience:</strong> 3-8 years total, 3 years relevant\n<strong>Qualification:</strong> Bachelor’s Degree</p>\n<h3>Job Purpose</h3>\n<p>Own the end-to-end data lifecycle by collaborating with cross-functional teams in an Agile, sprint-based environment to achieve business goals.</p>\n<h3>Job Description / Duties &amp; Responsibilities</h3>\n<p><strong>Data Lifecycle Ownership:</strong>\n- Design, build, and maintain scalable data pipelines to ingest raw data into our data lake (bronze layer).\n- Develop and implement robust data models, transforming and enriching data through cleansing, validation (silver layer), and aggregation to create business-ready datasets (gold layer).\n- Establish and enforce data quality and governance standards across the entire data lifecycle.\n- Optimize data platform performance for consumption by analytics, data science, and BI teams.\n- Create and maintain comprehensive documentation for data pipelines, models, and architectures.</p>\n<p><strong>Agile Methodology &amp; Collaboration:</strong>\n- Actively participate in all Agile ceremonies, including sprint planning, daily stand-ups, reviews, and retrospectives.\n- Work closely with Product Owners and stakeholders to understand business requirements and translate them into technical specifications and data models.\n- Collaborate with QA engineers to develop testing strategies, automate data quality checks, and resolve issues.\n- Partner with software developers and platform engineers to ensure seamless integration of data sources and stability of the data platform.\n- Manage tasks, priorities, and timelines effectively within two-week sprint cycles, communicating progress and blockers clearly.\n- To adhere to the Information Security Management policies and procedures.</p>\n<h3>Job Specification / Skills and Competencies</h3>\n<p><strong>Data Lifecycle Ownership (Fabric &amp; Databricks):</strong>\n- Design, build, and maintain scalable data ingestion pipelines using Azure Data Factory, Fabric Data Pipelines, and Databricks Notebooks (PySpark/SQL).\n- Implement and manage a robust Medallion architecture (Bronze/Silver/Gold) across Azure Data Lake Storage (ADLS Gen2) and Fabric OneLake.\n- Develop, optimize, and manage high-performance data models within Databricks (Delta Lake) and Fabric Lakehouses.\n- Optimize Databricks cluster configurations and Fabric capacities for performance, scalability, and cost-efficiency.</p>\n<p><strong>Platform Automation &amp; CI/CD:</strong>\n- Implement and manage CI/CD pipelines for all data solutions using Azure DevOps (Repos, Pipelines).\n- Automate the deployment of Databricks notebooks, Fabric artifacts (Lakehouses, pipelines, reports), and underlying Azure resources (ARM/Bicep templates).\n- Drive the data platform automation strategy, focusing on infrastructure as code (IaC), automated testing, and repeatable release management.\n- Monitor, troubleshoot, and optimize deployment pipelines for speed, reliability, and security.</p>\n<p><strong>Agile Methodology &amp; Collaboration:</strong>\n- Actively participate in all Agile ceremonies, including sprint planning, daily stand-ups, reviews, and retrospectives.\n- Partner closely with Product Owners to understand business requirements and translate them into technical specifications for Fabric and Databricks.\n- Collaborate with QA engineers to integrate automated data quality testing into CI/CD pipelines.\n- Work with Power BI developers and Data Scientists who consume the gold-layer data from Fabric, ensuring their deployment needs are met.</p>\n<h3>Required Qualifications</h3>\n<ul>\n<li>3+ years of proven experience as a Data Engineer with a strong focus on the Azure ecosystem.</li>\n<li>Deep, hands-on expertise with Azure Databricks (including PySpark, Spark SQL, Delta Lake).</li>\n<li>Demonstrable experience with Microsoft Fabric, including OneLake, Lakehouses, and Data Pipelines.</li>\n<li>Proven experience with Azure DevOps (Repos, Pipelines) to build and manage CI/CD pipelines for data workloads.</li>\n<li>Strong understanding of data platform automation and infrastructure as code (IaC) using ARM templates or Bicep.</li>\n<li>Strong proficiency in SQL and Python (PySpark).</li>\n<li>Solid understanding of data modelling principles and the Medallion architecture (bronze/silver/gold).</li>\n<li>Proven experience working in an Agile/Scrum development environment.</li>\n<li>Excellent problem-solving skills and a collaborative, team-first mindset.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Previous domain experience in supply chain, logistics, or operations.</li>\n<li>Microsoft Certification: Azure Data Engineer (DP-203), Fabric Analytics Engineer (DP-600), or DevOps Engineer Expert (AZ-400).</li>\n<li>Experience with data streaming using Databricks Structured Streaming, Azure Event Hubs, or Fabric Real-Time Analytics.</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at sandra.paul@experionglobal.com</p>",
        "tags": [
            "3+ Years",
            "Azure Fabric",
            "Databricks",
            "PySpark"
        ],
        "summary": "Seeking a Senior Data Engineer to own the data lifecycle using Azure Fabric and Databricks. Responsibilities include designing pipelines, data modeling, and collaborating in an Agile environment."
    },
    {
        "job_title": "Junior DevOps – Azure",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20554/269",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Junior DevOps – Azure</h2>\n<p><strong>Job Summary:</strong></p>\n<p>We are seeking a motivated and detail-oriented Junior DevOps Engineer with 2–3 years of experience in Microsoft Azure to join our growing technology team. This role is responsible for assisting in the design, implementation, and maintenance of cloud infrastructure and CI/CD pipelines, helping to streamline development processes and ensure the reliability and scalability of applications.</p>\n<p>The ideal candidate will have solid foundational knowledge of Azure services, scripting, and DevOps practices, along with a strong willingness to learn and grow in a fast-paced, collaborative environment.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Support the setup, configuration, and maintenance of Azure resources (Azure VMs, Azure Blob Storage, Azure Active Directory, Azure Virtual Network, Azure SQL Database, Azure Monitor, Azure Kubernetes Service).</li>\n<li>Assist in building and maintaining CI/CD pipelines using tools like Azure DevOps, GitHub Actions, or Jenkins.</li>\n<li>Help automate deployment processes and infrastructure provisioning using Infrastructure as Code (IaC) tools such as ARM templates, Bicep, or Terraform.</li>\n<li>Monitor system performance and availability using Azure Monitor, Log Analytics, and Application Insights.</li>\n<li>Develop dashboards and configure alerts in Azure Monitor, Grafana, or similar tools to track system health and performance.</li>\n<li>Collaborate with development and QA teams to troubleshoot and resolve application/infrastructure issues and ensure smooth application releases.</li>\n<li>Follow DevOps best practices including version control, configuration management, and environment management.</li>\n<li>Document processes and contribute to internal knowledge bases.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Basic understanding of core Microsoft Azure services.</li>\n<li>Strong experience with Windows and Linux operating systems and environments.</li>\n<li>Familiarity with CI/CD tools and processes.</li>\n<li>Knowledge of scripting languages such as PowerShell, Bash, or Python.</li>\n<li>Exposure to source control tools such as Git.</li>\n<li>Working knowledge of Infrastructure as Code (Terraform or ARM/Bicep).</li>\n<li>Strong problem-solving and communication skills.</li>\n<li>A degree in Computer Science, Engineering, or a related field.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "2-3 Years",
            "Azure",
            "CI/CD",
            "IaC"
        ],
        "summary": "Junior DevOps Engineer with 2-3 years of Azure experience. Responsible for cloud infrastructure, CI/CD pipelines, and automation in a collaborative environment."
    },
    {
        "job_title": "Junior Business Analyst",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20555/269",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Junior Business Analyst</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Works with Clients to define high-level requirements and capture business needs.</li>\n<li>Demonstrating the Products to prospective customers.</li>\n<li>Working independently and jointly in unstructured environments in a self-directed way.</li>\n<li>Explore, analyze, and utilize various software platforms from an end-user perspective.</li>\n<li>Coordinating with Development and Testing teams.</li>\n<li>Manage multiple tasks at once to meet demanding deadlines.</li>\n<li>Developing functional and non-functional requirements.</li>\n<li>Attending management status meetings.</li>\n<li>Schedule and ensure all sprint ceremonies are done in a timely and effective manner.</li>\n<li>Make sure all FRS documents are ready and sign-off is received before the sprint start date.</li>\n<li>Review and approve test cases.</li>\n<li>Flexibility and availability for client calls are essential to meet client needs effectively.</li>\n</ul>\n<p><strong>Desired Skills:</strong></p>\n<ul>\n<li>Excellent critical thinking and problem-solving skills.</li>\n<li>Good written and verbal communication skills.</li>\n<li>Detail-oriented with strong organizational skills.</li>\n<li>Experience with Microsoft Office tools.</li>\n</ul>\n<p><strong>Experience and Qualification:</strong></p>\n<ul>\n<li>Freshers</li>\n<li>2024/2025 pass out - B.Tech/MCA/MBA (Computer Science/ IT /Biotechnology)</li>\n</ul>\n<p><strong>Contact:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "0-1 Years",
            "Business Analysis",
            "Agile",
            "Requirement Gathering"
        ],
        "summary": "Junior Business Analyst role for freshers with B.Tech/MCA/MBA. Responsibilities include requirement gathering, client communication, and coordinating with development teams. Must be detail-oriented with strong analytical skills."
    },
    {
        "job_title": "Linux DevOps – Team Lead",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20556/269",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Linux DevOps – Team Lead</h2>\n<p><strong>Job Description</strong></p>\n<ul>\n<li>Lead, mentor, and manage a team of DevOps engineers and Linux administrators to achieve project and operational goals.</li>\n<li>Architect, implement, and manage scalable Linux-based infrastructure on AWS using core services such as EC2, S3, RDS, VPC, IAM, Lambda, CloudFormation, CloudWatch, and more.</li>\n<li>Develop, maintain, and optimize CI/CD pipelines using Jenkins, GitLab CI, or equivalent.</li>\n<li>Automate infrastructure provisioning and configuration management using tools like Terraform, Ansible, or CloudFormation.</li>\n<li>Manage container orchestration platforms such as Kubernetes and Docker to support microservices deployment.</li>\n<li>Define, implement, and enforce DevOps best practices including security, monitoring, logging, backup, and disaster recovery.</li>\n<li>Collaborate with development, QA, and operations teams to ensure smooth and timely deployments.</li>\n<li>Oversee incident management, root cause analysis, and troubleshooting of complex production issues.</li>\n<li>Drive continuous process improvements, including documentation of infrastructure, runbooks, standard operating procedures (SOPs), and best practices.</li>\n<li>Ensure compliance with organizational security policies, audit requirements, and industry standards.</li>\n<li>Engage with stakeholders to gather requirements and provide transparent progress updates.</li>\n</ul>\n<p><strong>Skills</strong></p>\n<ul>\n<li>6 years of Linux system administration and AWS experience with deep troubleshooting and performance tuning skills.</li>\n<li>Minimum 2 years of experience leading DevOps teams and projects.</li>\n<li>Strong experience with AWS services such as EC2, S3, RDS, VPC, IAM, Lambda, CloudFormation, CloudWatch, and others.</li>\n<li>Proven skills in building and managing CI/CD pipelines (Jenkins, GitLab CI, CircleCI).</li>\n<li>Expertise in automation and configuration management tools (Terraform, Ansible, Shell Script).</li>\n<li>Hands-on experience with containerization (Docker) and orchestration (Kubernetes).</li>\n<li>Solid scripting ability in Bash, Python, or equivalent languages.</li>\n<li>Experience with monitoring and logging tools like Prometheus, Grafana, ELK Stack, or CloudWatch.</li>\n<li>Strong knowledge of networking, security best practices, and cloud architecture principles.</li>\n<li>Excellent leadership, communication, and stakeholder management skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "6+ Years",
            "AWS",
            "Linux",
            "DevOps"
        ],
        "summary": "Lead a DevOps team in architecting and managing Linux infrastructure on AWS. Responsibilities include CI/CD, automation, and ensuring best practices for scalable deployments."
    },
    {
        "job_title": "Junior DevOps – AWS",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20557/269",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Junior DevOps – AWS</h2>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Deploy, manage, and troubleshoot resources in AWS (EC2, S3, IAM, VPC, RDS, CloudWatch, ECS/EKS).</li>\n<li>Assist in designing and maintaining secure and scalable cloud infrastructure.</li>\n<li>Support cost optimization and tagging practices.</li>\n<li>Set up and manage CI/CD pipelines using tools like GitHub Actions, GitLab CI/CD, or Jenkins.</li>\n<li>Automate deployment workflows and environment provisioning.</li>\n<li>Write and maintain Infrastructure as Code (IaC) using Terraform or AWS CloudFormation.</li>\n<li>Work with Docker containers; Kubernetes, ECS for orchestration.</li>\n<li>Monitor infrastructure and applications using CloudWatch, Prometheus, Grafana, or ELK stack.</li>\n<li>Develop dashboards and alerts in tools like Zabbix, Nagios, and Grafana to visualize infrastructure health and spot performance issues.</li>\n<li>Collaborate with developers to troubleshoot and resolve application/infrastructure issues.</li>\n<li>Manage, configure, maintain Linux servers (e.g., RHEL, CentOS, Ubuntu).</li>\n</ul>\n<h3>Skills:</h3>\n<ul>\n<li>2+ years of hands-on DevOps experience.</li>\n<li>Solid understanding of AWS services.</li>\n<li>Strong experience with Linux/Unix environments.</li>\n<li>Experience with CI/CD tools (GitHub Actions, Jenkins, GitLab CI/CD).</li>\n<li>Familiar with Docker and container lifecycle.</li>\n<li>Hands-on experience with containerization (Docker) and orchestration (Kubernetes).</li>\n<li>Working knowledge of Infrastructure as Code (Terraform or CloudFormation).</li>\n<li>Scripting skills in Shell, Bash, or Python.</li>\n<li>Familiarity with monitoring/logging tools like Prometheus, ELK, Datadog.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "2+ Years",
            "AWS",
            "Docker",
            "Terraform"
        ],
        "summary": "Junior DevOps role focused on AWS cloud infrastructure management. Responsibilities include CI/CD, IaC, containerization, and monitoring for scalable solutions."
    },
    {
        "job_title": "SOC ENGINEER",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20558/269",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>SOC ENGINEER</h2>\n<p>We are seeking a detail-oriented and proactive Level 1 (L1) and Level 2 (L2) SOC Engineer with 2–3 years of experience in cybersecurity monitoring and incident response. This role is responsible for real-time monitoring, detection, analysis, and response to security events and threats across the organization’s infrastructure. The candidate must be flexible to work in 24/7 rotating shifts, including nights, weekends, and holidays.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Monitor security events and alerts using SIEM tools.</li>\n<li>Triage alerts to determine severity, impact, and appropriate response actions.</li>\n<li>Investigate anomalous network activity, system logs, and endpoint behaviour to identify potential threats.</li>\n<li>Respond to and contain security incidents following defined SOC procedures and escalation paths.</li>\n<li>Perform root cause analysis (RCA) and document findings in incident reports.</li>\n<li>Assist with vulnerability assessments, threat intelligence, and ongoing threat hunting efforts.</li>\n<li>Work with IT and network teams to implement remediation steps and enhance preventive controls.</li>\n<li>Contribute to the development and refinement of SOC playbooks, SOPs, and response strategies.</li>\n<li>Stay informed about current cybersecurity trends, TTPs (Tactics, Techniques, and Procedures), threat actors, and zero-day exploits.</li>\n<li>Support compliance audits, internal/external security assessments, and regular security drills.</li>\n</ul>\n<h3>Required Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree or Diploma in Cybersecurity, Information Technology, Computer Science, or related field.</li>\n<li>2–3 years of experience in a Security Operations Center (SOC) or equivalent cybersecurity role.</li>\n<li>Familiarity with SIEM tools, log analysis, and threat detection techniques.</li>\n<li>Experience with firewalls, IDS/IPS, antivirus, and EDR/XDR platforms.</li>\n<li>Strong analytical and troubleshooting skills with the ability to work under pressure.</li>\n<li>Excellent written and verbal communication skills for documenting and reporting incidents.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Certifications such as CompTIA Security+, CEH, CySA+, or Splunk Certified Analyst.</li>\n<li>Experience with scripting or automation (e.g., Python, PowerShell, Bash).</li>\n<li>Familiarity with EDR solutions (e.g., CrowdStrike, SentinelOne, Carbon Black).</li>\n<li>Exposure to cloud security monitoring (AWS, Azure, GCP).</li>\n<li>Knowledge of packet analysis tools (Wireshark, tcpdump) and forensic techniques.</li>\n<li>Experience contributing to SOC process improvement, alert tuning, or playbook automation.</li>\n<li>Experience supporting or participating in security audits and assessments based on frameworks such as SOC 2, ISO 27001, or NIST CSF.</li>\n<li>Hands-on experience with penetration testing tools such as Burp Suite, Qualys, Nessus, or OpenVAS to validate vulnerabilities or support security assessments.</li>\n<li>Experience securing CI/CD pipelines, including static/dynamic code analysis, container scanning, and code-to-cloud deployment monitoring.</li>\n<li>Familiarity with security tools integrated into pipelines (e.g., Snyk, SonarQube, Trivy, Checkov, or GitHub Advanced Security etc).</li>\n</ul>\n<h3>Work Environment:</h3>\n<ul>\n<li>This is a 24/7 operations role. Candidates must be flexible to work in rotating shifts, including night shifts, weekends, and holidays, as part of a global security operations coverage model.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "2-3 Years",
            "SIEM",
            "Incident Response",
            "EDR"
        ],
        "summary": "Seeking an L1/L2 SOC Engineer with 2-3 years of experience in cybersecurity monitoring and incident response. Responsibilities include real-time threat detection, analysis, and response across the organization's infrastructure."
    },
    {
        "job_title": "NOC Engineer",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20559/269",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>NOC Engineer</h2>\n<p>We are seeking a skilled and proactive Level 1 (L1) and Level 2 (L2) NOC Engineer with 2–3 years of experience to join our team. This role is responsible for monitoring and maintaining the health of network and system infrastructure to ensure continuous availability, performance, and stability. The ideal candidate should be flexible to work in a 24/7 rotating shift environment (including nights, weekends, and holidays), respond promptly to incidents, and coordinate effectively with technical teams to minimize downtime.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Monitor network systems, servers, and applications using tools such as Zabbix, SolarWinds, or PRTG or equivalent.</li>\n<li>Respond to system alerts, outages, and performance degradation within defined Service Level Agreements (SLAs).</li>\n<li>Troubleshoot and resolve network, server, or system issues; escalate incidents when necessary.</li>\n<li>Perform routine health checks, backups, patching, and system maintenance tasks.</li>\n<li>Accurately document incidents, actions taken, and resolutions using ITSM or ticketing tools (e.g., ServiceNow, JIRA).</li>\n<li>Collaborate with IT and infrastructure teams to support continuous operations and incident resolution.</li>\n<li>Follow Standard Operating Procedures (SOPs) and contribute to documentation updates and process improvement.</li>\n<li>Participate in shift handovers, reporting, and internal knowledge-sharing sessions.</li>\n<li>Maintain awareness of ongoing issues and proactively identify patterns or recurring incidents.</li>\n</ul>\n<h3>Required Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree/Diploma in information technology, Computer Science, or a related field.</li>\n<li>2–3 years of hands-on experience in a NOC, IT operations, or infrastructure support role.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "2-3 Years",
            "NOC",
            "Zabbix",
            "SolarWinds"
        ],
        "summary": "NOC Engineer to monitor and maintain network infrastructure. Responsibilities include incident response, troubleshooting, and system maintenance in a 24/7 environment."
    },
    {
        "job_title": "Senior Talent Acquisition Specialist",
        "company": "Feathersoft Info Solutions Private Ltd",
        "url": "https://infopark.in/company-jobs/details/20560/269",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Talent Acquisition Specialist</h2>\n<h3>Job Summary:</h3>\n<p>We are looking for a highly motivated and experienced Senior IT Recruiter to join our talent acquisition team. The ideal candidate will have deep expertise in sourcing, screening, and hiring top-tier IT talent across various technologies and roles. You will lead the end-to-end recruitment process, build strong relationships with hiring managers, and ensure an excellent candidate experience.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage the full recruitment lifecycle for IT positions including Software Development, Infrastructure, Security, Data Science, and more.</li>\n<li>Develop and implement strategic sourcing plans to attract high-quality candidates using multiple channels (job boards, social media, networking, referrals).</li>\n<li>Screen resumes, conduct phone and video interviews, assess technical skills in collaboration with hiring managers.</li>\n<li>Build and maintain strong relationships with internal stakeholders to understand hiring needs and deliver timely recruitment solutions.</li>\n<li>Maintain and update applicant tracking systems (ATS) and recruitment databases.</li>\n<li>Coordinate interview schedules and facilitate onboarding processes.</li>\n<li>Stay updated with the latest trends in IT recruitment and market conditions.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Human Resources, Business Administration, IT, or related field.</li>\n<li>Minimum 3 years of experience in IT recruitment or technical staffing.</li>\n<li>Proven experience hiring for roles such as software engineers, system administrators, data analysts, cybersecurity specialists, etc.</li>\n<li>Strong understanding of various IT roles, technologies, and industry trends.</li>\n<li>Proficiency with ATS and recruitment tools (LinkedIn Recruiter, Indeed, GitHub, etc.).</li>\n<li>Excellent communication, negotiation, and interpersonal skills.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n<li>Strong organizational and time management skills.</li>\n</ul>\n<h3>Good to have:</h3>\n<ul>\n<li>Experience recruiting for life sciences-related positions (e.g., biotech, pharma, healthcare IT) is a plus.</li>\n<li>Understanding of the specific skill sets and compliance requirements in the life sciences industry.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@feathersoft.com</p>",
        "tags": [
            "3+ Years",
            "IT Recruitment",
            "ATS",
            "Sourcing"
        ],
        "summary": "Seeking an experienced Senior IT Recruiter to manage the full recruitment lifecycle. Responsibilities include sourcing, screening, and hiring top IT talent while ensuring an excellent candidate experience."
    },
    {
        "job_title": "Python Lead",
        "company": "Focaloid Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/20563/366",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Python Lead</h2>\n<p>We are searching for highly passionate Python developers with sound experience who can be involved in the end-to-end development of our company's products and projects' modules. You will work closely with project managers and system specialists to achieve success.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, build, and maintain efficient, reusable, and reliable Python services &amp; components.</li>\n<li>Ensure the best possible performance, quality, and security.</li>\n<li>Identify bottlenecks and bugs, and devise solutions to these problems.</li>\n<li>Help maintain code quality and organization.</li>\n<li>Understanding of established software development life cycles.</li>\n<li>Ability to prioritize and multi-task to meet deadlines.</li>\n<li>Resolve technical issues through debugging, research, and investigation.</li>\n<li>Collaborate across various teams and with external clients.</li>\n<li>Contribute innovative designs and ideas for improving our company products and services.</li>\n</ul>\n<h3>Required Skill Sets:</h3>\n<ul>\n<li>At least 8+ years of experience in Design and Development with Python.</li>\n<li>Experience in Flask / Django.</li>\n<li>Familiar with version control (Git).</li>\n<li>Understanding of SQL.</li>\n<li>Strong Unit Testing practice.</li>\n<li>Understanding of design patterns, Microservices Architecture.</li>\n<li>Understanding of Scrum Agile methodology.</li>\n<li>Experience in data engineering &amp; Docker is a plus.</li>\n</ul>\n<h3>Candidate Profile:</h3>\n<ul>\n<li>8+ Years of relevant experience with Python and its Principles.</li>\n<li>Graduate in Computer Science or any related discipline (like BS / B.E. / B-Tech in Electronics, Electrical, IT).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at ajish.prabhakaran@focaloid.com.</p>",
        "tags": [
            "8+ Years",
            "Python",
            "Flask/Django",
            "Microservices"
        ],
        "summary": "Seeking a passionate Python Lead with 8+ years of experience in end-to-end product development. Responsibilities include designing, building, and maintaining Python services, ensuring quality, and collaborating with teams. Requires strong Python, Flask/Django, Git, and SQL skills."
    },
    {
        "job_title": "Manager- Finance & Accounts",
        "company": "Syriac Consultancy Services Private Limited",
        "url": "https://infopark.in/company-jobs/details/20572/433",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Manager - Finance &amp; Accounts</h2>\n<p><strong>Location:</strong> Kochi Infopark\n<strong>Job Type:</strong> Full-Time\n<strong>Working Days:</strong> Monday to Friday and Alternative Saturdays\n<strong>Working Hours:</strong> 8:30 PM – 5:30 AM (Night Shift)</p>\n<h3>Company Description</h3>\n<p>Syriac CPA is an established CPA firm with offices in Los Angeles and Orange County, serving clients for more than twenty years. We are seeking a Manager- Finance &amp; Accounts with strong experience in accounting to join our professional team. This is an on-site position from our Cochin office.</p>\n<h3>Role Description</h3>\n<p>We are seeking a highly skilled and detail-oriented Manager – Accounts &amp; Finance to oversee financial operations, with a strong focus on Accounts Management and Accounts Receivable.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Oversee overall accounting and finance operations.</li>\n<li>Manage Accounts Management and Accounts Receivable functions.</li>\n<li>Handle financial transactions and ensure accuracy in records.</li>\n<li>Prepare and review financial statements, MIS reports, and forecasts.</li>\n<li>Ensure compliance with accounting standards, tax regulations, and company policies.</li>\n<li>Coordinate with internal and external auditors during audits.</li>\n<li>Conduct financial analysis to support strategic decision-making.</li>\n<li>Develop and implement financial strategies aligned with business objectives.</li>\n<li>Lead and mentor the accounts &amp; finance team to ensure efficiency.</li>\n<li>Liaise with US-based clients and stakeholders for financial matters.</li>\n<li>Provide financial advice and recommendations to management.</li>\n<li>Ensure timely and accurate reporting of financial information.</li>\n</ul>\n<h3>Key Requirements:</h3>\n<ul>\n<li>Strong knowledge of accounting principles and financial reporting.</li>\n<li>Proven experience in Accounts Receivable and Accounts Management.</li>\n<li>Excellent communication skills in English (written and verbal) to interact with US clients.</li>\n<li>Ability to manage a team effectively and meet deadlines.</li>\n<li>Detail-oriented, analytical, and strategic thinker.</li>\n<li>Familiarity with compliance, taxation, and audit processes.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li><strong>Educational Qualification:</strong> CA / CMA / MBA (Finance) / M.Com or Equivalent.</li>\n<li><strong>Experience Required:</strong> Minimum 9 years of experience in Accounts &amp; Finance, with at least 2+ years in a Team Lead role.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at syriacconsultancy@gmail.com</p>",
        "tags": [
            "9+ Years",
            "Accounting",
            "Financial Reporting",
            "Accounts Receivable"
        ],
        "summary": "Seeking a Manager - Finance & Accounts in Kochi for night shifts. Oversee accounting, manage AR, and liaise with US clients. Requires CA/CMA/MBA with 9+ years experience."
    },
    {
        "job_title": "Senior WEBGL Developer",
        "company": "Fingent Global Solutions",
        "url": "https://infopark.in/company-jobs/details/20531/83",
        "location": "Infopark",
        "closing_date": "25 Nov 2025",
        "job_description": "<h2>Senior WEBGL Developer</h2>\n<p>At Fingent, we believe that what we build touches lives around us. We nurture thought leaders and encourage them to be the seeds of change through smart software development and consulting services – ultimately laying the foundation for a better and smarter future. Our culture of openness, honesty, and trust fosters an environment of learning and growth. We value – the desire to be the best at what you do, the ability to support your peers, and most of all, the desire to be a good human being.</p>\n<p>We are looking for an experienced Sr. WEBGL developer to develop web-based 3D configurators, virtual walk-through experiences, and web-based graphic content produced at Fingent. This role includes coordinating with various departments such as Development, 3D Asset Integration, Product Management, and Quality, ensuring the project meets its technical quality specifications by planning, architecting, delegating, and working hands-on. You will be the main point of contact to design and develop WebGL-based immersive content produced at Fingent.</p>\n<h3>Roles &amp; Responsibilities:</h3>\n<ul>\n<li>Developing 3D WEBGL immersive contents using Three.js, Babylon.js, three.ar.js, Playcanvas, Scene.js</li>\n<li>Understand the technical and specification requirements of the client</li>\n<li>Estimating the development aspects of the project at the initial stage</li>\n<li>Designing and Developing Software Architecture</li>\n<li>Developing quality immersive content and bug fixing</li>\n<li>Maintaining Code Quality and Standards</li>\n<li>Working hands-on in projects that shall be deployed in different web browsers</li>\n<li>Working on Web AR projects using 8th Wall, AR.js, XR.+, and other web AR platforms</li>\n<li>Effectively coordinating with the other pipeline heads for successful project delivery</li>\n</ul>\n<h3>Skills Required:</h3>\n<ul>\n<li>3-5 years of experience as a WEBGL developer using three.js, Babylon.js, Playcanvas, Scene.js</li>\n<li>Development knowledge of 3D configurators, Real estate walkthroughs, and 3D visualization through WEBGL is mandatory</li>\n<li>Worked on solutions supported on all platforms, such as PC, Mobile, and Tablet</li>\n<li>Proficient understanding of cross-browser compatibility issues</li>\n<li>Experience in setting up Projects with Webpack and the various loaders and plugins.</li>\n<li>Strong in JavaScript</li>\n<li>Strong in front-end development</li>\n<li>Knowledge of WEB AR is a plus</li>\n<li>Strong in Object Oriented Programming</li>\n<li>Knowledge of PBR Texturing, Light Baking, and 3D Optimization is a plus</li>\n<li>Creative and extroverted</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@fingent.com.</p>",
        "tags": [
            "3-5 Years",
            "WEBGL",
            "Three.js",
            "JavaScript"
        ],
        "summary": "Experienced Sr. WEBGL developer needed for web-based 3D configurators and virtual experiences. Must have 3-5 years of experience and strong JavaScript skills."
    },
    {
        "job_title": "Linux Server Administrator (Proxmox & Networking Specialist)",
        "company": "HashRoot Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20579/61",
        "location": "Infopark",
        "closing_date": "27 Nov 2025",
        "job_description": "<h2>Linux Server Administrator (Proxmox &amp; Networking Specialist)</h2>\n<p>We are seeking a highly skilled Linux Server Administrator with extensive experience in Linux operating systems, Proxmox VE, networking, and system troubleshooting to become a vital part of our IT team. In this role, you will be responsible for managing and securing our server infrastructure, ensuring high availability, and providing support for both remote and onsite operations.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Install, configure, and maintain Linux servers across various distributions (Debian, Ubuntu, CentOS, RHEL, Fedora).</li>\n<li>Manage user accounts, permissions, security protocols, and implement server hardening techniques.</li>\n<li>Deploy and manage Proxmox VE environments, including virtual machines (VMs), containers, clustering, and backup solutions.</li>\n<li>Configure and troubleshoot core networking services such as DNS, DHCP, NAT, VPN, VLANs, and firewalls (iptables, nftables, ufw).</li>\n<li>Monitor system performance and health using tools like Zabbix, Nagios, Prometheus, and Grafana.</li>\n<li>Perform in-depth troubleshooting of operating system issues, hardware problems, log analysis, and performance bottlenecks.</li>\n<li>Coordinate with onsite personnel for hardware replacements and system upgrades.</li>\n<li>Maintain comprehensive system documentation and contribute to disaster recovery planning and execution.</li>\n</ul>\n<h3>Skills &amp; Requirements:</h3>\n<ul>\n<li>A minimum of 3 years of experience in Linux server administration.</li>\n<li>Strong, hands-on knowledge of Proxmox VE and fundamental networking concepts.</li>\n<li>Proven experience with system monitoring and troubleshooting tools.</li>\n<li>Familiarity with RAID configurations and server management interfaces (iLO, iDRAC, IPMI).</li>\n<li>Relevant certifications such as RHCSA/RHCE, Linux+, or LFCS are considered a significant plus.</li>\n<li>Experience with scripting languages (Bash/Python) and cloud platforms (AWS/Azure/GCP) is desirable.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Engage in a hands-on role working with cutting-edge Linux and virtualization technologies.</li>\n<li>Become part of a growth-focused team culture that encourages skill expansion and professional development.</li>\n</ul>\n<p>We are eager to connect with passionate Linux professionals! If this opportunity resonates with your skills and career aspirations, please forward your updated resume to <strong>careers@hashroot.com</strong>.</p>",
        "tags": [
            "3+ Years",
            "Linux",
            "Proxmox",
            "Networking"
        ],
        "summary": "Seeking a Linux Server Administrator experienced in Proxmox VE and networking to manage server infrastructure. Responsibilities include installation, configuration, troubleshooting, and ensuring system availability."
    },
    {
        "job_title": "Digital Marketing Specialist",
        "company": "Nestsoft TechnoMaster PVT LTD",
        "url": "https://infopark.in/company-jobs/details/20547/439",
        "location": "Infopark",
        "closing_date": "25 Sep 2026",
        "job_description": "<h2>Digital Marketing Specialist</h2>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Develop, execute, and manage advanced SEO strategies to improve organic search rankings and traffic.</li>\n<li>Conduct detailed keyword research, competitor analysis, and site audits.</li>\n<li>Optimize website architecture, content, and internal linking structure for maximum visibility.</li>\n<li>Implement and monitor on-page, off-page, and technical SEO improvements.</li>\n<li>Work with the content team to create high-quality, SEO-friendly content.</li>\n<li>Track, analyze, and report on website performance using tools such as Google Analytics, Google Search Console, SEMrush, Ahrefs, Screaming Frog, etc.</li>\n<li>Stay updated with the latest search engine algorithms, trends, and best practices.</li>\n<li>Collaborate with the design, development, and marketing teams to ensure smooth execution of digital campaigns.</li>\n<li>Assist in paid marketing efforts (Google Ads, Meta Ads) if required, and align them with SEO strategies.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications</strong></p>\n<ul>\n<li>Proven work experience as an SEO Specialist / Digital Marketing Specialist.</li>\n<li>Strong understanding of on-page, off-page, and technical SEO principles.</li>\n<li>Hands-on experience with SEO tools: SEMrush, Ahrefs, Moz, Screaming Frog, etc.</li>\n<li>Good knowledge of Google Analytics, Google Tag Manager, Search Console.</li>\n<li>Experience with content strategy and link-building campaigns.</li>\n<li>Familiarity with HTML, CSS, and website CMS platforms (WordPress preferred).</li>\n<li>Strong analytical, problem-solving, and communication skills.</li>\n<li>Ability to work independently and deliver results in a deadline-driven environment.</li>\n</ul>\n<p><strong>Nice-to-Have Skills</strong></p>\n<ul>\n<li>Experience with local SEO and GMB optimization.</li>\n<li>Understanding of conversion rate optimization (CRO).</li>\n<li>Knowledge of paid ads, social media marketing, and email campaigns.</li>\n<li>Familiarity with AI-powered SEO tools and automation.</li>\n</ul>\n<p><strong>What We Offer</strong></p>\n<ul>\n<li>Competitive salary and performance bonuses.</li>\n<li>Opportunity to work on exciting projects with measurable impact.</li>\n<li>Supportive team environment with career growth opportunities.</li>\n<li>Flexible working hours / remote work option (if applicable).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@nestsoft.com</p>",
        "tags": [
            "2+ Years",
            "SEO",
            "Google Analytics",
            "SEMrush"
        ],
        "summary": "Seeking an SEO Specialist to develop and execute digital marketing strategies. Responsibilities include SEO optimization, content creation, and performance analysis using various tools."
    },
    {
        "job_title": "Zoho Books Expert",
        "company": "Nestsoft TechnoMaster PVT LTD",
        "url": "https://infopark.in/company-jobs/details/20548/439",
        "location": "Infopark",
        "closing_date": "25 Sep 2026",
        "job_description": "<h2>Zoho Books Expert</h2>\n<p>We are looking for an experienced Zoho Books Expert to manage and optimize our financial processes using Zoho Books. The ideal candidate will be responsible for setting up, customizing, and maintaining Zoho Books to ensure smooth and accurate bookkeeping, compliance, and reporting.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Set up, configure, and customize Zoho Books according to business requirements.</li>\n<li>Manage daily bookkeeping tasks including invoices, payments, expenses, and reconciliations.</li>\n<li>Generate and analyze financial reports such as Profit &amp; Loss, Balance Sheet, and Cash Flow.</li>\n<li>Automate workflows within Zoho Books for improved efficiency.</li>\n<li>Ensure compliance with tax regulations (GST, TDS, etc., if applicable).</li>\n<li>Integrate Zoho Books with other Zoho applications (CRM, Payroll, Inventory) or third-party tools.</li>\n<li>Troubleshoot and resolve issues related to Zoho Books usage.</li>\n<li>Train staff on using Zoho Books effectively.</li>\n<li>Coordinate with the finance team and management to provide accurate financial insights.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Proven experience in managing Zoho Books (minimum 1-2 years preferred).</li>\n<li>Strong knowledge of accounting principles and financial reporting.</li>\n<li>Familiarity with tax compliance requirements (GST, VAT, TDS as per region).</li>\n<li>Experience integrating Zoho Books with CRM, Inventory, or Payment Gateways.</li>\n<li>Good analytical and problem-solving skills.</li>\n<li>Excellent communication and documentation skills.</li>\n<li>Ability to work independently and manage deadlines.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Zoho Certified Professional (Zoho Books Certification is a plus).</li>\n<li>Experience with other Zoho apps (Zoho CRM, Zoho Analytics, Zoho Inventory).</li>\n<li>Experience in automating accounting processes using custom workflows.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@nestsoft.com</p>",
        "tags": [
            "1-2 Years",
            "Zoho Books",
            "Bookkeeping",
            "Financial Reporting"
        ],
        "summary": "Seeking a Zoho Books Expert to manage financial processes. Responsibilities include setup, bookkeeping, reporting, and integrations. Requires accounting knowledge and 1-2 years of Zoho Books experience."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23837",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h1>Telesales Executive</h1>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd\n<strong>Location:</strong> 1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> www.trainonexsolutions.in\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Job Published:</strong> 27, Sept 2025\n<strong>Closing Date:</strong> 30, Sept 2025</p>\n<h2>Brief Description</h2>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<h2>Requirements</h2>\n<ul>\n<li><strong>Experience:</strong> 0-1 years required (Freshers can also apply)</li>\n<li><strong>Joiners:</strong> Immediate joiners preferred</li>\n<li><strong>Work Type:</strong> Work from office opportunity</li>\n<li><strong>Candidates:</strong> Male and Female candidates preferred</li>\n<li><strong>Language:</strong> Fluency with Malayalam Language</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Communication"
        ],
        "summary": "Seeking a motivated Telesales Executive for phone sales and customer relations. Goal is to identify clients, qualify leads, and close deals to drive company growth."
    },
    {
        "job_title": "Motion Graphics Designer (Animation / Effects)",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23836",
        "location": "Technopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Motion Graphics Designer (Animation / Effects)</h2>\n<p><strong>Company:</strong> Globcom Solutions (P) Ltd\n<strong>Location:</strong> Technopark, TVM\n<strong>Contact Email:</strong> rajesh@globcomsolution.com\n<strong>Closing Date:</strong> 15, Oct 2025\n<strong>Job Published:</strong> 27, Sept 2025</p>\n<h3>Role Overview:</h3>\n<p>We are looking for a creative and skilled Motion Graphics Designer with 2 to 5 years of experience, who is passionate about creating visually stunning animations and effects for digital content. The ideal candidate should have strong expertise in motion graphics, 2D/3D animation, and visual effects, with proficiency in industry-standard tools. The role requires someone who can transform concepts into engaging visuals, work collaboratively with creative teams, and deliver high-quality output within deadlines. Experience in creating promotional videos, social media creatives, and explainer animations will be highly valued.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design and produce high-quality motion graphics, animations, and visual effects for videos, social media, and digital campaigns.</li>\n<li>Collaborate with the creative, marketing, and development teams to conceptualize and execute visual ideas.</li>\n<li>Work on storyboards, style frames, and animatics to plan animation sequences.</li>\n<li>Create 2D/3D animations, kinetic typography, and compositing using After Effects, Cinema 4D, Blender, or similar tools.</li>\n<li>Edit and enhance videos with transitions, effects, and sound design to achieve a polished final output.</li>\n<li>Ensure brand consistency across all visual assets.</li>\n<li>Stay updated on design trends, animation techniques, and emerging tools in motion graphics.</li>\n<li>Optimize animation files for different platforms and formats.</li>\n<li>Manage multiple projects simultaneously while meeting quality and timeline requirements.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>2 to 5 years of professional experience in motion graphics, animation, or visual effects.</li>\n<li>Proficiency in Adobe After Effects, Premiere Pro, Photoshop, Illustrator, and at least one 3D software (Cinema 4D, Blender, Maya, etc.).</li>\n<li>Strong understanding of animation principles, timing, and visual storytelling.</li>\n<li>Experience in compositing, rotoscoping, and visual effects integration.</li>\n<li>Knowledge of color grading, typography, and layout design.</li>\n<li>Ability to work collaboratively in a team and communicate creative ideas effectively.</li>\n<li>Strong attention to detail and time management skills.</li>\n<li><strong>Bonus:</strong> Experience with AI-assisted design tools, VR/AR animation, or interactive media.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume, portfolio/reel link, and a brief cover letter to rajesh@globcomsolution.com</p>",
        "tags": [
            "2-5 Years",
            "Motion Graphics",
            "Adobe After Effects",
            "3D Animation"
        ],
        "summary": "Seeking a Motion Graphics Designer with 2-5 years of experience to create stunning animations and effects. Responsibilities include design, animation, and collaboration with creative teams."
    },
    {
        "job_title": "PHP Developer",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/23835",
        "location": "Technopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>PHP Developer at Upcommune Business Network</h2>\n<p><strong>Company:</strong> Upcommune Business Network (P) Ltd\n<strong>Location:</strong> SBC 22, -2, Thejaswini Building, Technopark, Thiruvananthapuram, 695581\n<strong>Website:</strong> https://www.upcommune.net\n<strong>Contact Email:</strong> mail@upcommune.net</p>\n<p><strong>Job Published:</strong> September 26, 2025\n<strong>Closing Date:</strong> October 10, 2025</p>\n<h3>Brief Description:</h3>\n<p>We are seeking a skilled PHP Developer to join our development team. The ideal candidate will be responsible for building, maintaining, and optimizing web applications using PHP and related technologies. You will work closely with front-end developers, designers, and project managers to deliver high-quality, scalable, and secure solutions.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, test, and maintain dynamic web applications using PHP.</li>\n<li>Write clean, reusable, and efficient code following best practices.</li>\n<li>Integrate data from various back-end services and databases.</li>\n<li>Collaborate with front-end developers to implement user-facing features.</li>\n<li>Troubleshoot, debug, and upgrade existing applications.</li>\n<li>Ensure the performance, security, and responsiveness of applications.</li>\n<li>Maintain documentation of development processes, code, and APIs.</li>\n<li>Stay updated with the latest PHP frameworks, tools, and best practices.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Proven experience as a PHP Developer (X years).</li>\n<li>Strong knowledge of PHP frameworks (e.g., Laravel, CodeIgniter, Symfony, Yii).</li>\n<li>Solid understanding of front-end technologies (HTML5, CSS3, JavaScript, jQuery).</li>\n<li>Proficiency in working with relational databases (MySQL, PostgreSQL).</li>\n<li>Familiarity with RESTful APIs and third-party integrations.</li>\n<li>Strong debugging and problem-solving skills.</li>\n<li>Knowledge of version control systems (Git, GitHub, GitLab).</li>\n<li>Understanding of MVC architecture and OOP principles.</li>\n<li>Ability to work independently as well as in a team.</li>\n<li>Good communication and time-management skills.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Experience with cloud platforms (AWS, Azure, GCP).</li>\n<li>Knowledge of CMS platforms like WordPress, Drupal, or Magento.</li>\n<li>Familiarity with Agile development methodologies.</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field.</li>\n</ul>",
        "tags": [
            "X Years",
            "PHP",
            "Laravel",
            "MySQL"
        ],
        "summary": "Seeking a PHP Developer to build and optimize web applications. Responsibilities include coding, debugging, and collaborating with teams to deliver scalable solutions."
    },
    {
        "job_title": "Machine Learning Engineer",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/23833",
        "location": "Technopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Machine Learning Engineer</h2>\n<p><strong>Company:</strong> Upcommune Business Network (P) Ltd\n<strong>Location:</strong> SBC 22, -2 , Thejaswini Building, Technopark, Thiruvananthapuram , 695581\n<strong>Website:</strong> https://www.upcommune.net\n<strong>Contact Email:</strong> mail@upcommune.net</p>\n<p><strong>Job Published:</strong> 26, Sept 2025\n<strong>Closing Date:</strong> 10, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a skilled Machine Learning Engineer with expertise in Python and front-end technologies. The ideal candidate will design, develop, and deploy scalable ML solutions.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Build, train, and optimize ML/DL models using Python libraries (TensorFlow, PyTorch, Scikit-learn, etc.).</li>\n<li>Perform data preprocessing, feature engineering, and model evaluation.</li>\n<li>Apply MLOps practices to automate model deployment, monitoring, and retraining.</li>\n<li>Deploy ML models and applications on any cloud platforms (AWS, GCP, Azure).</li>\n<li>Manage scalable infrastructure with Docker, Kubernetes, and CI/CD pipelines.</li>\n<li>Build interactive dashboards and front-end interfaces (React, Angular, or Vue).</li>\n<li>Integrate ML services into web applications and APIs (Flask, FastAPI, Django).</li>\n<li>Write clean, maintainable, and testable code.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Python</li>\n<li>Knowledge of ML algorithms, NLP, and computer vision techniques.</li>\n<li>React.js / Angular / Vue.js for building dashboards &amp; interfaces.</li>\n<li>Experience with AWS/GCP/Azure ML services.</li>\n<li>CI/CD pipelines.</li>\n<li>Microservices architecture.</li>\n<li>Knowledge of NOSQL Databases</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Python",
            "MLOps",
            "React.js"
        ],
        "summary": "Seeking a Machine Learning Engineer to design, develop, and deploy scalable ML solutions using Python and front-end technologies. Responsibilities include model building, MLOps, and cloud deployment."
    },
    {
        "job_title": "Java Developer",
        "company": "Xminds Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23832",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Java Developer</h2>\n<p><strong>Company:</strong> Xminds Infotech (P) Ltd\n<strong>Location:</strong> Module no. T-4 and T-8, Thejaswini Building 7th floor, Phase 1, Technopark, Trivandrum, 695581\n<strong>Website:</strong> http://www.xminds.com\n<strong>Contact Email:</strong> careers@xminds.com</p>\n<p><strong>Job Published:</strong> 26, Sept 2025\n<strong>Closing Date:</strong> 31, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a skilled and passionate Java Developer to join our dynamic, high-growth team. In this role, you will be responsible for designing, building, and maintaining scalable microservices that drive the success of our core applications. If you thrive in a fast-paced environment and excel in developing robust solutions, we want to hear from you.</p>\n<h3>Required Skills and Experience:</h3>\n<ul>\n<li>2+ years of hands-on Java development experience, with a strong emphasis on Spring Boot and Microservices.</li>\n<li>Expertise in Java 17+, Spring Boot, Spring Security, Spring Data, and building RESTful APIs.</li>\n<li>Strong knowledge of cloud-native architectures and experience with AWS services (e.g., EC2, S3, RDS, Lambda, API Gateway).</li>\n<li>Experience with event-driven systems, particularly using Kafka or Redpanda.</li>\n<li>Proficiency with containerization (Docker) and orchestration tools (Kubernetes).</li>\n<li>Experience with CI/CD pipelines, such as Jenkins or GitLab CI.</li>\n<li>Strong SQL and NoSQL database skills, including MySQL, PostgreSQL, and MongoDB.</li>\n<li>Experience with unit testing frameworks like JUnit or TestNG.</li>\n<li>Familiarity with Agile development methodologies and a problem-solving mindset.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Excellent communication and collaboration skills, with a team-oriented mindset.</li>\n<li>Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field.</li>\n</ul>\n<p><strong>Experience Range:</strong> 2-5 yrs</p>",
        "tags": [
            "2+ Years",
            "Java",
            "Spring Boot",
            "AWS"
        ],
        "summary": "Seeking a skilled Java Developer with 2+ years of experience in Spring Boot and microservices. Responsibilities include designing, building, and maintaining scalable microservices. Cloud and AWS experience is essential."
    },
    {
        "job_title": "Content Writer",
        "company": "Aptara Learning  (P) Ltd",
        "url": "https://technopark.org/job-details/23831",
        "location": "Technopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Content Writer - Aptara Learning (P) Ltd</h2>\n<p><strong>Location:</strong> Trivandrum, India (Technopark)\n<strong>Address:</strong> 8B, 8th Floor Carnival Technopark Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Website:</strong> http://www.aptaracorp.com</p>\n<p><strong>Job Published:</strong> 26, Sept 2025\n<strong>Closing Date:</strong> 29, Sept 2025</p>\n<h3>Job Summary:</h3>\n<p>Aptara Learning is seeking a creative and detail-oriented Content Writer to join our team. The ideal candidate will possess excellent writing skills, a strong command of English, and the ability to produce engaging, accurate, and well-structured content. This is an entry-level position, perfect for graduates with a passion for writing and communication.</p>\n<h3>Preferred Skills and Qualifications:</h3>\n<ul>\n<li><strong>Experience:</strong> 0-2 Years</li>\n<li><strong>Qualification:</strong> Graduate in English Literature</li>\n<li><strong>Language Proficiency:</strong> Excellent written and verbal communication in English.</li>\n<li><strong>Writing Skills:</strong> Strong grammar, editing, and proofreading abilities.</li>\n<li><strong>Creativity:</strong> Creative thinking and meticulous attention to detail.</li>\n<li><strong>Content Quality:</strong> Ability to write clear, concise, and engaging content.</li>\n<li><strong>Technical Skills (Preferred):</strong> Basic knowledge of SEO and content management tools.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates are invited to share their CV with the subject line: \"Application for Content Writer – [Your Name]\" to <strong>gobika.g@aptaracorp.com</strong>.</p>\n<h3>Contact Information:</h3>\n<ul>\n<li><strong>Email:</strong> gobika.g@aptaracorp.com</li>\n<li><strong>Phone:</strong> +91 4714060801</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Content Writing",
            "English Literature",
            "SEO"
        ],
        "summary": "Aptara Learning seeks a creative Content Writer with excellent English skills. This entry-level role requires a graduate passionate about writing engaging and accurate content."
    },
    {
        "job_title": "AI Developer (Work From Home) Immediate Joiners Preferred",
        "company": "Leader It (P) Ltd",
        "url": "https://technopark.org/job-details/23830",
        "location": "Technopark",
        "closing_date": "02 Oct 2025",
        "job_description": "<h2>LEADER IT (P) Ltd</h2>\n<p><strong>Company Address:</strong>\nSBC 1, -2 FLOOR,\nTHEJASWINI BUILDING,\nPHASE 1, TECHNOPARK CAMPUS,\nKARYAVATTOM P O,\nTRIVANDRUM, KERALA , 695581</p>\n<p><strong>Website:</strong> http://www.leaderit.in/</p>\n<hr />\n<h2>Job Title: Associate AI Developer (Work From Home)</h2>\n<p><strong>Location:</strong> Remote</p>\n<p><strong>Job Published:</strong> 26, Sept 2025</p>\n<p><strong>Closing Date:</strong> 02, Oct 2025</p>\n<p><strong>Immediate Joiners Preferred</strong></p>\n<p><strong>Contact Email:</strong> jobsindia@leadergroup.com</p>\n<hr />\n<h3>Brief Description</h3>\n<p>We are looking for an AI Developer with 3–5 years of experience in building and deploying AI/ML solutions. The ideal candidate should have strong expertise in deep learning frameworks, model training/fine-tuning, and API-driven integrations, with hands-on experience in delivering production-grade AI applications.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and deploy AI/ML models for NLP, CV, or speech-based use cases.</li>\n<li>Fine-tune and optimize large language models (LLMs) or domain-specific AI models.</li>\n<li>Integrate AI workflows into applications using REST/gRPC APIs.</li>\n<li>Preprocess and manage structured/unstructured datasets for training and inference.</li>\n<li>Implement scalable inference pipelines with focus on performance and cost optimization.</li>\n<li>Collaborate with product and engineering teams for end-to-end AI feature delivery.</li>\n<li>Stay updated with the latest advancements in AI/ML research and tools.</li>\n</ul>\n<h3>Skills Required:</h3>\n<ul>\n<li><strong>Core Language:</strong> Python</li>\n<li><strong>Deep Learning Frameworks:</strong> PyTorch, TensorFlow</li>\n<li><strong>NLP/CV Libraries:</strong> HuggingFace, OpenAI API, spaCy, Transformers</li>\n<li><strong>Data Preprocessing:</strong> Pandas, NumPy, Scikit-learn</li>\n<li><strong>Model Deployment &amp; Inference:</strong> FastAPI, Docker, REST APIs</li>\n<li><strong>Version Control &amp; Collaboration:</strong> Git, CI/CD</li>\n</ul>\n<h3>Nice to Have (Optional Skills):</h3>\n<ul>\n<li>Experience with vector databases (Pinecone, Weaviate, FAISS).</li>\n<li>Familiarity with model compression (LoRA, QLoRA, quantization, distillation).</li>\n<li>Exposure to cloud AI services (Azure, AWS, GCP).</li>\n<li>Knowledge of MLOps tools (MLflow, Kubeflow, Airflow).</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "Python",
            "PyTorch",
            "TensorFlow"
        ],
        "summary": "Associate AI Developer needed with 3-5 years of experience in AI/ML solutions. Responsibilities include model development, fine-tuning, and API integration for production-grade applications."
    },
    {
        "job_title": "Software Developer Lead - React",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/23829",
        "location": "Technopark",
        "closing_date": "06 Oct 2025",
        "job_description": "<h2>Software Developer Lead - React</h2>\n<p>Ateam InfoSoft Solutions Private Limited\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Closing Date:</strong> 06, Oct 2025\n<strong>Job Published:</strong> 26, Sept 2025</p>\n<p><strong>Contact Email:</strong> recruitment@ateamsoftsolutions.com\n<strong>Contact Number:</strong> +91 7907410058</p>\n<p><strong>Brief Description:</strong>\nJoin ATeam InfoSoft Solutions, Technopark, and be part of a dynamic team building next-generation web applications. We’re looking for an experienced React Developer with strong expertise in modern front-end technologies to lead impactful projects.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and deploy modern web applications using React.js and Next.js.</li>\n<li>Collaborate with product owners, designers, and backend teams to deliver seamless solutions.</li>\n<li>Ensure performance, quality, and responsiveness of applications.</li>\n<li>Conduct code reviews and maintain best practices.</li>\n<li>Work with GraphQL, React Query, and WebSockets for scalable, real-time solutions.</li>\n<li>Stay updated with emerging front-end technologies and industry trends.</li>\n</ul>\n<h3>Required Technical Skills:</h3>\n<ul>\n<li>Strong expertise in React.js and Next.js (SSR, SSG, API routes).</li>\n<li>Proficiency in JavaScript (ES6+), HTML5, CSS3, Tailwind CSS.</li>\n<li>Experience with Redux or Zustand for state management.</li>\n<li>Familiarity with GraphQL &amp; React Query.</li>\n<li>Hands-on experience with WebSockets &amp; real-time communication.</li>\n<li>Solid knowledge of Webpack/Vite and Git workflow.</li>\n<li>Practical experience with Firebase (Auth, Firestore, Messaging, Storage, etc.).</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Proven ability to lead a team of 4+ developers, project estimation &amp; delivery planning.</li>\n</ul>\n<p><strong>Apply Now:</strong> recruitment@ateamsoftsolutions.com</p>",
        "tags": [
            "6+ Years",
            "React.js",
            "Next.js",
            "GraphQL"
        ],
        "summary": "Lead React Developer needed for ATeam InfoSoft Solutions in Technopark. Requires 6+ years of experience in modern front-end technologies to build next-gen web apps."
    },
    {
        "job_title": "Junior PHP Developer (Work From Home) Immediate Joiners Preferred",
        "company": "Leader It (P) Ltd",
        "url": "https://technopark.org/job-details/23828",
        "location": "Technopark",
        "closing_date": "02 Oct 2025",
        "job_description": "<h2>PHP Developer (Work From Home)</h2>\n<p><strong>Company:</strong> LEADER IT (P) Ltd\n<strong>Location:</strong> Remote\n<strong>Contact Email:</strong> jobsindia@leadergroup.com\n<strong>Closing Date:</strong> 02, Oct 2025\n<strong>Job Published:</strong> 26, Sept 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for an enthusiastic PHP Developer with 1–2 years of experience to join our development team. The selected candidate will work closely under the guidance of a lead developer, gaining hands-on experience in building, customizing, and optimizing PHP-based applications. This is an excellent opportunity for someone eager to learn, grow, and contribute in a collaborative, performance-driven environment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop, customize, and maintain PHP-based applications and plugins.</li>\n<li>Enhance existing features and implement new ones based on project requirements.</li>\n<li>Optimize database queries and improve application performance.</li>\n<li>Configure and integrate third-party tools such as Redis, caching layers, and APIs.</li>\n<li>Debug and resolve issues to ensure application stability and scalability.</li>\n<li>Collaborate with senior developers and follow best practices under mentorship.</li>\n<li>Maintain documentation for code, workflows, and integrations.</li>\n<li>Assist in version upgrades while ensuring compatibility with custom changes.</li>\n</ul>\n<h3>Skills Required:</h3>\n<ul>\n<li><strong>Core Technologies:</strong> PHP (OOP, MVC concepts), MySQL/MariaDB, HTML, CSS, JavaScript, JQuery</li>\n<li><strong>Framework/Tools:</strong> Symfony (preferred), Composer, Git</li>\n<li><strong>Databases:</strong> Query optimization, indexing, schema handling</li>\n<li><strong>Version Control:</strong> Git/GitHub or GitLab workflows</li>\n<li><strong>Environment:</strong> Linux, LAMP stack, Docker (preferred)</li>\n<li><strong>Problem-Solving:</strong> Debugging skills, ability to analyze logs and performance bottlenecks</li>\n<li><strong>Soft Skills:</strong> Eagerness to learn, willingness to work under guidance</li>\n</ul>\n<h3>Nice to Have (Optional Skills):</h3>\n<ul>\n<li>Familiarity with open-source PHP applications and plugin development.</li>\n<li>Experience with Docker-based environments.</li>\n<li>Basic knowledge of frontend frameworks (Vue.js) for UI customization.</li>\n<li>Understanding of caching systems like Redis or Memcached.</li>\n</ul>\n<p><strong>Company Address:</strong>\nLEADER IT (P) Ltd\nSBC 1, -2 FLOOR,\nTHEJASWINI BUILDING,\nPHASE 1, TECHNOPARK CAMPUS,\nKARYAVATTOM P O,\nTRIVANDRUM, KERALA , 695581\n<strong>Website:</strong> http://www.leaderit.in/</p>",
        "tags": [
            "1-2 Years",
            "PHP",
            "MySQL",
            "Symfony"
        ],
        "summary": "Seeking a Junior PHP Developer with 1-2 years of experience for a remote role. Responsibilities include application development, optimization, and debugging under senior guidance."
    },
    {
        "job_title": "Copy Editor",
        "company": "Aptara Learning  (P) Ltd",
        "url": "https://technopark.org/job-details/23827",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Copy Editor - Aptara Learning (P) Ltd</h2>\n<p><strong>Location:</strong> Trivandrum, India\n<strong>Address:</strong> 8B, 8th Floor Carnival Technopark Building, Technopark Phase -1, Trivandrum, 695581\n<strong>Website:</strong> http://www.aptaracorp.com</p>\n<p><strong>Closing Date:</strong> September 30, 2025\n<strong>Job Published:</strong> September 26, 2025</p>\n<p><strong>Contact Email:</strong> gobika.g@aptaracorp.com\n<strong>Contact Phone:</strong> +91 4714060801</p>\n<h3>Job Summary:</h3>\n<p>Aptara Learning is seeking enthusiastic Copy Editors for entry-level positions to contribute to scientific journal and book projects. This role is crucial for ensuring the quality of our published content.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Edit and proofread content meticulously for grammatical accuracy, spelling, and punctuation.</li>\n<li>Ensure unwavering consistency and accuracy throughout all manuscripts.</li>\n<li>Adhere strictly to provided style guides or implement established editorial best practices.</li>\n<li>Proficiently handle diverse content types, including academic and scientific writing.</li>\n</ul>\n<h3>Preferred Skills and Qualifications:</h3>\n<ul>\n<li><strong>Experience:</strong> 0-2 Years</li>\n<li><strong>Qualification:</strong> Any Graduate</li>\n<li><strong>Communication:</strong> Excellent English communication skills, both written and verbal.</li>\n<li><strong>Editing Skills:</strong> Strong grasp of grammar and exceptional attention to detail.</li>\n<li><strong>Technical Skills:</strong> Basic proficiency in MS Office.</li>\n<li><strong>Work Ethic:</strong> Demonstrated ability to focus and manage high volumes of text effectively.</li>\n</ul>\n<p>Interested candidates are encouraged to share their CVs with gobika.g@aptaracorp.com. For any queries, please feel free to reach out.</p>",
        "tags": [
            "0-2 Years",
            "Copy Editing",
            "Proofreading",
            "Grammar"
        ],
        "summary": "Aptara Learning seeks entry-level Copy Editors for scientific journals and books. Responsibilities include editing for grammar, clarity, and consistency, adhering to style guides."
    },
    {
        "job_title": "Content Curator / Writer - Fresher",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/23825",
        "location": "Technopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Content Curator / Writer - Fresher</h2>\n<p><strong>Company:</strong> ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED\n<strong>Location:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus, Trivandrum, Kerala, India - 695581\n<strong>Website:</strong> https://www.ateamsoftsolutions.com</p>\n<p><strong>Walk-In Details:</strong>\n- <strong>Date:</strong> September 29, 2025\n- <strong>Time:</strong> 11:00 AM to 5:00 PM\n- <strong>Venue:</strong> 2nd Level, Thejaswini Building, Technopark, Trivandrum, Kerala, India</p>\n<p><strong>Job Published:</strong> September 26, 2025</p>\n<h3>Brief Description</h3>\n<p>Ateam InfoSoft Solutions is a growing team dedicated to delivering innovative and impactful digital solutions. We are seeking a highly motivated and detail-oriented Content Writer / Curator to join our team and contribute to the development of high-quality content across blogs, social media, websites, and marketing campaigns.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Write, proofread, and edit content to ensure clarity, accuracy, and readability.</li>\n<li>Curate and adapt content for multiple platforms including blogs, social media, websites, and emails.</li>\n<li>Collaborate effectively with writers, designers, and team members to maintain content quality and consistency.</li>\n<li>Ensure all content aligns with the organization’s brand voice and communication standards.</li>\n</ul>\n<h3>Qualifications &amp; Skills</h3>\n<ul>\n<li>Bachelor’s degree in English, Journalism, Communications, or a related field.</li>\n<li>Strong command of the English language with excellent writing, editing, and proofreading skills.</li>\n<li>Familiarity with digital content, SEO principles, and marketing concepts is a plus.</li>\n<li>Detail-oriented, creative, and capable of working independently as well as collaboratively.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong creative writing ability with attention to detail.</li>\n<li>Basic knowledge of SEO, keywords, and digital content trends.</li>\n<li>Familiarity with social media content writing and engagement strategies.</li>\n<li>Ability to multitask and manage time effectively in a fast-paced environment.</li>\n<li>Proficiency in MS Office / Google Workspace tools.</li>\n<li>A proactive approach to learning and adapting to new content strategies.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates are requested to share their resume, full name, and contact number in advance via WhatsApp to <strong>+91 7907410058</strong> or email to <strong>recruitment@ateamsoftsolutions.com</strong>.</p>\n<p><strong>Please carry your updated resume to the Walk-In interview.</strong></p>\n<h3>Technopark Entry Pass Information</h3>\n<p>Candidates are requested to apply for the entry pass to Technopark Campus to attend the Walk-In interview through the mobile app/web browser (vms.technopark.org). Once the pass is applied, it will be sent to their registered mobile number/email ID. The softcopy of the entry pass can be shown on their gadgets at the Technopark Entrance Gate. Candidates without smartphones can print their hardcopy entry pass from self-operating kiosks at the Reception Building near the Main Gate using an OTP.</p>\n<ul>\n<li><strong>Mobile App Download:</strong> <a href=\"Click here to download the Mobile App for Android\">Android</a> | <a href=\"Click here to download the Mobile App for iOS\">iOS</a></li>\n<li><strong>Website:</strong> vms.technopark.org</li>\n<li><strong>User Manual:</strong> <a href=\"Click here for the User Manual\">Click here for the User Manual</a></li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for Walk-In interview entry.</p>",
        "tags": [
            "0-1 Years",
            "Content Writing",
            "SEO",
            "Editing"
        ],
        "summary": "Seeking a Content Writer/Curator to create engaging content for digital platforms. Responsibilities include writing, editing, and curating content aligned with brand standards."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23823",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com</p>\n<p><strong>Job Published:</strong> 26, Sept 2025\n<strong>Closing Date:</strong> 03, Oct 2025</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 3+ years of experience for this role.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop, test, and maintain high-quality web applications using Angular (version 16+).</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features.</li>\n<li>Optimize applications for maximum speed and scalability.</li>\n<li>Ensure the technical feasibility of UI/UX designs.</li>\n<li>Participate in code reviews, providing constructive feedback to peers.</li>\n<li>Troubleshoot and debug applications, ensuring optimal performance.</li>\n<li>Stay up-to-date with emerging trends and technologies in front-end development.</li>\n<li>Mentor and guide junior developers, fostering a collaborative and productive work environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Minimum of 3 years of professional experience in front-end development.</li>\n<li>Strong proficiency in Angular (version 16+) and related technologies.</li>\n<li>Node JS, Nest JS, Kafka, Redis, Javascript, HTML, CSS, RESTful API integration.</li>\n<li>Experience working with Docker and containerized applications.</li>\n<li>Experience working with Kubernetes or other container orchestration tools.</li>\n<li>Hands-on knowledge and understanding of AWS environments.</li>\n<li>Experience in full-stack development.</li>\n<li>Knowledge of RDBMS and Document Database.</li>\n<li>Experience with Agile and Scrum development methodologies.</li>\n<li>Exposure to continuous integration (CI/CD).</li>\n<li>Knowledge of version control systems such as Git and TFS.</li>\n<li>Good analytical and problem-solving skills.</li>\n<li>Up-to-date knowledge of latest technologies, tools, and platforms.</li>\n<li>Ability to complete tasks with minimum supervision.</li>\n<li>Ability to play a leadership role.</li>\n</ul>\n<h3>Key Technologies &amp; Methodologies:</h3>\n<ul>\n<li>Node JS</li>\n<li>Nest JS framework</li>\n<li>Angular</li>\n<li>Kafka / Event architecture / RabbitMQ</li>\n<li>Redis / Caching</li>\n<li>Javascript</li>\n<li>HTML, CSS</li>\n<li>Microservices &amp; Cloud</li>\n<li>Continuous integration (CI/CD)</li>\n<li>RDBMS/NoSQL/MongoDB</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Knowledge in Laravel</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers</h3>\n<p>This is to notify jobseekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn and all employment related mails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "3+ Years",
            "Angular",
            "Node JS",
            "AWS"
        ],
        "summary": "Full Stack Developer sought with 3+ years experience in Angular, Node JS, and cloud technologies. Responsibilities include developing, testing, and optimizing web applications. Contact Careers@reflectionsinfos.com."
    },
    {
        "job_title": "Data Engineering - Project Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23822",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Data Engineering - Project Manager</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 03, Oct 2025\n<strong>Job Published:</strong> 26, Sept 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for candidates with 13+ years of overall IT experience, including at least 6 years in a Technical Product Manager, Technical Program Manager, or Delivery Lead role, for this Data Engineering Project Manager position.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Own the end-to-end delivery of data platform, AI, BI, and analytics projects, ensuring alignment with business objectives and stakeholder expectations.</li>\n<li>Develop and maintain comprehensive project plans, roadmaps, and timelines for data ingestion, transformation, governance, AI/ML models, and analytics deliverables.</li>\n<li>Lead cross-functional teams including data engineers, data scientists, BI analysts, architects, and business stakeholders to deliver high-quality, scalable solutions on time and within budget.</li>\n<li>Define, prioritize, and manage product and project backlogs covering data pipelines, data quality, governance, AI services, and BI dashboards or reporting tools.</li>\n<li>Collaborate closely with business units to capture and translate requirements into actionable user stories and acceptance criteria for data and analytics solutions.</li>\n<li>Oversee the BI and analytics area, including dashboard development, embedded analytics, self-service BI enablement, and ad hoc reporting capabilities.</li>\n<li>Ensure data quality, lineage, security, and compliance requirements are integrated throughout the project lifecycle, in collaboration with governance and security teams.</li>\n<li>Coordinate UAT, performance testing, and user training to ensure adoption and successful rollout of data and analytics products.</li>\n<li>Act as the primary point of contact for all project stakeholders, providing regular status updates, managing risks and issues, and escalating as necessary.</li>\n<li>Facilitate agile ceremonies such as sprint planning, backlog grooming, demos, and retrospectives, fostering a culture of continuous improvement.</li>\n<li>Drive post-deployment monitoring and optimization of data and BI solutions to meet evolving business needs and performance standards.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<h4>Primary Skills:</h4>\n<ul>\n<li>Overall 13+ Years of Experience in IT with 6+ years of experience as a Technical Product Manager, Technical Program Manager, or Delivery Lead.</li>\n<li>Hands-on development experience in data engineering, including data pipelines, ETL processes, and data integration workflows.</li>\n<li>Proven track record managing data engineering, analytics, or AI/ML projects end to end.</li>\n<li>Solid understanding of modern data architecture: data lakes, warehouses, pipelines, ETL/ELT, governance, and AI tooling.</li>\n<li>Hands-on familiarity with cloud platforms (e.g., Azure, AWS, GCP) and DataOps/MLOps practices.</li>\n<li>Strong knowledge of Agile methodologies, sprint planning, and backlog grooming.</li>\n<li>Excellent communication and stakeholder management skills, including working with senior executives and technical leads.</li>\n</ul>\n<h4>Secondary Skills:</h4>\n<ul>\n<li>Background in computer science, engineering, data science, or analytics.</li>\n<li>Experience or Solid Understanding with data engineering tools and services in AWS, Azure &amp; GCP.</li>\n<li>Exposure or Solid Understanding of BI, Analytics, LLMs, RAG, prompt engineering, or agent-based AI systems.</li>\n<li>Experience leading cross-functional teams in matrixed environments.</li>\n<li>Certifications: PMP, CSM, SAFe, or equivalent are a plus.</li>\n</ul>\n<h3>Application Process:</h3>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers:</h3>\n<p>This is to notify job seekers that some fraudsters are promising jobs with Reflections Info Systems for a fee. Please note that no payment is ever sought for jobs in Reflections. We contact our candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. Please contact careers@reflectionsinfos.com for any clarification or alerts on this subject.</p>",
        "tags": [
            "13+ Years",
            "Data Engineering",
            "Project Management",
            "Agile Methodologies"
        ],
        "summary": "Seeking a Data Engineering Project Manager with 13+ years of experience to lead end-to-end project delivery. Must have strong Agile skills and experience in data platforms, AI, BI, and analytics."
    },
    {
        "job_title": "Technical Project Manager (Application Development)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23821",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Technical Project Manager (Application Development)</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.reflectionsglobal.com\n<strong>Published:</strong> 26, Sept 2025\n<strong>Closing Date:</strong> 03, Oct 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Brief Description</h3>\n<p>Reflections Info Systems is seeking a highly experienced Technical Project Manager (Tech PM) with over 13 years of experience to lead the complete execution of custom application development and integration projects. These projects primarily utilize .NET stacks with modern client frameworks and integration platforms. The ideal candidate will possess a strong technical background coupled with proven project delivery expertise, enabling them to manage complex, cross-functional initiatives from initial discovery through to production rollout. This role demands hands-on experience across the entire software/product development lifecycle, including planning, estimation, design, development, testing, and release, while collaborating closely with engineering, product, and client stakeholders.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Manage the end-to-end delivery of custom software development and integration projects using Java, .NET, and related technologies.</li>\n<li>Develop and maintain project plans, define timelines, identify dependencies, and monitor progress.</li>\n<li>Coordinate with cross-functional teams, including developers, QA, UI/UX, and DevOps, to ensure smooth project execution.</li>\n<li>Oversee all stages of the Software Development Life Cycle (SDLC): requirements finalization, development, integration, testing (unit, system, UAT, NFR), and deployment.</li>\n<li>Collaborate closely with architects and leads to ensure alignment with technical direction and design.</li>\n<li>Proactively identify and manage risks, scope changes, and schedule adjustments.</li>\n<li>Act as the primary point of contact for clients and stakeholders, providing regular updates and resolving issues.</li>\n<li>Ensure quality and timely delivery through effective team coordination and clear communication.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<h4>Technical &amp; Delivery Expertise</h4>\n<ul>\n<li><strong>Experience:</strong> 13+ years of overall IT experience, with 4–6 years in Technical Project Management.</li>\n<li><strong>Technical Foundation:</strong> Strong understanding of custom application development on Java/.NET stacks.</li>\n<li><strong>Project Focus:</strong> Experience managing:<ul>\n<li>Backend/API development</li>\n<li>Integration using tools like Apache Camel, IBM Integration Stack</li>\n<li>Database interactions (Oracle, SQL Server)</li>\n<li>Client-side development using React/Angular</li>\n<li>Deployment on cloud platforms (AWS, Azure)</li>\n</ul>\n</li>\n<li><strong>Modern Practices:</strong> Familiarity with Microservices architecture, CI/CD pipelines, and DevOps practices.</li>\n</ul>\n<h4>Project Management</h4>\n<ul>\n<li><strong>Planning &amp; Tracking:</strong> Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li><strong>Management:</strong> Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.</li>\n<li><strong>Tools:</strong> Proficient with Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</li>\n</ul>\n<h4>Secondary Skills</h4>\n<ul>\n<li>Experience managing globally distributed teams.</li>\n<li>Strong understanding of enterprise-level integrations and technology ecosystems.</li>\n</ul>\n<h4>Soft Skills</h4>\n<ul>\n<li><strong>Communication:</strong> Excellent communication and stakeholder engagement capabilities.</li>\n<li><strong>Leadership:</strong> Strong leadership, problem-solving, and organizational skills.</li>\n<li><strong>Articulation:</strong> Ability to articulate technical topics to both technical and non-technical audiences.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates are requested to forward their detailed resumes to <strong>Careers@reflectionsinfos.com</strong> including their notice period, current and expected CTC details.</p>\n<h3>Important Notice Regarding Fraudulent Job Offers</h3>\n<p>It has come to our attention that some individuals are fraudulently offering jobs with Reflections Info Systems for a fee. Please be advised that Reflections Info Systems <strong>never</strong> requests payment for job opportunities. We communicate with candidates exclusively through our official website or LinkedIn. All employment-related emails will originate from our official HR email address. For any clarifications or alerts regarding this matter, please contact <strong>careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Java",
            "Project Management"
        ],
        "summary": "Seeking an experienced Technical Project Manager to lead custom application development. Role requires 13+ years of experience in .NET/Java stacks and end-to-end project delivery."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23820",
        "location": "Technopark",
        "closing_date": "27 Sep 2025",
        "job_description": "<h2>Telesales Executive Walk-In Interview at TRAINONEX SOLUTIONS (P) Ltd</h2>\n<p><strong>Company:</strong> TRAINONEX SOLUTIONS (P) Ltd</p>\n<p><strong>Address:</strong> 1st Floor, M Squared Building, Annex 1, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581</p>\n<p><strong>Website:</strong> www.trainonexsolutions.in</p>\n<p><strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3>Walk-In Details:</h3>\n<ul>\n<li><strong>Date:</strong> September 27, 2025</li>\n<li><strong>Time:</strong> 10:30 AM - 12:30 PM</li>\n</ul>\n<h3>Job Description:</h3>\n<p>TRAINONEX SOLUTIONS (P) Ltd is seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<h3>Requirements:</h3>\n<ul>\n<li><strong>Experience:</strong> 0-1 years required (Freshers can also apply)</li>\n<li><strong>Joiners:</strong> Immediate joiners preferred</li>\n<li><strong>Work Type:</strong> Work from office opportunity</li>\n<li><strong>Candidates:</strong> Male and Female candidates preferred</li>\n<li><strong>Language:</strong> Fluency with Malayalam Language required</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>\n<h3>Walk-In Venue:</h3>\n<p>1st Floor, M Squared Building,\nAnnex 1, Technopark Campus,\nKaryavattom, Trivandrum, Kerala, 695581</p>\n<h3>Walk-In Entry Pass Information:</h3>\n<p>Candidates are requested to apply for an entry pass to Technopark Campus to attend the Walk-In interview through the mobile app or web browser. Once the pass is applied, it will be sent to your registered mobile number/email ID. Show the softcopy of the entry pass on your gadgets at the Technopark Entrance Gate to enter the campus.</p>\n<p>For candidates without a smartphone, print the hardcopy of the entry pass from the self-operating kiosks at the Reception Building near the TECHNOPARK Main Gate by using the 5-digit OTP received via SMS/email.</p>\n<ul>\n<li><strong>Mobile App (Android):</strong> [Click here to download]</li>\n<li><strong>Mobile App (iOS):</strong> [Click here to download]</li>\n<li><strong>Website:</strong> vms.technopark.org</li>\n<li><strong>User Manual:</strong> [Click here for the User Manual]</li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for Walk-In interview entry.</p>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Communication"
        ],
        "summary": "Seeking a Telesales Executive for phone sales and customer relationship management. Identify clients, qualify leads, and close deals to drive company growth."
    },
    {
        "job_title": "Senior Odoo Developer",
        "company": "Akira Software Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23819",
        "location": "Technopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Senior Odoo Developer at Akira Software Solutions (P) Ltd</h2>\n<p><strong>Company:</strong> Akira Software Solutions (P) Ltd\n<strong>Location:</strong> Technopark, Trivandrum, Kerala, India\n<strong>Address:</strong> Module No. 432 - 435, 4th Floor, Nila Building, Technopark, 695581\n<strong>Website:</strong> <a href=\"http://www.akiraplc.com\">http://www.akiraplc.com</a>\n<strong>Contact Email:</strong> <a href=\"mailto:hr@akiraplc.com\">hr@akiraplc.com</a>\n<strong>Job Published:</strong> September 26, 2025\n<strong>Closing Date:</strong> October 15, 2025</p>\n<h3>Brief Description</h3>\n<p>Akira Software Solutions is seeking a highly skilled Senior Odoo Developer with a minimum of 3 years of experience to join their dynamic team.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead the development and customization of Odoo modules to meet business requirements.</li>\n<li>Write high-quality, scalable, and maintainable code using Python and the Odoo framework.</li>\n<li>Mentor junior developers and provide technical guidance.</li>\n<li>Debug and resolve complex technical issues in Odoo implementations.</li>\n<li>Optimize database performance and manage PostgreSQL queries.</li>\n<li>Collaborate with functional consultants to design and implement tailored solutions.</li>\n<li>Stay updated with the latest Odoo features and contribute to continuous improvement.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> 3 years of proven experience in Odoo development.</li>\n<li><strong>Technical Skills:</strong><ul>\n<li>Expertise in Python, XML, and Odoo’s ORM.</li>\n<li>Strong knowledge of JavaScript and QWeb for front-end customization.</li>\n<li>Experience in designing and developing custom Odoo modules.</li>\n<li>Hands-on experience with API integration and third-party application connectivity.</li>\n<li>Familiarity with version control systems like Git.</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong> Excellent problem-solving, debugging, and leadership skills.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates are requested to share their updated CV to <strong>hr@akiraplc.com</strong>. Please use the subject line: <strong>\"Application For Sr. Odoo Developer\"</strong>. Applications without this specified subject line may be rejected.</p>",
        "tags": [
            "3+ Years",
            "Odoo",
            "Python",
            "JavaScript"
        ],
        "summary": "Senior Odoo Developer needed for module development and customization. Requires 3 years of experience in Python, Odoo, and JavaScript for an IT solutions company."
    },
    {
        "job_title": "WordPress Developer",
        "company": "Ferns It Solutions  (P) Ltd",
        "url": "https://technopark.org/job-details/23818",
        "location": "Technopark",
        "closing_date": "05 Oct 2025",
        "job_description": "<h2>WordPress Developer at Ferns IT Solutions (P) Ltd</h2>\n<p><strong>Company:</strong> Ferns IT Solutions (P) Ltd\n<strong>Location:</strong> Module No.03, 2nd floor, Thejaswini Building, Phase I, Technopark, Trivandrum\n<strong>Website:</strong> https://ferns-it.com\n<strong>Job Published:</strong> 26 September 2025\n<strong>Closing Date:</strong> 05 October 2025\n<strong>Contact Email:</strong> jobs@ferns-it.com</p>\n<p><strong>Employment Type:</strong> Full-time\n<strong>Work Location:</strong> Technopark, Trivandrum (On-site)</p>\n<h3>Brief Description</h3>\n<p>Ferns IT Solutions is seeking a talented WordPress Developer to build and customize WordPress websites. The ideal candidate will have a strong understanding of PHP and the CodeIgniter framework.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop and maintain WordPress websites and plugins.</li>\n<li>Customize themes to ensure a responsive and user-friendly design.</li>\n<li>Implement backend functionalities using PHP frameworks, with a focus on CodeIgniter.</li>\n<li>Collaborate effectively with design and content teams to produce high-quality projects.</li>\n<li>Troubleshoot, test, and maintain websites to ensure optimal performance.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>1–2 years of professional experience in WordPress development.</li>\n<li>Proficiency in PHP, MySQL, HTML, CSS, JavaScript, and jQuery.</li>\n<li>Mandatory knowledge of the CodeIgniter framework.</li>\n<li>Experience with REST APIs, third-party integrations, and version control (Git) is a plus.</li>\n<li>Strong problem-solving abilities and a collaborative team spirit.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates should forward their resume to <strong>jobs@ferns-it.com</strong> with the subject line \"Application for WordPress Developer\".</p>",
        "tags": [
            "1-2 Years",
            "WordPress",
            "PHP",
            "CodeIgniter"
        ],
        "summary": "Seeking a WordPress Developer with 1-2 years experience to build and customize websites. Must know PHP and CodeIgniter."
    },
    {
        "job_title": "Technical Project Manager",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/23817",
        "location": "Technopark",
        "closing_date": "15 Oct 2025",
        "job_description": "<h2>Technical Project Manager</h2>\n<p><strong>Company:</strong> Spericorn Technology (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala, India (Technopark Phase I)\n<strong>Website:</strong> http://www.spericorn.com</p>\n<p><strong>Job Published:</strong> September 26, 2025\n<strong>Closing Date:</strong> October 15, 2025\n<strong>Contact Email:</strong> careers@spericorn.com</p>\n<h3>Brief Description</h3>\n<p>Spericorn Technology is seeking an experienced Technical Project Manager to lead the successful execution and delivery of software products. The ideal candidate will possess a strong technical background in Node.js (backend) and React/Next.js (frontend), complemented by proven project management expertise.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead end-to-end delivery of software products from planning to deployment.</li>\n<li>Define project scope, milestones, timelines, and deliverables.</li>\n<li>Monitor project progress and proactively address risks or blockers.</li>\n<li>Ensure releases meet quality, security, and performance standards.</li>\n<li>Guide the team with hands-on knowledge of Node.js and React/Next.js.</li>\n<li>Collaborate effectively with clients, developers, designers, QA, and DevOps teams.</li>\n<li>Conduct technical reviews to maintain code quality and best practices.</li>\n<li>Act as the primary point of contact for clients and stakeholders.</li>\n<li>Provide regular project updates and reports to stakeholders.</li>\n<li>Ensure proper use of Git version control and CI/CD practices.</li>\n<li>Implement Agile methodologies (Scrum/Kanban) for project execution.</li>\n<li>Continuously analyze and improve delivery processes.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li>Minimum 5 years of experience, encompassing both technical and managerial roles.</li>\n<li>Strong expertise in Node.js for backend development.</li>\n<li>Solid experience with React.js or Next.js for frontend development.</li>\n<li>Proficiency in Git and version control workflows.</li>\n<li>Good understanding of REST APIs, microservices, and cloud environments (AWS, Azure, or GCP).</li>\n<li>Familiarity with DevOps and CI/CD pipelines.</li>\n<li>Proven track record as a Project Manager or Delivery Manager.</li>\n<li>Strong knowledge of Agile methodologies (Scrum, Kanban).</li>\n<li>Experience in resource planning, risk management, and delivery tracking.</li>\n<li>Knowledge in various domains like banking, e-commerce, etc., will be considered a strong advantage.</li>\n<li>Flexibility to adapt to different time zones and working hours.</li>\n<li>Excellent client communication and stakeholder management skills.</li>\n<li>Strong leadership qualities with the ability to mentor and guide teams.</li>\n<li>Problem-solving mindset with attention to detail.</li>\n</ul>\n<p><strong>Note:</strong> Kindly mention in the email subject \"Application for the post of Technical Project Manager\".</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "React/Next.js",
            "Agile"
        ],
        "summary": "Seeking an experienced Technical Project Manager with Node.js and React/Next.js expertise to lead software product delivery. Responsibilities include planning, execution, client liaison, and team guidance using Agile methodologies."
    },
    {
        "job_title": "Telesales Executive(Immediate)",
        "company": "Azinova Technologies  (P) Ltd",
        "url": "https://technopark.org/job-details/23815",
        "location": "Technopark",
        "closing_date": "05 Oct 2025",
        "job_description": "<h2>Azinova Technologies (P) Ltd</h2>\n<p><strong>Walk-In Drive for Telesales Executive</strong></p>\n<p><strong>Company:</strong> Azinova Technologies (P) Ltd\n<strong>Address:</strong> C-14b, Basement Floor 2, Thejaswini, Technopark, Trivandrum, 695581\n<strong>Website:</strong> http://www.azinovatechnologies.com\n<strong>Contact Email:</strong> careers@azinova.info</p>\n<p><strong>Walk-In Details:</strong>\n- <strong>Dates:</strong> September 26, 2025 - October 5, 2025\n- <strong>Time:</strong> 11:00 AM - 11:30 AM\n- <strong>Job Published:</strong> September 25, 2025</p>\n<h3>Brief Description</h3>\n<p>We are looking for a motivated and results-driven Telesales Executive with prior experience in customer-facing sales roles. This position is ideal for candidates from the banking, insurance, or real estate sectors who are passionate about sales and client acquisition.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Make outbound calls to acquire new clients only and generate leads.</li>\n<li>Promote and explain products/services clearly and persuasively.</li>\n<li>Understand customer needs and provide appropriate solutions.</li>\n<li>Maintain strong knowledge of offerings to handle queries effectively.</li>\n<li>Keep detailed and accurate records of customer interactions and sales outcomes.</li>\n<li>Consistently meet or exceed daily and monthly sales targets.</li>\n<li>Collaborate with the sales team to improve lead conversion and identify upselling opportunities.</li>\n<li>Follow communication scripts and ensure compliance with company policies and sales ethics.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Minimum 1 year of telesales or telecalling experience.</li>\n<li>Experience in banking, insurance, or real estate is mandatory.</li>\n<li>Excellent verbal communication skills in [English / Hindi / Regional language].</li>\n<li>Strong persuasion and negotiation skills.</li>\n<li>Goal-oriented mindset with the ability to perform under pressure.</li>\n<li>Familiarity with CRM tools, Excel, and basic computer operations.</li>\n<li>High levels of persistence, patience, and confidence.</li>\n</ul>\n<h3>Walk-In Venue:</h3>\n<p>Azinova Technologies\nBasement Floor-2, Thejaswini, C-14B, Technopark Rd, Technopark Campus, Thiruvananthapuram, Kerala 695581</p>\n<p><strong>Important Notes for Walk-In:</strong>\n- <strong>Carry your updated resume.</strong>\n- <strong>Walk-In Entry Pass:</strong> Candidates are required to apply for a Technopark Campus entry pass via the mobile app or web browser. The pass will be sent to their registered mobile number/email ID and should be shown at the gate. For those without smartphones, a hard copy can be printed from self-operating kiosks at the Technopark Reception Building using an OTP.\n  - <strong>Mobile App:</strong> [Link for Android] | [Link for iOS]\n  - <strong>Website:</strong> vms.technopark.org\n  - <strong>User Manual:</strong> [Link to User Manual]\n- <strong>Original certificates</strong> will be verified at the Entry Gate for interview entry.</p>",
        "tags": [
            "1+ Years",
            "Telesales",
            "Banking/Insurance/Real Estate",
            "Customer Acquisition"
        ],
        "summary": "Azinova Technologies seeks a Telesales Executive for client acquisition. Requires 1+ year experience in sales, preferably in banking, insurance, or real estate."
    },
    {
        "job_title": "Community Engagement Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/23814",
        "location": "Technopark",
        "closing_date": "11 Oct 2025",
        "job_description": "<h2>Community Engagement Trainee</h2>\n<p><strong>Company:</strong> ZenturioTech (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala\n<strong>Contact Email:</strong> admin@zenturiotech.com\n<strong>Application Closing Date:</strong> October 11, 2025\n<strong>Job Published:</strong> September 25, 2025</p>\n<h3>About the Role:</h3>\n<p>We are looking for a motivated Community Engagement Trainee to support initiatives aimed at building and nurturing communities around our projects, especially in mental health and technology-driven wellness. This role offers hands-on experience in community outreach, engagement campaigns, content creation, and event management.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in planning and executing community engagement campaigns.</li>\n<li>Interact with community members across online and offline platforms.</li>\n<li>Organize events, webinars, and awareness programs.</li>\n<li>Create content for newsletters, social media, and community updates.</li>\n<li>Collect feedback from community members and report insights to the team.</li>\n<li>Support collaborations with partner organizations and stakeholders.</li>\n</ul>\n<h3>Qualifications &amp; Skills:</h3>\n<ul>\n<li>Students pursuing any degree who are interested and involved in community events, social initiatives, or engagement activities.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Ability to engage with diverse groups and build meaningful relationships.</li>\n<li>Proficiency in social media and digital engagement tools is a plus.</li>\n<li>Ability to work independently and as part of a team.</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Hands-on experience in community engagement and social impact projects.</li>\n<li>Mentorship and exposure to industry-relevant tools and methods.</li>\n<li>Certificate of completion and career growth opportunities.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Submit your resume to admin@zenturiotech.com</p>",
        "tags": [
            "0-1 Years",
            "Community Engagement",
            "Social Media",
            "Content Creation"
        ],
        "summary": "Seeking a motivated Community Engagement Trainee in Trivandrum for outreach and campaign support. Gain hands-on experience in community building, content creation, and event management."
    },
    {
        "job_title": "PHP Developer",
        "company": "Twinsway Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23813",
        "location": "Technopark",
        "closing_date": "17 Oct 2025",
        "job_description": "<h2>PHP Developer</h2>\n<p><strong>Company:</strong> Twinsway Technologies (P) Ltd\n<strong>Location:</strong> Nila Building, Module No 643 6th Floor, Technopark Phase 1, Kazhakootam, 695581\n<strong>Website:</strong> http://www.twinsway.com\n<strong>Contact Email:</strong> hr@twinsway.in</p>\n<p><strong>Job Published:</strong> 25, Sept 2025\n<strong>Closing Date:</strong> 17, Oct 2025</p>\n<h3>Brief Description:</h3>\n<p>We are looking for a skilled PHP Developer to join our team. The ideal candidate should have hands-on experience in PHP, Laravel, and WordPress. You will be responsible for building high-quality web solutions, collaborating with cross-functional teams, and ensuring smooth deployment of applications.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop, test, and maintain web applications using PHP, Laravel, and WordPress.</li>\n<li>Write clean, efficient, and well-documented code.</li>\n<li>Collaborate with designers, front-end developers, and other team members to deliver projects on time.</li>\n<li>Stay updated with the latest industry trends and best practices.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>4 - 7 years of professional experience in PHP development.</li>\n<li>Strong knowledge and hands-on experience in Laravel and WordPress.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Good communication skills.</li>\n</ul>\n<p><strong>Note:</strong> IMMEDIATE JOINERS PREFERRED.</p>",
        "tags": [
            "4-7 Years",
            "PHP",
            "Laravel",
            "WordPress"
        ],
        "summary": "Seeking a skilled PHP Developer with 4-7 years of experience in PHP, Laravel, and WordPress. Responsibilities include developing, testing, and maintaining web applications."
    },
    {
        "job_title": "Research Psychologist Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/23812",
        "location": "Technopark",
        "closing_date": "11 Oct 2025",
        "job_description": "<h2>ZenturioTech (P) Ltd</h2>\n<p><strong>Location:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala , 695581\n<strong>Website:</strong> https://zenturiotech.com\n<strong>Contact Email:</strong> admin@zenturiotech.com</p>\n<h2>Research Psychologist Trainee</h2>\n<p><strong>Closing Date:</strong> 11, Oct 2025\n<strong>Job Published:</strong> 25, Sept 2025</p>\n<h3>About the Role:</h3>\n<p>We seek a motivated Research Psychologist Trainee with an interest in mental health and related areas of research. This role offers hands-on experience in research design, data analysis, paper publication, and report writing.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in research design, data collection, and analysis.</li>\n<li>Conduct literature reviews and summarize findings.</li>\n<li>Develop and validate psychological assessment tools.</li>\n<li>Prepare research reports and presentations.</li>\n<li>Publish research findings in reputed journals and present in conferences.</li>\n<li>Adhere to ethical research guidelines.</li>\n</ul>\n<h3>Qualifications &amp; Skills:</h3>\n<ul>\n<li>Master’s Degree in Psychology or related field.</li>\n<li>M.Phil. in Psychology (especially for clinical research or mental health-focused roles) - <em>Preferred</em></li>\n<li>Ph.D. (or pursuing) in Psychology or related discipline - <em>Preferred</em></li>\n<li>Exposure to mental health or behavioral research - <em>Preferred</em></li>\n<li>Proficiency in data analysis tools (SPSS, R, Python).</li>\n<li>Strong analytical and communication skills.</li>\n<li>Ability to work independently and collaboratively.</li>\n</ul>\n<h3>Benefits:</h3>\n<ul>\n<li>Hands-on research experience and mentorship.</li>\n<li>Exposure to industry-relevant tools and methods.</li>\n<li>Certificate of completion and career opportunities.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Submit your updated resume to admin@zenturiotech.com</p>",
        "tags": [
            "Trainee",
            "Psychology",
            "Research",
            "Data Analysis"
        ],
        "summary": "Seeking a Research Psychologist Trainee for mental health research. Responsibilities include data analysis, report writing, and publication. Offers hands-on experience and mentorship."
    },
    {
        "job_title": "Graphic Design Trainee",
        "company": "Netroxe It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23811",
        "location": "Technopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Graphic Design Trainee</h2>\n<p><strong>Company:</strong> Netroxe IT Solutions (P) Ltd\n<strong>Location:</strong> 4th Floor, CDAC Building, Technopark\n<strong>Contact Email:</strong> hr@netroxe.com\n<strong>Website:</strong> http://www.netroxe.com\n<strong>Job Published:</strong> 25, Sept 2025\n<strong>Closing Date:</strong> 10, Oct 2025</p>\n<h3>Brief Description</h3>\n<p>We are seeking a creative and passionate Graphic Design Trainee to join our team. This is an excellent opportunity for individuals with a strong interest in design, a desire to experiment, and a willingness to learn in a dynamic environment to launch your design career.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Assist the design team in creating various digital and print assets, including social media creatives, banners, posters, infographics, and presentations.</li>\n<li>Develop visual content that adheres to the brand's identity and guidelines.</li>\n<li>Support senior designers with brainstorming, ideation, and project execution.</li>\n<li>Adapt and resize creative assets for multiple platforms and formats.</li>\n<li>Stay informed about current design trends, tools, and best practices.</li>\n<li>Ensure all assigned tasks are completed on time with meticulous attention to detail.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Basic proficiency in <strong>Adobe Photoshop</strong> and <strong>Adobe Illustrator</strong> (mandatory).</li>\n<li>Understanding of color theory, typography, layout, and composition principles.</li>\n<li>A creative mindset with a keen eye for detail.</li>\n<li>Good communication skills and receptiveness to constructive feedback.</li>\n</ul>\n<h3>Preferred Qualification</h3>\n<ul>\n<li>A degree or diploma in Graphic Design, Visual Arts, or a related field.</li>\n<li>Completion of a recognized Graphic Design Course.</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>If you are interested, please fill out the job application form from the link below (Mandatory):\nhttps://docs.google.com/forms/d/e/1FAIpQLSf6tLHdyNUFmTT06Mm6FAL0AgmbZYVwZe37Xcs97jB3h2yYnA/viewform?usp=header</p>",
        "tags": [
            "0-1 Year",
            "Graphic Design",
            "Adobe Photoshop",
            "Adobe Illustrator"
        ],
        "summary": "Seeking a creative Graphic Design Trainee with basic Adobe Photoshop/Illustrator skills. Assist in creating digital/print assets and learn in a fast-paced environment."
    },
    {
        "job_title": "Customer Success Executive",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/23810",
        "location": "Technopark",
        "closing_date": "27 Sep 2025",
        "job_description": "<h2>Customer Success Executive - Walk-In Interview</h2>\n<p><strong>Company:</strong> Way Dot Com (P) Ltd (Way.com India Pvt Ltd)\n<strong>Address:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Website:</strong> http://www.way.com</p>\n<p><strong>Walk-In Details:</strong>\n*   <strong>Date:</strong> September 27, 2025\n*   <strong>Time:</strong> 10:30 AM - 12:00 PM\n*   <strong>Job Published:</strong> September 25, 2025\n*   <strong>Contact Email:</strong> careers@way.com</p>\n<hr />\n<h3>About Us</h3>\n<p>Way.com is America’s dominant automotive super app, serving over 10 million customers with services ranging from auto insurance and parking to EV charging. We utilize AI, machine learning, and data analytics to offer innovative, personalized car ownership solutions. Recognized by Bloomberg and Andreessen Horowitz, Way.com simplifies, makes affordable, and enhances the car ownership experience.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dedicated Customer Success Executive to be the primary contact for our customers. This role involves providing prompt, helpful, and courteous assistance across various communication channels. You will play a crucial part in delivering an exceptional customer service experience.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Address customer inquiries via phone, email, chat, and social media.</li>\n<li>Troubleshoot and effectively resolve customer concerns.</li>\n<li>Handle questions about products, orders, returns, and general support.</li>\n<li>Maintain accurate customer records and feedback in the CRM system.</li>\n<li>Escalate complex issues to appropriate internal teams.</li>\n<li>Track customer satisfaction metrics and propose improvements.</li>\n<li>Ensure all interactions are professional, empathetic, and customer-focused.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>Experience:</strong> 2-5 years in customer service or a similar role.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Ability to remain calm under pressure and handle difficult situations professionally.</li>\n<li>Strong problem-solving skills with keen attention to detail.</li>\n<li>Familiarity with CRM systems (preferred, not required).</li>\n<li>Positive attitude and a passion for assisting others.</li>\n<li>Ability to collaborate effectively within a team.</li>\n</ul>\n<h3>Walk-In Venue:</h3>\n<ul>\n<li><strong>Location:</strong> Way.com, 4th floor, Technopark Phase - 3</li>\n<li><strong>Time:</strong> 10:30 AM to 12:00 PM</li>\n<li><strong>Experience Required:</strong> 2 - 5 years</li>\n</ul>\n<h3>Walk-In Entry Pass Information:</h3>\n<p>Candidates must apply for a Technopark Campus entry pass via the mobile app or web browser. Upon application, the pass will be sent to their registered mobile number/email ID. Show the soft copy of the pass on your device at the Technopark Entrance Gate. For those without smartphones, print your entry pass from self-operating kiosks near the TECHNOPARK Main Gate using the provided 5-digit OTP.</p>\n<ul>\n<li><strong>Mobile App (Android):</strong> [Click here to download]</li>\n<li><strong>Mobile App (iOS):</strong> [Click here to download]</li>\n<li><strong>Website for Pass:</strong> vms.technopark.org</li>\n<li><strong>User Manual:</strong> [Click here]</li>\n</ul>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for Walk-In interview access.</p>",
        "tags": [
            "2-5 Years",
            "Customer Service",
            "CRM",
            "Communication Skills"
        ],
        "summary": "Seeking a Customer Success Executive for Way.com to assist customers via multiple channels. Requires 2-5 years of experience in customer service and strong problem-solving skills."
    },
    {
        "job_title": "Apprenticeship at Electronics Technology Parks-Kerala (Technopark)",
        "company": "Electronics Technology Parks Kerala (Technopark)",
        "url": "https://technopark.org/job-details/23808",
        "location": "Technopark",
        "closing_date": "04 Oct 2025",
        "job_description": "<h2>Apprenticeship at Electronics Technology Parks-Kerala (Technopark)</h2>\n<p><strong>Location:</strong> Park Centre, Technopark Campus, Trivandrum, 695581\n<strong>Website:</strong> https://technopark.in</p>\n<p><strong>Closing Date:</strong> 04, Oct 2025\n<strong>Job Published:</strong> 25, Sept 2025\n<strong>Contact Email:</strong> apprenticeship@technopark.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking talented and driven graduates for paid apprenticeships at Park Centre, Technopark. This is a 1-year contract opportunity to gain hands-on experience in Electronics and Communication.</p>\n<h3>Requirements</h3>\n<ul>\n<li>Diploma in Electronics and Communication, Electrical and Electronics, Electronics &amp; Instrumentation, and Applied Electronics (graduating in 2021 or later).</li>\n<li>Clear and consistent communication skills.</li>\n<li>A natural interest in working with people.</li>\n<li>Ability to work in a fast-paced and dynamic environment.</li>\n</ul>\n<h3>Duties and Responsibilities</h3>\n<ul>\n<li>Monitor and operate the CCTV surveillance system continuously from the Control Room.</li>\n<li>Perform live monitoring of all access points, perimeters, and critical areas within the Technopark campus to ensure security and safety.</li>\n<li>Log and report any suspicious activity, unauthorized access, or system anomalies immediately.</li>\n<li>Register and respond to grievances and complaints received in the Control Room, coordinating follow-up actions.</li>\n<li>Maintain accurate records of incidents, system faults, or maintenance needs in the Control Room logbook.</li>\n<li>Assist AMC technicians or authorized service personnel with on-ground support, system checks, or troubleshooting.</li>\n<li>Ensure proper functioning of all surveillance equipment and report technical issues promptly.</li>\n<li>Adhere to Standard Operating Procedures (SOPs), maintaining confidentiality and data security.</li>\n<li>Maintain cleanliness and operational readiness of the Control Room environment.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Shift Timings:<ul>\n<li>Morning Shift: 6:00 AM to 2:00 PM</li>\n<li>Afternoon Shift: 2:00 PM to 10:00 PM</li>\n<li>Night Shift: 10:00 PM to 6:00 AM</li>\n</ul>\n</li>\n<li>Stipend: Rs. 12,000/month.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates may send their resumes to <strong>apprenticeship@technopark.in</strong> with the subject line <strong>“Application for Technician Apprentice – Control Room”</strong>. Please attach scanned copies of your certificates along with your resume. The last date to apply is <strong>04.10.2025</strong>.</p>\n<p><strong>Note:</strong> Vacancies are subject to change. Technopark reserves the right to modify or cancel the recruitment process as needed.</p>",
        "tags": [
            "0-1 Years",
            "Electronics",
            "CCTV Surveillance",
            "Control Room Operations"
        ],
        "summary": "Paid apprenticeships for Electronics and Communication graduates at Technopark. Gain hands-on experience in CCTV surveillance and control room operations for one year."
    },
    {
        "job_title": "HR Executive",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/23807",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>HR Executive</h2>\n<p><strong>Company:</strong> Cloud Nautical Solutions India Pvt Ltd</p>\n<p><strong>Location:</strong> Module No.K12, 2nd Floor, Kabani Building, Technocity, Phase 4, Technopark, Trivandrum, Kerala, India, 695317</p>\n<p><strong>Website:</strong> https://www.cloudnautical.com</p>\n<p><strong>Contact Email:</strong> careers@cloudnautical.com</p>\n<p><strong>Job Published:</strong> 25th September 2025</p>\n<p><strong>Closing Date:</strong> 3rd October 2025</p>\n<p><strong>Description:</strong></p>\n<p>We are seeking a dynamic HR Executive with 2 to 4 years of experience in the IT/Software industry. The ideal candidate will manage core HR operations, full-cycle recruitment, payroll, compliance, and employee engagement initiatives. The role also requires strong communication and writing skills to support internal communications and content creation. Immediate Joiners preferred.</p>\n<h2>Key Responsibilities:</h2>\n<ul>\n<li>Handle end-to-end IT recruitment including sourcing, screening, interviewing, and onboarding.</li>\n<li>Manage payroll processing, attendance tracking, and ensure statutory compliance (PF, ESI, etc.).</li>\n<li>Serve as the first point of contact for employee queries, grievance handling, and HR support.</li>\n<li>Hands-on experience working in HRMS Platforms (Zoho People, GreytHR, Bamboo HR).</li>\n<li>Assist with performance management, appraisal processes, and HR analytics.</li>\n<li>Plan and organize employee engagement programs, training sessions, and internal communication activities.</li>\n<li>Draft and manage HR-related content, policies, and official communications.</li>\n<li>Maintain and update HR records, policies, and documentation accurately.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ul>\n<li>Bachelor’s/Master’s degree in HR or a related field.</li>\n<li>Minimum 2 years of experience as an HR Executive/HR Generalist, preferably in the IT industry.</li>\n<li>Proven experience in full-cycle recruitment, payroll handling, and HR operations.</li>\n<li>Good knowledge of labour laws, compliance regulations, and HR best practices.</li>\n<li>Excellent communication, interpersonal, and content writing skills.</li>\n<li>Strong organizational and multitasking abilities.</li>\n</ul>\n<p><em>(Additional fields like Total Experience, CTC, Notice Period, Reason for change, Current location, and Preferred location were mentioned but no specific values were provided in the description.)</em></p>",
        "tags": [
            "2-4 Years",
            "HR Operations",
            "Recruitment",
            "Payroll"
        ],
        "summary": "Seeking an HR Executive with 2-4 years of IT experience for core HR operations. Responsibilities include recruitment, payroll, compliance, and employee engagement."
    },
    {
        "job_title": "RPA Developer [Automation Anywhere]",
        "company": "Alzone Software (P) Ltd",
        "url": "https://technopark.org/job-details/23806",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>RPA Developer (Automation Anywhere)</h2>\n<p><strong>Company:</strong> Alzone Software (P) Ltd\n<strong>Location:</strong> ACE 04, 3rd Floor, CDAC Building, Technopark Campus, Kerala, India, 695581\n<strong>Website:</strong> http://www.alzonesoftware.com\n<strong>Closing Date:</strong> 03, Oct 2025\n<strong>Job Published:</strong> 25, Sept 2025\n<strong>Contact Email:</strong> careers@alzonesoftware.com</p>\n<h3>Brief Description</h3>\n<ul>\n<li><strong>Experience:</strong> 3 years and above</li>\n<li><strong>Location:</strong> Technopark Phase 1, Trivandrum [WFO]</li>\n<li><strong>Notice Period:</strong> Immediate or one month</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and deploy Robotics Process Automation (RPA) solutions using Automation Anywhere, adhering to design principles and conventions.</li>\n<li>Configure robotics processes and objects using core workflow principles efficiently; ensure they are easily maintainable and understandable.</li>\n<li>Solve day-to-day issues arising while running robotics processes and provide timely resolutions.</li>\n<li>Maintain proper documentation for solutions, test procedures, and scenarios during UAT and Production phases.</li>\n<li>Coordinate with process owners and business to understand the as-is process and design the automation process.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Hands-on experience with Automation Anywhere, with a minimum of 3 projects completed using the tool.</li>\n<li>Excellent communication skills – written and verbal.</li>\n<li>Experience in Healthcare / Insurance / Manufacturing domain will be an advantage (Not mandatory).</li>\n<li>Immediate Joiners Preferred.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>If you are interested, please share the following details along with your updated CV to careers@alzonesoftware.com with the subject line \"Application for RPA Developer- Automation Anywhere\":</p>\n<ul>\n<li>Native Location:</li>\n<li>Current CTC:</li>\n<li>Expected CTC:</li>\n<li>Notice Period:</li>\n<li>Willingness to Relocate to Trivandrum (Yes/No):</li>\n<li>Total Experience:</li>\n<li>Relevant Experience in Automation Anywhere:</li>\n<li>Tools Used:</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Automation Anywhere",
            "RPA",
            "Process Automation"
        ],
        "summary": "Seeking an RPA Developer with 3+ years of experience in Automation Anywhere. Responsibilities include designing, developing, and deploying RPA solutions and resolving daily issues."
    },
    {
        "job_title": "CONTENT WRITER - INTERN",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/23805",
        "location": "Technopark",
        "closing_date": "06 Oct 2025",
        "job_description": "<h2>Content Writer - Intern</h2>\n<p><strong>Company:</strong> ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED\n<strong>Location:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<strong>Website:</strong> https://www.ateamsoft.com\n<strong>Contact Email:</strong> recruitment@ateamsoftsolutions.com\n<strong>Contact Number:</strong> +91 7907410058\n<strong>Application Closing Date:</strong> October 6, 2025\n<strong>Job Published Date:</strong> September 25, 2025</p>\n<h3>About the Company</h3>\n<p>ATeam InfoSoft Solutions, Technopark is a growing team dedicated to delivering innovative and impactful digital solutions. We are seeking a highly motivated and detail-oriented Content Writer / Curator to join our team and contribute to the development of high-quality content across blogs, social media, websites, and marketing campaigns.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Write, proofread, and edit content to ensure clarity, accuracy, and readability.</li>\n<li>Curate and adapt content for multiple platforms including blogs, social media, websites, and emails.</li>\n<li>Collaborate effectively with writers, designers, and team members to maintain content quality and consistency.</li>\n<li>Ensure all content aligns with the organization’s brand voice and communication standards.</li>\n</ul>\n<h3>Qualifications &amp; Skills</h3>\n<ul>\n<li>Bachelor’s degree in English, Journalism, Communications, or a related field.</li>\n<li>Strong command of the English language with excellent writing, editing, and proofreading skills.</li>\n<li>Familiarity with digital content, SEO principles, and marketing concepts is a plus.</li>\n<li>Detail-oriented, creative, and capable of working independently as well as collaboratively.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong creative writing ability with attention to detail.</li>\n<li>Basic knowledge of SEO, keywords, and digital content trends.</li>\n<li>Familiarity with social media content writing and engagement strategies.</li>\n<li>Ability to multitask and manage time effectively in a fast-paced environment.</li>\n<li>Proficiency in MS Office / Google Workspace tools.</li>\n<li>A proactive approach to learning and adapting to new content strategies.</li>\n</ul>\n<p><strong>Apply Now:</strong> recruitment@ateamsoftsolutions.com</p>",
        "tags": [
            "Intern",
            "Content Writing",
            "SEO",
            "Digital Marketing"
        ],
        "summary": "Seeking a motivated Content Writer Intern to create and curate engaging content for digital platforms. Must have strong writing skills and an interest in digital marketing."
    },
    {
        "job_title": "Senior Data Engineer",
        "company": "Experion Technologies (I) (P) Ltd",
        "url": "https://technopark.org/job-details/23804",
        "location": "Technopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Data Engineer</h2>\n<p><strong>Company:</strong> Experion Technologies (I) (P) Ltd\n<strong>Location:</strong> Cochin/TVM /Remote\n<strong>Date Published:</strong> 25, Sept 2025\n<strong>Closing Date:</strong> 31, Oct 2025\n<strong>Contact Email:</strong> sandra.paul@experionglobal.com</p>\n<h3>Job Purpose</h3>\n<p>Own the end-to-end data lifecycle by collaborating with cross-functional teams in an Agile, sprint-based environment to achieve business goals.</p>\n<h3>Job Description / Duties &amp; Responsibilities</h3>\n<p><strong>Data Lifecycle Ownership:</strong>\n- Design, build, and maintain scalable data pipelines to ingest raw data into our data lake (bronze layer).\n- Develop and implement robust data models, transforming and enriching data through cleansing, validation (silver layer), and aggregation to create business-ready datasets (gold layer).\n- Establish and enforce data quality and governance standards across the entire data lifecycle.\n- Optimize data platform performance for consumption by analytics, data science, and BI teams.\n- Create and maintain comprehensive documentation for data pipelines, models, and architectures.</p>\n<p><strong>Agile Methodology &amp; Collaboration:</strong>\n- Actively participate in all Agile ceremonies, including sprint planning, daily stand-ups, reviews, and retrospectives.\n- Work closely with Product Owners and stakeholders to understand business requirements and translate them into technical specifications and data models.\n- Collaborate with QA engineers to develop testing strategies, automate data quality checks, and resolve issues.\n- Partner with software developers and platform engineers to ensure seamless integration of data sources and stability of the data platform.\n- Manage tasks, priorities, and timelines effectively within two-week sprint cycles, communicating progress and blockers clearly.\n- Adhere to the Information Security Management policies and procedures.</p>\n<h3>Job Specification / Skills and Competencies</h3>\n<p><strong>Data Lifecycle Ownership (Fabric &amp; Databricks):</strong>\n- Design, build, and maintain scalable data ingestion pipelines using Azure Data Factory, Fabric Data Pipelines, and Databricks Notebooks (PySpark/SQL).\n- Implement and manage a robust Medallion architecture (Bronze/Silver/Gold) across Azure Data Lake Storage (ADLS Gen2) and Fabric OneLake.\n- Develop, optimize, and manage high-performance data models within Databricks (Delta Lake) and Fabric Lakehouses.\n- Optimize Databricks cluster configurations and Fabric capacities for performance, scalability, and cost-efficiency.</p>\n<p><strong>Platform Automation &amp; CI/CD:</strong>\n- Implement and manage CI/CD pipelines for all data solutions using Azure DevOps (Repos, Pipelines).\n- Automate the deployment of Databricks notebooks, Fabric artifacts (Lakehouses, pipelines, reports), and underlying Azure resources (ARM/Bicep templates).\n- Drive the data platform automation strategy, focusing on infrastructure as code (IaC), automated testing, and repeatable release management.\n- Monitor, troubleshoot, and optimize deployment pipelines for speed, reliability, and security.</p>\n<p><strong>Agile Methodology &amp; Collaboration:</strong>\n- Actively participate in all Agile ceremonies, including sprint planning, daily stand-ups, reviews, and retrospectives.\n- Partner closely with Product Owners to understand business requirements and translate them into technical specifications for Fabric and Databricks.\n- Collaborate with QA engineers to integrate automated data quality testing into CI/CD pipelines.\n- Work with Power BI developers and Data Scientists who consume the gold-layer data from Fabric, ensuring their deployment needs are met.</p>\n<h3>Required Qualifications</h3>\n<ul>\n<li>3+ years of proven experience as a Data Engineer with a strong focus on the Azure ecosystem.</li>\n<li>Deep, hands-on expertise with Azure Databricks (including PySpark, Spark SQL, Delta Lake).</li>\n<li>Demonstrable experience with Microsoft Fabric, including OneLake, Lakehouses, and Data Pipelines.</li>\n<li>Proven experience with Azure DevOps (Repos, Pipelines) to build and manage CI/CD pipelines for data workloads.</li>\n<li>Strong understanding of data platform automation and infrastructure as code (IaC) using ARM templates or Bicep.</li>\n<li>Strong proficiency in SQL and Python (PySpark).</li>\n<li>Solid understanding of data modelling principles and the Medallion architecture (bronze/silver/gold).</li>\n<li>Proven experience working in an Agile/Scrum development environment.</li>\n<li>Excellent problem-solving skills and a collaborative, team-first mindset.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Previous domain experience in supply chain, logistics, or operations.</li>\n<li>Microsoft Certification: Azure Data Engineer (DP-203), Fabric Analytics Engineer (DP-600), or DevOps Engineer Expert (AZ-400).</li>\n<li>Experience with data streaming using Databricks Structured Streaming, Azure Event Hubs, or Fabric Real-Time Analytics.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Skills – Mandatory - Azure Fabric, Databricks, Data Modelling</li>\n<li>Skills - Primary - PySpark, Databricks, SQL, Python</li>\n<li>Skills - Good to have - Azure Data Factory, CICD, Azure Devops, Airflow</li>\n</ul>\n<p><strong>Company Address:</strong> 407, 4th Floor, Thejaswini, Technopark Campus, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> http://www.experionglobal.com</p>",
        "tags": [
            "3+ Years",
            "Azure Fabric",
            "Databricks",
            "Python"
        ],
        "summary": "Senior Data Engineer needed for end-to-end data lifecycle ownership in an Agile environment. Requires expertise in Azure Fabric, Databricks, PySpark, SQL, and Python."
    },
    {
        "job_title": "SALES CLOSER MANAGER  – FinTech Software Male Candidates - NORTH KERALA",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/23802",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>SALES CLOSER MANAGER – FinTech Software</h2>\n<p><strong>Company:</strong> IGNOSI ENTERPRISES\n<strong>Location:</strong> All Kerala (Travel Involved)\n<strong>Contact Email:</strong> hr@ignosi.co.in\n<strong>Contact Phone:</strong> 9778196774\n<strong>Website:</strong> http://www.ignosi.in\n<strong>Closing Date:</strong> October 3, 2025\n<strong>Job Published:</strong> September 25, 2025</p>\n<h3>Brief Description</h3>\n<p>We're Hiring! Join Our Friendly Sales Team!</p>\n<p>If you love talking to people, enjoy technology, and are curious to learn something new, we’d love to meet you. We are looking for someone who is:</p>\n<ul>\n<li><strong>Good at communicating:</strong> Clearly explain things.</li>\n<li><strong>Okay with a bit of travel:</strong> Visit clients and make real connections.</li>\n<li><strong>Excited to learn:</strong> We’ll train you on everything!</li>\n</ul>\n<p><strong>Bonus:</strong> Experience in B2B sales within banking, finance, or jewelry is a plus.</p>\n<h3>What You Get:</h3>\n<ul>\n<li><strong>Monthly Salary:</strong> ₹20,000 - ₹30,000 + Extra Incentives</li>\n<li><strong>Growth Path:</strong> Opportunity to become a Sales Manager within a year.</li>\n<li><strong>Training &amp; Support:</strong> Guidance provided at every step.</li>\n<li><strong>Friendly Culture:</strong> A supportive team environment.</li>\n</ul>\n<p><strong>Note:</strong> This role is specifically for Male Candidates.</p>\n<p><strong>To Apply:</strong> Send a message or your resume to hr@ignosi.co.in or call 9778196774. Not sure if you fit? Let's talk!</p>",
        "tags": [
            "0-2 Years",
            "Sales",
            "FinTech",
            "B2B Sales"
        ],
        "summary": "Seeking a Male Sales Closer Manager for FinTech software in Kerala. This role involves client interaction, travel, and offers salary plus incentives and growth opportunities."
    },
    {
        "job_title": "Sales & Marketing Support (Female Staff Only)",
        "company": "Ignosi Enterprises",
        "url": "https://technopark.org/job-details/23801",
        "location": "Technopark",
        "closing_date": "04 Oct 2025",
        "job_description": "<h2>Sales &amp; Marketing Support (Female Staff Only)</h2>\n<p><strong>Company:</strong> IGNOSI ENTERPRISES\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Website:</strong> http://www.ignosi.in\n<strong>Contact Email:</strong> hr@ignosi.co.in\n<strong>Contact Phone:</strong> 97781 96774\n<strong>Closing Date:</strong> 04, Oct 2025\n<strong>Job Published:</strong> 25, Sept 2025</p>\n<h3>About Us:</h3>\n<p>Join our vibrant team at IGNOSI ENTERPRISES, a company that supports jewellery businesses with digital tools and marketing solutions. We are looking for a smart, friendly, and responsible individual to join our office team.</p>\n<h3>Your Main Responsibilities:</h3>\n<ul>\n<li><strong>Sales Lead Follow-Up:</strong> Make calls, filter jewellery clients, and update the CRM.</li>\n<li><strong>Demo Scheduling:</strong> Coordinate and manage demo appointments.</li>\n<li><strong>Meta Sales Follow-Up:</strong> Track demo conversions and support the sales team.</li>\n<li><strong>Field Report Monitoring:</strong> Collect and manage daily field sales reports.</li>\n<li><strong>Digital Media Support:</strong> Assist in social media planning, gold rate sharing, and basic campaign support.</li>\n<li><strong>Content &amp; Creative Support:</strong> Help prepare short scripts and coordinate posters/reels.</li>\n</ul>\n<h3>Target:</h3>\n<ul>\n<li>40 Product demos for sales coordination/month.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Interest in presentation, voice-over, or content writing is a plus.</li>\n</ul>\n<h3>Eligibility:</h3>\n<ul>\n<li><strong>Only female candidates.</strong></li>\n<li>Must have prior experience in sales support/follow-up.</li>\n<li>Good Malayalam communication and basic English skills.</li>\n<li>Must be organized, proactive, and tech-friendly.</li>\n<li>Interest in media, marketing, or creative content is a big plus!</li>\n</ul>\n<h3>What We Offer:</h3>\n<ul>\n<li>Friendly office atmosphere.</li>\n<li>Supportive team culture.</li>\n<li>Opportunity to grow in the digital media &amp; software industry.</li>\n<li>Incentives for performance and creative contributions.</li>\n<li>Clear daily/weekly goals — no pressure selling.</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume or a quick hello to hr@ignosi.co.in or call 97781 96774.</p>",
        "tags": [
            "Prior Experience Required",
            "Sales Support",
            "Digital Marketing",
            "CRM"
        ],
        "summary": "Sales & Marketing Support role for female candidates in Trivandrum. Responsibilities include lead follow-up, scheduling, and digital media assistance. Offers incentives and growth opportunities."
    },
    {
        "job_title": "Freelance / Contract SharePoint & M365 Developer",
        "company": "Altaire Insights Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23800",
        "location": "Technopark",
        "closing_date": "29 Sep 2025",
        "job_description": "<h2>Freelance / Contract SharePoint &amp; M365 Developer</h2>\n<p><strong>Company:</strong> Altaire Insights Technologies (P) Ltd\n<strong>Location:</strong> Technopark Campus Phase 1, Trivandrum, Kerala, India\n<strong>Contact:</strong> hr@altaire-insights.com\n<strong>Website:</strong> https://www.altaire-insights.com</p>\n<p><strong>Job Published:</strong> September 25, 2025\n<strong>Closing Date:</strong> September 29, 2025</p>\n<h3>Brief Description</h3>\n<p>Altaire Insights Technologies is seeking a skilled developer for a short-term, 2-week project to integrate Microsoft Copilot into a SharePoint Online intranet portal.</p>\n<h3>Preferred Skills &amp; Deliverables</h3>\n<ul>\n<li><strong>Scope &amp; Deliverables:</strong><ul>\n<li>Enable Microsoft Copilot and configure Single Sign-On (SSO) using Microsoft Entra ID / Azure AD for seamless access.</li>\n<li>Develop and deploy a responsive chat panel/widget using SharePoint Framework (SPFx) with React and TypeScript.</li>\n<li>Implement role-based answers by connecting to SharePoint, Microsoft Teams, and other agreed upon Microsoft 365 sources via Microsoft Graph.</li>\n<li>Provide a comprehensive test report covering SSO functionality, role-based access, and performance.</li>\n<li>Deliver a brief user guide.</li>\n</ul>\n</li>\n</ul>\n<h3>Project Details</h3>\n<ul>\n<li><strong>Type:</strong> Freelance / Contract</li>\n<li><strong>Duration:</strong> Approximately 2 weeks</li>\n<li><strong>Location:</strong> Remote OK</li>\n<li><strong>Start Date:</strong> Immediate start preferred</li>\n</ul>\n<h3>How to Apply</h3>\n<p>If you are interested or know someone suitable for this role, please direct message [Contact Person - if specified, otherwise omit] or send their details to hr@altaire-insights.com.</p>",
        "tags": [
            "2-4 Years",
            "SharePoint Framework (SPFx)",
            "Microsoft Graph",
            "Microsoft Copilot"
        ],
        "summary": "Seeking a SharePoint & M365 developer for a 2-week freelance project. The role involves integrating Microsoft Copilot into a SharePoint Online portal with SSO and role-based access. Remote work is available."
    }
]