[
    {
        "job_title": "Senior Business Development Executive",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/19559/296",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Senior Business Development Executive – IT Services</h2>\n<p><strong>Location:</strong> Infopark Kakkanad</p>\n<p><strong>Experience:</strong> 2-5 years</p>\n<p><strong>Employment Type:</strong> Full-Time</p>\n<p><strong>Job Summary:</strong></p>\n<p>We are looking for a proactive and results-driven Sr. Business Development Executive to drive sales and expand our client base in IT services. The ideal candidate will identify business opportunities, develop strong client relationships, and collaborate with internal teams to deliver IT solutions tailored to customer needs.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead Generation &amp; Prospecting: Identify and generate new business opportunities through market research, networking, cold calling, and online channels.</li>\n<li>Client Relationship Management: Build and maintain strong relationships with potential and existing clients.</li>\n<li>Sales Strategy &amp; Execution: Develop sales strategies, proposals, and presentations to pitch IT services to clients.</li>\n<li>Market Research &amp; Analysis: Stay updated on industry trends, competitors, and emerging technologies to refine business strategies.</li>\n<li>Negotiation &amp; Closing Deals: Handle negotiations, prepare contracts, and close deals to meet or exceed sales targets.</li>\n<li>Collaboration with Technical Teams: Work closely with developers, project managers, and technical teams to ensure seamless service delivery.</li>\n<li>Reporting &amp; Performance Tracking: Maintain records of sales activities, leads, and client interactions.</li>\n</ul>\n<p><strong>Key Skills &amp; Requirements:</strong></p>\n<ul>\n<li>Experience in IT Services Sales (software solutions, cloud services, cybersecurity, etc.).</li>\n<li>Strong communication, negotiation, and presentation skills.</li>\n<li>Ability to identify client pain points and offer tailored IT solutions.</li>\n<li>Proficiency in CRM tools and sales tracking software.</li>\n<li>Self-motivated, target-driven, and a team player.</li>\n<li>Any degree.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@grapelime.in / binil@grapelimeinnovations.com</p>",
        "tags": [
            "2-5 Years",
            "IT Services Sales",
            "CRM tools",
            "Negotiation"
        ],
        "summary": "Seeking a Senior Business Development Executive to boost IT service sales. The role involves lead generation, client relationship management, and strategic sales execution to achieve targets."
    },
    {
        "job_title": "Business Development Intern",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/19560/296",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Business Development Intern</h2>\n<p>Ready to launch your career in business development? Join GrapeLime Innovations PVT Ltd and grow with a passionate, innovative team!</p>\n<p>Outstanding performers during the internship will have a strong chance to be offered a permanent role.</p>\n<p><strong>Location:</strong> Infopark, Kakkanad</p>\n<p><strong>Work Days:</strong> Monday to Friday (5-day work week)</p>\n<p><strong>Eligibility:</strong> Graduates from 2022, 2023, or 2024 (BTech, MCA candidates please excuse)</p>\n<p><strong>What You'll Do:</strong></p>\n<ul>\n<li>Identify and engage new sales leads</li>\n<li>Pitch and promote our services to potential clients</li>\n<li>Collaborate with cross-functional teams</li>\n<li>Tackle challenges with creativity and confidence</li>\n<li>Manage time, prioritize tasks, and meet deadlines</li>\n</ul>\n<p><strong>What We’re Looking For:</strong></p>\n<ul>\n<li>Excellent communication skills – both verbal and written (a must)</li>\n<li>Creative mindset and strong problem-solving abilities</li>\n<li>Resilience under pressure and a drive to meet goals</li>\n<li>Superb organizational and time-management skills</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Send your updated CV to hr@grapelime.in</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@grapelime.in</p>",
        "tags": [
            "Entry Level",
            "Business Development",
            "Communication Skills",
            "Sales"
        ],
        "summary": "GrapeLime Innovations is seeking a motivated Business Development Intern to identify leads and promote services. Strong communication, problem-solving, and time-management skills are essential."
    },
    {
        "job_title": "Software Engineer – DevOps",
        "company": "Dynactionize India Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19562/115",
        "location": "Infopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Software Engineer – DevOps</h2>\n<p><strong>Location:</strong> Infopark phase 1, Kochi</p>\n<p><strong>Employment:</strong> Full-time</p>\n<p><strong>Experience:</strong> 0 years</p>\n<p><strong>Job Overview</strong></p>\n<p>As a DevOps Engineer, you will be responsible for handling the IT infrastructure as per the business needs, deploying product updates, monitoring performance, streamline operations and processes, etc.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Contribute towards infrastructure setup for an on-premise/ Cloud project.</li>\n<li>Research, recommend, document, and implement tools as needed with the goal of increasing automation.</li>\n<li>Administration of IT infrastructure. Add users to build systems and manage access rights.</li>\n<li>Improve the existing automated tools to optimize processes.</li>\n<li>Knowledge of at least one programming language such as Python or Golang</li>\n<li>Work closely with the development team to support, ensure, secure, and quality-driven development process using CI/ CD pipelines.</li>\n<li>Monitoring and troubleshooting issues in various infrastructure setups; proposing and implementing solutions to solve them.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<p><strong>Education:</strong> B.E. /B.Tech. CS/ IT/ EC/ MCA only</p>\n<p><strong>Year of Passing:</strong> 2024/25</p>\n<p><strong>Experience:</strong> 1 year Experience / 0 years (Freshers)</p>\n<p>Good to have exposure to Git, Ansible, Windows, Unix, Docker, Microsoft Azure, Oracle cloud and any container orchestration tool.</p>\n<p><strong>About You</strong></p>\n<ul>\n<li>You are a good programmer with excellent troubleshooting, problem-solving and analytical skills.</li>\n<li>Possesses fundamental knowledge in Linux administration, Computer Networking and is familiar with scripting.</li>\n<li>You think ‘out of the box’ and can offer innovative solutions to solve an issue.</li>\n<li>You are a good team player and are eager to learn new technologies and be able to work independently, prioritize tasks and have solid working principles.</li>\n</ul>\n<p><strong>About Consono</strong></p>\n<p>Consono is a growing multinational software company, developer of a revolutionary self-learning data platform that helps discover structure in unstructured data so that all data types can be stored, analysed, and exploited in the same way. Headquartered in Belgium, the company has offices in India, Austria, Spain, and the UK.</p>\n<p>Discover more on our website at www.consono.ai</p>\n<p>If you believe you are a good fit and can join immediately, please send your updated resume with a cover letter to jobs-india@dynactionize.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jobs-india@dynactionize.com</p>",
        "tags": [
            "0 Years",
            "DevOps",
            "CI/CD",
            "Python"
        ],
        "summary": "Consono is seeking a DevOps Engineer to manage IT infrastructure, automate processes, and support development using CI/CD. The role involves troubleshooting, implementing solutions, and collaborating with the development team."
    },
    {
        "job_title": "Content Strategist",
        "company": "Mantra IT Solutions",
        "url": "https://infopark.in/company-jobs/details/19556/383",
        "location": "Infopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Content Strategist</h2>\n<p>We are seeking a dynamic and creative Content Strategist with a strong background in digital marketing and storytelling. The ideal candidate will be responsible for planning, developing, and managing content that enhances brand awareness, audience engagement, and campaign performance. Fluency in both Malayalam and English is essential, along with hands-on experience in blogs, video scripts, campaign messaging, and social media content.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and execute result-oriented content strategies for digital marketing campaigns.</li>\n<li>Plan and manage content calendars aligned with campaign goals, seasonal trends, and product launches.</li>\n<li>Create compelling content for platforms including Instagram, Facebook, LinkedIn, and YouTube.</li>\n<li>Write video scripts, social media copy, blogs, and campaign messaging in both Malayalam and English.</li>\n<li>Collaborate with performance marketers, designers, and video editors to ensure cohesive campaign messaging.</li>\n<li>Analyze content performance metrics (engagement, reach, conversions) and optimize accordingly.</li>\n<li>Maintain consistent tone, branding, and relevance across all digital platforms.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Minimum 2 years of proven experience in content strategy, content creation, or digital marketing.</li>\n<li>Strong portfolio demonstrating blogs, social content, and video scripts.</li>\n<li>Proficiency in MS Office tools – Microsoft Word, Excel, and PowerPoint.</li>\n<li>Hands-on experience with Google Docs, Sheets, and Slides.</li>\n<li>Excellent command of written and spoken English and Malayalam.</li>\n<li>Strong understanding of platform-specific content trends and audience engagement.</li>\n<li>Ability to manage multiple projects with attention to detail and deadlines.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Prior experience in a digital marketing agency or brand communication team.</li>\n<li>Creative thinking with a strong understanding of storytelling, hooks, and content psychology</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Work in a high-growth, performance-driven digital marketing environment.</li>\n<li>Collaborate with a passionate and creative team.</li>\n<li>Opportunities for content experimentation, innovation, and career growth.</li>\n<li>Exposure to diverse campaigns across industries and digital platforms.</li>\n</ul>\n<p>Immediate joiners are highly preferred.</p>\n<p><strong>How to Apply</strong></p>\n<p>Interested candidates may send their resume and portfolio to hr@mantraitsolutions.in with the subject line: Content Strategist</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@mantraitsolutions.in</p>",
        "tags": [
            "2+ Years",
            "Content Strategy",
            "Digital Marketing",
            "Malayalam"
        ],
        "summary": "We need a Content Strategist to create engaging content in Malayalam and English. This role involves planning and optimizing content across various digital platforms."
    },
    {
        "job_title": "Sr. PHP Laravel Developer (Remote)",
        "company": "ContactPoint 360",
        "url": "https://infopark.in/company-jobs/details/19564/306",
        "location": "Infopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>Sr. PHP Laravel Developer (Remote)</h2>\n<p>We are looking to hire a talented PHP (Laravel) developer to manage our back-end services and ensure a seamless interchange of data between the server and our users. As a PHP developer, you will be responsible for developing and coding all server-side logic. You will also be required to maintain the central database and respond to requests from front-end developers.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Troubleshoot and test core product software to ensure strong optimization</li>\n<li>Contribute to all phases of the development lifecycle</li>\n<li>Conducting analysis of website and application requirements.</li>\n<li>Writing back-end code and building efficient PHP modules.</li>\n<li>Developing back-end portals with an optimized database.</li>\n<li>Troubleshooting application and code issues.</li>\n<li>Integrating data storage solutions.</li>\n<li>Responding to integration requests from front-end developers.</li>\n<li>Finalizing back-end features and testing web applications.</li>\n<li>Updating and altering application features to enhance performance.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor's degree in computer science or a similar field.</li>\n<li>Knowledge of PHP web frameworks, including Laravel.</li>\n<li>Knowledge of front-end technologies including CSS, JavaScript, and HTML5.</li>\n<li>Understanding of object-oriented PHP programming.</li>\n<li>Previous experience creating scalable applications.</li>\n<li>Proficient with code versioning tools</li>\n<li>Familiarity with SQL databases.</li>\n<li>Ability to project manage.</li>\n<li>Passion for best design and coding practices</li>\n<li>Strong knowledge of relational databases, tools and PHP skills</li>\n</ul>\n<p><strong>Job Highlight:</strong></p>\n<ul>\n<li>Work from Home</li>\n<li>Bring Your Own Device Mandatory</li>\n<li>The shift timing for one week each month will be from 5:30 PM to 3:30 AM.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at: \nsankar.rajappan@cp-360.com</p>",
        "tags": [
            "4+ Years",
            "Laravel",
            "PHP",
            "SQL Databases"
        ],
        "summary": "We are seeking a skilled Sr. PHP Laravel Developer to manage back-end services and develop server-side logic. The role involves database maintenance and collaboration with front-end developers."
    },
    {
        "job_title": "Accounting Associate/Sr. Accounting Associate",
        "company": "Redux (Network Redux)",
        "url": "https://infopark.in/company-jobs/details/19558/216",
        "location": "Infopark",
        "closing_date": "15 Aug 2025",
        "job_description": "<h2>Accounting Associate/Sr. Accounting Associate</h2>\n<p>This role involves the preparation and maintenance of financial statements in conformity with the Generally Accepted Accounting Principles of the United States of America (U.S. GAAP). The primary responsibilities include overseeing the day-to-day accounting processes and reviewing the accuracy of the monthly, quarterly, and annual financial statements. Additionally, the position will also be responsible for managing the site managers (for accounting purposes) and preparing budgets to control costs and enhance support processes.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Maintain accounting records and ledgers for client entities in accordance with US GAAP.</li>\n<li>Prepare and verify financial statements and ledgers for accuracy and regulatory compliance.</li>\n<li>Handle revenue postings, inventory tracking, receivables, and payables management.</li>\n<li>Apply and uphold internal accounting policies and control procedures.</li>\n<li>Perform reconciliations of bank statements, credit card accounts, and intercompany balances.</li>\n<li>Serve as the primary contact for internal accounting-related inquiries.</li>\n<li>Support monthly and annual closing activities, including journal entry preparation.</li>\n<li>Assist in audit processes by compiling and submitting necessary documentation.</li>\n<li>Ensure adherence to financial compliance standards and support tax-related filings.</li>\n<li>Ensure calculation and compliance of management and bookkeeping fees.</li>\n</ul>\n<p><strong>Additional Responsibilities</strong></p>\n<ul>\n<li>Assist with interviewing, hiring, training, and supervising accountants, while ensuring compliance with client policies and relevant laws.</li>\n</ul>\n<p><strong>Qualifications and Skills</strong></p>\n<ul>\n<li>Bachelor’s degree in accounting domain is necessary. CA, CPA, CMA, ACCA or similar professional qualification.</li>\n<li>Candidates should ideally showcase experience/knowledge with the U.S. GAAP (General accounting and taxation).</li>\n<li>1-4 years of progressive accounting experience is preferred (experience in real estate, hospitality or food &amp; beverage clients will be helpful but not mandatory).</li>\n<li>Exceptional analytical skills and detail orientation along with excellent written and verbal communication skills to interact with internal associates and external partners.</li>\n<li>Ability to apply advanced problem-solving skills to resolve complex issues and the capability to work with time-bound environments.</li>\n<li>Advanced skills in Microsoft Excel and general ledger applications. Yardi or Oracle NetSuite experience might be helpful but not mandate; if yes, please state in application.</li>\n<li>An ideal candidate should be a team leader and a team player at the same time.</li>\n</ul>\n<p>Apply via redux.zohorecruit.in</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at india.hr@redux.co</p>",
        "tags": [
            "1-4 Years",
            "US GAAP",
            "Financial Statements",
            "General Ledger"
        ],
        "summary": "Seeking an Accounting Associate/Sr. Accounting Associate to prepare financial statements and oversee accounting processes. The role involves managing site managers and ensuring financial compliance."
    },
    {
        "job_title": "Head – Academic Counsellor",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/19563/95",
        "location": "Infopark",
        "closing_date": "30 Aug 2025",
        "job_description": "<h2>Head – Academic Counsellor</h2>\n<ul>\n<li>Supervise academic counselling operations and mentor junior counsellors.</li>\n<li>Guide students on program selection, academic planning, and performance improvement.</li>\n<li>Address student queries and provide individualized academic support.</li>\n<li>Coordinate with academic and administrative departments for student services.</li>\n<li>Maintain and update accurate counselling and student progress records.</li>\n<li>Monitor team performance and ensure monthly/quarterly enrolment targets are met.</li>\n<li>Prepare reports for internal audits and ensure regulatory compliance.</li>\n<li>Support academic events, orientation programs, and institutional initiatives.</li>\n<li>Represent the company in university events and meetings.</li>\n</ul>\n<p><strong>Skills and Qualifications:</strong></p>\n<ul>\n<li>Strong verbal and written communication skills.</li>\n<li>Leadership and team management abilities.</li>\n<li>Proficiency in MS Office, particularly Excel and reporting tools.</li>\n<li>Ability to meet targets.</li>\n<li>Detail-oriented with strong organizational and problem-solving skills.</li>\n<li>Familiarity with student counselling processes and university systems.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com</p>",
        "tags": [
            "3+ Years",
            "Academic Counselling",
            "MS Office",
            "Team Management"
        ],
        "summary": "Seeking a Head Academic Counsellor to guide students, supervise operations, and meet targets. Requires leadership, communication skills, and familiarity with university systems."
    },
    {
        "job_title": "Junior Academic Counsellor",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/19561/95",
        "location": "Infopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Junior Academic Counsellor</h2>\n<p>We are seeking a motivated Academic Counsellor to assist in student admissions and academic guidance. The role involves interacting with prospective students, explaining program offerings, and supporting the admissions process in a target-driven, professional environment.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Counsel students on available academic programs and admission procedures</li>\n<li>Handle inquiries through phone, email, and walk-ins</li>\n<li>Identify and follow up with leads to achieve admission targets</li>\n<li>Maintain and update student databases and records</li>\n<li>Provide timely and accurate information to students and parents</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Excellent communication and interpersonal skills</li>\n<li>Basic knowledge of MS Office (Excel, Word, Outlook)</li>\n<li>Ability to work under pressure and meet targets</li>\n<li>Organized, detail-oriented, and professional in approach</li>\n<li>Prior experience in counselling or customer support preferred</li>\n</ul>\n<p>Click here to Apply</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@aabasoft.com</p>",
        "tags": [
            "1+ Years",
            "Communication Skills",
            "MS Office",
            "Customer Support"
        ],
        "summary": "Seeking a Junior Academic Counsellor to guide students through admissions and academic programs. This role involves achieving admission targets with excellent communication and organizational skills."
    },
    {
        "job_title": "DevOps Engineer",
        "company": "Urolime Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/19565/118",
        "location": "Infopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>DevOps Engineer</h2>\n<p>We are looking for a DevOps Engineer with a minimum of 3-4 years of experience in DevOps and Open Source culture (CI/CD).</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop, build, and maintain continuous integration/deployment pipelines.</li>\n<li>Work with Dockerization and Kubernetes.</li>\n<li>Perform Linux Administration.</li>\n<li>Handle Microservice-based application deployments.</li>\n<li>Implement IaC (Infrastructure as a Code) using Terraform or Ansible, Cloud Formation, etc.</li>\n<li>Work with AWS, Azure, or GCP services (including experience on EKS/AKS/GKE).</li>\n<li>Design and implement highly available &amp; scalable architectures.</li>\n<li>Use Git Workflow.</li>\n<li>Implement logging, monitoring, and tracing with Elasticsearch/Kibana (ELK), Prometheus/Grafana, Cloud Managed services, etc.</li>\n<li>Work with DB technologies such as MySQL, MongoDB, DynamoDB, PostgreSQL, etc.</li>\n<li>Scripting with Bash/Python/Go, etc.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Minimum 3-4 years experience working in DevOps and Open Source culture (CI/CD)</li>\n<li>Minimum 2-3 years of experience in Dockerization and Kubernetes</li>\n<li>Good experience in Linux Administration</li>\n<li>Good experience in Microservice-based application deployments</li>\n<li>Good experience in IaC (Infrastructure as a Code) using Terraform or Ansible, Cloud Formation, etc.</li>\n<li>Expert level of experience in either AWS, Azure, or GCP services(including experience on EKS/AKS/GKE)</li>\n<li>Strong knowledge in highly available &amp; scalable architecture design and implementation</li>\n<li>Good experience in Git Workflow</li>\n<li>Experience in logging, monitoring, tracing with Elasticsearch/Kibana (ELK), Prometheus/Grafana, Cloud Managed services, etc.</li>\n<li>Good understanding of the DB technologies such as MySQL, MongoDB, DynamoDB, PostgreSQL, etc.</li>\n<li>Good experience in Bash/Python/Go etc.</li>\n<li>Quick learner of new technologies</li>\n<li>Good communication skills</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@urolime.com</p>",
        "tags": [
            "3-4 Years",
            "Kubernetes",
            "AWS/Azure/GCP",
            "CI/CD"
        ],
        "summary": "Seeking a DevOps Engineer to develop and maintain CI/CD pipelines. The role involves cloud services, infrastructure as code, and microservice deployments."
    },
    {
        "job_title": "Project Manager - DevOps",
        "company": "Urolime Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/19566/118",
        "location": "Infopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Project Manager - DevOps</h2>\n<p>We are seeking an experienced Project Manager - DevOps to lead and deliver complex projects within our DevOps ecosystem. The ideal candidate will bring a deep understanding of CI/CD pipelines, Dockerization, Kubernetes, and cloud-native architectures. You will collaborate with cross-functional teams to ensure smooth project execution while fostering a DevOps culture that promotes automation, scalability, and operational excellence.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>DevOps Expertise:</strong></p>\n<ul>\n<li>Develop, build, and maintain continuous integration/deployment (CI/CD) pipelines.</li>\n<li>Lead Dockerized and Kubernetes-based deployments with a focus on microservices architecture.</li>\n<li>Implement and manage infrastructure as code (IaC) using tools like Terraform, Ansible, or CloudFormation.</li>\n<li>Architect and maintain highly available and scalable solutions across cloud platforms such as AWS, Azure, or GCP (including EKS/AKS/GKE).</li>\n</ul>\n<p><strong>System Administration and Monitoring:</strong></p>\n<ul>\n<li>Manage Linux-based environments and ensure seamless operation.</li>\n<li>Set up and maintain logging, monitoring, and tracing systems using ELK Stack, Prometheus/Grafana, or cloud-native monitoring services.</li>\n<li>Optimize database solutions using MySQL, MongoDB, DynamoDB, PostgreSQL, or similar technologies.</li>\n</ul>\n<p><strong>Project Management:</strong></p>\n<ul>\n<li>Coordinate internal resources and third-party vendors to deliver projects on time and within scope.</li>\n<li>Define clear project scopes and objectives, involving all relevant stakeholders.</li>\n<li>Develop detailed project plans, track progress, and manage changes in scope, schedule, and costs.</li>\n<li>Track project performance to analyze the achievement of short and long-term goals.</li>\n</ul>\n<p><strong>Collaboration and Communication:</strong></p>\n<ul>\n<li>Ensure alignment among technical and business teams for successful delivery.</li>\n<li>Communicate project status, risks, and resolutions effectively to stakeholders.</li>\n<li>Foster a culture of learning, adaptability, and continuous improvement.</li>\n</ul>\n<p><strong>Qualifications and Skills</strong></p>\n<p><strong>Required:</strong></p>\n<ul>\n<li>5-7 years of experience in DevOps and Open Source culture with a strong focus on CI/CD.</li>\n<li>At least 3 years of hands-on experience with Dockerization and Kubernetes.</li>\n<li>Proficiency in Linux Administration and microservice-based application deployments.</li>\n<li>Expert knowledge of IaC tools like Terraform, Ansible, or CloudFormation.</li>\n<li>Advanced experience with cloud platforms (AWS, Azure, GCP) and their orchestration services (EKS, AKS, GKE).</li>\n<li>Strong knowledge of Git workflows and version control systems.</li>\n<li>Familiarity with logging, monitoring, and tracing tools like ELK, Prometheus, and Grafana.</li>\n<li>Hands-on experience with scripting languages such as Bash, Python, or Go.</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul>\n<li>Strong understanding of database technologies such as MySQL, MongoDB, DynamoDB, and PostgreSQL.</li>\n<li>Quick learner with the ability to adapt to new technologies rapidly.</li>\n<li>Excellent verbal and written communication skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@urolime.com</p>",
        "tags": [
            "5-7 Years",
            "DevOps",
            "Kubernetes",
            "CI/CD"
        ],
        "summary": "Seeking a DevOps Project Manager to lead complex projects, leveraging CI/CD, Kubernetes, and cloud-native architectures. The role requires strong project management, communication, and DevOps expertise."
    },
    {
        "job_title": "Apprentice – Digital Marketing",
        "company": "Urolime Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/19567/118",
        "location": "Infopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Apprentice – Digital Marketing</h2>\n<p>We are looking for smart and enthusiastic candidates eager to kickstart their career in Digital Marketing.</p>\n<p><strong>Apprenticeship Details:</strong></p>\n<ul>\n<li><strong>Duration:</strong> 1 Year (Under the National Apprentice Training Scheme)</li>\n<li><strong>Location:</strong> Infopark, Cochin</li>\n</ul>\n<p><strong>Eligibility Criteria:</strong></p>\n<ol>\n<li>Any graduate</li>\n<li>Freshers from 2023, 2024 &amp; 2025 batches</li>\n<li>Excellent communication skills in English</li>\n<li>Basic knowledge of SEO and digital marketing tools/concepts</li>\n</ol>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@urolime.com</p>",
        "tags": [
            "0 Years",
            "Digital Marketing",
            "SEO",
            "Communication Skills"
        ],
        "summary": "Entry-level digital marketing apprentice position available in Cochin. This one-year apprenticeship seeks recent graduates with basic SEO knowledge and strong communication skills."
    },
    {
        "job_title": "Apprentice-Sales and Marketing",
        "company": "Urolime Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/19568/118",
        "location": "Infopark",
        "closing_date": "31 Aug 2025",
        "job_description": "<h2>Apprentice - Sales and Marketing</h2>\n<p>We are seeking smart and enthusiastic candidates who are looking to start a career in IT sales and Marketing.</p>\n<p><strong>Apprenticeship Duration:</strong> 1 Year</p>\n<p><strong>Eligibility Criteria:</strong></p>\n<ul>\n<li>Graduate in Business Administration or equivalent.</li>\n<li>Fresher graduated in 2023, 2024 &amp; 2025.</li>\n<li>Excellent communication skills in English.</li>\n<li>Smart, enthusiastic, and eager to learn.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@urolime.com</p>",
        "tags": [
            "0 Years",
            "Sales",
            "Marketing",
            "Communication Skills"
        ],
        "summary": "Entry-level apprenticeship in IT sales and marketing. Seeking enthusiastic graduates with excellent communication skills to contribute to a dynamic team."
    },
    {
        "job_title": "Business Central Developer (Experienced)",
        "company": "Array Platforms Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19572/394",
        "location": "Infopark",
        "closing_date": "05 Sep 2025",
        "job_description": "<h2>Business Central Developer (Experienced)</h2>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and develop solutions using Dynamics 365 Business Central (AL, C/AL)</li>\n<li>Handle integrations and API development</li>\n<li>Collaborate with cross-functional teams</li>\n<li>Provide post-deployment support</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Strong experience in Dynamics NAV/Business Central</li>\n<li>Knowledge of AL/ C/AL, web services, and API integration</li>\n<li>Good communication and troubleshooting ability</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at neha.r@array.team</p>",
        "tags": [
            "2+ Years",
            "Business Central",
            "AL/C/AL",
            "API Integration"
        ],
        "summary": "We are seeking an experienced Business Central Developer. Key responsibilities include designing solutions, handling integrations, and providing support using Dynamics 365 Business Central."
    },
    {
        "job_title": "Software Test Analyst",
        "company": "JK Lucent Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/19551/415",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Software Test Analyst</h2>\n<p><strong>Location:</strong> Infopark, Koratty, Kerala\n<strong>Employment Type:</strong> Full-Time (Onsite)\n<strong>Experience:</strong> 3–7 Years</p>\n<h3>About Us</h3>\n<p>JK Lucent is a growing IT services provider headquartered in Melbourne, Australia, with an operations center at Infopark, Koratty, Kerala. We deliver high-quality, scalable, and cost-effective technology solutions including Software Development, Software Testing, Game Development, RPA, Data Analytics, and AI-based services. Our global client base and quality-focused approach make us a trusted partner for digital transformation initiatives.</p>\n<h3>About the Role</h3>\n<p>We are seeking a proactive and detail-oriented Software Test Analyst to join our Quality Assurance team onsite at Infopark, Koratty. In this role, you will be responsible for ensuring the quality and reliability of software applications through structured testing methodologies. This includes creating and executing test plans, identifying defects, and working closely with cross-functional teams to ensure smooth delivery of software projects. You will contribute to both manual and API testing efforts while supporting continuous improvement of QA practices. This role is ideal for professionals who enjoy a structured testing environment and are passionate about delivering quality outcomes.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop comprehensive test strategies, plans, and cases based on business and functional requirements</li>\n<li>Execute System Integration Testing (SIT), API Testing, and UI testing</li>\n<li>Perform manual testing across web and mobile applications to identify and document defects</li>\n<li>Conduct cross-browser and cross-device testing using tools such as BrowserStack</li>\n<li>Test and validate RESTful APIs using tools like Postman</li>\n<li>Manage and track test execution using TestRail, JIRA, and Confluence</li>\n<li>Write and run SQL queries to validate backend data and perform data integrity checks</li>\n<li>Raise clear and detailed bug reports and follow through to closure</li>\n<li>Collaborate with developers, business analysts, and project managers to clarify requirements and deliverables</li>\n<li>Participate in Agile ceremonies including sprint planning, stand-ups, and retrospectives</li>\n<li>Ensure all test documentation is maintained and updated for audit and traceability purposes</li>\n<li>Identify opportunities to improve test processes and contribute to test automation readiness</li>\n</ul>\n<h3>Skills and Experience Required</h3>\n<ul>\n<li>3–7 years of hands-on experience in a Software Test Analyst or equivalent QA role</li>\n<li>Strong experience in JIRA, Confluence, TestRail, Postman, BrowserStack, and SQL</li>\n<li>Solid understanding of testing methodologies including SIT, API Testing, and test case design</li>\n<li>Proven ability to write clear and detailed test plans, test cases, and defect reports</li>\n<li>ISTQB Foundation Level Certification (or higher) is mandatory</li>\n<li>Excellent written and verbal communication skills in English</li>\n<li>Experience working in Agile/Scrum environments</li>\n<li>Ability to work independently and manage multiple priorities in a fast-paced environment</li>\n<li>High attention to detail and a commitment to quality</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@jklucent.com.au</p>",
        "tags": [
            "3-7 Years",
            "JIRA",
            "SQL",
            "API Testing"
        ],
        "summary": "JK Lucent is seeking a Software Test Analyst to ensure software quality through structured testing. Responsibilities include test planning, execution, defect reporting, and collaboration within Agile teams."
    },
    {
        "job_title": "React Native Developer – Fresher",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/21767",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>React Native Developer – Fresher</h2>\n<p><strong>Spericorn Technology (P) Ltd</strong>\nAmstor Building,\nTechnopark Phase I,\nTrivandrum , 695581\n<a href=\"http://www.spericorn.com\">http://www.spericorn.com</a></p>\n<p><strong>Contact Email:</strong> careers@spericorn.com</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 12, July 2025</p>\n<h3>Description</h3>\n<p>We are looking for enthusiastic and passionate React Native Freshers who are eager to kick-start their careers in mobile app development. If you are a recent graduate with hands-on experience through internships or academic projects using React Native, we want to hear from you!</p>\n<p>This is a fantastic opportunity to learn from experienced developers, contribute to real-world projects, and grow in a dynamic, tech-driven environment.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Basic understanding of JavaScript/TypeScript and core mobile development concepts</li>\n<li>Familiarity with mobile UI/UX design patterns and responsive design principles and API integrations.</li>\n<li>Understanding of component-based architecture in React Native</li>\n<li>Experience with React Native core components: View, Text, FlatList, ScrollView, etc.</li>\n<li>Knowledge of basic state management using useState, useEffect, or tools like React Context and Redux</li>\n<li>Exposure to RESTful APIs, AsyncStorage, and mobile app debugging tools</li>\n<li>Familiarity with tools like VS Code, Xcode, IntelliJ, React Native Debugger, Flipper, or Chrome DevTools</li>\n<li>Basic understanding of the Android &amp; iOS ecosystems, including app configuration and build processes</li>\n</ul>\n<h3>Bonus Skills (Good to Have):</h3>\n<ul>\n<li>Exposure to other mobile or cross-platform frameworks like Flutter, or native development in Swift / Kotlin</li>\n</ul>\n<h3>What You’ll Do</h3>\n<ul>\n<li>Work closely with senior developers to build, enhance, and maintain cross-platform mobile apps</li>\n<li>Assist in testing, debugging, and deploying new features and updates</li>\n<li>Participate in code reviews, daily stand-ups, and knowledge-sharing sessions</li>\n<li>Collaborate with design, QA, and backend teams to deliver seamless user experiences</li>\n<li>Write clean, maintainable, and well-documented code</li>\n<li>Continuously learn and adapt to new tools, technologies, and best practices in mobile development</li>\n</ul>",
        "tags": [
            "Fresher",
            "React Native",
            "JavaScript/TypeScript",
            "RESTful APIs"
        ],
        "summary": "Spericorn Technology is seeking an enthusiastic React Native fresher to build cross-platform mobile apps. This role involves collaboration, learning, and contributing to real-world projects."
    },
    {
        "job_title": "BUSINESS ANALYST",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/21766",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Business Analyst</h2>\n<p>Spericorn Technology is looking for a Business Analyst to join our team! We are a global software development firm aiming to impact the world through technology positively. We value teamwork and are looking for candidates who can sustain our organization's quality, commitment, and integrity. </p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Conduct requirement gathering sessions with clients and stakeholders via calls and meetings.</li>\n<li>Translate business needs into clear, concise, and detailed functional and non-functional requirements.</li>\n<li>Prepare documentation including but not limited to BRD, FRD, SRS etc</li>\n<li>Use case diagrams, flowcharts, and wireframes (if applicable)</li>\n<li>Act as the liaison between the client and the technical team, ensuring clarity and consistency.</li>\n<li>Participate in daily stand-ups, sprint planning, and project status meetings.</li>\n<li>Assist in backlog grooming and creation of user stories in Agile environments.</li>\n<li>Work closely with QA to define acceptance criteria and validate test cases against requirements.</li>\n<li>Ensure timely and accurate communication with internal teams and external stakeholders.</li>\n<li>Manage requirement changes using structured change control processes.</li>\n<li>Contribute to product vision, roadmap discussions, and process improvements.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>3+ years of experience</strong> as a Business Analyst in an IT or software development environment.</li>\n<li>Basic understanding of software development lifecycle (SDLC), especially Agile/Scrum methodologies.</li>\n<li>Familiarity with technical terminologies like APIs, databases, web services, UI/UX concepts, etc.</li>\n<li>Experience preparing comprehensive documentation (BRD, FRD, SRS).</li>\n<li>Proficient in tools like MS Office, Jira, Confluence, Figma/Balsamiq (or equivalent).</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong analytical thinking, attention to detail, and problem-solving capabilities.</li>\n<li>Experience in working with cross-functional teams and multiple stakeholders.</li>\n<li>Ability to manage multiple priorities in a fast-paced environment.</li>\n</ul>\n<p><strong>Other Information Requested:</strong></p>\n<ul>\n<li>Notice period</li>\n<li>CTC</li>\n<li>Expected CTC</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@spericorn.com</p>\n<p><strong>Note:</strong> Kindly mention in the email subject \"Application for the post of Business Analyst.\"</p>\n<p><strong>Closing Date:</strong> 31, July 2025\n<strong>Job Published:</strong> 12, July 2025</p>",
        "tags": [
            "3+ Years",
            "Agile/Scrum",
            "Jira",
            "Confluence"
        ],
        "summary": "Spericorn Technology is seeking a Business Analyst to translate business needs into detailed requirements. The role involves documentation, stakeholder communication, and contributing to product vision in Agile environments."
    },
    {
        "job_title": "Senior Software Architect",
        "company": "Spericorn Technology (P) Ltd",
        "url": "https://technopark.org/job-details/21765",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Senior Software Architect</h2>\n<p>Spericorn Technology is seeking a seasoned Senior Software Architect to lead and shape the technical direction of complex, scalable, and secure systems.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead architectural strategy, design, and implementation for enterprise-grade applications.</li>\n<li>Collaborate with product, DevOps, and engineering teams to translate business requirements into scalable, secure, and resilient architectures.</li>\n<li>Own the architecture lifecycle, including blueprinting, documentation, system evaluation, and refactoring.</li>\n<li>Conduct architecture reviews and ensure adherence to best practices, coding standards, and security guidelines.</li>\n<li>Evaluate and recommend tools, technologies, and frameworks aligned with architectural vision.</li>\n<li>Enable DevOps automation, CI/CD pipelines, infrastructure as code, and observability standards.</li>\n<li>Provide mentorship and technical leadership to engineering teams across domains.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>7+ years of experience in software development, with at least 3 years in a lead or architect role.</li>\n<li>Proven experience designing distributed systems, large-scale APIs, and microservices-based applications.</li>\n<li>Strong background in event-driven architecture, asynchronous processing, and domain-driven design (DDD).</li>\n<li>Experience with REST, GraphQL, and API-first design principles.</li>\n<li>Hands-on knowledge of AWS (preferred), Azure, or GCP, with practical experience in services like Lambda, ECS/EKS, S3, API Gateway, DynamoDB, SQS, etc.</li>\n<li>Proficiency in Docker, Kubernetes, Helm, and containerized deployments.</li>\n<li>Familiarity with Infrastructure as Code tools like Terraform or AWS CloudFormation.</li>\n<li>Experience building high-security systems following standards like OWASP, PCI-DSS, and GDPR.</li>\n<li>Deep knowledge of authentication, authorization protocols (OAuth2, OIDC, SAML, JWT), and IAM integration.</li>\n<li>Experience designing high-performance systems with caching (Redis, Memcached), CDN strategies, and request optimization.</li>\n<li>Strong data modeling experience with RDBMS (PostgreSQL, MySQL) and NoSQL databases (MongoDB, Cassandra).</li>\n<li>Exposure to messaging and streaming systems such as Kafka, RabbitMQ, or Amazon EventBridge.</li>\n<li>Experience with software development using one or more of the following: Java, Python, Node.js, TypeScript, .NET, or Go.</li>\n<li>Familiarity with CI/CD tools (GitHub Actions, Jenkins, GitLab CI) and version control systems like Git.</li>\n<li>Understanding of observability, monitoring, and logging using tools like Prometheus, Grafana, ELK Stack, or Datadog.</li>\n<li>Experience in architecting digital platforms in the banking, fintech, or e-commerce domains.</li>\n<li>Exposure to Blockchain technologies, smart contracts, and decentralized systems.</li>\n<li>Strong analytical, communication, and documentation skills with a leadership mindset.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Leadership role in architecting business-critical digital platforms.</li>\n<li>Exposure to cutting-edge technologies and innovation-driven teams.</li>\n<li>Competitive compensation and benefits package.</li>\n<li>Opportunities for continuous learning and certifications.</li>\n<li>A dynamic and flexible work environment.</li>\n</ul>\n<p><strong>Other Info Requested:</strong> Notice period, CTC, and Expected CTC.</p>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Email: careers@spericorn.com</li>\n<li>Website: http://www.spericorn.com</li>\n</ul>\n<p><strong>Note:</strong> Kindly mention in the email subject \"Application for the post of Senior Software Architect.\"</p>\n<p>Closing Date: 31, July 2025\nJob Published: 12, July 2025</p>",
        "tags": [
            "7+ Years",
            "AWS",
            "Microservices",
            "Docker"
        ],
        "summary": "Spericorn Technology is hiring a Senior Software Architect to lead technical direction for scalable systems. The role involves architectural strategy, design, and implementation for enterprise-grade applications."
    },
    {
        "job_title": "Tele caller",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/21764",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Upcommune Business Network - Telecaller Walk-In</h2>\n<p><strong>Walk-In Date:</strong> 14th July 2025 - 16th July 2025\n<strong>Time:</strong> 11:01:00 - 15:00:00\n<strong>Location:</strong> UpCommune Business Network Pvt Ltd, Forth Floor, Gayatri Building, Technopark, Thiruvananthapuram, 695581</p>\n<p><strong>Contact Email:</strong> mail@upcommune.net\n<strong>Contact for Gate Pass:</strong> +91 9074882688</p>\n<p><strong>Brief Description:</strong>\n- Make outbound calls to customers.\n- Promote products and services using a prepared script.\n- Answer customer inquiries and address concerns.\n- Achieve sales targets and report on call activities.\n- Maintain accurate records of customer interactions.\n- <em>Only for Female candidates.</em></p>\n<p><strong>Preferred Skills:</strong>\n- Plus two or equivalent.\n- Excellent verbal communication skills.\n- Strong customer service and sales skills.\n- Ability to handle rejection and stay positive.\n- Experience in telecalling or sales is a plus.</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are required to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\n<a href=\"Click here to download the Mobile App for Android\">Click here to download the Mobile App for Android</a>\n<a href=\"Click here to download the Mobile App for iOS\">Click here to download the Mobile App for iOS</a></p>\n<p><strong>Website URL:</strong>\n<a href=\"vms.technopark.org\">vms.technopark.org</a>\n<a href=\"vms.technopark.org\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Company Address:</strong>\nUpcommune Business Network (P) Ltd\nSBC 22, -2 , Thejaswini Building, Technopark, Thiruvananthapuram , 695581\n<a href=\"https://www.upcommune.net\">https://www.upcommune.net</a></p>",
        "tags": [
            "Entry Level",
            "Telecalling",
            "Customer Service",
            "Sales"
        ],
        "summary": "Upcommune Business Network is hiring female Telecallers for a walk-in interview. The role involves outbound calls, promoting products, and achieving sales targets."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Upcommune Business Network (P) Ltd",
        "url": "https://technopark.org/job-details/21763",
        "location": "Technopark",
        "closing_date": "16 Jul 2025",
        "job_description": "<h2>Business Development Executive - Walk-In Interview</h2>\n<p><strong>Upcommune Business Network (P) Ltd</strong> is seeking a talented Business Development Executive to join our dynamic Sales and Marketing team.</p>\n<p><strong>Walk-In Details:</strong>\n- <strong>Dates:</strong> July 14, 2025 - July 16, 2025\n- <strong>Time:</strong> 11:00 AM to 3:01 PM\n- <strong>Contact Email:</strong> mail@upcommune.net\n- <strong>Phone:</strong> +91 9074882688</p>\n<p><strong>Brief Description:</strong>\nThe ideal candidate should possess a robust background in sales, conversion, and digital marketing strategies. This role is pivotal in identifying new business opportunities, converting leads into clients, and devising effective marketing strategies to foster business growth.</p>\n<p><strong>Responsibilities:</strong>\n- Identify and pursue new business opportunities through networking, cold calling, and other lead generation techniques.\n- Develop and maintain strong relationships with prospective clients and key stakeholders.\n- Collaborate with the marketing team to create compelling campaigns that align with client needs and drive revenue.\n- Analyze market trends and competitor activities to ensure the company remains competitive in the marketplace.\n- Prepare and deliver pitches and presentations to potential clients, showcasing the company's products/services and value proposition.</p>\n<p><strong>Preferred Skills:</strong>\n- Proven experience in sales and business development, preferably in a related industry.\n- Ability to work independently and as part of a team, with a proactive approach to problem-solving.\n- Degree/ Diploma, Marketing, or a related field is preferred.</p>\n<p><strong>Benefits:</strong>\n- Opportunity to work in a dynamic and innovative environment.\n- Competitive salary and performance-based incentives.\n- Career growth opportunities within the company.</p>\n<p><strong>How to Apply:</strong>\nPlease send your resume and a cover letter detailing your relevant experience to Mail@upcommune.net.</p>\n<p><strong>Walk-In Venue:</strong>\nUpcommune Business Network Pvt Ltd\nForth Floor\nGayatri Building\nTechnopark - 695582\nTVM</p>\n<p><strong>Walk-In Entry Pass:</strong>\nCandidates are requested to apply for the entry Pass to Technopark Campus to attend the Walk-In interview through mobile app/ web browser. Once the pass is applied, the entry pass will be sent to their registered mobile number/ e-mail id. The softcopy of the entry pass can be shown on their gadgets at Technopark Entrance Gate to enter into the Campus.</p>\n<p>Candidates who do not have a smartphone can print their hardcopy of the entry pass on the scheduled date of the interview from the self-operating Kiosks placed at the Reception Building near TECHNOPARK Main Gate by using the 5 digit OTP (One Time Password) received as SMS/ e-mail.</p>\n<p><strong>Mobile App:</strong>\n- <a href=\"https://www.example.com\">Click here to download the Mobile App for Android</a>\n- <a href=\"https://www.example.com\">Click here to download the Mobile App for iOS</a></p>\n<p><strong>Website URL:</strong>\n- <a href=\"https://www.example.com\">vms.technopark.org</a>\n- <a href=\"https://www.example.com\">Click here for the User Manual</a></p>\n<p><strong>Note:</strong> Original certificates will be verified at the Entry Gate for the Walk-In interview entry.</p>\n<p><strong>Company Information:</strong>\nUpcommune Business Network (P) Ltd\nSBC 22, -2 , Thejaswini Building, Technopark, Thiruvananthapuram , 695581\n<a href=\"https://www.upcommune.net\">https://www.upcommune.net</a></p>",
        "tags": [
            "1+ Years",
            "Sales",
            "Business Development",
            "Digital Marketing"
        ],
        "summary": "Upcommune is hiring a Business Development Executive to identify opportunities, convert leads, and develop marketing strategies. The role requires experience in sales and a proactive approach."
    },
    {
        "job_title": "FRESHER DEVELOPER(PHP)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21762",
        "location": "Technopark",
        "closing_date": "26 Aug 2025",
        "job_description": "<h2>Fresher Developer (PHP)</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor,\nThejaswini Building and Ground Floor, Chandragiri Building\nTechnopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<p><strong>Closing Date:</strong> 26, Aug 2025\n<strong>Job Published:</strong> 12, July 2025\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are looking for a Fresher Developer to join our dynamic team. This position is perfect for a graduate who is passionate with a strong desire to learn and grow in the field.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to the continuous improvement of our codebase.</li>\n<li>Troubleshoot and debug issues as they arise.</li>\n<li>Work closely with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in programming with a strong grasp of core concepts.</li>\n<li>Problem-Solving Skills: Ability to analyse and solve programming problems.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<h3>Qualification</h3>\n<ul>\n<li>Bachelor's degree in Computer Science or related field.</li>\n<li>Experience: 0-1 years of experience</li>\n<li>Salary Package: 2.5 LPA - 4 LPA</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "PHP",
            "Problem-solving",
            "Software Development"
        ],
        "summary": "Seeking a Fresher Developer to join our dynamic team. Assist in software development, write clean code, and troubleshoot issues, with a salary of 2.5 LPA - 4 LPA."
    },
    {
        "job_title": "FRESHER DEVELOPER",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21761",
        "location": "Technopark",
        "closing_date": "26 Aug 2025",
        "job_description": "<h2>Fresher Developer</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong>\nSBC 14, -2 Floor,\nThejaswini Building and\nGround Floor, Chandragiri Building\nTechnopark Phase 1, 695581\n<a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<p><strong>Closing Date:</strong> 26, Aug 2025\n<strong>Job Published:</strong> 12, July 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<p><strong>Brief Description:</strong>\nSubject Line: FRESHER PHP DEVELOPER</p>\n<p>We are looking for a Fresher Developer to join our dynamic team. This position is perfect for a graduate who is passionate with a strong desire to learn and grow in the field.</p>\n<p><strong>Job Responsibilities:</strong></p>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to the continuous improvement of our codebase.</li>\n<li>Troubleshoot and debug issues as they arise.</li>\n<li>Work closely with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Proficiency in programming with a strong grasp of core concepts.</li>\n<li>Problem-Solving Skills: Ability to analyse and solve programming problems.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Qualification:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science or related field.</li>\n<li>Experience: 0-1 years of experience</li>\n<li>Salary Package: 2.5 LPA - 4 LPA</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Programming",
            "Problem-Solving",
            "Software Development"
        ],
        "summary": "Seeking a Fresher Developer to join a dynamic team. The role involves assisting in software development and problem-solving, offering growth in the field."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21760",
        "location": "Technopark",
        "closing_date": "14 Jul 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>Trainonex Solutions (P) Ltd</strong>\n1st Floor, M Squared Building, Annex 1, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<a href=\"www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<p><strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Closing Date:</strong> 14, July 2025\n<strong>Job Published:</strong> 12, July 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for conducting sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li>Experience: 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Have fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Communication"
        ],
        "summary": "Trainonex Solutions is hiring a Telesales Executive to drive sales and build customer relationships. Immediate joiners with strong communication skills are encouraged to apply for this office-based role."
    },
    {
        "job_title": "Senior SQA",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21759",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Senior SQA</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Senior Software Quality Assurance (SQA) professional with a proven track record in software quality assurance, process improvement, and compliance audits.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Guide and support project and support teams in adhering to organizational quality and infosec processes, policies, and best practices.</li>\n<li>Conduct periodic audits and reviews, including Internal Audits, SDLC work product reviews, and Configuration Audits to ensure compliance with defined processes.</li>\n<li>Track and follow up on non-conformities identified during audits and reviews, ensuring timely closure and corrective action.</li>\n<li>Facilitate root cause analysis for process gaps, defects, or audit findings, and collaborate with teams to identify and implement preventive and corrective measures.</li>\n<li>Collect, validate, and analyze quality and process metrics across projects and departments, and initiate process improvements.</li>\n<li>Drive quality initiatives and organization-wide process improvement programs.</li>\n<li>Assist teams in identifying, documenting, and tracking project-level risks and issues, ensuring they are reviewed and managed appropriately.</li>\n<li>Actively participate in key project meetings, including initiation, retrospectives, risk/issue reviews, and closure meetings.</li>\n<li>Support awareness and training initiatives, including sessions on quality management systems, information security, and compliance standards to build organizational capability and compliance culture.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Hands-on experience in conducting Internal Quality Audits (IQA), SDLC Work Product Reviews, and Configuration Management (CM) Audits</li>\n<li>Knowledge of Quality and Security standards such as ISO 9001, ISO 27001</li>\n<li>Skilled in quality analysis techniques like Fishbone (Ishikawa) Diagrams, and Pareto Analysis</li>\n<li>Good understanding of Agile, Waterfall, and Hybrid SDLC methodologies</li>\n<li>Proficient in collecting, validating, analyzing, and reporting quality and performance metrics</li>\n<li>Experience in conducting Root Cause Analysis (RCA) and driving Corrective and Preventive Actions (CAPA)</li>\n<li>Ability to define, standardize, and continuously improve organizational processes, templates, and guidelines</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Good Team player, Interpersonal and Problem-solving skills</li>\n<li>Attention to detail and presentation skills</li>\n<li>Working knowledge in tools - GitHub, JIRA, Redmine, Trello, Basecamp etc.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>Prefer Internal auditor certified (QMS/ISMS)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Company Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark\nKariyavattom P.O\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not ask for fees for job opportunities. Contact careers@reflectionsinfos.com for any clarifications.</p>",
        "tags": [
            "5+ Years",
            "Quality Assurance",
            "ISO 9001",
            "ISO 27001"
        ],
        "summary": "Reflections Info Systems seeks a Senior SQA to ensure adherence to quality and security standards. This role involves audits, process improvement, and collaboration across teams."
    },
    {
        "job_title": "Network Consulting Engineer – VXLAN & AI Data Center Networking",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21758",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Network Consulting Engineer – VXLAN &amp; AI Data Center Networking</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are seeking a highly skilled Network Consulting Engineer (NCE) to design and implement next-generation VXLAN EVPN-based data center networks that support hypercomputing and AI infrastructure. This role is central to enabling the high performance, low-latency environments required for multi-GPU clusters, distributed training pipelines, and scalable AI workloads.</p>\n<p>The ideal candidate will bring deep expertise in VXLAN, BGP, EVPN, RoCEv2, and fabric-based networking, along with a solid understanding of the networking demands of large-scale AI and HPC environments.</p>\n<h3>Job Description</h3>\n<p><strong>Must have:</strong></p>\n<ul>\n<li>Proven experience designing and operating VXLAN EVPN-based data center networks.</li>\n<li>Strong knowledge of Cisco ACI, Nexus 9000, or Arista EOS platforms.</li>\n<li>Expertise in data center routing and switching, including BGP, OSPF, IS-IS, multicast, and fabric path.</li>\n<li>Deep understanding of AI-specific networking needs, including RoCEv2, DCB, PFC, and RDMA optimization.</li>\n<li>Familiarity with GPU-accelerated workloads and distributed systems in AI/ML and HPC environments.</li>\n<li>Minimum Experience: 10+ years in IT, with at least 8+ years experience in VXLAN EVPN-based data center networks that support hypercomputing and AI infrastructure.</li>\n<li>CCNP or CCIE Data Center (highly preferred).</li>\n</ul>\n<p><strong>Nice to haves:</strong></p>\n<ul>\n<li>Certified Specialist – Enterprise Core or Data Center Core.</li>\n<li>Additional certifications in NVIDIA Networking (Cumulus/Spectrum) or Arista ACE are a plus.</li>\n<li>Experience with hybrid and multi-cloud networking for AI clusters is desirable.</li>\n<li>Strong analytical and problem-solving skills, with the ability to make data-driven decisions.</li>\n<li>Exceptional communication and interpersonal skills, with a proven track record of working with diverse teams.</li>\n<li>Up-to-date knowledge of industry standards, security protocols, and compliance regulations in the banking sector.</li>\n<li>Demonstrated ability to adapt to emerging trends and technologies.</li>\n</ul>\n<h3>Responsibilities include:</h3>\n<ul>\n<li>Design, deploy, and manage VXLAN EVPN-based fabric networks supporting AI and high-performance computing workloads.</li>\n<li>Build scalable spine-leaf architectures using Cisco Nexus 9000 or Arista switches, ensuring efficient Layer 2/Layer 3 segmentation and workload mobility.</li>\n<li>Optimize network performance for RoCEv2, GPUDirect, and low-latency traffic flows, ensuring maximum throughput and minimal jitter for GPU-accelerated clusters.</li>\n<li>Configure underlay and overlay protocols including BGP, OSPF, IS-IS, and troubleshoot connectivity and control-plane issues.</li>\n<li>Integrate data center fabric with virtualization platforms such as VMware NSX, KVM, and Hyper-V, as well as Kubernetes-based AI infrastructure.</li>\n<li>Collaborate with compute, storage, and DevOps teams to ensure end-to-end performance across AI training, fine-tuning, inference, and ETL pipelines.</li>\n<li>Drive network automation efforts using tools such as Python, Ansible, and Terraform, enabling Infrastructure-as-Code (IaC) for repeatable, scalable deployments.</li>\n<li>Participate in performance tuning, benchmarking, and capacity planning for evolving AI workloads and future-proof infrastructure designs.</li>\n</ul>\n<h3>Technology Optimization:</h3>\n<ul>\n<li>Evaluate and enhance existing systems, identifying opportunities for innovation and efficiency.</li>\n<li>Utilize monitoring tools like Dynatrace to ensure system reliability and proactively address potential issues.</li>\n</ul>\n<h3>Team Leadership and Mentorship:</h3>\n<ul>\n<li>Mentor and guide junior architects and developers to foster a culture of excellence.</li>\n<li>Lead cross-functional technical discussions and provide direction to teams to achieve project goals.</li>\n</ul>\n<h3>Certifications:</h3>\n<ul>\n<li>CCNP or CCIE Data Center (highly preferred)</li>\n<li>Cisco Certified Specialist – Enterprise Core or Data Center Core</li>\n<li>Additional certifications in NVIDIA Networking (Cumulus/Spectrum) or Arista ACE are a plus</li>\n<li>Experience with hybrid and multi-cloud networking for AI clusters is desirable</li>\n</ul>\n<h3>Educational Qualifications</h3>\n<p>Bachelors in Computer Science/Applications/BTech Computer Science/MCA</p>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>VXLAN EVPN Fabric Design &amp; Deployment</li>\n<li>Cisco Nexus 9000 / Cisco ACI / Arista EOS Platforms</li>\n<li>Data Center Routing &amp; Switching (BGP, OSPF, IS-IS, Multicast)</li>\n<li>RoCEv2, DCB, PFC, RDMA Optimization for AI/HPC</li>\n<li>Spine-Leaf Architecture for AI Workloads</li>\n<li>Low-Latency Networking for Multi-GPU &amp; Distributed Training Systems</li>\n<li>Network Automation – Python, Ansible, Terraform (IaC)</li>\n<li>Integration with Virtualization &amp; Container Platforms (VMware NSX, KVM, Kubernetes)</li>\n<li>Infrastructure Performance Tuning &amp; Benchmarking for AI Workloads</li>\n<li>Hybrid/Multicloud Data Center Networking (Desirable)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Cisco ACI Policy Model &amp; Multi-Site Fabric Design</li>\n<li>NVIDIA Networking (Cumulus Linux, Mellanox Spectrum Switches)</li>\n<li>Arista CloudVision &amp; Arista ACE Certifications (Optional)</li>\n<li>IP Fabric Path, Multicast, and L2/L3 Segmentation Techniques</li>\n<li>Monitoring &amp; Telemetry Tools (Cisco Nexus Insights, sFlow, NetFlow, SNMP)</li>\n<li>Performance Tuning for GPUDirect RDMA &amp; AI Training Workloads</li>\n<li>Experience with Kubernetes CNI Plugins (Calico, Cilium, Multus)</li>\n<li>Version control and CI/CD for Infra-as-Code (Git, Jenkins, GitLab CI)</li>\n<li>Knowledge of NVIDIA DGX Systems or similar AI Compute Platforms</li>\n<li>Cloud Networking – AWS VPC, Azure VNet, GCP VPC, Interconnects for Hybrid AI Cluster .</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Please note:</strong> Reflections Info Systems never seeks payment for jobs. Contact is only through official website or LinkedIn, and employment-related emails are sent through the official HR email id. Contact careers@reflectionsinfos.com for clarifications.</p>",
        "tags": [
            "8+ Years",
            "VXLAN",
            "EVPN",
            "AI"
        ],
        "summary": "Reflections Info Systems is hiring a Network Consulting Engineer to design and implement next-gen VXLAN EVPN-based data center networks for AI infrastructure. The role requires expertise in VXLAN, BGP, and AI-specific networking."
    },
    {
        "job_title": "AI Computing Infrastructure Engineer – GPU & High-Performance Computing",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21757",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>AI Computing Infrastructure Engineer – GPU &amp; High-Performance Computing</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are looking for a highly capable AI Infrastructure Engineer to design, implement, and optimize GPU-accelerated compute environments that power advanced AI and machine learning workloads. This role is critical in building and supporting scalable, high-performance infrastructure across data centers and hybrid cloud platforms, enabling training, fine-tuning, and inference of modern AI models.</p>\n<h3>Job Description</h3>\n<p><strong>Must have:</strong></p>\n<ul>\n<li>3–6 years of experience in AI/ML infrastructure engineering or high-performance computing (HPC).</li>\n<li>Solid experience with GPU-based systems, container orchestration, and AI/ML frameworks.</li>\n<li>Familiarity with distributed systems, performance tuning, and large-scale deployments.</li>\n<li>Expertise in modern GPU architectures (e.g., NVIDIA A100/H100, AMD MI300), multi-GPU configurations (NVLink, PCIe, HBM), and accelerator scheduling for AI training and inference workloads.</li>\n<li>Good understanding of modern AI model architectures, including LLMs (e.g., GPT, LLaMA), diffusion models, and multimodal encoder-decoder frameworks, with awareness of their compute and scaling requirements.</li>\n<li>Knowledge of leading AI/ML frameworks (e.g., TensorFlow, PyTorch), NVIDIA’s AI stack (CUDA, cuDNN, TensorRT), and open-source tools like Hugging Face, ONNX, and MLPerf for model development and benchmarking.</li>\n<li>Familiarity with AI pipelines for supervised/unsupervised training, fine-tuning (PEFT/LoRA/QLoRA), and batch or real-time inference, with expertise in distributed training, checkpointing, gradient strategies, and mixed precision optimization</li>\n</ul>\n<p><strong>Responsibilities include:</strong></p>\n<ul>\n<li>AI Infrastructure Design &amp; Deployment with multi-GPU clusters using NVIDIA or AMD platforms.</li>\n<li>Configure GPU environments using CUDA, DGX Systems, and NVIDIA Kubernetes Device Plugin.</li>\n<li>Deploy and manage containerized environments with Docker, Kubernetes, and Slurm.</li>\n<li>AI Model Support &amp; Optimization for training, fine-tuning, and inference pipelines for LLMs and deep learning models.</li>\n<li>Enable distributed training using DDP, FSDP, and ZeRO, with support for mixed precision.</li>\n<li>Tune infrastructure to optimize model performance, throughput, and GPU utilization.</li>\n<li>Design and operate high-bandwidth, low-latency networks using InfiniBand and RoCE v2.</li>\n<li>Integrate GPUDirect Storage and optimize data flow across Lustre, BeeGFS, and Ceph/S3.</li>\n<li>Support fast data ingestion, ETL pipelines, and large-scale data staging.</li>\n<li>Leverage NVIDIA’s AI stack including cuDNN, NCCL, TensorRT, and Triton Inference Server.</li>\n<li>Conduct performance benchmarking with MLPerf and custom test suites</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>NVIDIA Certified Professional – Data Center AI</li>\n<li>Kubernetes Administrator (CKA)</li>\n<li>CCNP or CCIE Data Center</li>\n<li>Cloud Certification (AWS, Azure, or GCP)</li>\n</ul>\n<p><strong>Educational Qualifications</strong></p>\n<ul>\n<li>Bachelors in Computer Science/Applications/BTech Computer Science/MCA</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>GPU Infrastructure Design &amp; Optimization (NVIDIA A100/H100, AMD MI300)</li>\n<li>CUDA Programming &amp; NVIDIA DGX Systems Setup</li>\n<li>Containerization with Docker, Kubernetes, and NVIDIA Device Plugin</li>\n<li>Distributed AI Training (DDP, FSDP, ZeRO, Mixed Precision)</li>\n<li>PyTorch, TensorFlow, and Model Optimization using TensorRT</li>\n<li>High-Performance Networking (InfiniBand, RoCEv2, GPUDirect Storage)</li>\n<li>AI Model Deployment using Triton Inference Server</li>\n<li>Data Management for AI Pipelines (Lustre, BeeGFS, Ceph, S3)</li>\n<li>Infrastructure Performance Benchmarking (MLPerf, NCCL Tests)</li>\n<li>Experience with LLMs and AI Model Scaling Requirements</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Slurm Workload Manager for Scheduling AI Jobs</li>\n<li>PEFT/LoRA/QLoRA-based Fine-tuning Strategies</li>\n<li>Open-Source AI Tools – Hugging Face, ONNX, FastAPI for Model Serving</li>\n<li>Integration with ETL/Data Ingestion Pipelines (Kafka, Spark, Airflow)</li>\n<li>GPU Memory Optimization – HBM Utilization, GPU Resource Scheduling</li>\n<li>AI Pipeline Automation using Python, Bash, or Terraform</li>\n<li>Basic Cloud Infrastructure Knowledge (AWS EC2 GPU Instances, Azure ML, GCP Vertex AI)</li>\n<li>Monitoring &amp; Logging (Prometheus, Grafana, NVIDIA DCGM, ELK Stack)</li>\n<li>Hybrid Cloud Setup for AI Workloads</li>\n<li>CI/CD Pipelines for ML Ops (GitHub Actions, MLflow, Kubeflow Pipelines)</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong> Reflections Info Systems does not charge any fee for jobs. Be cautious of fraudulent job offers. Contact careers@reflectionsinfos.com for any clarification/alerts.</p>",
        "tags": [
            "3-6 Years",
            "GPU",
            "Kubernetes",
            "PyTorch"
        ],
        "summary": "Seeking an AI Infrastructure Engineer to build and optimize GPU-accelerated environments for AI/ML workloads. The role involves supporting scalable infrastructure, model training, and performance tuning."
    },
    {
        "job_title": "Kubernetes Orchestration Engineer – GPU Hypercomputing & AI Workloads",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21756",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Kubernetes Orchestration Engineer – GPU Hypercomputing &amp; AI Workloads</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly skilled Kubernetes Orchestration Engineer to lead the deployment and management of GPU-optimized Kubernetes environments that power AI/ML and hypercomputing workloads. This role is critical to ensuring scalable, reliable, and high-performance infrastructure across on-premises and hybrid cloud environments. As a core member of our infrastructure engineering team, you will work at the intersection of container orchestration, GPU resource management, and AI application scaling, enabling large scale distributed training and inference across GPU clusters.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>AI Infrastructure Design &amp; Deployment with multi-GPU clusters using NVIDIA or AMD platforms.</li>\n<li>Configure GPU environments using CUDA, DGX Systems, and NVIDIA Kubernetes Device Plugin.</li>\n<li>Deploy and manage containerized environments with Docker, Kubernetes, and Slurm.</li>\n<li>AI Model Support &amp; Optimization for training, fine-tuning, and inference pipelines for LLMs and deep learning models.</li>\n<li>Enable distributed training using DDP, FSDP, and ZeRO, with support for mixed precision.</li>\n<li>Tune infrastructure to optimize model performance, throughput, and GPU utilization.</li>\n<li>Design and operate high-bandwidth, low-latency networks using InfiniBand and RoCE v2.</li>\n<li>Integrate GPUDirect Storage and optimize data flow across Lustre, BeeGFS, and Ceph/S3.</li>\n<li>Support fast data ingestion, ETL pipelines, and large-scale data staging.</li>\n<li>Leverage NVIDIA’s AI stack including cuDNN, NCCL, TensorRT, and Triton Inference Server.</li>\n<li>Conduct performance benchmarking with MLPerf and custom test suites.</li>\n</ul>\n<p><strong>Must Have:</strong></p>\n<ul>\n<li>Strong experience with Kubernetes (K8s) and container orchestration in production environments.</li>\n<li>Expertise in managing GPU workloads in Kubernetes using NVIDIA GPU Operator, vGPU, and device plugin configurations.</li>\n<li>Proficiency with container runtimes such as Docker and CRI-O, and orchestration tools like Helm and Kubernetes Operators.</li>\n<li>Solid understanding of networking within Kubernetes and service mesh integration (e.g., Istio, Linkerd).</li>\n<li>Familiarity with hybrid/multi-cloud Kubernetes platforms (e.g., GKE, EKS, AKS).</li>\n<li>Strong scripting and automation skills (e.g., YAML, Helm templating, Bash, Python).</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>Certified Kubernetes Administrator (CKA) –Must</li>\n<li>Certified Kubernetes Application Developer (CKAD)</li>\n<li>NVIDIA Certified Kubernetes Specialist</li>\n</ul>\n<p><strong>Educational Qualifications:</strong></p>\n<ul>\n<li>Bachelor's in Computer Science/Applications/BTech Computer Science/MCA</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Kubernetes Cluster Management for AI/ML Workloads</li>\n<li>NVIDIA GPU Operator &amp; Device Plugin Configuration in K8s</li>\n<li>Container Orchestration using Docker, CRI-O, and Helm</li>\n<li>Kubernetes Operators for Lifecycle Automation &amp; Scaling</li>\n<li>Pod Networking with CNI Plugins – Calico, Flannel, Cilium</li>\n<li>Monitoring &amp; Observability with Prometheus, Grafana, Kibana</li>\n<li>GPU Workload Scheduling &amp; Optimization in Kubernetes</li>\n<li>Deployment of Distributed AI Frameworks (PyTorch, TensorFlow, Hugging Face)</li>\n<li>Service Mesh Integration – Istio or Linkerd</li>\n<li>Hybrid/Multi-Cloud Kubernetes Deployments (EKS, GKE, AKS)</li>\n<li>Helm Templating &amp; YAML Scripting for Deployment Automation</li>\n<li>Infrastructure Scripting using Bash, Python, or Ansible</li>\n<li>Kubernetes Custom Resource Definitions (CRDs) &amp; API Extensions</li>\n<li>GPU Virtualization (vGPU) and Multi-Tenant GPU Allocation</li>\n<li>Kubeflow or MLflow Integration for MLOps Pipelines</li>\n<li>K8s Security (RBAC, Network Policies, Pod Security Standards)</li>\n<li>CI/CD Integration with GitOps Tools (ArgoCD, Flux)</li>\n<li>GPU Monitoring via NVIDIA DCGM or NVIDIA Cloud Native Stack</li>\n<li>Advanced Troubleshooting in Kubernetes (control plane, etcd, kubelet)</li>\n<li>Cloud-Native Storage for AI – CSI Drivers, NFS, Ceph</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "5+ Years",
            "Kubernetes",
            "GPU",
            "Docker"
        ],
        "summary": "Seeking a Kubernetes Orchestration Engineer to manage GPU-optimized Kubernetes environments for AI/ML workloads. Requires strong Kubernetes and GPU management experience to ensure scalable and reliable infrastructure."
    },
    {
        "job_title": "Infrastructure as Code (IaC) Engineer – AI Data Center Automation",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21755",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Infrastructure as Code (IaC) Engineer – AI Data Center Automation</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly capable Infrastructure as Code (IaC) Engineer to lead the design, implementation, and management of automated infrastructure provisioning for high-performance AI data centers. This role is central to orchestrating compute, network, storage, and virtualization layers using modern IaC tools across on-premise and hybrid cloud environments. The ideal candidate will play a strategic role in enabling scalable and repeatable deployment pipelines that support GPU clusters, AI model training environments, and containerized platforms such as Kubernetes and OpenShift.</p>\n<p><strong>Job Description</strong></p>\n<p><strong>Must have:</strong></p>\n<ul>\n<li>5+ years of experience in infrastructure automation or SRE roles with hands-on IaC deployment.</li>\n<li>Proficiency in Terraform, Ansible, and scripting languages such as Python, Bash, and YAML.</li>\n<li>Experience automating infrastructure in GPU-intensive environments supporting AI/ML workloads.</li>\n<li>Strong understanding of networking (VXLAN, EVPN, BGP, RoCE) and virtualization platforms (OpenShift, VMware, KVM).</li>\n<li>Familiarity with Kubernetes, Helm, Operators, and container orchestration frameworks.</li>\n<li>Exposure to storage automation for AI data lakes (e.g., Ceph, BeeGFS, Lustre, or S3-compatible storage).</li>\n<li>Experience with CI/CD tools (GitLab CI/CD, Jenkins, ArgoCD, Flux) in IaC pipelines</li>\n</ul>\n<p><strong>Responsibilities include:</strong></p>\n<ul>\n<li>Design and implement IaC frameworks to automate the provisioning and configuration of data center infrastructure for AI workloads.</li>\n<li>Orchestrate and manage multi-layer automation across compute (GPU/CPU), networking (VXLAN, EVPN, BGP), storage (NVMe, object, parallel file systems), and virtualization platforms (KVM, VMware, OpenShift).</li>\n<li>Develop reusable Terraform modules, Ansible playbooks, and YAML templates to define infrastructure in version-controlled environments.</li>\n<li>Automate deployment of Kubernetes clusters and integrate with GPU operators for training and inference pipelines.</li>\n<li>Build and maintain CI/CD pipelines to deploy, test, and manage infrastructure changes using tools like GitLab CI/CD, Jenkins, or ArgoCD.</li>\n<li>Integrate with monitoring and observability stacks (Prometheus, Grafana, DCGM) for automated infrastructure validation and health monitoring.</li>\n<li>Work closely with AI/ML platform teams to align infrastructure deployment with model training, data pipelines, and security policies.</li>\n<li>Ensure compliance with security and operational standards through policy-as-code and drift detection mechanisms.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>Certified Kubernetes Administrator (CKA) –Must</li>\n<li>Certified Kubernetes Application Developer (CKAD)</li>\n<li>NVIDIA Certified Kubernetes Specialist</li>\n</ul>\n<p><strong>Educational Qualifications</strong></p>\n<ul>\n<li>Bachelors in Computer Science/Applications/BTech Computer Science/MCA</li>\n</ul>\n<p><strong>Preferred Skills - Primary Skills:</strong></p>\n<ul>\n<li>Terraform Scripting &amp; Module Development</li>\n<li>Ansible Automation for OS, Network, and Storage Provisioning</li>\n<li>Infrastructure Automation for GPU-Centric AI Workloads</li>\n<li>IaC for Virtualization Platforms – OpenShift, KVM, VMware</li>\n<li>Kubernetes Deployment Automation &amp; GPU Operator Integration</li>\n<li>Scripting Languages – Python, Bash, and YAML</li>\n<li>CI/CD for Infrastructure – GitLab CI/CD, Jenkins, ArgoCD</li>\n<li>Network Configuration Automation – VXLAN, EVPN, BGP, RoC</li>\n<li>Storage Provisioning for AI – Ceph, Lustre, BeeGFS, or S3-compatible</li>\n<li>Monitoring Stack Integration – Prometheus, Grafana, DCGM</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Policy-as-Code &amp; Security Automation (OPA/Gatekeeper, Sentinel)</li>\n<li>Drift Detection &amp; Compliance Enforcement in IaC Environments</li>\n<li>Helm Charts &amp; Kubernetes Operators Automation</li>\n<li>Version Control Practices with Git for Infra Code</li>\n<li>Integration with AI/ML Pipelines and Data Ingestion Frameworks</li>\n<li>Hybrid/Multicloud Orchestration Knowledge (AWS, Azure, GCP)</li>\n<li>OpenShift GitOps or Flux for Continuous Delivery of Infra</li>\n<li>Template Reusability and Modular Code Design in IaC</li>\n<li>GPU Resource Pooling and Node Provisioning with Ansible + Terraform</li>\n<li>Observability Automation (DCGM Exporter, Node Exporter, Custom Metrics)</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Contact Information:</strong>\nReflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "5+ Years",
            "Terraform",
            "Ansible",
            "Kubernetes"
        ],
        "summary": "We need an IaC Engineer to automate infrastructure for AI data centers. The role involves using Terraform, Ansible, and Kubernetes to manage compute, network, and storage."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21754",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<p><strong>Brief Description:</strong>\nWe are looking for candidates with 18+ years of experience for the Delivery Manager role.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Project Delivery Management:</strong></li>\n<li>Oversee the planning, execution, and delivery of multiple technical projects.</li>\n<li>Manage project scope, timelines, budgets, risks, and quality.</li>\n<li>\n<p>Ensure adherence to Agile/Waterfall methodologies as per project requirements.</p>\n</li>\n<li>\n<p><strong>Team Leadership:</strong></p>\n</li>\n<li>Lead and mentor cross-functional technical teams, fostering collaboration and innovation.</li>\n<li>\n<p>Conduct regular performance reviews and provide growth opportunities for team members.</p>\n</li>\n<li>\n<p><strong>Stakeholder Engagement:</strong></p>\n</li>\n<li>Act as a bridge between technical teams, business stakeholders, and clients.</li>\n<li>\n<p>Communicate project status, risks, and solutions effectively to all stakeholders.</p>\n</li>\n<li>\n<p><strong>Technical Expertise:</strong></p>\n</li>\n<li>Collaborate with architects and engineers to define technical solutions.</li>\n<li>\n<p>Provide input on architecture, design, and implementation strategies.</p>\n</li>\n<li>\n<p><strong>Process Improvement:</strong></p>\n</li>\n<li>Identify opportunities to improve project delivery processes and tools.</li>\n<li>\n<p>Implement best practices in software development and delivery.</p>\n</li>\n<li>\n<p><strong>Risk and Issue Management:</strong></p>\n</li>\n<li>Proactively identify project risks and develop mitigation strategies.</li>\n<li>\n<p>Resolve technical and operational challenges in a timely manner.</p>\n</li>\n<li>\n<p><strong>Customer Focus:</strong></p>\n</li>\n<li>Ensure customer satisfaction by delivering high-quality solutions aligned with business needs.</li>\n</ul>\n<p><strong>Preferred Skills/Experience:</strong></p>\n<ul>\n<li><strong>Experience:</strong></li>\n<li>18 years of experience in technology delivery roles, including hands-on development and leadership responsibilities.</li>\n<li>\n<p>Proven experience in delivering large-scale, complex projects with diverse teams.</p>\n</li>\n<li>\n<p><strong>Technical Expertise:</strong></p>\n</li>\n<li>Strong understanding of modern software development practices, cloud technologies (e.g., AWS, Azure, GCP), and DevOps.</li>\n<li>\n<p>Proficiency in one or more programming languages (e.g., Java, Python, .NET) is preferred.</p>\n</li>\n<li>\n<p><strong>Project Management:</strong></p>\n</li>\n<li>Expertise in Agile, Scrum, Kanban, and traditional project management methodologies.</li>\n<li>\n<p>Certification such as PMP, CSM, or equivalent is an advantage.</p>\n</li>\n<li>\n<p><strong>Leadership and Communication:</strong></p>\n</li>\n<li>Excellent team leadership, people management, and conflict resolution skills.</li>\n<li>\n<p>Strong communication, presentation, and negotiation abilities.</p>\n</li>\n<li>\n<p><strong>Education:</strong></p>\n</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (Master’s degree is a plus).</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details.</p>\n<p><strong>Fraud Alert:</strong>\nReflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers. Official communication is only through the company website or LinkedIn, and employment-related emails are sent via the official HR email address. Contact <a href=\"mailto:careers@reflectionsinfos.com\">careers@reflectionsinfos.com</a> for clarifications.</p>",
        "tags": [
            "18+ Years",
            "Agile/Waterfall",
            "Cloud Technologies",
            "Team Leadership"
        ],
        "summary": "Reflections Info Systems is seeking a Delivery Manager with 18+ years of experience. This role involves overseeing technical projects, leading teams, and ensuring customer satisfaction."
    },
    {
        "job_title": "Senior Technology Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21753",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Senior Technology Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a versatile and hands-on Senior Technology Architect to join our dynamic engineering teams. This role requires a unique blend of deep, multi-technology expertise (.NET/Core, Azure, modern JavaScript, SharePoint), DevOps proficiency, customer-facing acumen, and a relentless focus on creating tangible value.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Pragmatic Solution Design:</strong> Lead the architecture and hands-on design of scalable, secure, and resilient enterprise applications.</li>\n<li><strong>Hands-On Technical Leadership:</strong> Act as a senior player-coach, mentoring and guiding development teams. Foster a culture of technical excellence with hands-on prototyping and coding.</li>\n<li><strong>Client Engagement &amp; Trusted Advisory:</strong> Work directly with customers to lead technical assessments and act as a trusted advisor. Drive relationships with key client stakeholders.</li>\n<li><strong>Business &amp; Account Growth:</strong> Contribute to growing key accounts by identifying new opportunities and assisting with pre-sales activities.</li>\n<li><strong>Delivery Assurance &amp; Support:</strong> Partner closely with delivery and DevOps teams to ensure the architectural vision is translated into a practical, working solution.</li>\n<li><strong>Service Offering &amp; Capability Development:</strong> Proactively explore new technologies and methods. Develop new service offerings and build reusable assets.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li><strong>Architectural Expertise:</strong> Proven ability to apply architectural principles and patterns (Microservices, Domain-Driven Design, Clean Architecture, Event-Driven Architecture, SOLID, OOAD).</li>\n<li><strong>API Design:</strong> Deep expertise in API design (e.g., REST, GraphQL) and implementing hybrid integration solutions.</li>\n<li><strong>Technical Assessments:</strong> Demonstrated experience in performing technical assessments and creating strategic technology roadmaps.</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li><strong>Microsoft Stack:</strong> Extensive hands-on development experience with .NET and .NET Core. Proven ability to design and deploy solutions on Microsoft Azure (IaaS, PaaS, serverless architectures).</li>\n<li><strong>Frontend Technologies:</strong> Hands-on expertise in Angular, React, or Node.js.</li>\n<li><strong>SharePoint:</strong> In-depth, hands-on experience with SharePoint Online/On-Premises, including custom solution design. Proficiency in SPFx.</li>\n<li><strong>DevOps:</strong> Hands-on experience with DevOps practices and tools for building and managing CI/CD pipelines. Proficiency with containerization technologies (Docker, Kubernetes) and IaC.</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>10+ years of progressive, hands-on experience in software development and solution architecture.</li>\n<li>4+ years in a senior role responsible for technical leadership and architectural decisions.</li>\n<li>A strong portfolio showcasing successfully designed and delivered enterprise-scale solutions.</li>\n</ul>\n<p><strong>What We're Looking For:</strong></p>\n<ul>\n<li>A Pragmatic Problem-Solver</li>\n<li>An Excellent Communicator</li>\n<li>A Business-Minded Technologist</li>\n<li>A Proactive and Self-Driven Leader</li>\n<li>A Collaborative Mentor</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Contact Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "10+ Years",
            ".NET",
            "Azure",
            "SharePoint"
        ],
        "summary": "Reflections Info Systems is looking for a Senior Technology Architect. The role involves technical leadership, solution design, and client engagement to drive business growth."
    },
    {
        "job_title": "Technical Project Manager(Data)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21752",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Technical Project Manager (Data)</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Technical Project Manager to lead the delivery of data platform, AI, BI, and analytics projects. The ideal candidate will have a strong background in data engineering, analytics, and AI/ML, with a proven track record of managing cross-functional teams and delivering high-quality solutions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Own the end-to-end delivery of data platform, AI, BI, and analytics projects, ensuring alignment with business objectives and stakeholder expectations.</li>\n<li>Develop and maintain comprehensive project plans, roadmaps, and timelines for data ingestion, transformation, governance, AI/ML models, and analytics deliverables.</li>\n<li>Lead cross-functional teams including data engineers, data scientists, BI analysts, architects, and business stakeholders to deliver high-quality, scalable solutions on time and within budget.</li>\n<li>Define, prioritize, and manage product and project backlogs covering data pipelines, data quality, governance, AI services, and BI dashboards or reporting tools.</li>\n<li>Collaborate closely with business units to capture and translate requirements into actionable user stories and acceptance criteria for data and analytics solutions.</li>\n<li>Oversee BI and analytics area including dashboard development, embedded analytics, self-service BI enablement, and ad hoc reporting capabilities.</li>\n<li>Ensure data quality, lineage, security, and compliance requirements are integrated throughout the project lifecycle, in collaboration with governance and security teams.</li>\n<li>Coordinate UAT, performance testing, and user training to ensure adoption and successful rollout of data and analytics products.</li>\n<li>Act as the primary point of contact for all project stakeholders, providing regular status updates, managing risks and issues, and escalating as necessary.</li>\n<li>Facilitate agile ceremonies such as sprint planning, backlog grooming, demos, and retrospectives, fostering a culture of continuous improvement.</li>\n<li>Drive post-deployment monitoring and optimization of data and BI solutions to meet evolving business needs and performance standards.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Overall 13+ Years of Experience in IT with 6+ years of experience as a Technical Product Manager, Technical Program Manager, or Delivery Lead.</li>\n<li>Hands-on development experience in data engineering, including data pipelines, ETL processes, and data integration workflows</li>\n<li>Proven track record managing data engineering, analytics, or AI/ML projects end to end</li>\n<li>Solid understanding of modern data architecture: data lakes, warehouses, pipelines, ETL/ELT, governance, and AI tooling</li>\n<li>Hands-on familiarity with cloud platforms (e.g., Azure, AWS, GCP) and DataOps/MLOps practices</li>\n<li>Strong knowledge of Agile methodologies, sprint planning, and backlog grooming</li>\n<li>Excellent communication and stakeholder management skills, including working with senior execs and technical leads</li>\n<li>Background in computer science, engineering, data science, or analytics</li>\n<li>Experience or Solid Understanding with data engineering tools and services in AWS, Azure &amp; GCP</li>\n<li>Exposure or Solid Understanding of BI, Analytics, LLMs, RAG, prompt engineering, or agent-based AI systems</li>\n<li>Experience leading cross-functional teams in matrixed environments</li>\n<li>Certifications: PMP, CSM, SAFe, or equivalent are a plus</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark,\nKariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "13+ Years",
            "Data Engineering",
            "AI/ML",
            "Agile methodologies"
        ],
        "summary": "Reflections Info Systems seeks a Technical Project Manager to oversee data platform, AI, and BI projects. Requires 13+ years of IT experience and expertise in data architecture."
    },
    {
        "job_title": "Senior .Net Lead",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21751",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Senior .Net Lead</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a></p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025\n<strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>\n<h3>Introduction</h3>\n<p>We are looking for candidates with 8+ years of experience in the IT industry with strong .Net/.Net Core/Azure Cloud Service/Azure DevOps skills. This is a client-facing role, so strong communication skills are essential. The resource should be hands-on with experience in coding and Azure.</p>\n<p><strong>Working hours:</strong> 8 hours (12 PM - 9 PM)</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, enhance, document, and maintain application features in .Net Core 5/6+, C#, /REST API/T-SQL, and AngularJS/React JS.</li>\n<li>Application Support &amp; API Integrations with third-party solutions/services.</li>\n<li>Understand technical project priorities, implementation dependencies, risks, and issues.</li>\n<li>Participate and develop code as part of a unified development group, working the whole technological stack.</li>\n<li>Identify, prioritize, and execute tasks in the software development life cycle.</li>\n<li>Work with the team to define, design, and deliver new features.</li>\n<li>Broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum model, Jira models.</li>\n<li>Effective communication skills, technical documentation, leadership, and ownership quality.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Develop high-quality software design and architecture</li>\n<li>6+ years of development experience in C#, .Net technologies, SQL, and at least two years working with Azure Cloud Services</li>\n<li>Expertise in C#, .Net Core 3.0/6.0 or higher, Entity framework, EF core, Microservices, Azure Cloud services, Azure DevOps, and SOA</li>\n<li>Ability to lead, inspire, and motivate teams through effective communication and established credibility</li>\n<li>Guide team to write reusable, testable, performant, and efficient code</li>\n<li>Proficient in writing Unit Test Cases using X-Unit, MS-Test</li>\n<li>Build standards-based frameworks and libraries to support a large-scale application</li>\n<li>Expertise in RDBMS including MS SQL Server with thorough knowledge in writing SQL queries, Stored Procedures, Views, Functions, Packages, Cursors &amp; tables and objects types.</li>\n<li>Experience in large-scale software development.</li>\n<li>Prior experience in Application Support &amp; API Integrations</li>\n<li>Knowledge of architectural styles and design patterns, experience in designing solutions</li>\n<li>Strong debugging and problem-solving skills</li>\n<li>Azure Skills:</li>\n<li>Azure Messaging services - Service Bus or Event Grid, Event hub</li>\n<li>Azure Storage Account - Blobs, Tables, Queue etc</li>\n<li>Azure Function / Durable Functions</li>\n<li>Azure DevOps - CI/CD pipelines (classic / YAML)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Good knowledge of JavaScript, React JS, jQuery, Angular, and other front-end technologies</li>\n<li>API Management - APIM</li>\n<li>Expertise in Microsoft Azure Cloud Service, Application Insights, Azure Monitoring, KeyVault, and SQL Azure.</li>\n<li>Azure DevOps - CI/CD pipelines (classic / YAML)</li>\n<li>Hands-on experience in building and deploying applications by adopting Azure DevOps practices such as Continuous Integration (CI) and Continuous Deployment (CD) in runtime with Git, Docker, Kubernetes, and managing Azure Cloud Services.</li>\n<li>Azure Container Apps/Docker /Azure Container Registry</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job opportunities. Be cautious of fraudulent job offers. We only contact candidates through our official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "8+ Years",
            ".Net Core",
            "Azure DevOps",
            "C#"
        ],
        "summary": "Seeking a Senior .Net Lead with 8+ years of experience to develop and maintain application features. Client-facing role requiring strong communication skills and hands-on experience with Azure."
    },
    {
        "job_title": "Python Developer",
        "company": "Movytech Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/21750",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Python Developer</h2>\n<p>Movytech Innovations (P) Ltd is seeking a talented Python Developer to join our dynamic team. As a Python Developer, you will be responsible for designing and implementing server-side web application logic, developing and maintaining Python applications, and collaborating with cross-functional teams to define, design, and ship new features. The ideal candidate should have a strong understanding of Python, web frameworks, and database management, as well as a passion for creating efficient and scalable code.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design and implement server-side application logic using Python and relevant frameworks.</li>\n<li>Develop, test, and maintain robust and scalable software solutions.</li>\n<li>Collaborate with cross-functional teams, including front-end developers, designers, and product managers, to deliver high-quality software.</li>\n<li>Integrate user-facing elements using server-side logic.</li>\n<li>Optimize performance and troubleshoot issues across the entire stack, from the database to the front-end.</li>\n<li>Develop and implement data storage solutions.</li>\n<li>Stay up-to-date with industry best practices and technologies to ensure the continuous improvement of our development processes.</li>\n<li>Write effective, scalable, and well-documented code.</li>\n<li>Participate in code reviews to maintain code quality and ensure best practices.</li>\n<li>Collaborate with other team members and stakeholders to understand requirements and provide technical solutions</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience with cloud platforms such as AWS, or Azure.</li>\n<li>Experience with DynamoDB and PGSQL.</li>\n<li>Knowledge of containerization and orchestration tools (Docker, Kubernetes).</li>\n<li>Familiarity with DevOps practices and continuous integration/continuous deployment (CI/CD).</li>\n<li>Experience with agile development methodologies.</li>\n</ul>\n<p><strong>Minimum 2 years of experience in Python</strong></p>\n<p>Interested candidates should apply by using the following link (Mandatory): <a href=\"Job Application Link\">Job Application Link</a></p>\n<p><strong>Contact Information</strong>:</p>\n<ul>\n<li>Fourth Floor, CDAC Building, Technpark Phase 1, Thiruvananthapuram, 695581</li>\n<li>Website: <a href=\"https://movytech.co\">https://movytech.co</a></li>\n<li>Contact Email: hr@movytech.co</li>\n</ul>\n<p><strong>Closing Date</strong>: 31, July 2025</p>\n<p><strong>Job Published</strong>: 11, July 2025</p>",
        "tags": [
            "2+ Years",
            "Python",
            "AWS",
            "DynamoDB"
        ],
        "summary": "Movytech Innovations is looking for a Python Developer to design and implement server-side logic. The role involves collaborating with cross-functional teams to deliver high-quality software."
    },
    {
        "job_title": "HR cum Admin Executive",
        "company": "Minerva Special Purpose Vehicle (P) Ltd",
        "url": "https://technopark.org/job-details/21749",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>HR cum Admin Executive</h2>\n<p><strong>MINERVA SPECIAL PURPOSE VEHICLE (P) Ltd</strong>\n5TH FLOOR, DHANASHRI, SOFTWARE TECHNOLOGY PARKS OF INDIA,TECHNOPARK, THIRUVANANTHAPURAM , 695581\n<a href=\"https://www.mspv.in\">https://www.mspv.in</a></p>\n<p><strong>Contact Email:</strong> srinivas@mspv.in</p>\n<p><strong>Closing Date:</strong> 11, Aug 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>Brief Description:</strong>\nThe candidate should hold a Bachelor's Degree preferably in HR/Business Administration/related field, with a minimum of 3 years experience in HR/Admin activities. He should have basic knowledge in payroll management with excellent communication, interpersonal and Organizational skills. He should be proficient in MS Office (MS Excel, MS Word &amp; Outlook) and should be able to track and do necessary follow ups for all types of renewals etc.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage end-to-end recruitment: job postings, screening, scheduling interviews, onboarding.</li>\n<li>Maintain employee records (attendance, leaves, personal files, etc.).</li>\n<li>Handle payroll inputs and coordinate with accounts/payroll processing team.</li>\n<li>Support performance management and appraisal processes.</li>\n<li>Address employee grievances and ensure legal compliance (ESI, PF, labor laws, etc.).</li>\n<li>Prepare HR letters (offer, appointment, confirmation, experience, etc.).</li>\n<li>Maintain office infrastructure, supplies, and general upkeep.</li>\n<li>Handle travel and accommodation arrangements for staff when required.</li>\n<li>Coordinate with IT or third-party vendors for hardware/software issues.</li>\n<li>Monitor office expenses and maintain petty cash.</li>\n<li>Track and monitor all types of renewals like passports/visas/insurance/medicals etc.</li>\n</ul>\n<p><strong>Preferred Skills</strong>\nBachelor's Degree with expertise in MS Word, MS Excel and Outlook.</p>",
        "tags": [
            "3+ Years",
            "Recruitment",
            "Payroll Management",
            "MS Office"
        ],
        "summary": "Seeking an HR cum Admin Executive to manage recruitment, maintain records, and handle payroll. The candidate should have 3+ years of HR/Admin experience."
    },
    {
        "job_title": "Senior .Net Developer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21748",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Senior .Net Developer</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Senior .Net Developer with 7+ years of experience. This is a client-facing role requiring strong communication skills and hands-on experience in coding and Azure.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>Working Hours:</strong> 8 hours (12 PM - 9 PM)</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Develop, enhance, document, and maintain application features in .Net Core 5/6+, C#, /REST API/T-SQL and AngularJS/React JS</li>\n<li>Application Support &amp; API Integrations with third-party solutions/services</li>\n<li>Understand technical project priorities, implementation dependencies, risks, and issues</li>\n<li>Participate and develop code as part of a unified development group, working the whole technological stack</li>\n<li>Identify, prioritize, and execute tasks in the software development life cycle</li>\n<li>Work with the team to define, design, and deliver on new features</li>\n<li>Broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum model, Jira models.</li>\n<li>Effective communication skill, technical documentation, leadership, and ownership quality</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Develop high-quality software design and architecture</li>\n<li>6+ years of development experience in C#, .Net technologies, SQL, and at least two years working with Azure Cloud Services</li>\n<li>Expertise in C#, .Net Core 3.0/6.0 or higher, Entity framework, EF core, Microservices, Azure Cloud services, Azure DevOps, and SOA</li>\n<li>Ability to lead, inspire, and motivate teams through effective communication and established credibility</li>\n<li>Guide the team to write reusable, testable, performant, and efficient code</li>\n<li>Proficient in writing Unit Test Cases using X-Unit, MS-Test</li>\n<li>Build standards-based frameworks and libraries to support a large-scale application</li>\n<li>Expertise in RDBMS including MS SQL Server with thorough knowledge in writing SQL queries, Stored Procedures, Views, Functions, Packages, Cursors &amp; tables and objects types.</li>\n<li>Experience in large-scale software development.</li>\n<li>Prior experience in Application Support &amp; API Integrations</li>\n<li>Knowledge of architectural styles and design patterns, experience in designing solutions</li>\n<li>Strong debugging and problem-solving skills</li>\n</ul>\n<h3>Azure Skills:</h3>\n<ul>\n<li>Azure Messaging services - Service Bus or Event Grid, Event hub</li>\n<li>Azure Storage Account - Blobs, Tables, Queue etc</li>\n<li>Azure Function / Durable Functions</li>\n<li>Azure DevOps - CI/CD pipelines (classic / YAML)</li>\n</ul>\n<h3>Secondary Skills:</h3>\n<ul>\n<li>Good knowledge of JavaScript, React JS, jQuery, Angular, and other front-end technologies</li>\n<li>API Management - APIM</li>\n<li>Expertise in Microsoft Azure Cloud Service, Application Insights, Azure Monitoring, KeyVault, and SQL Azure.</li>\n<li>Azure DevOps - CI/CD pipelines (classic / YAML)</li>\n<li>Hands-on experience in building and deploying applications by adopting Azure DevOps practices such as Continuous Integration (CI) and Continuous Deployment (CD) in runtime with Git, Docker, Kubernetes, and managing Azure Cloud Services.</li>\n<li>Azure Container Apps/Docker /Azure Container Registry</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Fraud Alert:</strong> Reflections Info Systems does not charge any fees for job opportunities. Be cautious of fraudulent job offers. All official communications come through our website or LinkedIn, and employment-related emails are sent via the official HR email ID. Contact careers@reflectionsinfos.com for any clarification/alerts.</p>",
        "tags": [
            "7+ Years",
            ".NET",
            "Azure",
            "C#"
        ],
        "summary": "Reflections Info Systems is hiring a Senior .Net Developer to develop and maintain application features. The role requires strong .Net, Azure, and communication skills."
    },
    {
        "job_title": "React Native Developer",
        "company": "Pearlsoft Technologies Llp",
        "url": "https://technopark.org/job-details/21747",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>React Native Developer</h2>\n<p><strong>Pearlsoft Technologies LLP</strong>\nModule No.2, -2 floor,\nThejaswini Building, Phase I,\nTechnopark, Trivandrum , 695581\n<a href=\"https://pearlsofttechnologies.com/\">https://pearlsofttechnologies.com/</a></p>\n<p><strong>Closing Date:</strong> 11, Aug 2025\n<strong>Job Published:</strong> 11, July 2025\n<strong>Job Location:</strong> Kochi, Infopark\n<strong>Contact Email:</strong> renjini.r@pearlsofttechnologies.co.in</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, maintain, and enhance cross-platform mobile applications using React Native.</li>\n<li>Write robust unit tests using testing frameworks like Jest or Detox to ensure code quality and application reliability.</li>\n<li>Integrate push notification services using AWS SNS.</li>\n<li>Set up and manage CI/CD pipelines for seamless deployment using tools like Fastlane.</li>\n<li>Integrate and monitor Firebase Crashlytics for crash reporting and debugging.</li>\n<li>Collaborate with backend developers to integrate REST APIs effectively.</li>\n<li>Perform code reviews to maintain high standards of code quality and scalability.</li>\n<li>Optimize application performance and ensure a smooth user experience.</li>\n<li>Stay up to date with the latest mobile development trends and React Native best practices.</li>\n<li>Publish and maintain applications on the Apple App Store and Google Play Store, ensuring compliance with platform guidelines.</li>\n</ul>\n<p><strong>Required Skills and Experience:</strong></p>\n<ul>\n<li><strong>React Native:</strong> 5+ years of professional experience in building cross-platform mobile applications.</li>\n<li><strong>Unit Testing:</strong> Strong proficiency with testing frameworks such as Jest, Enzyme, or Detox.</li>\n<li><strong>AWS Services:</strong> Hands-on experience with AWS SNS for push notifications.</li>\n<li><strong>REST APIs:</strong> Solid experience working with RESTful APIs and asynchronous data handling.</li>\n<li><strong>Crash Analytics:</strong> Familiarity with Firebase Crashlytics for monitoring and debugging application crashes.</li>\n<li><strong>State Management:</strong> Expertise in Redux, MobX, or Context API.</li>\n<li>Strong understanding of mobile UI/UX principles and responsive design.</li>\n<li>Excellent problem-solving and debugging skills.</li>\n<li>Experience with deploying apps in the Apple App Store and Google Play Store, including handling app submission, updates, and compliance with platform guidelines.</li>\n<li>Familiarity with native build tools such as Xcode (iOS) and Android Studio (Android).</li>\n<li>Experience managing certificates, provisioning profiles, and resolving app store review issues.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Understanding of Agile methodologies and DevOps practices.</li>\n<li>Knowledge of secure coding practices and mobile app security.</li>\n<li>Experience with native module development in Java/Kotlin (Android) or Swift/Objective-C (iOS).</li>\n<li>Experience working in Agile development environments and familiarity with tools like JIRA, Trello, or Azure DevOps for issue tracking and project management</li>\n<li>React, Redux, Bridging with Native Modules, Jest, Engyme, Push Notifications, Restful API Integration, Crash Analytics, Agile Methodologies , Crashlytics</li>\n</ul>",
        "tags": [
            "5+ Years",
            "React Native",
            "Redux",
            "REST APIs"
        ],
        "summary": "We are looking for a React Native Developer to build and maintain cross-platform mobile applications. The ideal candidate should have strong experience with React Native, REST APIs, and unit testing."
    },
    {
        "job_title": "Apps & Integration Architect (.Net)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21746",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Apps &amp; Integration Architect (.Net)</h2>\n<p>Reflections Info Systems (P) Ltd is seeking an experienced Apps &amp; Integration Architect (.Net) to join our team. This role requires a strong technical foundation, excellent communication skills, and hands-on experience in .Net coding and Azure development. The candidate will be responsible for designing and overseeing software solution architectures, leading development teams, and ensuring alignment with business goals.</p>\n<p><strong>Contact Information:</strong>\nReflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O,\nThiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a>\nContact Email: Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Designing and overseeing the architecture of software solutions.</li>\n<li>Leading and mentoring teams effectively.</li>\n<li>Designing scalable, secure, and robust .NET applications using Azure Cloud services.</li>\n<li>Leading cloud infrastructure design using Azure IaaS, PaaS, and other Azure services.</li>\n<li>Developing and implementing Azure DevOps CI/CD pipelines for continuous integration and delivery.</li>\n<li>Identifying, prioritizing, and executing tasks in the software development life cycle.</li>\n<li>Guiding the team to write reusable, testable, performant, and efficient code.</li>\n<li>Collaborating with stakeholders to align the architectural vision with business goals.</li>\n<li>Leading by example by designing and implementing clean, maintainable code.</li>\n<li>Troubleshooting and resolving architectural and infrastructure issues, ensuring high availability and disaster recovery setups.</li>\n<li>Stakeholder Management (client facing roles)</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>12 + years of experience in the IT industry.</li>\n<li>Expertise in C#, .Net Core, Entity framework, EF core, Microservices</li>\n<li>Expertise in RDBMS including MS SQL Server with thorough knowledge in writing SQL queries, Stored Procedures</li>\n<li>Familiarity with design patterns (e.g., Singleton, Factory, Repository, etc.) and architectural patterns (e.g., MVC, MVVM, Clean Architecture, DDD).</li>\n<li>Understanding of microservices principles, including service decomposition, inter-service communication, and API design.</li>\n<li>Knowledge of event-driven systems and messaging patterns, including using technologies like RabbitMQ or Azure Service Bus.</li>\n<li>Proficiency in cloud services (e.g., Azure, AWS) and understanding of cloud-native application design, including serverless architectures and containers (Docker, Kubernetes).</li>\n<li>Minimum 2 years of experience in an architectural role or as a lead developer with architectural responsibilities</li>\n<li>Azure App Services (Web Apps, API Apps), Azure Key Vault</li>\n<li>Azure Functions, Durable Functions</li>\n<li>Docker, &amp; containerization practices.</li>\n<li>Azure Logic Apps -Messaging service - Service Bus &amp; Event Grid</li>\n<li>Azure SQL Database, Cosmos DB, Blob Storage</li>\n<li>Design, implement, and deploy microservices on Azure.</li>\n<li>Implement monitoring solutions using Azure Monitor, Application Insights, and Log Analytics.</li>\n<li>Experience setting up and managing CI/CD pipelines, deployment automation, and release management.</li>\n<li>Proficiency in using Azure Repos, Azure Pipelines, Azure Artifacts, and integrating with Git.</li>\n<li>Knowledge of architectural styles and design patterns, experience in designing solutions</li>\n<li>Broad and extensive knowledge of the software development life cycle (SDLC) with software development models like Agile, Scrum model, Jira models.</li>\n<li>Experience with RESTful APIs</li>\n</ul>\n<p><strong>Secondary Skills (Preferred):</strong></p>\n<ul>\n<li>Experience with PowerShell or Bash scripting for automation.</li>\n<li>Knowledge of Event Hub.</li>\n<li>Experience with GraphQL.</li>\n<li>Front-end JavaScript frameworks used for building dynamic, responsive, and interactive web applications (React/Angular/Vue.js)</li>\n<li>Experience in Azure Active Directory (AAD), Managed Identities, Role-Based Access Control (RBAC), and API security.</li>\n<li>Kubernetes, and containerization practices.</li>\n</ul>\n<p><strong>Additional Information:</strong>\nInterested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><em>Note: Reflections Info Systems does not seek payment for jobs. Contact is only made through the official website or LinkedIn, and employment-related emails are sent through the official HR email id.</em></p>",
        "tags": [
            "12+ Years",
            ".NET Core",
            "Azure DevOps",
            "Microservices"
        ],
        "summary": "Reflections Info Systems is hiring an Apps & Integration Architect with extensive .NET and Azure experience. This role involves designing solutions, leading teams, and aligning with business goals."
    },
    {
        "job_title": "Technical Project Manager",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21745",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Technical Project Manager</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Technical Project Manager to lead the end-to-end execution of custom application development and integration projects. The ideal candidate will have a strong technical foundation and project delivery expertise to drive complex initiatives from discovery through production rollout.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage end-to-end delivery of custom software development and integration projects using Java, .NET, and related technologies.</li>\n<li>Create and maintain project plans, define timelines, identify dependencies, and track progress.</li>\n<li>Coordinate with cross-functional teams including developers, QA, UI/UX, and DevOps.</li>\n<li>Oversee all stages of the SDLC: requirements, development, integration, testing, and deployment.</li>\n<li>Work closely with architects and leads to ensure alignment with technical direction and design.</li>\n<li>Identify and manage risks, scope changes, and schedule adjustments proactively.</li>\n<li>Serve as the primary point of contact for clients and stakeholders, providing regular updates and resolving issues.</li>\n<li>Ensure quality and timely delivery through effective team coordination and clear communication.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>13+ years of overall IT experience, with 4–6 years of Technical Project Management experience.</li>\n<li>Strong understanding of custom application development on Java/.NET stacks.</li>\n<li>Experience managing backend/API development.</li>\n<li>Experience with integration tools like Apache Camel and IBM Integration Stack.</li>\n<li>Experience with database interactions (Oracle, SQL Server).</li>\n<li>Experience with client-side development using React/Angular.</li>\n<li>Experience with deployment on cloud platforms (AWS, Azure).</li>\n<li>Familiarity with Microservices architecture, CI/CD pipelines, and DevOps practices.</li>\n<li>Expertise in schedule planning, effort estimation, dependency tracking, and delivery monitoring.</li>\n<li>Hands-on experience in scope and schedule change management, stakeholder communication, and issue escalation.</li>\n<li>Tools: Jira, Confluence, MS Project, Git, Jenkins, or equivalent.</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience managing globally distributed teams.</li>\n<li>Strong understanding of enterprise-level integrations and technology ecosystems.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Excellent communication and stakeholder engagement capabilities.</li>\n<li>Strong leadership, problem-solving, and organizational skills.</li>\n<li>Ability to articulate technical topics to both technical and non-technical audiences.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p>Closing Date: 18, July 2025\nJob Published: 11, July 2025\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "13+ Years",
            ".NET",
            "Project Management",
            "Jira"
        ],
        "summary": "Reflections Info Systems is hiring a Technical Project Manager with 13+ years of experience. The role involves managing custom software development and integration projects using .NET and related technologies."
    },
    {
        "job_title": "Trainees - Business Growth Team (Pre-Sales)",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21744",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Trainees - Business Growth Team (Pre-Sales)</h2>\n<p><strong>Softnotions Technologies (P) Ltd</strong>\nModule No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\nhttps://softnotions.com</p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 11, July 2025\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<p><strong>Brief Description:</strong>\nWe are hiring Trainees for our Business Growth Team to explore opportunities in International Marketing, especially in Pre-Sales activities. Initially, candidates will undergo a 3-month Training period. Hiring to permanent roles depends on their performance during the Training period.</p>\n<p><strong>Qualification:</strong>\nBTech (CS)/BCA/MCA/MBA (Mkting). Students from other streams having a flair in sales and MBA in Marketing can also apply.</p>\n<p><strong>Mode of work:</strong> Work from office\n<strong>Timing:</strong> Weekdays, 9 am-6 pm</p>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Must have skills:</strong></p>\n<ul>\n<li>Excellent communication skills</li>\n<li>Good command over the English Language</li>\n<li>Interpersonal Skills</li>\n<li>Proactive, Self-driven personality</li>\n<li>Ability to work with less supervision</li>\n<li>Fast learner</li>\n</ul>",
        "tags": [
            "Entry Level",
            "Pre-Sales",
            "Communication Skills",
            "English Language"
        ],
        "summary": "Softnotions Technologies is seeking trainees for the Business Growth Team. This role focuses on international marketing and pre-sales, with potential for permanent placement after a training period."
    },
    {
        "job_title": "Senior Database Administrator",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21743",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Senior Database Administrator</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Senior Database Administrator to oversee the management, maintenance, and optimization of our databases. The ideal candidate will work on strategic initiatives to align the database infrastructure with long-term business goals and ensure adherence to best practices in database management.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<h3>Main Duties/Responsibilities:</h3>\n<ul>\n<li>Optimize database queries for fast and efficient data retrieval.</li>\n<li>Design and implement effective indexing strategies.</li>\n<li>Monitor and profile slow queries and recommend best practices for rewriting or re-architecting.</li>\n<li>Continuously analyze execution plans for SQL queries to identify bottlenecks.</li>\n<li>Schedule and execute regular maintenance tasks, including backups and consistency checks.</li>\n<li>Implement automated monitoring systems to track database performance and availability.</li>\n<li>Diagnose and resolve database issues proactively.</li>\n<li>Implement and manage database clustering, replication, and failover strategies for high availability and disaster recovery.</li>\n<li>Monitor resource consumption and plan for growth to ensure effective scaling.</li>\n<li>Analyze and optimize resource usage to reduce operational costs.</li>\n<li>Ensure adherence to database licensing models and identify cost reduction opportunities.</li>\n<li>Monitor and optimize cloud database spend using cost analysis tools.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>5-7 years of experience in Microsoft SQL Server administration.</li>\n<li>Experience in MySQL, PostgreSQL, and Oracle database administration.</li>\n<li>Exposure to Data Lake, Hadoop, and Azure technologies.</li>\n<li>Exposure to DevOps or ITIL.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in computer science, software engineering, or a related field.</li>\n<li>Microsoft SQL certifications (MTA Database, MCSA: SQL Server, MCSE: Data Management and Analytics) are an advantage.</li>\n</ul>\n<h3>Behavioral Competencies:</h3>\n<ul>\n<li>Communication</li>\n<li>Teamwork</li>\n<li>Digital Mindset</li>\n<li>Operational Excellence</li>\n<li>Analytical Ability</li>\n<li>Customer Centricity</li>\n<li>Business and Market Acumen</li>\n<li>Empathy</li>\n<li>Growth Mindset</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current, and expected CTC details.</p>\n<p><strong>Note:</strong> Reflections Info Systems does not seek payment for job opportunities. Contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "5+ Years",
            "SQL Server",
            "Database Administration",
            "Cloud Cost Management"
        ],
        "summary": "Reflections Info Systems is hiring a Senior Database Administrator to manage and optimize databases, ensuring alignment with business goals. The role involves database maintenance, performance optimization, and proactive issue resolution."
    },
    {
        "job_title": "Mid Data Scientist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21742",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Mid Data Scientist</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Mid Data Scientist to join our team. This role requires 5+ years of experience and a strong background in statistical modeling, machine learning, deep learning, and GenAI.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead the development and deployment of machine learning/deep learning models to address key business challenges.</li>\n<li>Apply statistical modeling, data preprocessing, feature engineering, machine learning, and deep learning techniques to build and improve models.</li>\n<li>Have expertise in at least two of the following areas: computer vision, predictive analytics, natural language processing, time series analysis, recommendation systems.</li>\n<li>Expertise in GenAI models is a must.</li>\n<li>Design, implement, and optimize data pipelines for model training and deployment.</li>\n<li>Experience with any one of the model serving frameworks (e.g.,TensorFlow Serving, TorchServe, KServe, or similar).</li>\n<li>Design and implement APIs for model serving and integration with other systems.</li>\n<li>Collaborate with cross-functional teams to define project requirements, develop solutions, and communicate results.</li>\n<li>Mentor junior data scientists, providing guidance on technical skills and project execution.</li>\n<li>Stay up-to-date with the latest advancements in data science and machine learning, particularly in generative AI, and evaluate their potential applications.</li>\n<li>Communicate complex technical concepts and analytical findings to both technical and non-technical audiences.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Strong knowledge of statistical modeling, machine learning, deep learning and GenAI.</li>\n<li>Proficiency in Python and experience optimizing code for performance.</li>\n<li>Experience with data preprocessing, feature engineering, data visualization and hyperparameter tuning.</li>\n<li>Solid understanding of database concepts and experience working with large datasets.</li>\n<li>Experience deploying and scaling machine learning models in a production environment.</li>\n<li>Familiarity with machine learning operations (MLOps) and related tools.</li>\n<li>Good understanding of Generative AI concepts and LLM finetuning.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Bachelor's or Master's degree in a quantitative field such as statistics, mathematics, computer science, or a related area.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Python</li>\n<li>Data Science concepts</li>\n<li>Generative AI</li>\n<li>Pandas, NumPy, Matplotlib</li>\n<li>Artificial Intelligence</li>\n<li>Statistical Modeling</li>\n<li>Machine Learning, Natural Language Processing (NLP), Deep Learning</li>\n<li>Model Serving Frameworks (e.g., TensorFlow Serving, TorchServe)</li>\n<li>MLOps(e.g; MLflow, Tensorboard, Kubeflow etc)</li>\n<li>Computer Vision</li>\n<li>Predictive Analytics</li>\n<li>Time Series Analysis</li>\n<li>Anomaly Detection</li>\n<li>Recommendation Systems</li>\n<li>SQL</li>\n<li>Proficent in any of Cloud Computing Platforms (e.g., AWS, Azure, GCP)</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong></p>\n<p>Reflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers and contact careers@reflectionsinfos.com for any clarification.</p>",
        "tags": [
            "5+ Years",
            "Generative AI",
            "Python",
            "Machine Learning"
        ],
        "summary": "Reflections Info Systems is hiring a Mid Data Scientist to develop and deploy ML models. The role requires expertise in statistical modeling, Python, and Generative AI."
    },
    {
        "job_title": "SAP BW Technical Consultant (with Data migration Experience)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21741",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>SAP BW Technical Consultant (with Data Migration Experience)</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong> is seeking a Senior SAP BW Technical Consultant to lead and execute a complex data migration project from SAP BW to Snowflake for a global headwear and retail business. The ideal candidate will translate business requirements into a detailed architecture design and deliver the requirements by developing and enhancing SAP BW/BOBJ &amp; HANA solutions. This role involves all aspects of delivering BW solutions from design and development to implementation. The consultant will lead the implementation of reporting analytics solutions focused on managing data integrity, aggregating, reconciling, and integrating data from multiple data sources (SAP and Non-SAP) into a global consolidated SAP BW HANA reporting platform.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead and execute a complex data migration project from SAP BW to Snowflake.</li>\n<li>Evaluate the current SAP BW HANA system capabilities to identify changes and determine the impact on the business.</li>\n<li>Develop technical specifications/detailed design for BW HANA Technical Development of Data Modeling and HANA Calculation Views in Control Reports.</li>\n<li>Develop backend Bex Queries and Composite Providers in SAP BW HANA.</li>\n<li>Design &amp; develop frontend visualization tools and dashboards using Business Objects WEBI, SAP Lumira/SAP Analytics on Cloud.</li>\n<li>Develop SAP HANA data model using ADSO, Attribute View, Analytic View, and Calculation View.</li>\n<li>Develop and enhance BW objects such as InfoObjects, InfoCubes, Insources/Data Sources, Master Data, Transformations, Update Rules, DSO, Extractors, Infosets, Aggregates, Process Chains, DTPs, User Exits, BADI, and HANA objects like Schemas, Calculated, Analytical, or Scripted Views using HANA Modeller.</li>\n<li>Lead the solution design, development, and implementation of SAP BW HANA &amp; Cloud solutions.</li>\n<li>Lead SAP HANA data modelling efforts and provide hands-on technical expertise on overall architecture, technical design, configuration, development, and implementation of the SAP BI/BW and NATIVE HANA solutions.</li>\n<li>Responsible for performance tuning of BW systems utilizing best practices.</li>\n<li>Provide guidance on BW HANA security setup and enforce data governance standards and processes.</li>\n<li>Responsible for root cause analysis and providing solutions for SAP BW Reporting production and development issues.</li>\n<li>Determine the BW architectural standards and right data ingestion approach from disparate source applications using different real-time and batch enabling technologies into Native HANA.</li>\n<li>Mentor a team of junior HANA BW resources and participate in sharing expertise on HANA.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Deep understanding of SAP HANA Data Modeling techniques and HANA Studio using Attribute View, Analytic View, and Calculation Views. Modeling experience along with HANA related development languages (SQL Script, HTML5, Javascript, Java).</li>\n<li>Experience in Visualization &amp; Reporting tools such as BO Webi, Analysis for Office, SAP Lumira/SAP Analytics.</li>\n<li>Experience in design and development of MultiProviders, InfoCubes, InfoSources, Transfer Structures, DataStore Objects (DSO), Transformations and Data Transfer Process (DTPs), InfoPackages, Transfer Rules and Update Rules.</li>\n<li>General understanding and technical expertise of enterprise-class ETL/BI tools (Oracle BIEE, IBM Cognos, SAS, Informatica, Tableau).</li>\n<li>Exposure to BODS / ETL / SQL Script Tool HANA.</li>\n<li>Understanding of BW HANA Security Model.</li>\n<li>Experience in SAP BPC/BPS project implementations is preferred. Knowledge of BPC Excel, and BPC Web UI is a plus.</li>\n<li>Experience in a multi-cultural, global organization; fluent in English with other spoken languages a plus.</li>\n<li>Strong functional knowledge of ECC Extraction in the areas of Finance, Supply Chain, SD/MM/PP -Logistics.</li>\n<li>Experience with SAP Analytics Cloud (SAC), Power BI, or Tableau integrated with Snowflake.</li>\n<li>Understanding of Agile delivery and DevOps principles in BI projects.</li>\n<li>Knowledge of data governance, data security, and compliance in cloud and hybrid environments.</li>\n<li>Good analytical and problem-solving skills, with attention to detail.</li>\n<li>Effective communication and interpersonal skills to collaborate with cross-functional teams.</li>\n<li>Ability to work independently and as part of a team in a fast-paced environment.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>10+ years of Hands-on SAP BW experience in design, development, and implementation.</li>\n<li>Minimum 2+ end-to-end SAP BW HANA(Cloud) project development implementation experience including LSA++ Architecture.</li>\n<li>Minimum of 2+ years in deploying SAP BW NATIVE HANA and 1+ years of ABAP / SQL development. Proficient with SAP BW on HANA system architecture design and performance optimization.</li>\n</ul>\n<p><strong>Working Hours:</strong></p>\n<ul>\n<li>8 hours, with a few hours of overlap during EST Time zone (12 PM - 9 PM). This overlap is mandatory for meetings.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong></p>\n<p>Please note that Reflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers and contact careers@reflectionsinfos.com for any clarification.</p>\n<p><strong>Company Information:</strong>\nReflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>",
        "tags": [
            "10+ Years",
            "SAP BW",
            "SAP HANA",
            "Data Migration"
        ],
        "summary": "Seeking a Senior SAP BW Technical Consultant to lead data migration from SAP BW to Snowflake. Requires 10+ years of SAP BW experience and expertise in SAP HANA."
    },
    {
        "job_title": "Data Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21740",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Data Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Data Architect to join our team. We are looking for candidates with 10+ years of experience to design and architect large data platforms, analytics, and AI solutions.</p>\n<p><strong>Contact Information:</strong>\n*   <strong>Company:</strong> Reflections Info Systems (P) Ltd\n*   <strong>Address:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n*   <strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">http://www.reflectionsglobal.com</a>\n*   <strong>Contact Email:</strong> Careers@reflectionsinfos.com\n*   <strong>Closing Date:</strong> 18, July 2025\n*   <strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work as part of a team to design and architect large data platforms, analytics, and AI solutions.</li>\n<li>Participate in the development of cloud data warehouses, data as a service, and business intelligence solutions.</li>\n<li>Provide forward-thinking solutions in data integration.</li>\n<li>Utilize programming experience in Scala or Python, and SQL.</li>\n<li>Work with Apache Spark (highly preferred).</li>\n<li>Familiarity with AWS and Azure services like S3, ADLS Gen2, AWS, Redshift, AWS Glue, Azure Data Factory, and Azure Synapse.</li>\n</ul>\n<p><strong>Skills and Qualifications:</strong></p>\n<ul>\n<li>Must Have: Bachelor's or Master's degree in Computer Science or a related field.</li>\n<li>Must Have: 7+ years of hands-on experience in Data Engineering, building Data Pipelines, Warehouses, Architecting Data platforms, Data Models, Data Science, and AI use cases.</li>\n<li>Proven experience as a Data Architect or in a similar role.</li>\n<li>Proficiency in developing and maintaining data architecture, ensuring scalability, security, and alignment with business objectives.</li>\n<li>Experience in MDM/PIM Solution Implementation.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Excellent communication and interpersonal skills, with the ability to articulate ideas and discuss technical concepts with both technical and non-technical team members.</li>\n<li>Clear and effective documentation, code comments, and the ability to write technical reports or emails.</li>\n<li>Ability to collaborate effectively with others, share knowledge, and contribute positively to a team.</li>\n<li>Strong problem-solving and analytical skills, with the ability to make sound decisions under pressure.</li>\n<li>Efficient time management and ability to meet deadlines in a fast-paced development environment.</li>\n<li>Understanding the needs and expectations of end-users or clients and developing solutions that meet or exceed those expectations.</li>\n</ul>\n<p><strong>Certifications (Preferred):</strong></p>\n<ul>\n<li>AWS/other Cloud Services Architect Certifications</li>\n<li>SnowPro Core Certification</li>\n<li>Databricks Professional level Certification</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong></p>\n<p>Reflections Info Systems does not charge any fees for job opportunities. Be cautious of fraudulent job offers. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Please contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>",
        "tags": [
            "10+ Years",
            "Data Architecture",
            "Cloud Data Warehouses",
            "Apache Spark"
        ],
        "summary": "Reflections Info Systems seeks a Data Architect with 10+ years of experience. The role involves designing data platforms and developing cloud-based data solutions."
    },
    {
        "job_title": "Enterprise Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21739",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Enterprise Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking an experienced Enterprise Architect to design, develop, and manage the organization's overall technology infrastructure. The ideal candidate will align IT strategies with business goals, ensure effective system integration across the enterprise, and create a robust, scalable IT landscape to meet future business needs. Deep expertise in business processes, technology trends, and architecture frameworks is required to drive innovation and optimize efficiency.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li><strong>Strategic Planning:</strong><ul>\n<li>Collaborate with senior management to understand business objectives and formulate a comprehensive IT strategy.</li>\n<li>Define and articulate the enterprise architecture vision, roadmap, and standards to guide technology decisions.</li>\n<li>Assess the current IT landscape, identifying gaps, risks, and opportunities for improvement.</li>\n<li>Conduct feasibility studies and evaluate the risks and benefits of new technology initiatives.</li>\n</ul>\n</li>\n<li><strong>Architecture Design:</strong><ul>\n<li>Design and document enterprise architecture blueprints, encompassing application, data, infrastructure, and security components.</li>\n<li>Develop and oversee solution architectures for new projects to ensure alignment with enterprise architecture.</li>\n<li>Define technology standards, guidelines, and best practices for system development and integration.</li>\n<li>Ensure the adoption of architectural principles across all IT projects.</li>\n</ul>\n</li>\n<li><strong>Technical Leadership:</strong><ul>\n<li>Provide technical expertise and guidance to project teams on architecture design, patterns, and technology choices.</li>\n<li>Lead architecture review boards to ensure solutions meet quality, scalability, and compliance standards.</li>\n<li>Stay updated on emerging technologies and industry trends to identify opportunities for innovation.</li>\n<li>Evaluate and recommend new technologies to enhance system capabilities and organizational efficiency.</li>\n</ul>\n</li>\n<li><strong>Communication and Collaboration:</strong><ul>\n<li>Act as a bridge between business stakeholders, IT teams, and vendors to ensure alignment on technology strategies.</li>\n<li>Present complex technical concepts to non-technical audiences, advocating for architectural decisions.</li>\n<li>Collaborate with architects across data, security, and cloud disciplines to create holistic solutions.</li>\n<li>Advise senior management on the business impact of technology decisions.</li>\n</ul>\n</li>\n<li><strong>Governance and Compliance:</strong><ul>\n<li>Ensure the enterprise architecture complies with industry regulations, security standards, and compliance requirements.</li>\n<li>Monitor the implementation of architectural standards and enforce governance policies.</li>\n<li>Conduct regular architecture reviews to identify risks and recommend mitigation strategies.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Preferred Skills and Qualifications:</strong></p>\n<ul>\n<li><strong>Technical Expertise:</strong><ul>\n<li>Proficiency in enterprise architecture frameworks (e.g., TOGAF, Zachman) and modelling tools.</li>\n<li>In-depth knowledge of cloud computing, distributed systems, data management, application development, and network architecture.</li>\n<li>Familiarity with programming languages and development methodologies.</li>\n</ul>\n</li>\n<li><strong>Business Acumen:</strong><ul>\n<li>Strong analytical skills to translate business needs into technical solutions.</li>\n<li>Comprehensive understanding of business processes and technology optimization opportunities.</li>\n<li>Excellent communication and presentation skills to explain technical concepts to diverse stakeholders.</li>\n</ul>\n</li>\n<li><strong>Leadership and Collaboration:</strong><ul>\n<li>Demonstrated ability to lead cross-functional teams and influence decisions across the organization.</li>\n<li>Strong collaboration skills to engage with various stakeholders effectively.</li>\n</ul>\n</li>\n<li><strong>Experience:</strong><ul>\n<li>Proven experience as an Enterprise Architect in a complex IT environment, preferably within IT services.</li>\n<li>A successful track record in designing and implementing enterprise-wide IT solutions.</li>\n<li>Experience managing large-scale technology transformations and migration projects.</li>\n</ul>\n</li>\n<li><strong>Domain Expertise:</strong><ul>\n<li>Proven exposure to the BFSI (Banking, Financial Services, and Insurance) domain. Candidates with experience in Retail and Healthcare domains are also preferred.</li>\n</ul>\n</li>\n<li><strong>Preferred Qualifications:</strong><ul>\n<li>Certification in enterprise architecture frameworks such as TOGAF or Zachman.</li>\n<li>Knowledge of DevOps practices and tools.</li>\n<li>Experience with modern technology stacks and microservices-based architectures.</li>\n</ul>\n</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Note:</strong> Reflections Info Systems does not charge any fees for job opportunities. Be cautious of fraudulent job offers.</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>",
        "tags": [
            "10+ Years",
            "Enterprise Architecture",
            "BFSI Domain",
            "TOGAF"
        ],
        "summary": "Reflections Info Systems is looking for an Enterprise Architect to manage the organization's tech infrastructure. The candidate will align IT strategies, ensure system integration, and optimize efficiency."
    },
    {
        "job_title": "Senior UI Technology Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21738",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Senior UI Technology Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Senior UI Technology Architect with 12+ years of experience to join our team.</p>\n<p><strong>Location:</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com</p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a highly experienced UI Architect.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Preferably a holistic architect but specializing in UI Architecture.</li>\n<li>Specialist in Angular, React etc.</li>\n<li>Mandatory to be hands-on as this role might need them to do coding as well (as needed).</li>\n<li>Good thinking and communication skills – would have to manage customer interactions, do assessments, suggest roadmaps, define architecture.</li>\n<li>Good to have at least some functional domain knowledge (banking or manufacturing/retail).</li>\n</ul>\n<p><strong>Contact Information:</strong>\nInterested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Note:</strong>\nReflections Info Systems does not charge any fees for job opportunities. Please be aware of potential fraudsters promising jobs for a fee. We contact candidates only through our official website or LinkedIn, and all employment-related emails are sent through the official HR email id. Contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>\n<p><strong>Contact Email:</strong> Careers@reflectionsinfos.com</p>",
        "tags": [
            "12+ Years",
            "UI Architecture",
            "Angular",
            "React"
        ],
        "summary": "Reflections Info Systems is hiring a Senior UI Technology Architect with extensive experience. The role involves UI architecture, customer interaction, and hands-on coding as needed."
    },
    {
        "job_title": "Data Engineer- MDM/PIM/Atacama/Informatica",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21737",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Data Engineer - MDM/PIM/Atacama/Informatica</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a Data Engineer with 6+ years of experience to join our team. The ideal candidate will play a key/lead role in implementing large data solutions.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Work as part of a team to develop Data and Analytics solutions.</li>\n<li>Participate in the development of cloud data warehouses, data as a service, and business intelligence solutions.</li>\n<li>Provide forward-thinking solutions in data integration.</li>\n<li>Deliver a quality product.</li>\n<li>Develop Modern Data Warehouse solutions using Azure or AWS Stack</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>6+ years of experience as a Data Engineer.</li>\n<li>Programming experience in Scala or Python, SQL.</li>\n<li>Min 1+ years experience in MDM/PIM Solution Implementation with tools like Ataccama, Syndigo, Informatica</li>\n<li>Min 2+ years experience in Data Engineering Pipelines, Solutions implementation in Snowflake</li>\n<li>Min 2+ years experience in Data Engineering Pipelines, Solutions implementation in Databricks</li>\n<li>Working knowledge of AWS and Azure Services like S3, ADLS Gen2, AWS Redshift, AWS Glue, Azure Data Factory, Azure Synapse.</li>\n<li>Demonstrated analytical and problem-solving skills.</li>\n<li>Excellent written and verbal skills (English).</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Familiar with Agile Practices.</li>\n<li>Familiar with Version control platforms GIT, CodeCommit etc.</li>\n<li>Problem Solving – Think of various options to solve the problem. Focus on completion, and not on duration spent.</li>\n<li>Ownership</li>\n<li>Proactive rather than reactive</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science &amp; engineering or equivalent demonstrable experience.</li>\n<li>Desirable to have Cloud Certifications in Data, Analytics, or Ops/Architect space.</li>\n</ul>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Contact Information:</strong></p>\n<p>Reflections Info Systems (P) Ltd\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\nhttp://www.reflectionsglobal.com\nContact Email: Careers@reflectionsinfos.com</p>",
        "tags": [
            "6+ Years",
            "MDM/PIM",
            "Data Engineering Pipelines",
            "Cloud (Azure or AWS)"
        ],
        "summary": "Reflections Info Systems is hiring a Data Engineer with 6+ years of experience. The role involves developing data solutions and implementing data engineering pipelines in cloud environments."
    },
    {
        "job_title": "Cloud Infrastructure Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21736",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Cloud Infrastructure Architect</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced Cloud Infrastructure Architect to design, develop, and maintain scalable cloud infrastructure solutions. The ideal candidate will have a minimum of 8 years of experience and proven expertise in cloud architecture, microservices, and DevOps practices.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Closing Date:</strong> 18, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable cloud infrastructure solutions.</li>\n<li>Lead cloud adoption strategies, migration roadmaps, and workload assessments.</li>\n<li>Provide infrastructure expertise to design cloud-native and on-premise solution architectures.</li>\n<li>Architect infrastructure solutions for AI/ML platforms, including training, inference, pipelines, and GPU/TPU setups.</li>\n<li>Ensure infrastructure security, compliance, and adherence to industry best practices.</li>\n<li>Design and implement new capabilities that address gaps and provide an integrated, end-to-end, scalable service.</li>\n<li>Collaborate with external vendors, partners, and stakeholders to ensure successful integration and implementation of infrastructure solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 8 years of experience in the design, implementation, and maintenance of infrastructure solutions.</li>\n<li>Experience in at least 5 projects involving enterprise-level cloud architecture and implementation.</li>\n<li>Proven expertise in designing and implementing large-scale microservices architectures, distributed systems, and integration architectures.</li>\n<li>Hands-on experience in large-scale cloud migration projects.</li>\n<li>Experience in setting up infrastructure for ML workloads, including training, inference, and GPU/TPU provisioning.</li>\n<li>Solid experience in data center operations, including the implementation and support of private and hybrid cloud environments.</li>\n<li>Strong experience with VMware technologies such as vSphere, ESXi, and vCenter.</li>\n<li>Hands-on expertise in infrastructure domains including networking, authentication, compute, and storage.</li>\n<li>Experience in responding to RFPs, preparing solution designs, and performing estimations and costing.</li>\n<li>Strong knowledge of Docker and Kubernetes, with hands-on experience deploying ML workloads.</li>\n<li>Proficient in Infrastructure as Code (IaC) using tools such as Ansible, Terraform, ARM Templates, and CloudFormation.</li>\n<li>Good understanding of SQL and NoSQL databases.</li>\n<li>Deep expertise in DevOps practices, containerization, and CI/CD pipelines.</li>\n<li>Experience with monitoring tools such as Nagios, Splunk, New Relic, or Prometheus.</li>\n<li>Experience working on projects with compliance requirements such as GDPR, PCI DSS, and HIPAA.</li>\n<li>Strong technical knowledge of cloud technologies and virtualization platforms (e.g., VMware, Hyper-V, Cisco, Microsoft, EMC, AWS).</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Experience with infrastructure services such as LDAP, DNS, DHCP, and Active Directory.</li>\n<li>Excellent communication, documentation, and presentation skills.</li>\n<li>Proficiency in scripting languages such as Python, Bash, or PowerShell for automation tasks.</li>\n</ul>\n<p><strong>Certifications:</strong></p>\n<ul>\n<li>AWS/Azure/GCP Architect Certifications</li>\n<li>Kubernetes Certifications (CKA/CKAD)</li>\n</ul>\n<p><strong>Additional Information:</strong>\nReflections Info Systems does not charge any fees for job applications. Be cautious of fraudulent job offers. All official communication will be through the official website or LinkedIn and employment-related emails will be sent through the official HR email id.</p>",
        "tags": [
            "8+ Years",
            "Cloud Architecture",
            "Kubernetes",
            "DevOps"
        ],
        "summary": "Reflections Info Systems seeks a Cloud Infrastructure Architect to design and maintain scalable cloud solutions. The role involves cloud adoption, infrastructure design, and ensuring security and compliance."
    },
    {
        "job_title": "Lead Data Scientist",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/21735",
        "location": "Technopark",
        "closing_date": "18 Jul 2025",
        "job_description": "<h2>Lead Data Scientist</h2>\n<p>Reflections Info Systems (P) Ltd is seeking a highly experienced and skilled Lead Data Scientist to provide technical leadership and drive AI initiatives. This role requires a minimum of 8 years of professional experience, with at least 6 years in a data science role. The ideal candidate will lead a high-performance team, guide them on the latest technology landscape, and design state-of-the-art AI solutions.</p>\n<p><strong>Contact:</strong> Careers@reflectionsinfos.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead a high-performance team, guiding and mentoring them on the latest technology landscape, patterns, and design standards.</li>\n<li>Provide strategic direction and technical leadership for AI initiatives.</li>\n<li>Lead the design and architecture of complex AI systems, ensuring scalability, reliability, and performance.</li>\n<li>Lead the development and deployment of machine learning/deep learning models to address key business challenges.</li>\n<li>Apply statistical modeling, data preprocessing, feature engineering, machine learning, and deep learning techniques to build and improve models.</li>\n<li>Utilize expertise in at least two of the following areas: computer vision, predictive analytics, natural language processing, time series analysis, recommendation systems.</li>\n<li>Design, implement, and optimize data pipelines for model training and deployment.</li>\n<li>Experience with model serving frameworks (e.g., TensorFlow Serving, TorchServe, KServe, or similar).</li>\n<li>Design and implement APIs for model serving and integration with other systems.</li>\n<li>Collaborate with cross-functional teams to define project requirements, develop solutions, and communicate results.</li>\n<li>Mentor junior data scientists, providing guidance on technical skills and project execution.</li>\n<li>Stay up-to-date with the latest advancements in data science and machine learning, particularly in generative AI, and evaluate their potential applications.</li>\n<li>Communicate complex technical concepts and analytical findings to both technical and non-technical audiences.</li>\n<li>Serve as a primary point of contact for client managers and liaise frequently with internal stakeholders to gather data or inputs needed for project work.</li>\n</ul>\n<p><strong>Primary Skills:</strong></p>\n<ul>\n<li>Python</li>\n<li>Data Science concepts</li>\n<li>Pandas, NumPy, Matplotlib</li>\n<li>Artificial Intelligence</li>\n<li>Statistical Modeling</li>\n<li>Machine Learning, Natural Language Processing (NLP), Deep Learning</li>\n<li>Model Serving Frameworks (e.g., TensorFlow Serving, TorchServe)</li>\n<li>MLOps(e.g; MLflow, Tensorboard, Kubeflow etc)</li>\n<li>Computer Vision, Predictive Analytics, Time Series Analysis, Anomaly Detection, Recommendation Systems (At least 2)</li>\n<li>Generative AI, RAG, Finetuning(LoRa, QLoRa)</li>\n<li>Proficient in any of Cloud Computing Platforms (e.g., AWS, Azure, GCP)</li>\n</ul>\n<p><strong>Secondary Skills:</strong></p>\n<ul>\n<li>Expertise in designing scalable and efficient model architectures.</li>\n<li>Ability to assess and forecast the financial requirements of data science projects.</li>\n<li>Strong communication skills.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>A minimum of 8 years of professional experience, with at least 6 years in a data science role.</li>\n<li>Strong knowledge of statistical modeling, machine learning, deep learning and GenAI.</li>\n<li>Proficiency in Python and hands on experience optimizing code for performance.</li>\n<li>Experience with data preprocessing, feature engineering, data visualization and hyperparameter tuning.</li>\n<li>Solid understanding of database concepts and experience working with large datasets.</li>\n<li>Experience deploying and scaling machine learning models in a production environment.</li>\n<li>Familiarity with machine learning operations (MLOps) and related tools.</li>\n<li>Good understanding of Generative AI concepts and LLM finetuning.</li>\n<li>Excellent communication and collaboration skills.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<p>Interested candidates may forward their detailed resumes to Careers@reflectionsinfos.com along with their notice period, current and expected CTC details.</p>\n<p><strong>Fraud Alert:</strong></p>\n<p>Please note that Reflections Info Systems never seeks payment for jobs. They contact candidates only through their official website or LinkedIn, and all employment-related emails are sent through the official HR email ID. Contact careers@reflectionsinfos.com for any clarification/alerts on this subject.</p>\n<p>Closing Date: 18, July 2025\nJob Published: 11, July 2025</p>",
        "tags": [
            "8+ Years",
            "Python",
            "Machine Learning",
            "Generative AI"
        ],
        "summary": "Reflections Info Systems is hiring a Lead Data Scientist to lead AI initiatives. The role involves leading a team, designing AI systems, and deploying machine learning models."
    },
    {
        "job_title": "Account Executive – Sales Department",
        "company": "Stackmod Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/21734",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>Account Executive – Sales Department</h2>\n<p><strong>Stackmod Innovations (P) Ltd</strong>\nAce-22, 5th Floor, CDAC Building, Technopark Phase 1 Campus, Thiruvananthapuram, 695581\nhttps://www.stackmod.io</p>\n<p><strong>Contact Email:</strong> hr@stackmod.io</p>\n<p><strong>Brief Description:</strong>\nWe are seeking a motivated and results-driven Account Executive to join our Sales Department. The ideal candidate will be responsible for managing client accounts, driving sales growth, building strong client relationships, and identifying new business opportunities. This role demands strong communication skills, a customer-focused attitude, and a passion for achieving sales targets.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage existing client accounts and maintain long-term relationships.</li>\n<li>Identify and pursue new sales opportunities through cold calling, networking, and lead generation.</li>\n<li>Understand client requirements and provide suitable solutions and proposals.</li>\n<li>Prepare and deliver presentations, quotations, and sales reports.</li>\n<li>Coordinate with internal teams to ensure client satisfaction and timely service delivery.</li>\n<li>Meet or exceed monthly and quarterly sales targets.</li>\n<li>Maintain accurate records of sales activities, client interactions, and pipeline status.</li>\n<li>Follow up on payments and ensure timely collections.</li>\n<li>Stay updated on industry trends and competitors.</li>\n</ul>\n<p><strong>Key Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, or a related field</li>\n<li>1–3 years of experience in sales, business development, or account management</li>\n<li>Excellent communication, negotiation, and interpersonal skills</li>\n<li>Strong customer service orientation and relationship management abilities</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Proficiency in MS Office and CRM tools</li>\n<li>Strong problem-solving skills and attention to detail</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience in B2B or tech product/service sales</li>\n<li>Background in managing corporate clients or enterprise accounts</li>\n<li>Familiarity with sales forecasting, reporting, and CRM platforms</li>\n<li>Proven ability to close deals and handle objections effectively</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Competitive salary and attractive incentives</li>\n<li>Opportunity to work with a dynamic sales team and fast-growing company</li>\n<li>Professional growth, skill development, and career advancement opportunities</li>\n<li>Collaborative and performance-driven work culture</li>\n<li>Exposure to diverse client industries and sales strategies</li>\n</ul>\n<p><strong>How to Apply:</strong></p>\n<p>Interested candidates can send their updated resume to hr@stackmod.io with the subject line \"Application for Account Executive – Sales.\"</p>",
        "tags": [
            "1-3 Years",
            "Sales",
            "CRM Tools",
            "Account Management"
        ],
        "summary": "Stackmod Innovations is seeking an Account Executive to manage client accounts, drive sales growth, and identify new business opportunities. The role requires strong communication, customer service skills, and sales experience."
    },
    {
        "job_title": "PowerApps and Power BI Developer",
        "company": "Ibil Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21733",
        "location": "Technopark",
        "closing_date": "11 Aug 2025",
        "job_description": "<h2>PowerApps and Power BI Developer</h2>\n<p><strong>IBIL Solutions (P) Ltd</strong>\n1A First Floor, Carnival Building,\nPhase 1, Technopark, 695581\n<a href=\"https://www.ibilglobal.com\">https://www.ibilglobal.com</a></p>\n<p><strong>Closing Date:</strong> 11, Aug 2025\n<strong>Job Published:</strong> 11, July 2025\n<strong>Contact Email:</strong> akash.deepu@ibilglobal.com</p>\n<p><strong>Summary:</strong>\nWe are looking for a skilled developer with 5+ years of experience in designing, building, and supporting solutions using Microsoft PowerApps, Power Automate, and Power BI.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain custom business apps using PowerApps.</li>\n<li>Automate workflows with Power Automate.</li>\n<li>Build interactive Power BI dashboards and reports.</li>\n<li>Connect to multiple data sources (SharePoint, SQL Server, APIs).</li>\n<li>Ensure data quality, security, and compliance.</li>\n<li>Work closely with stakeholders to gather requirements and deliver solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>5+ years of hands-on experience with Power Platform tools (PowerApps, Power BI, Power Automate).</li>\n<li>Strong skills in DAX, Power Query, and data modeling.</li>\n<li>Experience with SharePoint, Dataverse, and Office 365.</li>\n<li>Excellent problem-solving and communication skills.</li>\n<li>Microsoft certifications (PL-200/PL-400/PL-300) preferred.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "PowerApps",
            "Power BI",
            "Power Automate"
        ],
        "summary": "Seeking a PowerApps and Power BI Developer to design, build, and support solutions using Microsoft Power Platform. Requires 5+ years of experience and strong communication skills."
    },
    {
        "job_title": "SEO Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21732",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>SEO Specialist</h2>\n<p><strong>Way.Com India Pvt Ltd</strong> is seeking a highly analytical and results-driven SEO Specialist to lead and execute organic growth strategies that drive qualified traffic and lead generation. The ideal candidate brings hands-on experience from B2B, SaaS, E-commerce, or Fintech industries and has a strong grasp of modern SEO tools, data analytics, and technical optimization. This role requires a strategic thinker who can translate business goals into measurable SEO outcomes.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>SEO Strategy &amp; Execution</strong></p>\n<ul>\n<li>Develop and implement comprehensive on-page and off-page SEO strategies aligned with lead generation goals.</li>\n<li>Conduct advanced keyword research and competitive analysis, especially across B2B and Fintech domains.</li>\n<li>Perform technical SEO audits to maintain website health using tools like Screaming Frog, Ahrefs, SEMrush, etc.</li>\n</ul>\n<p><strong>Data Analytics &amp; Performance Reporting</strong></p>\n<ul>\n<li>Track and analyze SEO performance via Google Analytics 4 (GA4), Google Search Console, and Looker Studio.</li>\n<li>Create actionable insights and build custom dashboards to highlight trends, traffic sources, keyword performance, and ROI.</li>\n</ul>\n<p><strong>Content &amp; On-Page Optimization</strong></p>\n<ul>\n<li>Partner with content and product marketing teams to optimize web pages, blog posts, and product descriptions.</li>\n<li>Create content briefs based on intent-driven keyword research, topic clustering, and search behavior trends.</li>\n</ul>\n<p><strong>Link Building &amp; Outreach</strong></p>\n<ul>\n<li>Design and execute ethical backlink acquisition strategies to enhance domain authority and SERP rankings.</li>\n<li>Manage external relationships with vendors, publishers, and content platforms for link-building collaborations.</li>\n</ul>\n<p><strong>Performance &amp; KPI Ownership</strong></p>\n<ul>\n<li>Define and own key SEO metrics including organic traffic, keyword rankings, lead volume, and conversion rates.</li>\n<li>Proactively identify growth opportunities, test scalable SEO tactics, and deliver measurable impact aligned with quarterly targets.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>2–5 years of hands-on SEO experience in B2B/SaaS/E-commerce/Fintech settings.</li>\n<li>Proficiency in tools like Ahrefs, SEMrush, Screaming Frog, GA4, Looker Studio, GSC.</li>\n<li>Solid understanding of technical SEO, keyword intent, and organic funnel optimization.</li>\n<li>Strong analytical mindset with the ability to derive insights from large data sets.</li>\n<li>Excellent communication skills and the ability to collaborate across departments.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications</strong></p>\n<ul>\n<li>2–5 years of hands-on SEO experience in B2B, SaaS, e-commerce, or Fintech companies.</li>\n<li>Strong expertise in: GA4, Google Search Console, Looker Studio, Tableau</li>\n<li>SEMrush, Ahrefs, Screaming Frog</li>\n<li>Deep understanding of technical SEO, Core Web Vitals, site architecture, and crawlability.</li>\n<li>Strong analytical mindset with the ability to translate data into insights and action plans.</li>\n<li>Hands-on experience with target-driven SEO execution and reporting.</li>\n<li>Experience working in lead generation-focused environments.</li>\n<li>Basic understanding of HTML, CSS, and CMS platforms like WordPress, Webflow, or HubSpot.</li>\n<li>Ability to work cross-functionally with product, engineering, and content teams.</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Previous experience in a Fintech marketing environment.</li>\n<li>Exposure to marketing automation tools and CRM integrations.</li>\n<li>Understanding of CRO, UX optimization, and A/B testing frameworks.</li>\n<li>Familiarity with localization and international SEO (for US and global markets).</li>\n</ul>\n<p><strong>What Success Looks Like</strong></p>\n<ul>\n<li>Achieving measurable growth in organic traffic and qualified leads.</li>\n<li>Hitting keyword ranking and traffic KPIs consistently.</li>\n<li>Reducing dependency on paid media by strengthening the organic acquisition engine.</li>\n<li>Building a robust SEO performance dashboard and insights framework.</li>\n</ul>\n<p><strong>Contact Information:</strong> careers@way.com</p>",
        "tags": [
            "2-5 Years",
            "SEO",
            "GA4",
            "Ahrefs"
        ],
        "summary": "Way.Com is seeking an SEO Specialist to drive organic growth. The role involves strategy execution, data analysis, and optimization across B2B, SaaS, e-commerce, or Fintech."
    },
    {
        "job_title": "Golang Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21731",
        "location": "Technopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Golang Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\n<a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 30, July 2025\n<strong>Job Published:</strong> 11, July 2025\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 15 years.</p>\n<p>Techversant provides Technology services in Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption. Expertise offered in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>What’s important to us:</h3>\n<p>Seeking an experienced Team Lead specializing in GoLang to join our team. Responsible for leading the development of scalable, high-performance applications and mentoring a team of engineers. Play a critical role in designing, implementing, and maintaining backend services and ensuring the successful delivery of complete solutions to customers.</p>\n<p>As a Team Lead, you will work closely with your team to support their use of the platform and drive continuous improvement in development practices. Your reporting head values innovation and will welcome your recommendations on improving processes and approaches.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead and mentor a team of engineers, providing guidance on design, coding, and troubleshooting.</li>\n<li>Architect highly scalable and highly available systems with minimal guidance.</li>\n<li>Translate business requirements into scalable and extensible designs.</li>\n<li>Work closely with team members to deliver complete solutions to customers.</li>\n<li>Communicate effectively with clients to gather requirements, provide updates, and ensure their needs are met.</li>\n<li>Participate in all phases of the agile development cycle, including planning, design, implementation, review, testing, deployment, documentation, and training.</li>\n<li>Troubleshoot and resolve customer issues promptly and effectively.</li>\n<li>Advocate for and practice Agile methodologies within the team.</li>\n<li>Strive for continuous improvement in development processes and team productivity.</li>\n<li>Implement and maintain APIs using REST, GraphQL, and gRPC.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>6+ years of web development experience, with at least 2+ years of proven proficiency in Go programming.</li>\n<li>Deep understanding of RDBMS and NoSQL databases.</li>\n<li>Experience implementing AWS services, including containerization to support Go applications and repository maintenance.</li>\n<li>Proficiency with Kubernetes for application development, deployment, and scaling.</li>\n<li>Strong knowledge of RESTful APIs, GraphQL, and an understanding of the differences between REST, GraphQL, and gRPC.</li>\n<li>Knowledge of additional web technologies such as Python or PHP is a plus.</li>\n<li>Strong time management and organizational skills.</li>\n<li>Knowledge of Go templating, common frameworks, and tools.</li>\n<li>Ability to instill and enforce best practices in web development within the team.</li>\n<li>Strong design skills, with an understanding of design and architectural patterns.</li>\n<li>Excellent understanding of data structures and algorithms.</li>\n<li>A sense of urgency and ownership over the product, with a proactive approach to work.</li>\n<li>Great attitude towards work and people, fostering a positive team environment.</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>Ability to thrive in a fast-paced service environment.</li>\n<li>Experience in technical mentorship or coaching is highly desirable.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Experience working in an Agile development environment is a plus.</li>\n<li>Knowledge of front-end development technologies such as HTML, CSS, and JavaScript.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>",
        "tags": [
            "6+ Years",
            "Go Programming",
            "Kubernetes",
            "RESTful APIs"
        ],
        "summary": "Seeking a Golang Team Lead to develop scalable applications and mentor engineers. Requires experience with Go, databases, AWS, and Agile methodologies for complete solution delivery."
    },
    {
        "job_title": "Senior Golang Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21730",
        "location": "Technopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Senior Golang Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced and dedicated Golang Developer to join our growing company. We are a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to our clients across the globe for more than 15 years.</p>\n<p><strong>About Techversant:</strong>\nTechversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption. We offer expertise and consultation in multiple technology domains like ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<p><strong>Job Description:</strong>\n- Work closely with team members to support their use of the platform to deliver complete solutions to customers.\n- Participate in all phases of an agile development cycle – plan, design, implement, review, test, deploy, document, and training.\n- Troubleshoot and resolve customer issues.\n- Strive to make continuous improvement.\n- Architect highly scalable, highly available systems with minimal guidance.\n- Translate business requirements into scalable and extensible design.\n- Mentor junior engineers on design, coding, and troubleshooting.\n- Practice and advocate Agile processes in the team.</p>\n<p><strong>Preferred Skills:</strong>\n- 4+ years of web development experience with a minimum of 3 years having hands-on experience using GoLang\n- Deep understanding of RDBMS\n- Ability to instill and enforce best practices around web development.\n- A sense of urgency and ownership over the product\n- Great attitude towards work and people\n- Strong working knowledge in Golang\n- Working experience with any of the GoLang Web framework\n- Strong design skills, awareness of design and architectural patterns\n- Good understanding of data structures and algorithms\n- Excellent analytical and problem-solving skills\n- Ability to work in a fast-paced service environment.\n- Experience in technical mentorship/coaching is highly desirable.\n- Excellent written and verbal communication</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p><strong>Contact Information</strong>\n- Email: careers@techversantinfotech.com\n- Website: http://www.techversantinfotech.com</p>\n<p><strong>Location</strong>\n- Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581</p>\n<p><strong>Closing Date:</strong> 30, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>",
        "tags": [
            "4+ Years",
            "Golang",
            "RDBMS",
            "Agile"
        ],
        "summary": "Techversant Infotech is looking for a Senior Golang Developer with 4+ years of experience. You will be responsible for designing, implementing, and testing solutions."
    },
    {
        "job_title": "Legal Specialist",
        "company": "Prophaze Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21729",
        "location": "Technopark",
        "closing_date": "12 Aug 2025",
        "job_description": "<h2>Legal Specialist</h2>\n<p><strong>Prophaze Technologies</strong> is seeking a Legal Specialist with 3-5 years of experience in the IT industry to join our team in Technopark, Trivandrum.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Providing sound legal counsel to management and other departments on various legal matters, including contract law, corporate governance, and regulatory compliance.</li>\n<li>Drafting, reviewing, and negotiating contracts, agreements, and other legal documents, ensuring they protect the company's interests and comply with relevant laws.</li>\n<li>Staying updated on relevant legislation and regulations, advising on compliance requirements, and implementing necessary internal processes. This includes identifying and mitigating potential legal risks associated with business decisions and operations.</li>\n<li>Assisting in the development and implementation of company policies related to legal and regulatory compliance.</li>\n<li>Conducting due diligence on investments and other transactions.</li>\n<li>Communicating and negotiating with external parties such as regulators, government agencies, and external counsel.</li>\n<li>Maintaining organized records of legal documents and ensuring their proper storage and retrieval.</li>\n</ul>\n<p><strong>Skills Required:</strong></p>\n<ul>\n<li>Strong understanding of corporate law, contract law, and relevant regulations.</li>\n<li>Ability to analyze complex legal issues, evaluate risks, and provide practical solutions.</li>\n<li>Excellent written and verbal communication skills for drafting legal documents, providing advice, and negotiating with external parties.</li>\n<li>Ability to negotiate effectively in various legal contexts.</li>\n<li>Strong organizational and time management skills to manage multiple tasks and deadlines.</li>\n<li>Meticulous attention to detail in reviewing and drafting legal documents.</li>\n</ul>\n<p><strong>Education and Experience:</strong></p>\n<ul>\n<li>A bachelor’s or master’s degree in law (LLB or equivalent) is typically required.</li>\n<li>Relevant experience in corporate law, either in-house or private practice, is usually essential.</li>\n<li>Specific experience in areas like contract management, compliance, or litigation may be required depending on the specific role.</li>\n</ul>\n<p><em>Please do mention your current compensation, expected compensation and notice period, which will help us revert to you faster.</em></p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Corporate Law</li>\n<li>Contract Law</li>\n<li>Compliance and Risk Management</li>\n<li>Contract Management</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Prophaze Technologies (P) Ltd, 4th Floor, Padmanabham, Technopark Campus, Kazhakuttom, Trivandrum, Kerala 695581</li>\n<li>Website: https://prophaze.com</li>\n<li>Contact Email: ammu.suresh@prophaze.com</li>\n</ul>\n<p><strong>Closing Date:</strong> 12, Aug 2025\n<strong>Job Published:</strong> 11, July 2025</p>",
        "tags": [
            "3-5 Years",
            "Corporate Law",
            "Contract Law",
            "Compliance"
        ],
        "summary": "Prophaze Technologies is hiring a Legal Specialist to provide legal counsel and manage contracts. The role involves compliance, risk management, and policy development."
    },
    {
        "job_title": "Data Engineer",
        "company": "Prophaze Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21728",
        "location": "Technopark",
        "closing_date": "12 Aug 2025",
        "job_description": "<h2>Data Engineer</h2>\n<p><strong>Prophaze Technologies (P) Ltd</strong> is seeking a skilled Data Engineer to join our team in Technopark, Trivandrum.</p>\n<p><strong>Contact:</strong> ammu.suresh@prophaze.com</p>\n<p><strong>Closing Date:</strong> 12, Aug 2025</p>\n<p><strong>About the Role</strong></p>\n<p>We are seeking a skilled Data Engineer to design and implement robust, scalable data pipelines for processing and transforming log data stored in Elasticsearch. You will play a key role in building the data pipeline for our advanced ML-powered behavioural anomaly detection platform.</p>\n<p>This role also involves designing and maintaining the feature engineering pipeline, including integration with a feature store like Feast, and ensuring high-quality, low-latency data delivery for ML models. If you have strong experience in ELK stack, Python, and modern data architectures, and are excited by the intersection of AI and cybersecurity, this is for you.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li><strong>ETL Pipeline Development:</strong><ul>\n<li>Build scalable ETL workflows to extract raw logs from Elasticsearch.</li>\n<li>Clean, normalize, and transform logs into structured features for ML use cases.</li>\n<li>Maintain data freshness with either batch or near real-time workflows.</li>\n</ul>\n</li>\n<li><strong>Feature Store Integration:</strong><ul>\n<li>Design schemas for storing derived features into a feature store (e.g., Feast).</li>\n<li>Collaborate with ML engineers to ensure features are aligned with model requirements.</li>\n<li>Manage historical feature backfills and real-time lookups.</li>\n</ul>\n</li>\n<li><strong>Data Infrastructure and Architecture:</strong><ul>\n<li>Optimize Elasticsearch queries and index management for performance and cost.</li>\n<li>Design data schema, partitioning, and retention policies for long-term storage.</li>\n<li>Ensure data integrity, versioning, and reproducibility of transformed data.</li>\n</ul>\n</li>\n<li><strong>Monitoring and Scaling:</strong><ul>\n<li>Implement monitoring for pipeline performance and failures.</li>\n<li>Scale pipelines to support growing log data (in the scale of 100s of GBs per day).</li>\n</ul>\n</li>\n<li><strong>Collaboration:</strong><ul>\n<li>Work closely with security analysts and AI engineers to translate behavioural insights into engineered features.</li>\n<li>Document data lineage, transformation logic, and data dictionaries.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Minimum Qualifications</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Data Engineering, or related field.</li>\n<li>3+ years of experience in data engineering roles with Python and Elasticsearch.</li>\n<li>Strong experience building data pipelines using:<ul>\n<li>Python (pandas, elasticsearch-py, PySpark is a bonus)</li>\n<li>Orchestration tools (e.g., Apache Airflow, Prefect)</li>\n</ul>\n</li>\n<li>Familiarity with log processing, especially NGINX, Apache logs, HTTP protocols, and cybersecurity-relevant fields (IP, headers, user agents).</li>\n<li>Experience with feature stores such as Feast, Tecton, or custom-built systems.</li>\n<li>Solid understanding of data modeling, versioning, and time-series data handling.</li>\n<li>Knowledge of DevOps practices (Docker, Git, CI/CD workflows).</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>Experience with Kafka, Fluentd or Logstash pipelines.</li>\n<li>Experience deploying data workloads on cloud environments (AWS/GCP/Azure).</li>\n<li>Exposure to anomaly detection or cybersecurity ML systems.</li>\n<li>Familiarity with ML workflows, model deployment, and MLOps.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<p>Python, Elasticsearch, Orchestration tools, Feast, Cloud</p>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Address:</strong> Prophaze Technologies (P) Ltd, 4th Floor, Padmanabham, Technopark Campus, Kazhakuttom, Trivandrum, Kerala 695581</li>\n<li><strong>Website:</strong> <a href=\"https://prophaze.com\">https://prophaze.com</a></li>\n<li><strong>Contact Email:</strong> ammu.suresh@prophaze.com</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Python",
            "Elasticsearch",
            "Feast"
        ],
        "summary": "Prophaze Technologies is looking for a Data Engineer to build and maintain data pipelines, focusing on Elasticsearch and feature engineering. The role involves working with ML models and ensuring data quality."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21727",
        "location": "Technopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Senior Java Developer to join our team. We are a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to clients across the globe for more than 15 years.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 30, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>About Techversant:</strong></p>\n<p>Techversant provides Technology services in key areas such as Digital Transformation, understanding evolving industrial scenarios, investment priorities, and technology disruption. We offer expertise in multiple technology domains, including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, and Business Intelligence.</p>\n<p><strong>What’s Important to Us:</strong></p>\n<p>We value a willingness to learn and contribute to the team. We encourage new ideas and proactive approaches to improving processes and technology.</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Experience in designing, developing, and delivering Java-based applications.</li>\n<li>Competent in code optimization techniques and coding practices and tools.</li>\n<li>Competent in understanding complex functional user stories.</li>\n<li>Demonstrates the ability to solve problems and create solutions independently.</li>\n<li>Addresses problems of systems integration, compatibility, and multiple platforms.</li>\n<li>Capable of communicating with clients to understand technical requirements and present system designs.</li>\n<li>Ability to provide technical estimates for work assignments.</li>\n<li>Provides good visibility and updates on the progress of all activities and tasks, escalating issues in a timely manner.</li>\n<li>Maintains a cohesive spirit to accomplish team responsibilities.</li>\n<li>Proficient enough to be a lead contributor on assigned projects.</li>\n<li>Instructs, assigns, directs, and checks the work of other software developers when required.</li>\n<li>Conducts peer reviews on code quality.</li>\n<li>Ensures Information Security in all perspectives.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>4-8 years of Work experience as a Java Developer or similar role or Handling a team</li>\n<li>Experience in designing, building, and testing core Java and Java EE applications.</li>\n<li>In-depth knowledge of popular Java frameworks and Spring frameworks (Core/MVC/Spring boot, etc.).</li>\n<li>Proficient knowledge and experience in Hibernate and Webservices (REST/SOAP).</li>\n<li>Strong knowledge in queries and data analysis skills.</li>\n<li>Proficiency in Angular or similar frontend frameworks is desirable.</li>\n<li>Working experience with GIT and Artefactory</li>\n<li>Good knowledge of DevOps, Test Driven Development, and CI/CD pipelines is desirable.</li>\n<li>Experience in Microservices Architecture is desirable.</li>\n<li>Experience in working with cloud services is desirable.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Location:</strong></p>\n<p>Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "4-8 Years",
            "Java",
            "Spring Framework",
            "Hibernate"
        ],
        "summary": "Techversant Infotech is looking for a Senior Java Developer to design and deliver Java applications. The role requires experience with Spring, Hibernate, and understanding client requirements."
    },
    {
        "job_title": "Content QA Specialist",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21726",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Content QA Specialist</h2>\n<p>Way.Com India Pvt Ltd is seeking a meticulous and quality-driven Content QA Specialist to join our content team. This role goes beyond simple proofreading—serving as the final checkpoint before publication, you will ensure that every piece of content upholds the highest standards of accuracy, compliance, optimization, and credibility.</p>\n<p><strong>Contact Information:</strong> careers@way.com</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Content Integrity Reviews</strong></p>\n<ul>\n<li>Manually review articles, blogs, and landing pages for grammar, tone, clarity, and consistency with the brand’s voice and style</li>\n<li>Identify and resolve issues such as awkward phrasing, factual errors, and formatting inconsistencies</li>\n</ul>\n<p><strong>SEO and Content Value Assessment</strong></p>\n<ul>\n<li>Ensure content adheres to on-page SEO standards, including proper use of meta tags, header structure, keyword placement, and internal linking</li>\n<li>Detect and flag thin or low-value content that fails to effectively serve the user</li>\n</ul>\n<p><strong>AI and Plagiarism Monitoring</strong></p>\n<ul>\n<li>Perform manual checks and use appropriate tools to detect AI-generated or machine-written content</li>\n<li>Conduct plagiarism scans to ensure content originality and authenticity</li>\n</ul>\n<p><strong>EEAT Compliance Audits</strong></p>\n<ul>\n<li>Verify author credentials and evaluate the credibility of referenced sources</li>\n<li>Ensure content reflects subject matter expertise and includes accurate citations and expert contributions</li>\n</ul>\n<p><strong>Quality Feedback and Process Optimization</strong></p>\n<ul>\n<li>Regularly update and refine the QA checklist to reflect evolving industry standards and best practices</li>\n<li>Provide actionable, constructive feedback to writers and editors to foster continuous content improvement</li>\n</ul>\n<h3>Preferred Skills/Requirements</h3>\n<ul>\n<li>Minimum of <strong>2 years of experience</strong> in content quality assurance, editing, or SEO</li>\n<li>Exceptional <strong>manual editing skills</strong> with <strong>strong attention to detail</strong></li>\n<li>Solid understanding of <strong>SEO fundamentals and Google’s content quality guidelines</strong></li>\n<li>Proven ability to <strong>identify AI-generated content</strong> and assess it for human readability</li>\n<li>Proficient in using tools such as <strong>Grammarly, Copyscape, Copyleaks, Originality.ai</strong>, or similar alternatives</li>\n<li>Skilled at identifying <strong>low-value or thin content</strong> and providing actionable improvement recommendations</li>\n<li>Comfortable operating <strong>in a high-volume, fast-paced content production environment</strong></li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Educational or professional background in <strong>journalism, digital marketing, or technical writing</strong></li>\n<li>Experience working with content management systems like <strong>WordPress</strong></li>\n<li>Familiarity with <strong>structured data, Yoast SEO plugin, and content scoring tools</strong></li>\n<li>Understanding of <strong>content compliance processes and fact-checking workflows</strong></li>\n</ul>",
        "tags": [
            "2+ Years",
            "SEO",
            "Content Quality Assurance",
            "Manual Editing"
        ],
        "summary": "We are seeking a Content QA Specialist to ensure content adheres to quality standards. Responsibilities include SEO optimization, AI detection, and providing actionable feedback for content improvement."
    },
    {
        "job_title": "Engineering Manager - Mobile",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21725",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Engineering Manager - Mobile</h2>\n<p>Way.com is seeking a dynamic Engineering Manager to lead our Mobile Engineering Team. In this pivotal role, you’ll spearhead the development of innovative projects powering our automotive platform. This is a rare opportunity to work with advanced technologies and contribute to shaping the future of mobility.</p>\n<p><strong>Why Join Way.com?</strong></p>\n<p>At Way.com, you’ll become part of a high-impact team dedicated to building solutions that revolutionize how people move, park, and manage their vehicles. We emphasize innovation, accountability, and a shared commitment to delivering exceptional user experiences. Be a part of the future of automotive technology.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Lead a team of iOS and Android engineers to design, develop, deploy, and maintain features for our automotive mobile applications.</li>\n<li>Drive the successful execution and delivery of complex, cross-functional projects in partnership with engineering teams and stakeholders across the U.S. and Canada.</li>\n<li>Take ownership of project planning and execution, ensuring key engineering initiatives are delivered on time and with high quality.</li>\n<li>Collaborate closely with Product, Design, Science, Research, Data Science, Regulatory, and Marketing teams to align goals and deliverables.</li>\n<li>Mentor and support team members in their technical and career development, fostering a culture of growth and learning.</li>\n<li>Offer strong technical leadership, guiding architectural decisions and leading technical discussions, even if not coding daily.</li>\n<li>Make strategic technical decisions with a clear understanding of trade-offs to deliver scalable and maintainable solutions.</li>\n<li>Promote engineering excellence through best practices, define performance benchmarks, and drive ongoing process and operational improvements.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications &amp; Requirements</strong></p>\n<ul>\n<li>Minimum of <strong>7+ years of experience</strong> in software engineering, including at least 2 years in a leadership or engineering management role.</li>\n<li>Bachelor’s degree in Computer Science, Engineering, or MCA.</li>\n<li>Proven experience managing Android and/or iOS engineers.</li>\n<li>Hands-on experience in delivering consumer-facing mobile applications or the backend systems that support them.</li>\n<li>Proficiency with Agile/Scrum development methodologies and a strong understanding of iterative development and process optimization.</li>\n<li>Excellent communication, project management, and delegation skills with a track record of delivering cross-functional projects from concept to launch.</li>\n<li>Strong leadership and people management abilities. You recognize achievements, offer constructive feedback, and foster a growth-oriented culture.</li>\n<li>A collaborative, empathetic, and adaptable mindset, open to feedback and continuous learning.</li>\n</ul>\n<p><strong>Contact Information:</strong>\nEmail: careers@way.com</p>\n<p><strong>Closing Date:</strong> 15, July 2025</p>",
        "tags": [
            "7+ Years",
            "iOS",
            "Android",
            "Agile/Scrum"
        ],
        "summary": "Way.com is looking for an Engineering Manager to lead the Mobile Engineering Team. The role involves leading mobile app development and fostering engineering excellence in automotive solutions."
    },
    {
        "job_title": "Java Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/21724",
        "location": "Technopark",
        "closing_date": "30 Jul 2025",
        "job_description": "<h2>Java Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Java Team Lead to manage our Java development team and ensure the successful design, development, and maintenance of Java-based software solutions. This role requires a strong technical background in Java programming, as well as excellent leadership and strategic skills.</p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, development, and delivery of large-scale web applications.</li>\n<li>Code optimization, coding practices, and static code analysis.</li>\n<li>Understanding complex business requirements.</li>\n<li>Problem-solving and creating solutions independently.</li>\n<li>Addressing systems integration, compatibility, and multiple platforms.</li>\n<li>Communicating with clients to understand technical requirements and present technical solutions and system design.</li>\n<li>Analyzing business requirements, preparing work breakdown structures, and providing technical estimates.</li>\n<li>Providing visibility and updates on the progress of activities and tasks, escalating issues promptly.</li>\n<li>Maintaining a cohesive team spirit.</li>\n<li>Serving as a lead contributor on assigned projects.</li>\n<li>Instructing, assigning, directing, and checking the work of other software developers.</li>\n<li>Conducting peer reviews on code quality.</li>\n<li>Ensuring information security in all perspectives.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>8+ years of experience as a Senior Java Developer and 2 years in a Lead Role.</li>\n<li>In-depth knowledge of popular Java and Spring frameworks (Core/MVC/Spring Boot etc.).</li>\n<li>Proficient knowledge and experience in Webservices (REST/SOAP).</li>\n<li>Strong knowledge in writing stored procedures and SQL queries.</li>\n<li>Experience in modelling databases based on various business requirements.</li>\n<li>Strong knowledge in Data Analysis.</li>\n<li>Proficiency in Angular or similar frontend frameworks is desirable.</li>\n<li>Working experience with GIT and Artefactory.</li>\n<li>Good knowledge of DevOps, Test Driven Development and CI/CD pipelines is desirable.</li>\n<li>Deployment to Cloud Services.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule.</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment.</li>\n<li>Various internal employee rewards programs.</li>\n<li>Opportunities for various bonus programs.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>\n<p><strong>Company Information:</strong>\nTechversant Infotech (P) Ltd\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus\nTrivandrum, Kerala, 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "8+ Years",
            "Java",
            "Spring Framework",
            "Webservices"
        ],
        "summary": "Seeking a Java Team Lead to manage Java development and ensure successful software solutions. Requires strong technical skills in Java and leadership abilities."
    },
    {
        "job_title": "Data Analyst",
        "company": "Prophaze Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/21723",
        "location": "Technopark",
        "closing_date": "12 Aug 2025",
        "job_description": "<h2>Data Analyst</h2>\n<p><strong>Prophaze Technologies (P) Ltd</strong> is seeking a Data Analyst with strong analytical skills and a keen interest in web infrastructure and behavioural analytics to support the development of an ML-based anomaly detection system for NGINX server logs.</p>\n<p><strong>About the Role:</strong>\nYou will play a critical role in extracting domain knowledge from raw logs, identifying behaviour patterns, anomalies, and translating these into insightful features that inform our ML engineers and are used for real-time dashboards. This is not just a reporting role — you will work alongside AI engineers and data engineers to shape how raw data is interpreted and transformed for machine learning and operational use.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Domain Behaviour Analysis:</strong> Analyse large volumes of log data to identify user behaviour patterns, anomalies, and security events. Interpret fields such as IP addresses, geolocation data, user agents, request paths, status codes, and request times to derive meaningful insights.</li>\n<li><strong>Feature Engineering Support:</strong> Collaborate with AI engineers to propose relevant features based on log behaviour and traffic patterns (e.g., burst patterns, unusual request headers, request frequency shifts). Validate engineered features against behavioural patterns and business context. Conduct exploratory data analysis (EDA) to evaluate feature quality and distribution.</li>\n<li><strong>Data Visualization &amp; Dashboards:</strong> Develop data visualizations to represent time-series trends, geo-distributions, traffic behaviour, etc. Collaborate with the frontend/dashboard team to define and test visual requirements and anomaly indicators. Help surface visual insights on anomalies and their severity for analyst consumption.</li>\n<li><strong>Data Quality &amp; Validation:</strong> Identify and address gaps, inconsistencies, and errors in raw logs. Ensure feature logic aligns with real-world HTTP behaviour and use cases.</li>\n<li><strong>Documentation &amp; Knowledge Sharing:</strong> Create documentation that explains observed behavioural patterns, feature assumptions, and traffic insights for use by the wider ML and security team.</li>\n</ul>\n<p><strong>Minimum Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Systems, Data Analytics, Cybersecurity, or a related field.</li>\n<li>Min 3 years of experience in data analysis or analytics roles.</li>\n<li>Proficiency in: SQL, Elasticsearch queries (DSL or Kibana),</li>\n<li>Python for data analysis (pandas, matplotlib, seaborn, plotly)</li>\n<li>Experience working with web server logs (NGINX, Apache) or structured event data.</li>\n<li>Strong analytical thinking — ability to break down complex log behaviour into patterns and outliers.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Familiarity with web security concepts (DDoS, bot detection, HTTP protocol).</li>\n<li>Experience with log analytics platforms (Kibana, Grafana, ELK Stack).</li>\n<li>Understanding of feature engineering concepts in ML pipelines.</li>\n<li>Experience working on or with anomaly detection or security analytics systems.</li>\n</ul>\n<p><strong>Preferred Skills:</strong> SQL, Python, NGINX, Apache, Elasticsearch queries</p>\n<p><strong>Contact Information:</strong>\nProphaze Technologies (P) Ltd\n4th Floor, Padmanabham, Technopark Campus, Kazhakuttom Trivandrum, Kerala 695581\nContact Email: ammu.suresh@prophaze.com\nhttps://prophaze.com</p>\n<p><strong>Closing Date:</strong> 12, Aug 2025\n<strong>Job Published:</strong> 11, July 2025</p>",
        "tags": [
            "3-5 Years",
            "SQL",
            "Python",
            "NGINX"
        ],
        "summary": "Prophaze Technologies is hiring a Data Analyst to analyze web server logs, identify anomalies, and develop insightful features for machine learning. The role involves data visualization, quality validation, and collaboration with AI and data engineers."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21722",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Business Development Manager</h2>\n<p>Way.Com India Pvt Ltd is seeking a goal-oriented Business Development Manager to join our high-energy sales team. If you excel in dynamic environments, have a knack for relationship building, and are passionate about driving revenue through strategic multi-channel outreach, we encourage you to apply.</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Enter a world of innovation and limitless possibilities.</li>\n<li>Be part of something meaningful – Join a vibrant, collaborative team that thrives on innovation and is constantly pushing the limits.</li>\n<li>Get rewarded competitively – We offer a robust compensation and benefits package that recognizes your contributions and success.</li>\n<li>Advance your career – We invest in your professional journey through ongoing learning and development opportunities.</li>\n<li>Create real-world impact – Contribute to groundbreaking projects that shape the future of mobility and improve everyday lives.</li>\n</ul>\n<p><strong>Key Responsibilities</strong></p>\n<p>As a Business Development Manager, you will:</p>\n<ul>\n<li>Proactively seek out and engage with potential clients via outbound calls, emails, and social platforms to qualify new business opportunities.</li>\n<li>Deliver engaging product presentations, effectively communicating the value and benefits of our offerings to prospective customers.</li>\n<li>Keep customer data updated and accurate in the CRM system, ensuring timely follow-ups and strong pipeline management.</li>\n<li>Consistently achieve or exceed sales goals and performance metrics, contributing directly to business growth.</li>\n<li>Build and nurture lasting relationships with existing clients, encouraging repeat business and referrals.</li>\n<li>Prepare detailed sales reports and forecasts for the leadership team to support strategic planning and decision-making.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications</strong></p>\n<ul>\n<li>Proven experience in B2B sales, with a strong track record of achieving targets.</li>\n<li>5–8 years of sales experience; prior experience in the e-commerce sector is highly desirable.</li>\n<li>Exceptional written and verbal communication skills.</li>\n<li>Strong negotiation and relationship-building abilities.</li>\n<li>Self-motivated, goal-oriented, and capable of working independently with minimal supervision.</li>\n<li>Proficient in using CRM software (e.g., Zoho) and the Microsoft Office Suite.</li>\n<li>Resilient in the face of rejection, with the ability to maintain a positive attitude.</li>\n<li>A Bachelor’s degree in Business, Marketing, or a related field.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>Email: careers@way.com</p>\n<p><strong>Address</strong></p>\n<p>Way.Com India Pvt Ltd, 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>",
        "tags": [
            "5-8 Years",
            "B2B Sales",
            "CRM Software",
            "E-commerce"
        ],
        "summary": "Seeking a Business Development Manager to drive revenue through multi-channel outreach and relationship building. The ideal candidate will have experience in B2B sales and CRM software."
    },
    {
        "job_title": "Data Architect/Manager",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21721",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Data Architect/Manager</h2>\n<p>Way.Com is seeking a highly skilled and driven Data Architect/Manager to join our dynamic team. This role offers a unique blend of deep technical involvement and leadership responsibility—perfect for a candidate eager to shape both the technical vision and strategic roadmap of our data architecture initiatives.</p>\n<p><strong>About Way</strong></p>\n<p>Way is redefining car ownership. As the leading Auto Super App, we help millions of drivers across the United States save on car expenses—ranging from insurance and parking to maintenance and roadside assistance. Our enterprise solutions extend these benefits to cities, fleets, and major organizations nationwide.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p>As our Data Architect/Manager, you will:</p>\n<ul>\n<li>Lead the design, implementation, and maintenance of robust and scalable database models, schemas, and overall data infrastructure.</li>\n<li>Manage and mentor a team of data engineers, analysts, and key stakeholders, promoting a culture of technical excellence and collaboration.</li>\n<li>Translate business needs into technical solutions by working cross-functionally with product, engineering, design, and other teams.</li>\n<li>Evaluate, select, and manage database technologies and tools aligned with the organization's evolving data strategy.</li>\n<li>Monitor system performance, data lifecycle, and integrity, ensuring reliability, scalability, and efficiency.</li>\n<li>Enforce data governance standards and ensure compliance with relevant privacy laws and data protection regulations.</li>\n<li>Provide strategic guidance for data-driven initiatives, supporting executive-level decision-making through a well-architected data foundation.</li>\n<li>Drive cross-functional data initiatives, championing best practices across departments.</li>\n<li>Communicate project progress, risks, and roadblocks to leadership, and proactively resolve issues to ensure successful execution.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Information Technology, Data Science, or a related discipline.</li>\n<li>Over 8 years of professional experience in database development, data modeling, and data architecture.</li>\n<li>Proven track record of leading teams or managing technical projects successfully.</li>\n<li>Relevant certifications such as CDMP, TOGAF, or similar are highly regarded.</li>\n<li>Strong foundational knowledge of RDBMS concepts, with hands-on experience in both relational and NoSQL databases.</li>\n<li>Experience in the Networking or Security domain is a plus.</li>\n<li>Practical experience in consuming APIs and designing multi-tenant database systems.</li>\n<li>Proficiency with technologies like Oracle, MySQL, Cassandra, Talend, ETL tools, Hadoop, etc.</li>\n<li>Solid understanding of database security, compliance requirements, and regulatory standards.</li>\n</ul>\n<p><strong>Skills Required</strong></p>\n<ul>\n<li>Strong leadership and team management abilities, with a focus on motivating, mentoring, and growing high-performing technical teams.</li>\n<li>Excellent analytical thinking and problem-solving skills.</li>\n<li>Effective communication skills, capable of clearly conveying complex technical ideas to both technical and non-technical audiences.</li>\n<li>High attention to detail to ensure accuracy, performance, and data security in system architecture.</li>\n<li>Ability to manage competing priorities, balance technical work with leadership responsibilities, and consistently deliver results on time.</li>\n<li>Strong project and stakeholder management skills with a focus on achieving measurable business impact.</li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<p>careers@way.com</p>",
        "tags": [
            "8+ Years",
            "Data Architecture",
            "RDBMS",
            "Data Modeling"
        ],
        "summary": "Way.Com is hiring a Data Architect/Manager to lead data infrastructure initiatives and mentor a team of data professionals. The role involves designing database solutions and ensuring data governance."
    },
    {
        "job_title": "iOS Technical Lead",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21720",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>iOS Technical Lead</h2>\n<p><strong>Way.Com India Pvt Ltd is seeking an experienced iOS Technical Lead to join our team!</strong></p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the architectural planning, design, and development of iOS applications using Swift.</li>\n<li>Partner with Product and Design teams to translate business needs into scalable technical solutions.</li>\n<li>Ensure high performance, reliability, and responsiveness across a wide range of iOS devices.</li>\n<li>Mentor and support junior and mid-level iOS developers through code reviews and skill development.</li>\n<li>Uphold high standards in code quality, testing practices, and documentation throughout the development process.</li>\n<li>Collaborate with backend and API teams to design and integrate scalable, efficient services.</li>\n<li>Drive continuous improvement and innovation across the mobile technology stack.</li>\n<li>Take full ownership of feature development, from ideation to release and performance enhancement.</li>\n<li>Stay current with the latest developments, best practices, and updates in the iOS ecosystem.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li><strong>10+ years of experience</strong> in mobile application development, with a minimum of <strong>6 years specializing in iOS development</strong>.</li>\n<li>Expertise in <strong>Swift, UIKit, SwiftUI, and Apple’s Human Interface Guidelines</strong>.</li>\n<li>Strong knowledge of <strong>RESTful APIs, JSON parsing, and third-party library integration</strong>.</li>\n<li>Experience in architecting complex mobile applications using <strong>modular design patterns (MVVM, MVI, MVP)</strong>.</li>\n<li>Proficiency in CI/CD pipelines, automated testing, code reviews, and <strong>App Store deployment processes</strong>.</li>\n<li>Proven track record of leading teams and mentoring iOS developers.</li>\n<li>Familiarity with tools such as <strong>Firebase, Mixpanel, or similar analytics and crash reporting platforms</strong>.</li>\n<li>Understanding of web app ecosystems and cross-platform compatibility.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Experience with <strong>Core Bluetooth, Core Location, or real-time services integration</strong> (e.g., EV or roadside assistance).</li>\n<li>Background in mobility, transportation, or automotive technology platforms.</li>\n<li>Familiarity with <strong>Kotlin Multiplatform or other cross-platform frameworks</strong>.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Swift",
            "RESTful APIs",
            "UIKit"
        ],
        "summary": "We seek a skilled iOS Technical Lead to drive development and mentor junior developers. The role involves architectural planning, ensuring app performance, and collaborating with cross-functional teams."
    },
    {
        "job_title": "Senior Java Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21719",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Senior Java Developer</h2>\n<p>Way Dot Com (P) Ltd is seeking a Senior Java Developer to join our team. You will design, develop, and maintain scalable and high-performing Java applications using the Spring Boot framework. This role requires strong proficiency in Java and experience with RESTful APIs and MySQL databases.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain scalable and high-performing Java applications using the Spring Boot framework.</li>\n<li>Collaborate closely with Product Owners, Solution Architects, and cross-functional teams to translate business requirements into effective technical solutions.</li>\n<li>Create and integrate RESTful APIs to facilitate efficient system communication and enhance application capabilities.</li>\n<li>Continuously refactor and improve existing codebases to optimize performance, scalability, and long-term maintainability.</li>\n<li>Perform detailed code reviews, uphold best coding practices, and mentor junior developers to foster professional growth within the team.</li>\n<li>Stay updated with the latest tools, technologies, and best practices within the Java ecosystem to drive innovation and efficiency.</li>\n<li>Identify and troubleshoot complex software issues to ensure system reliability and a seamless end-user experience.</li>\n<li>Follow established development methodologies, coding standards, and company guidelines to deliver high-quality software solutions.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent professional experience).</li>\n<li>Minimum of 5+ years of professional experience in Java development, with strong hands-on expertise in Spring Boot and MySQL.</li>\n<li>In-depth understanding of Java SE and Java EE concepts, including multithreading, design patterns, and JVM internals.</li>\n<li>Proven experience in RESTful API design, development, and integration.</li>\n<li>Proficient in working with MySQL or other relational databases, with the ability to write and optimize complex SQL queries.</li>\n<li>Hands-on experience with version control systems, particularly Git.</li>\n<li>Familiarity with Agile methodologies (e.g., Scrum, Kanban) and experience working in Agile development environments.</li>\n<li>Strong problem-solving, debugging, and analytical skills, capable of addressing complex technical challenges.</li>\n<li>Excellent written and verbal communication skills with the ability to thrive in a collaborative, team-oriented environment.</li>\n<li>Demonstrated ability to mentor junior developers and contribute technical leadership to development teams.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience working with microservices architecture and Docker containerization.</li>\n<li>Working knowledge of cloud platforms, such as AWS or Microsoft Azure.</li>\n<li>Familiarity with CI/CD pipelines and automation tools (e.g., Jenkins, GitLab CI).</li>\n<li>Experience with unit testing frameworks, such as JUnit or TestNG.</li>\n<li>Proven track record of building scalable, high-performance applications in production-grade environments.</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Innovative Projects: Work on cutting-edge technology solutions that make a real-world impact.</li>\n<li>Collaborative Culture: Join a team that values knowledge-sharing, mentorship, and continuous improvement.</li>\n<li>Career Growth: Take advantage of ample learning opportunities, structured growth paths, and leadership development.</li>\n<li>Recognition &amp; Rewards: Be part of an organization that values your contributions and celebrates your successes.</li>\n<li>Stability &amp; Vision: Join a future-focused company backed by a strong leadership team and a clear long-term vision.</li>\n</ul>\n<p>Be part of something meaningful—grow your career while helping us build world-class software solutions.</p>\n<p><strong>Contact Information:</strong>\ncareers@way.com</p>\n<p><strong>Closing Date:</strong> 15, July 2025</p>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "MySQL",
            "RESTful API"
        ],
        "summary": "Seeking a Senior Java Developer to design and develop scalable Java applications using Spring Boot. Requires 5+ years of Java experience and expertise in RESTful APIs and MySQL."
    },
    {
        "job_title": "Senior iOS Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21718",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Senior iOS Developer</h2>\n<p>Way.Com India Pvt Ltd is seeking a skilled Senior iOS Developer to join our team.</p>\n<p><strong>Contact:</strong> careers@way.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, build, and maintain high-performing iOS applications using <strong>Swift</strong>, <strong>Objective-C</strong>, and <strong>SwiftUI</strong>.</li>\n<li>Develop scalable and maintainable architectures utilizing <strong>MVVM</strong> and <strong>MVC</strong> design patterns.</li>\n<li>Apply <strong>SOLID</strong> principles to promote clean, sustainable development and architectural integrity.</li>\n<li>Enhance app performance through effective memory management and advanced multithreading techniques.</li>\n<li>Build responsive, adaptive UIs using <strong>Auto Layout</strong> to ensure consistent user experiences across all iOS devices.</li>\n<li>Integrate and manage push notification systems to provide timely and personalized user alerts.</li>\n<li>Implement deep linking mechanisms to enable seamless navigation between app content and external sources.</li>\n<li>Conduct comprehensive code reviews, maintain high coding standards, and mentor junior team members to support skill development.</li>\n<li>Write and maintain reliable unit tests to safeguard app functionality and ensure ongoing stability.</li>\n<li>Utilize <strong>Apple Maps</strong> and <strong>Core Location</strong> frameworks to develop intuitive, location-based features.</li>\n<li>Integrate <strong>Firebase</strong> for real-time synchronization, crash reporting, and analytics tracking.</li>\n<li>Guarantee compliance with App Store policies and manage the end-to-end submission, review, and release process.</li>\n<li>Work closely with product managers, designers, and backend developers to deliver feature-rich, high-quality iOS applications.</li>\n<li>Maintain an efficient development workflow through version control tools like <strong>Git</strong>.</li>\n</ul>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li>Minimum of <strong>5 years</strong> of hands-on experience in <strong>iOS application development</strong>.</li>\n<li>Strong proficiency in <strong>Swift</strong> and <strong>Objective-C</strong>, with the ability to write clean, efficient, and maintainable code.</li>\n<li>In-depth understanding and practical experience with architectural patterns such as <strong>MVVM</strong> and <strong>MVC</strong>.</li>\n<li>Proven ability to apply <strong>SOLID principles</strong> to build scalable, modular, and testable codebases.</li>\n<li>Strong knowledge of memory management and multithreading for optimal application performance.</li>\n<li>Extensive experience in building user interfaces using <strong>SwiftUI</strong>, <strong>Auto Layout</strong>, and creating responsive, adaptive UIs.</li>\n<li>Proficient in implementing <strong>Push Notification frameworks</strong> and enabling <strong>deep linking</strong> to enhance user engagement and navigation.</li>\n<li>Hands-on experience with version control systems, particularly <strong>Git</strong>, for collaborative development and release workflows.</li>\n<li>Demonstrated ability to conduct thorough code reviews to ensure adherence to coding standards and best practices.</li>\n<li>Skilled in writing and maintaining unit tests to support application stability, performance, and reliability.</li>\n<li>Practical experience with <strong>Apple Maps</strong>, <strong>Core Location</strong>, and building location-based services.</li>\n<li>Familiarity with <strong>Firebase</strong>, including integration of analytics, crash reporting, and real-time data features.</li>\n<li>Solid understanding of <strong>App Store guidelines</strong> and experience managing the app submission and review process.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with Continuous Integration/Continuous Deployment (<strong>CI/CD</strong>) pipelines and tools.</li>\n<li>Working knowledge of <strong>Agile development methodologies</strong> and collaborative team practices.</li>\n<li>Strong analytical and problem-solving skills, with the ability to work independently and within a team.</li>\n<li>Experience in performance tuning and optimization of iOS applications for improved efficiency and user experience.</li>\n</ul>\n<p><strong>Closing Date:</strong> 15, July 2025</p>",
        "tags": [
            "5+ Years",
            "Swift",
            "Objective-C",
            "Firebase"
        ],
        "summary": "We are looking for a Senior iOS Developer to design and build high-performing applications. The role involves using Swift, Objective-C, and Firebase to deliver quality iOS applications."
    },
    {
        "job_title": "Senior Android Developer",
        "company": "Way Dot Com (P) Ltd",
        "url": "https://technopark.org/job-details/21717",
        "location": "Technopark",
        "closing_date": "15 Jul 2025",
        "job_description": "<h2>Senior Android Developer</h2>\n<p><strong>Way.Com India Pvt Ltd</strong></p>\n<p><strong>Location:</strong> 4th Floor, Yamuna, Technopark Phase-III, Thiruvananthapuram, 695583</p>\n<p><strong>Website:</strong> <a href=\"http://www.way.com\">http://www.way.com</a></p>\n<p><strong>Closing Date:</strong> July 15, 2025</p>\n<p><strong>Job Published:</strong> July 11, 2025</p>\n<p><strong>Contact Email:</strong> careers@way.com</p>\n<h3>Key Requirements:</h3>\n<ul>\n<li>Develop and maintain high-quality Android applications using <strong>Kotlin</strong> and <strong>Jetpack Compose</strong>.</li>\n<li>Collaborate effectively with cross-functional teams to define, design, and deliver innovative features.</li>\n<li>Ensure optimal application performance, responsiveness, and reliability across a range of devices.</li>\n<li>Continuously optimize applications for speed, efficiency, and scalability.</li>\n<li>Stay current with emerging trends, tools, and best practices in Android development.</li>\n<li>Write clean, modular, and testable code, adhering to established Android development standards.</li>\n<li>Provide technical leadership and mentorship to junior developers, fostering a culture of growth and collaboration.</li>\n<li>Identify, diagnose, and resolve complex bugs and performance issues efficiently.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li>Minimum <strong>5 years of professional experience</strong> in Android application development.</li>\n<li>Proficiency in Kotlin, with practical expertise in <strong>Jetpack Compose</strong> for building modern UIs.</li>\n<li>Strong understanding of <strong>Android architecture components</strong> including <strong>ViewModel</strong>, <strong>LiveData</strong>, <strong>Room</strong>, etc.</li>\n<li>Proven experience in integrating and consuming <strong>RESTful APIs</strong> and utilizing <strong>third-party libraries</strong> effectively.</li>\n<li>Solid grasp of <strong>UI/UX design principles</strong> and <strong>Material Design</strong> guidelines, with the ability to create intuitive and responsive user interfaces.</li>\n<li>Proficient in using <strong>Android Studio</strong>, <strong>Gradle</strong>, and related development tools.</li>\n<li>Experience with <strong>unit testing</strong> and familiarity with frameworks such as <strong>JUnit</strong> and <strong>Mockito</strong>.</li>\n<li>Knowledge of <strong>CI/CD pipelines</strong> and experience with <strong>version control systems</strong>, particularly <strong>Git</strong>.</li>\n<li>Demonstrated <strong>problem-solving abilities</strong> and the capability to work independently as well as collaboratively in a team environment.</li>\n<li>Excellent <strong>verbal and written communication skills</strong>.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Hands-on experience with <strong>Kotlin Coroutines</strong> and <strong>Flows</strong> for managing asynchronous tasks.</li>\n<li>Familiarity with <strong>Android Jetpack libraries</strong> such as <strong>Navigation</strong>, <strong>Paging</strong>, and <strong>WorkManager</strong>.</li>\n<li>Experience with <strong>Firebase</strong> or other cloud-based backend services.</li>\n<li>Exposure to <strong>Kotlin Multiplatform Mobile (KMM)</strong> or experience in developing <strong>cross-platform applications</strong>.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Kotlin",
            "Jetpack Compose",
            "Android Architecture"
        ],
        "summary": "Seeking a Senior Android Developer to build and maintain high-quality Android applications. The candidate should have strong experience with Kotlin, Jetpack Compose, and RESTful APIs."
    },
    {
        "job_title": "Node.js Developer",
        "company": "Sjs Business Solution (P) Ltd",
        "url": "https://technopark.org/job-details/21716",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Node.js Developer</h2>\n<p>SJS Business Solution (P) Ltd is seeking a skilled Node.js Developer to join our team at Technopark Phase I Campus, Trivandrum.</p>\n<p><strong>Contact:</strong> career@sodisys.io\n<strong>Website:</strong> https://www.sodisys.de</p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a Node.js Developer with 2 years of experience to design, develop, and maintain server-side applications using Node.js (NestJS).</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain server-side applications using Node.js (NestJS).</li>\n<li>Implement scalable and high-performance APIs.</li>\n<li>Collaborate with front-end developers to integrate user-facing elements with server-side logic.</li>\n<li>Ensure seamless communication between the server and the front-end components.</li>\n<li>Work with databases (e.g. MySQL) to store, retrieve, and manipulate data efficiently.</li>\n<li>Optimise database queries for performance.</li>\n<li>Write efficient, reusable, and modular code.</li>\n<li>Identify and address performance bottlenecks and other issues.</li>\n<li>Develop and consume RESTful services for various functionalities.</li>\n<li>Implement API endpoints and ensure they align with project requirements.</li>\n<li>Write unit tests and conduct thorough testing to ensure the reliability and robustness of the code.</li>\n<li>Debug and troubleshoot issues, providing timely resolutions.</li>\n<li>Utilise version control systems (e.g., Git) for code versioning and collaboration.</li>\n<li>Work closely with cross-functional teams, including front-end developers, designers, and product managers, to deliver high-quality software solutions.</li>\n<li>Implement security best practices to safeguard applications from potential vulnerabilities.</li>\n<li>Stay updated on security trends and incorporate necessary measures.</li>\n<li>Create and maintain comprehensive technical documentation.</li>\n<li>Ensure that code documentation and comments are clear and up-to-date.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, or related field.</li>\n<li>Proven experience as a Node.js Developer or similar role.</li>\n<li>Strong proficiency in JavaScript and Node.js.</li>\n<li>Experience with server-side frameworks (e.g., Express.js, NestJS).</li>\n<li>Knowledge of asynchronous programming and event-driven architecture.</li>\n<li>Familiarity with front-end technologies (HTML, CSS, JavaScript).</li>\n<li>Experience with databases and data modelling.</li>\n<li>Understanding of RESTful APIs and web services.</li>\n<li>Proficient understanding of code versioning tools, especially Git.</li>\n<li>Excellent problem-solving and communication skills.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Node.js",
            "NestJS",
            "RESTful APIs"
        ],
        "summary": "Seeking a Node.js Developer to build scalable server-side applications. The candidate will develop APIs, manage databases, and work with cross-functional teams."
    },
    {
        "job_title": "Account Manager",
        "company": "Marvelloux Apps (P) Ltd",
        "url": "https://technopark.org/job-details/21715",
        "location": "Technopark",
        "closing_date": "31 Jul 2025",
        "job_description": "<h2>Account Manager</h2>\n<p><strong>Marvelloux Apps (P) Ltd</strong> is looking for a skilled UI/UX Program Manager to lead design and development projects.</p>\n<p><strong>Contact:</strong> hr@marvelloux.com</p>\n<p><strong>About Marvelloux Apps:</strong></p>\n<ul>\n<li>Ground Floor, Gayatri Building, Technopark Phase I, Trivandrum, 695581</li>\n<li><a href=\"http://www.marvelloux.com\">http://www.marvelloux.com</a></li>\n</ul>\n<p><strong>Brief Description:</strong></p>\n<p>We’re on the lookout for a skilled UI/UX Program Manager with 1 – 2 years of experience leading design and development projects. If you have a knack for managing creative teams, a solid understanding of UI/UX principles, and top-notch project management skills, we’d love to hear from you! In this role, you’ll juggle multiple projects, ensuring they’re completed on time, meet the highest standards, and deliver amazing digital experiences. If you’re passionate about creating impact and keeping things organized, this is the perfect fit for you!</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ol>\n<li><strong>Project Planning &amp; Execution:</strong><ul>\n<li>Oversee the full project lifecycle, including planning, execution, and delivery of UI/UX projects.</li>\n<li>Define project goals, deliverables, timelines, and success criteria in collaboration with stakeholders.</li>\n<li>Manage project scope and mitigate scope creep through proactive communication.</li>\n</ul>\n</li>\n<li><strong>Team Management &amp; Coordination:</strong><ul>\n<li>Lead cross-functional teams, including designers, developers, and testers, ensuring seamless collaboration.</li>\n<li>Assign tasks, set priorities, and monitor progress to ensure timely delivery.</li>\n<li>Provide clear instructions and feedback to team members to maintain alignment with project objectives.</li>\n</ul>\n</li>\n<li><strong>Client Interaction:</strong><ul>\n<li>Act as the main point of contact for clients, ensuring their vision is translated into actionable project plans.</li>\n<li>Conduct regular status updates, gather feedback, and manage client expectations.</li>\n<li>Present project deliverables, including prototypes and final designs, to clients.</li>\n</ul>\n</li>\n<li><strong>Quality Assurance &amp; Usability:</strong><ul>\n<li>Ensure all project outputs align with UI/UX best practices and meet usability standards.</li>\n<li>Facilitate user testing sessions and incorporate feedback into design iterations.</li>\n<li>Maintain consistency across designs in line with brand guidelines and user needs.</li>\n</ul>\n</li>\n<li><strong>Risk &amp; Budget Management:</strong><ul>\n<li>Identify risks early and develop contingency plans to address them.</li>\n<li>Manage project budgets, ensuring cost efficiency while maintaining quality.</li>\n</ul>\n</li>\n<li><strong>Continuous Improvement:</strong><ul>\n<li>Analyze project performance and implement process improvements for future initiatives.</li>\n<li>Stay updated with the latest trends and tools in UI/UX design and project management.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Design, Project Management, Computer Science, or related fields.</li>\n<li>1–2 years of experience managing UI/UX or digital design projects.</li>\n<li>Proven experience with project management methodologies (Agile, Scrum, or Waterfall).</li>\n<li>Familiarity with design tools such as Figma, Sketch, or Adobe XD.</li>\n<li>Proficiency in project management tools like Jira, Asana, Trello, or similar platforms.</li>\n</ul>\n<p><strong>Mandatory Requirements</strong></p>\n<ul>\n<li>Strong understanding of UI/UX principles and user-centered design processes is a must.</li>\n<li>Excellent communication and interpersonal skills for team collaboration and client interaction.</li>\n<li>Must have prior experience as a Program Manager in a UI/UX design studio or any design studio</li>\n</ul>\n<p><strong>Why Work With Marvelloux</strong></p>\n<ul>\n<li>Opportunity to work on impactful projects that shape digital experiences.</li>\n<li>Collaborative and innovative team environment.</li>\n<li>Room for career advancement and professional growth.</li>\n</ul>\n<p><strong>Closing Date:</strong> 31, July 2025</p>\n<p><strong>Job Published:</strong> 11, July 2025</p>",
        "tags": [
            "1-2 Years",
            "UI/UX",
            "Project Management",
            "Figma"
        ],
        "summary": "Marvelloux Apps is hiring a UI/UX Program Manager to oversee design and development projects. The role involves team leadership, client interaction, and ensuring high-quality digital experiences."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Crayo Tech Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21714",
        "location": "Technopark",
        "closing_date": "25 Jul 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p>Crayo Tech Business Solutions (P) Ltd is seeking a motivated and results-driven Business Development Executive to join our dynamic team. </p>\n<p><strong>Contact Information:</strong> careers@crayotech.com</p>\n<p><strong>Company Address:</strong>\nKerala Startup Mission,\nG3B, Thejaswini, Technopark Campus,\nKariyavattom, Trivandrum, Kerala, 695581\nhttp://www.crayotech.com/india</p>\n<p><strong>Closing Date:</strong> 25, July 2025\n<strong>Job Published:</strong> 11, July 2025</p>\n<p><strong>Job Summary:</strong>\nThe ideal candidate will be responsible for identifying new business opportunities, developing relationships with potential clients, and driving revenue growth.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Identify and research potential clients and market opportunities.</li>\n<li>Build and maintain strong relationships with existing and prospective clients.</li>\n<li>Conduct market analysis to understand industry trends and competitive landscape.</li>\n<li>Develop and deliver compelling presentations and proposals to clients.</li>\n<li>Collaborate with internal teams to align offerings with client needs.</li>\n<li>Achieve monthly and quarterly sales targets and contribute to overall revenue growth.</li>\n<li>Attend industry events, conferences, and networking functions to promote the company and generate leads.</li>\n<li>Prepare and maintain detailed reports on sales activities, pipeline status, and market feedback.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, or a related field.</li>\n<li>Proven experience in business development, sales, or a similar role.</li>\n<li>Strong understanding of sales principles and customer relationship management (CRM) software.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Strong analytical and problem-solving skills.</li>\n</ul>\n<p>Email your resume to careers@crayotech.com with the Subject: \"BDE - Candidate Name\"</p>",
        "tags": [
            "1+ Years",
            "Business Development",
            "Sales",
            "CRM Software"
        ],
        "summary": "Crayo Tech is looking for a Business Development Executive to identify opportunities, build client relationships, and drive revenue. The candidate will achieve sales targets and conduct market analysis."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/21713",
        "location": "Technopark",
        "closing_date": "19 Jul 2025",
        "job_description": "<h2>Telesales Executive</h2>\n<p><strong>Trainonex Solutions (P) Ltd</strong>\n1st Floor, M Squared Building, Annex 1, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\nwww.trainonexsolutions.in</p>\n<p><strong>Closing Date:</strong> 19, July 2025\n<strong>Job Published:</strong> 11, July 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li>Experience: 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Male and Female Candidates preferred</li>\n<li>Have fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Customer interaction</li>\n<li>Communication</li>\n<li>Time management</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Customer Interaction",
            "Communication",
            "Time Management"
        ],
        "summary": "Join Trainonex Solutions as a Telesales Executive to drive sales and build customer relationships. Immediate joiners are needed for this office-based role."
    }
]