[
    {
        "job_title": "AI-Developer.",
        "company": "Difinity Digital",
        "url": "https://infopark.in/company-jobs/details/20302/495",
        "location": "Infopark",
        "closing_date": "11 Sep 2025",
        "job_description": "<h2>AI Developer</h2>\n<p><strong>Job Summary:</strong></p>\n<p>We are seeking a skilled and innovative AI Developer to design, develop, and implement AI-driven applications and solutions. The ideal candidate will have strong expertise in machine learning, deep learning, natural language processing, and software development. You will work closely with data scientists, engineers, and product teams to build intelligent systems that enhance business operations and user experiences.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and deploy AI/ML models for real-world applications.</li>\n<li>Collaborate with data scientists to collect, clean, and preprocess data for training and testing models.</li>\n<li>Implement deep learning architectures (CNNs, RNNs, Transformers, etc.) for tasks like image recognition, NLP, and recommendation systems.</li>\n<li>Optimize and fine-tune models for performance, scalability, and accuracy.</li>\n<li>Integrate AI solutions into applications using APIs, frameworks, and cloud platforms (AWS, Azure, GCP).</li>\n<li>Research emerging AI technologies and recommend innovative approaches to solve business challenges.</li>\n<li>Maintain and improve existing AI models, ensuring continuous learning and adaptability.</li>\n<li>Work with cross-functional teams to understand requirements and translate them into AI-driven solutions.</li>\n<li>Document development processes, models, and system designs for knowledge sharing and reproducibility.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with large language models (LLMs), generative AI, or transformers.</li>\n<li>Knowledge of API development and integration.</li>\n<li>Exposure to DevOps tools (Docker, Kubernetes, Git, CI/CD).</li>\n<li>Contributions to AI research papers, open-source projects, or Kaggle competitions.</li>\n</ul>\n<p><strong>Experience Level:</strong></p>\n<p>2–6 years (for mid-level) / Freshers with strong AI projects can also be considered.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at mitty.j@difinitydigital.com</p>",
        "tags": [
            "2-6 Years",
            "Machine Learning",
            "Deep Learning",
            "Natural Language Processing"
        ],
        "summary": "We need an AI Developer to design and implement AI solutions. They should have skills in machine learning and deep learning to enhance business operations."
    },
    {
        "job_title": "Senior Project Coordinator & Analyst",
        "company": "Fingent Global Solutions",
        "url": "https://infopark.in/company-jobs/details/20328/83",
        "location": "Infopark",
        "closing_date": "11 Sep 2025",
        "job_description": "<h2>Senior Project Coordinator &amp; Analyst</h2>\n<p><strong>Roles &amp; Responsibilities:</strong></p>\n<ul>\n<li>Ability to understand customer’s problems, create detailed business analysis documents, conceptualize the solution, and present the same to customers.</li>\n<li>Communicate effectively with internal and external stakeholders in order to maintain transparency and ensure that the solution meets customer’s needs.</li>\n<li>Ability to conceptualize user scenarios and capture these as workflows and wireframes.</li>\n<li>Coordinate with design experts to create mockups for presenting solution recommendations to clients.</li>\n<li>Monitor the project progress and report the risks and issues in a timely manner.</li>\n<li>Ability to identify changes to the agreed scope and communicate with the customer and relevant stakeholders.</li>\n<li>Ability to ensure the project is completed within budget, scope, and schedule constraints.</li>\n<li>Ability to manage multiple priorities in a fast-paced environment and deliver results.</li>\n</ul>\n<p><strong>Skills Required:</strong></p>\n<ul>\n<li>Good understanding of SDLC and project management methodologies.</li>\n<li>Mandatory software requirement analysis experience with good written and verbal communication.</li>\n<li>Interpersonal skills, Critical thinking, and Strong problem-solving skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@fingent.com</p>",
        "tags": [
            "3+ Years",
            "SDLC",
            "Project Management",
            "Software Requirement Analysis"
        ],
        "summary": "Seeking a Senior Project Coordinator & Analyst to understand customer problems and manage projects within budget, scope, and schedule. Requires strong communication and analytical skills."
    },
    {
        "job_title": "Lead Generation Executive",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/20333/182",
        "location": "Infopark",
        "closing_date": "11 Sep 2025",
        "job_description": "<h2>Lead Generation Executive</h2>\n<p>We are seeking a proactive and driven Lead Generation Executive to support our sales team by identifying and qualifying high-quality leads. </p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Research and identify potential leads through LinkedIn, online directories, web tools, databases, and other platforms.</li>\n<li>Qualify leads based on predefined criteria to ensure alignment with our service offerings.</li>\n<li>Collaborate closely with the sales team to understand target markets and ideal customer profiles.</li>\n<li>Manage and optimize lead generation campaigns to ensure a consistent flow of qualified leads.</li>\n<li>Stay up to date with industry trends, competitor activities, and emerging tools for lead generation.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>2–4 years of experience in lead generation or inside sales, preferably in IT services or products.</li>\n<li>Proficient in LinkedIn Sales Navigator, CRM systems, and other lead generation platforms</li>\n<li>Excellent communication and interpersonal skills</li>\n<li>Strong research and analytical capabilities with the ability to qualify prospects effectively</li>\n<li>Flexible and adaptive to evolving market trends and demands</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@2hatslogic.com</p>",
        "tags": [
            "2-4 Years",
            "Lead Generation",
            "LinkedIn Sales Navigator",
            "CRM Systems"
        ],
        "summary": "We need a Lead Generation Executive for identifying and qualifying high-quality leads. The ideal candidate will have experience in IT services or product sales."
    },
    {
        "job_title": "Android Developer (3 yrs of experience)",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20320/157",
        "location": "Infopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Android Developer</h2>\n<p>Tranzmeo is looking for an Android Developer to join our distributed, multifunctional team. If you enjoy working on apps, AI, and ML applications, we would love to hear from you.</p>\n<p>We hire for culture, passion, and the ability to learn quickly. You’ll do well here if you are passionate about quality and craftsmanship and are self-driven.</p>\n<p><strong>No. of Openings:</strong> 1</p>\n<p><strong>What we are looking for in you:</strong></p>\n<ul>\n<li>Minimum 1-3 years of experience</li>\n<li>Bachelor's degree in computer science or IT</li>\n<li>Must have good analytical and problem-solving skills</li>\n<li>Ability to work independently</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>IDE – Android Studio</li>\n<li>Programming Language – Java</li>\n<li>Good at using git</li>\n<li>UI – Linear, Relative, Constraints layout, etc.</li>\n<li>Good knowledge of Kotlin</li>\n<li>Design Patterns – MVP, MVVM, etc.</li>\n<li>Client-server communication</li>\n<li>Local data storage</li>\n<li>Knowledge of unit test cases resolves crashes and memory-related issues</li>\n<li>Aware of app store build release process</li>\n<li>Understanding of app performance memory footprint optimization</li>\n<li>Knows how to write unit test cases</li>\n<li>Knows Manual Memory Management Rules.</li>\n<li>Knows how to debug and resolve crashes, exceptions, etc.</li>\n<li>Aware of the app store build release process.</li>\n</ul>\n<p><strong>Roles &amp; Responsibilities:</strong></p>\n<ul>\n<li>Design, build, ship, and maintain mobile apps on the Android platform.</li>\n<li>Work with the team to design new product features.</li>\n<li>Help maintain code quality and review others’ code.</li>\n<li>Proactively address performance issues and bugs.</li>\n<li>Raise your own and the team's skill level every day by growing and learning.</li>\n<li>Use available project management and communication.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "1-3 Years",
            "Android Studio",
            "Kotlin",
            "Java"
        ],
        "summary": "Tranzmeo is seeking an Android Developer to design, build, and maintain mobile apps. The role involves working with new technologies and addressing performance issues."
    },
    {
        "job_title": "Data Science Intern",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20321/157",
        "location": "Infopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Data Science Intern</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Explain predictive models to various business users and make recommendations to drive business strategy.</li>\n<li>Make recommendations to resolve application performance problems.</li>\n<li>Implement data processing methods and tools.</li>\n<li>Collaborate with product leaders, subject matter experts, and decision-makers to develop success criteria and optimize new products, features, policies, and models.</li>\n<li>Leverage your experience in analytics tools and scientific rigor to produce actionable insights.</li>\n<li>Distill and communicate key insights to senior management in verbal, visual, and written media.</li>\n<li>Together with the Co-op department lead, determine an appropriate data science problem statement and toolset to apply during the co-op term.</li>\n<li>Determine strengths and weaknesses of data science toolsets and procedures.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Knowledge of Machine Learning concepts (cross-validation, regularization, boosting, bootstrapping) is a plus.</li>\n<li>Working on a degree in Computer Science, or a related field, with project experience in data analysis.</li>\n<li>Experience with big data technologies (Hadoop, Hive, MongoDB, Spark).</li>\n<li>Experience with statistical analysis and data mining using tools such as R, SAS, Matlab, Stata, or SPSS.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "Entry Level",
            "Machine Learning",
            "Data Analysis",
            "Big Data"
        ],
        "summary": "Seeking a Data Science Intern to explain models, resolve issues, and implement data processing. Requires knowledge of machine learning and experience with big data technologies."
    },
    {
        "job_title": "Junior Business Development Executive - B2B Sales",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20324/157",
        "location": "Infopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Junior Business Development Executive - B2B Sales</h2>\n<p><strong>Experience:</strong> 0 to 3 years (Freshers can apply)</p>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Engineering</li>\n<li>MBA (optional)</li>\n</ul>\n<p><strong>Preferred Experience:</strong></p>\n<ul>\n<li>B2B Sales</li>\n<li>Lead Generation</li>\n<li>Customer Acquisition</li>\n</ul>\n<p><strong>Responsibilities and Requirements:</strong></p>\n<ul>\n<li>Prior experience in B2B Inside Sales/ lead Generation,/ Customer Acquisition will be preferred</li>\n<li>The candidate must be proactive, committed, ambitious, have good interpersonal skills, and be a smart negotiator with excellent grasping power.</li>\n<li>Must have good presentation skills</li>\n<li>MS Office (Google Docs, PowerPoint) use and familiarity.</li>\n<li>Willing to travel (80-20% ratio).</li>\n<li>Must have Good communication skills in English (Verbal and written)</li>\n<li>Young and Dynamic Culture.</li>\n<li>Candidate should be living within a 30-minute radius of the office</li>\n<li>Must have a passport</li>\n</ul>\n<p><strong>Key Skills and Traits:</strong></p>\n<ul>\n<li>Proactive</li>\n<li>Ambitious</li>\n<li>Interpersonal Skills</li>\n<li>Negotiation Skills</li>\n<li>Presentation Skills</li>\n<li>MS Office</li>\n<li>Willing To Travel</li>\n<li>Communication Skills</li>\n<li>Dynamic Culture</li>\n<li>Passport Required</li>\n</ul>\n<p><strong>Job Details</strong></p>\n<ul>\n<li>Employment: Full-time</li>\n<li>Industry: Software Development</li>\n</ul>\n<p><strong>How to Apply:</strong>\nInterested candidates are encouraged to submit their resumes to hr@tranzmeo.com or lakshmi@team.tranzmeo.com</p>",
        "tags": [
            "0-3 Years",
            "B2B Sales",
            "Lead Generation",
            "Communication Skills"
        ],
        "summary": "Seeking a Junior Business Development Executive to drive B2B sales and lead generation. The role requires excellent communication and negotiation skills."
    },
    {
        "job_title": "Technical Lead- Data Science & Machine Learning",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/20325/157",
        "location": "Infopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Technical Lead - Data Science &amp; Machine Learning</h2>\n<p>Tranzmeo is a leading innovator in the fiber optic sensing industry, developing cutting-edge solutions for pipeline, well, railway, aerospace, defense, and other applications. We leverage AI, ML, and Big Data to advance sensing technology and provide real-time insights.</p>\n<p>We are seeking a passionate and experienced Technical Lead to head our Data Science &amp; Machine Learning initiatives. If you are excited about applying AI/ML to advanced sensing technologies and want to make a tangible impact, we encourage you to apply!</p>\n<p><strong>What You'll Do:</strong></p>\n<ul>\n<li>Lead the design, development, and deployment of scalable AI/ML models tailored to fiber optic sensing data.</li>\n<li>Architect Big Data solutions for processing vast amounts of sensing data in real-time.</li>\n<li>Collaborate with product teams, sensor engineers, and stakeholders on innovative projects.</li>\n<li>Mentor and manage a talented team of data scientists and engineers.</li>\n<li>Ensure data quality, model performance, and security standards.</li>\n<li>Stay ahead of developments in AI/ML and fiber optic sensing fields to foster innovation.</li>\n</ul>\n<p><strong>What We're Looking For:</strong></p>\n<ul>\n<li>B.Tech in Computer Science, Data Science, or related fields.</li>\n<li>6+ years of experience in data science, machine learning, and Big Data, preferably in the sensing or telecom sectors.</li>\n<li>Proven leadership and team management skills.</li>\n<li>Strong programming skills (Python).</li>\n<li>Experience with cloud platforms (AWS, GCP, Azure).</li>\n<li>Hands-on experience with ML frameworks (TensorFlow, PyTorch, scikit-learn).</li>\n<li>Skilled in Big Data tools (Hadoop, Spark, Kafka, Airflow).</li>\n<li>Good understanding of fiber optic sensing technologies and data characteristics is a plus.</li>\n<li>Excellent problem-solving, communication, and collaboration skills.</li>\n</ul>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Work on innovative sensing technology projects with real-world impact.</li>\n<li>Lead the AI and ML strategies in a pioneering industry.</li>\n<li>Dynamic and growth-oriented work environment.</li>\n<li>Opportunity to shape the future of fiber optic sensing solutions.</li>\n</ul>\n<p><strong>Job Details</strong></p>\n<ul>\n<li>Employment: Full-time</li>\n<li>Industry: Software Development</li>\n</ul>\n<p>If you are interested, please share your updated resume with us at hr@tranzmeo.com</p>",
        "tags": [
            "6+ Years",
            "Machine Learning",
            "Python",
            "Big Data"
        ],
        "summary": "Tranzmeo is looking for a Technical Lead to spearhead Data Science & ML initiatives, applying AI/ML to advanced sensing technologies. This role involves leading projects, managing a team, and ensuring data quality."
    },
    {
        "job_title": "Senior Analytics Engineer",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20304/4",
        "location": "Infopark",
        "closing_date": "14 Sep 2025",
        "job_description": "<h2>Senior Analytics Engineer</h2>\n<p><strong>Location:</strong> Remote\n<strong>Department:</strong> Data &amp; AI Platform\n<strong>Employment Type:</strong> Full-Time\n<strong>Experience:</strong> 5+ years</p>\n<p><strong>Job Summary</strong>\nAs a Senior Analytics Engineer specializing in the payments space for issuer processors, you will play a critical role in analyzing and interpreting complex data sets to support decision-making and strategic initiatives. You will be responsible for extracting insights from payment transaction data, identifying trends, ensuring data quality, and providing actionable recommendations to improve business outcomes. Your work will directly impact the efficiency and effectiveness of payment processing and card issuance operations.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ol>\n<li>\n<p><strong>Data Analysis and Interpretation:</strong></p>\n<ul>\n<li>Analyse large datasets related to payment processing, card issuance, and customer transactions to identify trends, patterns, and insights.</li>\n<li>Use statistical techniques and data mining tools to interpret data and generate actionable insights.</li>\n<li>Develop and maintain dashboards and reports to visualize data and track key performance indicators (KPIs).</li>\n</ul>\n</li>\n<li>\n<p><strong>Stakeholder Collaboration:</strong></p>\n<ul>\n<li>Work closely with business units, product managers, and other teams to understand data requirements and business objectives.</li>\n<li>Provide analytical support to stakeholders by delivering data-driven recommendations and insights.</li>\n<li>Communicate findings and insights effectively through presentations, reports, and visualizations.</li>\n</ul>\n</li>\n<li>\n<p><strong>Data Quality and Integrity:</strong></p>\n<ul>\n<li>Develop, maintain, and optimize data pipelines with a focus on using dbt for data transformations, ensuring clean, reliable, and accessible data for analysis.</li>\n<li>Ensure the accuracy, completeness, and consistency of data used for analysis.</li>\n<li>Work with data engineers to implement data validation and cleansing processes to maintain high data quality.</li>\n</ul>\n</li>\n<li>\n<p><strong>Performance Optimization:</strong></p>\n<ul>\n<li>Create and maintain scalable data models in Snowflake using dbt, following best practices in chosen modelling technique.</li>\n<li>Identify opportunities for process improvements and optimization within payment processing and card issuance operations.</li>\n<li>Analyse operational workflows to recommend efficiency improvements.</li>\n<li>Monitor system performance and data trends to proactively address potential issues.</li>\n<li>Potentially contribute in ETL processes using dbt and orchestration tools (e.g., Apache Airflow), optimizing data workflows and performance.</li>\n</ul>\n</li>\n<li>\n<p><strong>Regulatory Compliance:</strong></p>\n<ul>\n<li>Ensure data analysis practices comply with industry standards, regulatory requirements, and security protocols.</li>\n<li>Assist in preparing data and reports for regulatory audits and compliance reviews.</li>\n</ul>\n</li>\n<li>\n<p><strong>Continuous Improvement:</strong></p>\n<ul>\n<li>Proactively identify opportunities for process improvements and implement innovative solutions.</li>\n<li>Participate in training and professional development activities to enhance skills and knowledge.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>Bachelor’s degree in data science, Computer Science, Information Systems, Finance, or a related field.</li>\n<li>Proven experience as a Data Analyst/Analytics Engineer role, preferably in the payments industry with issuer processors.</li>\n<li>Proficiency in building and managing data transformations with dbt, with experience in optimizing complex transformations and documentation.</li>\n<li>Hands-on experience with Snowflake as a primary data warehouse, including knowledge of performance optimization, data modelling, and query tuning.</li>\n<li>Strong proficiency in data analysis tools and languages (e.g., SQL, Python).</li>\n<li>Strong understanding of data modelling principles and experience applying modeling techniques.</li>\n<li>Proficiency with data visualization tools such as Tableau, Power BI, or similar.</li>\n<li>Knowledge of payment processing system, card issuance, and related services.</li>\n<li>Experience with cloud-based data solutions (e.g., AWS, Azure, Google Cloud).</li>\n<li>Familiarity with modern data architecture such as data Lakehouse.</li>\n<li>Strong analytical, problem-solving, and communication skills.</li>\n<li>Attention to detail and a commitment to data quality and integrity.</li>\n<li>Familiarity with regulatory requirements and security standards in the financial industry.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at aswathi.asok@arttechgroup.com</p>",
        "tags": [
            "5+ Years",
            "dbt",
            "Snowflake",
            "SQL"
        ],
        "summary": "Seeking a Senior Analytics Engineer to analyze payment data, identify trends, and provide actionable recommendations. Expertise in dbt and Snowflake required for optimizing payment processing."
    },
    {
        "job_title": "Sr.Fullstack Developer",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/20332/182",
        "location": "Infopark",
        "closing_date": "20 Sep 2025",
        "job_description": "<h2>Senior Full-Stack Developer</h2>\n<p>We are seeking a Senior Full-Stack Developer with extensive experience in React.js and Node.js. As a Sr. Fullstack Developer, you will design and implement client-side and server-side architectures, develop front-end and back-end applications, and collaborate with cross-functional teams to define and deliver high-quality software solutions.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Develop, test, and maintain full-stack applications using Node.js for the backend and React.js for the frontend.</li>\n<li>Build and integrate RESTful APIs to support mobile and web applications.</li>\n<li>Design scalable and secure backend architectures, ideally with microservices where applicable.</li>\n<li>Work with AWS Aurora (or similar relational databases) for database design, management, and optimization.</li>\n<li>Handle cloud deployments using AWS services.</li>\n<li>Act as the primary technical point of contact for the client; gather requirements, provide updates, and suggest solutions.</li>\n<li>Work independently and take ownership of assigned projects with minimal supervision.</li>\n<li>Collaborate with cross-functional teams to deliver high-quality features on time.</li>\n<li>Monitor performance, troubleshoot issues, and ensure application reliability.</li>\n<li>Apply sound networking and architectural practices to improve system scalability and security.</li>\n</ul>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li>7+ years of professional experience in full-stack development.</li>\n<li>Strong proficiency in Node.js and React.js.</li>\n<li>Hands-on experience with RESTful APIs and relational databases (AWS Aurora/MySQL/PostgreSQL).</li>\n<li>Solid understanding of scalable backend architecture; microservices knowledge is a plus.</li>\n<li>Working knowledge of AWS cloud services (EC2, S3, Lambda, etc.).</li>\n<li>Good knowledge of networking fundamentals and secure application development.</li>\n<li>Familiarity with Git for version control.</li>\n<li>Strong debugging and performance tuning skills.</li>\n<li>Excellent communication skills with the ability to interact directly with international clients.</li>\n<li>Proven ability to work independently and own deliverables end-to-end</li>\n</ul>\n<p>If you’re passionate about building complete web applications and ready to take ownership of challenging projects, we’d love to hear from you. Apply now with the subject line: “Sr. Full-Stack Developer.”</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@2hatslogic.com</p>",
        "tags": [
            "7+ Years",
            "React.js",
            "Node.js",
            "RESTful APIs"
        ],
        "summary": "Seeking a Senior Full-Stack Developer to design and implement architectures using React.js and Node.js. Responsibilities include developing applications, integrating APIs, and collaborating with cross-functional teams."
    },
    {
        "job_title": "Technical Architect",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/20306/4",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Technical Architect</h2>\n<p><strong>Company:</strong> Panasa Technology\n<strong>Work Mode:</strong> Work From Office\n<strong>Experience:</strong> 12+ years</p>\n<p><strong>Role Overview</strong></p>\n<p>We are seeking a highly skilled Solution/Technical Architect with strong expertise in open-source technologies. The ideal candidate will design, architect, and oversee the implementation of large-scale, high-performance, and secure platforms leveraging Java, Node.js, and microservices architectures.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Define and own the technical architecture for enterprise-grade, scalable solutions on open-source platforms.</li>\n<li>Lead the design of microservices-based architectures, ensuring modularity, performance, and maintainability.</li>\n<li>Drive performance tuning strategies for high-volume, low-latency platforms.</li>\n<li>Ensure adherence to security best practices, compliance requirements, and secure coding standards.</li>\n<li>Collaborate with product, DevOps, and engineering teams to establish cloud-native solutions (AWS/GCP/Azure).</li>\n<li>Evaluate and adopt open-source frameworks, libraries, and tools to optimize solution design.</li>\n<li>Mentor developers and enforce coding, testing, and architectural standards.</li>\n<li>Conduct proof of concepts (PoCs) for new frameworks and approaches.</li>\n</ul>\n<p><strong>Required Skills &amp; Experience</strong></p>\n<ul>\n<li>12+ years of software engineering experience, with 5+ years in an architect role.</li>\n<li>Strong expertise in Java, Spring Boot, Node.js, Express.js, REST, GraphQL.</li>\n<li>Proven experience in designing large-scale distributed systems and event-driven architectures (Kafka, RabbitMQ, etc.).</li>\n<li>Deep knowledge of microservices, APIs, containerization (Docker, Kubernetes).</li>\n<li>Hands-on experience in performance optimization, caching strategies (Redis, Memcached), and database tuning NoSQL).</li>\n<li>Strong understanding of security principles, OWASP, and identity management (OAuth2, JWT, SAML, OpenID Connect).</li>\n<li>Experience with CI/CD pipelines, DevOps, and cloud platforms (AWS/GCP/Azure).</li>\n<li>Strong communication and leadership skills to engage with cross-functional stakeholders.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at chandini.m@arttechgroup.com</p>",
        "tags": [
            "12+ Years",
            "Java",
            "Microservices",
            "Cloud Platforms"
        ],
        "summary": "Panasa Technology is looking for a Technical Architect to design and oversee the implementation of large-scale platforms using Java, Node.js, and microservices. The candidate will define architecture, lead design, and ensure security and performance."
    },
    {
        "job_title": "HR Manager",
        "company": "Planet Media India ( PMIN Agency Pvt.Ltd.)",
        "url": "https://infopark.in/company-jobs/details/20317/266",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>HR Manager</h2>\n<p><strong>Key Responsibilities:</strong></p>\n<ol>\n<li>\n<p><strong>Talent Acquisition &amp; Recruitment:</strong></p>\n<ul>\n<li>Develop and execute hiring strategies to attract top IT talent.</li>\n<li>Manage the entire recruitment process, including job postings, screening, interviews, and offer negotiations.</li>\n<li>Work closely with department heads to identify hiring needs and create job descriptions.</li>\n</ul>\n</li>\n<li>\n<p><strong>Induction &amp; On-boarding:</strong></p>\n<ul>\n<li>Implement effective on-boarding programs to integrate new employees.</li>\n<li>Conduct orientation sessions and ensure a smooth transition for new hires.</li>\n<li>Maintain and update employee records, contracts, and documentation.</li>\n</ul>\n</li>\n<li>\n<p><strong>Performance Management &amp; Appraisals:</strong></p>\n<ul>\n<li>Develop and implement performance appraisal frameworks and KPI metrics.</li>\n<li>Work with team leads to define Key Responsibility Areas (KRAs) and performance benchmarks.</li>\n<li>Conduct performance reviews and provide feedback mechanisms for continuous improvement.</li>\n</ul>\n</li>\n<li>\n<p><strong>Employee Relations &amp; Engagement:</strong></p>\n<ul>\n<li>Address employee concerns, conflicts, and grievances, ensuring a healthy work environment.</li>\n<li>Plan and execute employee engagement initiatives, team-building activities, and wellness programs.</li>\n<li>Foster a culture of open communication and feedback.</li>\n</ul>\n</li>\n<li>\n<p><strong>Training &amp; Development:</strong></p>\n<ul>\n<li>Identify skill gaps and coordinate learning &amp; development programs for employees.</li>\n<li>Work with department heads to organize technical and soft skills training.</li>\n<li>Implement leadership development and succession planning initiatives.</li>\n</ul>\n</li>\n<li>\n<p><strong>Compliance &amp; HR Policies:</strong></p>\n<ul>\n<li>Ensure compliance with company policies and industry regulations.</li>\n<li>Enforce HR policies and procedures.</li>\n<li>Maintain confidentiality of employee records and ensure data security.</li>\n</ul>\n</li>\n<li>\n<p><strong>Off-boarding &amp; Exit Management:</strong></p>\n<ul>\n<li>Manage the employee exit process, including conducting exit interviews and processing final settlements.</li>\n<li>Analyze feedback from exit interviews to improve retention strategies.</li>\n</ul>\n</li>\n<li>\n<p><strong>Employer Branding &amp; Culture Building:</strong></p>\n<ul>\n<li>Develop and execute employer branding strategies to attract and retain talent.</li>\n<li>Promote company culture through various communication channels and internal initiatives.</li>\n<li>Collaborate with marketing teams for recruitment campaigns and career events.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Qualifications &amp; Skills:</strong></p>\n<ul>\n<li>Bachelor’s/Master’s degree in Human Resources, Business Administration, or a related field.</li>\n<li>Proven experience as an HR Manager in an IT services company.</li>\n<li>Strong knowledge of IT recruitment, performance management, and compensation structuring.</li>\n<li>Excellent communication, leadership, and interpersonal skills.</li>\n<li>Proficiency in HRMS tools and payroll management systems (Zoho People preferred).</li>\n<li>Ability to handle sensitive information with confidentiality and professionalism.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@planetmedia.in</p>",
        "tags": [
            "5+ Years",
            "IT Recruitment",
            "HRMS",
            "Performance Management"
        ],
        "summary": "Seeking an HR Manager to develop strategies for talent acquisition, manage performance appraisals, and ensure compliance with HR policies. The role involves fostering employee engagement and driving employer branding initiatives."
    },
    {
        "job_title": "Sr. QA Automation Engineer (Insourcing For UK based Company)",
        "company": "Portrave Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20331/384",
        "location": "Infopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Sr. QA Automation Engineer</h2>\n<p>We are looking for a Senior QA Automation Engineer to join our team and work on an insourcing project for a UK-based company.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain test automation frameworks using Java and Selenium/Playwright.</li>\n<li>Perform manual testing of RESTful APIs, web services, apps, and PostgreSQL using tools like Postman and SwaggerUI.</li>\n<li>Write and execute both manual and automation tests.</li>\n<li>Work with Continuous Integration and Continuous Deployment pipelines using Jenkins and GitHub.</li>\n<li>Collaborate in an Agile software development environment.</li>\n<li>Proactively identify issues and risks, and provide solutions.</li>\n<li>Prioritize workload and work on tasks in parallel.</li>\n<li>Contribute to the QA Guild and share best practices.</li>\n<li>Support operations team by resolving production incidents.</li>\n<li>Support, coordinate, and ensure successful validation of all releases in production.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>BS degree in Engineering or Computer Science or equivalent experience.</li>\n<li>8+ years of experience in Test Automation and Manual testing as a Senior Quality Assurance Engineer or similar role.</li>\n<li>In-depth knowledge and experience of Java, working with Web services and API understanding.</li>\n<li>Experience with Selenium/Playwright and Java programming.</li>\n<li>Experience using Continuous Integration and Continuous Deployment pipelines and code repositories with tools such as Jenkins and GitHub.</li>\n<li>Experience in Agile Software Development environment with Data Driven Testing.</li>\n<li>Knowledge and understanding of SQL syntax and ability to write SQL queries.</li>\n<li>Understanding the structure of JSON objects and the ability to work with them.</li>\n<li>Understanding of Client-Server Architecture.</li>\n<li>Experience in Database Management Tool such as DBeaver, Google Chrome Browser toolbox and Tariff sniffer.</li>\n<li>Hands-on experience building test automation frameworks from scratch to Web Applications and strong Web Application testing experience.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>\n<p><strong>Nice to have:</strong></p>\n<ul>\n<li>Building CI/CD pipelines for post deployment verification.</li>\n<li>Experience in Contract testing.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@portrave.com</p>",
        "tags": [
            "8+ Years",
            "Java",
            "Selenium",
            "API Testing"
        ],
        "summary": "Seeking a Sr. QA Automation Engineer with 8+ years of experience to develop automation frameworks and perform testing. Requires expertise in Java, Selenium, and API testing in an Agile environment."
    },
    {
        "job_title": "Digital Marketing Specialist(B2B SaaS)",
        "company": "ContactPoint 360",
        "url": "https://infopark.in/company-jobs/details/20337/306",
        "location": "Infopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Digital Marketing Specialist (B2B SaaS)</h2>\n<p><strong>Location:</strong> Remote\n<strong>Type:</strong> Full-time\n<strong>Experience:</strong> 5+ years</p>\n<p><strong>About Us:</strong>\nAt ContactPoint360, we are at the forefront of delivering exceptional customer experience solutions across various industries. As we continue to expand our footprint globally, we are looking for a passionate Digital Marketing Specialist to drive our SaaS-based product marketing and lead generation efforts, helping us achieve our ambitious growth objectives.</p>\n<p><strong>Job Summary:</strong>\nWe are seeking a skilled Digital Marketing Specialist with over 5 years of experience in SaaS-based product marketing and lead generation. The ideal candidate will have a proven track record in developing and executing comprehensive digital marketing strategies, generating high-quality leads, and handling social media channels to elevate brand presence and engagement. This role will be crucial in driving brand awareness, optimizing customer acquisition efforts, and maximizing ROI across multiple digital platforms.</p>\n<p><strong>Key Responsibilities:</strong>\n- Develop and execute digital marketing strategies for SaaS-based products that drive lead generation and customer acquisition.\n- Create, manage, and optimize multi-channel digital campaigns (PPC, SEO, email marketing, display ads, etc.) to drive qualified leads.\n- Develop content strategies and manage the company’s social media channels (LinkedIn, Instagram, Facebook, etc.) to increase engagement, brand visibility, and lead generation.\n- Collaborate with cross-functional teams (Sales, Product, and Content) to ensure alignment between digital marketing initiatives and business goals.\n- Analyze and report on the performance of digital marketing campaigns, providing actionable insights and recommendations for continuous improvement.\n- Optimize website landing pages, content, and user funnels for improved lead conversion.\n- Stay up-to-date with the latest trends and best practices in digital marketing, SaaS marketing, and social media strategies.</p>\n<p><strong>Qualifications:</strong>\n- 5+ years of experience in digital marketing, with a strong focus on SaaS product marketing and lead generation.\n- Proven experience in handling end-to-end digital marketing campaigns, from strategy to execution and reporting.\n- Strong knowledge of SEO/SEM, PPC, email marketing, and social media platforms.\n- Hands-on experience with marketing tools and platforms such as Google Analytics, Google Ads, LinkedIn Campaign Manager, HubSpot, and others.\n- Excellent communication skills and the ability to collaborate effectively with cross-functional teams.\n- Analytical mindset with a data-driven approach to decision-making and campaign optimization.\n- Strong project management skills with the ability to manage multiple initiatives in a fast-paced environment.\n- Ability to work independently and meet deadlines while maintaining a high level of attention to detail.</p>\n<p><strong>Preferred:</strong>\n- Experience with CRM systems and marketing automation tools (e.g HubSpot).\n- Knowledge of A/B testing methodologies and lead nurturing tactics.\n- Previous experience in a B2B SaaS environment is a plus</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at vaishnavi.lal@cp-360.com</p>",
        "tags": [
            "5+ Years",
            "SaaS Marketing",
            "SEO/SEM",
            "HubSpot"
        ],
        "summary": "Seeking a Digital Marketing Specialist to drive SaaS product marketing and lead generation. The role involves creating digital strategies, managing campaigns, and optimizing lead conversion."
    },
    {
        "job_title": "Lead - Pre Sales - IT Services",
        "company": "InApp Information Technologies India Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20300/329",
        "location": "Infopark",
        "closing_date": "04 Oct 2025",
        "job_description": "<h2>Lead - Pre Sales - IT Services</h2>\n<p><strong>Location:</strong> Candidates must be based in Kerala.</p>\n<p><strong>Job Summary</strong></p>\n<p>We are seeking a dynamic and detail-oriented Presales Consultant to support our IT services sales team. The ideal candidate will have a strong understanding of IT service offerings, excellent communication skills, and proven experience in responding to RFPs, creating compelling case studies, and collaborating across technical and business teams. Should be ready to work flexible hours to accommodate Global client meetings and deliverables.</p>\n<p><strong>Key Responsibilities</strong></p>\n<p><strong>RFP &amp; Proposal Management</strong></p>\n<ul>\n<li>Analyze and respond to RFPs, RFIs, and RFQs with high-quality proposals.</li>\n<li>Coordinate with delivery, finance, legal, and technical teams to gather inputs.</li>\n<li>Ensure proposals are tailored to client needs and aligned with company capabilities.</li>\n<li>Maintain a repository of reusable proposal content and templates.</li>\n</ul>\n<p><strong>Solution Design &amp; Client Engagement</strong></p>\n<ul>\n<li>Understand client requirements and create suitable proposal documents.</li>\n<li>Participate in client calls, presentations of the proposals and any workshops.</li>\n<li>Collaborate with architects and SMEs to design proposals and SOWs.</li>\n</ul>\n<p><strong>Collaboration &amp; Cross-functional Interaction</strong></p>\n<ul>\n<li>Work closely with sales, delivery, marketing, and account teams.</li>\n<li>Facilitate internal reviews and approvals for proposals and solutions.</li>\n<li>Act as a bridge between technical teams and customer business stakeholders.</li>\n</ul>\n<p><strong>Content Development</strong></p>\n<ul>\n<li>Create and maintain case studies, capability decks, and client success stories.</li>\n</ul>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li>Experience in IT services presales or solution consulting.</li>\n<li>Understanding of IT service domains (e.g. cloud, infrastructure, application services).</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to manage multiple proposals and deadlines simultaneously</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n<li>Experience with global clients and multi-geography proposals.</li>\n<li>Familiarity with Agile, or other service delivery frameworks.</li>\n<li>Prior experience in creating sales enablement content.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@inapp.com</p>",
        "tags": [
            "2+ Years",
            "RFP",
            "IT Services",
            "Solution Design"
        ],
        "summary": "We are looking for a Presales Consultant to support our IT services sales team. The person will be responsible for creating proposals, and client engagement."
    },
    {
        "job_title": "Digital Marketing Internship (Live projects)",
        "company": "Orestes Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20329/390",
        "location": "Infopark",
        "closing_date": "04 Oct 2025",
        "job_description": "<h2>Digital Marketing Internship (Live projects)</h2>\n<p><strong>Key Responsibilities</strong>:</p>\n<ul>\n<li><strong>Social Media Management</strong>:</li>\n<li>Assist in managing and curating content for various social media platforms.</li>\n<li>Implement social media strategies to increase brand awareness and engagement.</li>\n<li>\n<p>Monitor and analyze social media metrics to optimize performance.</p>\n</li>\n<li>\n<p><strong>Content Creation</strong>:</p>\n</li>\n<li>Collaborate with the content team to create engaging and relevant content for digital platforms.</li>\n<li>\n<p>Contribute to the development of blog posts, articles, and other promotional materials.</p>\n</li>\n<li>\n<p><strong>SEO and SEM</strong>:</p>\n</li>\n<li>Learn and implement search engine optimization (SEO) strategies.</li>\n<li>\n<p>Assist in managing pay-per-click (PPC) campaigns to increase online visibility.</p>\n</li>\n<li>\n<p><strong>Email Marketing</strong>:</p>\n</li>\n<li>Support in creating and executing email marketing campaigns.</li>\n<li>\n<p>Analyze email performance metrics and suggest improvements.</p>\n</li>\n<li>\n<p><strong>Analytics and Reporting</strong>:</p>\n</li>\n<li>Use analytics tools to track and report on the performance of digital marketing campaigns.</li>\n<li>Provide insights and recommendations based on data analysis.</li>\n</ul>\n<p><strong>Qualifications</strong>:</p>\n<ul>\n<li>Currently pursuing or recently graduated with a degree in Marketing, Communications, Business, or a related field.</li>\n<li>Strong interest in digital marketing and a willingness to learn.</li>\n<li>Basic understanding of social media platforms and digital marketing concepts</li>\n</ul>\n<p><strong>Skills</strong>:</p>\n<ul>\n<li>Excellent written and verbal communication skills.</li>\n<li>Familiarity with social media platforms, SEO, and digital marketing tools.</li>\n<li>Analytical mindset with the ability to interpret data and draw actionable insights.</li>\n</ul>\n<p><strong>Perks</strong>:</p>\n<ul>\n<li>Hands-on training on live projects.</li>\n<li>Mentorship from experienced professionals in the digital marketing field.</li>\n<li>Opportunity for a full-time position based on performance</li>\n</ul>\n<p>Interested candidates please share the resume to aswathy@orestestech.com</p>\n<p>For further contact: 8089671177</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us ataswathy@orestestech.com</p>",
        "tags": [
            "Entry Level",
            "Social Media Management",
            "SEO",
            "Content Creation"
        ],
        "summary": "Seeking a Digital Marketing Intern to assist with social media, content creation, SEO, and email campaigns. The role involves hands-on training and mentorship with potential for a full-time position."
    },
    {
        "job_title": "Customer Engagement Executive",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/20319/401",
        "location": "Infopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Customer Engagement Executive</h2>\n<p>We are seeking a dynamic and confident professional with excellent presentation and communication skills to showcase our products to potential and lead customers. The ideal candidate should be able to explain product features clearly, engage with clients effectively, and represent our company with professionalism.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Deliver impactful product presentations and demonstrations to prospective and existing clients.</li>\n<li>Clearly communicate product features, benefits, and use cases to diverse audiences.</li>\n<li>Engage with customers, understand their requirements, and guide them on how our products meet their needs.</li>\n<li>Coordinate with the sales and marketing teams to prepare presentation materials and client engagement strategies.</li>\n<li>Build strong relationships with clients and represent the company in meetings, events, and product showcases.</li>\n<li>Collect customer feedback during presentations and share insights with internal teams for improvement.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Bachelor’s degree in any discipline.</li>\n<li>Excellent verbal and written communication skills in English (knowledge of additional languages is a plus).</li>\n<li>Strong presentation and interpersonal skills with the ability to engage audiences.</li>\n<li>Confidence in speaking with senior-level clients and decision-makers.</li>\n<li>Ability to understand technical product features and explain them in simple, customer-friendly terms.</li>\n<li>Willingness to travel to meet clients and attend events if required.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Previous experience in client presentations, presales, or customer-facing roles.</li>\n<li>Good knowledge of using PowerPoint, presentation tools, and digital collaboration platforms.</li>\n<li>A positive attitude, adaptability, and ability to work as part of a team.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at joinus@pearlsofttechnologies.com</p>",
        "tags": [
            "1+ Years",
            "Presentations",
            "Communication Skills",
            "Customer Engagement"
        ],
        "summary": "Seeking a Customer Engagement Executive to present products, engage clients, and gather feedback. Requires strong communication and presentation skills, plus the ability to explain technical product features."
    },
    {
        "job_title": "Trainee Administrative Assistant / Office Assistant",
        "company": "Aabasoft Technologies India Private Limited",
        "url": "https://infopark.in/company-jobs/details/20305/95",
        "location": "Infopark",
        "closing_date": "30 Oct 2025",
        "job_description": "<h2>Trainee Administrative Assistant / Office Assistant</h2>\n<p>We are seeking a motivated Trainee Administrative Assistant / Office Assistant to provide support for daily administrative and office tasks. This is a great opportunity for fresh graduates looking to begin their career in administration.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Assist in daily office operations and administrative tasks.</li>\n<li>Prepare and maintain basic documents and spreadsheets in MS Word.</li>\n<li>Manage filing systems (soft copy and hard copy).</li>\n<li>Support data entry and record keeping.</li>\n<li>Handle basic correspondence (emails, phone calls, memos).</li>\n<li>Provide assistance to different departments as required.</li>\n<li>Perform other general office duties assigned by the supervisor.</li>\n<li>Training and mentorship in administrative processes.</li>\n<li>Exposure to corporate office operations.</li>\n<li>Opportunity for career growth within the organization.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Basic Communication Skills (verbal and written).</li>\n<li>Familiarity with MS Office (Word, PowerPoint, Excel).</li>\n<li>Good organizational and time management skills.</li>\n<li>Ability to work as part of a team and follow instructions.</li>\n<li>Willingness to learn and adapt.</li>\n</ul>\n<p><strong>To Apply:</strong></p>\n<p>If this opportunity aligns with your career goals, please send your updated resume to career@aabasoft.com.</p>",
        "tags": [
            "Entry Level",
            "MS Office",
            "Communication Skills",
            "Data Entry"
        ],
        "summary": "We need an Administrative Assistant to support office tasks. Entry-level applicants with MS Office skills are welcome to apply and grow within the organization."
    },
    {
        "job_title": "Senior Backend Engineer – Python (AI-Powered Systems)",
        "company": "JK Lucent Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/20299/415",
        "location": "Infopark",
        "closing_date": "31 Oct 2025",
        "job_description": "<h2>Senior Backend Engineer – Python (AI-Powered Systems)</h2>\n<p><strong>Location:</strong> Infopark Koratty, Chalakkudy, Kerala\n<strong>Employment Type:</strong> Full-Time, Onsite\n<strong>Experience:</strong> 5+ Years</p>\n<p><strong>About the Role</strong>\nWe are looking for a Senior Backend Engineer – Python who has a solid foundation in backend architecture, real-time systems, and Python development. You will be leading the backend development of AI-powered applications, particularly chatbots and voice bots. This role involves hands-on system design, team mentoring, and building robust, secure, scalable services.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Architect and implement scalable Python-based backend services, particularly for AI-driven applications (e.g., chatbots, voice bots).</li>\n<li>Design modular and maintainable codebases, including setting up repository structures and database schema design.</li>\n<li>Lead and mentor developers through all phases of development—from concept to deployment.</li>\n<li>Develop APIs using FastAPI, with robust validation using Pydantic and asynchronous capabilities.</li>\n<li>Implement ORM and migrations using SQLAlchemy and Alembic.</li>\n<li>Integrate task queues using Celery and background processing effectively.</li>\n<li>Build and optimize database systems, including MySQL, PostgreSQL, and related tools.</li>\n<li>Integrate LLMs (e.g., OpenAI, HuggingFace Transformers) into backend systems to support conversational AI capabilities.</li>\n<li>Use AI/NLP libraries such as NLTK, scikit-learn, or equivalents in production-level applications.</li>\n<li>Implement containerization using Docker and maintain version control with Git.</li>\n<li>Contribute to and maintain CI/CD pipelines for smooth and reliable deployments.</li>\n<li>Conduct code reviews to ensure high-quality, maintainable, and well-documented code.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>5–6 years of experience in Python backend development, preferably in AI product environments.</li>\n<li>Proven experience in designing backend architectures from scratch for real-time or intelligent systems.</li>\n<li>Strong knowledge of:<ul>\n<li>FastAPI, Pydantic, SQLAlchemy, Alembic</li>\n<li>Celery, Purest, LLM-specific libraries (e.g., OpenAI SDK, HuggingFace)</li>\n<li>AI/ML-related Python libraries: NLTK, scikit-learn</li>\n</ul>\n</li>\n<li>Experience with PostgreSQL, MySQL, and database design best practices.</li>\n<li>Familiarity with containerization using Docker and basic knowledge of CI/CD tools and Git workflows.</li>\n<li>Experience deploying and integrating LLM-powered applications, including chatbots or voice bots, into production.</li>\n<li>Strong understanding of software engineering best practices, with experience conducting code reviews and mentoring team members.</li>\n</ul>\n<p><strong>Preferred</strong></p>\n<ul>\n<li>Experience in multi-tenant or multi-service application design.</li>\n<li>Exposure to cloud platforms like AWS, Azure, or GCP.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@jklucent.com.au</p>",
        "tags": [
            "5+ Years",
            "Python",
            "FastAPI",
            "AI/ML"
        ],
        "summary": "We're seeking a Senior Backend Engineer with Python skills to lead AI-powered application development. Responsibilities include backend architecture, team mentoring, and integrating LLMs into production systems."
    },
    {
        "job_title": "DIRECT BUSINESS MEETING EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23379",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Direct Business Meeting Executive</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\nwww.trainonexsolutions.in</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 10, Sept 2025\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Brief Description:</strong>\nMotivated and dynamic candidates are invited to join our client’s marketing team as Direct Meeting Executive. You will conduct outbound calls to potential customers to promote products or services. You will also explain products or services and answer questions from customers.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Explain products or services and answer questions from customers.</li>\n<li>Obtain customer information and update databases with call outcomes.</li>\n<li>Follow up on initial contacts and maintain relationships with customers.</li>\n<li>Achieve sales targets and objectives set by the company.</li>\n<li>Handle customer complaints or objections professionally.</li>\n<li>Ensure customer satisfaction through effective communication and service.</li>\n</ul>\n<p><strong>Experience:</strong> 0-1 years; freshers can also apply</p>\n<p><strong>Basic Pay:</strong> 15000</p>\n<p><strong>Gender Preference:</strong> Male and female candidates preferred</p>\n<p><strong>Application Instructions:</strong>\nMention Subject as \"Application for direct meeting executive.\"</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Communication Skills</li>\n<li>Customer Handling</li>\n<li>Time Management</li>\n<li>Active Listening</li>\n<li>Building Customer Relationship</li>\n</ul>",
        "tags": [
            "0-1 Year",
            "Communication Skills",
            "Customer Handling",
            "Active Listening"
        ],
        "summary": "Join our client's marketing team as a Direct Meeting Executive, conducting outbound calls and explaining products. Candidates will maintain customer relationships and meet sales targets."
    },
    {
        "job_title": "Delivery Manager",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23375",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Delivery Manager</h2>\n<p><strong>TECHVANTAGE SYSTEMS (P) Ltd</strong> is seeking a Delivery Manager to oversee the successful execution of AI-driven projects and products. The ideal candidate will ensure projects are delivered on time, within scope, and aligned with client and business expectations while leading cross-functional teams.</p>\n<p><strong>Brief Description:</strong>\nTechvantage.ai is a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems. We build intelligent products that redefine industries and deliver exceptional value through cutting-edge AI technologies. Our mission is to design solutions that are not only powerful but also seamless, intuitive, and delightful to use.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Manage the end-to-end delivery of AI and product engineering projects, ensuring timelines, budgets, and quality standards are achieved.</li>\n<li>Collaborate with clients, product managers, and engineering teams to define project scope, delivery strategy, and KPIs.</li>\n<li>Lead project planning, execution, and risk management while driving continuous process improvement.</li>\n<li>Oversee resource allocation, capacity planning, and vendor coordination where required.</li>\n<li>Build and maintain strong client relationships, acting as a primary point of contact for delivery-related discussions.</li>\n<li>Mentor and guide delivery teams, fostering a culture of accountability, innovation, and excellence.</li>\n<li>Prepare and present delivery status reports, performance updates, and improvement plans to senior stakeholders.</li>\n</ul>\n<p><strong>Required Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Engineering, Business Administration, or related fields.</li>\n<li>10+ years of overall experience, including a minimum of 3 years in delivery/project management roles.</li>\n<li>Proven track record of delivering complex technology solutions, preferably in AI, SaaS, or enterprise products.</li>\n<li>Strong understanding of Generative AI, Agentic AI, or intelligent automation (preferred but not mandatory).</li>\n<li>Expertise in project management methodologies (Agile, Scrum, or Hybrid).</li>\n<li>Exceptional stakeholder management, communication, and leadership skills.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience managing multi-location or cross-functional teams.</li>\n<li>Familiarity with compliance, data privacy, and regulatory requirements in AI projects.</li>\n<li>Certifications like PMP, PRINCE2, or Agile/Scrum Master are a plus.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Opportunity to lead innovative AI projects with global impact.</li>\n<li>Collaborative and growth-driven work culture.</li>\n<li>Competitive salary with performance-based benefits.</li>\n<li>Learning and career advancement opportunities in cutting-edge AI domains.</li>\n</ul>\n<p><strong>Contact Information:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 10, Sept 2025</p>\n<p><strong>Company Addresses:</strong>\n- Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\n- 2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581</p>\n<p>http://www.techvantagesystems.com</p>",
        "tags": [
            "10+ Years",
            "Delivery Management",
            "AI",
            "Project Management"
        ],
        "summary": "Techvantage Systems is hiring a Delivery Manager to lead AI projects, ensuring timely and within-budget delivery. The role involves stakeholder management and team leadership to achieve project success."
    },
    {
        "job_title": "FUNDRAISING LEAD - 3+ years (REMOTE PART TIME)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23374",
        "location": "Technopark",
        "closing_date": "25 Oct 2025",
        "job_description": "<h2>Fundraising Lead (Remote, Part-Time)</h2>\n<p><strong>Reizend (P) Ltd</strong> is seeking a Fundraising Lead with 3+ years of experience to drive fundraising initiatives. This is a remote, part-time position.</p>\n<p><strong>Contact:</strong> careers@reizend.ai</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Identify and connect with potential investors (VCs, HNIs, Family Offices, PE firms).</li>\n<li>Prepare and present investment pitches, business plans, and financial models.</li>\n<li>Manage relationships with investors and provide timely updates.</li>\n<li>Support negotiations and deal structuring for fundraising.</li>\n<li>Work with leadership to align funding strategy with business goals.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Graduate/Postgraduate in Finance, Business, or related field.</li>\n<li>3+ years experience in fundraising, banking, wealth management, or investment sales.</li>\n<li>A strong network with investors and financial institutions is a plus.</li>\n<li>Excellent communication, presentation, and relationship-building skills.</li>\n<li>Knowledge of financial markets, investment products, and funding.</li>\n</ul>\n<p><strong>Details:</strong></p>\n<ul>\n<li><strong>Employment Type:</strong> Part-time</li>\n<li><strong>Experience:</strong> 3+ years</li>\n<li><strong>Preferred in:</strong> Banking / Wealth Management / Investment Advisory / Fundraising</li>\n<li><strong>CTC:</strong> 9 LPA</li>\n<li><strong>Work mode:</strong> Remote</li>\n</ul>\n<p><strong>Company Information:</strong></p>\n<ul>\n<li><strong>Address:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581</li>\n<li><strong>Website:</strong> http://www.reizendretail.in</li>\n</ul>\n<p><strong>Important Dates:</strong></p>\n<ul>\n<li><strong>Closing Date:</strong> 25, Oct 2025</li>\n<li><strong>Job Published:</strong> 10, Sept 2025</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Fundraising",
            "Investment",
            "Financial Modeling"
        ],
        "summary": "Seeking a Fundraising Lead to connect with investors and prepare pitches. Manage investor relationships to secure funding for business growth in this remote role."
    },
    {
        "job_title": "PostgreSQL Consultant (Architect)_9+Yrs_Remote",
        "company": "Saasvaap Techies (P) Ltd",
        "url": "https://technopark.org/job-details/23373",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>PostgreSQL Consultant (Architect)</h2>\n<p><strong>Saasvaap Techies (P) Ltd</strong>\nModule No.B-11, B-12, 3rd Floor, Gayatri Building, Phase-I Campus, Technopark, Thiruvananthapuram, 695581\nwww.saasvaap.com</p>\n<p><strong>Contact Email:</strong> careers@saasvaap.com</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 10, Sept 2025</p>\n<p><strong>Brief Description:</strong>\nWe are looking for an experienced PostgreSQL Consultant with strong architect-level expertise to join our team. The ideal candidate will have a proven track record in designing, implementing, and optimizing PostgreSQL databases for large-scale enterprise applications.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and implement scalable PostgreSQL database architectures.</li>\n<li>Optimize performance, security, and availability of PostgreSQL databases.</li>\n<li>Provide guidance on database migration, upgrades, and best practices.</li>\n<li>Collaborate with cross-functional teams to ensure database solutions meet business needs.</li>\n<li>Troubleshoot and resolve complex database issues.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>9+ years of professional experience in PostgreSQL.</li>\n<li>Proven experience in database architecture and design.</li>\n<li>Strong skills in performance tuning, replication, backup &amp; recovery.</li>\n<li>Experience with cloud platforms (AWS/Azure/GCP) is a plus.</li>\n<li>Excellent problem-solving and communication skills.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>PostgreSQL</li>\n<li>Database architecture and design</li>\n<li>Performance tuning</li>\n<li>Replication</li>\n<li>Backup &amp; recovery</li>\n<li>Cloud platforms (AWS/Azure/GCP)</li>\n</ul>",
        "tags": [
            "9+ Years",
            "PostgreSQL",
            "Database Architecture",
            "Performance Tuning"
        ],
        "summary": "Seeking a PostgreSQL Consultant (Architect) to design, implement, and optimize PostgreSQL databases. This role requires 9+ years of experience and strong skills in database architecture and performance tuning."
    },
    {
        "job_title": "CAPITAL RAISING MANAGER -3+ years (Remote)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23372",
        "location": "Technopark",
        "closing_date": "25 Oct 2025",
        "job_description": "<h2>Capital Raising Manager (Remote)</h2>\n<p><strong>Reizend (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 25, Oct 2025\n<strong>Job Published:</strong> 10, Sept 2025</p>\n<p><strong>Employment Type:</strong> Part-time\n<strong>Experience:</strong> 3+ years\n<strong>CTC:</strong> 9 LPA\n<strong>Work mode:</strong> Remote</p>\n<p>We are seeking a professional with strong experience in banking, wealth management, or investment advisory to drive fundraising initiatives for our technology firm. The role involves connecting with investors, preparing investment pitches, and managing relationships to secure funding for business growth.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Identify and connect with potential investors (VCs, HNIs, Family Offices, PE firms).</li>\n<li>Prepare and present investment pitches, business plans, and financial models.</li>\n<li>Manage relationships with investors and provide timely updates.</li>\n<li>Support negotiations and deal structuring for fundraising.</li>\n<li>Work with leadership to align funding strategy with business goals.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Graduate/Postgraduate in Finance, Business, or related field.</li>\n<li>3+ years experience in fundraising, banking, wealth management, or investment sales.</li>\n<li>A strong network with investors and financial institutions is a plus.</li>\n<li>Excellent communication, presentation, and relationship-building skills.</li>\n<li>Knowledge of financial markets, investment products, and funding.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Fundraising",
            "Investment Advisory",
            "Financial Modeling"
        ],
        "summary": "Seeking a Capital Raising Manager to drive fundraising for a technology firm. Responsibilities include investor relations, pitch preparation, and aligning funding strategy."
    },
    {
        "job_title": "Portfolio Investor Relations Manager - Remote (Part Time)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23371",
        "location": "Technopark",
        "closing_date": "25 Oct 2025",
        "job_description": "<h2>Portfolio Investor Relations Manager - Remote (Part Time)</h2>\n<p><strong>Reizend (P) Ltd</strong>\nSBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a></p>\n<p><strong>Contact Email:</strong> careers@reizend.ai</p>\n<p><strong>Closing Date:</strong> 25, Oct 2025\n<strong>Job Published:</strong> 10, Sept 2025</p>\n<p><strong>Employment Type:</strong> Part-time\n<strong>Experience:</strong> 3+ years\n<strong>CTC:</strong> 9 LPA\n<strong>Work Mode:</strong> Remote</p>\n<h3>Brief Description</h3>\n<p>We are seeking a professional with strong experience in banking, wealth management, or investment advisory to drive fundraising initiatives for our technology firm. The role involves connecting with investors, preparing investment pitches, and managing relationships to secure funding for business growth.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and connect with potential investors (VCs, HNIs, Family Offices, PE firms).</li>\n<li>Prepare and present investment pitches, business plans, and financial models.</li>\n<li>Manage relationships with investors and provide timely updates.</li>\n<li>Support negotiations and deal structuring for fundraising.</li>\n<li>Work with leadership to align funding strategy with business goals.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Graduate/Postgraduate in Finance, Business, or related field.</li>\n<li>3+ years experience in fundraising, banking, wealth management, or investment sales.</li>\n<li>A strong network with investors and financial institutions is a plus.</li>\n<li>Excellent communication, presentation, and relationship-building skills.</li>\n<li>Knowledge of financial markets, investment products, and funding.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Fundraising",
            "Investment Advisory",
            "Wealth Management"
        ],
        "summary": "Seeking a part-time Investor Relations Manager to drive fundraising for a technology firm. Responsibilities include investor relations, preparing pitches, and supporting funding negotiations."
    },
    {
        "job_title": "Behavioural Scientist - Freshers ( Part time)",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/23368",
        "location": "Technopark",
        "closing_date": "25 Oct 2025",
        "job_description": "<h2>Behavioral Scientist (Part-time, Remote)</h2>\n<p><strong>Reizend (P) Ltd</strong> is seeking a passionate and analytical Behavioral Scientist to help us understand, predict, and influence human behavior through research-driven interventions. You will apply behavioral science principles to solve complex challenges across domains such as user experience, public health, financial decision-making, or organizational design.</p>\n<p><strong>Contact:</strong> careers@reizend.ai</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design and conduct qualitative and quantitative behavioral research (e.g., surveys, interviews, ethnographic studies, experiments).</li>\n<li>Identify behavioral biases and drivers that influence decision-making and user actions.</li>\n<li>Translate insights into actionable strategies, nudges, or interventions that drive measurable outcomes.</li>\n<li>Collaborate cross-functionally with product, design, marketing, and strategy teams to embed behavioral science into solutions.</li>\n<li>Analyze data using statistical tools and behavioral frameworks.</li>\n<li>Design and evaluate behavior change interventions, pilots, or randomized control trials (RCTs).</li>\n<li>Communicate research findings through presentations, reports, and storytelling.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience working in [industry, e.g., digital health, fintech, public policy, etc.].</li>\n<li>Familiarity with human-centered design, design thinking, or service design.</li>\n<li>Published work or case studies in applied behavioral science.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Masters or Ph.D. in Behavioral Science, Psychology, Behavioral Economics, Cognitive Science, Sociology, or a related field.</li>\n<li>Proven experience applying behavioral science in real-world projects (industry, academic, or consultancy settings).</li>\n<li>Strong understanding of behavioral theories, models, and experimental design.</li>\n<li>Proficiency in tools such as SPSS, R, Python, or qualitative research platforms.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n<li>Ability to think critically, empathize with users, and simplify complex behaviors.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>Employment Type: Part-time</li>\n<li>CTC: 4 LPA</li>\n<li>Work Mode: Remote</li>\n<li>Closing Date: 25 Oct 2025</li>\n<li>Job Published: 10 Sept 2025</li>\n</ul>",
        "tags": [
            "0 Years",
            "Behavioral Science",
            "SPSS",
            "R",
            "Python"
        ],
        "summary": "Reizend is looking for a part-time, remote Behavioral Scientist to analyze and influence human behavior. The role involves research, data analysis, and cross-functional collaboration to drive measurable outcomes."
    },
    {
        "job_title": "Recruiting Online Teacher's/ SME's for Hindi,Malayalam, English",
        "company": "Doubtbox Edutainment (P) Ltd",
        "url": "https://technopark.org/job-details/23367",
        "location": "Technopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Doubtbox Edutainment - Online Teacher/SME</h2>\n<p>Doubtbox is a leading Personalised LIVE Learning platform for students in classes 1-12 (CBSE/ICSE/State Boards). They focus on personalized LIVE Online Teaching, tailored to individual learning styles. Previously partnered with Malayala Manorama, Doubtbox has reached over 1,00,000 students and is backed by the Times of India group. Recognized by Amazon Edstart as the best EdTech start-up of 2020, Doubtbox has a network of approximately 1000 teachers and is expanding into the Middle East.</p>\n<p><strong>Job Summary:</strong></p>\n<ul>\n<li>Creating and presenting lessons aligned with students’ educational needs.</li>\n<li>Encouraging classroom participation to reinforce learning.</li>\n<li>Grading homework promptly.</li>\n<li>Monitoring and reporting on student progress.</li>\n<li>Maintaining equipment in excellent condition.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in Education or a related field.</li>\n<li>Experience preferred.</li>\n<li>Proficiency in online teaching tools.</li>\n<li>Outstanding communication skills (verbal and written).</li>\n<li>Ability to manage students online.</li>\n<li>Excellent decision-making skills.</li>\n<li>Highly organized and creative.</li>\n<li>Constructive problem-solving skills.</li>\n<li>Excellent ability to motivate students.</li>\n<li>Good leadership skills.</li>\n<li>Highly knowledgeable in the subject.</li>\n<li>Excellent listening and analytical skills.</li>\n<li>Keen eye for detail.</li>\n<li>Ability to provide clear instructions.</li>\n<li>Excellent teaching and explanation abilities.</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li>Phone: 9072293322</li>\n<li>Email: hr@doubtbox.com</li>\n<li>Website: <a href=\"http://www.doubtbox.com\">http://www.doubtbox.com</a></li>\n</ul>\n<p><strong>Address:</strong></p>\n<p>1st Floor, Nila Building, Technopark, Trivandrum, 695581</p>\n<p><strong>Important Dates:</strong></p>\n<ul>\n<li>Closing Date: 10, Oct 2025</li>\n<li>Job Published: 10, Sept 2025</li>\n</ul>",
        "tags": [
            "Experience Preferred",
            "Online Teaching",
            "Communication Skills",
            "Subject Matter Expertise"
        ],
        "summary": "Doubtbox is hiring Online Teachers/SMEs to deliver engaging lessons and monitor student progress within their personalized learning platform. Ideal candidates should have strong communication skills and subject matter expertise."
    },
    {
        "job_title": "TELESALES EXECUTIVE-FEMALES PREFERRED",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23366",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>Telesales Executive (Females Preferred)</h2>\n<p><strong>TRAINONEX SOLUTIONS (P) Ltd</strong>\n1st FLOOR, M SQUARED BUILDING, ANNEX 1, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA, 695581\nwww.trainonexsolutions.in</p>\n<p><strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 10, Sept 2025</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are seeking a motivated and dynamic Telesales Executive to join our team. You will be responsible for dealing sales over the phone and maintaining good customer relationships. The goal is to help the company grow by bringing in customers and developing business. You will be expected to identify potential clients, qualify leads, and close deals. This is a great opportunity for individuals looking for a job.</p>\n<ul>\n<li>Need Immediate Joiners</li>\n<li>Work from office opportunity</li>\n<li>Experience: 0-1 years required</li>\n<li>Freshers can also apply</li>\n<li>Female Candidates preferred</li>\n<li>Have fluency with Malayalam Language</li>\n</ul>\n<p><strong>Preferred Skills:</strong>\n- Customer interaction\n- Communication\n- Time management</p>",
        "tags": [
            "0-1 Years",
            "Telesales",
            "Customer Interaction",
            "Communication"
        ],
        "summary": "Trainonex Solutions is seeking a Telesales Executive to drive sales and build customer relationships via phone. This role focuses on lead qualification and closing deals to boost company growth."
    },
    {
        "job_title": "Senior QA Engineer",
        "company": "Ospyn Technologies Ltd",
        "url": "https://technopark.org/job-details/23365",
        "location": "Technopark",
        "closing_date": "17 Sep 2025",
        "job_description": "<h2>Senior QA Engineer</h2>\n<p><strong>Ospyn Technologies Ltd</strong>\n1st Floor, Kabani Building,\nTechnopark Phase-4, Pallipuram,\nThiruvananthapuram, 695317\n<a href=\"http://www.ospyn.com\">http://www.ospyn.com</a></p>\n<p><strong>Closing Date:</strong> 17, Sept 2025\n<strong>Job Published:</strong> 10, Sept 2025\n<strong>Contact Email:</strong> careers@ospyn.com</p>\n<p><strong>Description:</strong></p>\n<ul>\n<li>Automation testing across various technologies and product sets</li>\n<li>Design and build automation test frameworks</li>\n<li>Work front end and back end</li>\n<li>Bug verification and tracking and fixing</li>\n<li>Test preparation, test design, execution and reporting</li>\n<li>Defect management lifecycle exposure (using Jira) from defect reporting to Track and publish the status or development, maintenance and execution of automation test suits</li>\n<li>Work as a key member of the Delivery Team to understand requirements and technical solutions under test</li>\n<li>Work with manual testers, developers and SME's to understand the business domain, and the system functionality</li>\n<li>Utilize the approved test automation frameworks to develop automation in a fast-paced agile environment.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Meeting with the software design team to discuss verification protocols.</li>\n<li>Identifying software application weaknesses and target areas.</li>\n<li>Sketching out ideas for automated software test procedures.</li>\n<li>Reviewing software bug reports and highlighting problem areas.</li>\n<li>Writing automation scripts and implementing software applications.</li>\n<li>Designing and installing software databases.</li>\n<li>Troubleshooting automation software and finalizing system procedures.</li>\n<li>Identifying quality issues and creating test reports.</li>\n<li>Collaborating with the design team to solve application faults.</li>\n</ul>\n<p><strong>Education Qualification:</strong> B.Tech/ MCA/BCA/ M.Tech</p>\n<p><strong>Experience Required:</strong> 4+ year</p>\n<p><strong>Job Location:</strong> Trivandrum</p>",
        "tags": [
            "4+ Years",
            "Automation Testing",
            "Jira",
            "Test Automation Frameworks"
        ],
        "summary": "Ospyn Technologies is seeking a Senior QA Engineer to design and build automation test frameworks. The role involves automation testing, bug verification, and working with the delivery team."
    },
    {
        "job_title": "Test Manager (Finacle)",
        "company": "Xilligence",
        "url": "https://technopark.org/job-details/23362",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Test Manager (Finacle)</h2>\n<p><strong>Company:</strong> Xilligence\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Contact:</strong> devika.chandana@xilligence.com\n<strong>Closing Date:</strong> 30, Sept 2025\n<strong>Published Date:</strong> 10, Sept 2025</p>\n<p>We are seeking an experienced Test Manager with strong Finacle and Core Banking expertise to lead end-to-end testing efforts across large-scale banking transformation programs. The role involves test strategy definition, planning, execution, and stakeholder management, ensuring delivery of high-quality, defect-free banking solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ol>\n<li>\n<p><strong>Proven Experience</strong></p>\n<ul>\n<li>Manage end-to-end testing for large-scale Core Banking / Finacle implementations.</li>\n<li>Strong domain expertise in Finacle Core Banking (Customer, Accounts, Debit Cards, Treasury).</li>\n<li>Good to have: Wealth Management, Private Banking, and AML systems experience.</li>\n<li>Hands-on experience in UI, API, and Integration Testing across banking applications.</li>\n</ul>\n</li>\n<li>\n<p><strong>Test Planning &amp; Strategy</strong></p>\n<ul>\n<li>Define and document overall test strategy &amp; plan aligned to project milestones.</li>\n<li>Estimate resources, timelines, prerequisites across test phases.</li>\n<li>Drive test scope finalization with business teams.</li>\n<li>Exposure to test data management, environment management, and performance testing.</li>\n</ul>\n</li>\n<li>\n<p><strong>Team Management &amp; Coordination</strong></p>\n<ul>\n<li>Build and manage a cross-functional test team (manual, API, automation, performance) across Onsite and Offshore locations.</li>\n<li>Assign responsibilities, manage workloads, and ensure productivity.</li>\n<li>Conduct daily stand-ups, review meetings, and test sign-offs.</li>\n<li>Guide the team on UI, API, and system integration testing.</li>\n</ul>\n</li>\n<li>\n<p><strong>Test Design, Execution &amp; Reporting</strong></p>\n<ul>\n<li>Ensure best practices in test documentation, versioning, and result archiving.</li>\n<li>Oversee test scenario, test case, and test data design.</li>\n<li>Ensure complete coverage across SIT, UAT, Regression, E2E, and Performance testing.</li>\n<li>Track execution, defect triaging, and resolution follow-ups.</li>\n<li>Drive integration testing between modules and applications.</li>\n<li>Prepare and share daily/weekly reports, dashboards, and go/no-go metrics.</li>\n</ul>\n</li>\n<li>\n<p><strong>Defect &amp; Risk Management</strong></p>\n<ul>\n<li>Manage the defect lifecycle using Azure DevOps (ADO) as the test management tool.</li>\n<li>Identify risks and dependencies proactively with mitigation strategies.</li>\n</ul>\n</li>\n<li>\n<p><strong>Test Automation</strong></p>\n<ul>\n<li>Collaborate with automation leads to define automation scope &amp; strategy.</li>\n<li>Promote automation of UI and API test cases to accelerate delivery and ROI.</li>\n</ul>\n</li>\n<li>\n<p><strong>Stakeholder Communication</strong></p>\n<ul>\n<li>Act as the primary QA representative in project meetings (Scrum, Steering, Release Planning).</li>\n<li>Ensure stakeholder alignment on entry/exit criteria, readiness, and defect acceptance.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>10–15 years of experience in software testing, with 5+ years as a Test Manager.</li>\n<li>Proven expertise in Finacle CBS 11x or 10x and Core Banking domain.</li>\n<li>Strong knowledge of UI, API, and Integration testing methodologies.</li>\n<li>Experience with Azure DevOps (ADO) or similar test management tools.</li>\n<li>Strong leadership, communication, and stakeholder management skills.</li>\n<li>Knowledge of automation &amp; performance testing preferred.</li>\n</ul>\n<p><strong>Contact Information:</strong>\nXilligence\nXilligence611-615, 6th Floor, Nila, Technopark, Trivandrum. , 695581\nhttp://www.xilligence.com</p>",
        "tags": [
            "5+ Years",
            "Finacle",
            "Azure DevOps (ADO)",
            "UI/API Testing"
        ],
        "summary": "Xilligence is looking for a Test Manager to lead end-to-end testing for large-scale Finacle/Core Banking implementations. The role requires expertise in test strategy, team management, and stakeholder communication."
    },
    {
        "job_title": "QA LEAD",
        "company": "Xilligence",
        "url": "https://technopark.org/job-details/23361",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>QA Lead</h2>\n<p><strong>Location:</strong> Xilligence, Technopark, Trivandrum</p>\n<p><strong>Contact:</strong> libin.raj@xilligence.com</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 10, Sept 2025</p>\n<p>We are seeking an experienced QA Lead with expertise in Way4 Card Management System, Base24 Switch, and Tokenization (Apple Pay, Google Pay). This role involves leading and executing System Integration Testing (SIT) and supporting SIT/UAT for debit/credit card programs, ensuring complete coverage across card lifecycle, transaction processing, and digital wallet/tokenisation flows.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Define SIT test strategy and detailed coverage for card issuance, lifecycle, limits, fees, and tokenisation.</li>\n<li>Execute and validate end-to-end flows across ATM, POS, and E-Commerce via Base24 switch (ISO 8583 messaging).</li>\n<li>Test tokenisation lifecycle (provision, suspend/resume, delete, multi-device DPAN mapping).</li>\n<li>Validate negative scenarios (expired/blocked cards, insufficient funds, blacklist MCCs, invalid OTP, failed cryptograms).</li>\n<li>Verify integration flows: Way4 ↔ Base24 ↔ Core Banking (Finacle)</li>\n<li>Validate fees, limits, markups, and CVM/contactless rules for PAN and DPAN transactions.</li>\n<li>Perform field validations for approvals, declines, reversals, and settlement messages.</li>\n<li>Collaborate with vendors, business, and scheme partners to triage issues and drive resolution.</li>\n<li>Provide test evidence, dashboards, and sign-off support for SIT and UAT phases.</li>\n</ul>\n<p><strong>Preferred Skills &amp; Experience:</strong></p>\n<ul>\n<li>Hands-on experience in Way4 CMS testing – product setup, card lifecycle, integration.</li>\n<li>Strong knowledge of Base24 Switch – ATM/POS transaction routing, ISO 8583 messages, response codes.</li>\n<li>Proven expertise in Tokenisation (Apple Pay, Google Pay).</li>\n<li>Experience with debit/credit card flows: issuance, hotlisting, reissue, PIN management, reversals, refunds, chargebacks.</li>\n<li>Knowledge of AML/Fraud screening, velocity rules, blacklist handling.</li>\n<li>Understanding PCI DSS, HSM, encryption.</li>\n<li>Familiarity with tools: Azure DevOps and card scheme simulators.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Ability to work with vendors and business stakeholders under tight timelines.</li>\n<li>Excellent documentation, reporting, and communication skills.</li>\n<li>Leadership experience in test planning and execution (for Test Lead roles).</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Way4 CMS",
            "Base24 Switch",
            "Tokenization"
        ],
        "summary": "Seeking a QA Lead to lead System Integration Testing (SIT) for debit/credit card programs. The role involves expertise in Way4, Base24, and Tokenization to ensure complete test coverage."
    },
    {
        "job_title": "Digital Media Specialist",
        "company": "Xilligence",
        "url": "https://technopark.org/job-details/23360",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Digital Media Specialist</h2>\n<p><strong>XILLIGENCE</strong> is seeking a Digital Media Specialist to join our team. This is a remote (WFH) position with an EST shift.</p>\n<p><strong>Location:</strong> Xilligence611-615, 6th Floor, Nila, Technopark, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.xilligence.com</p>\n<p><strong>Contact Email:</strong> sruthi.mohan@xilligence.com</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Create and launch Meta campaigns (Facebook, Instagram) with appropriate budget, goals, geo, audience settings.</li>\n<li>Troubleshoot and solve problems within the campaigns.</li>\n<li>Understanding of tracking/tagging of Meta campaigns for reporting.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Ability to provide optimization recommendations of Meta campaigns.</li>\n<li>Experience in Google Ads, Google Display Network, Google Performance Max.</li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>2-6 Years</li>\n</ul>\n<p><strong>Notice Period:</strong></p>\n<ul>\n<li>0-30 Days</li>\n</ul>\n<p><strong>Closing Date:</strong> 30, Sept 2025</p>\n<p><strong>Job Published:</strong> 10, Sept 2025</p>",
        "tags": [
            "2-6 Years",
            "Meta Campaigns",
            "Facebook",
            "Instagram"
        ],
        "summary": "XILLIGENCE is hiring a Digital Media Specialist to create and manage Meta campaigns. The role requires experience with campaign optimization and troubleshooting, with a focus on achieving specific goals."
    },
    {
        "job_title": "Automation Test Engineer",
        "company": "Xilligence",
        "url": "https://technopark.org/job-details/23359",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Automation Test Engineer</h2>\n<p><strong>Xilligence</strong> is seeking an Automation Test Engineer to join our growing team. The ideal candidate should possess strong knowledge of UI and API testing and have hands-on experience in testing simple to complex UI applications for both Web and Mobile, including framework setup and maintenance, to ensure quality across all deliverables.</p>\n<p><strong>Contact Information:</strong> devika.chandana@xilligence.com</p>\n<p><strong>Location:</strong> Onsite, Trivandrum</p>\n<p><strong>Experience:</strong> 3-4 years</p>\n<p><strong>Notice Period:</strong> Immediate to 15 days</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain automated test scripts for UI (Web + Mobile).</li>\n<li>Responsible for owning and delivering the automation solution for various teams.</li>\n<li>Collaborate with developers, product managers, and other QA team members to ensure high-quality releases.</li>\n<li>Timely reporting of bugs/failures of applications and close collaboration with the development team to understand the root cause.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science, Engineering, or related field.</li>\n<li>Banking domain experience.</li>\n<li>Minimum of 3 years of experience in software testing with a focus on test automation.</li>\n<li>Strong knowledge of UI automation with Ranorex Studio.</li>\n<li>Strong knowledge of C#.</li>\n<li>Basic knowledge of version control tools like Git, Bitbucket.</li>\n<li>Proficiency in optimizing x-Paths</li>\n<li>Experience working with Agile/Scrum methodologies.</li>\n<li>Excellent analytical, debugging, and problem-solving skills.</li>\n</ul>\n<p><strong>Closing Date:</strong> 30, Sept 2025</p>\n<p><strong>Job Published:</strong> 10, Sept 2025</p>",
        "tags": [
            "3-4 Years",
            "UI Automation",
            "Ranorex Studio",
            "C#"
        ],
        "summary": "Xilligence is hiring an Automation Test Engineer to design and maintain automated test scripts. The role requires experience with UI/API testing, Ranorex Studio, and C#."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/23358",
        "location": "Technopark",
        "closing_date": "14 Sep 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>Picky Assist Pvt Ltd (Kerala Startup Mission)</strong></p>\n<p><strong>Location:</strong> T-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581</p>\n<p><strong>Website:</strong> <a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<p><strong>Contact Email:</strong> careers@pickyassist.com</p>\n<p><strong>Closing Date:</strong> 14, Sept 2025</p>\n<p><strong>Job Published:</strong> 10, Sept 2025</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Full Time - On-Site</li>\n</ul>\n<p><strong>Eligibility:</strong></p>\n<ul>\n<li>MBA graduates of 2024 and 2025, who have completed all exams and are waiting for results, with no backlogs in declared results.</li>\n<li>OR a minimum of 1 year of experience in sales (MBA is not mandatory. Salary will depend on your work experience and interview performance).</li>\n</ul>\n<p><strong>Salary:</strong> ₹20,000/month (Basic Salary + Incentive) for fresh MBA graduates.  Salary will depend on your work experience and interview performance for candidates with 1+ year of sales experience</p>\n<p><strong>Number of Vacancies:</strong> 5</p>\n<ul>\n<li>Preference will be given to candidates based in Trivandrum or those who are willing to relocate to Trivandrum.</li>\n</ul>\n<p><strong>Responsibilities and Duties</strong></p>\n<ul>\n<li>Dealing with our clients all over the world</li>\n<li>Finding New Prospective (Generating Leads can be found everywhere from small shops to big MNCs)</li>\n<li>Fixing Appointment (Online Meeting)</li>\n<li>Preparing Customised Presentations (Solutions)</li>\n<li>Giving Demo (Google Meet, Zoom)</li>\n<li>Participating in Seminars &amp; Exhibitions (Networking)</li>\n<li>Closing Sales &amp; Generating Revenue (Numbers matter)</li>\n<li>Followup with Customers (Never Quit)</li>\n<li>First Level Training (After Sales)</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>A bit of background and understanding of how technology works in a business</li>\n<li>Must have completed MBA (BBA/B Tech with MBA candidates can also apply)</li>\n<li>Good Communication Skills (Fluency in English Mandatory)</li>\n<li>Preference to candidates knowing any international languages</li>\n<li>Ability to Convince No to Yes</li>\n<li>Preference to candidates with a minimum of 1 year of experience in sales</li>\n<li>Freshers with Go Getting Attitude Can also apply</li>\n<li>Willingness to learn every day</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<p>Our company provides a positive working environment with personal and professional growth opportunities. We guarantee a future-proof job and a commitment to annual salary increments based on performance. We believe in recognizing the hard work of our employees and offer numerous opportunities for career progression.</p>\n<p>If you are passionate about business development, sales, and technology and want to be part of a team that strives for excellence, we would love to hear from you.</p>\n<p><strong>How to Apply</strong></p>\n<p>Send your CV to careers@pickyassist.com or WhatsApp <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Mobile &amp; Data Allowance</li>\n<li>Sales Incentive based on performance</li>\n<li>Flexible Shift Timings</li>\n</ul>\n<p><strong>Work Timings, Job Location &amp; Salary</strong></p>\n<ul>\n<li>10 am to 06 pm Monday to Saturday</li>\n<li>Office Location: Edapazhanji, Trivandrum</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>All candidates must be fluent in English and the Local Language</li>\n<li>Preference will be given to candidates who can communicate in any foreign language</li>\n<li>Linguistic Skills</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Sales",
            "Business Development",
            "Communication Skills"
        ],
        "summary": "Picky Assist is hiring a Business Development Executive to deal with clients, generate leads, and close sales. The role involves presentations, demos, and requires strong English communication."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Prompttech Global (P) Ltd",
        "url": "https://technopark.org/job-details/23356",
        "location": "Technopark",
        "closing_date": "10 Oct 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p><strong>PromptTech Global (P) Ltd</strong>\nModule No 315, Nila Building,\nTechnopark Campus, 695581\n<a href=\"https://prompttechsolutions.com\">https://prompttechsolutions.com</a></p>\n<p><strong>Closing Date:</strong> 10, Oct 2025\n<strong>Job Published:</strong> 10, Sept 2025\n<strong>Contact Email:</strong> hr@prompttechglobal.com</p>\n<p><strong>Brief Description:</strong></p>\n<p>We are looking for a Business Development Executive to build and maintain relationships with clients. The ideal candidate will have strong interpersonal skills, sales experience, and the ability to understand customer needs and preferences. This role requires excellent communication skills, customer service orientation, and the ability to meet sales targets.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Actively seek out and bring on new customers to grow our clientele.</li>\n<li>Promote products and services to clients through effective sales presentations, demonstrations, and discussions.</li>\n<li>Answering incoming calls from customers or prospects who are interested in a product, or service, or have inquiries.</li>\n<li>Working towards achieving specific sales targets, such as revenue goals conversion rates, or customer acquisition metrics.</li>\n<li>Collaborate across departments such as sales, marketing and product development to ensure that the client's needs are being met.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Candidate should have a good command over English language and excellent communication skills.</li>\n<li>Maintaining a deep knowledge of company products and services.</li>\n<li>Ability to build and maintain relationships with clients.</li>\n<li>Relationship management</li>\n<li>Problem-solving</li>\n<li>Adaptability</li>\n<li>Teamwork</li>\n<li>Integrity</li>\n<li>Sales target achievement</li>\n<li>Market knowledge</li>\n</ul>",
        "tags": [
            "1+ Years",
            "Sales",
            "Communication Skills",
            "Relationship Management"
        ],
        "summary": "Seeking a Business Development Executive to cultivate client relationships. Requires sales experience, strong communication, and the ability to meet targets."
    },
    {
        "job_title": "Sales Executive",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23355",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Sales Executive</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a motivated and goal-oriented Sales Executive to join our team. If you’re passionate about cutting-edge AI and have the drive to scale growth, this is your chance to be part of something transformational.</p>\n<p><strong>Contact:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Drive sales growth across B2B, B2C, and D2C channels by identifying new business opportunities and managing existing accounts.</li>\n<li>Develop and implement effective sales strategies to achieve revenue and profitability targets.</li>\n<li>Build strong client relationships through effective communication, regular follow-ups, and personalized engagement.</li>\n<li>Collaborate with marketing and service delivery teams to ensure seamless execution and customer satisfaction.</li>\n<li>Conduct market research to identify trends, competitor activities, and emerging opportunities.</li>\n<li>Negotiate and close deals while maintaining high levels of customer satisfaction.</li>\n<li>Prepare and present sales reports, forecasts, and performance analyses to the management team.</li>\n</ul>\n<p><strong>Required Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, or a related field.</li>\n<li>Minimum of 3 years of proven sales experience across B2B, B2C, and/or D2C sectors.</li>\n<li>Strong understanding of both product-based and service-based sales cycles.</li>\n<li>Excellent negotiation, presentation, and communication skills.</li>\n<li>Ability to manage multiple accounts and prioritize tasks effectively.</li>\n<li>Proficiency in CRM tools and Microsoft Office Suite.</li>\n<li>Strong analytical mindset with a target-driven approach.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience in technology, SaaS, or service delivery domains.</li>\n<li>Familiarity with digital sales, online marketing channels, or e-commerce strategies.</li>\n<li>Ability to work independently and in a fast-paced environment.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Competitive salary and performance-based incentives.</li>\n<li>Opportunity to work with diverse product and service portfolios.</li>\n<li>Career growth in a high-performance sales environment.</li>\n<li>Dynamic and collaborative workplace culture.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Sales",
            "B2B",
            "CRM"
        ],
        "summary": "Techvantage Systems is hiring a Sales Executive to drive growth across multiple channels. The ideal candidate will have 3+ years of sales experience and strong communication skills."
    },
    {
        "job_title": "Senior/Lead Software Engineer – Java Development",
        "company": "Trenser Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23354",
        "location": "Technopark",
        "closing_date": "21 Sep 2025",
        "job_description": "<h2>TRENSER Technology Solutions (P) Ltd - Senior/Lead Software Engineer – Java Development</h2>\n<p><strong>Location:</strong> Thejaswini, 2nd floor, Technopark Campus, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.trenser.com\">http://www.trenser.com</a>\n<strong>Closing Date:</strong> 21, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careers@trenser.com\">careers@trenser.com</a></p>\n<h3>Overview</h3>\n<p>This position is for a Full Stack Developer responsible for developing Java-based backend and React-based frontend for a long-term project with a North American client. The job location is Trivandrum, India. The candidate will work with the existing project team on technical and management aspects, including requirement elicitation, software architecture design, implementation, and code reviews. The candidate will be responsible for taking each assigned task to completion, ensuring the quality of deliverables. They should have self-initiative, decision-making, and self-directing capabilities to work with minimal supervision and a “go-getter” attitude.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Perform software requirements analysis and determine the functional and non-functional requirements of the project.</li>\n<li>Analyze requirements to create solutions and software architecture design.</li>\n<li>Write product quality code and perform developer-level verification.</li>\n<li>Communicate with clarity of requirements and expectations of deliverables.</li>\n<li>Ensure on-time delivery of the product with quality.</li>\n<li>Work closely with stakeholders, including customers, to ensure successful project execution.</li>\n<li>Manage priority changes and conflicts gracefully with stakeholders involved.</li>\n<li>Address customer escalations and be able to think at a fast pace to identify and solve issues in the product.</li>\n<li>Proactively use/suggest tools and systems to improve quality, productivity, etc.</li>\n<li>Stay up to date on relevant technology and process advancements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>More than five years of experience in software development.</li>\n<li>At least 3 years of experience in Java development.</li>\n<li>Experience in developing Web APIs / RESTful services using Spring Boot.</li>\n<li>Experience in NoSQL databases like MongoDB.</li>\n<li>Experience with code quality tools and unit testing.</li>\n<li>Proficient with JavaScript/TypeScript.</li>\n<li>Knowledge of other web technologies and UI/UX standards.</li>\n<li>Understanding of Material design principles and guidelines.</li>\n<li>Familiarity with Authentication and Authorization concepts and frameworks.</li>\n<li>Familiarity with other JavaScript-based frameworks like Angular / React Native is an added advantage.</li>\n<li>Proficient in debugging web pages to isolate functional (JavaScript) and style (CSS) issues.</li>\n<li>Good understanding and experience with code versioning tools, e.g., git.</li>\n<li>Good understanding of software development lifecycles (SDLC), version control, and traceability.</li>\n<li>Experience in developing software under Agile development methodology.</li>\n<li>Knowledgeable and well-versed with various development tools for designing, coding, debugging/troubleshooting, testing, bug tracking, collaboration, and source control.</li>\n<li>Bachelor’s degree or equivalent in Engineering discipline - Computer/Electronics.</li>\n</ul>\n<h3>Knowledge, Skills, and Abilities</h3>\n<ul>\n<li>Outstanding attitude and energy to explore unfamiliar software implementations and troubleshoot issues.</li>\n<li>Strong interpersonal skills to get things done as a team.</li>\n<li>Flexible to work in a distributed and collaborative global team environment across time zones.</li>\n<li>Excellent written and oral communication skills.</li>\n<li>Hardworking with a “whatever it takes” attitude.</li>\n<li>Ability to judge and estimate work volume for given tasks.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Java",
            "Spring Boot",
            "React"
        ],
        "summary": "Seeking a Senior/Lead Software Engineer for Java and React development, contributing to a long-term project. Responsibilities include software design, coding, and collaboration within an Agile environment."
    },
    {
        "job_title": "Lead Pre Sales - IT Services",
        "company": "Inapp Information Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23353",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Lead Pre Sales - IT Services</h2>\n<p><strong>InApp Information Technologies India (P) Ltd</strong>\n209 S, 9th Floor, Yamuna, Technopark Phase 3, 695583\n<a href=\"http://www.inapp.com\">http://www.inapp.com</a></p>\n<p><strong>Contact Email:</strong> careers@inapp.com</p>\n<p><strong>Role:</strong> Lead Pre Sales - IT Services\n<strong>Experience:</strong> 5-10 years\n<strong>Location:</strong> Hybrid (Trivandrum / Kochi)</p>\n<h3>Job Summary</h3>\n<p>We are seeking a dynamic and detail-oriented Presales Consultant to support our IT services sales team. The ideal candidate will have a strong understanding of IT service offerings, excellent communication skills, and proven experience in responding to RFPs, creating compelling case studies, and collaborating across technical and business teams. The candidate should be ready to work flexible hours to accommodate global client meetings and deliverables.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>RFP &amp; Proposal Management</strong>\n- Analyze and respond to RFPs, RFIs, and RFQs with high-quality proposals.\n- Coordinate with delivery, finance, legal, and technical teams to gather inputs.\n- Ensure proposals are tailored to client needs and aligned with company capabilities.\n- Maintain a repository of reusable proposal content and templates.</p>\n<p><strong>Solution Design &amp; Client Engagement</strong>\n- Understand client requirements and create suitable proposal documents.\n- Participate in client calls, presentations of the proposals and any workshops.\n- Collaborate with architects and SMEs to design proposals and SOWs.</p>\n<p><strong>Collaboration &amp; Cross-functional Interaction</strong>\n- Work closely with sales, delivery, marketing, and account teams.\n- Facilitate internal reviews and approvals for proposals and solutions.\n- Act as a bridge between technical teams and customer business stakeholders.</p>\n<p><strong>Content Development</strong>\n- Create and maintain case studies, capability decks, and client success stories.</p>\n<h3>Required Skills</h3>\n<ul>\n<li>Experience in IT services presales or solution consulting.</li>\n<li>Understanding of IT service domains (e.g., cloud, infrastructure, application services).</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to manage multiple proposals and deadlines simultaneously.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience with global clients and multi-geography proposals.</li>\n<li>Familiarity with Agile or other service delivery frameworks.</li>\n<li>Prior experience in creating sales enablement content.</li>\n</ul>",
        "tags": [
            "5-10 Years",
            "IT Services",
            "RFP",
            "PreSales"
        ],
        "summary": "Seeking a Presales Consultant to support the IT services sales team. The role involves managing RFPs, designing solutions, and collaborating with cross-functional teams."
    },
    {
        "job_title": "Full Stack Developer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23352",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Full Stack Developer</h2>\n<p><strong>TECHVANTAGE SYSTEMS (P) Ltd</strong>\nModule L1A, Level -1, Thejaswini, Technopark, Trivandrum\nand\n2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581\n<a href=\"http://www.techvantagesystems.com\">http://www.techvantagesystems.com</a></p>\n<p><strong>Closing Date:</strong> 22, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<p>Techvantage.ai is a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems. We build intelligent, cutting-edge solutions that push the boundaries of what’s possible through AI and human-machine collaboration.</p>\n<p>We are seeking a skilled and proactive <strong>Full Stack Developer</strong> with 4–5 years of experience to join our dynamic team. The ideal candidate will be proficient in ReactJS and NodeJS, with a strong ability to deliver high-quality, scalable applications across web and mobile platforms. Experience in the insurance domain will be considered a significant advantage.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and maintain scalable web and mobile applications using ReactJS and React Native.</li>\n<li>Build robust backend services and RESTful APIs using NodeJS.</li>\n<li>Collaborate with UI/UX designers and product managers to implement functional and intuitive interfaces.</li>\n<li>Participate in code reviews and contribute to continuous improvement of development practices.</li>\n<li>Optimize applications for performance, security, and scalability.</li>\n<li>Debug and troubleshoot issues across the full stack.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>4–5 years of hands-on experience in full stack development.</li>\n<li>Strong proficiency in ReactJS and NodeJS.</li>\n<li>Experience with state management tools such as Redux or Context API.</li>\n<li>Familiarity with RESTful API design and integration.</li>\n<li>Solid understanding of frontend technologies (HTML, CSS, JavaScript/TypeScript).</li>\n<li>Experience working with databases like MongoDB, PostgreSQL, or MySQL.</li>\n<li>Good understanding of Git and version control workflows.</li>\n<li>Ability to work independently and in a team environment.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n</ul>",
        "tags": [
            "4-5 Years",
            "ReactJS",
            "NodeJS",
            "RESTful API"
        ],
        "summary": "Seeking a Full Stack Developer to build scalable web/mobile applications using ReactJS and NodeJS. Insurance domain experience is a plus for this dynamic team."
    },
    {
        "job_title": "UI/UX Designer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23351",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>UI/UX Designer</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a creative and skilled UI/UX Designer with experience in AI-driven products to join our team. Techvantage.ai is a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems. We build intelligent products that redefine industries and deliver exceptional value through cutting-edge AI technologies. Our mission is to design solutions that are not only powerful but also seamless, intuitive, and delightful to use.</p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design intuitive, visually appealing, and user-friendly interfaces for AI-powered applications and platforms.</li>\n<li>Work closely with product managers, AI engineers, and developers to translate complex AI functionalities into seamless user experiences.</li>\n<li>Conduct user research, usability testing, and gather feedback to improve designs continuously.</li>\n<li>Develop wireframes, prototypes, user flows, and mockups that communicate design concepts effectively.</li>\n<li>Ensure the UI/UX design aligns with brand guidelines, accessibility standards, and modern design principles.</li>\n<li>Stay updated with the latest trends in AI-driven user experience, conversational UI, and adaptive interfaces.</li>\n<li>Collaborate in creating engaging data visualization and interactive dashboards for AI analytics tools.</li>\n</ul>\n<p><strong>Required Skills and Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Design, HCI, Computer Science, or a related field.</li>\n<li>2–6 years of proven experience as a UI/UX Designer, preferably in AI or data-driven product environments.</li>\n<li>Proficiency in design tools such as Figma, Adobe XD, Sketch, or similar.</li>\n<li>Strong understanding of user-centered design principles, responsive design, and accessibility standards (WCAG).</li>\n<li>Experience in designing for AI products (chatbots, LLM-powered tools, recommendation engines, etc.) is mandatory.</li>\n<li>Familiarity with front-end technologies (HTML, CSS, JavaScript) is a plus.</li>\n<li>Strong portfolio showcasing user-friendly, innovative, and visually appealing designs.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience in conversational UI/UX or generative AI-based tools.</li>\n<li>Knowledge of data visualization best practices for AI/ML outputs.</li>\n<li>Ability to work in agile environments and collaborate with cross-functional teams.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Opportunity to design cutting-edge AI-driven products.</li>\n<li>Collaborative and innovative work culture.</li>\n<li>Competitive salary and benefits package.</li>\n<li>Continuous learning and growth opportunities in the AI space.</li>\n</ul>\n<p><strong>Contact Information:</strong>\nTECHVANTAGE SYSTEMS (P) Ltd\nModule L1A, Level -1, Thejaswini, Technopark, Trivandrum\nand\n2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581\nhttp://www.techvantagesystems.com</p>",
        "tags": [
            "2-6 Years",
            "UI/UX Design",
            "Figma",
            "AI Products"
        ],
        "summary": "Techvantage Systems is looking for a UI/UX Designer to design user-friendly interfaces for AI-powered applications. The candidate will work with AI engineers to translate complex functionalities into seamless user experiences."
    },
    {
        "job_title": "Senior Python Developer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23350",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Senior Python Developer</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a passionate and experienced Senior Python Developer to join our dynamic team. Techvantage.ai is a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and Autonomous Intelligent Systems.</p>\n<p><strong>Contact:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Locations:</strong>\n- Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\n- 2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581\n- http://www.techvantagesystems.com</p>\n<p><strong>Job Overview:</strong>\nYou will be responsible for designing, developing, and maintaining scalable backend services and APIs using Python. </p>\n<p><strong>Key Responsibilities:</strong>\n- Design, develop, test, and maintain Python-based backend services and APIs.\n- Write clean, maintainable, and efficient code following best practices.\n- Collaborate with frontend developers, designers, and other backend engineers to deliver high-quality software solutions.\n- Optimize performance and scalability of applications.\n- Integrate with third-party APIs and data sources.\n- Participate in code reviews and contribute to team learning and improvement.\n- Troubleshoot and debug applications as needed.\n- Maintain clear documentation of code and technical processes.</p>\n<p><strong>Required Skills:</strong>\n- 3–5 years of hands-on experience in Python development.\n- Strong understanding of web frameworks such as Django, Flask, or FastAPI.\n- Experience in building RESTful APIs and microservices.\n- Solid knowledge of relational databases (e.g., PostgreSQL, MySQL) and/or NoSQL databases (e.g., MongoDB, Redis).\n- Familiarity with version control systems like Git.\n- Good understanding of software development life cycle (SDLC) and Agile methodologies.\n- Strong problem-solving and communication skills.\n- Experience with cloud platforms (AWS, GCP, or Azure) is a plus.</p>\n<p><strong>Nice to Have:</strong>\n- Experience with containerization tools like Docker and orchestration tools like Kubernetes.\n- Familiarity with CI/CD pipelines.\n- Exposure to DevOps practices or basic system administration.</p>",
        "tags": [
            "3-5 Years",
            "Python",
            "RESTful APIs",
            "Django"
        ],
        "summary": "TechVantage Systems is looking for a Senior Python Developer to design, develop, and maintain scalable backend services and APIs. The role involves collaboration and optimization of application performance."
    },
    {
        "job_title": "AI/ ML Engineer",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23349",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>AI/ML Engineer</h2>\n<p><strong>ZL Software Systems (P) Ltd</strong>\nC-22, - 2 Floor, Thejaswini Building, Phase-1 Campus, Technopark, Trivandrum, Kerala, India , 695581\n<a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> <a href=\"mailto:careerstvm@zlinkcorp.com\">careerstvm@zlinkcorp.com</a></p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Strong experience in Data Analytics and Modeling</li>\n<li>Strong knowledge and experience with SQL queries and Database Management Systems (SQL Server)</li>\n<li>Strong experience in GenAI, LLMs (OpenAI, Hugging Face, etc.) and their integration through APIs or fine-tuning for domain-specific use cases.</li>\n<li>Experience with Apache Spark, PySpark, and distributed data processing.</li>\n<li>Strong programming skills in Python (preferred), with experience in AI/ML frameworks like scikit-learn, Hugging Face Transformers, or Keras.</li>\n<li>Experience with MLOps tools, version control (Git), and basic cloud services (preferably Azure).</li>\n<li>Proficiency in Data extraction using natural language prompts using LLM pipelines.</li>\n<li>Excellent problem-solving skills and an independent, ownership-driven attitude.</li>\n<li>Knowledge in Azure AI studio, Visual Studio Copilot.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s or master’s degree in computer science, Data Science, or related field.</li>\n<li>3–5 years of relevant hands-on experience in AI/ML, data engineering, or intelligent automation</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "GenAI/LLMs",
            "Python",
            "SQL"
        ],
        "summary": "Seeking an AI/ML Engineer to work with GenAI, LLMs, and data extraction. Requires 3-5 years of experience in AI/ML and proficiency in Python and SQL."
    },
    {
        "job_title": "Product Experience Designer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23348",
        "location": "Technopark",
        "closing_date": "21 Sep 2025",
        "job_description": "<h2>Product Experience Designer (UX/UI)</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a highly creative and experienced Product Experience Designer to join our growing product team. In this role, you will play a critical part in shaping the user experience of our AI-driven platforms. You'll collaborate with cross-functional teams to turn sophisticated AI capabilities into intuitive and human-centered design solutions.</p>\n<p><strong>Brief Description:</strong>\nTechvantage.ai is a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems. We build intelligent products that redefine industries and deliver exceptional value through cutting-edge AI technologies. Our mission is to design solutions that are not only powerful but also seamless, intuitive, and delightful to use.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Lead the design of engaging, user-friendly interfaces for AI-powered web and mobile products.</li>\n<li>Simplify complex AI-driven workflows into clear and accessible user experiences.</li>\n<li>Design and deliver wireframes, mockups, prototypes, and high-fidelity UI designs.</li>\n<li>Conduct user research, interviews, and usability testing to drive data-informed design decisions.</li>\n<li>Collaborate closely with product managers, engineers, and AI researchers to align product vision with user needs.</li>\n<li>Help maintain and evolve the design system, ensuring consistency across all interfaces.</li>\n<li>Champion design best practices and ensure accessibility and performance in every product experience.</li>\n</ul>\n<p><strong>Preferred Skills/Requirements:</strong></p>\n<ul>\n<li>4+ years of professional experience as a UI/UX Designer with a strong focus on product design.</li>\n<li>Experience designing for AI-based or data-intensive applications.</li>\n<li>Exceptional portfolio showcasing creative thinking and user-centered design across various platforms.</li>\n<li>Proficiency with tools like Figma, Adobe XD, Sketch, or similar.</li>\n<li>Solid grasp of user research, interaction design, and responsive UI design.</li>\n<li>Ability to collaborate across teams and communicate design concepts clearly to both technical and non-technical stakeholders.</li>\n<li>Passion for creating meaningful and elegant user experiences powered by emerging technologies.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience designing products involving Generative AI, Agentic AI, or predictive systems.</li>\n<li>Familiarity with machine learning concepts and how they influence user behavior and design patterns.</li>\n<li>Knowledge of basic front-end development (HTML, CSS, JS) is a plus.</li>\n<li>Comfortable using analytics tools (e.g., Mixpanel, Hotjar) to guide UX improvements.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>The chance to work on groundbreaking AI products with real-world impact</li>\n<li>A collaborative, mission-driven team that values innovation and creativity</li>\n<li>Compensation is not a constraint for the right candidate – we value skill, impact, and innovation</li>\n<li>Opportunities for growth, learning, and contributing to next-gen AI technologies</li>\n</ul>\n<p><strong>Contact Information:</strong>\n- Email: jobs@techvantagesystems.com\n- Website: http://www.techvantagesystems.com</p>\n<p><strong>Important Dates:</strong>\n- Closing Date: 21, Sept 2025\n- Job Published: 09, Sept 2025</p>",
        "tags": [
            "4+ Years",
            "UI/UX Design",
            "Figma",
            "AI"
        ],
        "summary": "Techvantage Systems is seeking a Product Experience Designer to shape the user experience of our AI-driven platforms. You will collaborate with cross-functional teams to create intuitive design solutions."
    },
    {
        "job_title": "Test Engineer (Automation Testing )",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23347",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Test Engineer (Automation Testing)</h2>\n<p><strong>Company:</strong> ZL Software Systems (P) Ltd\n<strong>Location:</strong> C-22, 2nd Floor, Thejaswini Building, Phase-1 Campus, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a>\n<strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> careerstvm@zlinkcorp.com</p>\n<p><strong>Job Summary:</strong>\nWe are seeking a skilled and proactive Software Test Automation Engineer with 1–3 years of hands-on experience in test automation using Selenium or Katalon. The ideal candidate will be responsible for designing, developing, and maintaining automated test scripts to ensure the quality and performance of our web and mobile applications. The candidate should have a strong understanding of test automation frameworks, industry best practices such as modular scripting, code reusability, data-driven testing, proper exception handling, and comprehensive logging, as well as Agile development methodologies.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Analyze user stories, requirements, and use cases to develop robust automated test scripts.</li>\n<li>Design, build and maintain reusable and scalable test automation frameworks.</li>\n<li>Maintain and enhance existing automation test suites.</li>\n<li>Execute automated test cases for web and mobile applications and analyze results.</li>\n<li>Identify, log, and track defects, working closely with the team to ensure timely resolution.</li>\n<li>Perform regression testing to ensure new code changes do not impact existing functionality.</li>\n<li>Maintain high standards in test case design and automation code quality.</li>\n<li>Contribute to continuous improvement of automation testing processes, tools, and techniques.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>1–3 years of hands-on experience in automation testing using Selenium or Katalon.</li>\n<li>Strong knowledge in object-oriented programming, exception handling and file handling.</li>\n<li>Experience in developing and maintaining test automation frameworks.</li>\n<li>Strong understanding of test automation tools, scripting, and testing best practices.</li>\n<li>Experience with test case management and defect tracking tools</li>\n<li>Good understanding of SDLC, STLC, and Agile methodologies.</li>\n<li>Strong analytical and problem-solving skills with attention to detail.</li>\n<li>Good communication and collaboration skills.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>Hands-on experience with Katalon Studio is a strong advantage.</li>\n<li>Experience with version control tools like Git.</li>\n<li>Exposure to any CI/CD tools for test suite integration and automation pipeline maintenance.</li>\n<li>Bachelor's degree in computer science or information technology.</li>\n<li>Certification or formal training in test automation or relevant tools is a plus.</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Selenium",
            "Katalon",
            "Automation Testing"
        ],
        "summary": "Seeking a Test Engineer with 1-3 years of experience in automation testing. Responsible for designing and maintaining automated test scripts to ensure web and mobile application quality."
    },
    {
        "job_title": "Senior Software Engineer-AI",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23346",
        "location": "Technopark",
        "closing_date": "15 Sep 2025",
        "job_description": "<h2>Senior Software Engineer - AI</h2>\n<p><strong>Techvantage Systems (P) Ltd</strong> is seeking a passionate and innovative Senior Software Engineer to join our AI team. As a key member of our team, you will contribute to building intelligent, scalable, and production-grade AI systems, with a strong focus on Generative AI and Agentic AI technologies. We are at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems, building cutting-edge solutions designed to scale and evolve with the future of artificial intelligence.</p>\n<p><strong>Contact:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 15, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Build and deploy AI-driven applications and services, focusing on Generative AI and Large Language Models (LLMs).</li>\n<li>Design and implement Agentic AI systems—autonomous agents capable of planning and executing multi-step tasks.</li>\n<li>Collaborate with cross-functional teams including product, design, and engineering to integrate AI capabilities into products.</li>\n<li>Write clean, scalable code and build robust APIs and services to support AI model deployment.</li>\n<li>Own feature delivery end-to-end—from research and experimentation to deployment and monitoring.</li>\n<li>Stay current with emerging AI frameworks, tools, and best practices and apply them in product development.</li>\n<li>Contribute to a high-performing team culture and mentor junior team members as needed.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>3–6 years of overall software development experience, with 3+ years specifically in AI/ML engineering.</li>\n<li>Strong proficiency in Python, with hands-on experience in PyTorch, TensorFlow, and Transformers (Hugging Face).</li>\n<li>Proven experience working with LLMs (e.g., GPT, Claude, Mistral) and Generative AI models (text, image, or audio).</li>\n<li>Practical knowledge of Agentic AI frameworks (e.g., LangChain, AutoGPT, Semantic Kernel).</li>\n<li>Experience building and deploying ML models to production environments.</li>\n<li>Familiarity with vector databases (Pinecone, Weaviate, FAISS) and prompt engineering concepts.</li>\n<li>Comfortable working in a startup-like environment—self-motivated, adaptable, and willing to take ownership.</li>\n<li>Solid understanding of API development, version control, and modern DevOps/MLOps practices.</li>\n</ul>\n<p><strong>Locations:</strong></p>\n<ul>\n<li>Module L1A, Level -1, Thejaswini, Technopark, Trivandrum</li>\n<li>2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581</li>\n</ul>\n<p>http://www.techvantagesystems.com</p>",
        "tags": [
            "3+ Years",
            "Generative AI",
            "Python",
            "LLMs"
        ],
        "summary": "Techvantage Systems is seeking a Senior Software Engineer - AI to build and deploy AI-driven applications, focusing on Generative AI and LLMs. The ideal candidate should have 3+ years in AI/ML."
    },
    {
        "job_title": "Senior Web Developer",
        "company": "Netwalk Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23345",
        "location": "Technopark",
        "closing_date": "20 Sep 2025",
        "job_description": "<h2>Senior Web Developer</h2>\n<p><strong>Netwalk Technologies India (P) Ltd</strong>\nModule 334, Nila Building, 3rd Floor,\nTechnopark Phase 1, 695581\n<a href=\"https://netwalk.de\">https://netwalk.de</a></p>\n<p><strong>Closing Date:</strong> 20, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> jobs@netwalk.co.in</p>\n<p><strong>Brief Description:</strong></p>\n<ul>\n<li>Development and maintenance of modern frontend and backend systems in common web technologies.</li>\n<li>User-centered programming of intuitive and user-friendly GUIs.</li>\n<li>Implementation and testing of responsive and adaptive web applications.</li>\n<li>Troubleshoot, debug, and optimize code for performance improvements.</li>\n<li>Work with databases such as PostgreSQL, MySQL, or MongoDB.</li>\n<li>Implement and maintain CI/CD pipelines for smooth deployments.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Bachelor’s or master’s degree in electrical/Electronics engineering, Computer Science, or a related field.</li>\n<li>At least 10 years of experience as a Web Developer.</li>\n<li>Good experience in front-end technologies such as HTML, CSS, JavaScript, React, Angular, or Vue.js.</li>\n<li>Strong experience in back-end development using Node.js, Python, PHP, or Java.</li>\n<li>Hands-on experience in databases such as PostgreSQL, MySQL, MongoDB, etc.</li>\n<li>Familiarity with cloud platforms like AWS, GCP, Azure.</li>\n<li>Familiar with CI/CD pipelines and DevOps.</li>\n<li>Goal-oriented communication skills and strong ability to work in a team.</li>\n<li>Strong analytical, structural thinking skills.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "JavaScript",
            "Node.js",
            "PostgreSQL"
        ],
        "summary": "Netwalk Technologies is seeking a Senior Web Developer to develop and maintain frontend and backend systems. The role requires strong experience in both front-end and back-end technologies, as well as database management."
    },
    {
        "job_title": "Test Engineer (Manual Testing)",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/23344",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Test Engineer (Manual Testing)</h2>\n<p><strong>ZL Software Systems (P) Ltd</strong>\nC-22, - 2 Floor, Thejaswini Building, Phase-1 Campus, Technopark,\nTrivandrum, Kerala, India, 695581\n<a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a></p>\n<p><strong>Contact Email:</strong> <a href=\"mailto:careerstvm@zlinkcorp.com\">careerstvm@zlinkcorp.com</a></p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Job Summary:</strong>\nWe are seeking a motivated and detail-oriented Manual Test Engineer with at least 1-3 years of experience in software testing. The ideal candidate will be responsible for creating and executing test cases, identifying defects, and ensuring the quality of web and mobile applications. This role requires a good understanding of the software development lifecycle and a passion for delivering reliable, user-friendly products.</p>\n<p><strong>Key Responsibilities:</strong>\n- Understand functional and non-functional requirements and create clear, comprehensive, and well-structured test cases.\n- Execute manual test cases across various platforms (web, mobile, desktop).\n- Collaborate with developers to reproduce issues and validate fixes.\n- Perform various types of testing including functional, regression, UI/UX, and smoke testing.\n- Support test planning and test execution phases of software releases.\n- Contribute to improving testing processes, quality standards, and documentation.</p>\n<p><strong>Required Skills:</strong>\n- Good understanding of SDLC, STLC, and defect life cycle.\n- Ability to write and execute test cases and test scenarios.\n- Strong analytical and problem-solving skills.\n- Good communication and collaboration skills.</p>\n<p><strong>Preferred Skills/Qualifications:</strong>\n- Familiarity with Agile/Scrum methodology.\n- Basic knowledge of automation testing concepts is a plus.\n- Bachelor’s degree in Computer Science, Information Technology, or a related field</p>",
        "tags": [
            "1-3 Years",
            "Manual Testing",
            "Test Cases",
            "SDLC"
        ],
        "summary": "ZL Software is seeking a Manual Test Engineer to create and execute test cases for web and mobile applications. The role requires strong analytical skills and knowledge of the SDLC."
    },
    {
        "job_title": "Digitizing Specialist - Embroidery(Night Shift)",
        "company": "Faya Innovations",
        "url": "https://technopark.org/job-details/23343",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Digitizing Specialist - Embroidery (Night Shift)</h2>\n<p><strong>FAYA INNOVATIONS</strong></p>\n<p><strong>Location:</strong> Technopark Phase I, Thiruvananthapuram, Kerala 695581\n<strong>Contact Email:</strong> hr.india@fayausa.com\n<strong>Website:</strong> http://www.fayausa.com</p>\n<p><strong>Role Overview:</strong>\nAs a Digitizing Specialist – Embroidery at FAYA, you will play a key role in transforming customer logos and artwork into embroidery-ready DST files. This includes ensuring correct stitch counts, optimized stitch paths, and machine-ready designs that result in high-quality custom apparel. You will collaborate closely with our production team in the US and support additional creative design tasks as required.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Convert customer artwork and logos into embroidery-ready DST files with precise stitch counts and optimized paths.</li>\n<li>Collaborate with the production team to ensure files run smoothly on embroidery machines.</li>\n<li>Review, test, and refine digitized designs to guarantee quality, durability, and efficiency of stitching.</li>\n<li>Deliver accurate files on time to meet production schedules.</li>\n<li>Maintain organized records of digitized designs and ensure version control.</li>\n<li>Support additional design requirements across the company’s e-commerce brands (mockups, graphic edits, marketing creatives, etc.).</li>\n<li>Stay updated on embroidery trends, digitizing software advancements, and best practices.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Proven experience as a Digitizer with a strong portfolio of DST files.</li>\n<li>Proficiency in digitizing software (Primarily Wilcom or similar).</li>\n<li>Strong knowledge of stitch types, densities, underlay, and embroidery production processes.</li>\n<li>Attention to detail with a commitment to precision and quality.</li>\n<li>Ability to troubleshoot and optimize digitized files for embroidery machines.</li>\n<li>Good organizational and time-management skills.</li>\n<li>Flexibility to contribute to other design tasks when needed.</li>\n<li>Strong communication and collaboration skills.</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>Experience in the promotional products or e-commerce apparel industry.</li>\n<li>Knowledge of apparel decoration methods beyond embroidery (screen printing, DTG, heat transfer).</li>\n<li>Basic graphic design proficiency (Adobe Illustrator, Photoshop, or similar).</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>Opportunity to work with a global e-commerce and branded merchandise leader.</li>\n<li>Exposure to both embroidery digitizing and creative design projects.</li>\n<li>A collaborative, growth-focused environment.</li>\n<li>Competitive compensation package based on experience.</li>\n<li>Career growth and skill development opportunities.</li>\n</ul>\n<p><strong>Additional Information:</strong></p>\n<ul>\n<li>Autonomy &amp; Impact – Own your work, drive innovation, and see your solutions in action.</li>\n<li>Growth &amp; Mentorship – Be part of an elite team that values continuous learning.</li>\n<li>Stability &amp; Culture – A performance-driven, transparent, and innovation-friendly environment.</li>\n<li>Health Benefits – Family medical insurance with up to ₹2L coverage.</li>\n<li>Brilliance deserves to be well compensated.</li>\n<li>Department: Customer Service Team</li>\n<li>Shift: US Shift : 8.30pm – 5.30am IST</li>\n<li>Working: 5 days a week.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Wilcom",
            "DST Files",
            "Embroidery"
        ],
        "summary": "Seeking a Digitizing Specialist to convert artwork into embroidery-ready DST files. The role involves collaborating with the US production team and supporting creative design tasks."
    },
    {
        "job_title": "AI/ML Engineer (min 2+ years of experience)",
        "company": "Storygame (P) Ltd",
        "url": "https://technopark.org/job-details/23342",
        "location": "Technopark",
        "closing_date": "12 Sep 2025",
        "job_description": "<h2>AI/ML Engineer</h2>\n<p><strong>Storygame (P) Ltd</strong>\nGround floor, Tejaswini building, Technopark Phase 1 Kazakootam trivandrum kerala, 695581\n<a href=\"https://storygame.io\">https://storygame.io</a></p>\n<p><strong>Contact Email:</strong> jincy.storygame@gmail.com</p>\n<p><strong>Closing Date:</strong> 12, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p>We are seeking a highly skilled and innovative AI/ML Engineer with a minimum of 2 years of experience and deep expertise in Large Language Models (LLMs), Generative AI, Retrieval-Augmented Generation (RAG), and multimodal AI involving audio and video processing. The ideal candidate will have hands-on experience building and integrating cutting-edge AI solutions, fine-tuning open-source and proprietary models, and deploying them into production environments.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and deploy solutions using LLMs (GPT, LLaMA, Mistral, Claude, etc.) for real-world applications.</li>\n<li>Implement and optimize RAG pipelines combining vector databases (e.g., Pinecone, Weaviate, FAISS) with LLMs.</li>\n<li>Fine-tune transformer-based models using Hugging Face, LoRA, QLoRA, PEFT, or similar frameworks.</li>\n<li>Work with generative AI models for text, image, audio, and video generation (e.g., Stable Diffusion, Whisper, AudioLM, DreamBooth, SDXL, etc.).</li>\n<li>Design and integrate multimodal systems that can process and generate content across different formats.</li>\n<li>Deploy models using ONNX, TorchServe, Triton, or custom APIs.</li>\n<li>Collaborate with DevOps and MLOps teams for model versioning, deployment, and monitoring.</li>\n<li>Research, prototype, and implement the latest advancements in generative AI and foundation models.</li>\n<li>Ensure ethical AI practices, model alignment, and bias mitigation.</li>\n<li>Optimize models for performance, latency, and resource efficiency.</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Experience with AutoGPT, Agentic AI systems, or LangGraph.</li>\n<li>Knowledge of RLHF, alignment training, and custom dataset curation.</li>\n<li>Exposure to MLOps tools like MLflow, Weights &amp; Biases, or Kubeflow.</li>\n<li>Contribution to open-source AI projects or publications in relevant areas.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>2+ years of hands-on experience in AI/ML engineering.</li>\n<li>Proficient with Python, PyTorch, TensorFlow, and ML libraries (e.g., Hugging Face Transformers, LangChain, OpenAI, etc.).</li>\n<li>Strong understanding of LLMs, tokenization, attention mechanisms, and transformer architectures.</li>\n<li>Experience with fine-tuning, prompt engineering, and in-context learning.</li>\n<li>Knowledge of vector databases, embeddings, and RAG-based architectures.</li>\n<li>Familiarity with cloud platforms (AWS/GCP/Azure) and scalable AI infrastructure.</li>\n<li>Experience working with Docker, Kubernetes, and GPU optimization.</li>\n<li>Solid grasp of audio and video processing models.</li>\n<li>Passion for innovation and staying updated with the latest research and trends.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "LLMs",
            "Generative AI",
            "RAG"
        ],
        "summary": "Seeking an AI/ML Engineer to develop and deploy cutting-edge AI solutions. The role involves working with LLMs, Generative AI, RAG, and multimodal AI."
    },
    {
        "job_title": "Jr.Executive  -Business Development",
        "company": "Zoondia Software (P) Ltd",
        "url": "https://technopark.org/job-details/23340",
        "location": "Technopark",
        "closing_date": "26 Sep 2025",
        "job_description": "<h2>Jr. Executive - Business Development</h2>\n<p><strong>Zoondia Software (P) Ltd</strong>\nT2, Thejaswini Building, Technopark, Trivandrum, 695581\n<a href=\"http://www.zoondia.com\">http://www.zoondia.com</a></p>\n<p><strong>Closing Date:</strong> 26, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> recruit@zoondia.in</p>\n<p><strong>Brief Description:</strong>\nWe are looking for a Junior Business Development Executive to help us grow our IT services business. You will support the sales team by finding new leads, setting up meetings, and following up with potential clients.</p>\n<p><strong>Key Responsibilities:</strong>\n- Find and connect with new leads using platforms like LinkedIn, email, etc.\n- Assist in preparing sales proposals and presentations\n- Help schedule meetings and calls with clients\n- Maintain lead and client data in the CRM\n- Support the senior BD team in day-to-day tasks\n- Follow up with leads and respond to basic inquiries\n- Stay updated on our services and industry trends</p>\n<p><strong>Preferred Skills:</strong>\n- Prefer Immediate Joiners</p>\n<p><strong>Experience:</strong>\n- 1-3 yrs</p>\n<p><strong>Qualification:</strong>\n- Bachelor’s degree in Business Administration, Marketing, or a related field.</p>",
        "tags": [
            "1-3 Years",
            "Business Development",
            "Lead Generation",
            "CRM"
        ],
        "summary": "Zoondia Software is seeking a Junior Business Development Executive to support the sales team by generating leads and setting up client meetings. The role involves CRM management and assisting with sales proposals."
    },
    {
        "job_title": "Senior .NET Full Stack Developer (with GenAI, Python & AWS) - 6 years plus",
        "company": "Enfin Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23339",
        "location": "Technopark",
        "closing_date": "23 Sep 2025",
        "job_description": "<h2>Senior .NET Full Stack Developer (with GenAI, Python &amp; AWS)</h2>\n<p>Enfin Technologies India (P) Ltd is seeking a highly skilled Senior Full Stack Developer with 6+ years of experience to join our team at Thejaswini, Technopark Campus, Trivandrum, Kerala.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Design, develop, and maintain web applications using .NET Core (C#), Angular, and SQL.</li>\n<li>Implement and optimize GenAI solutions, particularly Retrieval-Augmented Generation (RAG) pipelines.</li>\n<li>Develop and integrate Python-based AI/ML modules into enterprise solutions.</li>\n<li>Utilize AWS services (Lambda, S3, SageMaker, Bedrock, etc.) for deployment and scaling.</li>\n<li>Collaborate with cross-functional teams to define, design, and deliver new features.</li>\n<li>Ensure code quality and maintainability through best practices, code reviews, and testing.</li>\n</ul>\n<p><strong>Key Skills:</strong></p>\n<ul>\n<li>Strong proficiency in .NET Core, C#, Angular (v10+), HTML/CSS/JS.</li>\n<li>Experience with Python for AI/ML model development or integration.</li>\n<li>Hands-on with Generative AI (e.g., OpenAI, LangChain, RAG frameworks).</li>\n<li>Solid understanding of REST APIs, microservices, and system architecture.</li>\n<li>Proficient in AWS services related to compute, AI/ML, and DevOps.</li>\n<li>Familiarity with CI/CD pipelines, version control (Git), and Agile methodologies.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with LangChain, Haystack, or similar GenAI frameworks.</li>\n<li>Exposure to vector databases (e.g., Pinecone, FAISS, Weaviate).</li>\n<li>Knowledge of containerization tools (Docker, Kubernetes).</li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<p>If you are interested, please share your profile with hr@enfintechnologies.com, along with your overall &amp; relevant experience, CCTC, ECTC, and notice period.</p>\n<p><strong>Closing Date:</strong> 23, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Company Website:</strong> http://www.enfintechnologies.com</p>",
        "tags": [
            "6+ Years",
            ".NET Core",
            "Angular",
            "Generative AI"
        ],
        "summary": "Enfin Technologies is hiring a Senior Full Stack Developer to develop scalable web applications and integrate AI-powered features. Proficiency in .NET Core, Angular, GenAI, Python, and AWS is required."
    },
    {
        "job_title": "Cybersecurity Engineer / Infrastructure Security Engineer",
        "company": "Shellsquare Softwares (P) Ltd",
        "url": "https://technopark.org/job-details/23338",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Cybersecurity Engineer / Infrastructure Security Engineer</h2>\n<p><strong>ShellSquare Softwares (P) Ltd</strong>\n1st floor, Periyar Building, Technopark Phase I, Kerala, 695581\n<a href=\"http://www.shellsquare.com\">http://www.shellsquare.com</a></p>\n<p><strong>Closing Date:</strong> 09, Oct 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> careers@shellsquare.com</p>\n<p><strong>Location:</strong> Technopark, Thiruvananthapuram\n<strong>Employment Type:</strong> Full-time\n<strong>Experience Required:</strong> 5 + years</p>\n<h3>Role Overview</h3>\n<p>We are looking for skilled Infrastructure Security Engineers to address and remediate cybersecurity findings identified during assessments. The role involves applying security patches, updating configurations, and ensuring systems remain compliant with security standards.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Review cybersecurity reports and prioritize remediation tasks.</li>\n<li>Apply patches and update configurations based on vulnerability scan results.</li>\n<li>Collaborate with cybersecurity teams to validate fixes and close findings.</li>\n<li>Maintain logs and change records for audit and compliance purposes.</li>\n<li>Ensure endpoint protection and access control policies are enforced.</li>\n<li>Support compliance efforts for ISO, SOC 2, GDPR and other standards.</li>\n<li>Coordinate with vendors or internal teams for escalated fixes.</li>\n</ul>\n<h3>Skills &amp; Qualifications</h3>\n<ul>\n<li>Proficiency in Windows/Linux system administration, networking, and endpoint management.</li>\n<li>Experience with patch management tools (WSUS, SCCM, Ansible).</li>\n<li>Strong understanding of Active Directory, IAM, MFA implementations.</li>\n<li>Familiarity with ticketing systems (JIRA, ServiceNow).</li>\n<li>Relevant certifications such as ITIL, CompTIA Security+, Microsoft Certified: Security Operations Analyst</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong knowledge of network security, cloud security, and endpoint protection</li>\n<li>Hands‑on experience with vulnerability assessment, penetration testing, and remediation</li>\n<li>Proficiency with SIEM tools (Splunk, QRadar, ArcSight) and security monitoring</li>\n<li>Experience in patch management (WSUS, SCCM, Ansible) and system hardening</li>\n<li>Familiarity with Active Directory, IAM, MFA implementations</li>\n<li>Certifications such as CISSP, CEH, CISM, CompTIA Security+, ITIL</li>\n<li>Strong troubleshooting skills and ability to work in incident response scenarios</li>\n<li>Experience with ticketing systems (JIRA, ServiceNow) and change management processes</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Cybersecurity",
            "Patch Management",
            "Active Directory"
        ],
        "summary": "Seeking an Infrastructure Security Engineer to remediate cybersecurity findings and apply security patches. Responsibilities include maintaining compliance, validating fixes, and collaborating with security teams."
    },
    {
        "job_title": "Multi-Cloud DevOps Engineer (Azure)",
        "company": "Enfin Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23337",
        "location": "Technopark",
        "closing_date": "22 Sep 2025",
        "job_description": "<h2>Multi-Cloud DevOps Engineer (Azure)</h2>\n<p>Enfin Technologies India (P) Ltd is seeking a highly skilled Senior DevOps Engineer with 4+ years of experience in Azure, AWS, GCP, Kubernetes, Terraform, and modern DevOps practices.</p>\n<p><strong>Contact:</strong> hr@enfintechnologies.com</p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong>Cloud Infrastructure Management:</strong></p>\n<ul>\n<li>Architect, deploy, and maintain cloud environments in AWS, GCP, and Azure.</li>\n<li>Implement security best practices, IAM policies, and networking configurations across multi-cloud platforms.</li>\n<li>Monitor and optimize cloud costs.</li>\n</ul>\n<p><strong>Kubernetes &amp; Containerization:</strong></p>\n<ul>\n<li>Deploy, manage, and scale applications using Kubernetes (EKS, AKS, GKE).</li>\n<li>Implement Helm charts, Operators, and service mesh technologies like Istio or Linkerd.</li>\n<li>Automate Kubernetes deployments using GitOps tools (ArgoCD, Flux).</li>\n</ul>\n<p><strong>Terraform &amp; Infrastructure as Code:</strong></p>\n<ul>\n<li>Develop and maintain Infrastructure as Code using Terraform.</li>\n<li>Manage cloud infrastructure provisioning and automation through Terraform modules.</li>\n<li>Optimize Terraform workflows and ensure best practices in state management.</li>\n</ul>\n<p><strong>CI/CD &amp; Automation:</strong></p>\n<ul>\n<li>Develop and maintain CI/CD pipelines using Jenkins, GitHub Actions, GitLab CI, CircleCI, or Azure DevOps.</li>\n<li>Automate infrastructure provisioning using Terraform, CloudFormation, or Pulumi.</li>\n<li>Implement Configuration Management tools like Ansible, Chef, Puppet, or SaltStack.</li>\n</ul>\n<p><strong>Monitoring, Logging &amp; Security:</strong></p>\n<ul>\n<li>Set up monitoring and alerting using Prometheus, Grafana, Datadog, or New Relic.</li>\n<li>Centralize logging using ELK Stack, Loki, or Splunk.</li>\n<li>Implement security best practices for DevOps workflows (Secrets Management, SAST, DAST).</li>\n</ul>\n<p><strong>Scripting &amp; Development:</strong></p>\n<ul>\n<li>Write automation scripts using Python, Bash, Go, or PowerShell.</li>\n<li>Develop and optimize infrastructure-as-code templates.</li>\n</ul>\n<p><strong>Collaboration &amp; Best Practices:</strong></p>\n<ul>\n<li>Work closely with development, security, and operations teams to optimize deployments.</li>\n<li>Implement DevSecOps principles for secure development pipelines.</li>\n<li>Drive SRE (Site Reliability Engineering) practices for operational excellence.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>4+ years of experience in DevOps and cloud engineering.</li>\n<li>Hands-on expertise with Azure, GCP, and AWS cloud platforms.</li>\n<li>Strong experience with Kubernetes (EKS, AKS, GKE) and container orchestration.</li>\n<li>Expert-level knowledge of Terraform for Infrastructure as Code.</li>\n<li>Expertise in CI/CD tools (Jenkins, GitLab CI/CD, GitHub Actions, Azure DevOps, etc.).</li>\n<li>Strong scripting experience in Python, Bash, or Go.</li>\n<li>Experience with monitoring, logging, and alerting tools.</li>\n<li>Solid knowledge of security best practices in DevOps.</li>\n<li>Strong problem-solving and troubleshooting skills.</li>\n<li>Excellent communication and collaboration abilities.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Certifications in Azure (Azure DevOps Engineer Expert), AWS (AWS Certified DevOps Engineer) or GCP (Professional DevOps Engineer)</li>\n<li>Experience with serverless technologies (AWS Lambda, Google Cloud Functions).</li>\n<li>Knowledge of service mesh tools (Istio, Linkerd).</li>\n<li>Experience with Kubernetes operators and Helm chart development.</li>\n</ul>\n<p>Interested applicants, please share your resume to hr@enfintechnologies.com along with your CCTC, ECTC, &amp; Notice period.</p>\n<p><strong>Company Information:</strong></p>\n<p>Enfin Technologies India (P) Ltd\nC 24, -2 Floor, Thejaswini, Technopark Campus,\nTrivandrum, Kerala. , 695581\nhttp://www.enfintechnologies.com</p>\n<p>Closing Date: 22, Sept 2025\nJob Published: 09, Sept 2025</p>",
        "tags": [
            "4+ Years",
            "Azure",
            "Kubernetes",
            "Terraform"
        ],
        "summary": "Enfin Technologies is looking for a Senior DevOps Engineer to manage cloud infrastructure and automate CI/CD pipelines. The role requires expertise in Azure, AWS, GCP, Kubernetes, and Terraform."
    },
    {
        "job_title": "Junior Data Entry Operator",
        "company": "Bilagos Softwares (P) Ltd",
        "url": "https://technopark.org/job-details/23335",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Junior Data Entry Operator</h2>\n<p><strong>Bilagos Softwares (P) Ltd</strong>\nModule No. 2802, 8th Floor Yamuna, SEZ IT Building, Phase III Campus, Technopark, Trivandrum, Kerala, 695583\nhttp://www.bilagos.com</p>\n<p><strong>Closing Date:</strong> 30, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> hr@bilagos.in</p>\n<p><strong>Responsibilities:</strong></p>\n<p>This is an entry-level position intended to handle the back-office operation of SEMINE software.</p>\n<p>The primary responsibility of the operator is to correct text that was wrongly read by the machine. The actual document and machine-parsed document will be displayed side by side.</p>\n<p>The highest preference goes to people with an accounting background and computer skills, as the manual correction is on invoices.</p>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Strong communication skills in English</li>\n<li>Basic understanding of billing systems and terminology</li>\n</ul>\n<p><strong>Qualification:</strong></p>\n<ul>\n<li>Any degree or diploma</li>\n<li>Background in accounting or commerce is a plus</li>\n</ul>\n<p>We are actively seeking candidates based in Trivandrum.</p>",
        "tags": [
            "Entry Level",
            "Data Entry",
            "Billing Systems",
            "Accounting"
        ],
        "summary": "Entry-level data entry role at Bilagos Softwares, focusing on correcting machine-parsed text within the SEMINE software. Accounting background and strong English communication are preferred."
    },
    {
        "job_title": "Lead Totara Developer",
        "company": "Inapp Information Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23334",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Lead Totara Developer</h2>\n<p><strong>InApp Information Technologies India (P) Ltd</strong>\n209 S, 9th Floor, Yamuna, Technopark Phase 3., 695583\n<a href=\"http://www.inapp.com\">http://www.inapp.com</a></p>\n<p><strong>Contact Email:</strong> careers@inapp.com</p>\n<p><strong>Closing Date:</strong> 09, Oct 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Location:</strong> Trivandrum, Kochi, Remote/Hybrid\n<strong>Timing:</strong> US shift - 2PM- 11PM IST</p>\n<h3>Role Overview</h3>\n<p>Lead Totara Developer with expertise in Totara LMS and strong PHP, database, and API development skills. The ideal candidate should have excellent communication skills, be capable of understanding and troubleshooting existing Totara code, and work towards enhancing and optimizing LMS performance. While prior experience in Docker and PHP Unit testing is a plus, the ability to understand and modify existing LMS code with minimal supervision is crucial.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Technical Responsibilities:</strong></p>\n<ul>\n<li>Develop, customize, and optimize Totara LMS to meet business and user needs.</li>\n<li>Read and interpret existing Totara code to troubleshoot, enhance, and integrate new functionalities.</li>\n<li>Implement and refine Totara API usage for enhanced system functionality.</li>\n<li>Conduct database queries, including JOIN operations, ensuring efficiency and accuracy.</li>\n<li>Identify and fix security vulnerabilities, including XSS and SQL injection risks.</li>\n<li>Implement and maintain unit testing (PHPUnit) for custom features and improvements.</li>\n<li>Optimize LMS performance, including troubleshooting slow database queries and system lag.</li>\n</ul>\n<p><strong>Functional Responsibilities:</strong></p>\n<ul>\n<li>Collaborate with cross-functional teams to understand requirements and translate them into technical implementations.</li>\n<li>Guide junior developers in best practices related to Totara customization and PHP development.</li>\n<li>Participate in code reviews and documentation to maintain high development standards.</li>\n<li>Work closely with QA and DevOps teams to ensure smooth deployment and version control.</li>\n<li>Ensure compliance with e-learning standards like SCORM, xAPI, and LTI.</li>\n</ul>\n<h3>Required Technical Skills:</h3>\n<ul>\n<li><strong>Totara LMS Development:</strong> Experience in customizing, troubleshooting, and extending LMS functionalities.</li>\n<li><strong>PHP:</strong> Strong hands-on experience in writing and reviewing secure, optimized PHP code.</li>\n<li><strong>Database Management:</strong> Ability to write efficient SQL queries, including JOIN operations.</li>\n<li><strong>API Development:</strong> Familiarity with Totara APIs like get_string(), web services, and RESTful API integration.</li>\n<li><strong>Security Best Practices:</strong> Knowledge of preventing XSS vulnerabilities, input validation, and sanitization.</li>\n<li><strong>Performance Optimization:</strong> Ability to analyze and optimize LMS performance issues.</li>\n</ul>\n<h3>Preferred Skills &amp; Tools:</h3>\n<ul>\n<li>Docker &amp; Containerization – Understanding of containerized LMS deployments.</li>\n<li>Unit Testing (PHPUnit) – Experience in writing and executing automated tests for PHP-based applications.</li>\n<li>DevOps &amp; CI/CD – Familiarity with Git, Jenkins, and automated deployment workflows.</li>\n<li>Cloud &amp; Server Management – Experience with AWS, Linux, and Nginx/Apache.</li>\n</ul>\n<h3>Soft Skills &amp; Competencies:</h3>\n<ul>\n<li>Excellent communication skills – Ability to clearly articulate technical concepts and collaborate with teams.</li>\n<li>Problem-solving mindset – Capable of troubleshooting and identifying root causes in LMS issues.</li>\n<li>Self-driven &amp; Independent – Can read and modify existing LMS code with minimal guidance.</li>\n<li>Attention to detail – Ensures code quality, security, and performance optimizations.</li>\n</ul>\n<p>Interested candidates please share you resumes to careers@inapp.com</p>",
        "tags": [
            "12+ Years",
            "Totara LMS",
            "PHP",
            "API Development"
        ],
        "summary": "InApp is seeking a Lead Totara Developer to customize and optimize their Totara LMS, with strong PHP, database, and API development skills. Candidates should be able to troubleshoot existing code and enhance LMS performance."
    },
    {
        "job_title": "Business Development Associate",
        "company": "Nxtgenix Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23333",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Business Development Associate</h2>\n<p><strong>Nxtgenix Solutions (P) Ltd</strong> is seeking a motivated Business Development Associate to join our team. This is an excellent opportunity to start or grow your career in sales and business development within a cutting-edge UI/UX design studio. NxtGenix Solutions specializes in creating next-generation digital products and is dedicated to delivering innovative, user-centric solutions.</p>\n<p><strong>About Us:</strong>\nFounded in 2021, NxtGenix Solutions excels in UI/UX Design, Web Development, Product Marketing, and Brand Strategy. We help our clients enhance their digital presence and drive business growth.</p>\n<p><strong>Responsibilities:</strong>\n- Reach out to potential clients and build strong relationships.\n- Explain our products and services clearly to prospects.\n- Work with the team to plan and achieve sales targets.\n- Manage your own leads and follow up to convert them into opportunities.\n- Share ideas to improve how we connect with clients.</p>\n<p><strong>Why Work With Us:</strong>\n- Be part of a growing company where your work makes a difference.\n- Work with a supportive team that values your input.\n- Learn new skills and take responsibility from day one.</p>\n<p><strong>Skills Required:</strong>\n- 0–1 years of experience in sales or business development (freshers with a strong interest in sales and marketing can apply).\n- Good communication and interpersonal skills.\n- Interest in technology and digital products.\n- Goal-focused and self-motivated.\n- Able to work alone and as part of a team.\n- Bachelor’s degree in any field.</p>\n<p><strong>How to Apply:</strong>\nSend your resume to hr@nxtgenix.com with the subject line: Business Development Associate.</p>\n<p><strong>Contact Information:</strong>\nNxtgenix Solutions (P) Ltd\n6th Floor, STPI Building, Technopark, Karyavattom P.O, Thiruvananthapuram - 695 581, 695581\nhttps://www.nxtgenix.design\nContact Email: hr@nxtgenix.com\nClosing Date: 30, Sept 2025\nJob Published: 09, Sept 2025</p>",
        "tags": [
            "0-1 Years",
            "Sales",
            "Business Development",
            "Communication Skills"
        ],
        "summary": "NxtGenix Solutions is looking for a Business Development Associate to build client relationships and achieve sales targets. The ideal candidate will have strong communication skills and an interest in technology."
    },
    {
        "job_title": "Fullstack Developer (.NET ,Angular)",
        "company": "Inapp Information Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23332",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Fullstack Developer (.NET, Angular)</h2>\n<p><strong>InApp Information Technologies India (P) Ltd</strong></p>\n<p>209 S, 9th Floor, Yamuna, Technopark Phase 3, 695583\n<a href=\"http://www.inapp.com\">http://www.inapp.com</a></p>\n<p><strong>Contact Email:</strong> careers@inapp.com</p>\n<p><strong>Role:</strong> Fullstack Developer (.NET, Angular)\n<strong>Experience:</strong> 5-7 years</p>\n<p><strong>Job Summary:</strong>\nWe are seeking a highly skilled Full Stack .NET Software Developer with extensive expertise in .NET Core and Angular (version 12 or higher). This role will be key in building robust, scalable, and secure enterprise applications leveraging the latest Microsoft technologies and cloud-native practices on Microsoft Azure. The role requires collaboration across cross-functional teams to deliver high-quality software solutions that meet both technical and business objectives.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Application Design:</strong> Participate in feature discussions, story planning, and the development of scalable, high-performance applications using .NET and Azure.</li>\n<li><strong>Code Quality &amp; Reviews:</strong> Write clean, maintainable, and well-documented code. Conduct and participate in peer code reviews to ensure adherence to coding standards, performance, and security practices.</li>\n<li><strong>Stakeholder Collaboration:</strong> Work closely with product owners, business analysts, QA engineers, and other stakeholders to translate business requirements into technical specifications and deliver quality features.</li>\n<li><strong>Legacy Modernization:</strong> Lead or support initiatives to migrate and modernize legacy applications to Azure cloud platforms, including planning, implementation, and optimization.</li>\n</ul>\n<p><strong>Technology Stack:</strong></p>\n<ul>\n<li><strong>Languages &amp; Frameworks:</strong> C#, .NET Core (5.0+), Angular (12+)</li>\n<li><strong>Frontend Technologies:</strong> HTML5, CSS3, JavaScript, TypeScript, Angular</li>\n<li><strong>Databases:</strong> SQL Server (2019+), Entity Framework, MongoDB, Cosmos DB, OpenSearch/Elasticsearch</li>\n<li><strong>Cloud &amp; Infrastructure:</strong> Microsoft Azure: Azure Storage, Azure DevOps, Load Balancing, Monitoring, Containerization (Docker/Kubernetes)</li>\n<li><strong>DevOps &amp; CI/CD Tools:</strong> Git, Azure DevOps Pipelines, GitHub Actions</li>\n<li><strong>Security:</strong> Single Sign-On (SSO), Identity Server, JWT</li>\n<li><strong>Other Tools &amp; Technologies:</strong> RabbitMQ, Redis, IIS, PowerShell, Swagger, SSIS</li>\n<li><strong>Testing &amp; QA:</strong> xUnit, NUnit, Selenium</li>\n</ul>\n<p><strong>To Apply:</strong>\nInterested candidates, please share your resumes to careers@inapp.com</p>",
        "tags": [
            "5-7 Years",
            ".NET Core",
            "Angular",
            "Azure"
        ],
        "summary": "Seeking a Full Stack .NET Developer with .NET Core and Angular experience to build scalable enterprise applications on Azure. Requires strong collaboration skills to deliver high-quality solutions."
    },
    {
        "job_title": "Market Research & Business Support Associate (Fresher)",
        "company": "Nxtlive Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/23329",
        "location": "Technopark",
        "closing_date": "03 Oct 2025",
        "job_description": "<h2>Market Research &amp; Business Support Associate (Fresher)</h2>\n<p>NXTLIVE TECHNOLOGIES (P) Ltd is seeking a Market Research &amp; Business Support Associate to work closely with leadership and operations in gathering insights and preparing materials for marketing and sales strategies. This role focuses on research, analysis, and content preparation to help the team identify and approach potential clients effectively.</p>\n<p><strong>Contact:</strong> hrdirector@nxtlive.com</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Conduct market and industry research to identify potential prospects and business opportunities based on defined criteria.</li>\n<li>Research companies, industries, and domains to create structured databases of potential clients.</li>\n<li>Support the team with competitive research, trend analysis, and insights gathering.</li>\n<li>Assist in preparing presentations, reports, and business documents for client discussions.</li>\n<li>Draft and organize content for marketing and thought leadership (basic blogs, LinkedIn posts, case studies, etc.).</li>\n<li>Support creation of client-facing materials such as brochures, decks, and company profiles.</li>\n<li>Maintain and update internal research trackers and documentation.</li>\n<li>Collaborate with cross-functional teams to support ongoing projects and initiatives.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Master's degree</li>\n<li>Strong research and analytical skills with attention to detail.</li>\n<li>Good written and verbal communication skills in English.</li>\n<li>Proficiency in MS Office/Google Workspace (Excel, PowerPoint, Docs).</li>\n<li>Ability to organize information clearly and prepare professional documents.</li>\n<li>Self-motivated, eager to learn, and open to feedback.</li>\n</ul>\n<h3>Job Details:</h3>\n<ul>\n<li><strong>Role:</strong> Market Research &amp; Business Support Associate (Fresher)</li>\n<li><strong>Location:</strong> [Specify – Onsite/Hybrid/Remote]</li>\n<li><strong>Type:</strong> Full-time (with training period, if applicable)</li>\n<li><strong>Experience:</strong> 0–2 years</li>\n</ul>\n<p><strong>Note:</strong> Apply with a one-pager explaining \"how you would research and create useful insights for our team that could eventually support marketing or sales.\"</p>",
        "tags": [
            "0-2 Years",
            "Market Research",
            "Data Analysis",
            "Content Creation"
        ],
        "summary": "NXTLIVE is seeking a Market Research Associate to gather insights and prepare marketing materials. The role involves market research, data analysis, and content creation to support sales strategies."
    },
    {
        "job_title": "Data Scientist",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23326",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Data Scientist</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong></p>\n<p>Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581</p>\n<p><a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 19, Sept 2025</p>\n<p><strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption. We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>What’s important to us:</h3>\n<p>We are seeking experienced Data Scientist Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<h3>Job Description</h3>\n<ul>\n<li>Data mining or extracting usable data from valuable data sources</li>\n<li>Using machine learning tools to select features, create, and optimize classifiers</li>\n<li>Carrying out the preprocessing of structured and unstructured data</li>\n<li>Enhancing data collection procedures to include all relevant information for developing analytic systems</li>\n<li>Processing, cleansing, and validating the integrity of data to be used for analysis</li>\n<li>Analyzing large amounts of information to find patterns and solutions</li>\n<li>Developing prediction systems and machine learning algorithms</li>\n<li>Presenting results in a clear manner</li>\n<li>Propose solutions and strategies to tackle business challenges</li>\n<li>Collaborate with Business and IT teams</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Programming Skills – knowledge of statistical programming languages like R, Python, and database query languages like SQL, Hive, Pig is desirable.</li>\n<li>4+ yrs of experience as a data scientist.</li>\n<li>Familiarity with Scala, Java, or C++ is an added advantage.</li>\n<li>Statistics – Good applied statistical skills, including knowledge of statistical tests, distributions, regression, maximum likelihood estimators, etc.</li>\n<li>Proficiency in statistics is essential for data-driven companies.</li>\n<li>Machine Learning – good knowledge of machine learning methods like k-Nearest Neighbors, Naive Bayes, SVM, Decision Forests.</li>\n<li>Strong Math Skills (Multivariable Calculus and Linear Algebra) - understanding the fundamentals of multivariable Calculus and Linear Algebra is important as they form the basis of a lot of predictive performance or algorithm optimization techniques.</li>\n<li>Data Wrangling – proficiency in handling imperfections in data is an important aspect of a data scientist job description.</li>\n<li>Experience with Data Visualization Tools like matplotlib, ggplot, d3.js., Tableau that help to visually encode data</li>\n<li>Excellent Communication Skills – it is incredibly important to describe findings to a technical and non-technical audience.</li>\n<li>Strong Software Engineering Background</li>\n<li>Hands-on experience with data science tools</li>\n<li>Problem-solving aptitude</li>\n<li>Analytical mind and great business sense</li>\n<li>Degree in Computer Science, Engineering or relevant field is preferred</li>\n<li>Proven Experience as Data Analyst or Data Scientist</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long-term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work-life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Python",
            "Machine Learning",
            "SQL"
        ],
        "summary": "Techversant is looking for an experienced Data Scientist to drive new business opportunities. The role involves data mining, machine learning, and developing prediction systems."
    },
    {
        "job_title": "Senior AI/ML Engineer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23325",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Senior AI/ML Engineer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong></p>\n<p><strong>Location:</strong> Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581</p>\n<p><strong>Website:</strong> http://www.techversantinfotech.com</p>\n<p><strong>Closing Date:</strong> 19, Sept 2025</p>\n<p><strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption. We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>Job Description:</h3>\n<p>We are seeking experienced AI/ML Engineers who will be responsible for developing and driving new business opportunities internationally. The incumbent will be responsible for discovering sales opportunities and creating qualified leads.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Develop ML and Deep Learning Solutions: Create predictive, classification, and optimization models using supervised, unsupervised, and reinforcement learning.</li>\n<li>Design and Implement Generative AI Systems: Build and fine-tune Large Language Models (LLMs) and diffusion models for a range of use cases involving text, code, and multi-modal data.</li>\n<li>Build Scalable Recommendation Engines: Develop and optimize recommendation systems using collaborative filtering, content-based filtering, hybrid models, or sequential models.</li>\n<li>Cloud-Native ML Engineering: Deploy and manage machine learning pipelines and APIs in cloud environments (AWS, GCP, Azure), ensuring scalability, observability, and cost efficiency.</li>\n<li>End-to-End ML Lifecycle Ownership: Own the model lifecycle from feature engineering and experimentation to deployment, CI/CD, monitoring, and iteration.</li>\n<li>Collaborate Across Functions: Work with cross-functional teams including product managers, engineers, and data scientists to translate business goals into AI-powered solutions.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Minimum 4 years of experience in building and deploying production-level ML/DL systems</li>\n<li>Develop proofs of concept AI/ML-based solutions and services and demonstrate them to Business stakeholders</li>\n<li>Design and deliver ML architecture patterns operable in native and hybrid cloud architectures.</li>\n<li>Create Functional and technical specifications for AI/ML solutions.</li>\n<li>Implement machine learning algorithms in services and pipelines that can be used on a web scale.</li>\n<li>Design, develop, and implement Generative AI models using state-of-the-art techniques.</li>\n<li>Collaborate with cross-functional teams to define project goals, research requirements, and develop innovative solutions.</li>\n<li>Strong understanding of transformer architectures and deep learning model design</li>\n<li>Hands-on experience in building at least one production-grade Deep learning solution or Generative AI solution</li>\n<li>Expertise in Python programming with a focus on:<ul>\n<li>Code optimization and profiling</li>\n<li>Multi-threading and multiprocessing</li>\n<li>Object-oriented programming and design principles</li>\n</ul>\n</li>\n<li>Experience deploying models in a cloud-native environment with strong MLOps practices</li>\n<li>Understanding of model evaluation, observability, A/B testing, and feedback loops</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<p><strong>Technical Stack:</strong></p>\n<ul>\n<li><strong>Languages:</strong> Excellent understanding of object-oriented concepts and Python.</li>\n<li><strong>ML/DL Frameworks:</strong><ul>\n<li>Machine Learning: Scikit-learn, XGBoost, LightGBM</li>\n<li>Deep Learning: PyTorch, TensorFlow, Keras</li>\n<li>GenAI: Hugging Face Transformers, LangChain, OpenAI APIs, Gemini, Agentic Framework</li>\n</ul>\n</li>\n<li><strong>Cloud &amp; MLOps:</strong> AWS SageMaker, GCP Vertex AI, Azure ML, MLflow, Kubeflow, Docker, Kubernetes</li>\n<li><strong>Data &amp; Compute:</strong> Apache Spark, BigQuery, RabbitMQ, S3, EC2</li>\n<li><strong>Embedding Stores &amp; Vector Search:</strong> FAISS, Pinecone, ChromaDB</li>\n<li><strong>Orchestration &amp; APIs:</strong> Apache Airflow, Docker Deployment, and FastAPI are a must</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience with multi-modal models combining text, vision, or audio</li>\n<li>Familiarity with Retrieval-Augmented Generation (RAG), embedding stores, and agent-based orchestration (LangGraph, ReAct)</li>\n<li>Open-source contributions in AI/ML or GenAI ecosystems</li>\n<li>Certifications in cloud-based machine learning platforms (AWS/GCP/Azure)</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>B.Tech / M.Tech / Ph.D. in Computer Science, Artificial Intelligence, Data Science, or a related field</li>\n<li>Equivalent practical experience in developing scalable AI solutions will also be considered</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Generative AI",
            "Python",
            "MLOps"
        ],
        "summary": "Techversant is seeking a Senior AI/ML Engineer to develop and deploy AI solutions. The role involves building generative AI systems, scalable recommendation engines, and managing the ML lifecycle."
    },
    {
        "job_title": "Lead React Native Developer",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23324",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Lead React Native Developer</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581\n<a href=\"http://www.techversantinfotech.com\">http://www.techversantinfotech.com</a></p>\n<p><strong>Closing Date:</strong> 19, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025\n<strong>Contact Email:</strong> careers@techversantinfotech.com</p>\n<h3>About Techversant:</h3>\n<p>Techversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities, and Technology Disruption.</p>\n<p>We offer expertise and consultation in multiple technology domains like – ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence etc.</p>\n<h3>What’s important to us:</h3>\n<p>As a Lead- React Native Developer, you will lead the development and maintenance of our mobile applications using React Native. You will collaborate closely with cross-functional teams, including backend developers, to deliver high-quality, scalable, and user-friendly mobile solutions. The ideal candidate should have extensive experience in React Native development, possess a deep understanding of mobile application development best practices, and demonstrate leadership abilities to guide and mentor junior team members.</p>\n<h3>Job Description:</h3>\n<ul>\n<li>Lead the development and implementation of mobile applications using React Native.</li>\n<li>Collaborate with cross-functional teams to gather and analyze project requirements.</li>\n<li>Previous ownership of app development projects is required.</li>\n<li>Develop automated tests to guarantee the product’s top-notch quality.</li>\n<li>Stay updated with the latest advancements and changes in mobile platforms and technologies.</li>\n<li>Provide technical supervision and support to mentor the team effectively.</li>\n<li>Conduct code reviews to ensure adherence to coding standards, best practices, and maintain code quality.</li>\n<li>Ensure the application is published and maintained in both the App Store and Google Play Store, adhering to their respective policies and guideline.</li>\n<li>Participate in agile development processes, including sprint planning, estimation, and retrospectives.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>10+ years of experience in React Native Development, Minimum 3 yrs in Lead role.</li>\n<li>Expert-level proficiency in JavaScript, TypeScript, and React Native framework.</li>\n<li>Demonstrated hands-on experience in designing and developing applications using React Native, iOS and Android platforms.</li>\n<li>Capability to plan the core architecture and iteratively enhance it as needed.</li>\n<li>Strong analytical mindset to extract actionable insights from data.</li>\n<li>Excellent Team management and communication skills.</li>\n<li>Experience with RESTful APIs and integration of third-party libraries and APIs.</li>\n<li>Possess a comprehensive understanding of React Native.</li>\n<li>Capable of understanding the company’s business needs and adjusting or innovating the product accordingly.</li>\n</ul>\n<h3>What Company Offers:</h3>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>",
        "tags": [
            "10+ Years",
            "React Native",
            "JavaScript",
            "TypeScript"
        ],
        "summary": "Techversant Infotech is seeking a Lead React Native Developer to lead mobile application development. The role involves team leadership, code quality maintenance, and ensuring app store compliance."
    },
    {
        "job_title": "AI/ML – Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23323",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>AI/ML Architect</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong></p>\n<p><strong>Contact:</strong> careers@techversantinfotech.com</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years.</p>\n<p>We offer expertise and consultation in multiple technology domains including ColdFusion, Python, Java, .NET, NodeJS, Ruby on Rails, Golang, PHP, Angular, ReactJS, VueJS, IOS, Android, Flutter, ReactNative, Artificial Intelligence, Data Science, Blockchain, Business Intelligence, etc.</p>\n<p><strong>What’s important to us:</strong>\nWe are looking for a visionary yet hands-on AI Solution Architect who thrives at the intersection of technology, business, and innovation. This is a client-facing leadership role for someone who can conceptualize, design, and deliver robust AI-driven applications while staying ahead of the curve with emerging AI trends and technologies.</p>\n<p>You will be responsible for the entire lifecycle of AI solution development – from client discussions and requirements analysis to architecture design, algorithm selection, solution development, team guidance, and successful delivery.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Client Engagement &amp; Consulting</strong><ul>\n<li>Interact directly with clients and stakeholders to understand complex business problems.</li>\n<li>Translate business needs into AI/ML opportunities and articulate solution strategies clearly.</li>\n<li>Present solution architectures, effort estimates, timelines, and potential ROI.</li>\n</ul>\n</li>\n<li><strong>Solution Design &amp; Architecture</strong><ul>\n<li>Define end-to-end AI architecture including data pipelines, model selection, AI engines, integration layers, APIs, and deployment strategies.</li>\n<li>Make informed choices of AI/ML/DL algorithms, frameworks, and platforms based on problem type and constraints.</li>\n<li>Ensure the architecture is scalable, modular, secure, and optimized for performance.</li>\n</ul>\n</li>\n<li><strong>Hands-On Development</strong><ul>\n<li>Develop critical components or proof-of-concepts when needed.</li>\n<li>Perform hands-on design and coding for pipelines, model training, inferencing, or integrations.</li>\n<li>Create reusable components and automation scripts for repeatability.</li>\n</ul>\n</li>\n<li><strong>Team Leadership &amp; Delivery Oversight</strong><ul>\n<li>Build and mentor a high-performing AI development team.</li>\n<li>Drive agile development cycles, ensuring timely and quality delivery.</li>\n<li>Collaborate with DevOps, Product Managers, and QA teams throughout SDLC.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li><strong>AI/ML/DL Expertise:</strong><ul>\n<li>Proven experience with supervised, unsupervised, and reinforcement learning.</li>\n<li>Deep knowledge of ML algorithms (e.g., XGBoost, SVM, Random Forest) and DL architectures (CNNs, RNNs, Transformers, LLMs).</li>\n<li>Hands-on with Python, PyTorch, TensorFlow, Keras, Scikit-learn, Hugging Face, etc.</li>\n</ul>\n</li>\n<li><strong>Architecture &amp; System Design:</strong><ul>\n<li>Strong grasp on designing large-scale AI/ML pipelines using microservices, APIs, and cloud-native architecture.</li>\n<li>Experience designing MLOps workflows (CI/CD for ML) using tools like MLflow, Kubeflow, Airflow, DVC.</li>\n</ul>\n</li>\n<li><strong>Cloud &amp; Platforms:</strong><ul>\n<li>Proficient in AWS/GCP/Azure AI/ML services (e.g., SageMaker, Vertex AI, Azure ML Studio).</li>\n<li>Familiarity with vector databases (e.g., FAISS, Pinecone), model versioning, and deployment strategies (e.g., REST APIs, gRPC, containers, Kubernetes).</li>\n</ul>\n</li>\n<li><strong>Data Engineering:</strong><ul>\n<li>Working knowledge of data wrangling, preprocessing, ETL, feature engineering, data versioning.</li>\n<li>Tools: Spark, Pandas, Snowflake, Kafka, Databricks, Delta Lake.</li>\n</ul>\n</li>\n<li><strong>Product &amp; Project Ownership:</strong><ul>\n<li>Ability to estimate efforts, manage scope, and align delivery with client expectations.</li>\n<li>Experience in productizing AI models and integrating them into full-stack applications.</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong><ul>\n<li>Excellent communication, stakeholder management, and presentation skills.</li>\n<li>Ability to simplify complex AI concepts for non-technical stakeholders.</li>\n<li>Experience with Generative AI (LLMs, GPT, BERT, Stable Diffusion, LangChain, RAG, etc.)</li>\n<li>Knowledge of Prompt Engineering, Fine-Tuning, and RLHF</li>\n<li>Experience in NLP, Computer Vision, Time Series, or Recommendation Engines</li>\n<li>Understanding of ethical AI, explainable AI, and compliance in AI systems</li>\n<li>Publications, contributions to open-source, or AI certifications</li>\n</ul>\n</li>\n</ul>\n<p><strong>Education:</strong></p>\n<ul>\n<li>Bachelor’s or Master’s degree in Computer Science, Data Science, AI, or related fields.</li>\n<li>Certifications in Cloud AI/ML platforms or advanced AI specializations are a plus.</li>\n</ul>\n<p><strong>What Company Offers:</strong></p>\n<ul>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>Fixed weekday day schedule, meaning, you’ll have your weekends off!</li>\n<li>Family Medical Insurance.</li>\n<li>Unique leave benefits and encashment options based on performance.</li>\n<li>Long term growth opportunities.</li>\n<li>Fun family environment surrounded by experienced developers.</li>\n<li>Various internal employee rewards programs based on Performance.</li>\n<li>Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.</li>\n<li>Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.</li>\n<li>Company Sponsored International Tours</li>\n</ul>",
        "tags": [
            "5+ Years",
            "AI/ML/DL",
            "Python",
            "Cloud Platforms"
        ],
        "summary": "Techversant is seeking an AI/ML Architect to design and deliver AI solutions. This role involves client engagement, hands-on development, and team leadership to drive AI innovation."
    },
    {
        "job_title": "Python Solution Architect",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23321",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>Python Solution Architect</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking an experienced Solution Architect to design and implement scalable, high-performance AI-driven applications. This role requires strong Python development skills, excellent leadership, and a passion for mentoring.</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. They offer expertise in Digital Transformation and multiple technology domains.</p>\n<p><strong>Job Responsibilities:</strong>\n- Architect and design end-to-end solutions using Python (Django/FastAPI/Flask), AI/ML models, and cloud-native technologies.\n- Lead AI/ML-driven application development, including model deployment, data pipelines, and intelligent automation.\n- Collaborate with data scientists, engineers, and product teams to integrate AI/ML models into scalable applications.\n- Optimize system performance, ensuring scalability, cost efficiency, and security.\n- Implement microservices architecture with APIs, containerization (Docker/Kubernetes), and event-driven design.\n- Drive best DevOps practices with CI/CD pipelines, MLOps, Infrastructure as Code (Terraform, CloudFormation), and automated testing.</p>\n<p><strong>Preferred Skills:</strong>\n- Python &amp; Full Stack: Django, FastAPI, Flask, React, Angular, or Vue.js.\n- AI/ML &amp; Data Science: TensorFlow, PyTorch, Scikit-learn, NLP, Computer Vision, or MLOps.\n- Cloud &amp; DevOps: AWS, Azure, or GCP with Kubernetes &amp; CI/CD.\n- Big Data &amp; Databases: PostgreSQL, MongoDB, Redis, Snowflake, or Spark.\n- Architecture &amp; Security: Microservices, API Gateway, Event-Driven Systems, and best security practices.</p>\n<p><strong>Ideal Experience Level:</strong>\n- 10+ years in software development with strong Python expertise, including full-stack development.\n- 2+ years of experience as a Solution Architect, with demonstrated success in leading and delivering enterprise-level projects.\n- Strong AI/ML experience, specifically in model deployment, data engineering, and cloud integration</p>\n<p><strong>Nice-to-Have Skills:</strong>\n- Hands-on experience with LLMs, Generative AI, or Reinforcement Learning.\n- Expertise in GraphQL, Serverless (AWS Lambda, Firebase), and Edge AI.\n- Experience with data engineering, real-time analytics, and feature stores.</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p><strong>Contact Information:</strong>\n- Email: careers@techversantinfotech.com\n- Website: http://www.techversantinfotech.com\n- Address: Module No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala, 695581</p>\n<p><strong>Closing Date:</strong> 19, Sept 2025\n<strong>Job Published:</strong> 09, Sept 2025</p>",
        "tags": [
            "10+ Years",
            "Python",
            "AI/ML",
            "Cloud"
        ],
        "summary": "Techversant is hiring a Python Solution Architect to lead the design and implementation of AI-driven applications. The role requires expertise in Python, AI/ML, and cloud technologies."
    },
    {
        "job_title": "AI/ML – Team Lead",
        "company": "Techversant Infotech (P) Ltd",
        "url": "https://technopark.org/job-details/23320",
        "location": "Technopark",
        "closing_date": "19 Sep 2025",
        "job_description": "<h2>AI/ML Team Lead</h2>\n<p><strong>Techversant Infotech (P) Ltd</strong> is seeking a highly skilled and experienced AI/ML Lead to lead the design and implementation of our artificial intelligence and machine learning solutions. The successful candidate will work closely with cross-functional teams to understand business requirements and develop scalable, efficient, and robust AI/ML systems.</p>\n<p><strong>About Techversant:</strong>\nTechversant is a Global Technology Services and Solutions Company providing high-quality end-to-end IT Solutions and Services to its clients across the globe for more than 16 years. Techversant has been providing Technology services in the key areas of Digital Transformation, Understanding the Evolving Industrial Scenarios, Investment Priorities and Technology Disruption. We offer expertise and consultation in multiple technology domains.</p>\n<p><strong>Job Description:</strong>\n- Build Solutions based on Deep learning, Reinforcement learning, Computer vision, Expert system, Transfer Learning, NLP, and generative models.\n- Define, design, and deliver ML architecture patterns operable in native and hybrid cloud architectures.\n- Implement machine learning algorithms in services and pipelines that can be used on a web scale.\n- Create demos and proofs of concept, develop AI/ML based products and services.\n- Creating Functional and technical specifications for AI &amp; ML solutions.\n- Follow SDLC process\n- Advanced analytical knowledge of data and data conditioning\n- Programming advanced computing and developing algorithms\n- Developing software, data models and executing predictive analysis\n- Design, develop, and implement generative AI models using state-of-the-art techniques.\n- Collaborate with cross-functional teams to define project goals, research requirements and develop innovative solutions.</p>\n<p><strong>Required Skills:</strong>\n- Strong proficiency in Python/R/Scala (Python is a must and R, Scala is a plus).\n- Strong proficiency in SQL, NO SQL Databases.\n- Experience in implementing and deploying AI\\ Machine Learning solutions (using various models, such as CNN, RNN, Fuzzy logic, Q learning, SVM, Ensemble, Logistic Regression, Random Forest etc.)\n- Specializes in at least one of the AI/ML stack, Frameworks, and tools like MxNET and Tensorflow.\n- Hands-on experience with data analytics and classical machine learning, deep learning tools (e.g. Pandas, NumPy, Scikit-learn) and deep learning frameworks (e.g. Tensorflow, Pytorch).</p>\n<p><strong>Preferred Skills:</strong>\n- Experience in production software engineering routines in DevOps/MLOps (e.g.Continuous Code Integration and Deployment).\n- Experiences in cloud-based solutions (e.g. AWS, Azure, GCP).</p>\n<p><strong>Experience and Qualification:</strong>\n- B.Tech/M.Tech/Ph.D CS/IS/IT or Msc Statistics, MCA</p>\n<p><strong>What Company Offers:</strong>\n- Excellent career growth opportunities and exposure to multiple technologies.\n- Fixed weekday day schedule, meaning, you’ll have your weekends off!\n- Family Medical Insurance.\n- Unique leave benefits and encashment options based on performance.\n- Long term growth opportunities.\n- Fun family environment surrounded by experienced developers.\n- Various internal employee rewards programs based on Performance.\n- Opportunities for various other Bonus programs – for training hours taken, certifications, special value to business through idea and innovation.\n- Work life Balance – flexible work timings, early out Fridays, various social and cultural activities etc.\n- Company Sponsored International Tours.</p>\n<p><strong>Contact Information:</strong>\ncareers@techversantinfotech.com</p>\n<p><strong>Location:</strong>\nModule No:2306, Third Floor, Yamuna, Tower II, Technopark Phase III, SEZ Campus, Trivandrum, Kerala , 695581\nhttp://www.techversantinfotech.com</p>",
        "tags": [
            "5+ Years",
            "Python",
            "AI/ML",
            "Deep Learning"
        ],
        "summary": "Techversant Infotech is looking for an AI/ML Team Lead to design and implement AI/ML solutions. The role involves developing and deploying machine learning models and leading cross-functional teams."
    },
    {
        "job_title": "Full Stack Developer (Python React)",
        "company": "Inapp Information Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/23318",
        "location": "Technopark",
        "closing_date": "09 Oct 2025",
        "job_description": "<h2>Full Stack Developer (Python React)</h2>\n<p><strong>InApp Information Technologies India (P) Ltd</strong></p>\n<p>209 S, 9th Floor, Yamuna, Technopark Phase 3., 695583</p>\n<p><a href=\"http://www.inapp.com\">http://www.inapp.com</a></p>\n<p><strong>Closing Date:</strong> 09, Oct 2025</p>\n<p><strong>Job Published:</strong> 09, Sept 2025</p>\n<p><strong>Contact Email:</strong> careers@inapp.com</p>\n<h3>Brief Description</h3>\n<p><strong>Position:</strong> Fullstack Developer (Python React)</p>\n<p><strong>Experience:</strong> 7-10 years</p>\n<p><strong>Working Hours:</strong> 9 PM - 5 AM IST</p>\n<p><strong>Work Mode:</strong> Remote / Hybrid</p>\n<h3>Backend - Skill Set</h3>\n<p><strong>Mandatory:</strong></p>\n<ul>\n<li>Python (advanced, Performance-focused development)</li>\n<li>\n<p>AWS (expertise in Lambda, DynamoDB, S3, API GW, AWS SAM)</p>\n</li>\n<li>\n<p>4 to 7 years of hands-on experience in Python development.</p>\n</li>\n<li>Solid knowledge and experience with the AWS Stack (Lambda, S3, API Gateway, etc.).</li>\n<li>Good understanding of DynamoDB data modeling and performance tuning.</li>\n<li>Familiarity with CI/CD tools and containerization (e.g., Docker) is a plus.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and teamwork skills.</li>\n<li>Familiarity in building and consuming REST APIs</li>\n</ul>\n<h3>Frontend - Skill Set</h3>\n<ul>\n<li>Proficiency in React.js (Hooks, Context API, functional components).</li>\n<li>Strong knowledge of JavaScript (ES6+), HTML5, and CSS3/SCSS.</li>\n<li>Experience with state management libraries (Redux, Context).</li>\n<li>Familiarity with REST APIs.</li>\n<li>Knowledge of frontend build tools (Webpack, Vite, Babel).</li>\n<li>Hands-on experience with Git and version control workflows.</li>\n<li>Understanding of responsive design and cross-browser compatibility.</li>\n<li>Strong debugging and problem-solving skills.</li>\n<li>Experience using UI libraries/frameworks like PrimeReact, MUI etc</li>\n<li>Familiarity with AWS Amplify for auth, API, storage in React applications.</li>\n</ul>\n<h3>Client Interaction &amp; Soft Skills</h3>\n<ul>\n<li>Strong verbal and written communication skills to interact effectively with clients.</li>\n<li>Ability to understand client-reported issues and translate them into actionable technical tasks.</li>\n<li>Quick turnaround in analyzing, reproducing, and resolving client issues.</li>\n<li>Proactive in providing timely updates and ensuring transparency with clients.</li>\n<li>Collaborative approach with internal teams to expedite client issue resolution.</li>\n<li>Professional and composed handling of client concerns and escalations.</li>\n<li>Flexibility to provide support during client working hours (9 PM IST – 5 AM IST).</li>\n</ul>\n<p>Interested candidates please drop your updated resume to careers@inapp.com</p>\n<p>Preferred Skills: Python, React, Dynamo DB, AWS</p>",
        "tags": [
            "7-10 Years",
            "Python",
            "React",
            "AWS"
        ],
        "summary": "Seeking a Full Stack Developer proficient in Python and React. Responsibilities include backend development with AWS and frontend expertise, ensuring client satisfaction during specified working hours."
    },
    {
        "job_title": "Strategic Implementation Manager: (Freshers)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/23317",
        "location": "Technopark",
        "closing_date": "24 Oct 2025",
        "job_description": "<h2>Strategic Implementation Manager (Freshers)</h2>\n<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong> is seeking a smart, high-potential fresher to join our Implementation Team. This is an excellent opportunity to build a career in healthcare technology delivery.</p>\n<p><strong>Contact:</strong> careers@shmsolutions.in</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Participate in structured training to learn healthcare ERP modules (Billing, Lab, EMR, etc.)</li>\n<li>Understand hospital workflows and compliance standards such as NABH</li>\n<li>Shadow senior team members during client implementations</li>\n<li>Maintain and update onboarding materials, SOPs, templates, and checklists</li>\n<li>Assist in creating and improving training content (slides, videos, FAQs)</li>\n<li>Document challenges, feedback, and resolutions from field projects</li>\n<li>Support onboarding and internal training for new engineers</li>\n<li>Conduct mock demos and sandbox configurations for practice sessions</li>\n<li>Track training progress using structured checklists</li>\n<li>Learn technical deployment basics and data preparation steps</li>\n<li>Collaborate with project managers and client-side stakeholders</li>\n<li>Participate in team retrospectives and identify process improvement areas</li>\n</ul>\n<p><strong>Preferred Skills/Qualifications:</strong></p>\n<ul>\n<li>Recent graduate in Engineering, IT, Business, or Life Sciences</li>\n<li>Strong logical reasoning and fast learning ability</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Attention to detail and proactive documentation habits</li>\n<li>Eagerness to learn healthcare processes and ERP delivery</li>\n</ul>\n<p><strong>Good-to-Have:</strong></p>\n<ul>\n<li>Exposure to ERP or enterprise systems through internships or projects</li>\n<li>Basic understanding of hospital operations</li>\n<li>Proficiency in MS Office or Google Suite</li>\n</ul>\n<p><strong>Salary:</strong> 8 LPA</p>",
        "tags": [
            "Freshers",
            "ERP",
            "Healthcare",
            "Training"
        ],
        "summary": "Join the Implementation Team at SMARTHMS & SOLUTIONS, learn healthcare ERP, and assist in onboarding new engineers. Recent graduates in relevant fields are encouraged to apply."
    },
    {
        "job_title": "Lead IT Strategist- Policy, Infrastructure & Investment, High Power IT Committee",
        "company": "Electronics Technology Parks Kerala (Technopark)",
        "url": "https://technopark.org/job-details/23316",
        "location": "Technopark",
        "closing_date": "30 Sep 2025",
        "job_description": "<h2>Lead IT Strategist - Policy, Infrastructure &amp; Investment</h2>\n<p>Electronics Technology Parks Kerala (Technopark) is seeking a highly motivated and experienced Lead IT Strategist to support the High-Power IT Committee (HPIC) in promoting Kerala as a premier investment destination for the knowledge industry. This role involves driving corporate engagements, developing impactful marketing strategies, and fostering a robust start-up ecosystem.</p>\n<p><strong>Contact Information:</strong> jobs@technopark.in</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Drive corporate engagements to attract large-scale IT sector investments.</li>\n<li>Assist HPIC in developing and implementing marketing strategies to position Kerala as a hub for knowledge industries.</li>\n<li>Build and maintain a global network of Kerala achievers to promote the state’s digital vision.</li>\n<li>Create high-quality jobs and attract significant investments through policy formulation and coordination with government departments.</li>\n<li>Facilitate industry-academia collaboration for mass skilling to address talent gaps.</li>\n<li>Support the growing start-up ecosystem and identify commercial opportunities for IT SMEs.</li>\n<li>Establish and maintain partnerships with key stakeholders in the IT sector.</li>\n<li>Support HPIC and the IT Ministry in organizing roadshows and promotion events.</li>\n<li>Provide data analysis support for benchmarking studies to develop the IT industry.</li>\n<li>Conduct in-depth research and competitor analysis to identify potential investors and address any barriers to investment.</li>\n</ul>\n<p><strong>Eligibility Criteria:</strong></p>\n<ul>\n<li><strong>Mandatory:</strong></li>\n<li>Post Graduate Degree in Management from a top Business School with at least four years of work experience in Corporate/Government/NGO sector.</li>\n<li>Experience in business development, trade promotion, inward investment promotion, talent management, destination marketing, policy formulation, and/or start-up ecosystem.</li>\n<li>Excellent written and oral communication/presentation skills.</li>\n<li>Proficiency in English; preference for candidates with working knowledge of Malayalam.</li>\n<li>Advanced analytical skills, task management abilities, and problem-solving skills.</li>\n<li>Indian citizenship or PIO/OCI status.</li>\n<li>\n<p>Age less than 40 years as of 01/09/2025.</p>\n</li>\n<li>\n<p><strong>Preferred:</strong></p>\n</li>\n<li>Proven expertise in Business Development, Destination Marketing, Policy Formulation, Infrastructure Development, and Investment.</li>\n<li>Prior work experience in public service and the development sector.</li>\n<li>Demonstration of outstanding achievements, superior academic performance, and leadership potential.</li>\n</ul>\n<p><strong>Experience &amp; Skills:</strong></p>\n<ul>\n<li>Excellent understanding of the Knowledge-linked industry and its opportunities.</li>\n<li>Demonstrated ability to identify and reach out to MNCs and drive inward investment.</li>\n<li>Proven skills to negotiate changes and enable agreements on policy and legislation.</li>\n<li>Experience building an advanced start-up ecosystem.</li>\n<li>Involvement with industry and academic institutes for talent development.</li>\n<li>Track record in planning and executing high-profile visits and VIP delegations.</li>\n<li>Task management skills.</li>\n<li>Extensive network of industry contacts.</li>\n</ul>\n<p><strong>Terms of Appointment and Compensation:</strong></p>\n<ul>\n<li>Contractual appointment for 2 years, extendable based on performance.</li>\n<li>Full-time position; no other assignments allowed during the contract tenure.</li>\n<li>Consolidated annual pay of Rs 24 lakh (Rs 2 lakh per month).</li>\n<li>Fixed Annual Basic Salary: Rs.16.08 Lakhs per annum (Rs 1.4 Lakhs per month).</li>\n<li>Performance Based Remuneration: 30% of consolidated pay based on performance appraisal.</li>\n</ul>\n<p><strong>Location:</strong> Thiruvananthapuram, Kerala</p>\n<p><strong>Last Date of Application:</strong> 5:00 pm (IST), 30th September 2025</p>\n<p><a href=\"https://technopark.in\">Click Here to Apply Online</a></p>",
        "tags": [
            "4+ Years",
            "Business Development",
            "Policy Formulation",
            "Investment Promotion"
        ],
        "summary": "Seeking a Lead IT Strategist to boost Kerala's IT sector. The role involves investment promotion, policy development, and start-up ecosystem support."
    }
]