[
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22087/312",
        "location": "Infopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p><strong>Company</strong>: 2Base Technologies</p>\n<p>We are seeking a high-performing, self-driven <strong>Senior Business Development Executive</strong> to join our team. In this role, you will drive revenue by managing the full sales cycle for IT services and digital solutions, including web, mobile, and enterprise software development.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Generate qualified leads through outbound channels, referrals, and market research.</li>\n<li>Drive new business opportunities for web, mobile, and enterprise software development services.</li>\n<li>Manage the complete sales process: lead qualification, client communication, requirement analysis, proposal preparation, pricing, negotiation, and closure.</li>\n<li>Propose tailored IT and digital transformation solutions aligned with client objectives.</li>\n<li>Build relationships with key decision-makers (Founders, CXOs, Product Owners).</li>\n<li>Collaborate with delivery, design, and marketing teams to create compelling proposals.</li>\n<li>Maintain CRM records and provide sales forecasts and reports.</li>\n<li>Represent the company at networking events and client meetings.</li>\n<li>Meet/exceed monthly/quarterly revenue targets.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Education</strong>: Bachelor’s degree or equivalent in IT/CS/BCA/B-Tech/CS/EC/MBA/Diploma in CS/IT.</li>\n<li><strong>Experience</strong>: 2–5 years in B2B sales within IT services/digital solutions.</li>\n<li>Proven ability to manage sales pipelines and close deals independently.</li>\n<li>Strong understanding of software development services (web, mobile, SaaS, enterprise).</li>\n<li>Experience with international clients preferred.</li>\n<li>Proficiency in CRM systems (Zoho, HubSpot, Salesforce) and outbound tools (LinkedIn Sales Navigator).</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Strategic thinking to address client pain points and position solutions.</li>\n</ul>\n<h3>Additional Certifications</h3>\n<ul>\n<li>Sales, digital marketing, or business consulting certifications are a plus.</li>\n</ul>\n<p><strong>Contact</strong>: Email your resume to <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Software Development Services",
            "International Clients"
        ],
        "summary": "Senior Business Development Executive at 2Base Technologies drives revenue by managing the full sales cycle for IT services and digital solutions. Responsibilities include generating leads, building client relationships, and exceeding sales targets."
    },
    {
        "job_title": "Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22088/312",
        "location": "Infopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>Business Analyst</h2>\n<p>The Business Analyst plays a key role in ensuring requirements are clearly understood, accurately documented, and traceable throughout the software development lifecycle. This role focuses on translating business and functional inputs into structured, standardized documentation that supports effective development, testing, and delivery. Working closely with business analysts, design teams, and technical stakeholders, the role ensures consistency, clarity, and alignment across all requirement artifacts.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Create Software Requirement Specifications (SRS) based on inputs from Core Business Analysts, stakeholder discussions, and requirement walkthroughs</li>\n<li>Prepare Business Requirement Documents (BRD) using approved templates while ensuring business intent and system behavior are clearly documented</li>\n<li>Participate in requirement discussions to understand business objectives, functional flows, dependencies, and assumptions before documentation</li>\n<li>Analyze requirements to identify gaps, ambiguities, and inconsistencies, and work with Core BAs to resolve them</li>\n<li>Document functional flows, business rules, and acceptance criteria where applicable to support development and QA teams</li>\n<li>Document wireframes, UI flows, validations, and UI specifications in collaboration with design and product teams</li>\n<li>Maintain change logs, version history, and document updates throughout the project lifecycle</li>\n<li>Create and manage traceability matrices linking business, functional, and technical requirements</li>\n<li>Maintain cross-references across BRD, SRS, UI, API, and related documentation</li>\n<li>Ensure documentation consistency, completeness, and alignment with approved scope and delivery timelines</li>\n<li>Ensure accurate and timely PMS updates with structured documentation details</li>\n<li>Support development, QA, UAT, and audit processes through clear, traceable, and up-to-date documentation</li>\n<li>Assist in requirement reviews, walkthroughs, and validation sessions with internal and client stakeholders</li>\n</ul>\n<h3>Requirements</h3>\n<h4>Required Skills and Experience</h4>\n<ul>\n<li>1 to 4 years of experience in Business Analysis documentation or related roles</li>\n<li>Strong experience in BRD and SRS creation</li>\n<li>Hands-on experience with documentation templates, standards, and version control</li>\n<li>Ability to document UI wireframes and functional flows clearly</li>\n<li>Working knowledge of APIs and system integrations for documentation purposes</li>\n<li>Experience with project management systems and documentation tools</li>\n<li>Strong attention to detail and ability to manage multiple documents in parallel</li>\n<li>Excellent written communication and stakeholder coordination skills</li>\n</ul>\n<h4>Minimum Qualifications</h4>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong></p>",
        "tags": [
            "1 to 4 Years",
            "BRD/SRS Documentation",
            "UI/API Documentation",
            "Project Management Tools"
        ],
        "summary": "Translates business needs into structured documentation for software development. Ensures clarity, traceability, and alignment across requirements artifacts."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22089/312",
        "location": "Infopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>Senior Business Analyst</h2>\n<p>At 2Base, we are rebuilding the Business Analyst function into a world-class, product-minded, clarity-driven team. This role is <strong>not</strong> a documentation role. It is <strong>not</strong> a screen updater role. It is <strong>not</strong> a support role. This is a core Business Analyst position responsible for functional modeling, system reasoning, requirement clarity, and building the foundation for correct development.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.</li>\n<li>Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.</li>\n<li>Convert ambiguous client inputs into structured, logical, and actionable functional understanding.</li>\n<li>Break large features into modules, workflows, components, and clear dependencies.</li>\n<li>Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.</li>\n<li>Translate business processes into functional logic that development teams can execute.</li>\n<li>Decompose requirements into use-case flows, system behaviors, edge cases, alternate paths, validation rules, and dependencies.</li>\n<li>Prepare high-quality documentation, including BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API requirement specs, and acceptance criteria.</li>\n<li>Ensure all documentation is clear, logical, structured, testable, and ready for developers and QA to use.</li>\n<li>Collaborate closely with developers, architects, QA, and product owners to validate feasibility and align understanding.</li>\n<li>Ensure QA teams can derive test cases effectively from your functional logic and acceptance criteria.</li>\n<li>Communicate confidently with clients, handle requirement discussions smoothly, and clarify misunderstandings immediately.</li>\n<li>Push back politely on unclear or changing requirements and ensure final decisions are documented properly.</li>\n<li>Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover to development.</li>\n<li>Own the entire requirement lifecycle from discovery to development readiness with high accountability.</li>\n<li>Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>Minimum 4+ years of core Business Analyst experience with strong analytical and system-level thinking.</li>\n<li>Ability to break down complex requirements into clear components, workflows, and functional logic.</li>\n<li>Excellent verbal and written communication with confidence in client interactions and clarifications.</li>\n<li>Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria with high clarity.</li>\n<li>Ability to challenge assumptions politely, ask the right questions, and ensure zero ambiguity.</li>\n<li>Strong collaboration experience with development, QA, architects, and cross-functional teams.</li>\n<li>Understanding of API behaviors, integrations, data flows, and multi-module system interactions.</li>\n<li>Ability to run requirement discussions, workshops, and independently lead discovery sessions.</li>\n<li>Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.</li>\n<li>Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.</li>\n<li>Not suitable for UI-only thinkers, passive communicators, template-based writers, or those relying on AI for answers.</li>\n<li>Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.</li>\n<li>Candidates must align with 2Base’s structured thinking, clarity-driven culture, and transformation of the BA function.</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, Business, or related field</li>\n<li>4 to 8 years of experience as a Business Analyst or Product Analyst</li>\n<li>Experience in SaaS or scalable product environments</li>\n<li>Exposure to AI/Automation, integrations, or multi-module systems</li>\n<li>Ability to run independent client workshops</li>\n<li>Must have independently handled requirement ownership for at least one full project lifecycle</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "SaaS",
            "API",
            "BRD/FRD/SRS"
        ],
        "summary": "Senior Business Analyst role focused on functional modeling, system reasoning, and requirement clarity to drive aligned development. Requires 4+ years of experience with SaaS, API, and BRD/FRD/SRS expertise."
    },
    {
        "job_title": "Sr.DevSecOps Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22090/312",
        "location": "Infopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>Senior DevSecOps Engineer</h2>\n<p><strong>Company Overview</strong>\nWe are seeking a Senior DevSecOps Engineer to lead our cybersecurity, infrastructure automation, and DevSecOps practices as we transition to a secure, scalable, and modern engineering environment.</p>\n<p><strong>Role Overview</strong>\nThis role is responsible for strengthening 2Base’s security posture, modernizing pipelines, and guiding the team toward a secure-by-design culture. You will collaborate with engineering, product, and leadership teams to ensure systems, applications, and cloud environments are secure, reliable, and future-ready.</p>\n<p><strong>Key Responsibilities</strong>\n- Define, implement, and enforce security standards, policies, and best practices across cloud and on-prem environments.\n- Conduct security risk assessments, perform vulnerability scans, coordinate penetration testing, and execute mitigation plans.\n- Architect, maintain, and enhance secure CI/CD pipelines with automated compliance and governance checkpoints.\n- Promote a \"Security First\" culture across engineering, ensuring secure design and development practices.\n- Monitor, detect, investigate, and respond to security threats, incidents, breaches, and anomalies.\n- Develop and mature Infrastructure-as-Code practices using Terraform, Ansible, and other automation frameworks.\n- Design and lead secure cloud architectures across AWS, Azure, or GCP for scalable, compliant deployments.\n- Build, operate, and secure containerized environments using Docker and Kubernetes with enforced security baselines.\n- Implement secure monitoring, logging, SIEM, and alerting systems for infrastructure and application layers.\n- Improve system reliability, scalability, performance, and fault tolerance across critical workloads.\n- Mentor DevOps engineers in secure development, automation, and operational excellence.\n- Lead technical strategy, decision-making, tool selection, process improvements, and DevSecOps roadmap execution.\n- Collaborate with BA, PM, and Engineering teams to align security, performance, and delivery goals.</p>\n<p><strong>Required Skills &amp; Experience</strong>\n- 4–8 years in DevOps, Cloud, or Infrastructure engineering with strong security exposure.\n- Hands-on experience with CI/CD tools (Jenkins, GitLab CI, GitHub Actions).\n- Expertise in AWS, Azure, or GCP cloud platforms with secure architecture focus.\n- Proficiency in Infrastructure-as-Code (Terraform, Ansible).\n- Experience securing Docker and Kubernetes environments.\n- Strong networking knowledge (LAN/WAN, firewalls, VPN, load balancers).\n- Familiarity with security frameworks (OWASP, NIST, CIS Benchmarks).\n- Experience with monitoring/logging tools (Prometheus, Grafana, ELK, CloudWatch, SIEM).\n- Scripting skills in Python, Bash, Shell.\n- Excellent troubleshooting, analytical, and problem-solving abilities.\n- Strong communication and collaboration skills to influence engineering teams.</p>\n<p><strong>Contact</strong>\nIf this aligns with your career goals, share your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4–8 Years",
            "Terraform",
            "Ansible",
            "AWS"
        ],
        "summary": "Lead DevSecOps practices to secure cloud infrastructure and CI/CD pipelines, collaborating with cross-functional teams to ensure scalable, compliant, and future-ready systems."
    },
    {
        "job_title": "Creative Designer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22091/312",
        "location": "Infopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<p><strong>Creative Designer</strong></p>\n<p>We are seeking a <strong>Creative Designer</strong> who brings strong visual thinking, originality, and complete ownership of their work. The ideal candidate should stay connected to marketing and design trends, think beyond briefs, and deliver high-quality visuals that strengthen brand identity and audience engagement.</p>\n<p><strong>Key Responsibilities</strong>\n- Design engaging and high-quality creatives for branding, marketing, and promotional use\n- Create marketing assets (brochures, flyers, posters, social media creatives, website visuals, presentations, email campaigns)\n- Conceptualize ideas and translate them into clear visual communication\n- Take complete ownership of design deliverables from concept to final output\n- Ensure visual consistency across all brand touchpoints by following brand guidelines\n- Manage multiple creative projects in parallel while meeting defined timelines\n- Collaborate with Marketing teams, Creative Leads, and Project Managers on daily updates and revisions\n- Stay updated with current design, branding, marketing trends, and evolving creative tools\n- Use modern design and image generation tools to support ideation while ensuring originality and brand alignment\n- Maintain organized design files, versions, and documentation</p>\n<p><strong>Requirements</strong>\n- Diploma or Bachelor’s Degree in Graphic Design, Visual Arts, or a related field\n- 2 to 4 years of professional experience in a creative or design role\n- Strong proficiency in Adobe Photoshop, Adobe Illustrator, Adobe InDesign, Adobe Premiere Pro, and After Effects\n- Working knowledge of MS Office tools (PowerPoint, Word)\n- Basic understanding of HTML and CSS\n- Strong typography skills and understanding of layout/design principles\n- High attention to detail with strong visual judgment\n- Good verbal and written communication skills</p>\n<p><strong>Creativity, Ownership, and Mindset</strong>\n- Demonstrate quick and creative thinking\n- Show ownership and accountability for assigned work\n- Self-discipline in reviewing work before submission\n- Ability to accept feedback and iterate on designs efficiently\n- Confidence in presenting and explaining design concepts\n- Willingness to think beyond briefs and suggest innovative ideas</p>\n<p><strong>Portfolio Requirement</strong>\n- A strong portfolio is mandatory\n- Portfolio should showcase branding, marketing creatives, and originality\n- Candidates must explain design intent, approach, and execution</p>\n<p><strong>Experience</strong>\n- 2 to 4 years of relevant industry experience</p>\n<p><strong>Benefits</strong>\n- A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</p>\n<p><strong>Contact</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-4 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Adobe InDesign"
        ],
        "summary": "Creative Designer needed to produce branding and marketing assets. Requires 2-4 years of experience with Adobe tools and strong visual communication skills."
    },
    {
        "job_title": "Odoo Developer (On-site – Qatar)",
        "company": "Infintor Solutions LLP",
        "url": "https://infopark.in/company-jobs/details/22095/380",
        "location": "Infopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<p><strong>Odoo Developer (On-site – Qatar)</strong></p>\n<p>We are seeking experienced Odoo Developers to join a high-profile project on-site in Qatar. This opportunity allows you to work within a global environment, representing Infintor while being embedded directly into our client's technical team in Doha.</p>\n<h3>Working Environment</h3>\n<p>As part of our Staff Augmentation model, you will be deployed to the client’s office in Qatar. You will collaborate with local stakeholders and international consultants to customize, implement, and support Odoo solutions. The role combines high-level technical coding with professional on-site consultancy.</p>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Programming Languages</strong>: Proficiency in Python &amp; JavaScript.</li>\n<li><strong>Database</strong>: Familiarity with PostgreSQL, including object relational mapping.</li>\n<li><strong>Collaboration Platform</strong>: Experience with GitHub.</li>\n<li><strong>Development Model</strong>: Familiarity with open-source collaboration.</li>\n<li><strong>Framework</strong>: Proficiency in Odoo (ORM, Workflows, Report Engine, BI, AI).</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop customized solutions for clients across industries and company sizes.</li>\n<li>Provide ongoing support and maintenance for tailored solutions.</li>\n<li>Adapt SaaS offerings to meet client requirements.</li>\n<li>Assist in training and supporting the partner network.</li>\n</ul>\n<h3>Must-Have Qualifications</h3>\n<ul>\n<li>Proficiency in multiple programming languages.</li>\n<li>Strong grasp of object-oriented programming, object modeling, and relational databases.</li>\n<li>Passion for software development.</li>\n<li>Ability to learn and adapt quickly.</li>\n<li>Fluency in English.</li>\n<li>Team-oriented mindset.</li>\n</ul>\n<h3>Nice-to-Have Qualifications</h3>\n<ul>\n<li>Self-organized work ethic.</li>\n<li>Bachelor's or Master's degree in a related field.</li>\n<li>Proficiency in Python, JavaScript, HTML, SQL, and UML-like modeling.</li>\n<li>Familiarity with Linux platform.</li>\n</ul>\n<p><strong>Experience</strong>: 2+ Years</p>\n<p>If you are a dynamic and motivated Odoo Developer with a passion for customization and development, join our talented team at Infintor. Your expertise will help meet the unique needs of our diverse clientele.</p>\n<p><strong>Apply now</strong> by sharing your updated resume at <strong>odoo.developer_qa@infintor.odoo.com</strong>.</p>",
        "tags": [
            "2+ Years",
            "Python",
            "JavaScript",
            "Odoo"
        ],
        "summary": "Seeking an experienced Odoo Developer for on-site projects in Qatar. Requires Python/JavaScript proficiency and 2+ years of experience in Odoo customization and implementation."
    },
    {
        "job_title": "Sales Executive",
        "company": "Woxro",
        "url": "https://infopark.in/company-jobs/details/22102/399",
        "location": "Infopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>Sales Executive Internship</h2>\n<h3>Role Overview</h3>\n<p>We are seeking a motivated and enthusiastic <strong>Sales Intern</strong> to support our sales and business development initiatives. This internship provides hands-on experience in B2B sales, lead generation, and client communication.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Research and identify potential leads via LinkedIn and other platforms</li>\n<li>Assist with lead generation and outreach activities</li>\n<li>Support in drafting introductory emails and follow-ups</li>\n<li>Maintain and update CRM data</li>\n<li>Coordinate with marketing and technical teams</li>\n<li>Help prepare proposals and presentations</li>\n<li>Attend client meetings (if required)</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Currently pursuing or recently completed a degree in Business, Marketing, or a related field</li>\n<li>Strong written and verbal communication skills</li>\n<li>Basic proficiency in LinkedIn and MS Office</li>\n<li>Interest in sales, marketing, and business development</li>\n<li>Self-motivated with a willingness to learn</li>\n</ul>\n<h3>How to Apply</h3>\n<p>If this opportunity aligns with your career goals, please send your updated resume to <strong>jobs@woxro.com</strong>.</p>",
        "tags": [
            "Internship",
            "LinkedIn",
            "MS Office",
            "Sales"
        ],
        "summary": "A Sales Intern role offering hands-on experience in B2B sales, lead generation, and client communication. Requires strong communication skills and basic tech proficiency."
    },
    {
        "job_title": "Business Development - Freshers",
        "company": "iLeaf Solutions Pvt Ltd.",
        "url": "https://infopark.in/company-jobs/details/22099/59",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Business Development - Freshers</h2>\n<p><strong>Sales Development Representative (SDR)</strong></p>\n<p>iLeaf Solutions is seeking a high-energy, persistent, and articulate Sales Development Representative (SDR) to join our international business development team. With 15 years of excellence in software services and offshore development, we are looking for a dedicated professional to help us expand our footprint within the US market.</p>\n<p>This role is specifically designed for the <strong>US Night Shift</strong> (9 PM – 6 AM or 6 PM – 3 AM) to ensure real-time engagement with our US prospects.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Outbound Prospecting</strong>: Identify and proactively reach out to key decision-makers (CTOs, VPs of Engineering, and Product Owners) in US-based firms through cold calling, personalized emailing, and LinkedIn outreach.</li>\n<li><strong>Lead Qualification</strong>: Vet potential leads to ensure they align with iLeaf’s core competencies in software development and offshore support.</li>\n<li><strong>Appointment Setting</strong>: Successfully schedule discovery calls and technical consultations for the senior sales team, managing complex calendar coordination across multiple US time zones.</li>\n<li><strong>Pitching Services</strong>: Clearly articulate iLeaf Solutions’ 15-year value proposition, focusing on our expertise in custom software development and team augmentation.</li>\n<li><strong>CRM Data Integrity</strong>: Diligently track all outreach activities, lead statuses, and follow-up schedules within the CRM to ensure a seamless sales pipeline.</li>\n<li><strong>Market Intelligence</strong>: Gather insights on prospect pain points and industry trends to refine outreach messaging and improve conversion rates.</li>\n<li><strong>Target Achievement</strong>: Meet or exceed monthly targets for qualified meetings booked and opportunities generated.</li>\n</ul>\n<p><strong>Contact</strong>: If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@ileafsolutions.com</strong>.</p>",
        "tags": [
            "0-1 Years",
            "Sales Development",
            "CRM",
            "Outbound Prospecting"
        ],
        "summary": "iLeaf Solutions seeks a Sales Development Representative to drive US market expansion through outbound prospecting and lead qualification. The role requires CRM management and meeting sales targets in a night shift schedule."
    },
    {
        "job_title": "Social Media Marketing Executive",
        "company": "Soulxes Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22101/447",
        "location": "Infopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>🚀 Job Opening: Social Media Marketing Executive</h2>\n<p><strong>Company</strong>: Soulxes Technologies Pvt. Ltd.\n<strong>Location</strong>: Infopark, Kochi\n<strong>Experience</strong>: 1 – 3 Years\n<strong>Employment Type</strong>: Full-Time\n<strong>Working Days &amp; Time</strong>: Monday to Friday | 9:00 AM – 6:00 PM</p>\n<p>Soulxes Technologies Pvt. Ltd. is seeking a <strong>creative and results-driven Social Media Marketing Executive</strong> to join our team in Infopark, Kochi. The ideal candidate will have hands-on experience in managing social media platforms and executing digital marketing strategies.</p>\n<h3>🔍 Key Responsibilities:</h3>\n<ul>\n<li>Develop, implement, and manage social media strategies</li>\n<li>Create engaging content (posts, reels, captions, creatives)</li>\n<li>Manage company pages on platforms like Instagram, Facebook, LinkedIn, etc.</li>\n<li>Monitor social media trends and competitor activities</li>\n<li>Run paid campaigns and analyze performance metrics</li>\n<li>Generate leads and improve brand awareness</li>\n</ul>\n<h3>✅ Requirements:</h3>\n<ul>\n<li>1–3 years of experience in social media marketing</li>\n<li>Strong knowledge of social media platforms and analytics tools</li>\n<li>Basic understanding of SEO and digital marketing concepts</li>\n<li>Good communication and creative writing skills</li>\n<li>Experience with design tools (Canva/Adobe) is an added advantage</li>\n</ul>\n<h3>📩 How to Apply:</h3>\n<p>Interested candidates can share their updated resume to <strong>info@soulxes.com</strong>.</p>\n<p>Join our team and grow your career in digital marketing with Soulxes Technologies! 🚀</p>\n<p><em>If this opportunity aligns with your career goals, kindly share your updated resume with us at info@soulxes.com</em></p>",
        "tags": [
            "1–3 Years",
            "Social Media Marketing",
            "Content Creation",
            "SEO"
        ],
        "summary": "Soulxes Technologies seeks a Social Media Marketing Executive with 1–3 years of experience to manage digital strategies, create engaging content, and enhance brand awareness through social platforms."
    },
    {
        "job_title": "React Native Developer(Mobile App Developer)(Immediate Joiners Preferred)",
        "company": "Armia Systems Pvt. Ltd",
        "url": "https://infopark.in/company-jobs/details/22096/3",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2><strong>React Native Developer (Mobile App Developer) @ Armia Systems Pvt Ltd</strong></h2>\n<p><strong>Location:</strong> Kochi Infopark\n<strong>Company:</strong> Armia Systems Pvt Ltd</p>\n<p>Armia Systems Pvt Ltd is seeking a skilled <strong>React Native Developer</strong> to join their team in Kochi Infopark. The ideal candidate will collaborate with technical, functional, and industry specialists to design and implement innovative mobile solutions.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Develop and maintain cross-platform mobile applications using <strong>React Native</strong></li>\n<li>Translate UI/UX designs into high-quality, reusable code</li>\n<li>Integrate <strong>REST APIs</strong> and third-party libraries</li>\n<li>Ensure app performance, quality, and responsiveness</li>\n<li>Debug and resolve application issues and crashes</li>\n<li>Collaborate with backend developers and designers</li>\n<li>Publish apps to <strong>Google Play Store</strong> and <strong>Apple App Store</strong></li>\n<li>Participate in code reviews and follow best coding practices</li>\n</ul>\n<h3><strong>Required Skills &amp; Qualifications</strong></h3>\n<ul>\n<li>Solid knowledge of <strong>JavaScript (ES6+)</strong> and <strong>React.js</strong> fundamentals</li>\n<li><strong>2+ years</strong> of hands-on experience in <strong>React Native</strong> mobile app development</li>\n<li>Experience with AI coding agents like <strong>Cursor</strong>, <strong>Codex</strong>, or <strong>Claude</strong></li>\n<li>Proficiency in <strong>React Native libraries</strong> (e.g., <strong>Redux</strong> or <strong>MobX</strong>)</li>\n<li>Knowledge of native module integration for <strong>Android/iOS</strong></li>\n<li>Experience with <strong>TypeScript</strong> or <strong>Flow</strong> for type checking</li>\n<li>Hands-on experience with <strong>RESTful APIs</strong> and <strong>JSON</strong></li>\n<li>Familiarity with <strong>App Store submission processes</strong> for Android and iOS</li>\n<li>At least <strong>2 apps</strong> published in app stores</li>\n<li>Experience with <strong>push notifications</strong> (preferably <strong>Firebase</strong>)</li>\n<li>Strong debugging and performance optimization skills</li>\n<li>Excellent <strong>written and verbal communication</strong> (mandatory)</li>\n<li>Self-starter with motivation to work in dynamic environments</li>\n<li>Ability to adapt quickly to changes</li>\n<li>Strong <strong>analytical and problem-solving</strong> skills</li>\n<li>Familiarity with <strong>Agile software development methodologies</strong></li>\n</ul>\n<p><strong>Immediate Joiners Preferred</strong></p>\n<p><strong>Contact:</strong> Email your resume to <a href=\"mailto:jobs@armia.com\">jobs@armia.com</a></p>",
        "tags": [
            "2+ Years",
            "React Native",
            "Redux/MobX",
            "RESTful APIs"
        ],
        "summary": "A React Native Developer is needed to build cross-platform mobile apps, integrate APIs, and collaborate with teams. Requires 2+ years of experience with React Native, Redux/MobX, and RESTful APIs."
    },
    {
        "job_title": "Business Development Executive",
        "company": "MarketBytes WebWorks Private Limited",
        "url": "https://infopark.in/company-jobs/details/22100/460",
        "location": "Infopark",
        "closing_date": "15 Mar 2026",
        "job_description": "<p><strong>Job Title:</strong> Business Development Executive\n<strong>Company:</strong> MarketBytes WebWorks Private Limited\n<strong>Location:</strong> Infopark, Cherthala\n<strong>Job Type:</strong> Full-Time</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic and result-oriented <strong>Business Development Executive</strong> to join MarketBytes WebWorks Private Limited. This role is ideal for candidates passionate about sales, client relationship management, and driving business growth in the <strong>IT and Digital Marketing</strong> industry. As a Business Development Executive, you will identify new business opportunities, generate leads, present company services, and close deals. You will collaborate with marketing and technical teams to ensure smooth project onboarding and long-term client satisfaction. The ideal candidate should have strong communication skills, a proactive mindset, and the ability to consistently achieve sales targets.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Business Development &amp; Lead Generation:</strong>\n- Identify and generate new business opportunities in IT and digital marketing services.\n- Conduct lead generation through cold calling, networking, referrals, and online platforms.\n- Research potential clients and understand their business needs.</p>\n<p><strong>Client Meetings &amp; Presentations:</strong>\n- Schedule meetings with prospects and present company services effectively.\n- Understand client requirements and propose suitable digital solutions.\n- Deliver persuasive presentations and product demonstrations.</p>\n<p><strong>Proposal &amp; Sales Closure:</strong>\n- Prepare customized proposals, quotations, and service documents.\n- Follow up consistently with prospects to drive conversions.\n- Negotiate terms and close deals efficiently.</p>\n<p><strong>CRM &amp; Pipeline Management:</strong>\n- Maintain and update CRM with accurate lead information.\n- Track leads from initial contact to closure.\n- Generate sales reports and analyze pipeline performance.</p>\n<p><strong>Target Achievement &amp; Relationship Management:</strong>\n- Achieve monthly and quarterly sales targets.\n- Build and maintain long-term client relationships.\n- Ensure client satisfaction and identify opportunities for upselling and cross-selling.</p>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>BBA / MBA (Marketing, Sales, or related field).</li>\n<li>Prior experience in IT sales, digital marketing sales, or business development is preferred.</li>\n<li>Freshers with strong communication skills and a sales-oriented mindset may also apply.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Excellent communication and negotiation skills.</li>\n<li>Strong presentation and interpersonal skills.</li>\n<li>Basic understanding of digital marketing and web development services.</li>\n<li>Target-oriented, self-driven, and proactive mindset.</li>\n<li>Ability to work in a fast-paced, performance-driven environment.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary with performance-based incentives.</li>\n<li>Career growth opportunities within the organization.</li>\n<li>Exposure to diverse clients across industries.</li>\n<li>Supportive and collaborative work environment.</li>\n<li>Continuous learning and professional development opportunities.</li>\n</ul>\n<p><strong>Contact:</strong> Apply by sharing your updated resume at <strong>hr@marketbyteswebworks.com</strong>.</p>",
        "tags": [
            "Freshers/1-2 Years",
            "IT Sales",
            "Digital Marketing",
            "CRM Management"
        ],
        "summary": "Drive business growth in IT and digital marketing through sales, client relationships, and lead generation. Requires strong communication and target-oriented skills."
    },
    {
        "job_title": "Hiring: Marketing Executive – Software Sales (ERP for Manufacturing)",
        "company": "Carol Solutions",
        "url": "https://infopark.in/company-jobs/details/22092/435",
        "location": "Infopark",
        "closing_date": "16 Mar 2026",
        "job_description": "<p><strong>Company:</strong> Carol Solutions\n<strong>Location:</strong> Kochi, Kerala\n<strong>Experience:</strong> Minimum 3 Years in Software Sales</p>\n<h3>About Us</h3>\n<p>Carol Solutions is a leading software company with over 25 years of experience specializing in customized ERP solutions for manufacturing industries. We empower businesses to streamline operations through technology-driven solutions.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a dynamic <strong>Marketing Executive</strong> with strong experience in <strong>software/ERP sales</strong>, preferably in the <strong>manufacturing sector</strong>. The ideal candidate will be confident in identifying new clients, managing relationships, and achieving sales targets.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and approach manufacturing companies for ERP solutions.</li>\n<li>Conduct product presentations and demos.</li>\n<li>Build and maintain strong client relationships.</li>\n<li>Achieve monthly and quarterly sales targets.</li>\n<li>Coordinate with technical and implementation teams.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>✅ Minimum 3 years of experience in software or ERP sales.</li>\n<li>✅ Excellent communication and presentation skills.</li>\n<li>✅ Strong understanding of the manufacturing domain preferred.</li>\n<li>✅ Self-motivated and target-driven.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Attractive salary with incentives.</li>\n<li>Growth-oriented environment.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at jobs@carolsolutions.com</p>",
        "tags": [
            "Minimum 3 Years",
            "ERP Sales",
            "Manufacturing Domain",
            "Software Sales"
        ],
        "summary": "Carol Solutions seeks a Marketing Executive with 3+ years in ERP/software sales for manufacturing. Responsibilities include client acquisition, presentations, and sales target achievement."
    },
    {
        "job_title": "ERP Consulatant",
        "company": "Pearlsoft Technologies LLP",
        "url": "https://infopark.in/company-jobs/details/22097/401",
        "location": "Infopark",
        "closing_date": "16 Mar 2026",
        "job_description": "<h2>ERP Consultant</h2>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Implementation &amp; Configuration</strong>: Managing the entire implementation lifecycle, including installing, customizing, and configuring ERP software to meet specific business workflows.</li>\n<li><strong>Business Analysis</strong>: Assessing current business processes, identifying gaps, and recommending improvements to enhance efficiency.</li>\n<li><strong>Data Migration &amp; Integration</strong>: Overseeing the secure transfer of data from legacy systems and integrating the ERP with third-party applications.</li>\n<li><strong>Project Management</strong>: Overseeing project timelines, budgets, and resources to ensure successful, timely, and on-budget delivery.</li>\n<li><strong>Training &amp; Support</strong>: Conducting user training, creating documentation, and providing post-implementation support to resolve issues and optimize performance.</li>\n</ul>\n<h3>Qualifications &amp; Skills</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Business, or related fields.</li>\n<li>Proven experience with specific ERP systems (e.g., SAP, Oracle, NetSuite, Microsoft Dynamics 365).</li>\n<li>Strong analytical, problem-solving, and communication skills to translate business needs into technical solutions.</li>\n<li>Knowledge of SQL, database management, and business processes (finance, supply chain).</li>\n</ul>\n<p><strong>Contact</strong>: If this opportunity aligns with your career goals, kindly share your updated resume with us at <a href=\"mailto:joinus@pearlsofttechnologies.com\">joinus@pearlsofttechnologies.com</a></p>",
        "tags": [
            "7+ Years",
            "SAP",
            "Oracle",
            "Microsoft Dynamics 365"
        ],
        "summary": "ERP Consultant with 7+ years experience implementing ERP systems, managing projects, and optimizing business processes through technical solutions."
    },
    {
        "job_title": "Software Architect",
        "company": "Classic Technologies & Business Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/22093/340",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<p><strong>Software Architect</strong></p>\n<p><strong>The Company</strong>\nCTeBS, a subsidiary of Classic Fashion, is a leading software solution provider to the apparel manufacturing industry globally. Our suite of enterprise-level products, including our flagship Trendz CMP, leverages cutting-edge technology to enhance productivity, quality, and efficiency, ensuring our clients achieve unparalleled growth and success. Our journey with Classic Fashion has uniquely positioned us to design technology-enabled products and solutions for the ever-evolving needs of the apparel manufacturing sector, and we are poised for an exciting phase of growth.</p>\n<p><strong>Job Summary</strong>\nWe are looking for a hands-on Software Architect who is passionate about building scalable, high-performance software. In this role, you will serve as the bridge between high-level architectural vision and low-level code implementation. Unlike a pure manager, you will remain deeply involved in the code. You will own the technical design for major features, enforce coding standards, and solve the complex problems that stall development teams. You will work closely with the Associate Technical Manager (who handles delivery/metrics) while you ensure the technical integrity of the solution.</p>\n<p><strong>Responsibilities</strong>\n- Take full architectural responsibility for specific products or core modules (e.g., the Production Planning Engine or Payroll Calculation System).\n- Translate business requirements into technical design documents (TDDs), defining data models, API contracts, and class structures before coding begins.\n- Proactively identify \"spaghetti code\" or technical debt in our legacy Java/MSSQL systems and design safe refactoring plans to modernize them.\n- Be the final approver for critical code merges. You do not just check for bugs; you check for maintainability, security, and scalability.\n- Deep dive into database execution plans (Oracle/MSSQL) and application logic to optimize slow queries and reduce latency.\n- Enforce consistent design patterns (Singleton, Factory, Observer, etc.) across the development team to ensure the codebase remains uniform.\n- Act as the \"Problem Solver in Chief\" for the development team. When a developer is stuck on a complex logic issue, you provide the solution.\n- Mentor Senior Developers on how to write clean, efficient, and testable code. Conduct technical workshops on new frameworks or best practices.</p>\n<p><strong>Qualifications</strong>\n- <strong>8 to 12 years</strong> of software development experience, with at least <strong>2+ years</strong> in a Software Architect Role.\n- Expert in <strong>Java/J2EE</strong> (Spring, Hibernate, Multithreading).\n- Strong proficiency in <strong>MSSQL or Oracle</strong> (Stored Procedures, Indexing, Partitioning).\n- Solid understanding of <strong>Angular component architecture</strong> (even if you don't write CSS daily, you understand the data flow).\n- Strong grasp of <strong>Object-Oriented Design (OOD)</strong>, <strong>Microservices patterns</strong>, and <strong>RESTful API design</strong>.\n- Experience with <strong>CI/CD pipelines</strong> (Jenkins/GitLab), <strong>Docker</strong>, and code quality tools (SonarQube).\n- Proven ability to debug complex production issues (memory leaks, thread deadlocks) under pressure.</p>\n<p><strong>Contact Information</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@ctebs.com</strong>.</p>",
        "tags": [
            "8-12 Years",
            "Java",
            "MSSQL/Oracle",
            "Angular"
        ],
        "summary": "Hands-on Software Architect with 8-12 years experience in Java, MSSQL/Oracle, and Angular, leading technical design and mentoring teams."
    },
    {
        "job_title": "Technical Support Agent",
        "company": "VIPoint Solutions Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/22094/62",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Position: Technical Support Agent</h2>\n<h3>Experience:</h3>\n<ul>\n<li><strong>5+ Years</strong></li>\n</ul>\n<h3>Summary:</h3>\n<p>Technical support agents are responsible for helping our customers and free users to work through technical problems and to better understand how our products can accomplish their goals. In doing so, they will also contribute to our feedback loop by identifying and logging bugs, in addition to other general user feedback including feature requests and pain points. Technical support agents will use the insight they gain through talking to customers to contribute to the overall improvement of our team internally and to our user experience through documentation and other tool, process, or product improvements.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Respond to support requests via email, chat, and our wordpress.org forums to solve technical issues and guide users through setting up and using our plugins to accomplish their goals</li>\n<li>Meet team standards related to work volume, SLAs, and quality</li>\n<li>Take ownership of work, work independently, and use available resources to get through roadblocks to complete assignments</li>\n<li>Report feedback received during support interactions, including feature requests, bugs, and user pain points, following the appropriate processes</li>\n<li>Contribute to the growth of the support team by assisting teammates and creating internal documentation</li>\n<li>Contribute regularly to improving our public documentation by identifying, logging, and completing needed updates to the knowledgebase</li>\n<li>Strive for continuous improvement in both technical and customer service skills</li>\n</ul>\n<h3>General Skills, Competencies, and Qualifications:</h3>\n<ul>\n<li>Excellent communication skills in English</li>\n<li>Ability to efficiently solve problems that don't have pre-documented answers</li>\n<li>Clear communication of technical concepts to non-technical users</li>\n<li>Ability to communicate information from non-technical users to our engineers, with the technical detail they need to understand the issue</li>\n<li>Outstanding customer service skills</li>\n</ul>\n<h3>Contact:</h3>\n<ul>\n<li>Send your CV to <strong>hr@vipointsolutions.net</strong></li>\n<li>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr.vipointsolutions@gmail.com</strong></li>\n</ul>",
        "tags": [
            "5+ Years",
            "Problem-Solving",
            "Technical Communication",
            "Customer Service"
        ],
        "summary": "Technical Support Agent provides customer assistance, logs feedback, and contributes to product improvements through user insights and documentation updates."
    },
    {
        "job_title": "Digital Marketing Specialist",
        "company": "Cabot Technology Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/22098/64",
        "location": "Infopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<p><strong>Digital Marketing Specialist</strong></p>\n<p>We’re seeking a dynamic <strong>Senior Digital Marketing Specialist</strong> to lead and elevate our digital marketing strategy. This role combines a deep understanding of digital marketing with strategic thinking, data-driven insights, and the ability to lead cross-functional teams. The ideal candidate will have a strong track record of executing and optimizing SEO, paid media, social media, and CMS strategies, while driving measurable business growth. If you're a leader with a passion for digital innovation, this is the role for you!</p>\n<p><strong>Key Responsibilities:</strong>\n- Lead and oversee the development and execution of comprehensive digital marketing strategies across SEO, paid media (Google Ads, Meta Ads, etc.), social media, and CMS.\n- Manage and mentor a team of digital marketers, setting clear objectives, performance standards, and guiding the team in executing high-impact campaigns.\n- Drive strategic direction for SEO optimization, including advanced on-page and off-page strategies, keyword research, and content alignment with business goals.\n- Lead the planning, budgeting, and execution of paid media campaigns, ensuring ROI and performance optimization across channels.\n- Oversee the design and implementation of complex websites and landing pages, working closely with design and content teams to align with business objectives.\n- Develop and execute social media strategies to increase engagement, brand awareness, and conversions.\n- Lead cross-functional teams to design and optimize marketing automation workflows and oversee CRM integrations for lead nurturing and conversion.\n- Analyse, interpret, and present campaign performance data, generating actionable insights to continuously improve campaigns.\n- Stay up to date with the latest trends, technologies, and best practices in digital marketing to ensure the company stays ahead of the curve.\n- Manage relationships with external vendors and agencies as needed for specialized projects or initiatives.\n- Own key performance indicators (KPIs), ensuring alignment with broader company goals, and drive continuous improvement based on data insights.</p>\n<p><strong>Skills You Need:</strong>\n- <strong>Advanced SEO Expertise:</strong> Proven experience in developing and executing advanced SEO strategies, including on-page, off-page, technical SEO (site audits, Core Web Vitals, schema markup, etc.), and local SEO.\n- <strong>Paid Media Mastery:</strong> Hands-on experience with Google Ads, Meta Ads, and other paid media platforms; expertise in campaign optimization, A/B testing, audience segmentation, and budget management.\n- <strong>Social Media Strategy:</strong> Strong knowledge in social media strategy, content creation, community engagement, and campaign analytics to drive measurable results.\n- <strong>Analytics and Reporting:</strong> Advanced proficiency in Google Analytics 4 (GA4), Tag Manager, UTM tracking, data analysis, and creating dashboards to track performance and report insights.\n- <strong>CMS and Web Development:</strong> Experience managing websites with CMS platforms like WordPress, Webflow, or similar, including optimizing user experience and improving conversion rates.\n- <strong>Leadership:</strong> Proven ability to lead and inspire a team, with strong project management skills and the ability to manage multiple projects simultaneously.\n- <strong>Marketing Automation/CRM:</strong> Expertise in marketing automation platforms (e.g., HubSpot, Marketo, Salesforce, etc.) to create personalized customer journeys and optimize lead nurturing.\n- <strong>Cross-Functional Collaboration:</strong> Ability to work closely with product, sales, and content teams to ensure alignment and synergy across all marketing channels.\n- <strong>Strategic Vision:</strong> Strong analytical mindset with the ability to think strategically and execute hands-on, balancing creative and data-driven approaches.\n- <strong>Communication &amp; Presentation Skills:</strong> Strong written and verbal communication skills, with experience in presenting to stakeholders and executive teams.</p>\n<p><strong>Required Skills</strong>\n- Solid experience in digital marketing, with a proven track record of managing and optimizing large-scale campaigns.\n- Experience in a leadership role, managing and mentoring teams, and collaborating with cross-functional teams to drive marketing initiatives.\n- Strong understanding of the digital marketing landscape, trends, and tools.</p>\n<p><strong>Experience:</strong> 7-10 years</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@cabotsolutions.com</strong>.</p>",
        "tags": [
            "7-10 Years",
            "SEO",
            "Paid Media",
            "CMS"
        ],
        "summary": "Senior Digital Marketing Specialist leads SEO, paid media, and social strategies with 7-10 years of experience. Requires expertise in analytics, CMS, and cross-functional leadership."
    },
    {
        "job_title": "Project Manager",
        "company": "Eartheye Space Private Limited",
        "url": "https://technopark.org/job-details/27742",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Eartheye Space Private Limited</h2>\n<p><strong>Location:</strong> STPI BUILDING, Technopark, Karyavattom P. O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"https://eartheye.space\">https://eartheye.space</a>\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> abhishek@eartheye.space</p>\n<h3>Brief Description</h3>\n<p>We are seeking an experienced <strong>Technical Project Manager</strong> to lead multidisciplinary delivery across software engineering, data science, and generative AI. You will manage complex initiatives spanning product development, integration, and client onboarding. This role requires hands-on technical capability (including coding and code walk-through), strong communication, excellent execution skills, and coordination across distributed teams.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li><strong>10+ years</strong> of experience in software product delivery management.</li>\n<li>Lead and manage delivery to ensure alignment and successful execution with product requirements.</li>\n<li>Plan, schedule, and track timely software releases and integration milestones.</li>\n<li>Coordinate across product, engineering, data science, Gen AI, and QA teams for high-quality delivery.</li>\n<li>Ensure technical requirements are well-defined, understood, and executed with minimal ambiguity.</li>\n<li>Act as a key interface between product leadership, technical teams, and external stakeholders.</li>\n<li>Proactively identify risks, dependencies, and blockers; implement mitigation strategies.</li>\n<li>Provide hands-on technical support (code review, architectural discussions, technical problem-solving).</li>\n<li>Drive process improvements and adopt agile best practices across teams.</li>\n<li>Mentor and grow team leads and individual contributors.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong technical background with hands-on coding proficiency.</li>\n<li>Demonstrated success in managing cross-functional teams and large technical deliverables.</li>\n<li>Proficiency in modern software development practices, Agile frameworks, and CI/CD workflows.</li>\n<li>Excellent organizational, communication, and stakeholder management skills.</li>\n<li>Ability to translate complex technical challenges into actionable plans.</li>\n<li>Certifications in PMP, Scrum Master, or equivalent.</li>\n<li>Coding experience in <strong>Python</strong>, <strong>JavaScript/TypeScript</strong>, or equivalent.</li>\n<li>Experience with cloud platforms (<strong>AWS</strong>, Azure, or Google Cloud).</li>\n<li>Familiarity with geospatial domain, APIs, and data processing workflows.</li>\n<li>Knowledge of satellite data processing and remote sensing workflows is a bonus.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Python",
            "JavaScript",
            "AWS"
        ],
        "summary": "Lead software and AI projects with 10+ years of experience in technical project management, requiring Python, JavaScript, and cloud platforms expertise."
    },
    {
        "job_title": "Multimedia Designer",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/27741",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<p><strong>Klystron Technologies</strong></p>\n<p><strong>Office Location:</strong> Office Nbr: 2210, Yamuna Building, Technopark Phase-III, Thiruvananthapuram, 695583\n<strong>Company Website:</strong> <a href=\"https://www.klystronglobal.com\">https://www.klystronglobal.com</a>\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> jobs.in@klystronglobal.com</p>\n<h3><strong>Multimedia Designer</strong></h3>\n<p><strong>Location:</strong> Technopark, Thiruvananthapuram\n<strong>Job Type:</strong> Full-time\n<strong>Joining Time:</strong> Within 30 days\n<strong>Experience:</strong> 0 to 1 year\n<strong>Status:</strong> URGENT HIRING!</p>\n<h4><strong>Brief Description</strong></h4>\n<p>We are seeking a creative and versatile Multimedia Designer to bring our brand to life through engaging videos, animations, and visually compelling designs. The ideal candidate will produce high-quality content for social media, websites, marketing campaigns, and internal communication, including 2D/3D animation videos.</p>\n<h4><strong>Key Responsibilities</strong></h4>\n<ul>\n<li>Design eye-catching graphics for digital marketing, social media, presentations, and print materials.</li>\n<li>Create 2D and 3D animation videos (explainer videos, product demos, corporate storytelling, motion graphics).</li>\n<li>Develop animated explainer videos, product showcases, and corporate videos.</li>\n<li>Edit, color-correct, and enhance videos for promotional and internal use.</li>\n<li>Conceptualize creative ideas and transform them into compelling visual content.</li>\n<li>Maintain brand consistency across all designs and multimedia assets.</li>\n<li>Collaborate with marketing and content teams to deliver impactful multimedia content.</li>\n<li>Stay updated with current design trends, animation techniques, and visual tools.</li>\n</ul>\n<h4><strong>Required Skills &amp; Tools</strong></h4>\n<ul>\n<li><strong>Graphic Design:</strong> Adobe Illustrator, Adobe Photoshop, Adobe InDesign</li>\n<li><strong>Video Editing &amp; Animation:</strong> Adobe After Effects, Adobe Premiere Pro (or similar)</li>\n<li><strong>2D Animation Tools:</strong> After Effects, Animate, Toon Boom</li>\n<li><strong>3D Animation Tools:</strong> Blender, Cinema 4D, Maya (basic or intermediate)</li>\n</ul>\n<h4><strong>Preferred Skills</strong></h4>\n<ul>\n<li>Strong understanding of layout, typography, and color theory.</li>\n<li>Experience creating visuals for social media, ads, websites, and corporate communication.</li>\n<li>Creativity, attention to detail, and the ability to manage multiple projects.</li>\n</ul>\n<h4><strong>Nice-to-Have Skills</strong></h4>\n<ul>\n<li>Knowledge of UI/UX design for web or mobile.</li>\n<li>Familiarity with Canva or Figma for quick design tasks.</li>\n</ul>\n<p><strong>Apply Now:</strong> If you are a motivated and experienced Multimedia Designer seeking a challenging opportunity, apply via <strong>jobs.in@klystronglobal.com</strong>.</p>",
        "tags": [
            "0-1 Year",
            "Adobe After Effects",
            "Adobe Premiere Pro",
            "2D/3D Animation"
        ],
        "summary": "Creative Multimedia Designer needed for 0-1 year experience to create engaging videos, animations, and graphics for marketing and corporate use."
    },
    {
        "job_title": "Digital Marketing Expert",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/27740",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>Klystron Technologies</h2>\n<p><strong>Office Nbr:</strong> 2210, Yamuna Building, Technopark Phase-III, 695583\n<strong>Website:</strong> <a href=\"https://www.klystronglobal.com\">https://www.klystronglobal.com</a>\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> jobs.in@klystronglobal.com</p>\n<h3>Location</h3>\n<p>Technopark, Thiruvananthapuram</p>\n<h3>Job Type</h3>\n<p>Full-time</p>\n<h3>Joining Time</h3>\n<p>Within 30 days</p>\n<p><strong>We are seeking a highly skilled and versatile Digital Marketing Expert</strong> to join our team. The ideal candidate will combine expertise in SEO, graphic design, UI/UX, video editing, and web development to deliver creative campaigns, optimize online presence, and enhance user engagement across digital platforms.</p>\n<h3>Key Responsibilities</h3>\n<h4>SEO &amp; Website Optimization</h4>\n<ul>\n<li>Develop and execute SEO strategies to improve website traffic and search engine rankings.</li>\n<li>Conduct keyword research, technical audits, on-page/off-page optimization.</li>\n<li>Track performance using Google Analytics, Search Console, and other tools.</li>\n</ul>\n<h4>Graphic Design</h4>\n<ul>\n<li>Create engaging visuals for social media, ads, websites, and marketing campaigns.</li>\n<li>Ensure brand consistency across all designs and platforms.</li>\n</ul>\n<h4>UI &amp; UX Design</h4>\n<ul>\n<li>Improve user journeys on websites and landing pages to boost engagement and conversions.</li>\n<li>Conduct user research, wireframing, and prototyping using tools like Figma or Adobe XD.</li>\n</ul>\n<h4>Video Editing</h4>\n<ul>\n<li>Edit and produce promotional videos, reels, and content for social media/ads.</li>\n<li>Add motion graphics, effects, and branding elements to enhance video quality.</li>\n</ul>\n<h4>Web Development</h4>\n<ul>\n<li>Manage and maintain company websites (WordPress or custom-built).</li>\n<li>Implement landing pages, website updates, and ensure mobile-friendly responsiveness.</li>\n<li>Collaborate with teams to integrate SEO and UX best practices into development.</li>\n</ul>\n<h3>Preferred Skills &amp; Requirements</h3>\n<ul>\n<li>Proven experience as a Digital Marketing Expert or similar role.</li>\n<li>Strong knowledge of SEO tools (Ahrefs, SEMrush, Google Analytics, etc.).</li>\n<li>Proficiency in design tools (Photoshop, Illustrator, Canva, etc.).</li>\n<li>Experience in UI/UX design (Figma, Adobe XD, Sketch, etc.).</li>\n<li>Skilled in video editing software (Adobe Premiere Pro, After Effects, Final Cut Pro, etc.).</li>\n<li>Hands-on experience with web development (WordPress, HTML, CSS, JavaScript).</li>\n<li>Ability to manage multiple projects and deliver high-quality work on time.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "SEO",
            "UI/UX Design",
            "Web Development"
        ],
        "summary": "Digital Marketing Expert with SEO, UI/UX, graphic design, video editing, and web development skills to enhance online presence and user engagement across platforms."
    },
    {
        "job_title": "Dot Net Developer",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/27739",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>Klystron Technologies</h2>\n<p><strong>Office Nbr:</strong> 2210, Yamuna Building, Technopark Phase-III, 695583\n<strong>Website:</strong> <a href=\"https://www.klystronglobal.com\">www.klystronglobal.com</a>\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:jobs.in@klystronglobal.com\">jobs.in@klystronglobal.com</a></p>\n<h3>Location</h3>\n<p>Technopark, Thiruvananthapuram</p>\n<h3>Job Type</h3>\n<p>Full-time</p>\n<h3>Joining Time</h3>\n<p>Within 30 days</p>\n<h3>About Us</h3>\n<p>Klystron Global is a leading provider of cutting-edge Digital Transformation solutions, tailored to meet the evolving needs of businesses across diverse industries. With a strong focus on innovation and client satisfaction, we deliver exceptional technology solutions that empower organizations to thrive in the digital era. Established in 2009, Klystron Global has expanded its presence worldwide with branches in Dubai, Oman, Bahrain, India, and the US.</p>\n<h3>Position Overview</h3>\n<p>We are seeking dynamic and results-driven ASP.NET, MVC developers to develop and support existing applications. The role involves full-stack development from back-end to client-side code using optimal technologies, frameworks, and patterns.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Work in a development team to develop integrated ASP.NET applications.</li>\n<li>Perform design and development of web-based services and applications.</li>\n<li>Collaborate with quality assurance teams to ensure high-quality, reliable web applications.</li>\n<li>Experience in WPF development.</li>\n<li>Develop databases including queries, triggers, and stored procedures.</li>\n<li>Monitor application performance post-deployment and implement necessary changes.</li>\n<li>Interact with customers to define project features and requirements.</li>\n<li>Research and develop prototypes for complex design solutions.</li>\n<li>Conduct code reviews and provide corrections.</li>\n<li>Develop coding guidelines for the ASP.NET development team.</li>\n<li>Follow industry best practices for application design, development, and deployment.</li>\n<li>Resolve application defects and issues promptly.</li>\n<li>Prepare technical documents per project standards.</li>\n<li>Conduct application testing using test cases and plans.</li>\n<li>Collaborate with Project Managers for timely project delivery.</li>\n<li>Coordinate with Business Analysts and Test Analysts to meet technical and client requirements.</li>\n</ul>\n<h3>Preferred Education / Experience</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, Software Engineering, or similar.</li>\n<li><strong>2+ years</strong> of experience in C#, ASP.NET, MVC, WPF, WCF.</li>\n<li>Prior experience as a Developer.</li>\n<li>Extensive working knowledge of .NET languages (C#, VB.NET).</li>\n<li>Familiarity with ASP.NET framework and SQL Server.</li>\n<li>Strong attention to detail.</li>\n<li>Excellent communication skills.</li>\n</ul>\n<h3>Preferred Knowledge / Skills</h3>\n<ul>\n<li>Experience with design and implementation of controls or data acquisition systems.</li>\n<li>Strong interpersonal, presentation, and leadership skills.</li>\n<li>Demonstrated initiative and attention to completeness, accuracy, and detail.</li>\n<li>Ability to manage multiple projects simultaneously.</li>\n<li>Proven ability to meet budgets and schedules.</li>\n<li>Effective as an individual contributor and team player in a multidisciplinary environment.</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Competitive salary.</li>\n<li>Ongoing professional development opportunities.</li>\n<li>Collaborative and innovative work environment.</li>\n</ul>\n<p><strong>Apply Now:</strong> If you are a motivated and experienced ASP.NET Developer seeking a challenging opportunity, apply at <a href=\"mailto:jobs.in@klystronglobal.com\">jobs.in@klystronglobal.com</a>.</p>",
        "tags": [
            "2+ Years",
            "ASP.NET",
            "MVC",
            "WPF"
        ],
        "summary": "Klystron Global seeks a full-time ASP.NET Developer with 2+ years of experience in C#, MVC, and WPF to design, develop, and deploy web applications while collaborating with cross-functional teams."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Klystron Technologies",
        "url": "https://technopark.org/job-details/27738",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>Job Title: Odoo Developer</h2>\n<p><strong>Job Type:</strong> Full-time\n<strong>Joining Time:</strong> Within 30 days\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> jobs.in@klystronglobal.com</p>\n<h3>About Us</h3>\n<p>Klystron Global is a leading provider of cutting-edge Digital Transformation solutions, tailored to meet the evolving needs of businesses across diverse industries. With a strong focus on innovation and client satisfaction, we deliver exceptional technology solutions that empower organizations to thrive in the digital era. Established in 2009, Klystron Global has expanded its presence worldwide with branches in Dubai, Oman, Bahrain, India, and the US.</p>\n<h3>Position Overview</h3>\n<p>We are seeking dynamic and results-driven Odoo developers to develop and support existing applications. The main scope of work includes everything from back-end to client-side code, using optimal and efficient technologies, frameworks, and patterns. Your primary responsibilities will be to design and develop these applications.</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li><strong>Programming Languages:</strong> Python &amp; JavaScript</li>\n<li><strong>Database:</strong> PostgreSQL (with object-relational mapping)</li>\n<li><strong>Collaboration Platform:</strong> GitHub</li>\n<li>Design, review, and test code within the Odoo ecosystem</li>\n<li>Design and develop integrated Odoo applications using proper conventions and design standards</li>\n<li>Analyze, diagnose, and resolve application errors</li>\n<li>Develop solutions for clients across industries, sectors, and company sizes</li>\n<li>Provide client support</li>\n<li>Development and customizations to Odoo ERP modules</li>\n</ul>\n<h3>Preferred Education / Experience</h3>\n<ul>\n<li>Bachelor's degree in Computer Science, Information Technology, Software Engineering, or similar</li>\n<li>1 - 4 years of experience as an Odoo developer</li>\n<li>Prior experience as a Python Developer</li>\n<li>PostgreSQL database or relational database skills</li>\n<li>Keen eye for detail</li>\n<li>Strong communication skills</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Framework:</strong> Odoo versions 11.0 to 19.0 (ORM, Workflows, Report Engine, BI, AI)</li>\n<li>Object-oriented programming, object modeling, and relational databases</li>\n<li>Excellent interpersonal, presentation, and leadership skills</li>\n<li>Demonstrated initiative and attention to completeness, accuracy, and details</li>\n<li>Must be a self-starter, able to balance priorities between multiple projects</li>\n<li>Demonstrated ability to meet budgets and schedules</li>\n<li>Ability to work independently and collaborate in a multi-disciplinary team</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Competitive salary</li>\n<li>Ongoing professional development opportunities</li>\n<li>Collaborative and innovative work environment</li>\n</ul>\n<p><strong>Contact:</strong> For inquiries, reach out to <a href=\"mailto:jobs.in@klystronglobal.com\">jobs.in@klystronglobal.com</a>.</p>",
        "tags": [
            "1 - 4 Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Odoo Developer with 1-4 years of experience required to design, develop, and support applications using Python, PostgreSQL, and Odoo frameworks."
    },
    {
        "job_title": "Service Coordinator (0-1 Year)",
        "company": "Genrobotic Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27737",
        "location": "Technopark",
        "closing_date": "04 Mar 2026",
        "job_description": "<p><strong>GENROBOTIC INNOVATIONS (P) Ltd</strong></p>\n<p><strong>Location</strong>: Thejaswini Building, Technopark, Trivandrum, Kerala, India, 695581\n<strong>Website</strong>: <a href=\"http://www.genrobotics.org\">http://www.genrobotics.org</a>\n<strong>Closing Date</strong>: 04, Mar 2026\n<strong>Published Date</strong>: 16, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:career@genrobotics.org\">career@genrobotics.org</a></p>\n<h2>Job Title</h2>\n<p><strong>Service Coordinator (0-1 Year)</strong></p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Prepare CAMC and Paid Service proposals as per client requirements.</li>\n<li>Maintain and update CAMC schedules, registers, and track service reports.</li>\n<li>Coordinate collection of POs and maintain the CAMC Register.</li>\n<li>Draft and review Warranty Certificates, terms, and conditions.</li>\n<li>Create and follow up on internal billing and ensure timely billing updates.</li>\n<li>Generate CAMC and Maintenance letters for clients.</li>\n<li>Maintain a daily task list and ensure its regular updating and completion (all service activities).</li>\n<li>Collect, organize, and archive all service reports from engineers.</li>\n<li>Review all ISO-related documentation monthly for compliance.</li>\n<li>Update KPI tasks of all engineers and monitor performance indicators.</li>\n<li>Manage and update monthly expense sheets accurately.</li>\n<li>Draft monthly fund request documents and submit them with supporting details.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>Documentation</strong></li>\n<li><strong>Good Coordination Ability</strong></li>\n<li><strong>Proficiency in MS Office</strong></li>\n<li><strong>Good Communication</strong></li>\n<li><strong>Proficiency in Hindi</strong></li>\n<li><strong>Ability to manage multiple tasks and meet deadlines efficiently</strong></li>\n</ul>\n<h2>Education &amp; Experience</h2>\n<ul>\n<li><strong>Education</strong>: Bachelor’s degree (any discipline)</li>\n<li><strong>Experience Level</strong>: 0–1 year (Freshers)</li>\n<li><strong>Mandatory Requirement</strong>: Hindi speaking</li>\n</ul>\n<h2>Job Location</h2>\n<p><strong>Technopark, Thiruvananthapuram</strong></p>\n<p><strong>Application</strong>: <a href=\"#\">Click here to Apply</a></p>",
        "tags": [
            "0–1 Year",
            "Documentation",
            "MS Office",
            "Hindi"
        ],
        "summary": "Coordinates service requests, manages documentation, and ensures compliance. Requires Hindi proficiency and MS Office skills for efficient service operations."
    },
    {
        "job_title": "Business Development Associate(Technical)",
        "company": "Picky Assist (P) Ltd",
        "url": "https://technopark.org/job-details/27736",
        "location": "Technopark",
        "closing_date": "25 Feb 2026",
        "job_description": "<p><strong>Picky Assist (P) Ltd</strong>\n<strong>Location</strong>: T-TBI, G3B, Ground Floor, Thejaswini Building, Technopark, Kariyavattom, 695581\n<strong>Website</strong>: <a href=\"https://www.pickyassist.com\">https://www.pickyassist.com</a></p>\n<h2>Role Overview</h2>\n<p><strong>Business Development Associate (Technical)</strong></p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and approach software companies across South India to introduce and promote Picky Assist’s WhatsApp API solutions.</li>\n<li>Understand customer requirements and explain technical concepts in a user-friendly manner.</li>\n<li>Guide clients through WhatsApp API integration, coordinating with internal teams.</li>\n<li>Conduct online/onsite demos, product walkthroughs, and technical discussions.</li>\n<li>Build long-term client relationships for seamless onboarding and satisfaction.</li>\n<li>Meet monthly sales targets and contribute to revenue growth.</li>\n<li>Travel across South India for client visits and business development.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Engineering degree with basic understanding of APIs, programming, and software integration.</li>\n<li>Excellent English communication skills (mandatory).</li>\n<li>Minimum 6 months experience in Sales or Technical roles.</li>\n<li>Strong customer need analysis and solution-oriented approach.</li>\n<li>Excellent interpersonal skills and customer focus.</li>\n</ul>\n<h3>Mandatory Requirements</h3>\n<ul>\n<li>Own 2-wheeler with valid driving license.</li>\n<li>Personal laptop for daily work.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send CV to <strong>careers@pickyassist.com</strong> or WhatsApp <a href=\"https://wa.me/18302680508?text=careers\">https://wa.me/18302680508?text=careers</a></p>\n<p><strong>Application Deadline</strong>: 25, Feb 2026\n<strong>Job Published</strong>: 16, Feb 2026</p>",
        "tags": [
            "6+ Months",
            "APIs",
            "Sales",
            "Programming Concepts"
        ],
        "summary": "Technical Business Development Associate promoting WhatsApp API solutions in South India. Requires 6+ months sales/tech experience and API/programming knowledge."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27735",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<p><strong>Revyrie Global</strong>\n17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a></p>\n<p><strong>Business Development Executive</strong></p>\n<p><strong>Closing Date:</strong> 23, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>About the Role</h3>\n<p>Support end-to-end business development activities including:\n- Lead generation, client acquisition, and basic account management\n- Executing inside sales activities to generate qualified leads and conversions\n- Planning and executing sales/marketing campaigns across industries/regions\n- Identifying new business opportunities and contributing to market expansion\n- Collaborating with leadership, marketing teams, and partners for growth initiatives\n- Maintaining CRM systems to track leads, sales activities, and pipeline status\n- Following up with prospects, conducting initial discussions, and coordinating closures\n- Conducting market research and competitor analysis to understand customer needs\n- Preparing sales reports, lead status updates, and performance summaries\n- Handling client communication, feedback, and issue resolution\n- Supporting account management to build long-term client relationships\n- Contributing ideas for sales process improvement</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>2–3 years</strong> of experience in Business Development, Inside Sales, or Lead Generation</li>\n<li>Exposure to B2B/B2C sales and client interaction</li>\n<li>Hands-on CRM tools and lead research platform experience</li>\n<li>Strong communication, interpersonal, negotiation, and presentation skills</li>\n<li>Ability to analyze leads, understand customer needs, and suggest solutions</li>\n<li>Cross-functional collaboration willingness</li>\n<li>Basic sales planning/forecasting knowledge</li>\n<li>Proficiency in MS Office</li>\n<li>Strong organizational skills, time management, and results-driven mindset</li>\n<li>Independence in meeting targets</li>\n</ul>\n<p><strong>Information Requested:</strong> Mention <strong>Job Code: BD/2026</strong> in the subject line of your application.</p>",
        "tags": [
            "2-3 Years",
            "CRM Tools",
            "Inside Sales",
            "Business Development"
        ],
        "summary": "Support business development, lead generation, and client acquisition. Requires 2-3 years of sales experience, CRM proficiency, and collaboration skills."
    },
    {
        "job_title": "NODE JS DEVELOPER",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/27734",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<p><strong>Company:</strong> ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED\n<strong>Location:</strong> Technopark, Trivandrum, Kerala\n<strong>Job Title:</strong> Node.js Developer\n<strong>Closing Date:</strong> 13, Mar 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact:</strong> recruitment@ateamsoftsolutions.com | +91 7907410058\n<strong>Work Mode:</strong> Onsite\n<strong>Joining Preference:</strong> Immediate joiners (within 30 days)</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable server-side applications using Node.js.</li>\n<li>Develop server-side logic and integrate front-end components.</li>\n<li>Collaborate with cross-functional teams to define and implement new features.</li>\n<li>Ensure high performance, reliability, and responsiveness of applications.</li>\n<li>Troubleshoot, debug, and optimize applications.</li>\n<li>Participate in code reviews and provide constructive feedback.</li>\n<li>Contribute to architectural and design decisions.</li>\n<li>Stay updated with the latest Node.js trends and best practices.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or related field.</li>\n<li><strong>4+ years</strong> of professional Node.js development experience.</li>\n<li>Strong proficiency in JavaScript and frameworks like Express.js.</li>\n<li>Experience with asynchronous programming and event-driven architecture.</li>\n<li>Knowledge of RESTful APIs, microservices, and database systems (MongoDB, MySQL, PostgreSQL).</li>\n<li>Familiarity with Git and version control systems.</li>\n<li>Agile development experience and team-oriented mindset.</li>\n<li>Good communication skills.</li>\n<li>Experience with front-end technologies like React.js or Angular.js is a plus.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Code reviews and constructive feedback.</li>\n<li>Writing unit tests and performing initial testing.</li>\n<li>Knowledge of CI/CD pipelines and automated testing.</li>\n<li>Experience with GraphQL or WebSocket-based real-time applications.</li>\n<li>Understanding of performance monitoring and optimization techniques.</li>\n</ul>\n<p><strong>Apply Now:</strong> recruitment@ateamsoftsolutions.com</p>",
        "tags": [
            "4+ Years",
            "Node.js",
            "Express.js",
            "RESTful APIs"
        ],
        "summary": "Seeking a Node.js Developer with 4+ years of experience in backend development, Express.js, and RESTful APIs to design scalable applications and collaborate with cross-functional teams."
    },
    {
        "job_title": "Node JS Developer",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27733",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<p><strong>Revyrie Global</strong>\n17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a></p>\n<p><strong>Closing Date:</strong> 23, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Brief Description</h3>\n<ul>\n<li>Design, develop, test, and maintain scalable backend services using <strong>Node.js</strong>.</li>\n<li>Build and optimize <strong>RESTful</strong> and/or <strong>GraphQL APIs</strong> for web and mobile applications.</li>\n<li>Implement secure authentication and authorization mechanisms (<strong>JWT</strong>, <strong>OAuth</strong>).</li>\n<li>Integrate third-party APIs and external services.</li>\n<li>Collaborate with frontend developers, product managers, and QA teams to deliver high-quality solutions.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Perform code reviews and contribute to best development practices.</li>\n<li>Troubleshoot, debug, and optimize application performance.</li>\n<li>Participate in architecture discussions and technical decision-making.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>2+ years</strong> of experience in backend development using <strong>Node.js</strong>.</li>\n<li>Strong proficiency in <strong>JavaScript (ES6+)</strong> and/or <strong>TypeScript</strong>.</li>\n<li>Experience with frameworks such as <strong>Express.js</strong>, <strong>NestJS</strong>.</li>\n<li>Solid understanding of <strong>RESTful API</strong> design principles.</li>\n<li>Experience with databases: <strong>MySQL</strong>, <strong>PostgreSQL</strong>, or <strong>MongoDB</strong>.</li>\n<li>Knowledge of <strong>ORMs/ODMs</strong>.</li>\n<li>Familiarity with <strong>Git</strong> and modern <strong>CI/CD pipelines</strong>.</li>\n<li>Experience with cloud platforms such as <strong>AWS</strong>, <strong>Azure</strong>, or <strong>GCP</strong>.</li>\n<li>Understanding of <strong>Docker</strong> and containerized deployments.</li>\n</ul>\n<p><strong>Information Requested:</strong> Kindly mention <strong>Job code</strong> in the Subject line - <strong>ND/2026</strong></p>",
        "tags": [
            "2+ Years",
            "Node.js",
            "JavaScript/TypeScript",
            "Express.js/NestJS"
        ],
        "summary": "Develop scalable backend services with Node.js, build RESTful/GraphQL APIs, and collaborate with teams to deliver secure, high-performance solutions."
    },
    {
        "job_title": "Frontend Developer - React JS & Native",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27732",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Revyrie Global</strong>\n17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<a href=\"http://www.revyrieglobal.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Role</strong>: Frontend Developer - React JS &amp; Native\n<strong>Closing Date</strong>: 23, Feb 2026\n<strong>Published</strong>: 16, Feb 2026\n<strong>Contact</strong>: <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and maintain scalable, high-performance web applications using React.js.</li>\n<li>Build reusable components and frontend libraries for future use.</li>\n<li>Collaborate with backend developers, UI/UX designers, and product managers to implement user-facing features.</li>\n<li>Optimize applications for maximum speed, scalability, and responsiveness.</li>\n<li>Implement state management using Redux, Context API, or other modern libraries.</li>\n<li>Ensure cross-browser compatibility and responsive UI design.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Participate in code reviews and follow best frontend development practices.</li>\n<li>Troubleshoot, debug, and resolve frontend issues.</li>\n<li>Contribute to mobile app development using React Native.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>3+ years</strong> of experience in frontend development with React.js.</li>\n<li>Strong proficiency in JavaScript (ES6+), HTML5, and CSS3.</li>\n<li>Hands-on experience with React Hooks, functional components, and modern React patterns.</li>\n<li>Hands-on experience with React Native for building mobile applications.</li>\n<li>Strong experience using TypeScript in React/React Native projects.</li>\n<li>Experience with RESTful APIs and API integration.</li>\n<li>Familiarity with state management libraries such as Redux or Context API.</li>\n<li>Experience with modern build tools like Webpack, Vite, or Babel.</li>\n<li>Knowledge of Git and version control workflows.</li>\n<li>Strong problem-solving and debugging skills.</li>\n</ul>\n<p><strong>Note</strong>: Kindly mention <strong>Job Code RD/2026</strong> in the subject line of your application.</p>",
        "tags": [
            "3+ Years",
            "React.js",
            "React Native",
            "TypeScript"
        ],
        "summary": "Frontend Developer with expertise in React.js and React Native to build scalable web and mobile applications. Requires 3+ years of experience and proficiency in modern frontend technologies."
    },
    {
        "job_title": "Software Testing Intern",
        "company": "Breeze Brain Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27731",
        "location": "Technopark",
        "closing_date": "19 Feb 2026",
        "job_description": "<h2>Breeze Brain Technologies (P) Ltd</h2>\n<p><strong>Address:</strong> Module 20, SBC, 2nd Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://www.breezebrain.com\">https://www.breezebrain.com</a></p>\n<h3>Software Testing Intern</h3>\n<p><strong>Closing Date:</strong> 19 February 2026\n<strong>Job Published:</strong> 16 February 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@breezebrain.com\">careers@breezebrain.com</a></p>\n<p><strong>Brief Description</strong>\nWe are seeking a motivated and detail-oriented <strong>Software Testing Intern</strong> to gain hands-on experience in testing <strong>Web and Windows applications</strong>. This role is ideal for candidates with foundational knowledge of software testing concepts and automation tools like <strong>Selenium</strong> and <strong>Winium</strong>.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Assist in <strong>manual and automated testing</strong> of web and desktop applications.</li>\n<li>Support creation/execution of <strong>test cases, scripts, and plans</strong>.</li>\n<li>Learn and apply <strong>Selenium</strong> for web automation and <strong>Winium</strong> for Windows testing.</li>\n<li>Identify, document, and track <strong>bugs and performance issues</strong>.</li>\n<li>Collaborate with developers and senior testers to understand application workflows.</li>\n<li>Participate in <strong>Software Development Life Cycle (SDLC)</strong> stages.</li>\n<li>Ensure software meets quality standards and user requirements.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications:</h3>\n<ul>\n<li><strong>Bachelor’s degree</strong> in Computer Science, Engineering, or related field.</li>\n<li><strong>Basic to intermediate knowledge</strong> of <strong>Selenium WebDriver</strong> for web automation.</li>\n<li><strong>Basic knowledge</strong> of <strong>Winium</strong> for Windows application testing.</li>\n<li>Understanding of <strong>testing methodologies, SDLC, and defect lifecycle</strong>.</li>\n<li>Strong <strong>communication skills</strong> and <strong>problem-solving abilities</strong>.</li>\n</ul>\n<h3>Internship Details:</h3>\n<ul>\n<li><strong>Duration:</strong> 6 Months</li>\n<li><strong>Stipend:</strong> ₹6,000 – ₹12,000 (based on performance and skill level)</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Send your resume to: <a href=\"mailto:careers@breezebrain.com\">careers@breezebrain.com</a>\n<strong>Subject Line:</strong> <em>Software Testing Intern</em>\n<em>Applications without the correct subject line may be delayed or rejected.</em></p>",
        "tags": [
            "0-1 Years",
            "Selenium",
            "Winium",
            "SDLC"
        ],
        "summary": "A 6-month Software Testing Intern role at Breeze Brain Technologies involves testing web and Windows applications using Selenium and Winium, supporting QA processes, and collaborating with developers to ensure software quality."
    },
    {
        "job_title": "Support & Implementation Engineer",
        "company": "Kameda Infologics (P) Ltd",
        "url": "https://technopark.org/job-details/27730",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Kameda Infologics (P) Ltd</strong></p>\n<p><strong>2nd Floor, Amstor House, Technopark Campus, Trivandrum, Kerala, 695581</strong>\n<strong>Website:</strong> <a href=\"http://www.kamedainfologics.com\">http://www.kamedainfologics.com</a></p>\n<p><strong>Job Title:</strong> Support &amp; Implementation Engineer\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> preeyanka@kamedainfologics.com</p>\n<h3>About Us</h3>\n<p>At Kameda Infologics, we are a passionate team of technology and healthcare enthusiasts applying cutting-edge technology to solve real-world, multi-dimensional healthcare problems. We drive digital transformation to meet our clients’ needs by building innovative solutions.</p>\n<h3>Role Overview</h3>\n<p>As a <strong>Support &amp; Implementation Engineer</strong>, you will work with a unique team of clinical and technical experts, developing exciting products for our customers and collaborating with cross-functional teams. You will play a key role in assisting with technical design concepts, troubleshooting, and ensuring features and performance meet the highest quality standards.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Interact with Project Managers and external customers to plan, implement, and support projects.</li>\n<li>Participate in product installations and updates, remotely or via WebEx, with customers.</li>\n<li>Maintain accurate records of installations and updates in CRM.</li>\n<li>Collaborate with Project Managers and Solution Consultants in internal and client meetings.</li>\n<li>Troubleshoot products with the Help Desk and provide timely resolutions.</li>\n<li>Prepare documentation to support product development and implementation.</li>\n<li>Act as a client advocate by identifying opportunities for product and process improvements.</li>\n<li>Stay updated with technical knowledge related to our products.</li>\n<li>Resolve SQL database issues in client environments.</li>\n<li>Assist with HL7 integrations, APIs, Mirth configurations, and related healthcare interoperability requirements.</li>\n<li>Provide support on network-related issues (added advantage).</li>\n<li>Deliver technical training and support to end users as required.</li>\n<li>Ensure professional interactions with internal and external stakeholders, maintaining client satisfaction.</li>\n<li>Work during weekends or nights as required during project go-live phases.</li>\n<li>Be open to travel for client engagements.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>3–6 years</strong> of experience in HMIS/HIS application support.</li>\n<li>Strong knowledge of <strong>SQL</strong>, <strong>HL7</strong>, <strong>APIs</strong>, <strong>Mirth</strong>, and related configurations.</li>\n<li>Familiarity with computer hardware, networking components, and system configurations (added advantage).</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong problem-solving ability with patience and customer-centric approach.</li>\n<li>Experience in a technical support or implementation environment.</li>\n</ul>",
        "tags": [
            "3–6 Years",
            "SQL",
            "HL7",
            "APIs"
        ],
        "summary": "Support & Implementation Engineer at Kameda Infologics provides technical support, troubleshoots issues, and ensures client satisfaction using SQL, HL7, and APIs in healthcare solutions."
    },
    {
        "job_title": "Flutter Developer",
        "company": "Zl Software Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27729",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>ZL Software Systems (P) Ltd</h2>\n<p><strong>Location:</strong> C-22, 2nd Floor, Thejaswini Building, Phase-1 Campus, Technopark, Trivandrum, Kerala, India 695581\n<strong>Website:</strong> <a href=\"https://www.zlinkcorp.com\">https://www.zlinkcorp.com</a>\n<strong>Closing Date:</strong> 31, Mar 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careerstvm@zlinkcorp.com\">careerstvm@zlinkcorp.com</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a highly skilled <strong>Flutter Developer</strong> with 3-5 years of experience to develop high-quality mobile applications for Android and iOS platforms using Flutter.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop advanced applications for the Flutter platform</li>\n<li>Collaborate with cross-functional teams to define, design, and ship new features</li>\n<li>Ensure application performance, quality, and responsiveness</li>\n<li>Identify and resolve bottlenecks and fix bugs</li>\n<li>Maintain code quality, organization, and automation</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience as a Flutter Developer (iOS and Android platforms)</li>\n<li>Strong proficiency in Dart programming language</li>\n<li>Experience with third-party libraries and APIs</li>\n<li>Knowledge of mobile application architecture, design patterns, and best practices</li>\n<li>Familiarity with RESTful APIs for backend integration</li>\n<li>Understanding of Agile development lifecycle and teamwork with designers and backend developers</li>\n<li>Excellent problem-solving skills and ability to work independently or in a team</li>\n<li>Strong attention to detail and passion for high-quality work</li>\n<li>Willingness to learn and adopt latest industry trends and technologies</li>\n</ul>\n<h3>Preferred Qualification</h3>\n<ul>\n<li>Degree/Diploma in CSE or equivalent</li>\n<li>3-5 Years of experience</li>\n</ul>",
        "tags": [
            "3-5 Years",
            "Flutter",
            "Dart",
            "RESTful APIs"
        ],
        "summary": "Flutter Developer with 3-5 years experience required to build cross-platform mobile apps using Dart and Flutter frameworks."
    },
    {
        "job_title": "Software Test Engineer",
        "company": "Kameda Infologics (P) Ltd",
        "url": "https://technopark.org/job-details/27728",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company Overview</h2>\n<p>At <strong>Kameda Infologics (P) Ltd</strong>, we are a passionate team of technology and healthcare enthusiasts dedicated to applying cutting-edge solutions to address complex healthcare challenges. Our mission is to drive digital transformation tailored to client needs.</p>\n<h2>Job Details</h2>\n<p><strong>Position</strong>: Software Test Engineer\n<strong>Location</strong>: 2nd Floor, Amstor House, Technopark Campus, Trivandrum, Kerala, 695581\n<strong>Website</strong>: <a href=\"http://www.kamedainfologics.com\">http://www.kamedainfologics.com</a>\n<strong>Closing Date</strong>: 28 Feb 2026\n<strong>Published On</strong>: 16 Feb 2026\n<strong>Contact Email</strong>: preeyanka@kamedainfologics.com</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Evaluate software functions and design test protocols to ensure product reliability.</li>\n<li>Conduct <strong>manual and automated testing</strong> of products.</li>\n<li><strong>Bug reporting, tracking, and closure</strong>.</li>\n<li>Configure hardware and operating environments for testing.</li>\n<li>Provide technical expertise on products, operating systems, and specialized environments.</li>\n<li>Develop and execute <strong>test conditions, test cases</strong>, and automated scripts using <strong>Selenium/Java</strong>.</li>\n<li>Collaborate with test teams and development teams to resolve issues.</li>\n<li>Debug test cases, fix errors, and execute test runs.</li>\n<li>Generate <strong>defect reports</strong>, track progress, and define/export test results.</li>\n<li>Contribute to <strong>testing process improvements</strong>.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li><strong>Education</strong>: B.E/B.Tech/MCA/M.Sc.</li>\n<li><strong>Certification</strong>: Completed a software testing course from a reputable institution (ISTQB certification preferred).</li>\n<li><strong>Experience</strong>: 3–6 years in testing (manual/automation).</li>\n<li><strong>Skills</strong>: Proficiency in testing methodologies, defect reporting, and programming languages.</li>\n<li><strong>Soft Skills</strong>: Highly organized, detail-oriented, and capable of managing multiple tasks in a fast-paced environment.</li>\n</ul>\n<h2>Preferred Attributes</h2>\n<ul>\n<li>Excellent documentation and organizational skills.</li>\n<li>Ability to meet project milestones and demanding deadlines.</li>\n<li>Strong collaboration and problem-solving abilities.</li>\n</ul>",
        "tags": [
            "3-6 Years",
            "Selenium/Java",
            "Manual Testing",
            "Defect Reporting"
        ],
        "summary": "Kameda Infologics seeks a Software Test Engineer to design and execute test protocols, debug software, and collaborate across teams. Requires 3–6 years of testing experience with manual/automated skills."
    },
    {
        "job_title": "Site supervisor",
        "company": "Hyz Ventures Intl (P) Ltd",
        "url": "https://technopark.org/job-details/27727",
        "location": "Technopark",
        "closing_date": "23 Feb 2026",
        "job_description": "<p><strong>Company:</strong> HYZ VENTURES INTL (P) Ltd\n<strong>Address:</strong> GE, GROUND FLOOR, PADMANABHAM, TECHNOPARK, Karyavattom P O, TVPM , 695581\n<strong>Website:</strong> <a href=\"http://www.hyzventures.com\">http://www.hyzventures.com</a>\n<strong>Closing Date:</strong> 23, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> hr@hyzventures.com</p>\n<h3>Brief Description</h3>\n<p>We are a diversified business group managing multiple companies across different domains. We are seeking a responsible and proactive <strong>Site Supervisor</strong> to coordinate operational requirements across our group companies.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Coordinate and supervise day-to-day site operations across multiple company units</li>\n<li>Communicate with different departments and ensure their requirements are fulfilled on time</li>\n<li>Monitor staff activities and ensure smooth workflow</li>\n<li>Maintain proper documentation and daily reports</li>\n<li>Ensure discipline, productivity, and quality standards at each site</li>\n<li>Handle vendor coordination and basic administrative tasks</li>\n<li>Identify operational issues and report to management with solutions</li>\n<li>Ensure compliance with company policies and procedures</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proven experience as a Site Supervisor or similar role (any industry)</li>\n<li>Strong coordination and communication skills</li>\n<li>Ability to handle multiple tasks and work under pressure</li>\n<li>Basic computer knowledge (MS Office, reporting)</li>\n<li>Leadership and problem-solving ability</li>\n<li>Willingness to travel between company units if required</li>\n</ul>\n<h3>Salary</h3>\n<p>₹18,000 – ₹25,000 per month (Based on experience and performance)</p>\n<p><strong>Candidates must use the subject line:</strong> Application for Site Supervisor</p>",
        "tags": [
            "Not Specified",
            "Coordination",
            "Communication",
            "MS Office"
        ],
        "summary": "HYZ Ventures Intl seeks a proactive Site Supervisor to coordinate operations across multiple units, ensuring compliance and productivity. Responsibilities include vendor coordination and daily reporting with a salary range of ₹18,000–₹25,000."
    },
    {
        "job_title": "Software developer Fresher (2025/2026)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27726",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<p><strong>Company:</strong> SMARTHMS &amp; SOLUTIONS (P) Ltd\n<strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a>\n<strong>Job Title:</strong> Software Developer Fresher (2025/2026)\n<strong>Closing Date:</strong> 02, Apr 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking fresh CS graduates/Postgraduates eager to pursue a career in software development with expertise in the Symfony framework.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to continuous codebase improvement.</li>\n<li>Troubleshoot and debug issues promptly.</li>\n<li>Collaborate with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in programming with strong core concepts.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Knowledge of statistical concepts and techniques.</li>\n<li>Excellent communication and presentation skills.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science or a related field.</li>\n<li><strong>Experience:</strong> 0-1 years (freshers preferred).</li>\n<li><strong>Salary Package:</strong> 4-6 LPA.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Symfony",
            "Problem-Solving",
            "Communication"
        ],
        "summary": "Fresh CS graduates sought for software development roles with Symfony framework experience. Responsibilities include coding, debugging, and collaboration."
    },
    {
        "job_title": "Software developer (Entry level)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27725",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581</p>\n<p><strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<p><strong>Job Title:</strong> Software Developer (Entry Level)</p>\n<p><strong>Closing Date:</strong> 02, Apr 2026</p>\n<p><strong>Published Date:</strong> 16, Feb 2026</p>\n<p><strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking fresh CS graduates / Postgraduates who are seeking a career in Software development and are highly eager to learn and work with Symfony framework.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to the continuous improvement of our codebase.</li>\n<li>Troubleshoot and debug issues as they arise.</li>\n<li>Work closely with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with the latest industry trends and technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in programming with a strong grasp of core concepts.</li>\n<li>Problem-Solving Skills: Ability to analyze and solve programming problems.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Strong communication and presentation skills.</li>\n</ul>\n<h3>Qualification</h3>\n<ul>\n<li>Bachelor's degree/Master's degree in Computer Science or related field.</li>\n<li><strong>Experience:</strong> 0-1 years of experience</li>\n<li><strong>Salary Package:</strong> 4-6 LPA</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Symfony Framework",
            "PHP",
            "Code Reviews"
        ],
        "summary": "Entry-level Software Developer role requiring 0-1 years of experience with focus on Symfony framework development and strong problem-solving skills."
    },
    {
        "job_title": "Sr layout Artist",
        "company": "Prayan Animation Studio (P) Ltd",
        "url": "https://technopark.org/job-details/27724",
        "location": "Technopark",
        "closing_date": "25 Feb 2026",
        "job_description": "<p><strong>Prayan Animation Studio (P) Ltd</strong></p>\n<p><strong>Location:</strong> E-12, Tejaswini-1, Technopark, Trivandrum, Kerala, India 695 581\n<strong>Website:</strong> <a href=\"http://www.prayananimation.com\">www.prayananimation.com</a>\n<strong>Closing Date:</strong> 25, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:jobs@prayananimation.com\">jobs@prayananimation.com</a></p>\n<h3>Job Overview</h3>\n<p>We are seeking a talented and experienced <strong>Senior Layout Artist</strong> with <strong>3 to 5 years of experience</strong> in visual design. The ideal candidate will create visually compelling layouts for animation, video games, or other media projects, ensuring alignment with the artistic vision and technical requirements.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Scene Composition &amp; Design:</strong> Develop detailed layouts with strong perspective, depth, and proportion.</li>\n<li><strong>Collaboration:</strong> Work with art directors, animators, and production teams to meet creative and technical goals.</li>\n<li><strong>Creative Problem-Solving:</strong> Innovate solutions to design challenges while maintaining visual integrity.</li>\n<li><strong>Consistency:</strong> Ensure uniformity in visual style across all layouts.</li>\n<li><strong>Feedback Integration:</strong> Revise designs based on input from directors and senior artists.</li>\n<li><strong>Technical Proficiency:</strong> Master industry-standard tools like Adobe Photoshop/Illustrator.</li>\n<li><strong>Attention to Detail:</strong> Create immersive environments with meticulous background elements and character placements.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> 3 to 5 years as a Layout Artist with a strong portfolio.</li>\n<li><strong>Software Skills:</strong> Advanced proficiency in Adobe Photoshop, Illustrator, or similar tools.</li>\n<li><strong>Design Principles:</strong> Strong grasp of perspective, balance, contrast, and visual storytelling.</li>\n<li><strong>Creativity:</strong> Ability to innovate while maintaining project aesthetics.</li>\n<li><strong>Communication:</strong> Excellent teamwork and cross-functional collaboration skills.</li>\n<li><strong>Relocation:</strong> Must be able to commute or relocate to Trivandrum, Kerala.</li>\n</ul>\n<h3>Job Type &amp; Schedule</h3>\n<ul>\n<li><strong>Type:</strong> Full-time</li>\n<li><strong>Shift:</strong> Day shift</li>\n<li><strong>Start Date:</strong> Immediate joining</li>\n</ul>\n<h3>How to Apply</h3>\n<ul>\n<li>Submit your <strong>resume</strong> and a <strong>portfolio link</strong> to <a href=\"mailto:jobs@prayananimation.com\">jobs@prayananimation.com</a></li>\n<li><strong>Subject Line:</strong> Resume – “Layout Artist”</li>\n</ul>",
        "tags": [
            "3 to 5 Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Perspective Design"
        ],
        "summary": "Senior Layout Artist needed for 3-5 years of experience in visual design, scene composition, and collaboration with creative teams using Adobe tools."
    },
    {
        "job_title": "IT Sales Executive",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/27723",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>About the Company</h2>\n<p>QWY Software (P) Ltd, located at Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581, specializes in IT/ITES covering E-com, Logistics, and Hyperlocal Delivery Services.</p>\n<h2>Job Description</h2>\n<p>We are seeking a <strong>dynamic and motivated IT Sales Executive</strong> to join our team. The ideal candidate will have <strong>strong communication skills</strong> and <strong>at least 1 year of experience in IT sales</strong>.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Identify and generate new business opportunities in the IT sector</li>\n<li>Understand client requirements and offer suitable IT solutions</li>\n<li>Maintain strong relationships with clients</li>\n<li>Achieve monthly and quarterly sales targets</li>\n<li>Prepare proposals, presentations, and sales reports</li>\n<li>Coordinate with internal teams for smooth project execution</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>MBA (Marketing/IT/Business) or any Degree (Mandatory)</li>\n<li>Minimum 1 year experience in IT Sales</li>\n<li>Excellent communication and negotiation skills</li>\n<li>Good understanding of IT products and services</li>\n<li>Strong interpersonal skills</li>\n<li>Target-oriented and self-motivated</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates should share their CV to <strong>careers@qwysoft.com</strong> with the subject line <strong>\"IT Sales\"</strong>.</p>\n<h3>Job Details</h3>\n<ul>\n<li><strong>Closing Date</strong>: 28, Feb 2026</li>\n<li><strong>Published Date</strong>: 16, Feb 2026</li>\n</ul>",
        "tags": [
            "1 Year",
            "IT Sales",
            "Communication",
            "Negotiation"
        ],
        "summary": "Dynamic IT Sales Executive with 1+ year experience to generate business opportunities, build client relationships, and achieve sales targets."
    },
    {
        "job_title": "Junior System Administrator -  Linux (Freshers)",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27722",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Location:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a>\n<strong>Closing Date:</strong> 02, Apr 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Junior Linux System Administrator</strong> to support and maintain Linux-based infrastructure and assist in implementing security controls. This role is ideal for someone eager to build a strong foundation in system administration, infrastructure operations, and security best practices.</p>\n<h3>Key Responsibilities</h3>\n<h4>Infrastructure Support</h4>\n<ul>\n<li>Assist in maintaining and monitoring Linux-based servers</li>\n<li>Support on-premise and cloud infrastructure (basic exposure)</li>\n<li>Monitor server health, disk usage, CPU, memory, and uptime</li>\n<li>Assist with application deployment, configuration, and backups</li>\n<li>Perform basic troubleshooting for server and infrastructure issues</li>\n<li>Maintain infrastructure documentation and system records</li>\n</ul>\n<h4>Network &amp; Systems</h4>\n<ul>\n<li>Support networking fundamentals including IP addressing, DNS, and firewalls</li>\n<li>Assist in managing SSL certificates, VPN access, and basic network security</li>\n<li>Coordinate with senior engineers for system upgrades and changes</li>\n</ul>\n<h4>Security Responsibilities</h4>\n<ul>\n<li>Assist in implementing system hardening and security best practices</li>\n<li>Monitor system logs and alerts for potential security issues</li>\n<li>Support patching and vulnerability remediation</li>\n<li>Assist in managing user access, roles, and permissions</li>\n<li>Help with backup verification and disaster recovery activities</li>\n</ul>\n<h4>Compliance &amp; Best Practices</h4>\n<ul>\n<li>Follow defined security policies and operational procedures</li>\n<li>Support internal and external audits when required</li>\n<li>Ensure systems adhere to security and compliance guidelines</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Basic to intermediate knowledge of Linux operating systems</li>\n<li>Understanding of server concepts and system services</li>\n<li>Basic knowledge of networking fundamentals (IP, DNS, ports, firewalls)</li>\n<li>Awareness of information security fundamentals</li>\n<li>Good problem-solving and troubleshooting skills</li>\n<li>Willingness to learn and adapt in a production environment</li>\n</ul>\n<h3>Work Flexibility &amp; Support Requirements</h3>\n<ul>\n<li>Willingness to provide off-day, after-hours, or on-call support when required</li>\n<li>Ability to respond to critical incidents and system outages</li>\n<li>Flexible mindset to support infrastructure operations in a 24×7 environment (rotational / need-based)</li>\n</ul>\n<h3>Preferred Certifications (Not Mandatory)</h3>\n<ul>\n<li>RHCSA / RHCE</li>\n<li>CCNA (Basic networking knowledge)</li>\n<li>AWS / Azure Fundamentals</li>\n</ul>\n<h3>Experience</h3>\n<p><strong>0–2 years</strong> of experience in Infrastructure, Linux Administration, or Security</p>\n<h3>Compensation</h3>\n<p><strong>4-6 LPA</strong>\n<strong>Work Location:</strong> Trivandrum</p>\n<h3>Career Growth Opportunity</h3>\n<ul>\n<li>Opportunity to grow into DevOps, Cloud, or Security roles based on interest and performance</li>\n<li>Exposure to real-world production environments and enterprise systems</li>\n<li>Continuous learning through hands-on experience and mentorship</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Hands-on experience with Linux production servers</li>\n<li>Structured learning and mentorship</li>\n<li>Stable and security-focused working environment</li>\n<li>Clear technical growth path</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Linux",
            "Networking",
            "Cloud Infrastructure"
        ],
        "summary": "Junior Linux System Administrator role focusing on infrastructure support, security, and compliance. Ideal for freshers seeking hands-on experience in Linux environments with growth opportunities in DevOps, Cloud, or Security."
    },
    {
        "job_title": "Technical Sales Specialist | 0-5yrs",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27721",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<h3>Technical Sales Specialist | 0-5 Years</h3>\n<p><strong>Closing Date:</strong> 02, Apr 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<p><strong>Job Type:</strong> Full-Time | On-Site\n<strong>Experience Required:</strong> 0-5 years\n<strong>Language Requirement:</strong> Fluent in English</p>\n<h3>Job Summary:</h3>\n<p>We are seeking a <strong>Technical Sales &amp; Marketing Specialist</strong> to drive sales and marketing initiatives for our Hospital Management Software (HMS) solutions. The ideal candidate will expand our healthcare domain reach, demonstrate strong presentation skills, and fluency in Hindi to engage a diverse client base.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and execute strategic sales plans to meet targets and accelerate growth in healthcare software.</li>\n<li>Identify and engage new prospects (hospitals, clinics, diagnostic centers, healthcare networks).</li>\n<li>Maintain client relationships by understanding operational needs and offering tailored HMS solutions.</li>\n<li>Design integrated marketing campaigns aligned with company GTM strategy.</li>\n<li>Conduct market research and competitor analysis to adapt to healthcare market needs.</li>\n<li>Create marketing content (brochures, case studies, presentations) with brand consistency.</li>\n<li>Collaborate with product, sales, and support teams to align messaging and improve engagement.</li>\n<li>Analyze campaign performance and ROI for data-driven improvements.</li>\n<li>Stay updated on healthcare trends, software innovations, and regulatory guidelines.</li>\n<li>Represent the company at industry events, conferences, and webinars.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Healthcare IT, or related field (MBA preferred).</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li><strong>Fluent in Hindi and English</strong> for client communication in Hindi-speaking regions.</li>\n<li>Familiarity with Hospital Management Systems (HMS), EMR/EHR solutions, or healthcare IT workflows.</li>\n<li>Ability to create effective marketing materials and sales presentations.</li>\n</ul>\n<h3>Additional Preferred Skills:</h3>\n<ul>\n<li>Self-driven, target-oriented.</li>\n<li>Capable of independent work.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Experience in client demos and product presentations.</li>\n<li>Willingness to travel for client meetings, demos, and events.</li>\n</ul>\n<p><strong>Salary Package:</strong> 7-11 LPA</p>",
        "tags": [
            "0-5 Years",
            "Hospital Management Systems (HMS)",
            "Marketing",
            "Sales"
        ],
        "summary": "A Technical Sales Specialist is needed to drive HMS sales and marketing, requiring Hindi fluency and strategic planning skills to expand healthcare software reach."
    },
    {
        "job_title": "AI Solutions Architect / AI Engineer",
        "company": "Cocopalms Tech (P) Ltd",
        "url": "https://technopark.org/job-details/27720",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Cocopalms Tech (P) Ltd</strong></p>\n<p><strong>Location</strong>: Carnival, 6th Floor, 695581\n<strong>Website</strong>: <a href=\"https://cocopalms.io\">https://cocopalms.io</a>\n<strong>Closing Date</strong>: 28, Feb 2026\n<strong>Published Date</strong>: 16, Feb 2026\n<strong>Contact Email</strong>: aiswarya@cocopalms.io</p>\n<h3>About Cocopalms Tech</h3>\n<p>Cocopalms Tech is a software product company building next-generation AI-enabled business solutions under the <strong>BizoSuite ecosystem</strong>, including ERP, accounting, meal prep management, CRM, and property management systems. We are transforming traditional business operations using intelligent automation and data-driven insights.</p>\n<h3>Role Overview</h3>\n<p>We are seeking an experienced <strong>AI Solutions Architect / AI Engineer</strong> to lead the design and implementation of AI capabilities across all our applications. This role is responsible for defining AI architecture, integrating AI services (LLMs, ML models, predictive analytics), and building scalable AI solutions that enhance business intelligence, automation, and customer experience across the BizoSuite ecosystem.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>AI Architecture &amp; Strategy</strong>\n- Design company-wide AI architecture for all products.\n- Define reusable AI services and APIs across applications.\n- Establish AI integration standards and best practices.\n- Align AI strategy with business objectives and product vision.</p>\n<p><strong>AI Integration &amp; Development</strong>\n- Integrate AI services such as OpenAI, Gemini, or local LLMs.\n- Design AI-driven dashboards (predictions, insights, anomaly detection).\n- Develop AI modules across domains: customer retention, sales forecasting, promotion analytics, meal recommendation intelligence.\n- Implement AI-powered insights and automation.</p>\n<p><strong>Machine Learning &amp; Data Intelligence</strong>\n- Design ML pipelines using structured business data.\n- Develop predictive models for retention, demand forecasting, customer segmentation, pricing analysis.\n- Work with analytics and reporting systems.</p>\n<p><strong>AI Platform Engineering</strong>\n- Build centralized AI services for multi-app use.\n- Design secure APIs between AI services and backend systems.\n- Ensure scalability for multi-tenant SaaS environments.\n- Optimize AI performance and cost.</p>\n<p><strong>Security &amp; Governance</strong>\n- Ensure data privacy and secure AI usage.\n- Design AI workflows for on-prem enterprise deployments.\n- Implement responsible AI practices and auditability.</p>\n<p><strong>Cross-Team Collaboration</strong>\n- Collaborate with product managers, developers, and leadership.\n- Mentor teams on AI integration.\n- Translate business problems into AI solutions.</p>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, AI, ML, Data Science, or related field.</li>\n<li>Master’s in AI/ML/CS preferred; industry experience may substitute.</li>\n<li>Relevant AI cloud certifications (Azure AI Engineer, AWS AI/ML, Google Vertex AI) are highly desirable.</li>\n</ul>\n<h3>What Makes This Role Unique</h3>\n<p>You will architect AI for an <strong>entire product ecosystem</strong> impacting:\n- Finance &amp; ERP\n- Meal Prep Automation\n- Customer Management\n- Real Estate &amp; Operations</p>\n<p>This is a <strong>company-wide AI leadership position</strong>, not a single-project role.</p>\n<h3>Preferred Skills</h3>\n<p><strong>Technical Skills</strong>\n- AI/ML architecture expertise.\n- LLM integration (OpenAI, Gemini).\n- Python (ML pipelines), Node.js, REST APIs/microservices.\n- Vector databases (pgvector, Qdrant), RDBMS (PostgreSQL), NoSQL (MongoDB), embeddings/RAG.</p>\n<p><strong>Machine Learning</strong>\n- XGBoost/LightGBM, forecasting models (Prophet, ARIMA), recommendation systems.\n- Model evaluation and deployment.</p>\n<p><strong>Architecture &amp; Systems</strong>\n- Cloud/on-prem deployment, distributed systems, scalable architecture, API-first design.</p>\n<p><strong>Soft Skills</strong>\n- Product-oriented thinking, problem-solving, cross-functional communication, leadership/mentorship.</p>\n<h3>Nice to Have</h3>\n<ul>\n<li>SaaS ERP/business automation experience.</li>\n<li>F&amp;B/meal prep/subscription-based business experience.</li>\n<li>DevOps knowledge (Docker, Kubernetes).</li>\n<li>AI dashboard development.</li>\n</ul>\n<h3>Success Metrics (KPIs)</h3>\n<ul>\n<li>AI features delivered across products.</li>\n<li>Churn reduction via predictive AI.</li>\n<li>AI adoption in BizoSuite modules.</li>\n<li>Prediction accuracy and business impact via AI insights.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Python",
            "OpenAI",
            "Node.js"
        ],
        "summary": "Lead AI architecture and integration for BizoSuite ecosystem, developing scalable solutions in ERP, CRM, and automation. Requires ML, LLM expertise, and cross-team collaboration to drive business intelligence."
    },
    {
        "job_title": "Lead - Data Scientist/Data Analyst",
        "company": "Magpii Innovations Private Limited",
        "url": "https://technopark.org/job-details/27719",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>Magpii Innovations Private Limited</h2>\n<p><strong>Address:</strong> 2nd FLOOR, M SQUARED BUILDING, TECHNOPARK CAMPUS, KARYAVATTOM, TRIVANDRUM, KERALA - 695581\n<strong>Website:</strong> <a href=\"http://www.magpiitech.com\">http://www.magpiitech.com</a></p>\n<h3>Lead - Data Scientist/Data Analyst</h3>\n<p><strong>Closing Date:</strong> 31, Mar 2026\n<strong>Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@magpiitech.com\">careers@magpiitech.com</a></p>\n<h4>Brief Description</h4>\n<p>Lead- Data Scientist/Data Analyst\n<strong>Location:</strong> Magpii Innovations, Technopark, Trivandrum\n<strong>Experience:</strong> 8+ Years\n<strong>Role Type:</strong> Full-Time</p>\n<h4>The Role</h4>\n<p>We are seeking a seasoned Lead- Data Scientist / Data Analyst with a minimum of 8 years of experience to lead our data intelligence initiatives. You will be responsible for transforming massive volumes of operational (OT) and enterprise (IT) data into actionable strategic insights. This role requires a blend of deep statistical expertise, industrial domain knowledge, AI and ML knowledge, and the ability to communicate findings to C-suite stakeholders.</p>\n<h4>Key Responsibilities</h4>\n<ul>\n<li><strong>Operational Intelligence:</strong> Develop predictive models for industrial use cases, including Predictive Maintenance (PdM), Remaining Useful Life (RUL) estimation, and anomaly detection in heavy machinery.</li>\n<li><strong>Enterprise Analytics:</strong> Analyze complex enterprise datasets (ERP, CRM, Supply Chain) to optimize business processes, financial forecasting, and resource allocation.</li>\n<li><strong>Agentic Data Frameworks:</strong> Collaborate with the AI team to build \"Reason + Act\" loops where data insights trigger autonomous agentic workflows.</li>\n<li><strong>Architecture Design:</strong> Lead the design of scalable data pipelines and \"Single Source of Truth\" architectures for multi-national industrial holding companies.</li>\n<li><strong>Stakeholder Management:</strong> Translate complex data science concepts into clear, value-driven narratives for executive leadership and clients.</li>\n<li><strong>Mentorship:</strong> Guide junior analysts and engineers in best practices for data cleaning, feature engineering, and model validation.</li>\n</ul>\n<h4>Preferred Skills</h4>\n<ul>\n<li><strong>Advanced Analytics:</strong> Expertise in Python/R, SQL, and statistical modeling.</li>\n<li><strong>Machine Learning:</strong> Strong experience with Scikit-learn, XGBoost, TensorFlow, or PyTorch.</li>\n<li><strong>Generative AI:</strong> Strong knowledge in Generative AI and implementation of Agentic Systems.</li>\n<li><strong>Data Orchestration:</strong> Experience with Airflow, Databricks, or Snowflake for large-scale data engineering.</li>\n<li><strong>Visualization:</strong> Advanced proficiency in PowerBI, Tableau dashboards to create \"Executive Cockpits.\"</li>\n<li><strong>Cloud Platforms:</strong> Deep experience with AWS (SageMaker), Azure (Azure ML), or Google Cloud (Vertex AI).</li>\n</ul>\n<h4>Qualifications &amp; Soft Skills</h4>\n<ul>\n<li><strong>Education:</strong> Bachelor’s or Master’s degree in Computer Science, Data Science, AI, or a related field.</li>\n<li><strong>Experience:</strong> Proven track record of delivering data-driven ROI in Industrial, Energy, or Logistics sectors.</li>\n<li><strong>Communication:</strong> Exceptional English communication skills (written and verbal); ability to present \"The Story\" behind the data.</li>\n<li><strong>Mindset:</strong> A \"Founding Team\" mentality—comfortable with ambiguity and driven by building solutions from the ground up.</li>\n</ul>\n<h4>Good to Have</h4>\n<ul>\n<li>Experience with SQL and cloud data platforms</li>\n<li>Exposure to MLOps or AI deployment workflows</li>\n<li>Experience integrating AI solutions into business applications</li>\n<li>Consulting or enterprise analytics experience</li>\n</ul>\n<h4>Application Instructions</h4>\n<p>If your profile matches our requirement, please share your resume to <a href=\"mailto:careers@magpiitech.com\">careers@magpiitech.com</a>. Include the job title in your email application.</p>",
        "tags": [
            "8+ Years",
            "Python/R",
            "Machine Learning",
            "Generative AI"
        ],
        "summary": "Lead Data Scientist/Analyst with 8+ years experience to drive industrial and enterprise analytics, leveraging AI/ML and agentic systems for strategic insights."
    },
    {
        "job_title": "Technical Sales Specialist | 0-3yrs",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27718",
        "location": "Technopark",
        "closing_date": "02 Apr 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<h3>Technical Sales Specialist | 0-3yrs</h3>\n<p><strong>Closing Date:</strong> April 2, 2026\n<strong>Job Published:</strong> February 16, 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<p><strong>Type:</strong> Full-Time\n<strong>Experience:</strong> 0-5 years\n<strong>Language Requirement:</strong> Fluent in Hindi and English</p>\n<h3>Job Summary:</h3>\n<p>We are seeking a <strong>Technical Sales &amp; Marketing Specialist</strong> to drive sales and marketing initiatives for our <strong>Hospital Management Software (HMS)</strong> solutions. This role is critical for expanding our healthcare domain reach. The ideal candidate must demonstrate strong presentation skills, revenue growth capabilities, and fluency in Hindi for effective communication with a broad client base.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and execute strategic sales plans to meet company targets and accelerate growth in the healthcare software sector.</li>\n<li>Identify and engage new prospects (hospitals, clinics, diagnostic centers, healthcare networks).</li>\n<li>Maintain client relationships by understanding operational needs and offering tailored HMS solutions.</li>\n<li>Design integrated marketing campaigns aligned with the company’s GTM strategy.</li>\n<li>Conduct market research and competitor analysis to adapt to healthcare market needs.</li>\n<li>Create marketing content (brochures, case studies, presentations) while maintaining brand consistency.</li>\n<li>Collaborate with internal teams (product, sales, support) to align messaging and improve customer engagement.</li>\n<li>Analyze campaign performance, ROI, and make data-driven decisions.</li>\n<li>Stay updated on healthcare trends, software innovations, and regulatory guidelines.</li>\n<li>Represent the company at industry events, conferences, and webinars.</li>\n</ul>\n<h3>Required Qualifications &amp; Skills:</h3>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Healthcare IT, or related field (MBA preferred).</li>\n<li>Strong communication, presentation, and negotiation skills.</li>\n<li><strong>Fluent in Hindi and English</strong> (must communicate confidently in Hindi-speaking regions).</li>\n<li>Familiarity with <strong>Hospital Management Systems (HMS)</strong>, <strong>EMR/EHR solutions</strong>, or healthcare IT workflows.</li>\n<li>Ability to create effective marketing materials and sales presentations.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Self-driven, target-oriented</li>\n<li>Capable of independent work</li>\n<li>Strong analytical and problem-solving skills</li>\n<li>Experience in client demos and product presentations</li>\n<li>Willingness to travel for client meetings, demos, and events</li>\n</ul>\n<p><strong>Salary Package:</strong> 7-11 LPA</p>",
        "tags": [
            "0-3 Years",
            "Hospital Management Systems (HMS)",
            "EMR/EHR Solutions",
            "Healthcare IT"
        ],
        "summary": "Seeking a Technical Sales Specialist with 0-3 years of experience to drive sales and marketing for Hospital Management Software solutions, requiring fluency in Hindi and English."
    },
    {
        "job_title": "Lead MERN Stack Developer Closing Date:17,Feb 2026",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27717",
        "location": "Technopark",
        "closing_date": "22 Feb 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</strong>\n<a href=\"https://softnotions.com\">Visit Website</a></p>\n<p><strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Lead MERN Stack Developer</h3>\n<p><strong>Closing Date:</strong> 22, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026</p>\n<h4>Brief Description</h4>\n<p>We are seeking a <strong>Lead MERN Stack Developer</strong> with hands-on expertise in MongoDB, Express.js, React.js, and Node.js. The role requires technical leadership, architecture decisions, and team mentoring to deliver high-performance web applications.</p>\n<h4>Key Roles &amp; Responsibilities</h4>\n<ul>\n<li>Lead design, development, and delivery of scalable MERN stack applications.</li>\n<li>Define architecture, coding standards, and best practices.</li>\n<li>Review code, enforce quality standards, and optimize performance.</li>\n<li>Mentor junior/mid-level developers.</li>\n<li>Design RESTful APIs, backend services, and secure authentication systems.</li>\n<li>Develop responsive UI components using React.js, Hooks, Redux, and Context API.</li>\n<li>Translate wireframes/UI/UX designs into functional interfaces.</li>\n<li>Design MongoDB schemas, optimize queries, and ensure data integrity.</li>\n<li>Use Git and Agile/Scrum methodologies.</li>\n<li>Collaborate with product managers, designers, QA, and stakeholders.</li>\n<li>Handle deployment, production releases, and post-release support.</li>\n<li>Ensure scalability, availability, and monitoring readiness.</li>\n<li>Act as a technical owner for MERN-based applications.</li>\n<li>Balance hands-on coding with team leadership.</li>\n<li>Drive innovation and continuous improvement.</li>\n</ul>\n<h4>Preferred Skills</h4>\n<p><strong>Core MERN Skills:</strong>\n- JavaScript (ES6+), TypeScript\n- Node.js, Express.js\n- React.js, Next.js (SSR/SSG)\n- Hooks, Redux, Context API\n- MongoDB, Mongoose\n- REST APIs &amp; API testing (Postman)\n- HTML5, CSS3, Responsive Design\n- UI state management, component lifecycle\n- Node.js debugging, performance tuning\n- Authentication/authorization practices\n- Asynchronous programming (Promises, async/await)</p>\n<p><strong>Tools &amp; Methodologies:</strong>\n- Git, Jira\n- Agile/Scrum development\n- Unit/integration testing</p>\n<p><strong>Leadership &amp; Soft Skills:</strong>\n- Problem-solving, decision-making\n- Managing ambiguity and complex requirements\n- Stakeholder communication\n- Team leadership and delivery timelines\n- Business-oriented mindset</p>\n<h4>Good to Have</h4>\n<ul>\n<li>Cloud deployment (AWS/Azure/GCP)</li>\n<li>AI/ML awareness (ChatGPT)</li>\n<li>Performance testing/optimization</li>\n<li>CI/CD pipelines</li>\n</ul>\n<h4>Qualifications</h4>\n<ul>\n<li>B.Tech/BCA/M.Tech/MCA or equivalent</li>\n<li><strong>6+ years</strong> of MERN stack experience</li>\n<li>Prior lead/senior developer experience preferred</li>\n</ul>",
        "tags": [
            "6+ Years",
            "MERN Stack",
            "MongoDB",
            "Node.js"
        ],
        "summary": "Lead MERN Stack Developer with 6+ years experience leading full-stack development, mentoring teams, and delivering scalable, secure web applications using MongoDB, Express, React, and Node.js."
    },
    {
        "job_title": "Sr.Wordpress Developer",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27716",
        "location": "Technopark",
        "closing_date": "22 Feb 2026",
        "job_description": "<p><strong>Softnotions Technologies (P) Ltd</strong></p>\n<p><strong>Location:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</p>\n<p><strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a></p>\n<p><strong>Position:</strong> Sr. WordPress Developer</p>\n<p><strong>Closing Date:</strong> 22, Feb 2026</p>\n<p><strong>Published Date:</strong> 16, Feb 2026</p>\n<p><strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a skilled WordPress Developer to independently manage maintenance, enhancements, and new feature development across multiple WordPress websites. The role requires deep expertise in WordPress internals, Gutenberg, theme/child theme architecture, custom plugin development, WordPress APIs, and performance/SEO best practices.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<p><strong>WordPress Development &amp; Maintenance</strong>\n- Maintain, enhance, and troubleshoot existing WordPress websites.\n- Develop custom WordPress themes and child themes based on design requirements.\n- Customize and extend Gutenberg blocks and block-based themes.\n- Build and maintain custom WordPress plugins for business-specific functionality.\n- Handle WordPress core, plugin, and theme updates safely.</p>\n<p><strong>Core WordPress &amp; APIs</strong>\n- Work with WordPress Hooks (Actions &amp; Filters) to extend functionality.\n- Develop and consume WordPress REST APIs for integrations.\n- Implement custom post types, taxonomies, and meta fields.\n- Ensure compatibility with WordPress coding standards and best practices.</p>\n<p><strong>Performance, Security &amp; SEO</strong>\n- Optimize website performance (caching, asset optimization, query optimization).\n- Implement WordPress security best practices (nonces, sanitization, escaping).\n- Support SEO using tools like Yoast or RankMath.\n- Ensure SEO structure: metadata, schema, URLs, performance, and mobile friendliness.</p>\n<p><strong>Collaboration &amp; Quality</strong>\n- Collaborate with designers, backend teams, and stakeholders.\n- Debug and analyze production issues.\n- Maintain clean, documented, and version-controlled code (Git).</p>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Strong hands-on experience with WordPress core development.</li>\n<li>Deep understanding of Gutenberg editor, themes/child themes, custom plugins, and WordPress hooks/APIs.</li>\n<li>Proficiency in PHP, HTML5, CSS3, JavaScript.</li>\n<li>Experience with page builders (Elementor/WPBakery) and extending/optimizing them.</li>\n<li>Solid MySQL and WordPress database knowledge.</li>\n<li>SEO plugin and on-page optimization experience.</li>\n<li>Performance optimization and caching techniques.</li>\n<li>Git/version control expertise.</li>\n<li>Gutenberg custom block development (ACF blocks or native).</li>\n<li>WooCommerce customization.</li>\n<li>Headless WordPress or REST-based integrations.</li>\n<li>Hosting environment experience (cPanel, Cloud, CDN, staging).</li>\n</ul>\n<h3><strong>Experience &amp; Qualification</strong></h3>\n<ul>\n<li>4+ years of real-world WordPress development experience.</li>\n<li>Proven experience maintaining and extending live WordPress websites.</li>\n<li>Degree in Computer Science/IT or equivalent practical experience.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "WordPress",
            "PHP",
            "Git"
        ],
        "summary": "Softnotions Technologies seeks a WordPress Developer with 4+ years of experience in custom theme/plugin development, Gutenberg, and SEO optimization. Requires collaboration with teams and expertise in PHP, Git, and WordPress APIs."
    },
    {
        "job_title": "Business Associate -Inside Sales",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27715",
        "location": "Technopark",
        "closing_date": "22 Feb 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Address:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Job Title: Business Associate - Inside Sales</h3>\n<p><strong>Closing Date:</strong> 22, Feb 2026\n<strong>Job Published:</strong> 16, Feb 2026</p>\n<h3>Job Description</h3>\n<p>Softnotions Technologies is seeking energetic, tech-savvy individuals passionate about business growth and international sales. As part of the Revenue Operations Team, the role involves identifying global business opportunities, building a strong lead pipeline, and supporting the sales cycle end-to-end. The position offers hands-on exposure to international markets (US, Europe, Middle East) and practical experience in prospecting, CRM management, client communication, and sales coordination.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct market research and identify potential international clients in targeted verticals (US, Europe, Middle East, etc.)</li>\n<li>Generate qualified leads through outbound email campaigns, LinkedIn prospecting, and cold calls</li>\n<li>Build and maintain a strong prospect pipeline in the CRM system</li>\n<li>Understand Softnotions' service offerings and communicate value propositions to potential clients</li>\n<li>Schedule and coordinate meetings or demos for the Business Development Manager or Technical Sales Team</li>\n<li>Support RFP/RFI processes with background data and initial documentation</li>\n<li>Maintain reports and dashboards to track outreach and conversion metrics</li>\n<li>Collaborate with marketing and delivery teams to align messaging and client approach</li>\n<li>Assist in proposal follow-ups, nurturing leads, and handling basic client queries</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Strong communication skills</strong> – written and verbal (English proficiency is a must)</li>\n<li>Good understanding of technology trends, software development, and digital transformation concepts</li>\n<li>Basic knowledge of CRM tools (HubSpot, Zoho, or equivalent) – desirable</li>\n<li>Ability to work with international time zones and cultures</li>\n<li>High attention to detail, responsiveness, and follow-through</li>\n<li>Positive attitude, growth mindset, and eagerness to learn</li>\n<li><strong>Educational Qualification:</strong> BSC/BTech (CS) + MBA (Mkg)</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "CRM Tools (HubSpot, Zoho)",
            "International Sales",
            "Technology Trends"
        ],
        "summary": "Business Associate - Inside Sales role focused on international market expansion, CRM management, and client acquisition. Requires strong communication, tech-savvy approach, and collaboration with cross-functional teams."
    },
    {
        "job_title": "LINUX SYSTEM ADMINISTRATOR",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27714",
        "location": "Technopark",
        "closing_date": "22 Feb 2026",
        "job_description": "<p><strong>Softnotions Technologies (P) Ltd</strong></p>\n<p><strong>Address</strong>: Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website</strong>: <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Job Title</strong>: LINUX SYSTEM ADMINISTRATOR\n<strong>Closing Date</strong>: 22, Feb 2026\n<strong>Published Date</strong>: 16, Feb 2026\n<strong>Contact Email</strong>: recruitment@softnotions.com</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Proficiency in Linux, Windows 2008/2012, Windows 8/10, and Apple Macintosh OS</li>\n<li>Network management: DNS, WINS, DHCP, TCP/IP, RIP v1/2, IGRP, EIGRP, OSPF, routing, web traffic management (Iptables, Squid, URL filtering), LAN design, WiFi access</li>\n<li>Web CMS hosting, troubleshooting, and security patching</li>\n<li>Database administration (MySQL, SQL Server)</li>\n<li>Web server administration (Apache, IIS); Nginx configuration preferred</li>\n<li>Virtualization, cloud server administration, and clustering</li>\n<li>Version control (Git, Subversion)</li>\n<li>Email server configuration and troubleshooting</li>\n<li>Hardware/software issue resolution and technical support</li>\n<li>Office network data security</li>\n<li>Continuous Integration server management</li>\n<li>Server security hardening (Deny Hosts, CMS updates, patches)</li>\n<li>Asset tracking and system/process upgrades for functionality/security</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>4+ years in Linux administration</li>\n<li>Experience configuring Apache, Nginx, Apache-Tomcat</li>\n<li>Database administration expertise</li>\n<li>Cloud server management</li>\n<li>Server security hardening and configuration/optimization</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Linux",
            "Web Servers (Apache/Nginx)",
            "Cloud Server Management"
        ],
        "summary": "Linux System Administrator role requiring 4+ years of experience in Linux, web server management, and cloud technologies. Responsibilities include network administration, security hardening, and system optimization."
    },
    {
        "job_title": "Senior Digital Marketing Specialist -Immediate joinees prefered",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27713",
        "location": "Technopark",
        "closing_date": "19 Feb 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Senior Digital Marketing Specialist</strong></p>\n<p><strong>Location:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Closing Date:</strong> 19, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Senior Digital Marketing Specialist</strong> with <strong>6+ years of IT experience</strong> in digital marketing. Immediate joiners (within 15 days) are preferred.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Develop and implement digital marketing strategies across SEO, PPC, email marketing, social media, content marketing, and LinkedIn automation.</li>\n<li>Follow best practices for social media marketing on platforms like Facebook, Instagram, LinkedIn, etc.</li>\n<li>Launch optimized online advertisements to enhance brand awareness.</li>\n<li>Create and manage link-building and content marketing strategies.</li>\n<li>Measure ROIs and KPIs for campaign effectiveness.</li>\n<li>Plan and execute social media strategies to drive traffic and engagement.</li>\n<li>Stay updated on industry trends, emerging technologies, and algorithm changes.</li>\n<li>Monitor online reputation through proactive social media and review platform engagement.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>MBA in Marketing or a Diploma in Digital Marketing (preferred).</li>\n<li>Proven experience in digital marketing, preferably in a similar role.</li>\n<li>Proficiency in tools: Google Analytics, Google Ads, SEO tools, email marketing platforms, and social media management tools.</li>\n<li>Strong analytical skills for data-driven decision-making.</li>\n<li>Expertise in PPC campaign management (keyword research, bid management, performance tracking).</li>\n<li>Up-to-date knowledge of SEO best practices and search engine algorithms.</li>\n<li>Excellent communication skills for creating persuasive content.</li>\n<li>Self-motivated with a proactive approach to problem-solving and learning.</li>\n</ul>\n<h3>Experience</h3>\n<p>6+ years of experience required.</p>",
        "tags": [
            "6+ Years",
            "Google Analytics",
            "Google Ads",
            "SEO Tools"
        ],
        "summary": "Senior Digital Marketing Specialist with 6+ years of experience in SEO, PPC, and social media campaigns. Requires expertise in analytics tools and brand strategy."
    },
    {
        "job_title": "Full Stack Developers (Angular/React + Node.js)",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27712",
        "location": "Technopark",
        "closing_date": "21 Feb 2026",
        "job_description": "<p><strong>Company:</strong> iBoson Innovations (P) Ltd\n<strong>Location:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.iboson.io\">www.iboson.io</a>\n<strong>Job Title:</strong> Full Stack Developers (Angular/React + Node.js)\n<strong>Closing Date:</strong> 21, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<h2>About the Role</h2>\n<p>At iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to build next-gen solutions. We are expanding our team and looking for a skilled Node.js Developer to help develop robust, scalable, and high-performance backend systems for our products.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Design, development, and maintenance of both front-end and back-end web applications using Angular and Node.js.</li>\n<li>Develop and integrate RESTful APIs services to support front-end applications and other backend services.</li>\n<li>Optimize application performance, security, and reliability.</li>\n<li>Design and manage databases (PostgreSQL, MySQL, MongoDB, etc.).</li>\n<li>Collaborate with frontend, product, and DevOps teams.</li>\n<li>Write clean, maintainable, and well-tested code.</li>\n<li>Review code and mentor junior engineers.</li>\n<li>Participate in architecture and technical decision-making.</li>\n<li>Troubleshoot and resolve production issues.</li>\n<li>Work closely with UX/UI designers, product managers, and QA teams to deliver outstanding user experiences and ensure project deadlines are met.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>5+ years</strong> of experience in full-stack development with strong proficiency in Angular, Node.js, and JavaScript/TypeScript.</li>\n<li>Strong experience in backend development with Node.js, including building and integrating REST APIs, middleware, and microservices.</li>\n<li>Extensive experience with front-end frameworks like Angular, including component-driven architecture, state management, and UI performance optimization.</li>\n<li>Experience with databases (SQL: MySQL/PostgreSQL), including database design, query optimization, and migrations.</li>\n<li>Expertise in version control systems (Git) with an understanding of Git workflows and branching strategies.</li>\n<li>Strong understanding of software design patterns, microservices architecture, and agile development methodologies (e.g., Scrum, Kanban).</li>\n<li>Ability to write clean, maintainable, and efficient code with a focus on test-driven development (TDD) and continuous integration.</li>\n<li>Experience with front-end optimization techniques (bundling, lazy loading, code splitting, caching).</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Work-life balance with flexible work timings.</li>\n<li>Opportunity to work on challenging, high-impact projects.</li>\n<li>Learning and career growth opportunities.</li>\n<li>Collaborative and engineering-driven culture.</li>\n<li>Be part of a team that thrives on innovation and problem-solving. At iBoson, you’ll work with emerging AR &amp; AI technologies, contribute to impactful projects, and grow in a collaborative and tech-driven environment.</li>\n</ul>\n<p><strong>Apply:</strong> Send your resume to <a href=\"mailto:career@ibosoninnov.com\">career@ibosoninnov.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Angular",
            "Node.js",
            "JavaScript/TypeScript"
        ],
        "summary": "Seeking a Full Stack Developer with Angular and Node.js expertise to build scalable AR/AI solutions. Requires 5+ years of experience in full-stack development."
    },
    {
        "job_title": "Back End Engineer - Node.js",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27711",
        "location": "Technopark",
        "closing_date": "21 Feb 2026",
        "job_description": "<h2>iBoson Innovations (P) Ltd</h2>\n<p><strong>Address:</strong> ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.iboson.io\">http://www.iboson.io</a></p>\n<h3>Back End Engineer - Node.js</h3>\n<p><strong>Closing Date:</strong> 21, Feb 2026\n<strong>Published Date:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<h3>Brief Description</h3>\n<p>At iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to build next-gen solutions. We are expanding our team and looking for a skilled Node.js Developer to help develop robust, scalable, and high-performance backend systems for our products.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable server-side applications using Node.js.</li>\n<li>Develop and integrate RESTful APIs and third-party services.</li>\n<li>Optimize back-end processes for performance, security, and scalability.</li>\n<li>Work closely with front-end developers to integrate user-facing elements.</li>\n<li>Manage and implement database solutions (SQL/NoSQL).</li>\n<li>Debug, troubleshoot, and resolve back-end issues efficiently.</li>\n<li>Follow best practices in code quality, testing, and documentation.</li>\n</ul>\n<h3>Preferred Skills &amp; Requirements:</h3>\n<ul>\n<li><strong>5+ years</strong> of experience in back-end development, with a focus on Node.js.</li>\n<li>Strong understanding of JavaScript, TypeScript, and asynchronous programming.</li>\n<li>Experience in building and managing RESTful APIs and microservices architecture.</li>\n<li>Proficiency in databases (MongoDB, MySQL, or PostgreSQL).</li>\n<li>Strong understanding of OOP (Object-Oriented Programming) Concepts.</li>\n<li>Knowledge of authentication and authorization mechanisms (JWT, OAuth).</li>\n<li>Experience with server-side frameworks like Express.js, Nest.js, or similar.</li>\n<li>Familiarity with cloud platforms (AWS, Google Cloud, or Azure) is a plus.</li>\n<li>Understanding of Agile methodologies and CI/CD pipelines.</li>\n<li>Exposure to AI integrations in back-end applications is an advantage.</li>\n<li>AR technology exposure is a plus.</li>\n</ul>\n<h3>Company Culture</h3>\n<p>Be part of a team that thrives on innovation and problem-solving. At iBoson, you’ll work with emerging AR &amp; AI technologies, contribute to impactful projects, and grow in a collaborative and tech-driven environment.</p>\n<p><strong>Apply Now:</strong> Send your resume to <a href=\"mailto:career@ibosoninnov.com\">career@ibosoninnov.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "RESTful APIs",
            "MongoDB"
        ],
        "summary": "Seeking a Node.js Developer to build scalable backend systems for AR/AI solutions. Requires 5+ years experience with Node.js, RESTful APIs, and databases."
    },
    {
        "job_title": "Software Sales Executive",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27710",
        "location": "Technopark",
        "closing_date": "15 Mar 2026",
        "job_description": "<p><strong>KENLAND IT SOLUTIONS (P) Ltd</strong></p>\n<p><strong>Address:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> <a href=\"https://www.kenland.in\">https://www.kenland.in</a>\n<strong>Closing Date:</strong> 15, Mar 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<h3><strong>Job Description</strong></h3>\n<p>We are seeking a dynamic and results-driven <strong>Software Sales Executive</strong> to join our team. This role involves identifying business opportunities, building strong client relationships, and driving software sales to achieve revenue targets. The ideal candidate will have a strong understanding of software solutions, excellent communication skills, and a proven track record in sales.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Identify and generate new business opportunities through lead generation, networking, and cold calling.</li>\n<li>Understand client needs and recommend suitable software solutions.</li>\n<li>Deliver compelling sales presentations, product demonstrations, and proposals.</li>\n<li>Negotiate contracts and close sales to achieve revenue targets.</li>\n<li>Develop and maintain strong relationships with existing and potential clients.</li>\n<li>Stay updated on industry trends, competitor activities, and market conditions.</li>\n<li>Collaborate with the marketing and product teams to drive sales strategies.</li>\n<li>Maintain accurate sales records and reports using CRM tools.</li>\n</ul>\n<h3><strong>Preferred Skills &amp; Requirements</strong></h3>\n<ul>\n<li>Bachelor’s degree in Business, Marketing, IT, or a related field.</li>\n<li>Proven experience in software sales, IT sales, or B2B sales.</li>\n<li>Strong understanding of <strong>SaaS</strong>, <strong>cloud solutions</strong>, or <strong>enterprise software</strong>.</li>\n<li>Excellent communication, negotiation, and presentation skills.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>Proficiency in CRM software and Microsoft Office Suite.</li>\n<li>Willingness to travel as needed.</li>\n</ul>\n<h3><strong>Preferred Qualifications</strong></h3>\n<ul>\n<li>Experience selling <strong>ERP</strong>, <strong>CRM</strong>, <strong>cybersecurity</strong>, or other enterprise software solutions.</li>\n<li>Familiarity with consultative sales techniques.</li>\n<li>Technical background or understanding of software development is a plus.</li>\n</ul>",
        "tags": [
            "2-4 Years",
            "SaaS",
            "CRM",
            "ERP"
        ],
        "summary": "A Software Sales Executive role at Kenland IT Solutions requires 2-4 years of experience in B2B software sales, with expertise in SaaS, CRM, and ERP solutions to drive revenue and client relationships."
    },
    {
        "job_title": "Business Analyst",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27709",
        "location": "Technopark",
        "closing_date": "15 Mar 2026",
        "job_description": "<h2>KENLAND IT SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA , 695581\n<strong>Website:</strong> <a href=\"https://www.kenland.in\">https://www.kenland.in</a></p>\n<h3>Business Analyst</h3>\n<p><strong>Closing Date:</strong> 15, Mar 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking a skilled and detail-oriented <strong>Business Analyst</strong> with a minimum of 3 years of experience in IT or software development environments. The ideal candidate will be responsible for gathering and analyzing business requirements, facilitating communication between stakeholders and technical teams, and ensuring that project deliverables meet business needs. This is a key role that directly contributes to project success by enabling effective planning, development, and execution.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct requirement gathering sessions with clients and stakeholders via calls and meetings.</li>\n<li>Translate business needs into clear, concise, and detailed functional and non-functional requirements.</li>\n<li>Use case diagrams, flowcharts, and wireframes (if applicable).</li>\n<li>Act as the liaison between the client and the technical team, ensuring clarity and consistency.</li>\n<li>Participate in daily stand-ups, sprint planning, and project status meetings.</li>\n<li>Assist in backlog grooming and creation of user stories in Agile environments.</li>\n<li>Ensure timely and accurate communication with internal teams and external stakeholders.</li>\n<li>Manage requirement changes using structured change control processes.</li>\n<li>Contribute to product vision, roadmap discussions, and process improvements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>3+ years of experience as a Business Analyst in an IT or software development environment.</li>\n<li>Experience preparing comprehensive documentation (BRD, FRD, SRS).</li>\n<li>Proficient in tools like MS Office, Confluence.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Strong analytical thinking, attention to detail, and problem-solving capabilities.</li>\n<li>Experience in working with cross-functional teams and multiple stakeholders.</li>\n<li>Ability to manage multiple priorities in a fast-paced environment.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "BRD/FRD/SRS",
            "MS Office",
            "Confluence"
        ],
        "summary": "Seeking a Business Analyst with 3+ years' experience to gather requirements, translate business needs, and bridge communication between stakeholders and technical teams."
    },
    {
        "job_title": "Junior Dot Net Developer",
        "company": "Kenland It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27708",
        "location": "Technopark",
        "closing_date": "15 Mar 2026",
        "job_description": "<p><strong>Company:</strong> KENLAND IT SOLUTIONS (P) Ltd\n<strong>Location:</strong> 3rd &amp; 5th FLOORS, M SQUARED BUILDING, ANNEX 2, TECHNOPARK CAMPUS, KARIYAVATTOM, TRIVANDRUM, KERALA, 695581\n<strong>Website:</strong> <a href=\"https://www.kenland.in\">https://www.kenland.in</a>\n<strong>Closing Date:</strong> 15, Mar 2026\n<strong>Job Published:</strong> 16, Feb 2026\n<strong>Contact Email:</strong> recruiter@kenland.in</p>\n<h3><strong>Job Title:</strong> Junior Dot Net Developer</h3>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a junior ASP.NET Developer with <strong>1-2 years of experience</strong> to join our development team. The ideal candidate will be responsible for designing, developing, and maintaining web applications using ASP.NET MVC and .Net Core.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Develop, test, and deploy ASP.NET MVC applications.</li>\n<li>Collaborate with cross-functional teams to define and implement new features.</li>\n<li>Debug and resolve software issues to ensure optimal performance.</li>\n<li>Participate in code reviews and follow best coding practices.</li>\n<li>Maintain and improve existing applications, identifying areas for optimization.</li>\n<li>Stay updated with the latest technologies and ASP.NET best practices.</li>\n<li>Document code and technical designs for future reference.</li>\n<li>Provide basic technical support and troubleshooting for applications in production.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Strong knowledge of C# programming language.</li>\n<li>Experience in software development with .NET Core.</li>\n<li>Familiarity with HTML, CSS, JavaScript, and jQuery.</li>\n<li>Basic experience with front-end frameworks like Bootstrap.</li>\n<li>Understanding of relational databases, Entity Framework, and ORM tools (Dapper).</li>\n<li>Knowledge of version control systems like Git.</li>\n<li>Good problem-solving skills and attention to detail.</li>\n<li>Ability to work effectively in a collaborative team environment.</li>\n<li>A positive attitude, willingness to learn, and adaptability to project requirements.</li>\n<li>Basic understanding of object-oriented programming (OOP) principles.</li>\n<li>Experience in writing SQL queries and working with relational databases.</li>\n<li>Exposure to RESTful APIs and Web Services.</li>\n<li>Understanding of Agile methodologies.</li>\n<li>Knowledge of cloud platforms like Azure.</li>\n</ul>\n<h3><strong>Contact Information</strong></h3>\n<p>For inquiries, please email: <strong>recruiter@kenland.in</strong></p>",
        "tags": [
            "1-2 Years",
            "ASP.NET MVC",
            ".NET Core",
            "C#"
        ],
        "summary": "Junior Dot Net Developer with 1-2 years experience in ASP.NET MVC and .NET Core, focusing on web application development and team collaboration."
    },
    {
        "job_title": "Business Development Manager",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/27707",
        "location": "Technopark",
        "closing_date": "18 Mar 2026",
        "job_description": "<p><strong>Company:</strong> ZenturioTech (P) Ltd\n<strong>Location:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://zenturiotech.com\">https://zenturiotech.com</a>\n<strong>Closing Date:</strong> 18, Mar 2026\n<strong>Published Date:</strong> 14, Feb 2026\n<strong>Contact Email:</strong> admin@zenturiotech.com</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Business Development Manager</strong> with <strong>1 to 3 years of experience</strong> to drive revenue growth, expand global reach, and manage the sales function. You will handle the full sales cycle and support strategic growth initiatives.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Build and manage global connections using LinkedIn and other digital platforms</li>\n<li>Handle the complete sales cycle from prospecting and outreach to closing deals</li>\n<li>Generate and qualify leads through digital and networking channels</li>\n<li>Create persuasive pitches and proposals for potential clients</li>\n<li>Explore and open new markets and partnership opportunities</li>\n<li>Work closely with founders and the core team to support business strategy</li>\n<li>Maintain CRM records and track sales performance metrics</li>\n<li>Lead and guide junior business development team members</li>\n<li>Take initiative and contribute ideas for business growth</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>BBA or MBA in Marketing, or any graduate degree</li>\n<li>Strong communication and negotiation skills</li>\n<li>1 to 3 years of experience in sales or business development</li>\n<li>Experience in LinkedIn lead generation and digital outreach</li>\n<li>Ability to close deals and manage client relationships independently</li>\n<li>Comfortable working in a fast-paced startup environment</li>\n<li>Good organizational and time management skills</li>\n<li>Ability to work independently and lead a small team</li>\n<li>Strong interest in startups and growth-oriented roles</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "LinkedIn Lead Generation",
            "Sales Management",
            "CRM"
        ],
        "summary": "Seeking a Business Development Manager with 1-3 years of experience to drive revenue growth, expand global reach, and lead sales initiatives. Requires strong sales, LinkedIn lead generation, and CRM skills."
    },
    {
        "job_title": "R&D Psychologist Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/27706",
        "location": "Technopark",
        "closing_date": "18 Mar 2026",
        "job_description": "<p><strong>Company:</strong> ZenturioTech (P) Ltd\n<strong>Location:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://zenturiotech.com\">https://zenturiotech.com</a>\n<strong>Closing Date:</strong> March 18, 2026\n<strong>Job Published:</strong> February 14, 2026\n<strong>Contact Email:</strong> admin@zenturiotech.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>vibrant and motivated R&amp;D Psychologist Trainee</strong> with a strong interest in mental health, research, and community engagement. This role combines research exposure with active involvement in engagement campaigns and sessions supporting mental health and technology-driven wellness initiatives.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Assist in research planning, data collection, and analysis</li>\n<li>Conduct literature reviews and summarize research findings</li>\n<li>Support development and validation of psychological assessment tools</li>\n<li>Prepare research reports, documentation, and presentations</li>\n<li>Assist in manuscript preparation for journals and conferences</li>\n<li>Plan, conduct, and engage in mental health awareness sessions and campaigns</li>\n<li>Support community-building initiatives for mental health and wellness projects</li>\n<li>Collaborate with cross-functional teams on technology-enabled wellness initiatives</li>\n<li>Ensure adherence to ethical research and engagement guidelines</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Postgraduate degree in Psychology or a related discipline</li>\n<li>Interest or exposure to mental health, behavioral research, or wellness programs</li>\n<li>Energetic, proactive, and comfortable facilitating sessions with diverse audiences</li>\n<li>Strong communication, facilitation, coordination, and presentation skills</li>\n<li>Basic knowledge of research methods and data analysis tools (SPSS/R/Python is an advantage)</li>\n<li>Ability to work independently and collaboratively in a team-based office environment</li>\n<li>Good organizational skills to manage sessions, timelines, and multiple tasks</li>\n</ul>",
        "tags": [
            "Not Specified",
            "Psychology",
            "Research Methods",
            "SPSS/R/Python"
        ],
        "summary": "Assist in mental health research and campaigns. Develop tools, analyze data, and engage communities in wellness initiatives."
    },
    {
        "job_title": "UI/ UX DEVELOPER",
        "company": "Ateam Infosoft Solutions Private Limited",
        "url": "https://technopark.org/job-details/27705",
        "location": "Technopark",
        "closing_date": "06 Mar 2026",
        "job_description": "<p><strong>ATEAM INFOSOFT SOLUTIONS PRIVATE LIMITED</strong></p>\n<p><strong>Address:</strong> Thejaswini, Technopark Phase I, Technopark Rd, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"https://www.ateamsoftsolutions.com\">https://www.ateamsoftsolutions.com</a></p>\n<p><strong>Job Title:</strong> UI/UX Developer\n<strong>Closing Date:</strong> 06, Mar 2026\n<strong>Published Date:</strong> 14, Feb 2026\n<strong>Contact Email:</strong> <strong>recruitment@ateamsoftsolutions.com</strong>\n<strong>Phone:</strong> +91 7907410058</p>\n<h3>Brief Description</h3>\n<p>We are hiring a skilled <strong>UI/UX Developer + Designer</strong> with <strong>2+ years</strong> of experience to design intuitive interfaces and develop responsive front-end solutions for web and mobile applications.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design wireframes, mockups, and user flows using tools like Figma or Adobe XD</li>\n<li>Develop responsive, accessible UI using HTML5, CSS3, JS (ES6+), and Bootstrap</li>\n<li>Convert designs into functional front-end components</li>\n<li>Ensure cross-browser/device consistency</li>\n<li>Collaborate with product and development teams</li>\n<li>Contribute to design systems and improve user experience</li>\n</ul>\n<h3>Skills Required</h3>\n<ul>\n<li>UI/UX design + frontend development (<strong>2+ years</strong>)</li>\n<li>Tools: Figma, Adobe XD, Sketch</li>\n<li>Tech: HTML5, CSS3, JavaScript, Bootstrap</li>\n<li>Basic knowledge of React/Angular/Vue is a plus</li>\n<li>Strong understanding of responsive design &amp; accessibility</li>\n<li>Good communication and teamwork skills</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with design systems and reusable UI components</li>\n<li>Strong knowledge of React.js and modern front-end development</li>\n<li>Familiarity with Tailwind CSS or similar frameworks</li>\n</ul>\n<h3>Apply Now</h3>\n<p><strong>Email:</strong> recruitment@ateamsoftsolutions.com\n<strong>Phone:</strong> +91 7907410058</p>",
        "tags": [
            "2+ Years",
            "Figma",
            "Adobe XD",
            "React.js"
        ],
        "summary": "UI/UX Developer with 2+ years of experience designing interfaces and developing responsive front-end solutions using Figma, React.js, and modern frameworks."
    },
    {
        "job_title": "HR RECRUITER | Freshers",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/27704",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>REIZEND (P) Ltd</h2>\n<p><strong>Address:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.reizendretail.in\">http://www.reizendretail.in</a>\n<strong>Contact Email:</strong> careers@reizend.ai</p>\n<h3>HR RECRUITER | Freshers</h3>\n<p><strong>Closing Date:</strong> 31, Mar 2026\n<strong>Job Published:</strong> 14, Feb 2026</p>\n<p><strong>Brief Description</strong>\nWe are seeking a motivated and dynamic HR Recruiter to join our team. In this role, you will assist in the recruitment process by sourcing, screening, and selecting qualified candidates to fill various positions within the company.</p>\n<p><strong>Responsibilities</strong>\n- Assist in the development of job descriptions and job postings to attract qualified candidates.\n- Utilize various recruiting platforms to source potential candidates.\n- Screen resumes and applications to identify suitable candidates for open positions.\n- Conduct phone screenings to assess candidate qualifications, skills, and cultural fit.\n- Coordinate and schedule interviews with hiring managers and candidates.\n- Maintain accurate and up-to-date candidate records.\n- Preparation of job offers.\n- Coordinate onboarding activities for new hires.\n- Assist in other HR-related tasks.</p>\n<p><strong>Preferred Skills</strong>\n- Strong communication and interpersonal skills.\n- Ability to prioritize tasks and manage time effectively.\n- Attention to detail and strong organizational skills.\n- Proficiency in Microsoft Office.</p>\n<p><strong>Qualifications</strong>\n- Bachelor's degree in any field.\n- Freshers are preferred.</p>\n<p><strong>Location:</strong> Trivandrum\n<strong>Salary Package:</strong> 20K per month</p>\n<p><strong>Application Instructions:</strong> Kindly send your resumes to careers@reizend.ai</p>",
        "tags": [
            "Freshers",
            "Microsoft Office",
            "Communication Skills",
            "Time Management"
        ],
        "summary": "Seeking an HR Recruiter to source candidates, coordinate interviews, and manage onboarding. Requires strong communication and organizational skills."
    },
    {
        "job_title": "FLUTTER DEVELOPER | 1-3 YRS",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27703",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<h3>Job Title: Flutter Developer</h3>\n<p><strong>Experience Required:</strong> 1-3 Years\n<strong>Closing Date:</strong> 31, Mar 2026\n<strong>Published Date:</strong> 14, Feb 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop mobile applications using the Flutter framework and Dart programming language.</li>\n<li>Collaborate with designers to create user-friendly and visually appealing interfaces.</li>\n<li>Test and debug application code to ensure functionality.</li>\n<li>Optimize app performance, including reducing size and improving speed.</li>\n<li>Work with backend developers and other team members to integrate services.</li>\n<li>Use Git for version control and code collaboration.</li>\n<li>Document code, processes, and project requirements.</li>\n<li>Stay updated on mobile app development trends and advancements.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in Flutter framework and Dart.</li>\n<li>Knowledge of mobile app development principles and best practices.</li>\n<li>Familiarity with HTML, CSS, and JavaScript.</li>\n<li>Understanding of UI/UX design principles.</li>\n<li>Experience with RESTful APIs and backend integration.</li>\n<li>Git version control expertise.</li>\n<li>Agile development methodologies and collaborative tools.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Effective communication and teamwork abilities.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's or Master’s degree in computer science or related fields.</li>\n</ul>\n<h3>Salary</h3>\n<ul>\n<li>₹35,000 - ₹40,000 per month</li>\n</ul>",
        "tags": [
            "1-3 Years",
            "Flutter",
            "Dart",
            "Git"
        ],
        "summary": "Flutter Developer with 1-3 years experience required to build and optimize mobile apps using Dart and Flutter, collaborate with designers, and integrate backend services. Salary: ₹35k-40k/month."
    },
    {
        "job_title": "PHP DEVELOPER | 2025/2026 freshers",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27702",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<h2>SMARTHMS &amp; SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581\n<strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<h3>Job Title: PHP Developer | 2025/2026 Freshers</h3>\n<p><strong>Closing Date:</strong> 31, Mar 2026\n<strong>Published Date:</strong> 14, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@shmsolutions.in\">careers@shmsolutions.in</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a Fresher Developer to join our dynamic team. This role is ideal for a graduate passionate about learning and growing in software development.</p>\n<h3>Job Responsibilities</h3>\n<ul>\n<li>Assist in the design, development, testing, and deployment of software applications.</li>\n<li>Write clean, efficient, and maintainable code.</li>\n<li>Participate in code reviews and contribute to codebase improvements.</li>\n<li>Troubleshoot and debug issues promptly.</li>\n<li>Collaborate with team members to understand project requirements and deliver solutions.</li>\n<li>Stay updated with industry trends and technologies.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Proficiency in programming with strong core concepts.</li>\n<li>Problem-solving skills to analyze and resolve programming challenges.</li>\n<li>Strong knowledge of statistical concepts and techniques.</li>\n<li>Excellent analytical and communication skills.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's or Master's degree in Computer Science or a related field.</li>\n<li><strong>Experience:</strong> 0-1 years.</li>\n<li><strong>Salary Package:</strong> 4-6 LPA</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "PHP",
            "Problem-Solving",
            "Communication"
        ],
        "summary": "Entry-level PHP Developer role for 2025/2026 graduates. Focus on software development, problem-solving, and collaboration with growth opportunities."
    },
    {
        "job_title": "RECENT PASSOUTS | IMPLEMENTATION MANAGER",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27701",
        "location": "Technopark",
        "closing_date": "31 Mar 2026",
        "job_description": "<p><strong>SMARTHMS &amp; SOLUTIONS (P) Ltd</strong></p>\n<p><strong>Address:</strong>\nSBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581</p>\n<p><strong>Website:</strong> <a href=\"https://shmsolutions.in\">https://shmsolutions.in</a></p>\n<p><strong>Job Title:</strong> RECENT PASSOUTS | IMPLEMENTATION MANAGER\n<strong>Closing Date:</strong> 31, Mar 2026\n<strong>Published Date:</strong> 14, Feb 2026\n<strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking a high-potential fresher to join our Implementation Team. You will learn our healthcare ERP product, understand hospital workflows, and assist in onboarding and training new implementation engineers under senior guidance. This role offers a career path in healthcare technology delivery.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Participate in structured training to learn healthcare ERP modules (Billing, Lab, EMR, etc.)</li>\n<li>Understand hospital workflows and compliance standards (e.g., NABH)</li>\n<li>Shadow senior team members during client implementations</li>\n<li>Maintain and update onboarding materials, SOPs, templates, and checklists</li>\n<li>Assist in creating and improving training content (slides, videos, FAQs)</li>\n<li>Document challenges, feedback, and resolutions from field projects</li>\n<li>Support onboarding and internal training for new engineers</li>\n<li>Conduct mock demos and sandbox configurations for practice sessions</li>\n<li>Track training progress using structured checklists</li>\n<li>Learn technical deployment basics and data preparation steps</li>\n<li>Collaborate with project managers and client-side stakeholders</li>\n<li>Participate in team retrospectives and identify process improvement areas</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Qualifications:</strong>\n- Recent graduate in Engineering, IT, Business, or Life Sciences\n- Strong logical reasoning and fast learning ability\n- Excellent written and verbal communication skills\n- Attention to detail and proactive documentation habits\n- Eagerness to learn healthcare processes and ERP delivery</p>\n<p><strong>Good-to-Have:</strong>\n- Exposure to ERP or enterprise systems via internships or projects\n- Basic understanding of hospital operations\n- Proficiency in MS Office or Google Suite</p>\n<p><strong>Salary:</strong> 7-11 LPA</p>",
        "tags": [
            "0-1 Years",
            "Healthcare ERP",
            "NABH Compliance",
            "MS Office/Google Suite"
        ],
        "summary": "Recent graduates to assist in healthcare ERP implementation, training, and process improvement. Opportunity to learn hospital workflows and support client onboarding."
    },
    {
        "job_title": "Graphic Designer (Trainee / Junior Level)",
        "company": "Techstas Global Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27700",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Job Posting: Graphic Designer (Trainee / Junior Level)</h2>\n<p><strong>Company</strong>: Techstas Global Innovations (P) Ltd\n<strong>Location</strong>: Module 9, -2 Floor, Thejaswini Building, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website</strong>: <a href=\"https://www.techstas.com\">https://www.techstas.com</a>\n<strong>Closing Date</strong>: 28, Feb 2026\n<strong>Published</strong>: 14, Feb 2026\n<strong>Contact Email</strong>: career@techstas.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a creative and enthusiastic Graphic Designer with strong visual thinking and motion design skills. The ideal candidate should transform ideas into engaging visual content across digital and print platforms while maintaining brand consistency. This role is ideal for freshers or candidates with up to 1 year of experience passionate about design and storytelling.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Collaborate with design and marketing teams to create compelling content.</li>\n<li>Design assets for digital and print media.</li>\n<li>Create static designs, motion graphics, animations, and perform video editing.</li>\n<li>Translate brand messaging into high-impact visuals.</li>\n<li>Ensure designs align with brand guidelines.</li>\n<li>Organize and manage digital assets for projects.</li>\n<li>Participate in brainstorming sessions with innovative ideas.</li>\n<li>Deliver projects on time with high-quality standards.</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>Education</strong>: Degree in Graphic Design, Visual Arts, or related field (preferred but not mandatory).</li>\n<li><strong>Experience</strong>: 0–1 year of experience; freshers encouraged to apply.</li>\n<li><strong>Technical Skills</strong>: Required software expertise includes Adobe Photoshop, Adobe Illustrator, Adobe Premiere Pro, Adobe After Effects.</li>\n</ul>\n<h3>Additional Requirements</h3>\n<ul>\n<li>Strong understanding of design principles, layout, typography, and color theory.</li>\n<li>Ability to follow brand guidelines while exploring innovative concepts.</li>\n<li>Experience in motion design and dynamic video content creation.</li>\n<li>Social media asset creation experience is highly desirable.</li>\n<li>Knowledge of additional design/motion graphics tools is an advantage.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your <strong>Resume</strong> and <strong>Portfolio</strong> (if available) to <strong>career@techstas.com</strong> with the subject line: <strong>Graphic Designer Trainee</strong>.\n<strong>Note</strong>: Applications without the correct subject line may be put on hold or rejected.</p>",
        "tags": [
            "0-1 Year",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Adobe After Effects"
        ],
        "summary": "Seeking a junior graphic designer with 0-1 year experience in Adobe tools for creating digital/print visuals and motion graphics."
    }
]