[
    {
        "job_title": "Intern — React Front-End (with UI/UX Basics)",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/21172/296",
        "location": "Infopark",
        "closing_date": "26 Nov 2025",
        "job_description": "<h2>Intern — React Front-End (with UI/UX Basics)</h2>\n<p><strong>Location:</strong> Infopark, Kakkanad\n<strong>Mode:</strong> Full-time (Office)</p>\n<h3>About the Role:</h3>\n<p>We are seeking a React Front-End Intern who possesses basic knowledge of web development and UI/UX principles. This internship offers a fantastic opportunity to learn from experienced professionals, support the development team, and contribute to the creation of responsive web pages and straightforward features.</p>\n<h3>Skills Required:</h3>\n<ul>\n<li>Basic understanding of React.js</li>\n<li>Knowledge of HTML, CSS, and JavaScript</li>\n<li>Good understanding of UI/UX principles and familiarity with design tools such as Figma or Adobe XD</li>\n<li>A strong willingness to learn and collaborate effectively within a team environment</li>\n<li>Basic understanding of Git (this is an added advantage)</li>\n<li>Knowledge of REST APIs (this is an added advantage)</li>\n</ul>\n<h3>Who Can Apply:</h3>\n<ul>\n<li>Freshers are welcome to apply, specifically those who have graduated in 2025, 2024, or 2023.</li>\n</ul>\n<p>If this opportunity aligns with your career aspirations, please share your updated resume with us at <strong>careers@grapelime.in</strong>.</p>",
        "tags": [
            "0-3 Years",
            "React.js",
            "UI/UX",
            "HTML/CSS"
        ],
        "summary": "Seeking a React Front-End Intern with basic web dev and UI/UX knowledge. Learn, support the team, and build responsive web pages and features. Freshers welcome."
    },
    {
        "job_title": "Software Implementation and support engineer",
        "company": "Empress InfoTech",
        "url": "https://infopark.in/company-jobs/details/21175/70",
        "location": "Infopark",
        "closing_date": "29 Nov 2025",
        "job_description": "<h2>Software Implementation and Support Engineer</h2>\n<p>We are seeking skilled software engineers with experience in software implementation, deployment, configuration, and integration of our web-based application within client environments. This role requires a strong technical background, problem-solving skills, and experience working with Windows environments and SQL Server. The ideal candidate will work closely with clients, project managers, and technical teams to ensure smooth implementation and adoption of our software. In this role, you will work closely with a talented team of engineers across India and the US, contributing to the delivery of high-quality software solutions for customers worldwide.</p>\n<h2>Requirements:</h2>\n<ul>\n<li><strong>1+ Years of experience in the following:</strong><ul>\n<li>Software Installation and configuration.</li>\n<li>Deployment, configuration, and support for web applications built in .NET.</li>\n<li>Software development, troubleshooting, testing, and production support.</li>\n<li>Installation of IIS Web Servers and deployment of web applications.</li>\n<li>Work with Windows servers, IIS, and networking teams to ensure smooth application deployment.</li>\n<li>Perform database setup and configuration.</li>\n<li>Provide technical guidance and training to clients on product usage.</li>\n<li>Troubleshoot and resolve implementation-related issues.</li>\n<li>Develop and maintain implementation documentation, best practices, and user guides.</li>\n<li>Excellent written and verbal communication skills in English.</li>\n<li>Assist with API integrations, data migrations, and system configurations as needed.</li>\n</ul>\n</li>\n</ul>\n<h2>Technologies:</h2>\n<ul>\n<li>Windows Server, IIS, and SQL Server.</li>\n<li>AWS, Azure, and cloud services.</li>\n<li>ASP.NET, C#, jQuery, JavaScript.</li>\n<li>REACT, MongoDB, Express.JS, and Node JS.</li>\n</ul>\n<h2>Location:</h2>\n<ul>\n<li>Infopark Kochi, Hybrid, Work from Home</li>\n</ul>\n<h2>Application Instructions:</h2>\n<p>Please email your resume with the subject line \"Software Implementation Engineer\" and provide the following details in the body of the email to be considered for the position:</p>\n<ol>\n<li>Your years or months of relevant experience to the position.</li>\n<li>Current location.</li>\n<li>Notice period required to join.</li>\n<li>Current remuneration and expectations.</li>\n</ol>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@empressinfotech.com</p>",
        "tags": [
            "1+ Years",
            "SQL Server",
            "Windows Server",
            ".NET"
        ],
        "summary": "Seeking a Software Implementation and Support Engineer with 1+ years of experience in web application deployment and client support. Role involves technical troubleshooting, client training, and documentation."
    },
    {
        "job_title": "ASP.NET C# Programmer / Trainee Developer",
        "company": "Empress InfoTech",
        "url": "https://infopark.in/company-jobs/details/21176/70",
        "location": "Infopark",
        "closing_date": "29 Nov 2025",
        "job_description": "<h2>ASP.NET C# Programmer / Trainee Developer</h2>\n<p>We are seeking hands-on programmers trained in ASP.NET, C#, and SQL to join our development team. The ideal candidates have completed formal training or courses in these technologies and are eager to apply their skills in real-world web application development. You will work closely with senior developers and team members to design, develop, test, and support software applications.</p>\n<h3>Skills &amp; Qualifications:</h3>\n<ul>\n<li>Completed formal training in ASP.NET, C#, MVC and SQL.</li>\n<li>Strong programming skills with hands-on coding experience.</li>\n<li>Web development skills using HTML5, CSS3, JavaScript, jQuery, and Bootstrap.</li>\n<li>Database development skills using MS SQL Server, stored procedures, views, etc.</li>\n<li>Strong analytical, logical thinking, and problem-solving skills.</li>\n<li>Good communication and teamwork abilities.</li>\n</ul>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Collaborate with team members to understand project requirements and translate them into functional software.</li>\n<li>Participate in requirement analysis, design, programming, and unit testing.</li>\n<li>Write clean, efficient, and maintainable code for web applications using ASP.NET and C#.</li>\n<li>Work with SQL Server to create queries, stored procedures, and manage database interactions.</li>\n<li>Provide status updates on development tasks and actively contribute to problem-solving discussions.</li>\n<li>Continuously learn and apply new technologies and best practices in software development.</li>\n</ul>\n<h3>Education:</h3>\n<ul>\n<li>BCA / MCA / BE / B. Tech or equivalent.</li>\n</ul>\n<h3>Work location:</h3>\n<ul>\n<li>Infopark Kochi or Muvattupuzha or Hybrid.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Email your resume with a subject of \"ASP.NET C# Developer\" and a cover letter to provide the following information to be considered for the position:</p>\n<ol>\n<li>Current location.</li>\n<li>Experience in IT.</li>\n<li>Notice period required for joining.</li>\n<li>Current remuneration and expectations.</li>\n</ol>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@empressinfotech.com.</p>",
        "tags": [
            "Trainee Developer",
            "ASP.NET",
            "C#",
            "SQL"
        ],
        "summary": "Seeking ASP.NET, C#, and SQL trained programmers for web application development. Join a team to design, develop, test, and support software."
    },
    {
        "job_title": "AI/ML Programmer",
        "company": "Vtrio Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21167/119",
        "location": "Infopark",
        "closing_date": "30 Nov 2025",
        "job_description": "<h2>AI/ML Programmer</h2>\n<p>We are looking for a highly skilled AI/ML Programmer with at least 2 years of experience to join our growing team. In this role, you will identify and optimize machine learning and AI models and algorithms to implement effective ML and AI solutions tailored to business needs. You will work closely with data scientists and software engineers to build scalable AI solutions and integrate them into production environments. A strong foundation in machine learning principles, hands-on experience with deep learning frameworks, and familiarity with cloud-based AI/ML solutions are essential for success in this role.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Identify and optimize machine learning and AI models and algorithms to implement effective ML and AI solutions aligned with business needs.</li>\n<li>Develop, deploy, and enhance AI/ML solutions for scalability and efficiency.</li>\n<li>Collaborate with cross-functional teams to integrate ML models into production systems.</li>\n<li>Work with large and complex datasets to extract meaningful insights.</li>\n<li>Fine-tune models for improved performance and accuracy.</li>\n<li>Stay updated with the latest advancements in AI and ML technologies.</li>\n<li>Document models, experiments, and key processes for reproducibility and future reference.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor's or Master's degree in Computer Science, Machine Learning, or a related field.</li>\n<li>Minimum of 2 years of hands-on experience in AI/ML development.</li>\n<li>Strong understanding of machine learning algorithms, data preprocessing, and feature engineering.</li>\n<li>Proficiency in Python and ML libraries such as TensorFlow, PyTorch, and Scikit-learn.</li>\n<li>Experience with model tuning, optimization, and performance improvement techniques.</li>\n<li>Familiarity with cloud-based AI/ML platforms such as AWS (SageMaker, Lambda, S3), Azure ML, or GCP AI Platform.</li>\n<li>Strong analytical and problem-solving skills with attention to detail.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Hands-on experience in deploying AI models in production environments.</li>\n<li>Understanding of MLOps practices for managing AI pipelines.</li>\n<li>Knowledge of SQL for working with structured datasets.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary and benefits package.</li>\n<li>Opportunities for career growth and professional development.</li>\n<li>A collaborative and innovative work environment.</li>\n<li>Access to state-of-the-art AI/ML tools and cloud technologies.</li>\n<li>Flexibility with remote work options for the right candidate.</li>\n</ul>\n<p><strong>Contact Information:</strong>\nEligible candidates can send resume to hr@vtrio.com\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at hr@vtrio.com</p>",
        "tags": [
            "2+ Years",
            "Python",
            "TensorFlow",
            "PyTorch"
        ],
        "summary": "AI/ML Programmer sought for optimizing ML models and implementing AI solutions. Requires Python, deep learning frameworks, and cloud experience. Collaborate on scalable AI integration."
    },
    {
        "job_title": "Data Engineer",
        "company": "Fingent Global Solutions",
        "url": "https://infopark.in/company-jobs/details/21159/83",
        "location": "Infopark",
        "closing_date": "01 Dec 2025",
        "job_description": "<h2>Data Engineer</h2>\n<p>At Fingent, we believe that what we build touches lives around us. We use technology to create a better and smarter environment. We nurture thought leaders and encourage them to be the seeds of change through smart software development and consulting services. Our commitment to quality and integrity helps us to use technology and create a better and smarter future.</p>\n<h3>Job Summary:</h3>\n<p>We are seeking a skilled and motivated Data Engineer with a strong background in Advanced SQL, Performance Fine Tuning, Data Analysis and ETL. In this role, you will work closely with cross-functional teams to design, build, and optimize data pipelines, ensuring that our data infrastructure is scalable, efficient, and meets business requirements. Experience with visualization tools like PowerBI or Tableau is a plus.</p>\n<h3>Skill Sets:</h3>\n<ul>\n<li>Proven experience in Advanced SQL and query optimization and ETL Pipeline</li>\n<li>Knowledge in C# is an advantage.</li>\n<li>Experience with data analysis, data cleaning, and data validation.</li>\n<li>Experience with ETL tools and processes preferably using Microsoft ETL tools</li>\n<li>Proficiency in Azure Data Factory.</li>\n<li>Proficiency in PowerBI, Tableau, or Excel for data visualization and reporting.</li>\n<li>Strong problem-solving skills and attention to detail.</li>\n<li>Excellent communication and collaboration skills.</li>\n</ul>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop, optimize, and maintain complex SQL queries for data extraction, manipulation, and reporting.</li>\n<li>Design and implement ETL processes to ensure smooth data flow from various sources to data warehouses.</li>\n<li>(Optional) Create data visualizations using PowerBI, Tableau, or Excel to provide actionable insights.</li>\n<li>Monitor and troubleshoot data pipelines to ensure data accuracy, quality, and timely delivery.</li>\n<li>Ensure data security and compliance with company policies and industry regulations.</li>\n</ul>\n<h3>Experience:</h3>\n<p>4 - 8 years</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@fingent.com</p>",
        "tags": [
            "4-8 Years",
            "Advanced SQL",
            "ETL",
            "Azure Data Factory"
        ],
        "summary": "Seeking a Data Engineer proficient in Advanced SQL, ETL, and data analysis. Responsibilities include designing and optimizing data pipelines and troubleshooting data flow. Experience with visualization tools is a plus."
    },
    {
        "job_title": "RPA Developer",
        "company": "Difinity Digital",
        "url": "https://infopark.in/company-jobs/details/21177/495",
        "location": "Infopark",
        "closing_date": "01 Dec 2025",
        "job_description": "<h2>RPA Developer</h2>\n<p><strong>Experience:</strong> 2-5 Years</p>\n<p><strong>Job Description:</strong></p>\n<ul>\n<li>Create and build automation workflows, solutions, and reusable elements utilizing automation tools.</li>\n<li>Work closely with business analysts to understand requirements and offer technical insight for automation implementation.</li>\n<li>Address and rectify issues within automation processes and extend support to business users.</li>\n<li>Post implementation monitoring and addressing issues if any.</li>\n<li>Build, test, and monitor automation workflows to guarantee optimal efficiency in business processes, while minimizing the risk of errors.</li>\n<li>Deploy automations in production as per the requirements and best practices.</li>\n<li>Oversee project timelines, deliverables, and stakeholder expectations, ensuring alignment with priorities and resource allocation.</li>\n</ul>\n<p><strong>Skills Required:</strong></p>\n<ul>\n<li>RPA bot development experience with one of the market leading RPA platforms: Automation Anywhere, BluePrism and/or UIPath</li>\n<li>Experience in programming (.NET, Java, ETL etc.)</li>\n<li>Demonstrated expertise with at least 1 full life cycle Analytics or Systems integration engagement across strategy, design and implementation</li>\n<li>Experience with Agile and DevOps</li>\n<li>Practical exposure and work experience with Agile Digital tools like: GIT, Jenkins, Artifactory, etc.</li>\n<li>Strong oral and written communication skills, including presentation skills (MS Visio, MS PowerPoint)</li>\n<li>Strong desire to explore, evaluate and understand new technologies.</li>\n<li>Good verbal &amp; written communication skills – articulate value of AI to business, project managers &amp; other team</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at mitty.j@difinitydigital.com</p>",
        "tags": [
            "2-5 Years",
            "RPA",
            "Automation Anywhere",
            "UIPath"
        ],
        "summary": "RPA Developer needed for automation workflow creation and issue resolution. Requires experience with RPA platforms, programming, and Agile/DevOps."
    },
    {
        "job_title": ".Net Fullstack Developer",
        "company": "Difinity Digital",
        "url": "https://infopark.in/company-jobs/details/21151/495",
        "location": "Infopark",
        "closing_date": "05 Dec 2025",
        "job_description": "<h2>.Net Fullstack Developer</h2>\n<p>We are seeking a highly skilled and motivated .NET Full Stack Developer to join our development team. You will be responsible for building robust, scalable, and modern web applications using technologies such as .NET Core, ASP.NET Core MVC/Web API, MS SQL Server, and JavaScript. You should be comfortable working across the full stack and contributing to all phases of the development lifecycle.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Design, develop, and maintain full-stack web applications using .NET Core, ASP.NET Core MVC, and Web API.</li>\n<li>Work with MS SQL Server or other relational databases to model, manage, and optimize data effectively.</li>\n<li>Build modular, reusable frontend components using HTML, CSS, JavaScript, and modern frameworks (React – added advantage).</li>\n<li>Ensure code quality through unit testing, code reviews, and adherence to clean coding and best practices.</li>\n<li>Collaborate with designers, product managers, and engineering teams to deliver high-quality user experiences.</li>\n<li>Optimize applications for performance, scalability, and reliability across all layers.</li>\n<li>Utilize Git for version control and follow structured workflows, including feature branching and pull requests.</li>\n<li>Integrate and enhance existing in-house tools, APIs, and business systems.</li>\n<li>Stay updated with evolving technologies and apply new knowledge to solve practical development challenges.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>3+ years of hands-on experience in full-stack development using .NET Core and C#.</li>\n<li>Strong proficiency in HTML, CSS, JavaScript, and responsive web design principles.</li>\n<li>Expertise in ASP.NET Core MVC and Web API for building scalable and secure applications.</li>\n<li>Solid experience working with MS SQL Server or other relational databases.</li>\n<li>Familiarity with Microservices Architecture and distributed system concepts.</li>\n<li>Experience with React is a plus.</li>\n<li>Good understanding of RESTful API design and development.</li>\n<li>Experience with Git and collaborative development workflows.</li>\n<li>Familiarity with Agile methodologies and sprint-based execution.</li>\n<li>Strong analytical, troubleshooting, and problem-solving skills.</li>\n<li>Ability to lead and manage projects when needed.</li>\n<li>Sound understanding of clean coding principles, industry best practices, and DRY principles.</li>\n<li>Familiarity with unit testing and standard testing practices.</li>\n<li>Excellent communication skills and a proactive, quality-first mindset.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at jishnu.v@difinitydigital.com</p>",
        "tags": [
            "3+ Years",
            ".NET Core",
            "ASP.NET Core MVC",
            "MS SQL Server"
        ],
        "summary": "Seeking a .NET Full Stack Developer to build scalable web applications using .NET Core, ASP.NET Core MVC, and MS SQL Server. Requires 3+ years of experience in full-stack development."
    },
    {
        "job_title": "Head Of Marketing",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21169/182",
        "location": "Infopark",
        "closing_date": "06 Dec 2025",
        "job_description": "<h2>Head Of Marketing</h2>\n<p><strong>Company:</strong> 2Hats Logic Solutions\n<strong>Location:</strong> Ernakulam, Kerala (On-site)\n<strong>Position Type:</strong> Full-time</p>\n<h3>About the Role:</h3>\n<p>2Hats Logic Solutions is seeking an experienced and results-oriented Head of Marketing to lead our marketing efforts. This is a critical on-site role based in Ernakulam, Kerala, responsible for overseeing all day-to-day marketing activities. You will develop and execute innovative marketing strategies, conduct thorough market research, plan and manage impactful marketing campaigns, handle public relations, and provide crucial support to sales initiatives. The position requires strong leadership to guide the marketing team and effective collaboration with cross-functional teams to achieve ambitious business growth objectives and foster strong brand awareness.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Develop and execute comprehensive marketing strategies aligned with the company’s business objectives and growth targets.</li>\n<li>Lead Performance Marketing initiatives (must-have) across various channels (e.g., paid search, social media, programmatic advertising, SEO) to maximize ROI and drive lead generation and conversions.</li>\n<li>Devise and implement SEO and AEO strategies to improve organic search performance and enhance website visibility.</li>\n<li>Analyze campaign performance, prepare insightful reports, and adjust strategies based on data-driven insights.</li>\n<li>Manage the marketing budget, ensuring effective allocation of resources to achieve strategic goals.</li>\n<li>Build, mentor, and manage a high-performing marketing team, fostering a culture of collaboration and continuous improvement.</li>\n<li>Set clear performance metrics and professional development goals for team members.</li>\n<li>Serve as the organization's subject matter expert on all marketing best practices, emerging technologies, and industry shifts.</li>\n<li>Utilize strong communication skills to articulate marketing vision, strategies, and results to executive leadership and cross-functional teams.</li>\n<li>Collaborate closely with Sales and other departments to ensure alignment of marketing activities with overall business goals.</li>\n</ul>\n<h3>Qualifications &amp; Experience:</h3>\n<ul>\n<li>7–12 years of marketing experience, preferably in an IT Service/Product-based company.</li>\n<li>Proven success in leadership or senior managerial roles.</li>\n<li>Proven expertise and a successful track record in Performance Marketing (mandatory).</li>\n<li>Solid experience with email marketing platforms, segmentation, and automation.</li>\n<li>Strong strategic thinking and execution skills in developing, implementing, and measuring effective marketing programs.</li>\n<li>Demonstrated ability to build and manage a successful team.</li>\n<li>Exceptional written and verbal communication skills.</li>\n<li>Strong knowledge of SEO and AEO strategies.</li>\n</ul>\n<h3>Why Join Us:</h3>\n<ul>\n<li>Lead a high-impact marketing function that directly drives business growth.</li>\n<li>Shape and execute innovative strategies across performance, digital, and SEO marketing.</li>\n<li>Build, mentor, and inspire a high-performing team.</li>\n<li>Work in a collaborative environment where your ideas and results are recognized.</li>\n<li>Be a key part of the company’s growth story and make a real difference.</li>\n</ul>\n<h3>Ready to Make an Impact?</h3>\n<p>If you're a results-oriented marketing leader with a passion for performance marketing and team building, we'd love to hear from you!</p>\n<h3>Contact Information:</h3>\n<p>Apply now or share your CV at hr@2hatslogic.com with the subject line \"Head Of Marketing\".\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at hr@2hatslogic.com.</p>",
        "tags": [
            "7-12 Years",
            "Performance Marketing",
            "SEO/AEO",
            "Team Leadership"
        ],
        "summary": "Lead marketing strategies, campaigns, and team for 2Hats Logic Solutions. Drive growth through performance marketing, SEO, and sales collaboration."
    },
    {
        "job_title": "Walk in Drive December 2025",
        "company": "EXACORE IT SOLUTIONS PRIVATE LIMITED",
        "url": "https://infopark.in/company-jobs/details/21150/169",
        "location": "Infopark",
        "closing_date": "07 Dec 2025",
        "job_description": "<h2>Walk-In Drive - December 2025</h2>\n<p><strong>Walk-In Interview Details:</strong>\n<strong>Date:</strong> 6th December 2025\n<strong>Time:</strong> 10:00 AM to 5:00 PM\n<strong>Reporting Time:</strong> 9:45 AM</p>\n<p><strong>Venue:</strong>\nExacore IT Solutions\n1st Floor, Indeevaram, INFOPARK Smart Space,\nKoratty, Thrissur – 680 308, Kerala, India</p>\n<p><strong>Contact Number:</strong> 8138916160</p>\n<hr />\n<h3>Position: Oracle Finance Functional Analyst</h3>\n<p><strong>Job Location:</strong> Infopark, Koratty\n<strong>Experience:</strong> 1 to 5 years</p>\n<p><strong>Qualification:</strong> M.com / MBA with (Finance &amp; Accounts)</p>\n<p><strong>Job Requirements (Finance):</strong>\n- M.COM, MBA etc. with relevant knowledge in Finance &amp; Accounting.\n- Any certification related to accounts is an added advantage.\n- Knowledge on Oracle Technologies (Advantage).\n- Excellent Communication Skills.\n- Manage the complete lifecycle of Oracle implementation, from understanding business processes to Go-Live and Post Go-Live support.\n- Ability to operate independently and make decisions with little direct supervision.\n- Provide support to clients whenever required.\n- Ability to complete tasks within a particular timeframe.</p>\n<hr />\n<h3>Role: Oracle SCM Functional Analyst</h3>\n<p><strong>Location:</strong> Koratty Infopark, Thrissur\n<strong>Experience:</strong> 1 to 5 years</p>\n<p><strong>Qualification:</strong> MBA Operation/LOGISTICS/SCM / BTECH / Diploma in Logistics/SCM</p>\n<p><strong>Job Requirements (SCM):</strong>\n- Certification in Logistics &amp; SCM management would be an advantage.\n- Excellent documentation and communication skills.\n- Work under the direction of the Manager to provide application and workflow solutions for assigned business area(s).\n- Interact with business users to understand new business requirements and enhancement requests.\n- Assist in developing functional specifications, design documents, business process workflow, and related documentation for new development projects and enhancements/modifications.</p>\n<hr />\n<h3>Position: Oracle Technical Analyst</h3>\n<p><strong>Job Location:</strong> Infopark, Koratty\n<strong>Experience:</strong> 1 to 5 years</p>\n<p><strong>Qualification:</strong> BE / B Tech / M Tech / MCA</p>\n<p><strong>Job Requirements (Technical):</strong>\n- Good understanding of SQL / PL/SQL and database concepts.\n- Familiarity with software engineering principles, SDLC, and UML.\n- Strong analytical and problem-solving skills.\n- Excellent communication and presentation skills.\n- Eagerness to learn quickly and work in a collaborative environment.\n- Knowledge of programming languages (C, C++, Java) will be an added advantage.\n- Oracle certification (SQL / PL/SQL / Oracle EBS) is a plus.\n- Ability to analyze business requirements and translate them into technical solutions.\n- Basic understanding of ERP concepts and Oracle E-Business Suite modules is an added advantage.</p>\n<hr />\n<p><strong>Application:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at career@exacoreitsolutions.com</p>",
        "tags": [
            "1-5 Years",
            "Oracle",
            "Finance",
            "SCM"
        ],
        "summary": "Exacore IT Solutions is hiring Oracle Finance, SCM, and Technical Analysts with 1-5 years of experience. Interviews are on December 6th, 2025, at Infopark, Koratty."
    },
    {
        "job_title": "QA Lead (5+Years)",
        "company": "NewAgeSys Solutions (P) Ltd.",
        "url": "https://infopark.in/company-jobs/details/21173/109",
        "location": "Infopark",
        "closing_date": "10 Dec 2025",
        "job_description": "<h2>QA Lead (5+ Years)</h2>\n<p><strong>Company:</strong> NewAgeSys IT (a division of NewAgeSys)\n<strong>Location:</strong> Carnival Infopark, Phase 2, Kakkanad, Ernakulam\n<strong>Job Type:</strong> Onsite\n<strong>Shift Timing:</strong> 11 AM - 8 PM</p>\n<h3>About the Company</h3>\n<p>NewAgeSys IT, a division of NewAgeSys, Inc. established in 1994, based in New Jersey, specializes in mobile app development and consulting. They help clients maximize reach and effectiveness by leveraging the latest technology. As a full-service mobile and web development firm, NewAgeSys IT services clients across North America, UK, Europe, the Middle East, Singapore, and Australia. They build long-term client relationships from initial idea brainstorming and project strategizing to building, deploying, and maintaining cost-effective solutions.</p>\n<h3>Job Description</h3>\n<p>NewAgeSys IT is seeking a detail-oriented and experienced QA Lead to spearhead their Quality Assurance efforts. The ideal candidate will own test planning, execution, and process improvements to ensure projects meet the highest standards of quality, performance, and reliability. This role involves leading a team of QA engineers, collaborating with cross-functional teams, and implementing best practices to enhance QA processes.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead and mentor a team of QA engineers (~10 members), fostering a culture of ownership, accountability, and continuous improvement.</li>\n<li>Define, implement, and maintain QA processes, standards, and best practices across various web and Mobile app projects.</li>\n<li>Develop and execute comprehensive test strategies including functional, regression, integration, performance, and automation testing (when required).</li>\n<li>Collaborate closely with Project, Development, and DevOps teams to ensure seamless delivery.</li>\n<li>Manage test planning, test case design, execution, and defect management.</li>\n<li>Evaluate and recommend automation frameworks, tools, and technologies to improve efficiency.</li>\n<li>Ensure QA involvement throughout the SDLC (Agile/Scrum methodologies).</li>\n<li>Drive root cause analysis and continuous feedback loops to prevent recurring issues.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science, Engineering, or a related field.</li>\n<li>5–8 years of QA experience, with at least 2–3 years in a leadership or lead role.</li>\n<li>Strong knowledge of manual and automated testing methodologies.</li>\n<li>Hands-on experience with test automation tools such as Selenium, Cypress, Playwright, Appium, JUnit, TestNG, or similar.</li>\n<li>Familiarity with CI/CD pipelines, version control (Git), and build tools (Jenkins, Maven, Gradle, etc.).</li>\n<li>Experience with API testing tools (Postman, RestAssured, etc.) and performance testing tools (JMeter, Gatling, etc.).</li>\n<li>Strong analytical and problem-solving skills with attention to detail.</li>\n<li>Excellent leadership, communication, and stakeholder management skills.</li>\n<li>Knowledge of cloud-based testing (AWS, Azure, GCP) is a plus.</li>\n<li>ISTQB or similar certification is an advantage.</li>\n</ul>\n<h3>Nice to Have</h3>\n<ul>\n<li>Experience working in Agile/Scrum environments.</li>\n<li>Exposure to security testing and DevOps practices.</li>\n<li>Previous experience in leading QA teams.</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at career@newagesysindia.com.</p>",
        "tags": [
            "5+ Years",
            "QA Lead",
            "Selenium",
            "Agile"
        ],
        "summary": "Experienced QA Lead wanted to manage a team and enhance quality assurance processes. Requires 5-8 years of experience, leadership skills, and expertise in testing methodologies."
    },
    {
        "job_title": "Functional Consultant-Microsoft Dynamics 365 Business Central",
        "company": "Voxtron Solutions LLP",
        "url": "https://infopark.in/company-jobs/details/21181/336",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Functional Consultant - Microsoft Dynamics 365 Business Central</h2>\n<p>We are seeking an experienced Microsoft Dynamics 365 Business Central Functional Consultant with 5+ years of hands-on implementation and support experience. The ideal candidate will have strong functional knowledge across key Business Central modules, excellent client-facing skills, and the ability to translate business requirements into efficient ERP solutions.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>Implementation &amp; Solution Design</strong>\n- Lead end-to-end implementation of Microsoft Dynamics 365 Business Central projects.\n- Conduct requirement gathering workshops, GAP-FIT analysis, and prepare functional design documents.\n- Configure Business Central modules to align with client business processes.\n- Design and document business workflows, customizations, and integrations.</p>\n<p><strong>Client Engagement &amp; Delivery</strong>\n- Serve as the primary functional point of contact for clients throughout the project lifecycle.\n- Conduct user training, UAT coordination, and post-implementation support.\n- Work closely with technical teams for solution customization and extensions.</p>\n<p><strong>Modules Expertise (Preferred)</strong>\n- Finance (GL, AP, AR, FA, Cash/Bank)\n- Sales &amp; Purchase\n- Inventory &amp; Warehousing\n- Manufacturing (optional but preferred)\n- Project Management\n- Service Management (added advantage)</p>\n<p><strong>Documentation &amp; Process Management</strong>\n- Prepare BRD, FDD, SOW, Test Scripts, and Training Manuals.\n- Ensure adherence to implementation methodologies (Agile/Waterfall).\n- Maintain accurate project records and provide timely status updates.</p>\n<p><strong>Support &amp; Enhancements</strong>\n- Analyze client issues and provide functional resolutions.\n- Recommend process improvements and system optimizations.\n- Support version upgrades and migration activities.</p>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>5+ years of experience as a Functional Consultant in Dynamics NAV / Business Central.</li>\n<li>Strong understanding of business processes across finance, supply chain, and operations.</li>\n<li>Hands-on experience with Business Central configuration, workflows, and extensions.</li>\n<li>Ability to perform GAP-FIT analysis, write functional specs, and coordinate with technical teams.</li>\n<li>Excellent communication, presentation, and client-interaction skills.</li>\n<li>Experience with AL extensions understanding (functional-level) is a plus.</li>\n<li>Certifications in Dynamics 365 BC/NAV are an added advantage.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Commerce, Business Administration, Engineering, or related field.</li>\n<li>Experience working in implementation partner environment.</li>\n<li>Knowledge of Power BI, Power Automate, or related Microsoft ecosystem tools.</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Ability to manage multiple assignments and meet deadlines.</li>\n<li>Team player with a customer-centric mindset.</li>\n<li>Strong documentation and process discipline.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lavanya@voxtronme.com</p>",
        "tags": [
            "5+ Years",
            "Microsoft Dynamics 365 Business Central",
            "ERP",
            "Finance"
        ],
        "summary": "Seeking an experienced Dynamics 365 Business Central Functional Consultant with 5+ years of experience. Role involves implementation, client engagement, and providing ERP solutions."
    },
    {
        "job_title": "Pre Sales Consultant-Microsoft Dynamics 365 Business Central",
        "company": "Voxtron Solutions LLP",
        "url": "https://infopark.in/company-jobs/details/21182/336",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Pre-Sales Consultant - Microsoft Dynamics 365 Business Central</h2>\n<p>We are seeking a highly skilled Presales Consultant – Microsoft Dynamics 365 Business Central with strong functional knowledge and excellent client engagement skills. In this role, you will support the sales team by delivering product demonstrations, preparing solution proposals, and translating client needs into compelling solution designs.</p>\n<p>The ideal candidate has a solid background in Business Central (or NAV) across Finance, Supply Chain, and Operations, with significant experience in solutioning, presales presentations, and proposal preparation.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>1. Presales &amp; Solution Consulting</strong>\n- Conduct product demonstrations, POCs, and workshops tailored to client requirements.\n- Lead requirement discovery sessions to understand business challenges and propose BC solutions.\n- Create high-quality solution blueprints, value propositions, and presales documentation.\n- Develop process flows, solution architecture overviews, and module-level conceptual designs.\n- Prepare competitive and compelling proposals, BOQs, and RFP/RFI responses.</p>\n<p><strong>2. Sales Support</strong>\n- Collaborate with the sales team during prospecting, qualification, and client presentations.\n- Assist in building sales strategies and positioning Business Central against competitor ERPs (SAP B1, Odoo, NetSuite, Tally Prime+).\n- Support commercial discussions by providing solution clarifications and scope boundaries.\n- Demonstrate ROI through business cases, cost-benefit analysis, and productivity improvement metrics.</p>\n<p><strong>3. Product Expertise</strong>\n- Stay updated on the latest Business Central features, updates, and Microsoft roadmap.\n- Demonstrate best practices in Finance, Sales, Purchase, Inventory, Warehouse, Projects, and basic Manufacturing.\n- Prepare demo environments customized for each industry vertical.</p>\n<p><strong>4. Proposal &amp; Documentation</strong>\n- Prepare detailed presales assets:\n  - Functional scope\n  - Fit-Gap analysis\n  - Implementation timeline\n  - User license requirement\n  - Pricing &amp; commercials\n  - Solution deck presentations\n- Work closely with delivery teams to ensure proposals match actual implementation feasibility.</p>\n<p><strong>5. Collaboration</strong>\n- Coordinate with Functional Consultants, Technical Consultants, Developers, and Project Managers.\n- Provide knowledge transfer to internal teams on proposed solutions.\n- Support marketing with product content, webinars, whitepapers, and case studies.</p>\n<h3>Required Expertise &amp; Skills</h3>\n<p><strong>Must-Have</strong>\n- 5+ years of experience in Dynamics 365 Business Central / NAV (Functional + Presales).\n- Strong business process knowledge in Finance, Supply Chain, Procurement, Inventory, Projects.\n- Excellent presentation skills (online and onsite).\n- Ability to convert business pain points into solution stories.\n- Skilled in preparing presales artefacts: proposals, PPTs, capability decks, SOW inputs.\n- Experience conducting C-level discussions and leading workshops.\n- Strong documentation skills.</p>\n<p><strong>Good to Have</strong>\n- Experience with Power BI, Power Automate, and other Microsoft ecosystem tools.\n- Knowledge of Manufacturing, Service Management modules.\n- Experience with cloud migration (NAV → BC).\n- Microsoft certification (MB-800 or related).\n- Familiarity with AL extensions (basic understanding).</p>\n<p><strong>Soft Skills</strong>\n- Excellent communication and storytelling ability.\n- Strong analytical and problem-solving skills.\n- Ability to manage multiple prospects simultaneously.\n- High level of professionalism and client handling.\n- Team-oriented with a strong sales mindset.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lavanya@voxtronme.com</p>",
        "tags": [
            "5+ Years",
            "Microsoft Dynamics 365 Business Central",
            "Presales",
            "Solution Consulting"
        ],
        "summary": "Seeking a Presales Consultant for Microsoft Dynamics 365 Business Central. Responsibilities include product demos, proposal preparation, and client needs translation."
    },
    {
        "job_title": "Associate Consultant or Consultant Quality and Market Research",
        "company": "TNP Consultancy Private Limited",
        "url": "https://infopark.in/company-jobs/details/21183/489",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Associate Consultant or Consultant - Quality and Market Research</h2>\n<p>At TNP, you will benefit from exposure to client missions and continuous training, which will enrich your expertise and support your personal development. In close collaboration with the Directors and Managers, you will work in a fast-growing independent firm serving major accounts in India &amp; Europe.</p>\n<p>As a Consultant, you will be closely working with the Management Team for project management support, market research, and quality management. You will be working closely with your project teams, providing support for their engagements, which will involve support with project activities, pipeline management, quality audits, and validation tasks. The position caters to both IT and non-IT business environments, requiring adaptability and a strong understanding of business operations. The role is based primarily out of Kochi with occasional travel and requires extensive collaboration with international clients.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Ability to work independently as well as collaboratively in a team environment and with clients.</li>\n<li>Strong focus on quality management with keen attention to detail, and carry out quality audits in line with client requirements and standards.</li>\n<li>Perform quality checks to ensure accuracy and compliance.</li>\n<li>Analyse errors and deviations, identifying root causes and trends.</li>\n<li>Prepare feedback reports and assist in developing corrective and preventive action plans.</li>\n<li>Support the creation and delivery of training modules related to quality processes.</li>\n<li>Monitor key quality KPIs and assist in meeting defined targets, and maintain proper documentation of audit findings and quality reports.</li>\n<li>Involved in process training to ensure the expected quality is maintained.</li>\n<li>Conducting detailed research, preparing actionable insights, and collaborating with stakeholders to identify opportunities, improve processes, and guide strategic initiatives.</li>\n<li>Conduct market research, industry benchmarking, and competitive analysis.</li>\n</ul>\n<h3>Primary Required Skills</h3>\n<ul>\n<li>Strong ability in pipeline management, quality control, developing process documentation, and a focus on managing repetitive tasks.</li>\n<li>Good command of the English language and strong communication skills.</li>\n<li>Exposure to audit processes or quality checks (internship/academic project experience can be considered).</li>\n<li>Problem-solving mindset with eagerness to learn and grow in the field of quality management.</li>\n<li>Deep interest in research and analysis, and the ability to delve deep into topics and synthesise data into useful information.</li>\n<li>Proficiency in MS Office tools (Excel, Word, PowerPoint), with knowledge of Excel Macro being an added advantage.</li>\n<li>Basic knowledge of quality management standards and processes (ISO or similar is a plus).</li>\n</ul>\n<h3>Ideal Candidate Profile</h3>\n<ul>\n<li>MBA or any post-graduation in Analytics or related fields.</li>\n<li>Prior working experience in the Automotive/ Consulting industry is preferred.</li>\n<li>Highly proficient in English and Hindi. French will be an added advantage.</li>\n<li>Willing to travel, both in India and overseas, on a project basis.</li>\n</ul>\n<p>Join us and embark on a rewarding journey. Let's elevate TNP India's presence together!</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers.india@tnpconsultants.com</p>",
        "tags": [
            "0-2 Years",
            "Quality Management",
            "Market Research",
            "Consulting"
        ],
        "summary": "Consultant role in Quality and Market Research supporting management, clients, and project teams. Involves quality audits, market analysis, and research for IT/non-IT environments."
    },
    {
        "job_title": "Associate Consultant/ Consultant",
        "company": "TNP Consultancy Private Limited",
        "url": "https://infopark.in/company-jobs/details/21184/489",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Associate Consultant/ Consultant</h2>\n<p>At TNP, you will benefit from exposure to client missions &amp; continuous training, which will enrich your expertise and support your personal development. In close collaboration with the Partners &amp; Directors, you will work in a fast-growing independent firm serving major accounts in India &amp; Europe.</p>\n<h3>Role Overview</h3>\n<p>As an Associate Consultant, you will be closely working with the Management Team for practice development, project delivery in the technology domain, solutions, and POC development. You will be working closely with your project teams, providing project management support to their engagements, including administration, organisation of project meetings, governance, and reporting.</p>\n<p>The role is based primarily out of Kochi with occasional travel and requires extensive collaboration with the business and technology team.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Understand the context, strategy &amp; specific objectives of each client in terms of client satisfaction, performance, digital transformation, and sustainable transformation.</li>\n<li>Responsible for the smooth operation of the client's business processes periodically. This includes synthesising data, performing quality checks, and translating them into actionable digital roadmaps.</li>\n<li>Contribute to or help lead technology, process, or analytical discussions and finalise the approach/solution.</li>\n<li>Communicate effectively with the client, capturing the right level of details. Create and present client recommendations and results.</li>\n<li>Stay abreast of emerging digital technologies and industry trends to maintain a competitive edge and deliver cutting-edge solutions.</li>\n</ul>\n<h3>Primary Required Skills</h3>\n<ul>\n<li>Strong client-facing skills, with a passion for building lasting relationships and delivering exceptional value.</li>\n<li>Exceptional communication and interpersonal skills, with the ability to articulate technical concepts to both technical and non-technical audiences.</li>\n<li>Excellent analytical and problem-solving skills, with the ability to break down complex challenges into manageable solutions.</li>\n<li>Knowledge of Agile methodologies (Scrum, Kanban) and project management tools will be an added advantage.</li>\n</ul>\n<h3>Ideal Candidate Profile</h3>\n<ul>\n<li>B Tech + MBA</li>\n<li>1-2 years of working experience in IT / Consulting industry is preferred.</li>\n<li>Highly proficient in English and Hindi. French will be an added advantage.</li>\n<li>Willing to travel, both in India and overseas, on a project basis.</li>\n</ul>\n<p>Join us and embark on a rewarding journey. Let's elevate TNP India's presence together!</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers.india@tnpconsultants.com</p>",
        "tags": [
            "1-2 Years",
            "Consulting",
            "Digital Transformation",
            "Project Management"
        ],
        "summary": "Seeking an Associate Consultant/Consultant for client missions and training. Role involves technology solutions, client collaboration, and project management in Kochi."
    },
    {
        "job_title": "Consultant - Data Vizualisation",
        "company": "TNP Consultancy Private Limited",
        "url": "https://infopark.in/company-jobs/details/21186/489",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Consultant - Data Visualization</h2>\n<p>At TNP, you will benefit from exposure to client missions &amp; continuous training, which will enrich your expertise and support your personal development. In close collaboration with the Partners &amp; Directors, you will work in a fast-growing independent firm serving major accounts in India &amp; Europe.</p>\n<p>As an Associate Consultant with a focus on data visualization, you will be responsible for transforming complex business data into clear, actionable visual formats that empower decision-makers to understand trends, patterns, and insights quickly. You will be working closely with your project teams, providing project management support to their engagements, including administration, organisation of project meetings, governance, and reporting.</p>\n<p>The role is based primarily out of Bangalore or Kochi, with occasional travel and requires extensive collaboration with the business and technology team.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Understand the context, strategy &amp; specific objectives of each client in terms of client satisfaction, performance, digital transformation, and sustainable transformation.</li>\n<li>Design and develop interactive dashboards, visual reports, and presentations using tools like Power BI, Tableau.</li>\n<li>Collaborate with stakeholders, such as CXO-level employees, Senior managers, data engineers, and subject matter experts, to identify and create KPI's and identify business needs.</li>\n<li>Analyse large datasets, ensure data integrity, and extract trends that inform business decisions.</li>\n<li>Present data insights clearly to both technical and non-technical audiences, facilitating a common understanding of the findings.</li>\n<li>Support and train colleagues in the best practices of data visualisation, and potentially maintain documentation or dashboards for organisational knowledge.</li>\n</ul>\n<h3>Primary Required Skills</h3>\n<ul>\n<li>Strong client-facing skills, with a passion for building lasting relationships and delivering exceptional value.</li>\n<li>Proficiency in data visualisation and business intelligence (BI) tools such as Power BI, Tableau.</li>\n<li>Experience with data analysis using SQL, Excel, R, or Python.</li>\n<li>Strong visual design and storytelling skills to convert data into visually appealing, easy-to-understand graphics.</li>\n<li>Knowledge of data preparation: cleaning, transforming, and refining datasets so that they are suitable for visualisation.</li>\n<li>Exceptional communication and interpersonal skills, with the ability to articulate technical concepts to both technical and non-technical audiences.</li>\n<li>Knowledge of Agile methodologies (Scrum, Kanban) and project management tools.</li>\n</ul>\n<h3>Ideal Candidate Profile</h3>\n<ul>\n<li>B Tech + MBA.</li>\n<li>2-4 years of working experience in the IT / Consulting industry is preferred.</li>\n<li>Highly proficient in English and Hindi.</li>\n<li>Willing to travel, both in India and overseas, on a project basis.</li>\n</ul>\n<p>Join us and embark on a rewarding journey. Let's elevate TNP India's presence together!</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers.india@tnpconsultants.com</p>",
        "tags": [
            "2-4 Years",
            "Power BI",
            "Tableau",
            "SQL"
        ],
        "summary": "Data Visualization Consultant needed for client missions and training. Develop interactive dashboards and visual reports using BI tools like Power BI and Tableau."
    },
    {
        "job_title": "DevOps Engineer",
        "company": "Focaloid Technologies Private Limited",
        "url": "https://infopark.in/company-jobs/details/21152/366",
        "location": "Infopark",
        "closing_date": "24 Dec 2025",
        "job_description": "<h2>Junior DevOps Engineer</h2>\n<p><strong>Experience Level:</strong> 1–2 Years</p>\n<p>We are seeking a motivated and enthusiastic Junior DevOps Engineer who is eager to learn and contribute to building, deploying, and maintaining applications and systems. You will collaborate closely with our development and DevOps teams to support automation, CI/CD processes, and environment management.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Work within an Agile team to support system setup, configuration, deployment, and routine updates.</li>\n<li>Assist in maintaining CI/CD pipelines and collaborate with developers to ensure smooth code integration.</li>\n<li>Help build basic automation tools for deployment, monitoring, and system health checks.</li>\n<li>Participate in troubleshooting and resolving issues across development, testing, and production environments.</li>\n<li>Support configuration and maintenance of infrastructure and cloud environments.</li>\n</ul>\n<h3>Required Skill Set</h3>\n<ul>\n<li>Strong problem-solving and debugging skills.</li>\n<li>Basic understanding of operating systems like Linux or Windows.</li>\n<li>Familiarity with any scripting/programming languages (Bash, Python, Java, etc.).</li>\n<li>Interest or exposure to Agile practices and DevOps principles.</li>\n<li>Basic understanding of networking fundamentals (TCP/IP, DNS, HTTP, DHCP, etc.).</li>\n<li>Good communication skills and willingness to learn.</li>\n<li>Strong interest in automation, cloud technologies, and CI/CD practices.</li>\n</ul>\n<h3>Good to Have (Not Mandatory)</h3>\n<ul>\n<li>Exposure to AWS, GCP, or Azure cloud platforms.</li>\n<li>Basic understanding of containerization tools like Docker or Kubernetes.</li>\n<li>Experience using Git or any version-control system.</li>\n</ul>\n<h3>Candidate Profile</h3>\n<ul>\n<li>1–2 years of relevant experience in DevOps, Cloud, System Administration, or related areas.</li>\n<li>Curiosity to explore new technologies, strong learning mindset, and ability to work in a collaborative environment.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at ajish.prabhakaran@focaloid.com.</p>",
        "tags": [
            "1-2 Years Experience",
            "DevOps",
            "CI/CD",
            "Automation"
        ],
        "summary": "Junior DevOps Engineer sought with 1-2 years experience. Responsibilities include supporting automation, CI/CD, and environment management in an Agile setting. Requires strong problem-solving and basic OS/scripting knowledge."
    },
    {
        "job_title": "Onboarding Lead/Engineer",
        "company": "AVENTUS INFORMATICS",
        "url": "https://infopark.in/company-jobs/details/21166/148",
        "location": "Infopark",
        "closing_date": "26 Dec 2025",
        "job_description": "<h2>Onboarding Lead/Engineer</h2>\n<p>As the Onboarding Lead, you will be the first dedicated team member focused on guiding new customers through their onboarding journey. You’ll design and implement a scalable onboarding process, act as the primary point of contact for new customers, and ensure they achieve value quickly. This role requires excellent English communication skills since most customers are based in Australia, New Zealand, and the U.S., and you will interact with both technical and business stakeholders.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Own the end-to-end customer onboarding journey, ensuring new customers move from contract to live usage smoothly and successfully.</li>\n<li>Develop a repeatable, scalable onboarding playbook, including clear documentation, milestones, and success criteria.</li>\n<li>Serve as the primary point of contact for new customers during onboarding, guiding them through setup, integrations, data ingestion, and product enablement.</li>\n<li>Work closely with the Product and Engineering teams to translate onboarding feedback into product improvements and reduce friction points.</li>\n<li>Build and maintain onboarding resources (guides, videos, checklists, templates) to help customers achieve value quickly.</li>\n<li>Identify and resolve onboarding challenges proactively, escalating issues internally when needed.</li>\n<li>Track onboarding metrics (time-to-value, activation rates) and continuously improve the process.</li>\n<li>Conduct kickoff calls and training sessions tailored to the customer’s technical and business context.</li>\n<li>Comfortable interacting with both technical stakeholders (like engineers) and business stakeholders (like product managers) on the customer side.</li>\n<li>E-commerce experience is a plus but not required; we value any SaaS onboarding experience.</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Excellent English communication skills, with the ability to support customers in Western markets.</li>\n<li>Experience in a customer-facing onboarding, implementation, or customer success role within a SaaS environment.</li>\n<li>Ability to create and refine onboarding processes and materials from scratch.</li>\n<li>Strong problem-solving skills and comfort with light technical troubleshooting.</li>\n<li>Willingness to work flexible hours to accommodate different time zones as needed.</li>\n<li>Demonstrable experience working with global customers. This is a must-have requirement.</li>\n</ul>\n<h3>Nice to Have:</h3>\n<ul>\n<li>Experience in the e-commerce sector.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@aventusinformatics.com</p>",
        "tags": [
            "SaaS Onboarding Experience",
            "Customer Success",
            "Implementation",
            "English Communication"
        ],
        "summary": "Lead customer onboarding, design scalable processes, and ensure quick value achievement. Requires strong communication skills for global SaaS clients."
    },
    {
        "job_title": "Social Media Executive",
        "company": "Dynamed Healthcare Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21189/132",
        "location": "Infopark",
        "closing_date": "30 Dec 2025",
        "job_description": "<h2>Social Media Executive</h2>\n<p><strong>Job Overview:</strong></p>\n<p>We are looking for a dynamic and results-driven Social Media Executive with hands-on experience in Facebook Ads and Google Ads. The ideal candidate should have a strong understanding of paid campaign strategies, audience targeting, and analytics, along with the ability to optimize performance and drive measurable business results.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Plan, create, and manage paid advertising campaigns across Facebook Ads Manager and Google Ads (Search, Display, and YouTube).</li>\n<li>Conduct keyword research, audience segmentation, and ad copy development to maximize ROI.</li>\n<li>Monitor, analyze, and report campaign performance, providing actionable insights for optimization.</li>\n<li>Collaborate with the creative team to develop engaging ad creatives and landing pages.</li>\n<li>Manage ad budgets effectively and ensure campaigns meet performance KPIs.</li>\n<li>Stay updated with the latest trends, platform updates, and best practices in digital advertising.</li>\n<li>Work closely with the marketing team to align paid campaigns with overall brand and content strategy.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Marketing, Digital Media, or a related field.</li>\n<li>1–2 years of proven experience in managing Facebook Ads and Google Ads campaigns.</li>\n<li>Proficiency in Google Analytics, Meta Ads Manager, and Google Tag Manager.</li>\n<li>Analytical mindset with excellent communication and reporting skills.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at anoop.rajan@dynamedhealth.com</p>",
        "tags": [
            "1-2 Years",
            "Facebook Ads",
            "Google Ads",
            "Google Analytics"
        ],
        "summary": "Seeking a Social Media Executive experienced in Facebook and Google Ads. Responsibilities include campaign management, optimization, and reporting to drive business results."
    },
    {
        "job_title": "Operations Manager",
        "company": "Applied Payments Technology Pvt Ltd.",
        "url": "https://infopark.in/company-jobs/details/21154/273",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Operations Manager</h2>\n<p>Applied Payments is a leading payment technology vendor delivering modern, scalable, and secure software solutions to banks, fintechs, PSPs, and enterprise clients. Our mission is to simplify and accelerate digital payments through innovative technology and exceptional delivery.</p>\n<p>We are expanding our global operations and looking for a highly capable Operations Manager to oversee operational delivery, manage technical teams, and ensure seamless experiences for our clients.</p>\n<h3>Role Overview</h3>\n<p>As an Operations Manager at Applied Payments, you will lead the end-to-end operational lifecycle for our software deployments and client engagements. You will work closely with engineering, product, support, and customer success teams to ensure high-quality delivery, platform stability, and operational excellence.</p>\n<p>This role includes direct management of technical teams, including software developers, implementation engineers, and support analysts.</p>\n<p>The Operations Manager will work closely with clients, engineering, product, QA, and support teams to ensure seamless deployments, prompt issue resolution, and operational excellence across all engagements.</p>\n<h3>Key Responsibilities</h3>\n<h4>Operational Leadership</h4>\n<ul>\n<li>Oversee daily operations across client projects, deployments, and production environments.</li>\n<li>Ensure all SLAs and service commitments are met with consistency and transparency.</li>\n<li>Lead incident resolution, coordinating closely with development and support teams.</li>\n</ul>\n<h4>Team Management</h4>\n<ul>\n<li>Manage and mentor a technical operational team including software developers.</li>\n<li>Plan and allocate resources across projects while ensuring timely delivery.</li>\n<li>Foster a collaborative environment between development and operations (DevOps mindset).</li>\n</ul>\n<h4>Technical &amp; Platform Operations</h4>\n<ul>\n<li>Monitor the performance and stability of Applied Payments’ platforms across client environments.</li>\n<li>Coordinate release management, patches, hotfixes, and upgrades.</li>\n<li>Maintain operational runbooks, SOPs, and documentation.</li>\n</ul>\n<h4>Client &amp; Cross-Functional Collaboration</h4>\n<ul>\n<li>Serve as the operational point of contact for client technology teams.</li>\n<li>Work closely with engineering, QA, and product teams to ensure smooth deployments and issue resolution.</li>\n<li>Provide operational insights and feedback to improve product capabilities.</li>\n</ul>\n<h4>Process Improvement</h4>\n<ul>\n<li>Drive continuous improvement across operational processes, automation, and monitoring.</li>\n<li>Implement best practices to enhance uptime, stability, and response times.</li>\n<li>Develop and track KPIs for operational performance.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>5+ years of experience in technical operations, preferably within a payment technology or fintech software vendor.</li>\n<li>Strong experience leading technical teams, including software developers.</li>\n<li>Solid understanding of payment systems, transaction workflows, and API-based integrations.</li>\n<li>Excellent communication skills with a client-focused mindset.</li>\n<li>Ability to manage multiple priorities in a fast-paced environment.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience with ISO 8583, ISO 20022, SEPA, SWIFT, card payment processing, or real-time payment systems.</li>\n<li>Understanding of cloud platforms (AWS / Azure) and DevOps practices.</li>\n<li>Exposure to enterprise-scale software deployments.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@appliedpaymentstech.com</p>",
        "tags": [
            "5+ Years",
            "Payment Systems",
            "Technical Operations",
            "Team Management"
        ],
        "summary": "Operations Manager needed for a payment technology vendor. Oversee operational delivery, manage technical teams, and ensure seamless client experiences through high-quality deployments and stability."
    },
    {
        "job_title": "Atlassian Support Specialist",
        "company": "In-Tech Group India Private Limited",
        "url": "https://infopark.in/company-jobs/details/21157/397",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Atlassian Support Specialist</h2>\n<p><strong>About the Job</strong></p>\n<p>Atlassian Support Specialist role at in-tech, a dynamic, fast-growing engineering company headquartered in Munich, Germany, with approximately 2350 employees globally across 20 project locations in 8 countries. in-tech develops innovative engineering solutions for the automotive, rail, aerospace, defence, and industrial sectors.</p>\n<p>We are committed to a flexible, modern work culture and work-life balance. Our colour orange stands for liveliness, warmth, and dynamism. We value a strong team spirit, fresh ideas and a positive work culture. We call it the “Orange Spirit”!</p>\n<p>Since 2024, in-tech became a subsidiary of Infosys Ltd. This strategic partnership enables us to offer our customers even more comprehensive development and digitalisation services and a greater offshore capability.</p>\n<p>We are looking for experienced Atlassian Support Specialists to join our team based out of our Kochi location with hybrid work options. If you’re passionate about joining a growing and dynamic team with a company with a positive culture and team spirit, we’d love to connect with you!</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Administer and manage Atlassian Cloud applications including Jira, Confluence.</li>\n<li>Lead and support migration activities from Atlassian Data Center to Atlassian Cloud.</li>\n<li>Implement and maintain Jira Service Management (service desk projects), request types, and automations.</li>\n<li>Develop and maintain scripts using ScriptRunner for Jira/Confluence and strong documentation skills.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>The ideal candidate would be a graduate with minimum 5+ years of proven work experience as an Atlassian Support Specialist or similar role.</li>\n<li>Hands-on experience with administration in Atlassian cloud systems.</li>\n<li>Strong knowledge in administration in Atlassian Jira and Confluence cloud systems.</li>\n<li>Solid experience with Atlassian Cloud (Jira, Confluence), including automation and service desks in Atlassian Jira.</li>\n<li>Solid experience in migrating from Atlassian Data Center to Atlassian Cloud.</li>\n<li>Strong scripting skills using ScriptRunner for Jira/Confluence.</li>\n</ul>\n<p><strong>Apply with us</strong></p>\n<p>If you have experience and team spirit and are looking for a great place to work, then start your job with us.</p>\n<p>As part of our dedication to the diversity of our workforce, in-tech is committed to equal employment opportunity without regard for age, race, colour, national origin, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity, or religion.</p>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li>Careers: https://in-tech.com/en/carrers/jobs/atlassian-support-specialist-1860</li>\n<li>Email: india.talent@in-tech.com</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Atlassian Cloud",
            "Jira",
            "Confluence"
        ],
        "summary": "Seeking an Atlassian Support Specialist with 5+ years of experience in Jira and Confluence cloud administration. Responsibilities include migration, automation, and scripting support."
    },
    {
        "job_title": "Technology Lead- .NETCore",
        "company": "Experion Technologies",
        "url": "https://infopark.in/company-jobs/details/21160/103",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Technology Lead - .NET Core</h2>\n<h3>Job Purpose</h3>\n<p>Be a Lead engineer in Web API development using .NET.</p>\n<h3>Job Description / Duties and Responsibilities</h3>\n<ul>\n<li>Expertise in developing .NET Core based web applications with RDBMS or NoSQL database back-end.</li>\n<li>Excellent development experience using ASP.NET MVC, Web API, etc.</li>\n<li>Proven Expertise in developing web applications in .NET Core platform.</li>\n<li>Experience in working with Entity Framework Core, LINQ, Blazor, ASP.NET Identity etc.</li>\n<li>Good working exposure with REST API and very strong knowledge in object-oriented concepts &amp; design patterns.</li>\n<li>Expertise in reviewing PRs and test coverage of the unit tests.</li>\n<li>Demonstrated willingness to develop with new/unfamiliar technologies.</li>\n<li>Understanding of different design patterns.</li>\n<li>Experience in developing with static code analyzer.</li>\n<li>Clear understanding about setting up a continuous integration/continuous delivery environment.</li>\n<li>Ability to integrate a variety of data sources and databases into a single system.</li>\n<li>Experience in working with cloud services like AWS Lambda, SNS, Azure Functions, etc. provided by AWS, Azure, Google, etc.</li>\n<li>Experience in working with micro-services architecture.</li>\n<li>Proficiency when it comes to code versioning tools like GIT, and SVN.</li>\n<li>Passion for best design and coding practices and a desire to develop new bold ideas.</li>\n<li>Good understanding and working knowledge on project tracking tools like JIRA, Azure etc.</li>\n<li>Fair understanding on project collaboration tools like Confluence etc.</li>\n<li>Excellent communication skills and convey the ideas with clarity, depth and details.</li>\n<li>Prepare process and design documentations for the solutions implemented for the projects.</li>\n<li>Experience in Scrum Agile development mode and active participation in sprint ceremonies and lead them in the absence of the Scrum Master.</li>\n</ul>\n<h3>Nice to have:</h3>\n<ul>\n<li>Experience in working with identity providers like IdentityServer, Auth0, Keycloak, etc.</li>\n</ul>\n<h3>Job Specification / Skills and Competencies</h3>\n<ul>\n<li>Take full ownership of the tasks, user stories committed by self/team.</li>\n<li>Take lead role in managing tasks in a sprint, reviewing the code of team members and ensuring first time quality of code.</li>\n<li>Write clean, well-designed code.</li>\n<li>Understand the development processes agreed at the organization/client level and ensure that these are followed diligently in the project. Actively participate in optimizing and evolving this process for the improvement of project execution.</li>\n<li>Capability to understand user stories, translate that into technical specifications and convert this into working code.</li>\n<li>Follow modern agile based development process including TDD based unit testing and guide the team to follow the same mandatorily.</li>\n<li>Produce detailed specifications, user stories based on business requirements.</li>\n<li>Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality.</li>\n<li>Contribute in all phases of the development lifecycle.</li>\n<li>Educate, preach and review technology best practices in the team.</li>\n<li>Capability to follow industry trends and tools, pilot them and ensure that team can scale up technically to absorb technology best practices over time.</li>\n<li>Ability to work with Technical Architects to define the Solution/Technical Architecture of the application.</li>\n<li>Passion to understand the complete business goal of the projects and apply this knowledge during the design and development phases.</li>\n<li>Excellent analytical skills to understand the requirements in detail, comment on the logical/usability gaps if any, analyze the technical feasibility and propose the solution approach.</li>\n<li>Ability to identify and split the tasks required for a User Story implementation, thinking from all the technical aspects including the NFRs.</li>\n<li>Ability to provide the estimation for the tasks identified for the Stories and be accountable for completing the tasks.</li>\n<li>Ability to mentor junior team members, helping them on the technology, sprint task management, code quality etc.</li>\n<li>Readiness to take up initiative for suggesting and implementing the best practices in the areas of respective technology. Identify the challenges based on the requirements and initiate PoCs and feasibility studies.</li>\n<li>To adhere to ISMS Policies and Procedures.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at remi.thomas@experionglobal.com</p>",
        "tags": [
            "5+ Years",
            ".NET Core",
            "Web API",
            "Microservices"
        ],
        "summary": "Lead .NET Core Web API developer needed. Requires expertise in .NET Core, ASP.NET MVC, and microservices architecture. Responsibilities include code review, mentoring, and CI/CD implementation."
    },
    {
        "job_title": "SSE/Lead Engineer- Python",
        "company": "Experion Technologies",
        "url": "https://infopark.in/company-jobs/details/21161/103",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>SSE/Lead Engineer - Python</h2>\n<p><strong>Job Purpose:</strong>\nBe a Lead/Senior Engineer in Python Technology.</p>\n<p><strong>Job Description:</strong>\n- Good hands-on knowledge in Django or Flask.\n- Experience in designing &amp; developing Microservices based applications, Unit testing using Pytest or similar, DevOps and Agile practices, Code Reviews.\n- Good development experience of at least 6+ years in Python + one amongst .NET, NodeJS, Angular technologies.\n- Ability to write code in an efficiently structured and modularized manner.\n- Good Understanding of one of the frameworks - Flask, Django etc.\n- Experience with integrating code with Databases, front end application etc.\n- Knowledge on various databases - such as MySQL, MariaDB and working experience on integrations with NoSQL databases as well.\n- Working experience on templating languages such as Jinja2.\n- Experience on working with AWS, Azure APIs (Python) is an additional good to have skill.\n- Passion for best design and coding practices and a desire to develop new bold ideas.\n- Good understanding of code versioning (Git, SVN etc.).\n- Nice to have: Working experience in DevOps.</p>\n<p><strong>Duties and Responsibilities:</strong>\n- Take senior/lead engineer role in managing tasks in a sprint, reviewing the code of team members and ensuring first time quality of code.\n- Write “clean”, well-designed code.\n- Capability to understand user stories, translate that into technical specifications and convert this into working code.\n- Follow modern agile based development process including TDD based unit testing.\n- Produce detailed specifications.\n- Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality.\n- Contribute in all phases of the development lifecycle.\n- Follow technology best practices.\n- Develop and deploy new features to facilitate related procedures and tools if necessary.</p>\n<p><strong>Additional Information/Specifics:</strong>\n- Participate in the full product development cycle, including brainstorming, release planning and estimation, implementing and iterating on code, coordinating with internal and external clients, internal code and design reviews, MVP and production releases, quality assurance, and product support.\n- Highly effective and thrive in a dynamic environment.\n- Comfortable with proactive outward communication and technical leadership and positive about accepting challenges.\n- To adhere to ISMS policies and procedures.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at remi.thomas@experionglobal.com</p>",
        "tags": [
            "6+ Years",
            "Python",
            "Django/Flask",
            "Microservices"
        ],
        "summary": "Lead/Senior Python Engineer with 6+ years experience in Django/Flask and Microservices. Responsible for code quality, development, and agile practices."
    },
    {
        "job_title": "Project Manager",
        "company": "Experion Technologies",
        "url": "https://infopark.in/company-jobs/details/21162/103",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Project Manager</h2>\n<p>We are seeking an experienced Project Manager to fully own client accounts, balancing ongoing project delivery with client relationship management to identify new opportunities. The ideal candidate will have strong client management, articulation, detailing, and negotiation skills, with confidence in coordinating client interactions throughout the product lifecycle, including requirement grooming, development, UAT, rollout, and release phases.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Full ownership of delivery and pre-sales within a client account.</li>\n<li>Manage teams of 15-20 resources to execute various projects.</li>\n<li>Ensure the functional, technical, and commercial quality of projects.</li>\n<li>Demonstrate a passion for delving into project details, both functional and technical.</li>\n<li>Possess strong analytical and problem-solving skills to address client business problems and propose solutions.</li>\n<li>Act as a servant leader, building team confidence through regular interaction, professionalism, and knowledge.</li>\n<li><strong>Client Management:</strong></li>\n<li>Build customer confidence through detailing, proactivity, value additions, and quality.</li>\n<li>Conduct regular status meetings, communicating threats, actions, milestone forecasts, and dependencies.</li>\n<li>Negotiate scope changes and change requests.</li>\n<li>Understand client businesses to identify digital transformation opportunities.</li>\n<li>Present Experion capabilities and resource skill sets.</li>\n<li><strong>Scrum Master, Agile Champion:</strong></li>\n<li>Lead Product Grooming sessions, deciding on stories for grooming based on the project schedule.</li>\n<li>Identify technical gaps during grooming and planning, involving Architects as needed.</li>\n<li>Facilitate Sprint Planning, assisting the team in task identification and estimation.</li>\n<li>Conduct Daily Scrum meetings, identifying and addressing challenges.</li>\n<li>Track sprint progress using Burndown charts.</li>\n<li>Schedule and conduct Sprint Reviews/Demos, tracking and closing feedback.</li>\n<li>Promote open feedback during Sprint Retrospectives and track improvement suggestions.</li>\n<li><strong>Project Metrics Management:</strong></li>\n<li>Prepare and track project schedules based on scope, team size, and dependencies.</li>\n<li>Monitor work progress, identify threats/delays, and communicate impacts with data.</li>\n<li>Prepare invoice plans, managing project commercials and ensuring defined margins.</li>\n<li>Prepare timesheets for T&amp;M projects and ensure timely invoicing.</li>\n<li>Ensure deliverable quality through coordination of reviews and testing.</li>\n<li>Possess excellent written and verbal communication skills, articulating points with clarity and data.</li>\n<li><strong>Pre-sales Skills:</strong></li>\n<li>Collaborate with the marketing team on case studies and blogs.</li>\n<li>Coordinate and prepare project proposals with BAs and Architects.</li>\n<li>Willingness to travel to client sites (overseas/domestic) for short to medium durations (1 week to 1 month).</li>\n<li>Adhere to ISMS policies and procedures.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Experience and confidence in client management.</li>\n<li>Expertise in handling end-to-end project delivery using Agile Methodology.</li>\n<li>Hands-on experience with Product Grooming, Agile Ceremonies, and collaboration with technical teams.</li>\n<li>Excellent Project Management skills (Estimation, Scheduling, Tracking, Commercials, Quality).</li>\n<li>Experience managing teams of size &gt; 20.</li>\n<li>Experience working with Agile teams in a Scrum Master role.</li>\n<li>Excellent team management skills, fostering professional growth.</li>\n<li>Adequate technical exposure to understand modern web/mobile application development and architecture.</li>\n<li>Experience in Product Development in Web/Mobile technologies with industry-standard engineering practices (CI/CD, DevOps, Automated Testing, etc.).</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Experience in delivery fulfillment, e-commerce, or retail domains.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at remi.thomas@experionglobal.com.</p>",
        "tags": [
            "10+ Years",
            "Agile",
            "Scrum Master",
            "Client Management"
        ],
        "summary": "Project Manager needed for full client account ownership, balancing delivery and new opportunities. Requires strong Agile, Scrum, and client management skills."
    },
    {
        "job_title": "Python Developer",
        "company": "Experion Technologies",
        "url": "https://infopark.in/company-jobs/details/21163/103",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Python Developer</h2>\n<h3>Job Description / Duties and Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain enterprise-grade cloud solutions using AWS services.</li>\n<li>Build and optimize ELT queries using Postgre SQL and reporting platform.</li>\n<li>Create and manage serverless components using Python and AWS services.</li>\n<li>Implement and support scripts for Tech debt remediation and reporting using Python, AWS, and SQL.</li>\n<li>Collaborate with business analysts, architects, and QA to deliver high-quality solutions.</li>\n<li>Ensure compliance with performance, security, and scalability standards.</li>\n<li>Troubleshoot complex integration and deployment issues in AWS cloud environments.</li>\n</ul>\n<h3>Job Specification / Skills and Competencies:</h3>\n<ul>\n<li><strong>Overall Experience:</strong> 3-5 years</li>\n<li><strong>Primary skills:</strong> Proficiency in Python, SQL, AWS, Terraform, CSS, TypeScript, and Python scripting.</li>\n<li><strong>AWS Cloud Experience:</strong> 2+ years of experience in AWS cloud technologies.</li>\n<li><strong>ETL &amp; Cloud:</strong> Strong experience with ETL, AWS clouds, and API Management.</li>\n<li><strong>ETL Tools Familiarity:</strong> Familiarity with ETL tools like Airbyte, DBT, Superset, etc.</li>\n<li><strong>Scalable Solutions:</strong> Experience in building scalable cloud-based ETL solutions.</li>\n<li><strong>API &amp; Integration:</strong> Strong understanding of REST APIs, JSON, and enterprise integration patterns.</li>\n<li><strong>CI/CD &amp; DevOps:</strong> Experience with CI/CD pipelines and DevOps practices in GitHub.</li>\n<li><strong>DevOps Tools Understanding:</strong> Understanding about various DevOps tools like GitHub, SonarQube, JFrog, GitHub Actions, etc.</li>\n<li><strong>Soft Skills:</strong> Excellent communication and stakeholder management skills.</li>\n<li><strong>Security:</strong> To adhere to ISMS Policies and Procedures.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at remi.thomas@experionglobal.com</p>",
        "tags": [
            "3-5 Years",
            "Python",
            "AWS",
            "SQL"
        ],
        "summary": "Python Developer needed for enterprise-grade cloud solutions on AWS. Must have 3-5 years experience in Python, SQL, and AWS, with strong ETL and DevOps skills."
    },
    {
        "job_title": "Cloud DevOps Engineer",
        "company": "Beinex Consulting Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21178/260",
        "location": "Infopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Cloud DevOps Engineer</h2>\n<p>We are seeking an experienced Cloud DevOps Engineer with strong expertise in designing, building, and operating secure, large-scale, multi-tenant cloud platforms. The ideal candidate will have deep hands-on experience with Infrastructure-as-Code (IaC), cloud networking, data platform components, automation, and operational support for high-availability environments.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Build and configure cloud environments using IaC tools (Terraform, Bicep, ARM, or similar).</li>\n<li>Implement multi-tenant infrastructure with complete isolation across compute, storage, identity, and networking layers.</li>\n<li>Deploy core platform components such as:</li>\n<li>Cloud storage and database services</li>\n<li>Data processing and analytics services</li>\n<li>Workload orchestration, compute clusters, and metadata/catalog tools</li>\n<li>Design and configure cloud networking, including VNets, private endpoints, firewalls, routing, and secure API access.</li>\n<li>Implement HA/DR configurations, backup policies, and monitoring foundations.</li>\n<li>Develop reusable IaC modules and provisioning templates for onboarding new environments or tenants.</li>\n<li>Build CI/CD workflows for infrastructure deployment and configuration changes.</li>\n<li>Automate operational tasks such as environment creation, access setup, and network configuration.</li>\n<li>Monitor cloud resources, compute performance, network connectivity, and storage systems.</li>\n<li>Troubleshoot infrastructure issues across compute, identity, storage, and networking.</li>\n<li>Apply patches, upgrades, and configuration changes in line with best practices.</li>\n<li>Optimize cloud performance and cost across compute, storage, and networking workloads.</li>\n<li>Support onboarding of new teams or business units by provisioning secure and isolated environments.</li>\n<li>Maintain detailed documentation for infrastructure, IaC modules, network diagrams, and operational procedures.</li>\n<li>Train internal teams on cloud administration, IaC usage, monitoring tools, and day-to-day cloud operations.</li>\n</ul>\n<h3>Key Skills Requirements</h3>\n<ul>\n<li>5+ years of experience as a Cloud Engineer or similar role.</li>\n<li>Strong, hands-on experience with Azure or another primary cloud provider.</li>\n<li>Advanced proficiency in IaC tools (ARM, Terraform preferred).</li>\n<li>Strong understanding of multi-tenant architecture, resource isolation, and cloud governance.</li>\n<li>Hands-on experience with cloud networking (firewalls, routing, VPN, private endpoints).</li>\n<li>Familiarity with data platform components such as analytics engines, metadata catalogs, and orchestration services.</li>\n<li>Experience with CI/CD, Git, and automation pipelines.</li>\n<li>Excellent troubleshooting and performance optimization skills.</li>\n</ul>\n<h3>Preferred Certifications</h3>\n<ul>\n<li>Azure Administrator / Azure Solutions Architect</li>\n<li>Terraform Associate</li>\n<li>Cloud Security or Networking certifications</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@beinex.com.</p>",
        "tags": [
            "5+ Years",
            "Azure",
            "Terraform",
            "DevOps"
        ],
        "summary": "Seeking an experienced Cloud DevOps Engineer to build and operate secure, large-scale, multi-tenant cloud platforms. Responsibilities include IaC, cloud networking, automation, and operational support for high-availability environments."
    },
    {
        "job_title": "Security Architect",
        "company": "Beinex Consulting Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21179/260",
        "location": "Infopark",
        "closing_date": "15 Jan 2026",
        "job_description": "<h2>Security Architect</h2>\n<p>We are hiring an experienced Security Architect with deep expertise in cloud security, identity management, data protection, and compliance frameworks. The role focuses on designing and implementing security architectures for multi-tenant cloud platforms, ensuring isolation, privacy, encryption, and operational security aligned with best practices.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Define end-to-end cloud security architectures with emphasis on multi-tenant isolation, secure data flows, and identity governance.</li>\n<li>Design IAM models including RBAC, MFA, privilege separation, and zero-trust principles.</li>\n<li>Architect encryption strategies for data at rest and in transit, key management, secret rotation, and certificate handling.</li>\n<li>Embed privacy-by-design and compliance-by-design into platform and component architectures.</li>\n<li>Design and validate access patterns, audit logging strategies, and monitoring frameworks.</li>\n<li>Develop governance models covering change management, incident response, data classification, and retention.</li>\n<li>Configure identity, access controls, network security rules, encryption, certificates, and monitoring agents.</li>\n<li>Perform hardening of cloud resources, compute clusters, storage, and data services according to industry standards.</li>\n<li>Integrate security tools for data discovery, classification, access governance, encryption policy enforcement, and auditability.</li>\n<li>Support vulnerability assessments, penetration tests, and risk remediation.</li>\n<li>Establish dashboards and alerts for security monitoring using SIEM tools.</li>\n<li>Lead threat analysis, incident response, forensic investigations, and root cause analysis.</li>\n<li>Conduct regular access reviews, configuration audits, and isolation checks.</li>\n<li>Oversee security patching, baseline updates, identity audits, and configuration compliance.</li>\n<li>Ensure operational security coverage across all tenants/environments.</li>\n<li>Produce security SOPs, runbooks, incident response plans, and governance workflows.</li>\n<li>Deliver security training for engineering, operations, and administrative teams.</li>\n<li>Ensure full documentation and knowledge transfer for ongoing operational security activities.</li>\n</ul>\n<h3>Key Skills Requirements:</h3>\n<ul>\n<li>7+ years of experience in cybersecurity, cloud security architecture, or related domains.</li>\n<li>Deep expertise with cloud IAM, RBAC, authentication flows, and identity governance.</li>\n<li>Strong knowledge of cloud networking security (firewalls, segmentation, VPN, private networking).</li>\n<li>Hands-on experience with data security tools (classification, cataloging, access governance, encryption management).</li>\n<li>Expertise in encryption, key management, audit logging, and SIEM/SOAR.</li>\n<li>Understanding of multi-tenant security challenges and proven ability to design secure isolation patterns.</li>\n<li>Strong understanding of compliance, data protection, and privacy principles.</li>\n</ul>\n<h3>Preferred Certifications:</h3>\n<ul>\n<li>CISSP, CCSP, CISMAzure Security Engineer / Cloud Security certifications</li>\n<li>ISO 27001 or other governance framework certifications</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@beinex.com</p>",
        "tags": [
            "7+ Years",
            "Cloud Security",
            "IAM",
            "Data Protection"
        ],
        "summary": "Seeking a Security Architect with 7+ years of experience in cloud security. Responsibilities include designing multi-tenant cloud security architectures, IAM, and data protection strategies."
    },
    {
        "job_title": "ACCOUNTANT -BCom Graduate",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25444",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Accountant - BCom Graduate</h2>\n<p><strong>Company:</strong> SMARTHMS &amp; SOLUTIONS (P) Ltd</p>\n<p><strong>Location:</strong> Technopark, Trivandrum (SBC 14, -2 Floor, Thejaswini Building and Ground Floor, Chandragiri Building, Technopark Phase 1, 695581)</p>\n<p><strong>Website:</strong> https://shmsolutions.in</p>\n<p><strong>Job Published:</strong> 26, Nov 2025</p>\n<p><strong>Closing Date:</strong> 10 Jan 2026</p>\n<p><strong>Contact Email:</strong> careers@shmsolutions.in</p>\n<h3>Brief Description:</h3>\n<p>Seeking a BCom Graduate with relevant accounting/finance certifications to join our team as an Accountant. This role is crucial for managing company share issue procedures, financial reporting, and statutory compliance.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Participate in company share issue procedures, including company valuation, preparation of projections, and statutory document preparation for stakeholders and ROC.</li>\n<li>Communicate with Valuers to explain projections and their underlying logic.</li>\n<li>Prepare share issue offer documents, documentation for company statutory meetings, resolutions, and ROC intimations.</li>\n<li>Create realistic cash flow projections, considering statutory requirements, payment prioritization, and receivables.</li>\n<li>Prepare budgets and conduct periodical analysis comparing them to actual financial performance.</li>\n</ul>\n<h3>Required Skills &amp; Knowledge:</h3>\n<ul>\n<li><strong>Accounting Fundamentals &amp; Journal Entries:</strong> Solid understanding of core accounting principles.</li>\n<li><strong>Financial Statements:</strong> Ability to prepare and interpret financial statements.</li>\n<li><strong>Basic Tax Concepts:</strong> Familiarity with GST, TDS, and Income Tax concepts.</li>\n<li><strong>Microsoft Excel:</strong> Proficiency in using formulas and performing basic analysis.</li>\n<li><strong>Tally/ERP:</strong> Experience with Tally/ERP or a willingness to learn company-specific software.</li>\n<li><strong>Projections &amp; Analysis:</strong> Ability to prepare basic projections, analysis reports, and reconciliations (training will be provided).</li>\n</ul>\n<h3>Preferred Qualifications:</h3>\n<ul>\n<li><strong>Education:</strong> BCom Graduates (with relevant accounting/finance certifications).</li>\n<li><strong>Academic Understanding:</strong> Strong academic foundation in Accounting, Finance, Taxation, and Corporate Laws.</li>\n</ul>\n<h3>Accepted Certifications (Preferred):</h3>\n<ul>\n<li>Tally Prime / Tally ERP</li>\n<li>GST Practitioner / GST Basics</li>\n<li>Advanced Excel / Data Analysis with Excel</li>\n<li>Financial Accounting / Corporate Accounting Certification</li>\n<li>SAP/Fundamentals of ERP</li>\n<li>Financial Modelling (basic)</li>\n</ul>\n<h3>Soft Skills:</h3>\n<ul>\n<li>Strong attention to detail and analytical ability.</li>\n<li>Good communication skills (written &amp; verbal).</li>\n<li>Ability to understand, document, and explain financial assumptions.</li>\n<li>Willingness to learn valuation, ROC documentation, and statutory procedures.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>High level of integrity and responsibility.</li>\n</ul>",
        "tags": [
            "0-2 Years",
            "Accounting",
            "Tally",
            "Excel"
        ],
        "summary": "BCom graduate needed for accounting role. Responsibilities include share issues, financial reporting, and statutory compliance. Requires strong accounting fundamentals and Excel skills."
    },
    {
        "job_title": "ACCOUNTANT- MCom Fresher",
        "company": "Smarthms & Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25443",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Accountant - MCom Fresher</h2>\n<p><strong>Company:</strong> SMARTHMS &amp; SOLUTIONS (P) Ltd\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Contact:</strong> careers@shmsolutions.in\n<strong>Website:</strong> https://shmsolutions.in\n<strong>Closing Date:</strong> 10, Jan 2026\n<strong>Job Published:</strong> 26, Nov 2025\n<strong>Salary:</strong> 3.6 LPA</p>\n<h2>Brief Description</h2>\n<p>Submit your updated resume to careers@shmsolutions.in.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Lead the company's share issue procedures, including company valuation processes, preparation of projections, and preparation of statutory documents for stakeholders and ROC.</li>\n<li>Communicate with Valuers, explaining projections and detailing the logic used.</li>\n<li>Prepare share issue offer documents, and maintain proper documentation for company statutory meetings, resolution passing, and intimations with ROC.</li>\n<li>Create realistic cash flow projections considering statutory requirements, prioritizing payments and receivables.</li>\n<li>Prepare budgets and perform periodical analysis against actual financial performance.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Education/Qualification</h3>\n<ul>\n<li>MCom Final-Semester (2026 Batch) or Recent MCom Graduate</li>\n<li>Strong academic understanding of Accounting, Finance, Taxation, and Corporate Laws</li>\n</ul>\n<h3>Technical Skills</h3>\n<ul>\n<li>Good working knowledge of:<ul>\n<li>Accounting fundamentals &amp; journal entries</li>\n<li>Financial statements</li>\n<li>Basic GST, TDS, Income Tax concepts</li>\n<li>Excel (comfortable with formulas, basic analysis)</li>\n<li>Tally/ERP or willingness to learn company-specific software</li>\n</ul>\n</li>\n<li>Ability to prepare basic projections, analysis reports, and reconciliations (training will be provided)</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Strong attention to detail and analytical ability</li>\n<li>Good communication skills (written &amp; verbal)</li>\n<li>Ability to understand, document, and explain financial assumptions</li>\n<li>Willingness to learn valuation, ROC documentation, and statutory procedures</li>\n<li>Ability to work independently and as part of a team</li>\n<li>High level of integrity and responsibility</li>\n</ul>\n<h3>Added Advantage (Not Mandatory)</h3>\n<ul>\n<li>Internship experience in Accounting/Finance/Audit</li>\n<li>Exposure to financial modelling or analysis during academics</li>\n<li>Familiarity with corporate compliance terms (ROC, resolutions, meetings)</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Accounting",
            "Finance",
            "Excel"
        ],
        "summary": "MCom fresher sought for an Accountant role focusing on share issues, projections, and statutory documentation. Must have strong academic understanding and basic technical skills."
    },
    {
        "job_title": "Business Associate Intern",
        "company": "Waib3 Technologies (Opc) Pvt. Ltd",
        "url": "https://technopark.org/job-details/25442",
        "location": "Technopark",
        "closing_date": "09 Dec 2025",
        "job_description": "<h2>Business Associate Intern</h2>\n<p><strong>Company:</strong> Waib3 Technologies (OPC) Pvt. Ltd\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Contact Email:</strong> careers@waib3tech.com\n<strong>Job Published:</strong> 26, Nov 2025\n<strong>Closing Date:</strong> 09, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Do you thrive on innovation and possess the tech skills and initiative needed to build successful business relationships? This is your opportunity to kickstart a dynamic IT career with Waib3 Technologies!</p>\n<h3>About Us</h3>\n<p>Waib3 Tech is a forward-thinking organization revolutionizing the IT landscape with cutting-edge development and services that empower businesses to thrive in a digital-first world. We are built on a foundation of innovation, strategic excellence, and a passion for creating impactful digital solutions.</p>\n<h3>What You'll Do</h3>\n<ul>\n<li>Assist in developing and implementing business strategies and growth plans.</li>\n<li>Conduct market research and competitor analysis to identify new opportunities.</li>\n<li>Support client acquisition, communication, and relationship management.</li>\n<li>Collaborate with cross-functional teams to streamline business operations.</li>\n<li>Prepare reports, presentations, and performance analyses for internal review.</li>\n<li>Participate in brainstorming sessions and contribute creative business ideas.</li>\n<li>Handle day-to-day administrative and project support activities.</li>\n</ul>\n<h3>Qualifications &amp; What We're Looking For</h3>\n<ul>\n<li>Final-year Engineering/MBA students or recent graduates with a B.Tech or Master’s degree in Business Administration, Marketing, Management, or related fields.</li>\n<li>Strong communication and interpersonal skills.</li>\n<li>Good analytical and problem-solving abilities.</li>\n<li>Proficiency in MS Office (Excel, PowerPoint, Word).</li>\n<li>Enthusiastic learner with a proactive and positive attitude.</li>\n<li>Immediate joiners preferred.</li>\n</ul>\n<h3>Internship Details</h3>\n<ul>\n<li><strong>Duration:</strong> Up to 6 Months</li>\n<li><strong>Stipend:</strong> As per company policy</li>\n<li><strong>Pre-Placement Opportunity:</strong> Based on performance</li>\n<li><strong>Certificate:</strong> Provided upon successful completion of internship</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li><strong>Learning &amp; Development:</strong> Training and professional development opportunities.</li>\n<li><strong>Dynamic Work Culture:</strong> A workplace that values curiosity, creativity, and continuous improvement.</li>\n<li><strong>Live Exposure:</strong> Hands-on business and corporate operations experience.</li>\n<li><strong>Networking:</strong> Connect with global C-level executives and stakeholder profiles.</li>\n<li><strong>Pre-Placement Offer (PPO):</strong> Opportunity based on performance.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>If you’re eager to gain hands-on experience in the IT industry and are motivated to learn and grow, we’d be happy to hear from you!</p>\n<ul>\n<li><strong>Apply through Indeed:</strong> <a href=\"link_to_indeed_application\">Apply Here</a></li>\n<li><strong>For Detailed Job Description:</strong> <a href=\"link_to_JD\">JD FOR BA (intern)</a></li>\n</ul>\n<p><strong>Note:</strong> Applications are reviewed on a rolling basis. Shortlisted candidates will be contacted for an interview and/or assessment. Final selections are based on communication skills, business understanding, and enthusiasm for learning and growth.</p>",
        "tags": [
            "Internship",
            "Business Development",
            "Market Research",
            "Client Relationship Management"
        ],
        "summary": "Seeking a Business Associate Intern to assist with strategy, market research, and client relations. Opportunity for pre-placement offers based on performance."
    },
    {
        "job_title": "PHP DEVELOPER (0-3)",
        "company": "Aadiltech Solutions Pvt. Ltd",
        "url": "https://technopark.org/job-details/25441",
        "location": "Technopark",
        "closing_date": "02 Dec 2025",
        "job_description": "<h2>PHP Developer</h2>\n<p><strong>Company:</strong> AADILTECH SOLUTIONS PVT. LTD.\n<strong>Location:</strong> Kundara, Kollam, 691501\n<strong>Website:</strong> https://aadiltech.com</p>\n<p><strong>Job Published:</strong> 26, Nov 2025\n<strong>Closing Date:</strong> 02, Dec 2025\n<strong>Contact Email:</strong> hr@aadiltech.com</p>\n<h2>Responsibilities and Qualifications:</h2>\n<ul>\n<li>Understanding of fully synchronous behavior of PHP.</li>\n<li>Knowledge of object-oriented PHP programming.</li>\n<li>Knowledge of MySQL, web services, JavaScript/jQuery, CSS, and AJAX.</li>\n<li>Strong knowledge of MySQL databases and SQL commands.</li>\n<li>Experience with web applications.</li>\n<li>Ability to work in a target-oriented environment.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ul>\n<li>Understanding of fully synchronous behavior of PHP.</li>\n<li>Knowledge of object-oriented PHP programming.</li>\n<li>Knowledge of MySQL, web services, JavaScript/jQuery, CSS, and AJAX.</li>\n<li>Strong knowledge of MySQL databases and SQL commands.</li>\n<li>Experience with web applications.</li>\n<li>Ability to work in a target-oriented environment.</li>\n</ul>",
        "tags": [
            "0-3 Years",
            "PHP",
            "MySQL",
            "JavaScript"
        ],
        "summary": "Seeking a PHP Developer with knowledge of object-oriented PHP, MySQL, and web technologies. Must be able to work in a target-oriented environment."
    },
    {
        "job_title": "Team Lead - AI",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25440",
        "location": "Technopark",
        "closing_date": "06 Dec 2025",
        "job_description": "<h2>Team Lead - AI</h2>\n<p><strong>Company:</strong> TECHVANTAGE SYSTEMS (P) Ltd\n<strong>Locations:</strong>\n*   Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\n*   2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum , 695581\n<strong>Website:</strong> http://www.techvantagesystems.com\n<strong>Contact Email:</strong> jobs@techvantagesystems.com\n<strong>Job Published:</strong> 26, Nov 2025\n<strong>Closing Date:</strong> 06, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Techvantage is a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and Autonomous Intelligent Systems. We build intelligent products that redefine industries and deliver exceptional value through cutting-edge AI technologies. Our mission is to design solutions that are not only powerful but also seamless, intuitive, and delightful to use.</p>\n<h3>About the Role</h3>\n<p>We’re looking for a Team Lead - AI who can take charge of AI product initiatives and lead a cross-functional team of engineers, data scientists, and innovators. You’ll be the bridge between business goals and technical execution — ensuring your team delivers intelligent, scalable, and high-performing AI products. This role is ideal for someone who enjoys both strategic leadership and hands-on contribution, with the ability to guide teams through vision, collaboration, and excellence.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead and mentor a team of developers, data engineers, and AI specialists.</li>\n<li>Translate business objectives into actionable product roadmaps and technical tasks.</li>\n<li>Drive the development and deployment of AI-based products and features.</li>\n<li>Ensure timely delivery, code quality, and technical excellence across projects.</li>\n<li>Collaborate with stakeholders across functions — Product, Design, and Delivery.</li>\n<li>Identify opportunities for innovation and process improvement within the team.</li>\n<li>Foster a culture of accountability, curiosity, and continuous learning.</li>\n</ul>\n<h3>What We’re Looking For</h3>\n<ul>\n<li><strong>Experience:</strong> 5–8 years of experience in software or AI product development.</li>\n<li><strong>AI Experience:</strong> At least 2 years of hands-on experience with AI-driven applications or solutions.</li>\n<li><strong>Leadership:</strong> Proven experience leading teams or managing project deliverables.</li>\n<li><strong>Technical Skills:</strong><ul>\n<li>Proficiency in Python.</li>\n<li>Knowledge of AI frameworks such as TensorFlow, PyTorch, or Scikit-learn.</li>\n<li>Strong understanding of data pipelines, APIs, and cloud environments (AWS/Azure/GCP).</li>\n</ul>\n</li>\n<li><strong>Soft Skills:</strong> Excellent communication, planning, and team leadership skills.</li>\n<li><strong>Mindset:</strong> A growth mindset with a passion for mentoring and innovation.</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Exposure to Generative AI, NLP, or Computer Vision.</li>\n<li>Experience integrating AI solutions into production environments.</li>\n<li>Familiarity with Agile/Scrum methodologies.</li>\n</ul>\n<h3>Why Join Techvantage.ai</h3>\n<ul>\n<li>Lead a talented, passionate team building real-world AI products.</li>\n<li>Work in a culture that values innovation, integrity, and impact.</li>\n<li>Collaborate on projects that push the limits of what AI can do.</li>\n<li>Competitive compensation, learning opportunities, and a flexible work model.</li>\n</ul>",
        "tags": [
            "5-8 Years",
            "Python",
            "AI Frameworks",
            "Cloud Environments"
        ],
        "summary": "Lead AI product initiatives, guiding a team to develop intelligent, scalable AI products. Requires 5-8 years of experience, Python proficiency, and leadership skills."
    },
    {
        "job_title": "Senior HRBP",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/25439",
        "location": "Technopark",
        "closing_date": "05 Jan 2026",
        "job_description": "<h2>Senior HR Business Partner</h2>\n<p><strong>Company:</strong> Arch Global Services India\n<strong>Location:</strong> Trivandrum, Kerala (with HR coverage for Pune)\n<strong>Contact Email:</strong> talentsuccess@talent500.co\n<strong>Closing Date:</strong> January 5, 2026\n<strong>Published Date:</strong> November 26, 2025</p>\n<h3>About Arch:</h3>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in over a dozen countries, providing insurance, reinsurance, and mortgage insurance worldwide. We are recognized as an innovative partner and dependable risk manager, backed by decades of fresh ideas and solid results. As a part of the S&amp;P 500, Arch possesses the scale and capital strength to maintain its market-leading position in specialty insurance.</p>\n<h3>Role Overview:</h3>\n<p>We are seeking a proactive and versatile Senior HR Business Partner to establish and lead our Human Resources function for our new operations in India. Based in Trivandrum, this role will also extend HR coverage to our Pune location. As a foundational member of the team, you will ensure our HR practices align with Indian laws and global standards, fostering a compliant, ethical, and high-performing work culture. You will play a key part in shaping company culture, building high-performing teams, and ensuring compliance with Indian labor laws and HR best practices.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Partner with the Corporate HR team to develop and execute a holistic people strategy.</li>\n<li>Serve as the local HR leader for India, aligning local HR strategy with global business goals and frameworks.</li>\n<li>Build a positive and inclusive workplace culture and develop employee engagement initiatives.</li>\n<li>Act as a trusted advisor to employees and managers on people-related matters.</li>\n<li>Support employee development plans, training initiatives, and L&amp;D programs.</li>\n<li>Ensure 100% compliance with Indian labor laws, statutory obligations, and HR audits, including the Factories Act, Shops &amp; Establishments Act, PF, ESI, Gratuity, and POSH regulations.</li>\n<li>Oversee HR audits, inspections, and statutory filings in coordination with legal and finance teams.</li>\n<li>Develop and monitor internal controls, documentation, and processes for compliance integrity.</li>\n<li>Design, implement, and regularly update HR policies and SOPs to align with Indian labor law and company values.</li>\n<li>Serve as a trusted advisor to senior leadership on organizational design, talent management, and risk mitigation.</li>\n<li>Leverage data and analytics to design innovative people solutions.</li>\n<li>Manage a direct report and work closely with a 3rd party HR Operations/recruitment provider.</li>\n<li>Apply laws and policies to employee relations issues for favorable outcomes.</li>\n<li>Review multiple data sources and prepare/present concise analyses.</li>\n<li>Experience in training, facilitation, and team building is necessary.</li>\n<li>Partner globally and leverage centers of expertise.</li>\n<li>Navigate Workday and similar HR Information Systems.</li>\n<li>Ensure compliance with all applicable labor laws, including Factories Act, Shops &amp; Establishments Act, PF, ESI, Gratuity, and POSH regulations.</li>\n<li>Oversee HR audits, inspections, and statutory filings in coordination with legal and finance teams.</li>\n<li>Develop and monitor internal controls, documentation, and processes to maintain compliance integrity.</li>\n<li>Design, implement, and regularly update HR policies and SOPs to align with Indian labor law and company values.</li>\n</ul>\n<h3>Qualifications and Skills:</h3>\n<ul>\n<li>Bachelor's or Master's degree in Human Resources, Business Administration, or a related field.</li>\n<li>8-10 years of progressive HR experience; prior experience in setting up HR systems is a plus.</li>\n<li>Strong knowledge of Indian labor laws and HR compliance.</li>\n<li>Excellent interpersonal, communication, and conflict resolution skills.</li>\n<li>Proactive, hands-on, and comfortable working in a dynamic, evolving environment.</li>\n<li>Experience in planning, implementation, and evaluation of organizational changes.</li>\n<li>Experience leading people and large-scale projects.</li>\n<li>Certifications in labor law, HR compliance, or governance (e.g., SHRM-CP, LL.B.) are preferred.</li>\n<li>Experience managing multi-location or multi-state HR operations in India.</li>\n<li>High level of integrity, discretion, and ethical judgment.</li>\n<li>Stay updated on labor laws, regulations, and industry trends.</li>\n<li>Computer fluency, MS Office.</li>\n<li>Fluent in English.</li>\n</ul>\n<h3>Reporting Structure:</h3>\n<ul>\n<li>Reports to the Senior Vice President Corporate HR.</li>\n</ul>",
        "tags": [
            "8-10 Years",
            "Indian Labor Law",
            "HR Compliance",
            "Workday"
        ],
        "summary": "Senior HRBP to establish and lead India's HR function, ensuring compliance with local laws and global standards. Role involves culture building, talent management, and HR strategy execution."
    },
    {
        "job_title": "Receptionist And Office Assistant",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/25438",
        "location": "Technopark",
        "closing_date": "05 Jan 2026",
        "job_description": "<h2>Receptionist And Office Assistant</h2>\n<p><strong>About Arch:</strong></p>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<p><strong>Location:</strong></p>\n<p>Arch Global Services India\n4th Floor, Niagara Building\nTechno Park Phase-3\nTrivandrum, Kerala, 695583</p>\n<p><strong>Contact Email:</strong> talentsuccess@talent500.co</p>\n<p><strong>Closing Date:</strong> 05, Jan 2026\n<strong>Job Published:</strong> 26, Nov 2025</p>\n<h2>Job Description:</h2>\n<p>We are seeking a professional, organized, and welcoming Reception &amp; Office Assistant to be the first point of contact for our office and provide essential administrative support to our team. This role is ideal for someone who thrives in a fast-paced environment, enjoys helping others, is eager to learn and grow, and takes pride in creating a positive office experience for employees and visitors alike.</p>\n<h2>Tasks / Responsibilities:</h2>\n<ul>\n<li>Serve as the first point of contact for all visitors, guests, and callers, providing a warm and professional welcome.</li>\n<li>Answer, screen, and direct phone calls; manage incoming mail, packages, and deliveries.</li>\n<li>Provide administrative support to leadership and teams, including scheduling meetings, preparing documents, and managing correspondence.</li>\n<li>Coordinate meeting logistics and event planning support.</li>\n<li>Maintain office organization by ordering supplies, managing inventory, and coordinating with vendors for services and maintenance.</li>\n<li>Ensure common areas are clean, organized, and stocked to create a professional and inviting environment.</li>\n<li>Assist with employee onboarding by preparing welcome materials and helping with workstation setup.</li>\n<li>Support expense processing, invoice tracking, and light procurement tasks.</li>\n<li>Perform general clerical duties such as filing, scanning, copying, and maintaining records.</li>\n<li>Assist in planning and coordinating internal meetings, celebrations, and client visits.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ul>\n<li>Proven experience in an administrative, receptionist, or office assistant role.</li>\n<li>Exceptional interpersonal and communication skills, especially with the English language; professional demeanor.</li>\n<li>Strong organizational skills and attention to detail.</li>\n<li>Ability to multitask, prioritize, and adapt in a dynamic work environment.</li>\n<li>Proficiency in Microsoft Office Suite (Word, Excel, Outlook) and familiarity with basic office equipment.</li>\n</ul>\n<h2>Education / Experience:</h2>\n<ul>\n<li>Degree Level Education (humanities or business degree preferred).</li>\n<li>2/3 years’ experience working in a corporate environment, ideally in a GCC or similar.</li>\n</ul>",
        "tags": [
            "2-3 Years",
            "Receptionist",
            "Administrative Support",
            "Microsoft Office"
        ],
        "summary": "Seeking a Reception & Office Assistant for Arch Global Services. Responsibilities include visitor reception, administrative support, and office organization. Requires 2-3 years of corporate experience and strong communication skills."
    },
    {
        "job_title": "Associate - Insurance operations",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/25437",
        "location": "Technopark",
        "closing_date": "05 Jan 2026",
        "job_description": "<h2>Associate - Insurance Operations</h2>\n<p><strong>About Arch:</strong></p>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<p>We are looking for a proactive and detail-oriented Insurance Operations Associate to support policy administration processes across various lines of businesses. This role is ideal for professionals with foundational experience in insurance operations who are ready to take ownership of tasks, collaborate with cross-functional teams, and contribute to service excellence.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Assist in processing policy lifecycle activities such as endorsements, renewals, cancellations, and quotes</li>\n<li>Perform accurate data entry and validation to maintain high standards of data integrity</li>\n<li>Coordinate with underwriters and internal teams to ensure timely and accurate task execution</li>\n<li>Maintain records of policy transactions and communications for audit readiness</li>\n<li>Support process documentation and reporting activities as needed</li>\n<li>Adhere to company policies, regulatory guidelines, and service-level expectations</li>\n</ul>\n<p><strong>Location:</strong></p>\n<p>Arch Global Services India\n4th Floor, Niagara Building\nTechno Park Phase-3\nTrivandrum, Kerala, 695583</p>\n<p><strong>Contact Email:</strong></p>\n<p>talentsuccess@talent500.co</p>\n<p><strong>Closing Date:</strong></p>\n<p>05, Jan 2026</p>\n<p><strong>Job Published:</strong></p>\n<p>26, Nov 2025</p>",
        "tags": [
            "0-2 Years",
            "Policy Administration",
            "Data Entry",
            "Insurance Operations"
        ],
        "summary": "Seeking a detail-oriented Insurance Operations Associate to support policy administration. Responsibilities include data entry, task coordination, and record maintenance for service excellence."
    },
    {
        "job_title": "Legal Counsel & Company Secretary",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/25436",
        "location": "Technopark",
        "closing_date": "05 Jan 2026",
        "job_description": "<h2>Legal Counsel &amp; Company Secretary</h2>\n<p><strong>Company:</strong> Arch Global Services India</p>\n<p><strong>Location:</strong> 4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583</p>\n<p><strong>Website:</strong> https://www.archgroup.com</p>\n<p><strong>Contact Email:</strong> talentsuccess@talent500.co</p>\n<p><strong>Job Published:</strong> 26, Nov 2025</p>\n<p><strong>Closing Date:</strong> 05 Jan 2026</p>\n<h3>About Arch:</h3>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h3>About The Role:</h3>\n<p>We are seeking a qualified Legal Counsel &amp; Company Secretary to lead legal, compliance, and corporate governance matters for our India entity. This role will be responsible for providing strategic legal advice, ensuring compliance with applicable Indian laws, and fulfilling all statutory obligations under the Companies Act, SEBI (if applicable), FEMA, and other regulatory requirements. This role will report into the group legal function in the United States.</p>\n<h3>Corporate &amp; Commercial (80% of scope):</h3>\n<ul>\n<li>Provide practical legal advice to a newly established Indian subsidiary of a global insurance company on a broad variety of legal matters, including advising all functional areas within the Company, such as HR, Finance and Operations.</li>\n<li>Draft, review and negotiate a range of commercial contracts including facilities, service providers and intercompany service agreements.</li>\n<li>Partner with various stakeholders to identify, evaluate and address legal and regulatory risks; monitor and track relevant federal, state and local legislation applicable to the Company.</li>\n<li>Support cross-functional teams (HR, Finance, Operations) on legal and compliance matters.</li>\n<li>Provide training to the business on applicable legal and contractual issues.</li>\n<li>Work on other projects and corporate initiatives as assigned.</li>\n</ul>\n<h3>Company Secretarial and Compliance (20% of scope):</h3>\n<ul>\n<li>Serve as Company Secretary at all Company board and committee meetings, including primary responsibility for scheduling, preparing board agendas and materials, and minute keeping.</li>\n<li>Maintenance of statutory books, registers and important Company records, ensuring accuracy and completeness.</li>\n<li>Ensure the Company adheres to the Companies Act, 2013, and related SEBI, MCA and RBI regulations, including by filing annual returns and forms with the appropriate authorities.</li>\n<li>\n<p>Serve as Company Compliance Officer for Arch group purposes, including managing quarterly compliance reporting; serving as liaison for conflicts of interest, overseeing Arch group required compliance training and other tasks as directed from time to time.</p>\n</li>\n<li>\n<p>Role will require flexibility to travel across Arch’s India office locations (up to 25%), with potential for occasional international travel.</p>\n</li>\n</ul>\n<h3>Academic Qualifications:</h3>\n<ul>\n<li>Member in good standing of the Institute of Company Secretaries of India (ICSI).</li>\n<li>LLB (Bachelor of Law) (5-year law degree post 12th year qualification i.e. either a BA LLB or a BBA LLB qualification) (from accredited &amp; recognised universities such as national law universities in India).</li>\n<li>LLM (Master of Law) preferred.</li>\n</ul>\n<h3>Experience Requirements:</h3>\n<ul>\n<li>At least 10+ years of relevant post qualification experience combining corporate, commercial, employment law, and company secretarial experience.</li>\n<li>Experience with US publicly traded companies and related affiliate matters; highly preferred if experience is in multi-national financial services or insurance companies.</li>\n<li>Solid law firm or in-house experience in a regional or global company with a focus on commercial topics.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Excellent communication and interpersonal skills to collaborate effectively with business clients at all levels, attorneys, and external stakeholders.</li>\n<li>Experience serving as part of a collaborative leadership team with ability to prioritize multiple initiatives as needed.</li>\n<li>Experience and capability of supporting and serving as a trusted legal and business advisor.</li>\n<li>Pragmatic and solution-oriented mindset with ability to work independently and proactively in a matrixed, global Company.</li>\n<li>Excellent communication and relationship building skills, both written and oral, with the ability to write concisely with precision and clarity.</li>\n</ul>",
        "tags": [
            "10+ Years",
            "Company Secretary",
            "Corporate Law",
            "Compliance"
        ],
        "summary": "Seeking a Legal Counsel & Company Secretary for Arch India to manage legal, compliance, and governance. Requires 10+ years experience in corporate law and company secretarial duties."
    },
    {
        "job_title": "Senior Associate - Claims",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/25435",
        "location": "Technopark",
        "closing_date": "05 Jan 2026",
        "job_description": "<h2>Senior Associate - Claims</h2>\n<p><strong>Company:</strong> Arch Global Services India\n<strong>Location:</strong> 4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583\n<strong>Website:</strong> https://www.archgroup.com\n<strong>Contact Email:</strong> talentsuccess@talent500.co\n<strong>Job Published:</strong> 26,Nov 2025\n<strong>Closing Date:</strong> 05,Jan 2026</p>\n<h3>About Arch</h3>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h3>About the Job:</h3>\n<p>We are seeking an experienced and detail-oriented Senior Claims Operations Associate to lead and support Claims processes across multiple lines of business. This role involves overseeing operational activities, mentoring junior team members, and driving service excellence through data-driven insights and process improvements.</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Oversee Claims lifecycle activities including loss setup, recoveries, payments, and documentation.</li>\n<li>Support and guide junior team members in task execution and issue resolution.</li>\n<li>Monitor and track operational KPIs and service-level metrics; generate periodic reports for leadership review.</li>\n<li>Collaborate with Claims handlers, adjusters, underwriters, and cross-functional teams to ensure timely and accurate processing.</li>\n<li>Ensure compliance with regulatory guidelines and internal policies.</li>\n<li>Identify process gaps and contribute to continuous improvement initiatives.</li>\n<li>Maintain audit-ready documentation and support internal/external audits.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong understanding of insurance operations and end-to-end Claims workflows.</li>\n<li>Experience in mentoring or supervising team members.</li>\n<li>Proficiency in MS Office tools and reporting platforms; familiarity with Claims or policy administration systems.</li>\n<li>Analytical mindset with the ability to interpret data and drive insights.</li>\n<li>Excellent communication and stakeholder management skills.</li>\n<li>High level of professionalism and discretion in handling sensitive information.</li>\n</ul>\n<h3>Education / Experience:</h3>\n<ul>\n<li>Graduate in any discipline; insurance certifications preferred.</li>\n<li>4+ years of experience in insurance operations, with a focus on Claims.</li>\n<li>Experience in KPI tracking, reporting, and team coordination.</li>\n<li>Willingness to work in night or afternoon shifts as required.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Claims Operations",
            "Insurance",
            "KPI Tracking"
        ],
        "summary": "Senior Associate - Claims role overseeing insurance operations and supporting team members. Requires 4+ years of experience in claims with strong analytical and communication skills."
    },
    {
        "job_title": "Process Excellence Delivery Manager",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/25433",
        "location": "Technopark",
        "closing_date": "05 Jan 2026",
        "job_description": "<h2>Process Excellence Delivery Manager</h2>\n<p><strong>About Arch:</strong>\nArch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<p><strong>Position Summary:</strong>\nThe Process Excellence Delivery Manager will oversee and implement transformation initiatives to drive continual improvement within GSI. This role will ensure process, system and behavior improvement opportunities are identified, enhanced, and managed to meet the internal and external customer's business requirements.</p>\n<p>The individual in this role requires a deep understanding of Insurance Operations (i.e. Underwriting, Claims, Finance, &amp; Risk), their customer and business requirements, and how to efficiently embed and deploy lean transformation methodology at a senior leadership and frontline staff level to deliver sustainable results. This role will require close partnership with various stakeholders to drive effective execution and will play a pivotal role in executing the strategy as directed by the Deputy Chief Transformation Officer and Service Delivery Head of Global Insurance Operations at GSI.</p>\n<p><strong>Responsibilities and Accountabilities:</strong></p>\n<ul>\n<li>Work closely with the Deputy Chief Transformation officer &amp; Service Delivery Head of Global Insurance Operations at GSI to develop a transformation roadmap to meet the desired outcomes of GSI.</li>\n<li>Lead the execution of the Transformation roadmap with specific responsibility for initiatives and continuous improvement practices and routines.</li>\n<li>Guide the current state and future state, standard work design, implementation plan, along with defining the impact, value and prioritization of changes (in strong cooperation with business or service unit experts).</li>\n<li>Analyze customer &amp; business requirements through voice of the customer meetings; evaluating current processes and systems; and data collection and review.</li>\n<li>Conduct detailed root cause analysis by working closely with stakeholders to understand the issues originating in upstream/downstream process areas.</li>\n<li>Facilitate sessions using lean problem-solving techniques (i.e. Fishbone analysis) so all relevant stakeholders can communicate business critical issues in root cause language.</li>\n<li>Use a standard set of Lean/Problem Solving tools and analyses to develop insight, solutions and drive the consistent use of Lean standards in the delivery of agreed upon outcomes.</li>\n<li>Successfully implement identified improvements (i.e. Process, Tools, artifact enhancements, and performance transparency) that have the greatest value to enable an efficient end-to-end process as defined by the Deputy CTO and business/functional units.</li>\n<li>Work with business to ensure support structures in place to enable timely task completion and ensure the right people are aligned to the right task.</li>\n<li>Work with cross-functional team(s) for effective and timely issue resolution.</li>\n<li>Coach senior leaders to be effective in their roles as sponsors; and coach leaders at all levels on their role to support and sustain continuous improvement in their area including their own management practices and routines and capture performance standards.</li>\n<li>Embed routines/behaviors that drive activities to be completed timely and drive ongoing continuous improvement efforts.</li>\n</ul>\n<p><strong>Skills and Requirements:</strong></p>\n<ul>\n<li>Insurance knowledge and strong business acumen</li>\n<li>Excellent communication, listening and facilitation skills to effectively engage with stakeholders</li>\n<li>Effective decision making and critical thinking skills</li>\n<li>Strong analytical skills and ability to interpret data to drive business decisions.</li>\n<li>Ability to work independently and prioritize tasks in a fast-paced environment.</li>\n<li>Ability to work collaboratively in a team environment, and deliver effective consulting and coaching</li>\n<li>Strategic, Operational and Analytical thinking</li>\n<li>Cross-functional &amp; Matrix engagement</li>\n<li>Detail-oriented with a high level of personal accountability</li>\n<li>Lean or similar certification, or experience implementing continuous improvement principles in service environments/organizations (e.g., Business Agility, Lean management techniques, Six Sigma certification, etc.)</li>\n<li>Lean Transformation experience</li>\n<li>Strong organizational skills with high level of attention to detail</li>\n<li>High Emotional Quotient and Professionalism</li>\n<li>High degree of integrity and ability to handle confidential matters and sensitive situations with discretion</li>\n</ul>\n<p><strong>Education and Experience:</strong></p>\n<ul>\n<li>7+ years of experience as a Lean management leader with demonstrated success in leading end-to-end transformational changes.</li>\n<li>Experience in insurance industries and an understanding of operational management practices.</li>\n<li>Self-motivated, prone to action, autonomous and results-oriented with ability to lead multiple complex initiatives (short, mid and long-term) with impact.</li>\n<li>Proven track record developing and/or implementing Lean/continuous improvement initiatives.</li>\n<li>Demonstrated ability to effectively interpret data and measure performance.</li>\n<li>Ability to handle changing priorities and use good judgment when working in challenging situations.</li>\n<li>Ability to build a strong network of relationships across the company, quickly building credibility and gaining the trust and confidence of colleagues.</li>\n<li>A change agent, excellent at managing change both at an organizational level and at an individual level.</li>\n<li>Superior oral and written communication skills, as well as attention to detail while developing and presenting to senior leaders of the company.</li>\n<li>Deep knowledge and demonstrated application of change management principles, practices, methodologies and tools.</li>\n<li>Exceptional presentation, written and verbal communication skills with demonstrated ability to develop compelling messaging for diverse audiences.</li>\n<li>Demonstrate proficiency in project and program management.</li>\n<li>Demonstrate proficiency in data mining and analysis.</li>\n<li>Bachelor’s degree with related experience or Master’s in related field required. Work experience may substitute for education requirement.</li>\n<li>Professional Lean Certification (is a plus)</li>\n</ul>\n<p><strong>Contact Information:</strong>\nEmail: talentsuccess@talent500.co</p>\n<p><strong>Location:</strong>\n4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583</p>\n<p><strong>Closing Date:</strong>\n05, Jan 2026</p>",
        "tags": [
            "7+ Years",
            "Lean Management",
            "Insurance Operations",
            "Process Improvement"
        ],
        "summary": "Lead transformation initiatives to drive continuous improvement in GSI. Requires deep understanding of insurance operations and lean methodology for sustainable results."
    },
    {
        "job_title": "Senior Associate-Insurance Operation",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/25432",
        "location": "Technopark",
        "closing_date": "05 Jan 2026",
        "job_description": "<h2>Senior Associate - Insurance Operations</h2>\n<p><strong>Company:</strong> Arch Global Services India\n<strong>Location:</strong> 4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583\n<strong>Website:</strong> https://www.archgroup.com\n<strong>Contact Email:</strong> talentsuccess@talent500.co</p>\n<p><strong>Closing Date:</strong> 05, Jan 2026\n<strong>Job Published:</strong> 26, Nov 2025</p>\n<h3>About Arch:</h3>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h3>About the Job:</h3>\n<p>We are seeking a skilled and detail-oriented Insurance Operations Expert to join our dynamic team. This role is pivotal in managing the full lifecycle of insurance policies, ensuring operational accuracy, and supporting underwriters through efficient administrative processes. The ideal candidate will bring strong analytical skills, a collaborative mindset, and a commitment to delivering high-quality service.</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Manage end-to-end policy administration activities for North America Commercial Insurance business.</li>\n<li>Ensure data accuracy and integrity through meticulous entry, validation, and cleansing.</li>\n<li>Collaborate with underwriters, brokers, and internal teams to resolve queries and maintain workflow efficiency.</li>\n<li>Support junior team members and contribute to a culture of continuous learning.</li>\n<li>Identify and implement process improvements to enhance operational performance.</li>\n<li>Maintain compliance with regulatory standards and internal service-level agreements.</li>\n<li>Generate reports and track KPIs to monitor business performance.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Strong understanding of insurance policy workflows and administration.</li>\n<li>High attention to detail and commitment to data quality.</li>\n<li>Proficiency in systems such as CRM platforms, Excel, and reporting tools.</li>\n<li>Effective communication and stakeholder management skills.</li>\n<li>Ability to work independently and collaboratively in a fast-paced environment.</li>\n<li>Analytical thinking and problem-solving capabilities.</li>\n<li>Flexibility to adapt to changing priorities and shift schedules.</li>\n<li>Professional conduct and adherence to confidentiality standards.</li>\n</ul>\n<h3>Education / Experience:</h3>\n<ul>\n<li>Graduate in any discipline.</li>\n<li>2 to 5 years of experience in insurance operations or policy administration.</li>\n<li>Proficient in MS Office applications (Excel, Word, Outlook).</li>\n<li>Experience in managing reports, metrics, and team coordination.</li>\n<li>Willingness to work in night or afternoon shifts.</li>\n</ul>",
        "tags": [
            "2-5 Years",
            "Insurance Operations",
            "Policy Administration",
            "MS Excel"
        ],
        "summary": "Seeking an Insurance Operations Expert for policy administration, data accuracy, and underwriter support. Requires 2-5 years of experience and strong analytical skills."
    },
    {
        "job_title": "Associate - Finance & Accounts",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/25431",
        "location": "Technopark",
        "closing_date": "05 Jan 2026",
        "job_description": "<h2>Associate - Finance &amp; Accounts</h2>\n<p><strong>Company:</strong> Arch Global Services India</p>\n<p><strong>Location:</strong> 4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583</p>\n<p><strong>Website:</strong> https://www.archgroup.com</p>\n<p><strong>Contact Email:</strong> talentsuccess@talent500.co</p>\n<p><strong>Closing Date:</strong> January 5, 2026</p>\n<p><strong>Job Published:</strong> November 26, 2025</p>\n<h3>About Arch:</h3>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance, and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h3>About the Job:</h3>\n<p>The Billing Operation Executive is responsible for executing end-to-end Billing Operation activities for assigned accounts. This includes end-to-end payment processing with precision and speed. The role ensures accurate fund application, real-time reconciliation, and proactive discrepancy resolution—driving operational efficiency and stakeholder confidence. The BO Executive is expected to manage requests with accuracy and timeliness, contributing to overall operational excellence and client satisfaction.</p>\n<h2>Job Responsibilities:</h2>\n<ul>\n<li>Execute end-to-end billing activities including Payment processing, Reconciliation, Report preparation etc.</li>\n<li>Oversee complex queries, data verification, and cleansing activities to maintain superior data integrity.</li>\n<li>Manage and refine Billing operation processes; maintain assigned KPIs and generate accurate reports for management reflecting business performance and operational compliance.</li>\n<li>Guide and support entry-level operations specialists, fostering a learning environment and enhancing overall team competency.</li>\n<li>Identify areas for process improvement and collaborate with management and cross-functional teams to implement effective solutions.</li>\n<li>Operate within the operations and claims team, providing dedicated administrative support and ensuring timely completion of tasks.</li>\n<li>Maintain comprehensive records of billing activities, communications, and updates to support audit readiness and operational transparency.</li>\n<li>Liaise effectively with brokers, and internal teams to resolve queries, clarify requirements, and ensure smooth workflow execution.</li>\n<li>Perform all activities in accordance with regulatory requirements, company policies, and service-level agreements.</li>\n<li>Contribute to initiatives aimed at enhancing operational efficiency, service quality, and overall process optimization.</li>\n</ul>\n<h2>Preferred Skills:</h2>\n<ul>\n<li><strong>Billing Operation Expertise:</strong> Strong understanding of Billing operation activities including Account receivables, Payables, Reinsurance.</li>\n<li><strong>Data Accuracy &amp; Integrity:</strong> High attention to detail in data entry, validation, and cleansing to ensure reliable and audit-ready records.</li>\n<li><strong>Workflow Management:</strong> Ability to manage multiple tasks efficiently while meeting service-level agreements and internal KPIs.</li>\n<li><strong>System Proficiency:</strong> Familiarity with respective operation tools and reporting platforms.</li>\n<li><strong>Stakeholder Communication:</strong> Clear and professional communication skills for effective coordination with brokers, and internal teams.</li>\n<li><strong>Team Collaboration:</strong> Ability to work closely with Operations, Claims and other operational units to ensure smooth handoffs and timely processing.</li>\n<li><strong>Client-Focused Mindset:</strong> Understanding of client expectations and ability to support US counterparts in delivering high-quality service.</li>\n<li><strong>Issue Resolution:</strong> Capable of identifying discrepancies or process gaps and resolving them proactively.</li>\n<li><strong>Process Improvement:</strong> Analytical mindset to suggest and implement improvements in policy workflows and operational efficiency.</li>\n<li><strong>Mentoring Skills:</strong> Willingness to guide and support junior team members, contributing to team development and knowledge sharing.</li>\n<li><strong>Ownership &amp; Accountability:</strong> Strong sense of responsibility for assigned tasks and commitment to delivering accurate and timely results.</li>\n<li><strong>Flexibility:</strong> Ability to adapt to changing priorities and work in a dynamic, fast-paced environment.</li>\n<li><strong>Professional Conduct:</strong> Maintains confidentiality, compliance, and professionalism in all interactions and documentation.</li>\n</ul>\n<h2>Education / Experience:</h2>\n<ul>\n<li><strong>Educational Qualification:</strong> Graduation in any discipline is required.</li>\n<li><strong>Industry Experience:</strong> Prior work experience in a relevant industry is advantageous, preferably in insurance operations or policy administration.</li>\n<li><strong>Communication:</strong> Fluent in English language (Speaking, Reading, &amp; Writing).</li>\n<li><strong>Technical Proficiency:</strong> Computer skills are essential; proficiency in MS Office applications (Excel, Word, Outlook) is considered an added advantage.</li>\n<li><strong>Analytical &amp; Decision-Making Skills:</strong> Strong analytical abilities, attention to detail, and sound decision-making capabilities are crucial for handling complex policy tasks.</li>\n<li><strong>Work Flexibility:</strong> Must be willing to work in different shifts and adapt to dynamic operational requirements.</li>\n</ul>",
        "tags": [
            "0+ Years",
            "Billing Operations",
            "Reconciliation",
            "Data Integrity"
        ],
        "summary": "Execute end-to-end billing operations, including payment processing and reconciliation. Ensure data accuracy, resolve discrepancies, and contribute to operational excellence."
    },
    {
        "job_title": "FIELD MARKETING EXECUTIVE ( MALE CANDIDATES ONLY )",
        "company": "Hyz Ventures Intl (P) Ltd",
        "url": "https://technopark.org/job-details/25430",
        "location": "Technopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Field Marketing Executive (Male Candidates Only)</h2>\n<p><strong>Company:</strong> HYZ VENTURES INTL (P) Ltd\n<strong>Location:</strong> GE, Ground Floor, Padmanabham, Technopark, Karyavattom P.O, TVPM, 695581\n<strong>Website:</strong> http://www.hyzventures.com\n<strong>Contact Email:</strong> hr@hyzventures.com</p>\n<p><strong>Closing Date:</strong> December 15, 2025\n<strong>Job Published:</strong> November 26, 2025</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Deliver excellent customer service to our clients/vendors.</li>\n<li>Oversee various operational processes and improve them.</li>\n<li>Bring in new clients for our organization while retaining the existing ones. You will act as the key point of contact for our clients.</li>\n<li>Conduct service demonstrations and presentations to prospective clients, negotiate contracts, and finalize sales deals.</li>\n<li>Identify new sales opportunities through cold calling, emailing, and networking events and initiate contact with the right prospects.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>Plus Two/Any Degree</li>\n<li>Minimum 0-1 years of prior experience in a related field.</li>\n<li>Problem-solving mindset with ownership of outcomes.</li>\n<li>Strong communication skills for coordination across teams.</li>\n<li>Proficiency in handling a tab.</li>\n<li>Eager to learn and adapt to new challenges.</li>\n<li>Ability to work well in a team and collaborate effectively.</li>\n<li>Candidates from Trivandrum have preference.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Sales",
            "Customer Service",
            "Communication Skills"
        ],
        "summary": "Seeking a Field Marketing Executive to deliver customer service, acquire new clients, and conduct sales presentations. Requires strong communication and problem-solving skills."
    },
    {
        "job_title": "Senior UI Developer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25429",
        "location": "Technopark",
        "closing_date": "06 Dec 2025",
        "job_description": "<h2>Senior UI Developer at TECHVANTAGE SYSTEMS (P) Ltd</h2>\n<p><strong>Company:</strong> TECHVANTAGE SYSTEMS (P) Ltd</p>\n<p><strong>Locations:</strong>\n- Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\n- 2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.techvantagesystems.com</p>\n<p><strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Job Published:</strong> 26, Nov 2025\n<strong>Closing Date:</strong> 06, Dec 2025</p>\n<h3>Brief Description</h3>\n<p>Techvantage.ai is a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems. We create intelligent, user-first digital products that redefine industries through the power of AI and engineering excellence.</p>\n<h3>Role Overview</h3>\n<p>We are seeking a Senior ReactJS Developer with 4+ years of experience in building high-performance, scalable, and user-friendly web applications. This role will focus on creating modern front-end solutions that bring our AI-powered products to life with seamless and intuitive interfaces. You’ll work closely with product designers, back-end developers, and AI teams to deliver pixel-perfect UIs and a world-class user experience.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop advanced front-end applications using ReactJS and modern JavaScript/TypeScript frameworks.</li>\n<li>Translate UI/UX designs into high-quality code with attention to detail, responsiveness, and accessibility.</li>\n<li>Build reusable components and front-end libraries for future use.</li>\n<li>Optimize components for maximum performance across a wide range of devices and browsers.</li>\n<li>Collaborate with back-end developers to integrate APIs and ensure smooth data flow.</li>\n<li>Ensure code quality through unit testing, code reviews, and adherence to best practices.</li>\n<li>Stay updated with the latest trends in front-end development and actively contribute to improving UI architecture and tools.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>4+ years of experience in ReactJS and JavaScript/TypeScript development.</li>\n<li>Strong understanding of modern front-end build pipelines and tools (Webpack, Babel, Vite, etc.).</li>\n<li>Experience with state management libraries like Redux, Zustand, Recoil, or Context API.</li>\n<li>Deep knowledge of HTML5, CSS3, SCSS, and responsive design principles.</li>\n<li>Proficiency with REST APIs, GraphQL, and front-end integration patterns.</li>\n<li>Familiarity with testing frameworks such as Jest, React Testing Library, or Cypress.</li>\n<li>Experience working in an agile development environment using Git and CI/CD pipelines.</li>\n<li>Strong debugging and performance optimization skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>Experience in building dashboards or front-ends for AI, ML, or data-driven applications.</li>\n<li>Knowledge of Next.js or SSR (server-side rendering) frameworks.</li>\n<li>Familiarity with component libraries like Material UI, Chakra UI, or Tailwind CSS.</li>\n<li>Exposure to full-stack development with Node.js is a plus.</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>The opportunity to work on cutting-edge AI-powered platforms</li>\n<li>A collaborative, fast-paced product team with a focus on innovation</li>\n<li>Access to top-tier tools, resources, and growth opportunities</li>\n<li>Competitive compensation – no limits for the right candidate</li>\n</ul>",
        "tags": [
            "4+ Years",
            "ReactJS",
            "JavaScript",
            "TypeScript"
        ],
        "summary": "Seeking a Senior ReactJS Developer with 4+ years of experience to build scalable, user-friendly web applications for AI-powered products. Role involves designing, developing, and optimizing front-end solutions with a focus on UI/UX."
    },
    {
        "job_title": "ACCOUNTANT -BCom Graduate",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/25428",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Accountant - BCom Graduate</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai\n<strong>Job Published:</strong> 26, Nov 2025\n<strong>Closing Date:</strong> 10, Jan 2026</p>\n<h3>Brief Description</h3>\n<p>We are seeking a BCom Graduate with relevant accounting/finance certifications for an Accountant position in Technopark.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Participate in company share issue procedures, including company valuation, preparation of projections, and statutory document preparation for stakeholders and ROC.</li>\n<li>Communicate with Valuers to explain projections and the logic behind them.</li>\n<li>Prepare share issue offer documents, documentation for statutory meetings, resolution passing, and ROC intimations.</li>\n<li>Create realistic cash flow projections considering statutory requirements, payment priorities, and the company's receivables position.</li>\n<li>Prepare budgets and conduct periodical analysis against actual financial performance.</li>\n</ul>\n<h3>Qualifications &amp; Skills</h3>\n<p><strong>Required:</strong></p>\n<ul>\n<li>BCom Graduate (with relevant accounting/finance certifications)</li>\n<li>Strong academic understanding of Accounting, Finance, Taxation, and Corporate Laws.</li>\n<li>Proficiency in Accounting fundamentals &amp; journal entries.</li>\n<li>Knowledge of Financial statements.</li>\n<li>Basic understanding of GST, TDS, and Income Tax concepts.</li>\n<li>Comfortable with Excel (formulas, basic analysis).</li>\n<li>Experience with Tally/ERP or willingness to learn company-specific software.</li>\n<li>Ability to prepare basic projections, analysis reports, and reconciliations (training provided).</li>\n<li>Strong attention to detail and analytical ability.</li>\n<li>Good communication skills (written &amp; verbal).</li>\n<li>Ability to understand, document, and explain financial assumptions.</li>\n<li>Willingness to learn valuation, ROC documentation, and statutory procedures.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>High level of integrity and responsibility.</li>\n</ul>\n<p><strong>Preferred Certifications:</strong></p>\n<ul>\n<li>Tally Prime / Tally ERP</li>\n<li>GST Practitioner / GST Basics</li>\n<li>Advanced Excel / Data Analysis with Excel</li>\n<li>Financial Accounting / Corporate Accounting Certification</li>\n<li>SAP/Fundamentals of ERP</li>\n<li>Financial Modelling (basic)</li>\n</ul>\n<p><strong>Contact:</strong>\nSubmit your updated resume to careers@reizend.ai</p>",
        "tags": [
            "0-2 Years",
            "Accounting",
            "Finance",
            "Tally"
        ],
        "summary": "Seeking a BCom Graduate Accountant for share issue procedures and financial reporting. Must have strong accounting fundamentals and Excel skills."
    },
    {
        "job_title": "Senior Blockchain Developer",
        "company": "Storygame (P) Ltd",
        "url": "https://technopark.org/job-details/25427",
        "location": "Technopark",
        "closing_date": "13 Dec 2025",
        "job_description": "<h2>Senior Blockchain Developer</h2>\n<p><strong>Company:</strong> Storygame (P) Ltd\n<strong>Location:</strong> Ground floor, Tejaswini building, Technopark Phase 1 Kazakootam trivandrum kerala , 695581\n<strong>Website:</strong> https://storygame.io\n<strong>Contact Email:</strong> hr@storygame.io</p>\n<p><strong>Closing Date:</strong> 13, Dec 2025\n<strong>Job Published:</strong> 26, Nov 2025</p>\n<h3>Brief Description</h3>\n<p>Storygame (P) Ltd is seeking a highly skilled Senior Blockchain Developer with a minimum of 5 years of hands-on experience. The ideal candidate will possess strong technical expertise, excellent problem-solving skills, and proven leadership qualities to guide teams, mentor junior developers, and drive blockchain initiatives.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design, develop, and deploy blockchain-based applications, smart contracts, and related components.</li>\n<li>Lead end-to-end architecture and technical decisions for blockchain projects.</li>\n<li>Work closely with product managers, designers, and cross-functional teams to define project requirements.</li>\n<li>Review, optimize, and maintain existing blockchain codebases.</li>\n<li>Mentor and guide junior developers, fostering a high-performance engineering culture.</li>\n<li>Ensure security best practices and perform audits for smart contracts and blockchain applications.</li>\n<li>Research and evaluate new blockchain technologies, tools, and frameworks.</li>\n<li>Drive innovation by proposing improvements and new solutions aligned with business goals.</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>Minimum 5 years of experience as a Blockchain Developer.</li>\n<li>Strong knowledge of Ethereum, Solidity, Web3.js, EVM, or other major blockchain platforms.</li>\n<li>Experience with smart contract development, deployment, and testing tools (Hardhat, Truffle, Remix, Foundry, etc.).</li>\n<li>Strong understanding of cryptography, consensus mechanisms, and blockchain fundamentals.</li>\n<li>Proficiency in at least one backend language (Node.js, Go, Python, Rust, etc.).</li>\n<li>Experience working with DeFi, NFTs, or blockchain infrastructure (optional, but a plus).</li>\n<li>Proven leadership abilities — capable of leading projects, managing small teams, and making technical decisions.</li>\n<li>Excellent communication, analytical, and problem-solving skills.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with layer-2 solutions, cross-chain bridges, or zero-knowledge technologies.</li>\n<li>Contributions to open-source blockchain projects.</li>\n<li>Familiarity with cloud platforms (AWS, Azure, GCP).</li>\n<li>Experience in Agile/Scrum environments.</li>\n</ul>\n<h3>Why Join Us?</h3>\n<ul>\n<li>Opportunity to work on cutting-edge blockchain projects.</li>\n<li>Leadership role with room for growth.</li>\n<li>Collaborative and innovative work environment.</li>\n<li>Competitive salary and benefits.</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Blockchain",
            "Solidity",
            "Ethereum"
        ],
        "summary": "Seeking a Senior Blockchain Developer with 5+ years of experience to design, develop, and deploy blockchain applications. Role involves leadership, mentorship, and driving innovation in blockchain projects."
    },
    {
        "job_title": "ACCOUNTANT- MCom Fresher",
        "company": "Reizend (P) Ltd",
        "url": "https://technopark.org/job-details/25426",
        "location": "Technopark",
        "closing_date": "10 Jan 2026",
        "job_description": "<h2>Accountant Position at REIZEND (P) Ltd</h2>\n<p><strong>Company:</strong> REIZEND (P) Ltd\n<strong>Location:</strong> Technopark, Trivandrum\n<strong>Address:</strong> SBC Module 15, -2 Floor, Thejaswini Building, Technopark phase 1, Trivandrum, 695581\n<strong>Website:</strong> http://www.reizendretail.in\n<strong>Contact Email:</strong> careers@reizend.ai\n<strong>Job Published:</strong> 26, Nov 2025\n<strong>Closing Date:</strong> 10 Jan 2026</p>\n<p><strong>Role:</strong> Accountant - MCom Fresher</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Lead company share issue procedures, including company valuation, preparation of projections, and statutory document preparation for stakeholders and ROC.</li>\n<li>Communicate with valuers to explain projections and the logic behind them.</li>\n<li>Prepare share issue offer documents, documentation for company statutory meetings, resolution passing, and intimations with ROC.</li>\n<li>Create realistic cash flow projections considering statutory requirements, payment priorities, and the company's receivables position.</li>\n<li>Prepare budgets and conduct periodical analysis comparing them with actual financial performance.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<p><strong>Education/Qualification:</strong></p>\n<ul>\n<li>MCom Final-Semester (2026 Batch) or Recent MCom Graduate.</li>\n<li>Strong academic understanding of Accounting, Finance, Taxation, and Corporate Laws.</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li>Good working knowledge of:</li>\n<li>Accounting fundamentals &amp; journal entries</li>\n<li>Financial statements</li>\n<li>Basic GST, TDS, Income Tax concepts</li>\n<li>Excel (comfortable with formulas, basic analysis)</li>\n<li>Tally/ERP or willingness to learn company-specific software</li>\n<li>Ability to prepare basic projections, analysis reports, and reconciliations (training will be provided).</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul>\n<li>Strong attention to detail and analytical ability.</li>\n<li>Good communication skills (written &amp; verbal).</li>\n<li>Ability to understand, document, and explain financial assumptions.</li>\n<li>Willingness to learn valuation, ROC documentation, and statutory procedures.</li>\n<li>Ability to work independently and as part of a team.</li>\n<li>High level of integrity and responsibility.</li>\n</ul>\n<p><strong>Added Advantage (Not Mandatory):</strong></p>\n<ul>\n<li>Internship experience in Accounting/Finance/Audit.</li>\n<li>Exposure to financial modeling or analysis during academics.</li>\n<li>Familiarity with corporate compliance terms (ROC, resolutions, meetings).</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "Accounting",
            "Financial Projections",
            "Tally ERP"
        ],
        "summary": "Seeking an MCom Fresher Accountant in Technopark. Responsibilities include share issue procedures, financial projections, and statutory documentation. Must have strong accounting and finance fundamentals."
    },
    {
        "job_title": "AI Engineer",
        "company": "Techvantage Systems (P) Ltd",
        "url": "https://technopark.org/job-details/25425",
        "location": "Technopark",
        "closing_date": "06 Dec 2025",
        "job_description": "<h2>AI Engineer at TECHVANTAGE SYSTEMS (P) Ltd</h2>\n<p><strong>Company:</strong> TECHVANTAGE SYSTEMS (P) Ltd</p>\n<p><strong>Locations:</strong>\n- Module L1A, Level -1, Thejaswini, Technopark, Trivandrum\n- 2nd floor, Amstor House, Technopark campus, phase-1, Trivandrum, 695581</p>\n<p><strong>Website:</strong> http://www.techvantagesystems.com</p>\n<p><strong>Contact Email:</strong> jobs@techvantagesystems.com</p>\n<p><strong>Closing Date:</strong> 06, Dec 2025\n<strong>Job Published:</strong> 26, Nov 2025</p>\n<h3>About Techvantage.ai</h3>\n<p>Techvantage.ai is a next-generation technology and product engineering company at the forefront of innovation in Generative AI, Agentic AI, and autonomous intelligent systems. We build intelligent, cutting-edge solutions designed to scale and evolve with the future of artificial intelligence.</p>\n<h3>Job Overview</h3>\n<p>We are looking for an AI Engineer with 3+ years of hands-on experience in Artificial Intelligence/ML and a passion for innovation. This role is ideal for someone who thrives in a startup environment—fast-paced, product-driven, and full of opportunities to make a real impact. You will contribute to building intelligent, scalable, and production-grade AI systems, with a strong focus on Generative AI and Agentic AI technologies.</p>\n<h3>Roles and Responsibilities:</h3>\n<ul>\n<li>Build and deploy AI-driven applications and services, focusing on Generative AI and Large Language Models (LLMs).</li>\n<li>Design and implement Agentic AI systems—autonomous agents capable of planning and executing multi-step tasks.</li>\n<li>Collaborate with cross-functional teams including product, design, and engineering to integrate AI capabilities into products.</li>\n<li>Write clean, scalable code and build robust APIs and services to support AI model deployment.</li>\n<li>Own feature delivery end-to-end—from research and experimentation to deployment and monitoring.</li>\n<li>Stay current with emerging AI frameworks, tools, and best practices and apply them in product development.</li>\n<li>Contribute to a high-performing team culture and mentor junior team members as needed.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>3–6 years of overall software development experience, with 3+ years specifically in AI/ML engineering.</li>\n<li>Strong proficiency in Python, with hands-on experience in PyTorch, TensorFlow, and Transformers (Hugging Face).</li>\n<li>Proven experience working with LLMs (e.g., GPT, Claude, Mistral) and Generative AI models (text, image, or audio).</li>\n<li>Practical knowledge of Agentic AI frameworks (e.g., LangChain, AutoGPT, Semantic Kernel).</li>\n<li>Experience building and deploying ML models to production environments.</li>\n<li>Familiarity with vector databases (Pinecone, Weaviate, FAISS) and prompt engineering concepts.</li>\n<li>Comfortable working in a startup-like environment—self-motivated, adaptable, and willing to take ownership.</li>\n<li>Solid understanding of API development, version control, and modern DevOps/MLOps practices.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Generative AI",
            "Agentic AI",
            "Python"
        ],
        "summary": "Seeking an AI Engineer with 3+ years of experience in AI/ML, focusing on Generative and Agentic AI. This role involves building and deploying intelligent, scalable AI systems in a fast-paced environment."
    },
    {
        "job_title": "Network Security Engineer ( CCIE )",
        "company": "Kvaliteta Systems And Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/25424",
        "location": "Technopark",
        "closing_date": "03 Dec 2025",
        "job_description": "<h2>Network Security Engineer (CCIE)</h2>\n<p><strong>Company:</strong> Kvaliteta Systems and Solutions (P) Ltd\n<strong>Location:</strong> SBC 2207, 2nd floor, Yamuna Tower, Technopark Phase 3 campus, Trivandrum-695583\n<strong>Website:</strong> http://www.kvaliteta.in\n<strong>Contact Email:</strong> hr@kvaliteta.in</p>\n<p><strong>Publication Date:</strong> 26, Nov 2025\n<strong>Closing Date:</strong> 03, Dec 2025</p>\n<h3>About Us</h3>\n<p>Kvaliteta Systems and Solutions, located in Technopark, Trivandrum, is a leading global IT solutions provider. We specialize in a diverse range of services, including Digital Transformation, Private Cloud, Infrastructure, Security, and Software Development as a Service, empowering businesses to excel in the digital age with innovative technology solutions.</p>\n<p>We are looking for a Network Security Engineer who can design, implement and support large-scale network and security environments. The ideal candidate is strong in routing, switching, firewalls and service provider technologies, and can handle both project delivery and complex troubleshooting.</p>\n<p><strong>Experience:</strong> No minimum experience requirement\n<strong>Location:</strong> Technopark, Trivandrum. Ready to travel to client sites based on project requirements.\n<strong>Certification Required:</strong> CCIE Security or CCIE Service Provider Preferred</p>\n<h3>Job Responsibilities:</h3>\n<ul>\n<li>Design and deploy network and security solutions for enterprise and service provider environments</li>\n<li>Manage firewalls, VPNs, IPS, load balancers and related security platforms</li>\n<li>Handle L3 escalation support for network and security issues</li>\n<li>Perform configuration, optimization and capacity planning</li>\n<li>Work closely with internal teams and customers to understand requirements</li>\n<li>Prepare architecture documents, network diagrams and configuration standards</li>\n<li>Support migration, cutover and change management activities</li>\n<li>Ensure compliance with security policies and industry practices</li>\n<li>Monitor network performance and suggest improvements</li>\n</ul>\n<h3>Required Skills:</h3>\n<ul>\n<li>Strong knowledge of routing and switching (OSPF, BGP, MPLS, QoS)</li>\n<li>Experience with firewalls such as Palo Alto, Fortinet or Cisco ASA</li>\n<li>Knowledge of VPN technologies, IPS and identity access control</li>\n<li>Experience with SD-WAN / SASE Platforms</li>\n<li>Understanding of service provider platforms and scalable network designs</li>\n<li>Ability to troubleshoot complex issues independently</li>\n<li>Good documentation and communication skills</li>\n</ul>\n<h3>How to Apply:</h3>\n<p>Interested candidates are invited to send their resumes to hr@kvaliteta.in with the job title as the subject. Please include your current CTC, relevant experience, and notice period in the email.</p>",
        "tags": [
            "No minimum experience requirement",
            "CCIE Security",
            "Palo Alto",
            "BGP"
        ],
        "summary": "Seeking a Network Security Engineer to design and implement large-scale network and security solutions. Must have strong routing, switching, firewall, and troubleshooting skills."
    }
]