[
    {
        "job_title": "Customer Relationship Manager (CRM)",
        "company": "Mashuptech",
        "url": "https://infopark.in/company-jobs/details/21977/360",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>Job Description</h2>\n<p>MashupTech is seeking a <strong>Customer Relationship Manager (Female)</strong> to manage and nurture long-term relationships with domestic and international clients. The role requires strong communication skills, professionalism, and the ability to independently handle client interactions.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Serve as the primary point of contact for assigned clients</li>\n<li>Manage client communication via calls, emails, WhatsApp, and virtual meetings</li>\n<li>Build and maintain strong, long-term customer relationships</li>\n<li>Understand client needs and coordinate with internal technical teams</li>\n<li>Ensure smooth onboarding and ongoing client support</li>\n<li>Handle client concerns, feedback, and escalations professionally</li>\n<li>Maintain accurate client records and prepare periodic reports</li>\n</ul>\n<h2>Required Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>Minimum 3–5 years</strong> of experience in Customer Relationship Management</li>\n<li>Experience in handling international or premium clients</li>\n<li>Excellent English communication skills (verbal &amp; written)</li>\n<li>Strong interpersonal and relationship-building skills</li>\n<li>Ability to multitask and manage multiple clients efficiently</li>\n<li>Experience in IT services/software industry is an added advantage</li>\n</ul>\n<h2>Candidate Eligibility</h2>\n<ul>\n<li><strong>Strictly open to FEMALE candidates only</strong></li>\n<li>Prior experience with overseas clients (Middle East, Europe, US) is a plus</li>\n<li>Professional, confident, and customer-centric personality</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Competitive salary based on experience</li>\n<li>Performance-based incentives</li>\n<li>Career growth opportunities</li>\n<li>Supportive and professional work culture</li>\n<li>Exposure to international clients and projects</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Interested female candidates should send their resume to: <strong>career@mashuptech.in</strong>\n- <strong>Email Subject:</strong> Application – Customer Relationship Manager\n- <strong>Location:</strong> Infopark Phase 1, Kochi\n- <strong>Employment Type:</strong> Full-time</p>",
        "tags": [
            "3–5 Years",
            "Customer Relationship Management",
            "International Client Handling",
            "IT/Software Industry Experience"
        ],
        "summary": "MashupTech seeks a Customer Relationship Manager with 3–5 years experience to manage domestic/international clients. Requires strong communication and relationship-building skills, offering competitive salary and career growth."
    },
    {
        "job_title": "SAP Executive / SAP Consultant",
        "company": "Mashuptech",
        "url": "https://infopark.in/company-jobs/details/21978/360",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>Company:</strong> MashupTech\n<strong>Location:</strong> Infopark Phase 1, Kochi\n<strong>Employment Type:</strong> Full-time\n<strong>Experience Required:</strong> Minimum 2–5 Years\n<strong>Eligibility:</strong> Female Candidates Only</p>\n<h3>Job Description</h3>\n<p>MashupTech is hiring a skilled <strong>SAP Executive / SAP Consultant (Female)</strong> to support, implement, and manage SAP-based business processes for domestic and international clients. The ideal candidate should have hands-on SAP experience and the ability to work closely with clients and internal teams.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Handle SAP implementation, configuration, and support activities</li>\n<li>Work on SAP modules such as <strong>FICO / MM / SD / HCM</strong> (based on expertise)</li>\n<li>Understand business requirements and translate them into SAP solutions</li>\n<li>Coordinate with functional and technical teams</li>\n<li>Provide end-user support, training, and documentation</li>\n<li>Troubleshoot issues and ensure system stability</li>\n<li>Support enhancements, upgrades, and process improvements</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li>2–5 years of hands-on experience in SAP</li>\n<li>Strong knowledge in at least one SAP module (<strong>FICO / MM / SD / HCM</strong>)</li>\n<li>Good understanding of business processes and ERP workflows</li>\n<li>Excellent communication skills (English – verbal &amp; written)</li>\n<li>Ability to work independently and in a team environment</li>\n<li>SAP certification is an added advantage</li>\n</ul>\n<h3>Candidate Eligibility</h3>\n<ul>\n<li><strong>Strictly open to FEMALE candidates only</strong></li>\n<li>Experience with international clients/projects is a plus</li>\n<li>Professional, analytical, and solution-oriented mindset</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Competitive salary based on experience</li>\n<li>Performance-based incentives</li>\n<li>Career growth and SAP upskilling opportunities</li>\n<li>Supportive and professional work culture</li>\n<li>Exposure to enterprise-level SAP projects</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested <strong>female candidates only</strong> may send their resume to: <strong>career@mashuptech.in</strong>\n- <strong>Email Subject:</strong> Application – SAP Executive\n- <strong>Application Email:</strong> career@mashuptech.in</p>",
        "tags": [
            "2–5 Years",
            "SAP FICO",
            "SAP MM",
            "SAP SD"
        ],
        "summary": "MashupTech seeks an SAP Executive/Consultant with 2–5 years of experience in SAP modules (FICO/MM/SD/HCM) to manage business processes and support clients."
    },
    {
        "job_title": "Creative Designer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21980/312",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>Creative Designer</strong></p>\n<p>We are seeking a <strong>Creative Designer</strong> who demonstrates strong visual thinking, originality, and full ownership of their work. The ideal candidate will stay connected to marketing and design trends, think beyond briefs, and deliver high-quality visuals that enhance brand identity and audience engagement.</p>\n<p><strong>Key Responsibilities</strong>\n- Design engaging and high-quality creatives for branding, marketing, and promotional use\n- Create marketing assets (brochures, flyers, posters, social media creatives, website visuals, presentations, email campaigns)\n- Conceptualize ideas and translate them into clear visual communication\n- Own design deliverables from concept to final output\n- Ensure visual consistency across all brand touchpoints using brand guidelines\n- Manage multiple creative projects simultaneously while meeting timelines\n- Collaborate with Marketing teams, Creative Leads, and Project Managers on updates and revisions\n- Stay updated with design, branding, marketing trends, and creative tools\n- Use modern design tools to support ideation while maintaining originality and brand alignment\n- Maintain organized design files, versions, and documentation</p>\n<p><strong>Requirements</strong>\n- Diploma or Bachelor’s Degree in Graphic Design, Visual Arts, or related field\n- 2 to 4 years of professional experience in a creative or design role\n- Strong proficiency in Adobe Photoshop, Illustrator, InDesign, Premiere Pro, After Effects\n- Working knowledge of MS Office (PowerPoint, Word)\n- Basic understanding of HTML/CSS\n- Strong typography skills and layout/design principles\n- High attention to detail and strong visual judgment\n- Excellent verbal and written communication skills</p>\n<p><strong>Creativity, Ownership, and Mindset</strong>\n- Demonstrate quick, creative thinking and ownership of assigned work\n- Self-discipline in reviewing work before submission\n- Ability to accept feedback and iterate on designs efficiently\n- Confidence in presenting and explaining design concepts\n- Willingness to think beyond briefs and suggest innovative ideas</p>\n<p><strong>Portfolio Requirement</strong>\n- A strong portfolio is mandatory, showcasing branding, marketing creatives, and originality\n- Candidates must explain design intent, approach, and execution</p>\n<p><strong>Experience</strong>\n- 2 to 4 years of relevant industry experience</p>\n<p><strong>Benefits</strong>\n- Growth-driven environment with opportunities to lead, innovate, and upskill</p>\n<p><strong>Contact</strong>: Share your resume at <strong>careers@2basetechnologies.com</strong></p>",
        "tags": [
            "2-4 Years",
            "Adobe Creative Suite",
            "HTML/CSS",
            "Typography"
        ],
        "summary": "Creative Designer role requiring 2-4 years of branding/marketing experience. Must have Adobe tools proficiency, typography skills, and a strong portfolio."
    },
    {
        "job_title": "Sr.DevSecOps Engineer",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21981/312",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>Sr. DevSecOps Engineer</strong></p>\n<p>We are seeking a <strong>Senior DevSecOps Engineer</strong> to lead our cybersecurity, infrastructure automation, and DevSecOps practices as we transition to a secure, scalable, and modern engineering environment. This role will strengthen 2Base’s security posture, modernize pipelines, and foster a secure-by-design culture. You will collaborate with engineering, product, and leadership teams to ensure systems, applications, and cloud environments are secure, reliable, and future-ready.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Define, implement, and enforce security standards, policies, and best practices across cloud and on-prem environments.</li>\n<li>Conduct security risk assessments, vulnerability scans, penetration testing, and mitigation plans.</li>\n<li>Architect and enhance secure CI/CD pipelines with automated compliance and governance checkpoints.</li>\n<li>Promote a \"Security First\" culture across engineering teams.</li>\n<li>Monitor, detect, investigate, and respond to security threats, incidents, breaches, and anomalies.</li>\n<li>Develop Infrastructure-as-Code practices using Terraform, Ansible, and automation frameworks.</li>\n<li>Design secure cloud architectures on AWS, Azure, or GCP for scalable, compliant deployments.</li>\n<li>Build and secure containerized environments with Docker and Kubernetes.</li>\n<li>Implement secure monitoring, logging, SIEM, and alerting systems.</li>\n<li>Optimize system reliability, scalability, performance, and fault tolerance.</li>\n<li>Mentor DevOps engineers in secure development and operational excellence.</li>\n<li>Lead technical strategy, tool selection, and DevSecOps roadmap execution.</li>\n<li>Collaborate with BA, PM, and Engineering teams to align security and delivery goals.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li><strong>4–8 years</strong> of experience in DevOps, Cloud, or Infrastructure engineering with security exposure.</li>\n<li>Hands-on CI/CD tools (Jenkins, GitLab CI, GitHub Actions).</li>\n<li>Expertise in AWS, Azure, or GCP with secure architecture focus.</li>\n<li>Proficiency in Infrastructure-as-Code (Terraform, Ansible).</li>\n<li>Experience securing Docker and Kubernetes environments.</li>\n<li>Networking knowledge (LAN/WAN, firewalls, VPN, load balancers).</li>\n<li>Familiarity with security frameworks (OWASP, NIST, CIS Benchmarks).</li>\n<li>Monitoring/logging tools (Prometheus, Grafana, ELK, CloudWatch, SIEM).</li>\n<li>Scripting skills (Python, Bash, Shell).</li>\n<li>Strong troubleshooting, analytical, and communication skills.</li>\n</ul>\n<p><strong>Contact:</strong> Share your resume at <a href=\"mailto:careers@2basetechnologies.com\">careers@2basetechnologies.com</a></p>",
        "tags": [
            "4–8 Years",
            "Terraform",
            "Ansible",
            "AWS/Azure/GCP"
        ],
        "summary": "Lead cybersecurity and DevSecOps practices to modernize pipelines and ensure secure, scalable cloud environments. Requires 4–8 years of secure infrastructure and automation expertise."
    },
    {
        "job_title": "Senior Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21982/312",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>Senior Business Analyst</strong></p>\n<p>At 2Base, we are rebuilding the Business Analyst function into a world-class, product-minded, clarity-driven team. This role is <strong>not</strong> a documentation role, <strong>not</strong> a screen updater role, and <strong>not</strong> a support role. This is a core Business Analyst position responsible for functional modeling, system reasoning, requirement clarity, and building the foundation for correct development.</p>\n<p>As a Senior Business Analyst, you will be the functional brain of the project. You will ensure that the right problem is understood, broken down, analyzed, validated, clarified, communicated, and owned end-to-end. You will drive requirement precision, reduce rework, and enable confident and aligned delivery across teams.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead requirement workshops, client calls, and discovery discussions to understand business needs clearly.</li>\n<li>Ask deeper questions, challenge assumptions, and validate the true business intent behind every requirement.</li>\n<li>Convert ambiguous client inputs into structured, logical, and actionable functional understanding.</li>\n<li>Break large features into modules, workflows, components, and clear dependencies.</li>\n<li>Build strong system-level understanding involving APIs, integrations, data flow, and backend considerations.</li>\n<li>Translate business processes into functional logic that development teams can execute.</li>\n<li>Decompose requirements into use-case flows, system behaviors, edge cases, alternate paths, validation rules, and dependencies.</li>\n<li>Prepare high-quality documentation, including BRD, FRD, SRS, workflows, state diagrams, data-flow diagrams, API requirement specs, and acceptance criteria.</li>\n<li>Ensure all documentation is clear, logical, structured, testable, and ready for developers and QA to use.</li>\n<li>Collaborate closely with developers, architects, QA, and product owners to validate feasibility and align understanding.</li>\n<li>Ensure QA teams can derive test cases effectively from your functional logic and acceptance criteria.</li>\n<li>Communicate confidently with clients, handle requirement discussions smoothly, and clarify misunderstandings immediately.</li>\n<li>Push back politely on unclear or changing requirements and ensure final decisions are documented properly.</li>\n<li>Maintain requirement traceability throughout the lifecycle and ensure zero ambiguity during handover to development.</li>\n<li>Own the entire requirement lifecycle from discovery to development readiness with high accountability.</li>\n<li>Drive clarity across teams by ensuring every requirement is complete, validated, and logically consistent.</li>\n</ul>\n<h3>Required Skills &amp; Experience</h3>\n<ul>\n<li>Minimum 4+ years of core Business Analyst experience with strong analytical and system-level thinking.</li>\n<li>Ability to break down complex requirements into clear components, workflows, and functional logic.</li>\n<li>Excellent verbal and written communication with confidence in client interactions and clarifications.</li>\n<li>Proven experience in preparing SRS, BRD, FRD, workflows, and acceptance criteria with high clarity.</li>\n<li>Ability to challenge assumptions politely, ask the right questions, and ensure zero ambiguity.</li>\n<li>Strong collaboration experience with development, QA, architects, and cross-functional teams.</li>\n<li>Understanding of API behaviors, integrations, data flows, and multi-module system interactions.</li>\n<li>Ability to run requirement discussions, workshops, and independently lead discovery sessions.</li>\n<li>Exposure to SaaS, scalable products, automation, or AI-supported systems is an added advantage.</li>\n<li>Demonstrated ownership of requirements end-to-end, ensuring developer-ready and testable outputs.</li>\n<li>Not suitable for UI-only thinkers, passive communicators, template-based writers, or those relying on AI for answers.</li>\n<li>Success is defined by clear, testable requirements, zero rework, strong cross-team alignment, and confident communication.</li>\n<li>Candidates must align with 2Base’s structured thinking, clarity-driven culture, and transformation of the BA function.</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, Business, or related field</li>\n<li>4 to 8 years of experience as a Business Analyst or Product Analyst</li>\n<li>Experience in SaaS or scalable product environments</li>\n<li>Exposure to AI/Automation, integrations, or multi-module systems</li>\n<li>Ability to run independent client workshops</li>\n<li>Must have independently handled requirement ownership for at least one full project lifecycle</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "4+ Years",
            "SaaS",
            "API",
            "BRD/FRD/SRS"
        ],
        "summary": "Senior Business Analyst at 2Base drives functional modeling, system reasoning, and requirement clarity. Owns end-to-end requirements, collaborates with cross-functional teams, and ensures developer-ready outputs."
    },
    {
        "job_title": "Business Analyst",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21983/312",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>Business Analyst</strong></p>\n<p>The Business Analyst plays a key role in ensuring requirements are clearly understood, accurately documented, and traceable throughout the software development lifecycle. This role focuses on translating business and functional inputs into structured, standardized documentation that supports effective development, testing, and delivery. Working closely with business analysts, design teams, and technical stakeholders, the role ensures consistency, clarity, and alignment across all requirement artifacts.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Create Software Requirement Specifications (SRS) based on inputs from Core Business Analysts, stakeholder discussions, and requirement walkthroughs</li>\n<li>Prepare Business Requirement Documents (BRD) using approved templates while ensuring business intent and system behavior are clearly documented</li>\n<li>Participate in requirement discussions to understand business objectives, functional flows, dependencies, and assumptions before documentation</li>\n<li>Analyze requirements to identify gaps, ambiguities, and inconsistencies, and work with Core BAs to resolve them</li>\n<li>Document functional flows, business rules, and acceptance criteria where applicable to support development and QA teams</li>\n<li>Document wireframes, UI flows, validations, and UI specifications in collaboration with design and product teams</li>\n<li>Maintain change logs, version history, and document updates throughout the project lifecycle</li>\n<li>Create and manage traceability matrices linking business, functional, and technical requirements</li>\n<li>Maintain cross-references across BRD, SRS, UI, API, and related documentation</li>\n<li>Ensure documentation consistency, completeness, and alignment with approved scope and delivery timelines</li>\n<li>Ensure accurate and timely PMS updates with structured documentation details</li>\n<li>Support development, QA, UAT, and audit processes through clear, traceable, and up-to-date documentation</li>\n<li>Assist in requirement reviews, walkthroughs, and validation sessions with internal and client stakeholders</li>\n</ul>\n<h2>Requirements</h2>\n<h3>Required Skills and Experience</h3>\n<ul>\n<li>1 to 4 years of experience in Business Analysis documentation or related roles</li>\n<li>Strong experience in BRD and SRS creation</li>\n<li>Hands-on experience with documentation templates, standards, and version control</li>\n<li>Ability to document UI wireframes and functional flows clearly</li>\n<li>Working knowledge of APIs and system integrations for documentation purposes</li>\n<li>Experience with project management systems and documentation tools</li>\n<li>Strong attention to detail and ability to manage multiple documents in parallel</li>\n<li>Excellent written communication and stakeholder coordination skills</li>\n</ul>\n<h3>Minimum Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>A growth-driven environment with opportunities to lead, innovate, and upskill continuously.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@2basetechnologies.com</strong></p>",
        "tags": [
            "1-4 Years",
            "BRD/SRS Documentation",
            "UI/Functional Flow Documentation",
            "API/System Integration Knowledge"
        ],
        "summary": "The Business Analyst translates business needs into structured documentation, ensuring clarity and traceability across development, testing, and delivery processes. Requires 1-4 years of experience in BRD/SRS creation and UI/API documentation."
    },
    {
        "job_title": "Business Development Executive",
        "company": "2Base Technologies Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21984/312",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<p><strong>Business Development Executive</strong></p>\n<p>We are seeking a high-performing, self-driven <strong>Senior Business Development Executive</strong> to join <strong>2Base Technologies</strong>. In this role, you will drive revenue by generating leads, building client relationships, and managing the full sales cycle for IT services and digital solutions. This individual contributor position requires end-to-end ownership of sales processes, from prospecting to closure. If you thrive in technology-driven consultative sales and business growth, we want to hear from you!</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Identify and generate qualified leads via outbound channels, referrals, and market research.</li>\n<li>Drive new business opportunities for <strong>web, mobile, and enterprise software development</strong> services.</li>\n<li>Manage the complete sales cycle: lead qualification, client communication, requirement analysis, proposal preparation, pricing, negotiation, and closure.</li>\n<li>Propose tailored <strong>IT and digital transformation solutions</strong> aligned with client objectives.</li>\n<li>Build relationships with <strong>Founders, CXOs, and Product Owners</strong>.</li>\n<li>Collaborate with <strong>delivery, design, and marketing teams</strong> to create compelling proposals.</li>\n<li>Maintain CRM records and provide sales forecasts/reports.</li>\n<li>Represent the company at networking events and client meetings.</li>\n<li>Meet/exceed monthly/quarterly revenue targets.</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li><strong>Bachelor’s degree</strong> or equivalent in <strong>IT, CS, BCA, B-Tech, MBA, or CS/IT Diploma</strong>.</li>\n<li><strong>2-5 years</strong> of <strong>B2B sales experience</strong> in <strong>IT services/digital solutions</strong>.</li>\n<li>Proven ability to manage sales pipelines and close deals independently.</li>\n<li>Strong knowledge of <strong>software development services</strong> (web, mobile, SaaS, enterprise).</li>\n<li><strong>International client experience</strong> preferred.</li>\n<li>Familiarity with <strong>CRM systems</strong> (Zoho, HubSpot, Salesforce) and <strong>outbound sales tools</strong> (LinkedIn Sales Navigator).</li>\n<li>Excellent <strong>communication, presentation, and negotiation skills</strong>.</li>\n<li>Ability to work autonomously and own sales targets.</li>\n<li>Strategic thinker with <strong>client pain-point analysis</strong> and solution-positioning skills.</li>\n</ul>\n<h2>Contact</h2>\n<p>Apply by sharing your resume at <strong>careers@2basetechnologies.com</strong>.</p>",
        "tags": [
            "2-5 Years",
            "CRM Systems",
            "Software Development Services",
            "International Client Experience"
        ],
        "summary": "Senior Business Development Executive at 2Base Technologies drives IT services sales, manages full sales cycles, and builds client relationships. Requires 2-5 years of B2B sales experience in IT/digital solutions."
    },
    {
        "job_title": "HR And Admin",
        "company": "Tranzmeo",
        "url": "https://infopark.in/company-jobs/details/21985/157",
        "location": "Infopark",
        "closing_date": "09 Feb 2026",
        "job_description": "<h2>HR &amp; Admin Role Description</h2>\n<h3>Key Responsibilities</h3>\n<p><strong>A. Human Resources (Core HR Operations)</strong>\n1. <strong>Recruitment &amp; Onboarding</strong>\n   - Manage end-to-end recruitment process (sourcing to offer rollout)\n   - Coordinate interviews with hiring managers\n   - Conduct onboarding and induction for new hires\n   - Maintain employee files and documentation\n2. <strong>Attendance, Leave &amp; Payroll Support</strong>\n   - Maintain attendance and leave records\n   - Prepare payroll inputs (attendance, leave, reimbursements, deductions)\n3. <strong>Statutory Compliance (India/Kerala)</strong>\n4. <strong>Employee Lifecycle Management</strong>\n   - Handle confirmations, appraisals, promotions, transfers\n   - Manage exit formalities, relieving documentation\n   - Address employee queries and grievances\n5. <strong>HR Policies &amp; Culture</strong>\n   - Implement HR policies and ensure adherence\n   - Support initiatives for employee engagement and workplace culture\n   - Support performance management and review cycles</p>\n<p><strong>B. Office Administration</strong>\n1. <strong>Workplace Management</strong>\n   - Ensure office cleanliness, maintenance, and safety\n   - Coordinate with housekeeping, security, and facility vendors\n   - Manage office seating, assets, and workspace readiness\n2. <strong>Vendor &amp; Asset Management</strong>\n   - Maintain vendor contracts (internet, pantry, housekeeping, AMC, etc.)\n   - Track office assets, laptops, access cards, stationery\n   - Handle procurement of office supplies\n3. <strong>Travel &amp; Logistics</strong>\n   - Coordinate travel bookings and guest arrangements\n   - Manage courier, dispatch, and documentation\n4. <strong>Compliance &amp; Records</strong>\n   - Maintain office licenses, rental agreements, insurance, and renewals\n   - Ensure fire safety, first aid, and emergency readiness</p>\n<p><strong>Additional Duties</strong>\n- Manage SEZ portal and requirements\n- Manage Company Social Media accounts\n- Coordinate with CA for finance-related activities</p>\n<h3>Key Skills &amp; Competencies</h3>\n<ul>\n<li>1 to 2 years of relevant experience in HR roles</li>\n<li>Ability to multitask and work independently</li>\n<li>Strong interpersonal and organizational skills</li>\n</ul>\n<p><strong>Note</strong>: Preference will be given to candidates available for immediate joining.</p>\n<p><strong>Job Type</strong>: On-site</p>\n<p><strong>Contact</strong>: Share your updated resume at <a href=\"mailto:career@tranzmeo.com\">career@tranzmeo.com</a></p>",
        "tags": [
            "1-2 Years",
            "HR Operations",
            "Office Administration",
            "Statutory Compliance"
        ],
        "summary": "A hybrid HR & Admin role requiring 1-2 years of experience, focusing on recruitment, employee lifecycle management, workplace operations, and statutory compliance in India/Kerala."
    },
    {
        "job_title": "MSSQL Developer",
        "company": "Nymbl",
        "url": "https://infopark.in/company-jobs/details/21979/323",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Job Title:</strong> MSSQL Developer\n<strong>Location:</strong> KOCHI\n<strong>Experience:</strong> 3–5 years\n<strong>Employment Type:</strong> Full-time</p>\n<h3>Job Summary</h3>\n<p>We are seeking a skilled MSSQL Developer to design, develop, optimize, and maintain SQL Server databases. The ideal candidate will collaborate closely with application developers and business teams to ensure optimal performance, data integrity, and scalability.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Write, optimize, and maintain complex SQL queries</li>\n<li>Design, develop, and manage stored procedures, views, functions, and triggers</li>\n<li>Conduct data analysis and validation, and produce required reports</li>\n<li>Perform query performance tuning using execution plans, indexing, and profiling</li>\n<li>Ensure data integrity, security, backup, and recovery strategies</li>\n<li>Troubleshoot production issues and provide timely resolutions</li>\n<li>Support database deployments, migrations, and upgrades</li>\n<li>Document database designs, processes, and standards</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong experience with MSSQL Server (2016/2019/2022/2025)</li>\n<li>Expertise in T-SQL, indexing, query optimization, and performance tuning</li>\n<li>Hands-on experience with stored procedures, functions, triggers</li>\n<li>Knowledge of normalization, relational database design, and data modeling</li>\n<li>Experience with SQL Server Agent jobs, backups, restores</li>\n<li>Understanding of transactions, locks, deadlocks, and isolation levels</li>\n<li>Excellent analytical and problem-solving skills</li>\n</ul>\n<h3>Good to Have</h3>\n<ul>\n<li>Exposure to Azure SQL / SQL Managed Instance</li>\n<li>Knowledge of ETL processes and data warehousing concepts</li>\n<li>Familiarity with version control tools like Azure DevOps</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@benymbl.co</strong>.</p>",
        "tags": [
            "3–5 Years",
            "MSSQL Server",
            "T-SQL & Query Optimization",
            "Database Design & Modeling"
        ],
        "summary": "A Full-time MSSQL Developer in Kochi is needed to design, optimize, and maintain SQL Server databases, ensuring performance and data integrity through collaboration with teams and advanced technical skills."
    },
    {
        "job_title": "Business Development Specialist",
        "company": "2Hats Logic Solutions Pvt. Ltd.",
        "url": "https://infopark.in/company-jobs/details/21987/182",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Business Development Specialist</strong></p>\n<p>We’re hiring: <strong>Business Development Specialist (3–7 years)</strong></p>\n<p>If you enjoy opening doors, starting smart conversations, and turning research into real opportunities, this role is for you. We’re looking for someone who knows how to spot the right prospects, engage them with confidence, and fuel a high-performing sales pipeline in an IT services environment.</p>\n<h3>What you’ll do</h3>\n<ul>\n<li>Identify and research potential clients using LinkedIn, Sales Navigator, online platforms, and databases</li>\n<li>Qualify leads thoughtfully, focusing on fit, intent, and long-term value</li>\n<li>Work closely with the sales team to align on target markets, ICPs, and outreach strategy</li>\n<li>Drive outbound outreach through clear, personalized, and persuasive communication</li>\n<li>Keep CRM data clean, current, and meaningful</li>\n<li>Track market trends, competitors, and new lead-generation tools to stay ahead</li>\n<li>Continuously refine your approach to improve response rates and conversions</li>\n</ul>\n<h3>What we’re looking for</h3>\n<ul>\n<li>3–7 years of hands-on experience in Business Development, Lead Generation, or Inside Sales</li>\n<li>Mandatory experience in an IT services or software services company</li>\n<li>Strong working knowledge of LinkedIn Sales Navigator, CRM tools, and lead-gen platforms</li>\n<li>Excellent communication skills, written and verbal, with the ability to engage decision-makers</li>\n<li>Sharp research and analytical skills to identify high-quality prospects</li>\n<li>Self-driven, energetic, and comfortable owning targets</li>\n<li>Adaptable mindset and curiosity to evolve with changing markets</li>\n</ul>\n<h3>Why this role is worth your time</h3>\n<ul>\n<li>Clear ownership and visibility of your impact on revenue</li>\n<li>Direct collaboration with sales and leadership</li>\n<li>Room to experiment, improve processes, and grow your career</li>\n<li>A team that values smart effort over noise</li>\n</ul>\n<p><strong>Apply Now</strong> with your updated resume to <strong>hr@2hatslogic.com</strong> with the subject line: <strong>\"Business Development Specialist\"</strong>.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@2hatslogic.com</strong>.</p>",
        "tags": [
            "3–7 Years",
            "LinkedIn Sales Navigator",
            "CRM Tools",
            "Lead Generation Platforms"
        ],
        "summary": "Drive business development in IT services by generating high-quality leads and collaborating with sales teams. Requires 3–7 years of experience in lead generation and strong CRM proficiency."
    },
    {
        "job_title": "BIM Modeler -Civil (Structural/Infra)",
        "company": "Paradigm IT Private Limited",
        "url": "https://infopark.in/company-jobs/details/21989/345",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Company Description</strong></p>\n<p>Paradigm IT Private Limited is a civil/structural engineering services company based in Kochi. Owned and managed by qualified civil/structural engineers from India and Europe, the company offers services such as structural design, concrete reinforcement detailing, structural steel detailing, BIM services, and pre-construction CAD services.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li><strong>3+ years</strong> of experience in Revit modeling for <strong>CIVIL (Structural/Infra)</strong> and drawing extraction</li>\n<li>Knowledge of <strong>industrial structures</strong></li>\n<li><strong>Rebar detailing</strong> expertise in Revit</li>\n<li>Strong <strong>technical judgment</strong> and <strong>communication skills</strong></li>\n<li>Work experience in <strong>infrastructure projects</strong></li>\n</ul>\n<p><strong>Preferred</strong></p>\n<ul>\n<li><strong>Navisworks</strong>/clash detection</li>\n<li><strong>AutoCAD</strong></li>\n<li><strong>BIM</strong></li>\n</ul>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li>Email: bijo@paradigm.in (for resumes)</li>\n<li>Email: hr@paradigm.in (for applications)</li>\n<li><strong>Note</strong>: Site engineers are not preferred.</li>\n</ul>",
        "tags": [
            "3+ Years",
            "Revit",
            "BIM",
            "Rebar Detailing"
        ],
        "summary": "BIM Modeler needed for structural/infrastructure projects with 3+ years in Revit, rebar detailing, and infrastructure experience."
    },
    {
        "job_title": "Autocad Technician (Civil-Infrastrucure)",
        "company": "Paradigm IT Private Limited",
        "url": "https://infopark.in/company-jobs/details/21990/345",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Designation:</strong> CAD Draftsman (Civil - Infrastructure)\n<strong>Reporting to:</strong> General Manager\n<strong>Company Profile:</strong> <a href=\"https://www.paradigm.in/\">Paradigm IT Private Limited</a>\n<strong>Job Type:</strong> Full Time\n<strong>Job Location:</strong> Kochi, Kerala</p>\n<p><strong>Company Description</strong>\nParadigm IT Private Limited is a civil/structural engineering services company located in Kochi. Owned and managed by qualified civil/structural engineers from India and Europe, the company offers services such as structural design, concrete reinforcement detailing, structural steel detailing, BIM services, and pre-construction CAD services.</p>\n<p><strong>Requirements:</strong>\n- <strong>2 to 6 years</strong> of experience in AutoCAD (Structural)\n- Knowledge about industrial structures and infrastructure projects\n- Strong technical judgment and communication skills\n- Ability to work collaboratively in a team environment\n- Bachelor's degree or Diploma in Civil/Structural Engineering</p>\n<p><strong>Preferred Software:</strong>\n- Navisworks/Clash Detection\n- AutoCAD\n- BIM</p>\n<p><strong>Important Notes:</strong>\n- Candidates with <strong>site experience are not eligible</strong> to apply.</p>\n<p><strong>Contact:</strong>\n- Email resumes to <strong>bijo@paradigm.in</strong> or <strong>hr@paradigm.in</strong>\n- Subject line: \"CAD Draftsman Application - [Your Name]\"</p>",
        "tags": [
            "2-6 Years",
            "AutoCAD",
            "Navisworks",
            "BIM"
        ],
        "summary": "CAD Draftsman with 2-6 years of structural AutoCAD experience. Requires knowledge in industrial structures and infrastructure projects, using Navisworks and BIM."
    },
    {
        "job_title": "Structural Design Engineer",
        "company": "Paradigm IT Private Limited",
        "url": "https://infopark.in/company-jobs/details/21991/345",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Company Description</strong></p>\n<p>Paradigm IT Private Limited is owned and managed by qualified civil/structural engineers from India and Europe with extensive experience in various projects worldwide. The company provides civil/structural engineering services including:\n- Structural design\n- Concrete reinforcement detailing\n- Structural steel detailing\n- BIM services\n- Pre-construction CAD services</p>\n<p>Paradigm emphasizes training, innovation, and developing systems to continuously improve client services.</p>\n<p><strong>Role Description</strong></p>\n<p>This is a <strong>full-time on-site role</strong> for a <strong>Structural Design Engineer</strong> located in <strong>Kochi</strong>. Key responsibilities include:\n- Structural analysis and engineering\n- Civil engineering tasks\n- Utilizing <strong>AutoCAD</strong> software for design and detailing</p>\n<p><strong>Major Requirements</strong>\n- Experience in structural design (preferably industrial structures), rebar detailing, or <strong>Revit</strong></p>\n<p><strong>Qualifications</strong>\n- Structural analysis and engineering skills\n- Civil engineering expertise\n- Proficiency in <strong>Computer-Aided Design (CAD)</strong> and <strong>AutoCAD</strong>\n- Strong problem-solving and analytical skills\n- Ability to work collaboratively in a team environment\n- Excellent communication and presentation skills\n- Bachelor's or Master's degree in Civil Engineering or a related field</p>\n<p><strong>Contact Information</strong>\n- Email resumes to <strong>bijo@paradigm.in</strong> or <strong>thr@paradigm.in</strong> if this opportunity aligns with your career goals.</p>",
        "tags": [
            "3-5 Years",
            "Structural Design",
            "AutoCAD",
            "Revit"
        ],
        "summary": "Structural Design Engineer in Kochi requiring CAD/AutoCAD and Revit skills for analysis and design in industrial projects."
    },
    {
        "job_title": "Tekla Modeler/Detailer",
        "company": "Paradigm IT Private Limited",
        "url": "https://infopark.in/company-jobs/details/21992/345",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Designation</h2>\n<p>Structural Steel Detailing - Modeller / Checker</p>\n<h2>Reporting to</h2>\n<p>General Manager</p>\n<h2>Job Type</h2>\n<p>Full Time</p>\n<h2>Job Location</h2>\n<p>Kochi, Kerala</p>\n<h2>Company Description</h2>\n<p>Paradigm IT Private Limited is a civil/structural engineering services company located in Kochi. Owned and managed by qualified civil/structural engineers from India and Europe. The company offers services such as structural design, concrete reinforcement detailing, structural steel detailing, BIM services, and pre-construction CAD services.</p>\n<h2>Experience</h2>\n<ul>\n<li>2 to 10 years of experience in Tekla software.</li>\n<li>Strong technical judgment and communication skills.</li>\n</ul>\n<h2>Requirements</h2>\n<p>1) Modelling capability\n2) Study and understanding design drawings\n3) Independent working ability\n4) Drawing editing and creation capability for all type of jobs\n5) Checking of model and drawings\n6) Planning and coordination of jobs independently\n7) Team management skill\n8) Client communication skill</p>\n<h2>Contact</h2>\n<p>Please shoot your resume to <strong>bijo@paradigm.in</strong>. If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>thr@paradigm.in</strong>.</p>",
        "tags": [
            "2-10 Years",
            "Tekla",
            "Structural Steel Detailing",
            "BIM Services"
        ],
        "summary": "Seeking a Tekla Modeler/Detailer with 2-10 years of experience in structural steel detailing and BIM services to create models, manage projects, and coordinate with clients."
    },
    {
        "job_title": "Probationary Engineer (Freshers)",
        "company": "Paradigm IT Private Limited",
        "url": "https://infopark.in/company-jobs/details/21993/345",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Company Description</strong></p>\n<p>Paradigm IT Private Limited in Kochi is a civil/structural engineering services company founded and managed by qualified engineers from India and Europe. The company specializes in:\n- Structural design\n- Concrete reinforcement detailing\n- Structural steel detailing\n- BIM services\n- Pre-construction CAD services</p>\n<p><strong>Role Description</strong></p>\n<p>This is a <strong>full-time on-site role</strong> for a <strong>Probationary Engineer</strong> at Paradigm IT Private Limited in Kochi. The role involves tasks related to structural design, concrete reinforcement detailing, structural steel detailing, BIM services, and pre-construction CAD services. Responsibilities include collaborating with the team to deliver high-quality engineering solutions and supporting client projects.</p>\n<p><strong>Key Details</strong>\n- <strong>Designation</strong>: Probationary Engineer (Civil) (2024 &amp; 2025 passout students only)\n- <strong>Job Location</strong>: Kochi\n- <strong>Job Type</strong>: Permanent\n- <strong>Salary</strong>: ₹22,000/-(CTC)\n- <strong>Probation Period</strong>: 6 Months\n- <strong>Eligibility</strong>: Site Engineers are not encouraged to apply.</p>\n<p><strong>Qualifications</strong>\n- Diploma/B.Tech/M.Tech</p>\n<p><strong>Duties and Responsibilities</strong>\n1. Demonstrate technical competence, adaptability, and adherence to company standards while learning from senior staff.\n2. Attend all training sessions, take detailed notes, and document for future reference.\n3. Clarify doubts during/after sessions and document questions for resolution.\n4. Follow instructions meticulously and complete tasks within deadlines.\n5. Notify the Team Leader (TL) immediately for early task completion or challenges.\n6. Ensure full understanding of tasks, concepts, and procedures before starting work.\n7. Report work, software, or hardware issues to the TL promptly and log IT issues in the IT complaint register.\n8. Strive for accuracy to avoid rework and self-check work against feedback.\n9. Participate in company activities and adhere to organizational rules, regulations, and confidentiality agreements.\n10. Uphold high ethical standards in all actions.</p>\n<p><strong>How to Apply</strong>\nIf this opportunity aligns with your career goals, share your updated resume at <strong>hr@paradigm.in</strong>.</p>",
        "tags": [
            "Freshers",
            "Structural Design",
            "BIM Services",
            "CAD Services"
        ],
        "summary": "Paradigm IT Private Limited in Kochi seeks Probationary Engineers (freshers) for structural design and detailing roles. The position offers training, a 6-month probation period, and permanent employment for qualified candidates."
    },
    {
        "job_title": "MIS Executive",
        "company": "Paradigm IT Private Limited",
        "url": "https://infopark.in/company-jobs/details/21994/345",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Designation</strong>: MIS Executive\n<strong>Reporting To</strong>: General Manager\n<strong>Work Location</strong>: Kochi\n<strong>Type of Job</strong>: Permanent</p>\n<p><strong>Company Description</strong>\nParadigm IT Private Limited is a company owned and managed by qualified civil/structural engineers from India and Europe. The company offers civil/structural engineering services including structural design, concrete reinforcement detailing, structural steel detailing, BIM services, and pre-construction CAD services. Paradigm focuses on providing technical expertise, fostering a culture of innovation, and developing systems to continuously improve client support.</p>\n<p><strong>Role Description</strong>\nThis is a full-time on-site role located in Kochi for a Management Information System Executive. The role involves handling day-to-day tasks related to information systems, analytical skills, MIS reporting, and managing Management Information Systems (MIS).</p>\n<p><strong>Qualifications</strong>\n- Information Systems and Analytical Skills\n- MIS Reporting and Management Information Systems (MIS)\n- Strong communication skills\n- Experience in the field of information systems and MIS reporting\n- Ability to analyze complex data and provide insights\n- Attention to detail and problem-solving skills\n- Bachelor's degree (Any discipline) or Diploma in related field</p>\n<p><strong>Software Skills</strong>\n- Strong knowledge in MS Excel, Word, PowerPoint, etc.\n- Knowledge in Power BI</p>\n<p><strong>Experience</strong>\n0-3 Years</p>\n<p><strong>Contact</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>hr@paradigm.in</strong>.</p>",
        "tags": [
            "0-3 Years",
            "MIS Reporting",
            "MS Excel",
            "Power BI"
        ],
        "summary": "MIS Executive in Kochi for a civil/structural engineering firm, focusing on MIS reporting, data analysis, and using tools like Excel and Power BI. Requires 0-3 years of experience."
    },
    {
        "job_title": "HR - Generalist",
        "company": "PIT Solutions Private Limited",
        "url": "https://infopark.in/company-jobs/details/21995/416",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Role Overview</h2>\n<p>We are seeking a seasoned, strategic HR professional to drive high-impact people initiatives across <strong>Talent Management</strong>, <strong>Learning &amp; Development</strong>, <strong>Employee Experience</strong>, and <strong>HR Communications</strong>. The role partners closely with business leaders to diagnose people challenges using strong <strong>critical thinking</strong> and <strong>logical reasoning</strong>, design effective solutions, and continuously improve people practices that support organizational growth, culture excellence, and data-driven decision-making.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design and drive <strong>People and Policy frameworks</strong>, SOPs, and best-practice COE programs across <strong>Talent Management</strong>, <strong>Performance</strong>, <strong>Engagement</strong>, and <strong>Workforce Planning</strong></li>\n<li>Lead internal HR communications including <strong>newsletters</strong>, <strong>employer branding content</strong>, <strong>policy rollouts</strong>, and <strong>leadership updates</strong></li>\n<li>Manage <strong>social media</strong> and <strong>digital employer branding</strong> initiatives (LinkedIn campaigns, culture showcases, hiring brand storytelling)</li>\n<li>Support and co-create <strong>Learning &amp; Development</strong> programs including <strong>leadership development</strong>, <strong>upskilling initiatives</strong>, <strong>academies</strong>, and internal capability building</li>\n<li>Partner with business stakeholders on <strong>HR strategy</strong>, <strong>change initiatives</strong>, and <strong>people transformation projects</strong></li>\n<li>Drive <strong>analytics-based HR insights</strong> for <strong>workforce planning</strong>, <strong>engagement</strong>, <strong>productivity</strong>, and <strong>talent outcomes</strong></li>\n<li>Ensure <strong>governance</strong>, <strong>compliance</strong>, and <strong>continuous process improvement</strong> across People operations</li>\n<li>Collaborate on <strong>AI-driven HR product initiatives</strong>, <strong>digital HR platforms</strong>, and <strong>people analytics solutions</strong> to enhance HR effectiveness</li>\n<li>Support <strong>sales enablement</strong> and <strong>staff augmentation</strong> business development efforts through <strong>workforce planning</strong>, <strong>talent readiness</strong>, and <strong>client-aligned HR strategies</strong></li>\n</ul>\n<h2>Key Skills &amp; Competencies</h2>\n<ul>\n<li><strong>Strong critical thinking</strong>, <strong>analytical ability</strong>, and <strong>logical reasoning skills</strong></li>\n<li><strong>Excellent written and verbal communication</strong> with <strong>storytelling capability</strong></li>\n<li>Experience in <strong>HR COE / HRBP / Strategic HR roles</strong></li>\n<li>Exposure to <strong>L&amp;D program design</strong> and <strong>organizational development</strong></li>\n<li><strong>Employer branding</strong> and <strong>social media engagement</strong> experience</li>\n<li><strong>Stakeholder management</strong> and <strong>project execution expertise</strong></li>\n<li>Exposure to <strong>AI-driven HR technologies</strong>, <strong>digital HR platforms</strong>, or <strong>people analytics solutions</strong> is a strong advantage</li>\n<li>Experience in <strong>sales enablement</strong> or <strong>staff augmentation</strong> business development is an added plus</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li><strong>MBA/PG in HR</strong> or related field</li>\n<li>Certifications such as <strong>SHRM</strong>, <strong>CIPD</strong>, or equivalent (preferred)</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>careers@pitsolutions.com</strong></p>",
        "tags": [
            "8+ Years",
            "HR COE/HRBP/Strategic HR",
            "AI-driven HR Technologies",
            "Employer Branding/Social Media"
        ],
        "summary": "Seasoned HR professional driving strategic initiatives in talent management, learning, and employee experience. Partners with leaders to implement data-driven solutions and digital HR innovations."
    },
    {
        "job_title": "QA Engineer & Senior QA Engineer",
        "company": "SE-Mentor Solutions",
        "url": "https://infopark.in/company-jobs/details/21996/483",
        "location": "Infopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>QA Engineer &amp; Senior QA Engineer</h2>\n<p>We are seeking experienced QA Engineers and a Senior QA Engineer (4–8+ years) to design, develop, and maintain automated test suites for ETL pipelines and complex data processing workflows in the healthcare domain. You will ensure the quality of platforms processing millions of medical records, with a focus on business rule validation and data integrity. This role involves processing and analyzing patient-level healthcare data to support clinical studies and disease modeling.</p>\n<h3>Core Responsibilities</h3>\n<p><strong>Senior QA Engineer (Lead)</strong>\n- Oversee and mentor junior/mid-level engineers, providing technical guidance.\n- Delegate tasks effectively to align with delivery goals.</p>\n<p><strong>QA Engineers</strong>\n- Design and execute test strategies for ETL/data pipelines.\n- Develop automated tests using Python and validate data workflows.\n- Collaborate with global teams and stakeholders.</p>\n<h3>Qualifications &amp; Skills</h3>\n<p><strong>Senior QA Engineer</strong>\n- <strong>8+ years</strong> of software testing experience.\n- Expertise in <strong>PySpark</strong>, <strong>Databricks</strong>, <strong>Oracle</strong>, and <strong>Robot Framework</strong>.\n- Advanced SQL, Python, and knowledge of dimensional modeling.\n- Experience with <strong>Git</strong>, <strong>CI/CD tools</strong> (Jenkins/GitLab CI), and <strong>Agile/Scrum</strong>.\n- Strong collaboration and cross-cultural communication skills.</p>\n<p><strong>QA Engineers</strong>\n- <strong>4–7 years</strong> of testing experience in data/ETL projects.\n- Advanced SQL and intermediate Python skills.\n- Familiarity with <strong>Databricks</strong>, <strong>Spark</strong>, <strong>Hive</strong>, and <strong>Impala</strong>.\n- Basic Docker knowledge and Agile methodology.</p>\n<h3>Contact</h3>\n<p>For immediate to 40-day notice period candidates, submit your resume to <strong>careers@se-mentor.com</strong>.</p>",
        "tags": [
            "8+ Years",
            "PySpark",
            "Databricks",
            "Oracle"
        ],
        "summary": "QA Engineers and Senior QA Engineers needed to test healthcare data pipelines using PySpark and Databricks, ensuring data integrity and collaborating with global teams."
    },
    {
        "job_title": "HR Intern (3-Month Internship)",
        "company": "Dynamed Healthcare Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21986/132",
        "location": "Infopark",
        "closing_date": "09 Mar 2026",
        "job_description": "<h2>HR Intern (3-Month Internship)</h2>\n<h3>About the Internship</h3>\n<p>We are seeking an energetic and eager-to-learn HR Intern to kickstart a career in Human Resources. This internship offers freshers hands-on experience in recruitment, employee coordination, and HR operations.</p>\n<h3>What You Will Do</h3>\n<ul>\n<li>Support the recruitment team in sourcing and screening candidates</li>\n<li>Schedule interviews and coordinate with candidates</li>\n<li>Assist with onboarding new employees</li>\n<li>Maintain basic HR records and trackers</li>\n<li>Help organize employee engagement activities</li>\n<li>Support daily HR administrative tasks</li>\n<li>Collaborate with the HR team on ongoing projects</li>\n</ul>\n<h3>Who Can Apply</h3>\n<ul>\n<li>Fresh graduates or students pursuing a degree in HR, Business, or Management</li>\n<li>Strong interest in Human Resources</li>\n<li>Excellent communication skills</li>\n<li>Basic proficiency in MS Office</li>\n<li>Organized, responsible, and detail-oriented</li>\n<li>Quick learner with a positive mindset</li>\n<li>Ability to handle confidential information</li>\n</ul>\n<h3>What You Will Gain</h3>\n<ul>\n<li>Real-world HR experience</li>\n<li>Hands-on exposure to recruitment processes</li>\n<li>Mentorship from experienced HR professionals</li>\n<li>Internship completion certificate</li>\n</ul>\n<h3>How to Apply</h3>\n<p>If this opportunity aligns with your career goals, submit your updated resume to <strong>anoop.rajan@dynamedhealth.com</strong>.</p>",
        "tags": [
            "No Experience Required",
            "HR",
            "Recruitment",
            "MS Office"
        ],
        "summary": "A 3-month HR internship for freshers to gain hands-on experience in recruitment, onboarding, and administrative tasks with mentorship and a completion certificate."
    },
    {
        "job_title": "Associate – Customer Support & Social Media",
        "company": "Dynamed Healthcare Solutions Pvt.Ltd.",
        "url": "https://infopark.in/company-jobs/details/21988/132",
        "location": "Infopark",
        "closing_date": "09 Mar 2026",
        "job_description": "<p><strong>Job Summary</strong></p>\n<p>The Associate – Customer Support &amp; Social Media will manage email and digital communication channels within a healthcare environment. Responsibilities include delivering timely, accurate, and professional support to patients, customers, partners, and stakeholders while maintaining service quality, confidentiality standards, and the organization’s brand presence across digital platforms.</p>\n<p><strong>Key Responsibilities</strong>\n- Manage and respond to email inquiries from patients, customers, partners, and stakeholders within defined service timelines\n- Monitor social media platforms and provide real-time, professional responses to queries and feedback\n- Provide accurate information and general assistance regarding services, processes, and support requirements\n- Escalate complex, urgent, or sensitive matters to appropriate internal teams and track resolution\n- Maintain strict confidentiality and comply with healthcare communication and data privacy standards\n- Document, track, and follow up on all interactions through designated systems\n- Ensure communication aligns with organizational policies and brand standards\n- Identify recurring concerns and support process improvement initiatives\n- Collaborate with cross-functional teams to enhance overall service delivery</p>\n<p><strong>Required Qualifications &amp; Skills</strong>\n- 1–2 years of relevant experience in customer service or support operations\n- Excellent written communication skills with a professional and service-oriented tone\n- Experience handling digital and social media customer engagement\n- Strong multitasking and time-management capabilities\n- Effective problem-solving and coordination skills\n- Familiarity with CRM or ticketing systems is preferred\n- High attention to detail with a strong commitment to confidentiality and compliance</p>\n<p><strong>Competencies</strong>\n- Customer-centric approach\n- Professionalism and emotional intelligence\n- Ability to perform under pressure\n- Strong organizational and teamwork skills</p>\n<p><strong>Contact Information</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at <strong>anoop.rajan@dynamedhealth.com</strong>.</p>",
        "tags": [
            "1–2 Years",
            "CRM/Ticketing Systems",
            "Social Media Management",
            "Customer Service"
        ],
        "summary": "Supports healthcare customer inquiries and social media engagement with a focus on timely, professional communication and brand consistency."
    },
    {
        "job_title": "QA Engineer & Senior QA Engineer",
        "company": "Se-Mentor Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27525",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>About the Role</h2>\n<p>SE-Mentor Solutions (P) Ltd is seeking <strong>QA Engineers</strong> and a <strong>Senior QA Engineer</strong> to design, develop, and maintain automated test suites for ETL pipelines and complex data processing workflows in the healthcare domain. The role involves ensuring the quality of platforms processing millions of medical records, with a focus on business rule validation and data integrity. The project includes processing and analyzing patient-level healthcare data to address challenges like retrospective clinical studies and disease progression modeling.</p>\n<h3>Core Responsibilities for Senior QA (Lead)</h3>\n<ul>\n<li>Oversee and mentor junior/mid-level engineers, providing technical guidance and career support.</li>\n<li>Delegate tasks effectively to align with delivery goals and project timelines.</li>\n</ul>\n<h3>Core Responsibilities for QA Engineers</h3>\n<ul>\n<li>Design and execute test strategies for ETL and data pipelines.</li>\n<li>Develop and maintain automated tests using Python.</li>\n<li>Perform data validation, reconciliation, and business rule testing.</li>\n<li>Support junior QA engineers and create test plans/cases.</li>\n<li>Manage defects using JIRA and collaborate with global teams, including Europe-based stakeholders.</li>\n</ul>\n<h3>Qualifications &amp; Skills</h3>\n<p><strong>Education</strong>: Bachelor’s Degree in Information Technology, Software Engineering, Computer Science, Mathematics, or a related field.\n<strong>Notice Period</strong>: Immediate to 40 Days preferred.</p>\n<h4>Senior QA Engineer (4–7 years)</h4>\n<ul>\n<li><strong>Technical Skills</strong>: 8+ years in software testing, test automation (Robot Framework), Python/SQL, Oracle/Databricks/Hive/Impala, Git, CI/CD tools (Jenkins), Spark/Databricks ecosystem, data modeling (dimensional modeling, SCD, star schemas).</li>\n<li><strong>Soft Skills</strong>: Excellent analytical/troubleshooting skills, cross-cultural communication, Agile/Scrum familiarity, and team collaboration.</li>\n</ul>\n<h4>QA Engineers (4–7 years)</h4>\n<ul>\n<li><strong>Technical Skills</strong>: Advanced SQL, intermediate Python, Databricks/Spark/Oracle/Hive/Impala, Git, CI/CD tools (Jenkins), Docker basics, Agile/Scrum methodologies.</li>\n<li><strong>Soft Skills</strong>: Strong communication, analytical thinking, and collaboration.</li>\n</ul>\n<h3>Contact Information</h3>\n<ul>\n<li><strong>Closing Date</strong>: 28, Feb 2026</li>\n<li><strong>Job Published</strong>: 09, Feb 2026</li>\n<li><strong>Email</strong>: <a href=\"mailto:careers@se-mentor.com\">careers@se-mentor.com</a></li>\n<li><strong>Website</strong>: <a href=\"http://www.se-mentor.com\">www.se-mentor.com</a></li>\n</ul>",
        "tags": [
            "4-7 Years",
            "PySpark",
            "Databricks",
            "Oracle"
        ],
        "summary": "SE-Mentor Solutions seeks QA Engineers and a Senior QA Engineer to design automated test suites for healthcare data pipelines using PySpark, Databricks, and Oracle. Responsibilities include data validation, test automation, and collaboration with global teams."
    },
    {
        "job_title": "Tele  caller Malayalam",
        "company": "Foxdale (P) Ltd",
        "url": "https://technopark.org/job-details/27524",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Foxdale (P) Ltd</h2>\n<p><strong>Module C &amp; H, 6th Floor, Bhavani, 695581</strong>\n<strong>Website:</strong> <a href=\"http://www.foxdale.in\">http://www.foxdale.in</a></p>\n<h3>Telecaller Malayalam</h3>\n<p><strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> hr@foxdale.in</p>\n<h3>Brief Description</h3>\n<p>We are seeking a motivated and customer-focused Telecaller fluent in Malayalam to join our team. The role involves handling inbound and outbound calls, engaging with customers, and supporting sales or service processes.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Make outbound calls to prospective customers and explain products/services in Malayalam.</li>\n<li>Handle inbound customer queries with professionalism and empathy.</li>\n<li>Maintain accurate records of customer interactions in CRM systems.</li>\n<li>Follow up with leads to ensure conversion and customer satisfaction.</li>\n<li>Achieve daily/weekly call and sales targets.</li>\n<li>Provide feedback to the team on customer needs, issues, and trends.</li>\n</ul>",
        "tags": [
            "Not Specified",
            "Malayalam",
            "CRM Systems",
            "Sales Targets"
        ],
        "summary": "Malayalam-speaking Telecaller needed for customer engagement, CRM record-keeping, and sales target achievement."
    },
    {
        "job_title": "Business Analyst",
        "company": "Xpetize Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27523",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<p><strong>Company</strong>: Xpetize Technology Solutions (P) Ltd\n<strong>Address</strong>: A-10, TBIC, 4th Floor, Nila, Technopark, Kerala, Trivandrum, 695581\n<strong>Website</strong>: <a href=\"http://www.xpetize.com\">www.xpetize.com</a>\n<strong>Job Published</strong>: 09, Feb 2026\n<strong>Closing Date</strong>: 26, Mar 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@xpetize.com\">careers@xpetize.com</a></p>\n<h3>Job Role/Designation</h3>\n<p><strong>Business Analyst</strong></p>\n<h3>Expected Joining Time</h3>\n<p>2026-03-01</p>\n<h3>Experience Level</h3>\n<p>Mid (4–7 years)</p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Lead collection, analysis, and documentation of business and technical requirements for a website replatform.</li>\n<li>Translate business needs into user stories, acceptance criteria, workflows, IA recommendations, and system integration requirements.</li>\n<li>Ensure requirements align with SEO, GEO, Information Security, UX, UI, IA, content strategy, analytics, accessibility, and scalability.</li>\n<li>Map replatform impact across business functions and digital touchpoints.</li>\n<li>Facilitate workshops, discovery sessions, and stakeholder interviews with Marketing, IT, Digital, and impacted teams.</li>\n</ul>\n<h3>Must-Have Skills</h3>\n<ul>\n<li>Proven experience in <strong>Agile/Scrum</strong> for medium–large scale digital transformation or web replatform projects.</li>\n<li>Strong understanding of <strong>headless CMS platforms</strong>, content modeling, and API-driven architectures.</li>\n<li>Background in modern web delivery models (e.g., headless CMS + front-end frameworks + cloud hosting).</li>\n<li>Ability to collaborate with IT stakeholders and coordinate technical integrations (CRM, marketing automation, personalization platforms).</li>\n<li>Translate technical concepts into business-friendly language.</li>\n<li>Coordinate UAT processes for internal stakeholders.</li>\n<li>Demonstrated expertise in <strong>UX/UI, IA, SEO, analytics, content strategy, and accessibility</strong>.</li>\n<li>Strong project delivery skills (timelines, risks, budgets, cross-functional communication).</li>\n<li>Exceptional stakeholder management and communication skills.</li>\n</ul>\n<h3>Work Mode</h3>\n<ul>\n<li>Remote</li>\n</ul>\n<h3>Candidate Preferences</h3>\n<ul>\n<li>Mid-level experience (4–7 years)</li>\n<li>Candidates from <strong>Kerala</strong> and <strong>Tamil Nadu</strong> preferred</li>\n<li>Immediate joiners</li>\n</ul>",
        "tags": [
            "4-7 Years",
            "Agile/Scrum",
            "Headless CMS",
            "UX/UI/SEO"
        ],
        "summary": "Business Analyst needed for a web replatform project, requiring 4–7 years of experience in Agile/Scrum, headless CMS, and UX/UI/SEO. Role involves strategic requirement analysis and cross-functional collaboration."
    },
    {
        "job_title": "HR - Generalist",
        "company": "Pit Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27522",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Company</strong>: PIT Solutions (P) Ltd\n<strong>Location</strong>: Trivandrum/Cochin\n<strong>Contact</strong>: careers@pitsolutions.com\n<strong>Closing Date</strong>: 28, Feb 2026\n<strong>Published</strong>: 09, Feb 2026</p>\n<h3>Role Overview</h3>\n<p>We are seeking a seasoned, strategic HR professional to drive high-impact people initiatives across <strong>Talent Management</strong>, <strong>Learning &amp; Development</strong>, <strong>Employee Experience</strong>, and <strong>HR Communications</strong>. The role partners closely with business leaders to diagnose people challenges using strong critical thinking and logical reasoning, design effective solutions, and continuously improve people practices that support organizational growth, culture excellence, and data-driven decision-making.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and drive <strong>People and Policy frameworks</strong>, SOPs, and best-practice COE programs across Talent Management, Performance, Engagement, and Workforce Planning</li>\n<li>Lead internal HR communications including newsletters, employer branding content, policy rollouts, and leadership updates</li>\n<li>Manage social media and digital employer branding initiatives (LinkedIn campaigns, culture showcases, hiring brand storytelling)</li>\n<li>Support and co-create <strong>Learning &amp; Development</strong> programs including leadership development, upskilling initiatives, academies, and internal capability building</li>\n<li>Partner with business stakeholders on HR strategy, change initiatives, and people transformation projects</li>\n<li>Drive analytics-based HR insights for workforce planning, engagement, productivity, and talent outcomes</li>\n<li>Ensure governance, compliance, and continuous process improvement across People operations</li>\n<li>Collaborate on <strong>AI-driven HR product initiatives</strong>, digital HR platforms, and people analytics solutions to enhance HR effectiveness</li>\n<li>Support sales enablement and staff augmentation business development efforts through workforce planning, talent readiness, and client-aligned HR strategies</li>\n</ul>\n<h3>Preferred Skills &amp; Competencies</h3>\n<ul>\n<li>Strong critical thinking, analytical ability, and logical reasoning skills</li>\n<li>Excellent written and verbal communication with storytelling capability</li>\n<li>Experience in <strong>HR COE / HRBP / Strategic HR roles</strong></li>\n<li>Exposure to <strong>L&amp;D program design</strong> and organizational development</li>\n<li><strong>Employer branding</strong> and social media engagement experience</li>\n<li>Stakeholder management and project execution expertise</li>\n<li>Exposure to <strong>AI-driven HR technologies</strong>, digital HR platforms, or people analytics solutions is a strong advantage</li>\n<li>Experience in sales enablement or staff augmentation business development is an added plus</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>MBA/PG in HR or related field</li>\n<li>Certifications such as SHRM, CIPD, or equivalent (preferred)</li>\n</ul>",
        "tags": [
            "8+ Years",
            "HR Strategy",
            "Learning & Development",
            "Employer Branding"
        ],
        "summary": "Strategic HR leader with 8+ years to drive talent management, learning, and employee experience initiatives, partnering with leaders to enhance organizational growth through data-driven strategies."
    },
    {
        "job_title": "Golang Developer",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27520",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Revyrie Global\n<strong>Address:</strong> 17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a>\n<strong>Closing Date:</strong> 16 Feb 2026\n<strong>Published Date:</strong> 09 Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Job Description</h3>\n<p>Design, develop, and maintain efficient, reusable, and reliable Go code.\n- Build RESTful APIs and microservices for web and mobile applications.\n- Integrate data storage solutions such as MySQL, PostgreSQL, or MongoDB.\n- Optimize applications for performance and scalability.\n- Collaborate with front-end developers, QA engineers, and DevOps teams.\n- Participate in code reviews and contribute to improving best practices.\n- Debug, test, and fix issues across the development lifecycle.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>3+ years of experience in software development using Golang (Go).</li>\n<li>Strong understanding of concurrency, Goroutines, and channels.</li>\n<li>Experience building REST APIs or gRPC services.</li>\n<li>Knowledge of Docker, Kubernetes, or similar containerization tools.</li>\n<li>Familiarity with CI/CD pipelines, Git, and cloud platforms (AWS, GCP, or Azure).</li>\n<li>Proficiency in working with SQL/NoSQL databases.</li>\n<li>Strong problem-solving and analytical skills.</li>\n<li>Good communication and teamwork abilities.</li>\n</ul>\n<p><strong>Information Requested:</strong> Kindly mention Job code in the Subject line - GD/2026</p>",
        "tags": [
            "3+ Years",
            "Golang",
            "Docker/Kubernetes",
            "REST/gRPC"
        ],
        "summary": "Develops efficient Go code, builds RESTful APIs, and collaborates with teams to optimize performance and scalability."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27519",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Revyrie Global</strong>\n17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<a href=\"http://www.revyrieglobal.com\">Visit Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role</strong>: Business Development Executive\n<strong>Closing Date</strong>: 16, Feb 2026\n<strong>Published</strong>: 09, Feb 2026\n<strong>Contact</strong>: <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Support end-to-end business development activities including lead generation, client acquisition, and basic account management.</li>\n<li>Execute inside sales activities to ensure a steady flow of qualified leads and conversions.</li>\n<li>Assist in planning and executing sales and marketing campaigns across different industries and regions.</li>\n<li>Identify new business opportunities and contribute to market expansion initiatives.</li>\n<li>Work closely with senior leadership, marketing teams, and external partners to support growth initiatives.</li>\n<li>Maintain and update CRM systems to track leads, sales activities, and pipeline status.</li>\n<li>Follow up with prospects, conduct initial discussions, and coordinate with senior team members for closures.</li>\n<li>Conduct basic market research and competitor analysis to understand customer needs.</li>\n<li>Prepare periodic sales reports, lead status updates, and performance summaries.</li>\n<li>Handle client communication, feedback, and basic issue resolution to ensure customer satisfaction.</li>\n<li>Support account management activities to build long-term client relationships.</li>\n<li>Follow defined sales processes and contribute ideas for process improvement.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>2–3 years of relevant experience in Business Development, Inside Sales, or Lead Generation.</li>\n<li>Exposure to B2B and/or B2C sales and client interaction.</li>\n<li>Hands-on experience with CRM tools and lead research platforms.</li>\n<li>Good communication and interpersonal skills.</li>\n<li>Basic negotiation and presentation skills.</li>\n<li>Ability to analyze leads, understand customer requirements, and suggest suitable solutions.</li>\n<li>Willingness to collaborate with cross-functional teams.</li>\n<li>Basic understanding of sales planning and forecasting concepts.</li>\n<li>Proficiency in MS Office.</li>\n<li>Strong organizational skills, time management, and a results-driven mindset.</li>\n<li>Ability to work independently while meeting assigned targets.</li>\n</ul>\n<p><strong>Note</strong>: Kindly mention Job code in the Subject line - <strong>BD/2026</strong> when applying.</p>",
        "tags": [
            "2-3 Years",
            "CRM Tools",
            "B2B/B2C Sales",
            "Lead Generation"
        ],
        "summary": "Supports business development by generating leads, managing client acquisition, and executing sales campaigns. Requires CRM proficiency, B2B/B2C sales experience, and collaboration with cross-functional teams."
    },
    {
        "job_title": "LINUX SYSTEM ADMINISTRATOR",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27518",
        "location": "Technopark",
        "closing_date": "14 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Softnotions Technologies (P) Ltd\n<strong>Location:</strong> Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581\n<strong>Website:</strong> <a href=\"https://softnotions.com\">https://softnotions.com</a>\n<strong>Job Title:</strong> LINUX SYSTEM ADMINISTRATOR\n<strong>Closing Date:</strong> 14, Feb 2026\n<strong>Published Date:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3><strong>Brief Description</strong></h3>\n<ul>\n<li><strong>Operating Systems:</strong> Proficiency in Linux, Windows 2008/2012, Windows 8/10, and Apple Macintosh OS.</li>\n<li><strong>Networking:</strong> DNS, WINS, DHCP, TCP/IP, RIP v1/2, IGRP, EIGRP, OSPF, routing, web traffic management (Iptables, Squid, URL filtering), LAN design, WiFi access management, and network troubleshooting.</li>\n<li><strong>Web &amp; Database:</strong> Knowledge of Web CMS hosting, security patching, MySQL, SQL Server, Apache, IIS, and Nginx configuration.</li>\n<li><strong>Virtualization &amp; Cloud:</strong> Experience in cloud server administration, clustering, and virtualization.</li>\n<li><strong>Tools &amp; Skills:</strong> Git, Subversion, email server configuration, hardware/software troubleshooting, data security, CI server management, and asset tracking.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>4+ years of Linux experience.</li>\n<li>Web server configuration (Apache, Nginx, Tomcat).</li>\n<li>Database administration.</li>\n<li>Cloud server management.</li>\n<li>Server security hardening and optimization.</li>\n</ul>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li>Troubleshoot hardware/software issues and provide technical support.</li>\n<li>Secure office networks and manage server security (hardening, CMS updates).</li>\n<li>Upgrade systems/processes for enhanced functionality and security.</li>\n<li>Track office assets and implement system upgrades.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "Linux",
            "Web Server Administration",
            "Cloud Server Management"
        ],
        "summary": "Linux system administrator role requiring expertise in server management, cloud technologies, and security protocols. Responsibilities include configuration, troubleshooting, and optimization of IT infrastructure."
    },
    {
        "job_title": "ASP.NET / ASP.NET Core Developer – ERP (Education Product)",
        "company": "Estrrado Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27517",
        "location": "Technopark",
        "closing_date": "13 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Estrrado Technology Solutions (P) Ltd</strong>\nACE 07, 3rd Floor, CDAC Building, Technopark Campus, Trivandrum, 695581\n<a href=\"http://www.estrrado.com\">Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role</strong>: ASP.NET / ASP.NET Core Developer – ERP (Education Product)\n<strong>Closing Date</strong>: 13, Mar 2026\n<strong>Published</strong>: 09, Feb 2026\n<strong>Contact</strong>: <a href=\"mailto:career@estrrado.com\">career@estrrado.com</a></p>\n<h2>Brief Description</h2>\n<p>We seek a self-driven ASP.NET Developer to work independently on ERP-based education product modules while collaborating with the team. The role demands ownership of tasks, clear communication, and timely delivery. Candidates with ERP or education-domain experience are preferred.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Design, develop, test, and maintain web applications using <strong>ASP.NET</strong>, <strong>C#</strong>, and <strong>.NET Core</strong></li>\n<li>Own end-to-end module development from requirements to deployment</li>\n<li>Build responsive interfaces with <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>Bootstrap</strong>, and <strong>jQuery</strong></li>\n<li>Work with <strong>MS SQL Server</strong> for data handling, optimization, and reporting</li>\n<li>Translate ERP workflows into technical solutions</li>\n<li>Follow coding standards, documentation, and participate in code reviews</li>\n<li>Use <strong>AI-assisted tools</strong> (e.g., GitHub Copilot) to enhance efficiency</li>\n<li>Collaborate with QA, product, and support teams for smooth releases</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor’s degree in Computer Science/IT</li>\n<li>2–4 years of experience in <strong>ASP.NET Core</strong>, <strong>C#</strong>, and <strong>RESTful APIs</strong></li>\n<li>Proficiency in <strong>Entity Framework Core</strong> and <strong>MS SQL Server</strong> (Stored Procedures, LINQ, query optimization)</li>\n<li>Strong <strong>front-end development</strong> skills</li>\n<li>Experience with <strong>Git</strong> for version control</li>\n<li>Proven ability to work independently and collaboratively</li>\n<li>Strong ownership mindset and communication skills</li>\n</ul>\n<h2>Added Advantages</h2>\n<ul>\n<li>Prior ERP product experience</li>\n<li>Education domain exposure (CRM, LMS, Student Management Systems)</li>\n<li>Familiarity with role-based access systems</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Submit your resume to <a href=\"mailto:career@estrrado.com\">career@estrrado.com</a> with the subject line: <strong>ASP.NET / ASP.NET Core Developer – ERP (Education Product)</strong>. Applications without the correct subject line may be rejected.</p>",
        "tags": [
            "2-4 Years",
            "ASP.NET Core",
            "C#",
            "MS SQL Server"
        ],
        "summary": "ASP.NET Core Developer for ERP education product with 2-4 years experience in C#, MS SQL Server, and front-end technologies. Requires ERP/education domain expertise and collaboration skills."
    },
    {
        "job_title": "Node.js Developer",
        "company": "Revyrie Global",
        "url": "https://technopark.org/job-details/27516",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>Revyrie Global</h2>\n<p><strong>Address:</strong> 17, Lower Ground 1, Thejaswini, Technopark Campus, 695581\n<strong>Website:</strong> <a href=\"http://www.revyrieglobal.com\">http://www.revyrieglobal.com</a>\n<strong>Closing Date:</strong> 16, Feb 2026\n<strong>Job Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@revyrieglobal.com\">careers@revyrieglobal.com</a></p>\n<h3>Job Description</h3>\n<p>Design, develop, test, and maintain scalable backend services using <strong>Node.js</strong>.\n- Build and optimize <strong>RESTful</strong> and/or <strong>GraphQL APIs</strong> for web and mobile applications.\n- Implement secure authentication and authorization mechanisms (<strong>JWT</strong>, <strong>OAuth</strong>).\n- Integrate third-party APIs and external services.\n- Collaborate with frontend developers, product managers, and QA teams to deliver high-quality solutions.\n- Write clean, maintainable, and well-documented code.\n- Perform code reviews and contribute to best development practices.\n- Troubleshoot, debug, and optimize application performance.\n- Participate in architecture discussions and technical decision-making.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>2+ years</strong> of experience in backend development using <strong>Node.js</strong>.</li>\n<li>Strong proficiency in <strong>JavaScript (ES6+)</strong> and/or <strong>TypeScript</strong>.</li>\n<li>Experience with frameworks such as <strong>Express.js</strong>, <strong>NestJS</strong>.</li>\n<li>Solid understanding of <strong>RESTful API</strong> design principles.</li>\n<li>Experience with databases: <strong>MySQL</strong>, <strong>PostgreSQL</strong>, or <strong>MongoDB</strong>.</li>\n<li>Knowledge of <strong>ORMs/ODMs</strong>.</li>\n<li>Familiarity with <strong>Git</strong> and modern <strong>CI/CD pipelines</strong>.</li>\n<li>Experience with cloud platforms such as <strong>AWS</strong>, <strong>Azure</strong>, or <strong>GCP</strong>.</li>\n<li>Understanding of <strong>Docker</strong> and containerized deployments.</li>\n</ul>\n<p><strong>Information Requested:</strong> Kindly mention <strong>Job code</strong> in the Subject line - <strong>ND/2026</strong>.</p>",
        "tags": [
            "2+ Years",
            "Node.js",
            "JavaScript (ES6+)",
            "Express.js"
        ],
        "summary": "Design scalable backend services with Node.js and build RESTful/GraphQL APIs. Collaborate with teams to deliver secure, high-quality solutions."
    },
    {
        "job_title": "TRAVEL CONSULTANT",
        "company": "Sree Anand Travel & Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27515",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>Company:</strong> SREE ANAND TRAVEL &amp; TECHNOLOGIES (P) Ltd\n<strong>Address:</strong> SBC-12, Basement Floor 2, Thejaswini Building, Techno Park Campus, Karyavattom (PO), Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.anandtravel.com\">www.anandtravel.com</a>\n<strong>Job Title:</strong> TRAVEL CONSULTANT\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Job Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:anandtravel40@gmail.com\">anandtravel40@gmail.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a passionate and customer-focused <strong>Travel Consultant</strong> to join our team. You will assist clients in planning and booking travel experiences, provide expert advice, and ensure seamless journeys from start to finish.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Provide travel advice and recommendations to clients</li>\n<li>Book flights, tours, and other travel services</li>\n<li>Handle visa applications and travel insurance arrangements</li>\n<li>Manage customer queries and resolve issues promptly</li>\n<li>Stay updated on travel trends, destinations, and offers</li>\n</ul>\n<h3>Preferred Skills &amp; Requirements</h3>\n<ul>\n<li>Bachelor’s degree or diploma in <strong>Tourism/Travel Management</strong> (preferred)</li>\n<li>Prior experience in travel consulting or customer service</li>\n<li>Strong communication and interpersonal skills</li>\n<li>Knowledge of <strong>GDS systems</strong> (Amadeus, Galileo, Sabre) is an advantage</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Flexibility to work in shift timings</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your resume and cover letter to <a href=\"mailto:anandtravel40@gmail.com\">anandtravel40@gmail.com</a> by <strong>15 January 2026</strong>.</p>",
        "tags": [
            "2-4 Years",
            "GDS Systems",
            "Tourism/Travel Management",
            "Customer Service"
        ],
        "summary": "Travel Consultant role requiring 2-4 years of experience in travel consulting, GDS systems knowledge, and strong customer service skills to assist clients in planning seamless travel experiences."
    },
    {
        "job_title": "Software Test Engineer (Immediate, 2-3 years)",
        "company": "Enfin Technologies India (P) Ltd",
        "url": "https://technopark.org/job-details/27513",
        "location": "Technopark",
        "closing_date": "17 Feb 2026",
        "job_description": "<h2>Enfin Technologies India (P) Ltd</h2>\n<p><strong>Location:</strong> C 24, -2 Floor, Thejaswini, Technopark Campus, Trivandrum, Kerala. 695581\n<strong>Website:</strong> <a href=\"http://www.enfintechnologies.com\">http://www.enfintechnologies.com</a>\n<strong>Job Title:</strong> Software Test Engineer (Immediate, 2-3 years)\n<strong>Closing Date:</strong> 17, Feb 2026\n<strong>Job Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:hr@enfintechnologies.com\">hr@enfintechnologies.com</a></p>\n<h3>Brief Description</h3>\n<p>We are seeking a motivated and detail-oriented <strong>Software Test Engineer</strong> with <strong>2 to 3 years of IT experience</strong> to join our growing team. The ideal candidate will support <strong>end-to-end testing activities</strong> across multiple projects and contribute to delivering high-quality software products. <strong>Immediate joiners are preferred.</strong></p>\n<h3>Roles &amp; Responsibilities</h3>\n<ul>\n<li>Understand project requirements and prepare detailed test cases and test scenarios</li>\n<li>Perform manual testing including functional, regression, and sanity testing</li>\n<li>Identify, log, track, and retest defects using defect tracking tools</li>\n<li>Collaborate closely with developers and cross-functional teams to ensure quality deliverables</li>\n<li>Participate in test planning, test execution, and test reporting activities</li>\n<li>Support testing activities across various stages of the <strong>Software Development Life Cycle (SDLC)</strong></li>\n<li>Ensure adherence to quality standards and best testing practices</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>2 to 3 years</strong> of experience in software testing</li>\n<li>Strong knowledge of <strong>manual testing concepts</strong></li>\n<li>Basic understanding of <strong>automation testing</strong> (added advantage)</li>\n<li>Familiarity with <strong>SDLC and STLC processes</strong></li>\n<li>Strong communication and documentation skills</li>\n<li>Positive attitude with a willingness to learn and adapt</li>\n<li>Good team coordination and problem-solving abilities</li>\n</ul>\n<h3>Work Details</h3>\n<ul>\n<li><strong>Working Days:</strong> Monday to Friday</li>\n<li><strong>Work Timings:</strong> 9:30 AM – 6:30 PM</li>\n<li><strong>Work Mode:</strong> Work from Office</li>\n</ul>\n<p><strong>Interested candidates</strong> can share their resumes to <a href=\"mailto:hr@enfintechnologies.com\">hr@enfintechnologies.com</a> with the subject <strong>\"Enfin Software Test Engineer - [Mention your relevant QA experience]\"</strong>.</p>",
        "tags": [
            "2-3 Years",
            "Manual Testing",
            "Automation Testing",
            "SDLC/STLC"
        ],
        "summary": "Enfin Technologies seeks a Software Test Engineer with 2-3 years of experience to perform manual testing, collaborate with teams, and ensure quality software delivery."
    },
    {
        "job_title": "Jr. Python Developer",
        "company": "Muthoot Mercantile Ltd-It Wing",
        "url": "https://technopark.org/job-details/27512",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Muthoot Mercantile Limited is a leading Non-Banking Financial Company (NBFC) headquartered in Thiruvananthapuram, Kerala. The company is registered with the RBI as an NBFC and primarily operates in the gold loan sector. The company emphasizes trust, transparency, and customer relationships, particularly because it handles customers' valuable gold assets. Muthoot Mercantile has a wide branch network across several Indian states, including Kerala, Tamil Nadu, Maharashtra, Odisha, Punjab, Uttar Pradesh, Haryana, West Bengal, and Delhi.</p>\n<h2>Position Overview</h2>\n<p>We are seeking a <strong>Junior Python Developer</strong> to contribute to end-to-end application development, design, and build scalable backend components while maintaining high technical quality.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Own backend features from requirement understanding through design, development, and deployment.</li>\n<li>Design and implement scalable, maintainable backend services and APIs.</li>\n<li>Break down functional requirements into well-defined technical tasks and deliver within agreed timelines.</li>\n<li>Write production-grade Python code with proper error handling, logging, and performance optimization.</li>\n<li>Build and consume RESTful APIs and integrate with external services.</li>\n<li>Ensure code quality, reusability, and adherence to engineering best practices.</li>\n<li>Actively participate in code reviews and technical design discussions.</li>\n<li>Debug complex issues and continuously improve system stability and performance.</li>\n<li>Collaborate closely with frontend, QA, and product stakeholders for smooth delivery.</li>\n<li>Proactively identify technical gaps, risks, and improvement opportunities.</li>\n<li>Support and guide junior developers through technical reviews and knowledge sharing.</li>\n<li>Follow Git-based version control, code review workflows, and Agile/Scrum development practices.</li>\n</ul>\n<h2>Requirements &amp; Qualifications</h2>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or equivalent.</li>\n<li><strong>1-3 years of experience</strong> in software development.</li>\n<li>Strong hands-on experience in <strong>Core Python</strong> for application and backend development.</li>\n<li>Experience with at least one Python web framework: <strong>Django</strong>, <strong>FastAPI</strong>, or <strong>Flask</strong>.</li>\n<li>Solid understanding of <strong>Object-Oriented Programming (OOP)</strong>, data structures, and algorithms.</li>\n<li>Experience designing and implementing scalable backend services.</li>\n<li>Strong experience with <strong>RESTful API</strong> development and consumption.</li>\n<li>Exposure to <strong>SQL</strong> and/or <strong>NoSQL databases</strong> and data access patterns.</li>\n<li>Experience with <strong>Git</strong> and collaborative development workflows.</li>\n<li>Ability to debug complex backend issues and optimize performance.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Familiarity with Python libraries (as required by the application).</li>\n<li>Exposure to image processing or data processing modules.</li>\n<li>Awareness or hands-on experience with <strong>LLMs</strong>, <strong>AI/ML APIs</strong>, or <strong>GenAI integrations</strong>.</li>\n<li>Experience working in <strong>Agile/Scrum</strong> environments.</li>\n<li>Proven ability to work as an individual contributor.</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Competitive salary.</li>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>PF/ESI/Medical Insurance.</li>\n<li>A collaborative and innovative work environment.</li>\n</ul>\n<h2>How to Apply</h2>\n<p>If you are a motivated and experienced Python Developer, looking for a challenging opportunity to contribute to the success of a leading NBFC group, apply with a detailed resume via email: <strong>hr@muthootenterprises.com</strong> with the subject line <strong>Application for Python Developer</strong> and include information on notice period, current, and expected CTC.</p>\n<p><strong>Closing Date:</strong> 16 Feb 2026\n<strong>Job Published:</strong> 09 Feb 2026</p>",
        "tags": [
            "1-3 Years",
            "Python",
            "Django/Flask",
            "RESTful APIs"
        ],
        "summary": "Muthoot Mercantile seeks a Python Developer with 1-3 years of experience to design scalable backend services, APIs, and collaborate across teams. Requires Python, Django/Flask, and RESTful API expertise for a leading NBFC in gold loans."
    },
    {
        "job_title": "Senior Quality Assurance Engineers (10 - 15 yrs)",
        "company": "Haspaces It & Hospitality (P) Ltd",
        "url": "https://technopark.org/job-details/27511",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Senior Quality Assurance Engineer</h2>\n<p><strong>Company:</strong> HASpaces IT &amp; Hospitality (P) Ltd\n<strong>Location:</strong> 2nd Floor, Pamba, Technopark Phase 1 Campus, 695581\n<strong>Website:</strong> <a href=\"https://www.haspaces.com\">https://www.haspaces.com</a>\n<strong>Closing Date:</strong> 27, Feb 2026\n<strong>Published Date:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@haspaces.com\">careers@haspaces.com</a></p>\n<h3>About the Role</h3>\n<p>At HAS, we don’t just test software — we elevate digital experiences that make life smarter, smoother, and more efficient. Our team of passionate professionals pushes boundaries, embraces innovation, and transforms ideas into reality with uncompromising quality. We collaborate, experiment, question, and refine — because excellence isn’t just a goal here; it’s a mindset. Whether it’s ensuring performance at scale, validating seamless workflows, or safeguarding application security, HAS stands as a trusted backbone of transformation in everything we do.</p>\n<h3>What You’ll Be Doing</h3>\n<ul>\n<li><strong>Own the Quality Game:</strong> Take charge of ensuring every code change promoted to production meets top-tier quality standards.</li>\n<li><strong>Test Like a Pro:</strong> Build and maintain detailed test plans, test cases, and validation strategies for functional and non-functional needs.</li>\n<li><strong>Be Everywhere:</strong> Perform manual and automated testing across web, backend, and API layers.</li>\n<li><strong>Break It Before Users Do:</strong> Execute regression, integration, and performance tests using tools like JMeter and LoadUI.</li>\n<li><strong>Automate Like a Boss:</strong> Create automation scripts using Selenium, TestIM, ReadyAPI, and Postman.</li>\n<li><strong>Report with Precision:</strong> Log defects, track progress, and communicate clearly using JIRA.</li>\n<li><strong>Collaborate Fearlessly:</strong> Work with developers, business teams, and analysts to troubleshoot, validate requirements, and keep deliverables rock-solid.</li>\n<li><strong>Think Like the User:</strong> Analyze and validate requirements to ensure a seamless and intuitive user experience.</li>\n<li><strong>Be an Agile Ninja:</strong> Participate in sprint planning, stand-ups, reviews, and retrospectives.</li>\n<li><strong>Estimate Smartly:</strong> Provide accurate testing timelines without wild guessing.</li>\n<li><strong>Champion Standards:</strong> Ensure compliance with accessibility guidelines like AODA and security best practices.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>8+ years</strong> of experience in software QA across manual and automation testing.</li>\n<li><strong>2+ years</strong> of hands-on experience working in Agile/SCRUM environments.</li>\n<li><strong>API Superpowers:</strong> Expertise in testing REST and SOAP services.</li>\n<li><strong>Automation Wizardry:</strong> Skilled at building and maintaining automation frameworks.</li>\n<li><strong>Tech Toolkit:</strong> Experience with Selenium, TestIM, ReadyAPI, Postman, JMeter, LoadUI, Quality Center, Jenkins, ADO, Git, and more.</li>\n<li><strong>Cloud &amp; Containers:</strong> Familiarity with Microsoft Azure and OpenShift (bonus points).</li>\n<li><strong>Scripting Skills:</strong> Knowledge of Java, JavaScript, or Groovy for automation scripting.</li>\n<li><strong>QA Mastery:</strong> Strong understanding of SDLC, QA processes, best practices, and standards.</li>\n<li><strong>Communication Rockstar:</strong> Ability to document, report, and communicate clearly with technical and non-technical teams.</li>\n<li><strong>Analytical Mindset:</strong> A knack for identifying root causes and preventing issues before they grow.</li>\n</ul>\n<h3>Why You’ll Love Working with Us</h3>\n<p>At HAS, we blend innovation with passion. Your ideas are heard, your work creates impact, and your career grows with every challenge you overcome. If you’re ready to elevate software quality and be part of something meaningful, this is your place.</p>\n<p><strong>Apply today and make an impact!</strong></p>",
        "tags": [
            "10-15 Years",
            "Selenium",
            "JMeter",
            "Agile/SCRUM"
        ],
        "summary": "Senior QA Engineer ensures software quality through manual/automated testing, API validation, and Agile collaboration using tools like Selenium and JMeter."
    },
    {
        "job_title": "Manager - Java Developer (12 - 15 yrs)",
        "company": "Haspaces It & Hospitality (P) Ltd",
        "url": "https://technopark.org/job-details/27510",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Manager - Java Developer</h2>\n<p><strong>Company</strong>: HASpaces IT &amp; Hospitality (P) Ltd\n<strong>Location</strong>: 2nd Floor, Pamba, Technopark Phase 1 Campus, 695581\n<strong>Website</strong>: <a href=\"https://www.haspaces.com\">https://www.haspaces.com</a>\n<strong>Closing Date</strong>: 27, Feb 2026\n<strong>Job Published</strong>: 09, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:careers@haspaces.com\">careers@haspaces.com</a></p>\n<h3>About the Role</h3>\n<p>At HAS, we don’t just build software – we create seamless digital experiences that make life easier, smarter, and more efficient. Our team is driven by innovation, collaboration, and a passion for solving complex challenges. Here, your work matters, your ideas are valued, and your growth is limitless. If you’re looking for a place where excellence is a mindset and impact is guaranteed, welcome to HAS.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Lead a team of developers and oversee project deliverables.</li>\n<li>Design and develop scalable cloud-native backend components.</li>\n<li>Architect and implement RESTful and SOAP APIs with Azure APIM.</li>\n<li>Guide microservices development and design decisions.</li>\n<li>Develop CI/CD pipelines using Jenkins, ADO, and OpenShift.</li>\n<li>Review code quality and ensure best development practices.</li>\n<li>Collaborate with business and technical stakeholders with clear communication.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>8+ years of backend development experience with Java/J2EE.</li>\n<li>3+ years of people management or team leadership experience.</li>\n<li>Proven success building microservices and Spring Boot applications.</li>\n<li>Hands-on cloud experience (Azure/OpenShift).</li>\n<li>Strong CI/CD, DevOps, and automation expertise.</li>\n<li>Ability to lead technical initiatives and mentor team members.</li>\n</ul>\n<h3>Why You’ll Love Working with Us</h3>\n<p>At HAS, we blend innovation with passion. Your ideas matter, your expertise counts, and your work makes a real impact. Apply today and make an impact!</p>",
        "tags": [
            "12-15 Years",
            "Java/J2EE",
            "Spring Boot",
            "Azure/OpenShift"
        ],
        "summary": "Lead a Java development team to design cloud-native systems, microservices, and CI/CD pipelines with Azure and Spring Boot."
    },
    {
        "job_title": "Senior Accessibility Compliance Specialist (8 - 15 yrs)",
        "company": "Haspaces It & Hospitality (P) Ltd",
        "url": "https://technopark.org/job-details/27509",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Senior Accessibility Compliance Specialist</h2>\n<p><strong>Company:</strong> HASpaces IT &amp; Hospitality (P) Ltd\n<strong>Location:</strong> 2nd Floor, Pamba, Technopark Phase 1 Campus, 695581\n<strong>Website:</strong> <a href=\"https://www.haspaces.com\">https://www.haspaces.com</a>\n<strong>Closing Date:</strong> 27, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@haspaces.com\">careers@haspaces.com</a></p>\n<h3>About the Role</h3>\n<p>At HAS, we don’t just build software – we create seamless digital experiences that make life easier, smarter, and more efficient. Our team is driven by innovation, collaboration, and a passion for solving complex challenges. Here, your work matters, your ideas are valued, and your growth is limitless. If you’re looking for a place where excellence is a mindset and impact is guaranteed, welcome to HAS.</p>\n<h3>What You’ll Be Doing</h3>\n<ul>\n<li>Evaluate applications for accessibility compliance under <strong>WCAG</strong>, <strong>AODA</strong>, and related standards.</li>\n<li>Perform functional and non-functional accessibility testing.</li>\n<li>Identify, document, and validate accessibility issues across applications.</li>\n<li>Work with SMEs, developers, and analysts to ensure regulatory compliance.</li>\n<li>Create and maintain accessibility test cases and automation scripts.</li>\n<li>Use tools like <strong>Axe</strong>, <strong>JAWS</strong>, <strong>NVDA</strong>, <strong>Accessibility Insights</strong>, <strong>WAVE</strong>, and <strong>PDF evaluators</strong>.</li>\n<li>Support multiple teams with guidance on accessible design and implementation.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>8+ years</strong> of accessibility compliance experience.</li>\n<li>Expert knowledge of <strong>WCAG 2.0/2.1 AA</strong>, <strong>WAI-ARIA</strong>, <strong>AODA</strong>.</li>\n<li>Experience with accessibility automation tools and assistive technologies.</li>\n<li>Strong background in QA, functional testing, and scripting.</li>\n<li>Ability to create structured, scalable accessibility test cases.</li>\n<li>Strong analytical and communication skills with ability to work independently.</li>\n</ul>\n<h3>Why You’ll Love Working with Us</h3>\n<p>At HAS, we blend innovation with passion. Your ideas matter, your expertise counts, and your work makes a real impact.</p>\n<p><strong>Apply today and make an impact!</strong></p>",
        "tags": [
            "8-15 Years",
            "WCAG 2.0/2.1 AA",
            "AODA",
            "WAI-ARIA"
        ],
        "summary": "Evaluate software for accessibility compliance using WCAG and AODA standards. Collaborate with teams to ensure regulatory adherence and create test cases with automation tools."
    },
    {
        "job_title": "Senior Java Developer - 10+ Yrs",
        "company": "Haspaces It & Hospitality (P) Ltd",
        "url": "https://technopark.org/job-details/27508",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>Senior Java Developer</h2>\n<p><strong>Company:</strong> HASpaces IT &amp; Hospitality (P) Ltd\n<strong>Location:</strong> 2nd Floor, Pamba, Technopark Phase 1 Campus, 695581\n<strong>Website:</strong> <a href=\"https://www.haspaces.com\">https://www.haspaces.com</a>\n<strong>Closing Date:</strong> 27, Feb 2026\n<strong>Published Date:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> careers@haspaces.com</p>\n<h3>About the Role</h3>\n<p>At HAS, we don’t just build software – we create seamless digital experiences that make life easier, smarter, and more efficient. Our team is driven by innovation, collaboration, and a passion for solving complex challenges. Here, your work matters, your ideas are valued, and your growth is limitless. If you’re looking for a place where excellence is a mindset and impact is guaranteed, welcome to HAS.</p>\n<h3>What You’ll Be Doing</h3>\n<ul>\n<li>Design and develop scalable backend components using <strong>Java</strong>, <strong>Spring Boot</strong>, and <strong>J2EE</strong>.</li>\n<li>Build and optimize <strong>RESTful</strong> and <strong>SOAP APIs</strong>.</li>\n<li>Develop <strong>CI/CD pipelines</strong> using <strong>Jenkins</strong>, <strong>Azure DevOps</strong>, and <strong>OpenShift</strong>.</li>\n<li>Write clean, maintainable server-side code and conduct code reviews.</li>\n<li>Collaborate with cross-functional teams within an <strong>Agile</strong> environment.</li>\n<li>Ensure security using <strong>Fortify</strong> and <strong>WAF policies</strong>.</li>\n<li>Troubleshoot performance issues and improve backend efficiency.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>10+ years</strong> of backend development experience with strong <strong>Java/J2EE</strong> expertise.</li>\n<li>Experience building containerized <strong>Spring Boot</strong> applications.</li>\n<li>Hands-on exposure to <strong>OpenShift</strong> and <strong>Azure</strong> cloud.</li>\n<li>Strong understanding of <strong>microservices</strong> and backend integration patterns.</li>\n<li>Familiarity with automation, <strong>CI/CD</strong>, and <strong>DevOps</strong> practices.</li>\n<li>Excellent communication, collaboration, and problem-solving skills.</li>\n</ul>\n<h3>Why You’ll Love Working with Us</h3>\n<p>At HAS, we blend innovation with passion. Your ideas matter, your expertise counts, and your work makes a real impact.</p>\n<p><strong>Apply today and make an impact!</strong></p>",
        "tags": [
            "10+ Years",
            "Java",
            "Spring Boot",
            "OpenShift"
        ],
        "summary": "Senior Java Developer with 10+ years of experience in backend development, microservices, and cloud technologies. Focus on Java, Spring Boot, and OpenShift for scalable solutions."
    },
    {
        "job_title": "Senior Full Stack Developer (7 - 10 yrs)",
        "company": "Haspaces It & Hospitality (P) Ltd",
        "url": "https://technopark.org/job-details/27507",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<p><strong>Company Overview</strong></p>\n<p>At HASpaces IT &amp; Hospitality (P) Ltd, we don’t just build software – we create seamless digital experiences that make life easier, smarter, and more efficient. Our team is driven by innovation, collaboration, and a passion for solving complex challenges. Here, your work matters, your ideas are valued, and your growth is limitless. If you’re looking for a place where excellence is a mindset and impact is guaranteed, welcome to HAS.</p>\n<p><strong>What You’ll Be Doing</strong></p>\n<ul>\n<li>Design, develop, and maintain full-stack applications using <strong>Java, J2EE</strong>, and <strong>Spring Boot</strong>.</li>\n<li>Build responsive front-end interfaces using <strong>Angular (12+), TypeScript, HTML</strong>, and <strong>CSS</strong>.</li>\n<li>Develop and consume <strong>REST APIs</strong> and integrate frontend with backend services.</li>\n<li>Collaborate with <strong>UI/UX teams</strong> and <strong>product owners</strong> to deliver high-quality features.</li>\n<li>Participate in <strong>Agile processes</strong> including sprint planning and reviews.</li>\n<li>Ensure clean coding practices, documentation, and version control.</li>\n</ul>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>5+ years of <strong>Java/J2EE development</strong> experience.</li>\n<li>2+ years of <strong>Angular (12+)</strong> and modern frontend experience.</li>\n<li>Experience with <strong>Git, Gerrit, Jenkins</strong>, and <strong>Agile methodology</strong>.</li>\n<li>Strong understanding of <strong>REST APIs</strong> and cloud deployments.</li>\n<li>Excellent problem-solving and communication abilities.</li>\n</ul>\n<p><strong>Why You’ll Love Working with Us</strong></p>\n<p>At HAS, we blend innovation with passion. Your ideas matter, your expertise counts, and your work makes a real impact.</p>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li><strong>Address</strong>: 2nd Floor, Pamba, Technopark Phase 1 Campus, 695581</li>\n<li><strong>Website</strong>: <a href=\"https://www.haspaces.com\">https://www.haspaces.com</a></li>\n<li><strong>Email</strong>: <a href=\"mailto:careers@haspaces.com\">careers@haspaces.com</a></li>\n</ul>\n<p><strong>Apply today and make an impact!</strong></p>",
        "tags": [
            "7-10 Years",
            "Java/J2EE",
            "Angular",
            "REST APIs"
        ],
        "summary": "Senior Full Stack Developer with 7-10 years of experience in Java, Angular, and REST APIs. Requires expertise in full-stack development and Agile methodologies."
    },
    {
        "job_title": "QA Engineer- Snowflake",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27506",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Arch Global Services India</strong>\n4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583\n<a href=\"https://www.archgroup.com\">Company Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Job Title</strong>: QA Engineer - Snowflake\n<strong>Closing Date</strong>: 26, Mar 2026\n<strong>Published Date</strong>: 09, Feb 2026\n<strong>Contact Email</strong>: talentsuccess@talent500.co</p>\n<h3>About Arch</h3>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in over a dozen countries. As a part of the S&amp;P 500, Arch provides insurance, reinsurance, and mortgage insurance globally, valued for innovation and dependable risk management.</p>\n<h3>Role Overview</h3>\n<p><strong>Snowflake QA Analyst</strong>\nWe seek a QA Analyst to ensure the accuracy, reliability, and quality of Snowflake-based data pipelines, warehouse processes, and analytics solutions.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and execute test cases for Snowflake data pipelines, transformations, and SQL logic.</li>\n<li>Validate data integrity, lineage, and business rules across ETL/ELT workflows.</li>\n<li>Perform functional, regression, integration, and backend database testing.</li>\n<li>Log defects, track resolutions, and collaborate with data engineers and developers.</li>\n<li>Review requirements and provide QA input during design and development.</li>\n<li>Document test results and support post-deployment validation.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong SQL skills with hands-on Snowflake experience.</li>\n<li>Experience testing data pipelines (ADF, Airflow, Informatica, DBT, etc.).</li>\n<li>Solid understanding of data warehousing concepts and cloud platforms (Azure/AWS/GCP).</li>\n<li>Familiarity with QA processes, defect management tools (e.g., JIRA), and Agile practices.</li>\n<li>Strong analytical and communication skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>5–8 years in QA, with 1–2 years in data/Snowflake testing.</li>\n<li>Experience validating dashboards/reports and BI tools.</li>\n<li>ISTQB/CSQA or relevant QA certifications (preferred).</li>\n<li>Experience in insurance or financial services is a plus.</li>\n</ul>\n<h3>Confidential Information</h3>\n<p>Preferred Skills: Snowflake</p>",
        "tags": [
            "5-8 Years",
            "Snowflake",
            "SQL",
            "Data Pipelines"
        ],
        "summary": "QA Analyst for Snowflake data pipelines, ensuring accuracy and reliability. Requires strong SQL, data testing, and cloud platform expertise."
    },
    {
        "job_title": "Senior Software Engineer - ImageRight",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27505",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>About Arch</h2>\n<p>At Arch, we believe our strength lies in our people and our ability to innovate together. We’re proud to offer challenging, rewarding careers in analytics, technology, actuarial, operations, and more. We’re looking to grow our India team with individuals who want to make their mark at a dynamic global insurer.</p>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance, and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h2>About Global Services India</h2>\n<p>Arch Global Services India, established in 2025, is the newest part of Arch’s Global Service Organization. With offices in Hyderabad, Trivandrum, and Pune, Arch Global Services India is strategically positioned to provide support to Arch Insurance, Reinsurance, and Mortgage divisions globally. At Arch Global Services India, we collaborate with teams across the globe to develop and implement solutions that deliver exceptional results for our clients worldwide.</p>\n<h2>Position: ImageRight - Senior Developer</h2>\n<h3>Position Overview</h3>\n<p>The Senior ImageRight Developer will design, develop, and implement document management solutions using the ImageRight platform. This role requires advanced technical expertise in ImageRight, strong understanding of insurance workflows, and the ability to lead development efforts for complex document storage and retrieval projects.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Design and develop ImageRight workflows, templates, and integrations to meet business requirements.</li>\n<li>Customize and configure ImageRight solutions for document storage and retrieval.</li>\n<li>Integrate ImageRight with core insurance systems such as Guidewire or other platforms.</li>\n<li>Collaborate with business analysts and architects to translate requirements into technical specifications.</li>\n<li>Conduct unit testing and support system testing and UAT.</li>\n<li>Troubleshoot and resolve issues related to ImageRight configurations and integrations.</li>\n<li>Maintain documentation for design, configuration, and deployment processes.</li>\n<li>Mentor junior developers and ensure adherence to best practices and ImageRight standards.</li>\n</ul>\n<h3>Qualifications:</h3>\n<p><strong>Education:</strong> Bachelor’s or Master’s degree in Computer Science, Information Technology, or related field.</p>\n<p><strong>Experience:</strong>\n- Minimum 8 years in software development with at least 4+ years in ImageRight or similar document management platforms.\n- Proven experience in document storage and workflow automation.</p>\n<h3>Technical Skills:</h3>\n<ul>\n<li>Expertise in ImageRight configuration and workflow design.</li>\n<li>Strong knowledge of document management technologies and integration via REST APIs.</li>\n<li>Familiarity with SQL and database concepts.</li>\n<li>Understanding of Agile methodologies and DevOps practices.</li>\n</ul>\n<h3>Soft Skills:</h3>\n<ul>\n<li>Excellent communication, problem-solving, and leadership abilities.</li>\n</ul>\n<h3>Preferred Additional Skills:</h3>\n<ul>\n<li>Experience with P&amp;C insurance domain.</li>\n<li>Knowledge of cloud deployments (Azure) and hybrid architectures.</li>\n<li>Exposure to Guidewire integration accelerators.</li>\n</ul>\n<p><strong>Contact Email:</strong> talentsuccess@talent500.co</p>\n<p><strong>Job Published:</strong> 09, Feb 2026\n<strong>Closing Date:</strong> 26, Mar 2026</p>",
        "tags": [
            "8+ Years",
            "ImageRight",
            "REST APIs",
            "SQL"
        ],
        "summary": "Senior Software Engineer in ImageRight with 8+ years experience, specializing in document management solutions and integrations. Requires expertise in ImageRight workflows, REST APIs, and SQL for insurance systems."
    },
    {
        "job_title": "Developer - Insbridge",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27504",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>About Arch</h2>\n<p>At Arch, we believe our strength lies in our people and our ability to innovate together. We’re proud to offer challenging, rewarding careers in analytics, technology, actuarial, operations, and more. We’re looking to grow our India team with individuals who want to make their mark at a dynamic global insurer.</p>\n<p><strong>Arch Capital Group Ltd. (Arch)</strong> is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance, and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h2>About Global Services India</h2>\n<p><strong>Arch Global Services India</strong>, established in 2025, is the newest part of Arch’s Global Service Organization. With offices in Hyderabad, Trivandrum, and Pune, Arch Global Services India is strategically positioned to provide support to Arch Insurance, Reinsurance, and Mortgage divisions globally. At Arch Global Services India, we collaborate with teams across the globe to develop and implement solutions that deliver exceptional results for our clients worldwide.</p>\n<h2>Position Overview</h2>\n<p>The <strong>Insbridge Developer</strong> will design, develop, and maintain rating solutions using the <strong>Insbridge</strong> platform. This role requires strong technical expertise in <strong>Insbridge</strong>, understanding of insurance rating processes, and the ability to deliver high-quality solutions in collaboration with business and technical teams.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design and configure rating models using <strong>Insbridge Rating System</strong>.</li>\n<li>Develop and maintain rating algorithms, tables, and rules.</li>\n<li>Collaborate with business analysts to gather requirements and translate them into technical specifications.</li>\n<li>Integrate <strong>Insbridge</strong> with policy administration systems (e.g., <strong>Guidewire PolicyCenter</strong>).</li>\n<li>Conduct unit testing and support system testing and UAT.</li>\n<li>Troubleshoot and resolve issues related to rating logic and integration.</li>\n<li>Maintain documentation for rating configurations and deployment processes.</li>\n<li>Ensure compliance with regulatory and business standards.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li><strong>Education</strong>: Bachelor’s degree in computer science, Information Technology, or related field.</li>\n<li><strong>Experience</strong>: Minimum <strong>5+ years</strong> in software development with at least <strong>3+ years</strong> in <strong>Insbridge</strong> rating configuration.</li>\n<li>Strong understanding of insurance rating and underwriting processes.</li>\n</ul>\n<h2>Technical Skills</h2>\n<ul>\n<li>Expertise in <strong>Insbridge Rating System</strong> and rating logic design.</li>\n<li>Familiarity with <strong>Guidewire PolicyCenter</strong> integration.</li>\n<li>Knowledge of <strong>SQL</strong> and data validation.</li>\n<li>Understanding of <strong>Agile methodologies</strong> and <strong>DevOps</strong> practices.</li>\n</ul>\n<h2>Soft Skills</h2>\n<ul>\n<li>Excellent communication, analytical thinking, and problem-solving abilities.</li>\n</ul>\n<h2>Preferred Additional Skills</h2>\n<ul>\n<li>Experience with <strong>P&amp;C insurance</strong> domain.</li>\n<li>Exposure to cloud environments (<strong>AWS/Azure</strong>).</li>\n<li>Knowledge of performance tuning and optimization for rating engines.</li>\n</ul>\n<h2>Contact Information</h2>\n<ul>\n<li><strong>Company</strong>: Arch Global Services India</li>\n<li><strong>Address</strong>: 4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583</li>\n<li><strong>Website</strong>: <a href=\"https://www.archgroup.com\">https://www.archgroup.com</a></li>\n<li><strong>Contact Email</strong>: <a href=\"mailto:talentsuccess@talent500.co\">talentsuccess@talent500.co</a></li>\n<li><strong>Closing Date</strong>: 26, Mar 2026</li>\n<li><strong>Job Published</strong>: 09, Feb 2026</li>\n</ul>",
        "tags": [
            "5+ Years",
            "Insbridge Rating System",
            "Guidewire PolicyCenter",
            "SQL"
        ],
        "summary": "Design and maintain insurance rating solutions using Insbridge, requiring 5+ years of software development and 3+ years in Insbridge configuration."
    },
    {
        "job_title": "Senior Software Engineer - Ghostdraft",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27503",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>Company Overview</h2>\n<p><strong>Arch Global Services India</strong> is part of Arch Capital Group Ltd., a leading global insurer with operations across multiple countries. Established in 2025, Arch Global Services India supports Arch Insurance, Reinsurance, and Mortgage divisions globally. The company emphasizes innovation, collaboration, and a strong team-oriented culture.</p>\n<h2>Position Overview</h2>\n<p><strong>Senior Software Engineer - Ghostdraft</strong></p>\n<p><strong>Closing Date:</strong> 26, Mar 2026\n<strong>Published Date:</strong> 09, Feb 2026\n<strong>Location:</strong> Trivandrum, Kerala\n<strong>Contact Email:</strong> talentsuccess@talent500.co</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop Ghostdraft templates/workflows for policy, billing, and claims documents.</li>\n<li>Customize/configure Ghostdraft solutions for insurance workflows.</li>\n<li>Integrate Ghostdraft with core systems like Guidewire or Duck Creek.</li>\n<li>Collaborate with analysts/architects to translate requirements into technical specs.</li>\n<li>Conduct unit testing, support system/UAT testing, and resolve issues.</li>\n<li>Maintain documentation for design, configuration, and deployment.</li>\n<li>Mentor junior developers and enforce best practices.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li><strong>Education:</strong> Bachelor’s/Master’s in Computer Science/IT or related field.</li>\n<li><strong>Experience:</strong> 8+ years in software development (4+ years in Ghostdraft or similar CCM platforms).</li>\n<li><strong>Technical Skills:</strong></li>\n<li>Expertise in Ghostdraft Studio/Data Workbench.</li>\n<li>Strong XML/data mapping and REST API integration skills.</li>\n<li>SQL/database knowledge.</li>\n<li>Agile/DevOps familiarity.</li>\n<li><strong>Soft Skills:</strong> Excellent communication, problem-solving, and leadership.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>P&amp;C insurance domain experience.</li>\n<li>Cloud deployments (Azure) and hybrid architectures.</li>\n<li>Guidewire/Duck Creek integration accelerators.</li>\n</ul>\n<h3>Company Values</h3>\n<p>At Arch, innovation and teamwork drive success. The role offers opportunities to contribute to global insurance solutions while working with cutting-edge technologies.</p>",
        "tags": [
            "8+ Years",
            "Ghostdraft",
            "REST APIs",
            "SQL"
        ],
        "summary": "Senior Ghostdraft Developer needed for document automation in insurance. Requires 8+ years experience, Ghostdraft expertise, and integration skills."
    },
    {
        "job_title": "Senior Data Engineer - Snowflake",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27502",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>About Arch</h2>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance, and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h2>Senior Data Engineer - Snowflake</h2>\n<h3>Job Description</h3>\n<p>The Data Engineer will play a key role in designing, developing, and maintaining enterprise-grade ELT/ETL solutions within a Snowflake-based data warehouse environment. This individual will collaborate with internal and external partners across technology and business teams to deliver high-quality data products, enhance platform capabilities, and ensure the reliability of production data pipelines. The ideal candidate will possess strong SQL expertise, hands-on Snowflake and Informatica experience, and a solid background in ETL/ELT development using modern data engineering tools and practices. This role requires the ability to critically analyze business requirements, design scalable data architectures, drive data quality and standardization initiatives, and mentor junior team members. Experience in the P&amp;C insurance or reinsurance industry is highly desirable.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Design, develop, and maintain ELT/ETL solutions within Snowflake and related cloud ecosystems.</li>\n<li>Produce detailed design specifications, technical documentation, and unit test plans.</li>\n<li>Critically analyze business requirements and translate them into robust, scalable data solutions.</li>\n<li>Architect and implement data models for data warehouse, data lake, and data hub environments.</li>\n<li>Develop and maintain data engineering standards, coding practices, and reusable frameworks.</li>\n<li>Work closely with product managers to identify gaps and develop actionable remediation plans.</li>\n<li>Partner with business stakeholders and technology teams to implement product and data enhancements.</li>\n<li>Recommend innovative solutions to improve performance, efficiency, and competitive positioning.</li>\n<li>Provide production maintenance and support for data pipelines and data warehouse environments.</li>\n<li>Build automated monitoring and alerting mechanisms for data loads and data quality checks.</li>\n<li>Ensure high system availability, reliability, and timely issue resolution.</li>\n<li>Contribute to the development and continuous improvement of data engineering best practices.</li>\n<li>Support data standardization, conformance, and transformation initiatives across the enterprise.</li>\n<li>Apply strong understanding of MDM and reference data to improve data consistency and usability.</li>\n<li>Adhere to CI/CD processes, source code management practices, and branching strategies (Git).</li>\n<li>Mentor and guide junior offshore developers to ensure delivery excellence.</li>\n<li>Foster a culture of quality, innovation, and continuous improvement.</li>\n</ul>\n<h3>Required Qualifications</h3>\n<ul>\n<li>Strong proficiency in SQL, ELT/ETL design, and data transformation.</li>\n<li>Minimum 6-8 years of ETL/ELT experience using tools such as Informatica, Databricks, Snowflake, and Azure Data Factory.</li>\n<li>Minimum 3+ years of data engineering experience working with enterprise data pipelines.</li>\n<li>At least 2 years of hands-on Snowflake experience.</li>\n<li>Experience integrating external data feeds and enriching internal datasets.</li>\n<li>Strong understanding of data modeling methodologies (warehouse, lake, hub).</li>\n<li>Experience with automated pipeline monitoring and production support.</li>\n<li>Strong understanding of CI/CD tooling and pipelines in a data engineering context.</li>\n<li>Solid knowledge of Git, including branching, merging, conflict resolution, and baseless merges.</li>\n<li>Exposure to MDM and reference data management principles.</li>\n<li>Experience working in the insurance or reinsurance industry (highly desirable).</li>\n<li>3+ years working in Agile/Scrum environments.</li>\n<li>Excellent communication skills and ability to collaborate with both technical and non-technical teams.</li>\n<li>Strong analytical thinking and problem-solving capabilities.</li>\n<li>Ability to recommend innovative ideas and drive continuous improvements.</li>\n</ul>\n<h3>Contact Information</h3>\n<p><strong>Email:</strong> <a href=\"mailto:talentsuccess@talent500.co\">talentsuccess@talent500.co</a></p>",
        "tags": [
            "6-8 Years",
            "Snowflake",
            "Informatica",
            "Databricks"
        ],
        "summary": "Senior Data Engineer required for Snowflake-based data warehouse solutions in the insurance industry. 6-8 years of ETL/ELT experience with Informatica, Databricks, and Snowflake."
    },
    {
        "job_title": "Senior QA Engineer - Snowflake",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27501",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<p><strong>Arch Global Services India</strong>\n4th Floor, Niagara Building\nTechno Park Phase-3\nTrivandrum, Kerala, 695583\n<a href=\"https://www.archgroup.com\">Company Website</a></p>\n<p><strong>Senior QA Engineer - Snowflake</strong>\n<strong>Closing Date:</strong> 26, Mar 2026\n<strong>Job Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:talentsuccess@talent500.co\">talentsuccess@talent500.co</a></p>\n<h3>About Arch</h3>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in over a dozen countries. We provide insurance, reinsurance, and mortgage insurance globally, valued as an innovative partner and dependable risk manager. As part of the S&amp;P 500, Arch maintains a strong market-leading position in specialty insurance.</p>\n<h3>Role Overview</h3>\n<p>We seek a <strong>Snowflake QA Analyst</strong> to ensure the accuracy, reliability, and quality of Snowflake-based data pipelines, warehouse processes, and analytics solutions.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and execute test cases for Snowflake data pipelines, transformations, and SQL logic.</li>\n<li>Validate data integrity, lineage, and business rules across ETL/ELT workflows.</li>\n<li>Perform functional, regression, integration, and backend database testing.</li>\n<li>Log defects, track resolutions, and collaborate with data engineers and developers.</li>\n<li>Review requirements and provide QA input during design and development.</li>\n<li>Document test results and support post-deployment validation.</li>\n</ul>\n<h3>Required Skills</h3>\n<ul>\n<li>Strong SQL skills with hands-on Snowflake experience.</li>\n<li>Experience testing data pipelines (ADF, Airflow, Informatica, DBT, etc.).</li>\n<li>Solid understanding of data warehousing concepts and cloud platforms (Azure/AWS/GCP).</li>\n<li>Familiarity with QA processes, defect management tools (e.g., JIRA), and Agile practices.</li>\n<li>Strong analytical and communication skills.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>5–8 years in QA, with at least 1–2 years in data/Snowflake testing.</li>\n<li>Experience validating dashboards/reports and BI tools.</li>\n<li>ISTQB/CSQA or relevant QA certifications (preferred).</li>\n<li>Experience in insurance or financial services is a plus.</li>\n</ul>\n<h3>Confidential Information</h3>\n<p>Preferred Skills: Selenium</p>",
        "tags": [
            "5–8 Years",
            "Snowflake",
            "SQL",
            "Data Pipelines"
        ],
        "summary": "QA Engineer for Snowflake data pipelines with expertise in SQL, data warehousing, and testing tools. Requires 5–8 years of QA experience, including data/Snowflake testing."
    },
    {
        "job_title": "Data Engineer - Snowflake",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27500",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<p><strong>Arch Global Services India</strong></p>\n<p><strong>Address:</strong> 4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583\n<strong>Website:</strong> <a href=\"https://www.archgroup.com\">https://www.archgroup.com</a>\n<strong>Contact Email:</strong> talentsuccess@talent500.co</p>\n<p><strong>Closing Date:</strong> 26, Mar 2026\n<strong>Job Published:</strong> 09, Feb 2026</p>\n<h3>About Arch</h3>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in over a dozen countries. We write insurance, reinsurance, and mortgage insurance worldwide, valued as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h3>Job Description</h3>\n<p><strong>Role:</strong> Snowflake QA Analyst</p>\n<p><strong>Responsibilities:</strong>\n- Develop and execute test cases for Snowflake data pipelines, transformations, and SQL logic.\n- Validate data integrity, lineage, and business rules across ETL/ELT workflows.\n- Perform functional, regression, integration, and backend database testing.\n- Log defects, track resolutions, and collaborate with data engineers and developers.\n- Review requirements and provide QA input during design and development.\n- Document test results and support post-deployment validation.</p>\n<p><strong>Required Skills:</strong>\n- Strong SQL skills with hands-on experience in Snowflake.\n- Experience testing data pipelines (ADF, Airflow, Informatica, DBT, etc.).\n- Solid understanding of data warehousing concepts and cloud platforms (Azure/AWS/GCP).\n- Familiarity with QA processes, defect management tools (e.g., JIRA), and Agile practices.\n- Strong analytical and communication skills.</p>\n<p><strong>Preferred Qualifications:</strong>\n- 5–8 years in QA, with at least 1–2 years in data/Snowflake testing.\n- Experience validating dashboards/reports and BI tools.\n- ISTQB/CSQA or relevant QA certifications (preferred).\n- Experience in insurance or financial services is a plus.</p>\n<p><strong>Preferred Skills:</strong> Data Engineering</p>",
        "tags": [
            "5-8 Years",
            "Snowflake",
            "SQL",
            "Data Warehousing"
        ],
        "summary": "Snowflake QA Analyst ensures data pipeline accuracy and reliability. Requires SQL, Snowflake testing, and data warehousing expertise."
    },
    {
        "job_title": "Lead Software Engineer - Pega",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27499",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<p><strong>Arch Global Services India</strong>\n4th Floor, Niagara Building\nTechno Park Phase-3\nTrivandrum, Kerala, 695583\n<a href=\"https://www.archgroup.com\">https://www.archgroup.com</a></p>\n<p><strong>Lead Software Engineer - Pega</strong>\nClosing Date: 26, Mar 2026\nJob Published: 09, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:talentsuccess@talent500.co\">talentsuccess@talent500.co</a></p>\n<h3>About Arch</h3>\n<p>At Arch, we believe our strength lies in our people and our ability to innovate together. We’re proud to offer challenging, rewarding careers in analytics, technology, actuarial, operations, and more. We’re looking to grow our India team with individuals who want to make their mark at a dynamic global insurer.</p>\n<p><strong>Arch Capital Group Ltd. (Arch)</strong> is a leading global insurer with operations in over a dozen countries. We write insurance, reinsurance, and mortgage insurance worldwide, valued as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h3>About Global Services India</h3>\n<p>Arch Global Services India, established in 2025, is the newest part of Arch’s Global Service Organization. With offices in Hyderabad, Trivandrum, and Pune, we strategically support Arch Insurance, Reinsurance, and Mortgage divisions globally. We collaborate with teams worldwide to develop and implement solutions delivering exceptional results for clients.</p>\n<h3>Position Overview</h3>\n<p>The <strong>Pega Lead Developer</strong> will lead the design, development, and implementation of Pega applications to meet complex business requirements. This role demands deep technical expertise in the Pega platform, strong leadership skills, and the ability to guide teams in delivering scalable, high-quality solutions.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Lead end-to-end design and development of Pega applications, adhering to Pega Guardrails and best practices.</li>\n<li>Provide technical guidance and mentorship to developers and junior team members.</li>\n<li>Define and document application architecture, data models, process flows, and integration points.</li>\n<li>Implement complex workflows, case management, and decisioning capabilities.</li>\n<li>Integrate Pega applications with external systems using REST, SOAP, JMS.</li>\n<li>Conduct code reviews and enforce coding standards.</li>\n<li>Support system testing, UAT, and resolve defects promptly.</li>\n<li>Collaborate with business analysts, architects, and project managers in Agile ceremonies.</li>\n<li>Create and maintain technical documentation, including design documents, configuration guides, and deployment instructions.</li>\n</ul>\n<h3>Qualifications</h3>\n<p><strong>Education:</strong> Bachelor’s or master’s degree in computer science, Information Technology, or related field.</p>\n<p><strong>Experience:</strong>\n- Minimum 10+ years in Pega application development.\n- At least 4+ years in a Lead Developer or Architect role.</p>\n<p><strong>Technical Skills:</strong>\n- Expertise in Pega PRPC (7.x/8.x) and Pega Infinity.\n- Strong knowledge of Pega frameworks, case management, and BPM.\n- Hands-on experience with integrations (REST, SOAP, MQ, JMS).\n- Familiarity with Agile methodologies and DevOps tools (Jenkins, Git, CI/CD).</p>\n<p><strong>Certifications:</strong>\n- Pega Certified Lead System Architect (CLSA) mandatory; CSSA preferred.</p>\n<p><strong>Soft Skills:</strong>\n- Excellent communication, leadership, and problem-solving abilities.</p>\n<p><strong>Preferred Additional Skills:</strong>\n- Exposure to GenAI features in Pega Infinity.\n- Experience with cloud deployments (AWS/Azure).\n- Knowledge of performance tuning and security best practices.</p>",
        "tags": [
            "10+ Years",
            "Pega PRPC",
            "Pega Infinity",
            "REST/SOAP"
        ],
        "summary": "Lead Software Engineer in Pega with 10+ years experience. Requires expertise in Pega PRPC, REST/SOAP integrations, and Agile methodologies."
    },
    {
        "job_title": "Senior Software Engineer - Boomi",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27498",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>About Arch</h2>\n<p>At Arch, we believe our strength lies in our people and our ability to innovate together. We’re proud to offer challenging, rewarding careers in analytics, technology, actuarial, operations, and more. We’re looking to grow our India team with individuals who want to make their mark at a dynamic global insurer.</p>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in more than a dozen countries. We write insurance, reinsurance, and mortgage insurance on a worldwide basis, and our customers value us as an innovative partner and dependable risk manager with decades of fresh ideas and solid results. Part of the S&amp;P 500, Arch has the size and capital position to remain a market-leading specialty insurer.</p>\n<h2>About Global Services India</h2>\n<p>Arch Global Services India, established in 2025, is the newest part of Arch’s Global Service Organization. With offices in Hyderabad, Trivandrum, and Pune, Arch Global Services India is strategically positioned to provide support to Arch Insurance, Reinsurance, and Mortgage divisions globally. At Arch Global Services India, we collaborate with teams across the globe to develop and implement solutions that deliver exceptional results for our clients worldwide.</p>\n<h2>Position Overview</h2>\n<p>The Senior Boomi Developer will design, develop, and implement integration solutions using the Boomi platform. This role requires advanced technical expertise in integration technologies, strong problem-solving skills, and the ability to deliver high-quality solutions in a fast-paced environment.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design and develop integration processes using Boomi AtomSphere.</li>\n<li>Configure connectors, manage atoms, and implement integration patterns.</li>\n<li>Collaborate with business analysts and architects to translate requirements into technical specifications.</li>\n<li>Perform data mapping, transformation, and validation for complex integrations.</li>\n<li>Integrate Boomi with enterprise systems such as ERP, CRM, and cloud platforms.</li>\n<li>Conduct unit testing and support system testing and UAT.</li>\n<li>Troubleshoot and resolve integration issues promptly.</li>\n<li>Maintain documentation for design, configuration, and deployment processes.</li>\n<li>Ensure adherence to Boomi best practices and Arch development standards.</li>\n</ul>\n<h2>Qualifications</h2>\n<h3>Education</h3>\n<ul>\n<li>Bachelor’s or master’s degree in computer science, Information Technology, or related field.</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li>Minimum 6+ years in integration development with at least 3+ years in Boomi.</li>\n<li>Proven experience in API development and integration design.</li>\n</ul>\n<h3>Technical Skills</h3>\n<ul>\n<li>Expertise in Boomi AtomSphere and API Management.</li>\n<li>Strong knowledge of integration technologies (APIs, ETL, ESB).</li>\n<li>Familiarity with SQL and database concepts.</li>\n<li>Understanding of Agile methodologies and DevOps practices.</li>\n</ul>\n<h3>Certifications</h3>\n<ul>\n<li>Boomi Professional Integration Developer and Associate Integration Architect certifications preferred.</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Excellent communication, problem-solving, and leadership abilities.</li>\n</ul>\n<h2>Preferred Additional Skills</h2>\n<ul>\n<li>Experience with cloud platforms (AWS/Azure).</li>\n<li>Knowledge of error handling, audit frameworks, and performance tuning.</li>\n<li>Exposure to insurance domain integrations.</li>\n</ul>\n<h2>Contact Information</h2>\n<p><strong>Email:</strong> talentsuccess@talent500.co\n<strong>Website:</strong> <a href=\"https://www.archgroup.com\">https://www.archgroup.com</a>\n<strong>Closing Date:</strong> 26, Mar 2026\n<strong>Job Published:</strong> 09, Feb 2026</p>",
        "tags": [
            "6+ Years",
            "Boomi AtomSphere",
            "API Development",
            "Integration Technologies"
        ],
        "summary": "Senior Boomi Developer at Arch Global Services India requires 6+ years of integration experience with expertise in Boomi AtomSphere and API design for global insurance solutions."
    },
    {
        "job_title": "Senior Business Systems Analyst - Guidewire",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27497",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>About Arch</h2>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in over a dozen countries, specializing in insurance, reinsurance, and mortgage insurance. As part of the S&amp;P 500, Arch is recognized for innovation and reliability in risk management.</p>\n<h2>About Arch Global Services India</h2>\n<p>Established in 2025, Arch Global Services India supports Arch’s global divisions from offices in Hyderabad, Trivandrum, and Pune. The team collaborates internationally to deliver solutions for clients worldwide.</p>\n<h2>Job Description: Senior Business Systems Analyst - Guidewire</h2>\n<h3>Position Overview</h3>\n<p>The Senior Guidewire PolicyCenter BSA will bridge business needs and technical delivery, requiring strong analytical skills, deep knowledge of Guidewire PolicyCenter, and insurance domain expertise.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Requirements Gathering &amp; Analysis</strong>: Collaborate with stakeholders to document and validate PolicyCenter requirements.</li>\n<li><strong>Solution Design &amp; Implementation</strong>: Align solutions with Guidewire best practices and ensure compliance.</li>\n<li><strong>Testing &amp; Quality Assurance</strong>: Develop test plans, support UAT, and resolve defects.</li>\n<li><strong>Documentation &amp; Training</strong>: Maintain documentation and provide end-user training.</li>\n<li><strong>Stakeholder Management</strong>: Act as a liaison between business and technical teams, managing priorities and progress.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li><strong>Education</strong>: Bachelor’s degree in Computer Science, IT, or related field.</li>\n<li><strong>Experience</strong>: 8+ years in business analysis, 4+ years in Guidewire PolicyCenter; insurance domain experience required.</li>\n<li><strong>Technical Skills</strong>: Guidewire PolicyCenter configuration, GOSU scripting, XML, integration concepts, Agile methodologies (JIRA, Confluence).</li>\n<li><strong>Certifications</strong>: Guidewire PolicyCenter Specialist preferred.</li>\n<li><strong>Soft Skills</strong>: Excellent communication, stakeholder management, problem-solving.</li>\n</ul>\n<h3>Preferred Additional Skills</h3>\n<ul>\n<li>Guidewire BillingCenter/ClaimCenter experience.</li>\n<li>DevOps tools (Jenkins, Git), cloud deployments (AWS/Azure).</li>\n<li>Rating engines (Insbridge), data migration processes.</li>\n</ul>\n<p><strong>Contact</strong>: talentsuccess@talent500.co\n<strong>Location</strong>: 4th Floor, Niagara Building, Techno Park Phase-3, Trivandrum, Kerala, 695583\n<strong>Company Website</strong>: <a href=\"https://www.archgroup.com\">https://www.archgroup.com</a></p>",
        "tags": [
            "8+ Years",
            "Guidewire PolicyCenter",
            "GOSU Scripting",
            "Agile Methodologies"
        ],
        "summary": "Senior Business Systems Analyst in Guidewire PolicyCenter with 8+ years experience in requirements analysis, solution design, and stakeholder management for insurance domain projects."
    },
    {
        "job_title": "Lead Business Systems Analyst (Policy Center)",
        "company": "Arch Global Services India",
        "url": "https://technopark.org/job-details/27496",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>About Arch</h2>\n<p>Arch Capital Group Ltd. (Arch) is a leading global insurer with operations in over a dozen countries. We provide insurance, reinsurance, and mortgage insurance globally, valued as an innovative partner and dependable risk manager with decades of expertise. As part of the S&amp;P 500, Arch maintains a strong capital position to remain a market-leading specialty insurer.</p>\n<h2>About Global Services India</h2>\n<p>Arch Global Services India, established in 2025, is the newest division of Arch’s Global Service Organization. With offices in Hyderabad, Trivandrum, and Pune, we support Arch Insurance, Reinsurance, and Mortgage divisions globally. Our teams collaborate internationally to develop and implement solutions delivering exceptional results for clients worldwide.</p>\n<h2>Position Overview</h2>\n<p><strong>Lead Business Systems Analyst - Guidewire PolicyCenter</strong></p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Requirements Gathering &amp; Analysis</strong></li>\n<li>Collaborate with stakeholders to elicit, document, and validate PolicyCenter requirements.</li>\n<li>Translate business needs into functional specifications and user stories.</li>\n<li><strong>Solution Design &amp; Implementation</strong></li>\n<li>Partner with development teams to design Guidewire best-practice-aligned solutions.</li>\n<li>Ensure PolicyCenter configurations meet business and compliance standards.</li>\n<li><strong>Testing &amp; Quality Assurance</strong></li>\n<li>Develop and execute test plans for functional validation.</li>\n<li>Support UAT and resolve defects with QA and development teams.</li>\n<li><strong>Documentation &amp; Training</strong></li>\n<li>Maintain documentation (requirements, design, test cases).</li>\n<li>Provide training and support to end-users.</li>\n<li><strong>Stakeholder Management</strong></li>\n<li>Act as the primary liaison between business and technical teams.</li>\n<li>Manage priorities and communicate progress effectively.</li>\n</ul>\n<h3>Qualifications:</h3>\n<ul>\n<li><strong>Education</strong>: Bachelor’s degree in Computer Science, IT, or related field.</li>\n<li><strong>Experience</strong>: 9+ years in Business Analysis (4+ years in Guidewire PolicyCenter) and insurance domain (Personal/Commercial Lines).</li>\n<li><strong>Technical Skills</strong>:</li>\n<li>Deep knowledge of Guidewire PolicyCenter configuration and workflows.</li>\n<li>Proficiency in GOSU scripting, XML, and integration concepts.</li>\n<li>Familiarity with Agile methodologies (JIRA, Confluence).</li>\n<li><strong>Certifications</strong>: Guidewire PolicyCenter Specialist certification preferred.</li>\n<li><strong>Soft Skills</strong>: Excellent communication, stakeholder management, and problem-solving abilities.</li>\n</ul>\n<h3>Preferred Additional Skills:</h3>\n<ul>\n<li>Exposure to Guidewire Billing Center and ClaimCenter.</li>\n<li>Experience with DevOps tools (Jenkins, Git) and cloud deployments (AWS/Azure).</li>\n<li>Understanding of rating engines (Insbridge) and data migration processes.</li>\n</ul>\n<p><strong>Contact Email</strong>: talentsuccess@talent500.co\n<strong>Closing Date</strong>: 26, Mar 2026</p>",
        "tags": [
            "9+ Years",
            "Guidewire PolicyCenter",
            "GOSU Scripting",
            "Agile Methodologies"
        ],
        "summary": "Lead Business Systems Analyst for Guidewire PolicyCenter with 9+ years of experience in insurance domain processes and technical implementation."
    },
    {
        "job_title": "Female Telesales Executive (US Process)",
        "company": "Richinnovations Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27491",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<h2>Job Overview</h2>\n<p><strong>Company:</strong> Richinnovations Technologies (P) Ltd\n<strong>Location:</strong> Trivandrum, Kerala, India (Work from home option available)\n<strong>Job Title:</strong> Female Telesales Executive (US Process)\n<strong>Closing Date:</strong> 20, Feb 2026\n<strong>Published Date:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> hr@richinnovationsplc.com</p>\n<h3>Key Details</h3>\n<ul>\n<li><strong>No. of Openings:</strong> 2</li>\n<li><strong>Languages Required:</strong> English &amp; Malayalam</li>\n<li><strong>Shift:</strong> US Timing</li>\n<li><strong>Salary:</strong> As per industry standards</li>\n<li><strong>Work Mode:</strong> Work From Home</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Attend incoming calls from prospective US clients.</li>\n<li>Handle inquiries, follow up on leads, and schedule meetings.</li>\n<li>Present product/service information clearly and professionally.</li>\n<li>Maintain call logs, CRM entries, and daily reports.</li>\n<li>Build strong customer relationships and ensure client satisfaction.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Excellent command of English and Malayalam.</li>\n<li>Prior telesales or customer support experience preferred (US shift experience is an advantage).</li>\n<li>Ability to work independently in a remote environment.</li>\n<li>Strong negotiation, communication, and interpersonal skills.</li>\n</ul>\n<h3>About the Role</h3>\n<p>We are seeking a confident and energetic Female Telesales Executive to manage outbound calls, lead follow-ups, and client communication for US-based customers. The ideal candidate must be fluent in English and Malayalam and comfortable working in US time zones.</p>",
        "tags": [
            "2-4 Years",
            "English",
            "Malayalam",
            "US Time Zone"
        ],
        "summary": "Female Telesales Executive for US clients requiring English/Malayalam fluency and US shift compatibility. Remote work available with CRM and client communication responsibilities."
    },
    {
        "job_title": "Claims Handlers / Customer Service Executives",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27490",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>Yarab Technologies (P) Ltd</h2>\n<p><strong>Module No: 2706, 7th Floor, Yamuna Building, Phase-III Campus, Technopark, Kazhakootam, 695581</strong>\n<strong>Website</strong>: <a href=\"http://www.yrtechnologies.co.in\">http://www.yrtechnologies.co.in</a></p>\n<h3>Job Title: Claims Handlers / Customer Service Executives</h3>\n<p><strong>Closing Date</strong>: 16 Feb 2026\n<strong>Published Date</strong>: 09 Feb 2026\n<strong>Contact Email</strong>: jobs@yarabltd.co.uk</p>\n<h3>Brief Description</h3>\n<p>We are seeking Claims Handlers / Customer Service Executives to join our dynamic team. The ideal candidate will handle customer queries, process claims, and ensure timely resolution while maintaining the highest standards of service.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Handle inbound and outbound calls related to claims and customer service.</li>\n<li>Assist customers in reporting First Notification of Loss (FNOL) and gathering relevant information.</li>\n<li>Validate and process claims in line with company guidelines and compliance standards (FCA regulations).</li>\n<li>Communicate clearly and professionally with customers, service partners, and underwriters.</li>\n<li>Manage claim updates via email and phone, ensuring timely follow-ups.</li>\n<li>Maintain accurate records of all interactions in the system.</li>\n<li>Handle queries, complaints, and escalations effectively, ensuring fair outcomes.</li>\n</ul>\n<h3>Key Skills &amp; Competencies</h3>\n<ul>\n<li>Excellent communication skills (verbal and written).</li>\n<li>Strong problem-solving abilities and attention to detail.</li>\n<li>Ability to remain calm under pressure and handle challenging conversations.</li>\n<li>Basic computer literacy and ability to work with CRM or ticketing systems.</li>\n<li>Team player with a customer-first attitude.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Previous experience in <strong>UK customer service or claims handling</strong> (highly desirable).</li>\n<li><strong>Insurance experience</strong> will be an added advantage.</li>\n<li>Fresh graduates or candidates with no prior experience are encouraged to apply (full training provided).</li>\n</ul>",
        "tags": [
            "No Experience Required",
            "UK Customer Service Experience",
            "Insurance Industry Knowledge",
            "CRM/Ticketing Systems"
        ],
        "summary": "Seeking Claims Handlers/Customer Service Executives to manage claims and customer queries. Offers training for freshers with strong communication skills."
    },
    {
        "job_title": "Business Development Associate",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27489",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>Yarab Technologies (P) Ltd</h2>\n<p><strong>Address:</strong> Module No: 2706, 7th Floor, Yamuna Building, Phase-III Campus, Technopark, Kazhakootam, 695581\n<strong>Website:</strong> <a href=\"http://www.yrtechnologies.co.in\">http://www.yrtechnologies.co.in</a>\n<strong>Contact Email:</strong> jobs@yarabltd.co.uk</p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>proactive and customer-focused Insurance Sales Agent</strong> to manage inbound/outbound calls, deliver exceptional service, and drive sales growth. The role includes resolving queries, promoting insurance products, and ensuring compliance with regulatory standards.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Inbound &amp; Outbound Call Handling:</strong></li>\n<li>Address UK customer inquiries and provide accurate product information.</li>\n<li>Proactively follow up with potential/existing customers for cross-selling/up-selling.</li>\n<li><strong>Sales Achievement:</strong></li>\n<li>Exceed monthly/quarterly sales targets.</li>\n<li>Cross-sell/up-sell insurance products/services aligned with customer needs.</li>\n<li><strong>Customer Experience:</strong></li>\n<li>Maintain high satisfaction through communication, active listening, and problem-solving.</li>\n<li>Resolve queries promptly to ensure a positive customer journey.</li>\n<li><strong>Record Management:</strong></li>\n<li>Document interactions/transactions in the CRM system accurately.</li>\n<li>Ensure data accuracy for reporting and compliance.</li>\n<li><strong>Team Collaboration:</strong></li>\n<li>Collaborate with team members to meet sales/service goals.</li>\n<li>Share best practices and support colleagues to enhance performance.</li>\n<li><strong>Compliance &amp; Quality Assurance:</strong></li>\n<li>Adhere to FCA regulations, Consumer Duty principles, and company policies.</li>\n<li>Follow approved scripts and maintain high compliance scores in audits.</li>\n</ul>\n<h3>Preferred Skills &amp; Competencies</h3>\n<ul>\n<li>Strong communication and interpersonal skills.</li>\n<li>Proven ability to handle sales objections and negotiate effectively.</li>\n<li>Customer-focused mindset with problem-solving abilities.</li>\n<li>Comfortable working in a target-driven environment.</li>\n<li>Basic technical proficiency with CRM systems and telephony platforms.</li>\n</ul>\n<h3>Qualifications &amp; Experience</h3>\n<ul>\n<li>Experience in insurance sales, call center operations, or financial services (preferred).</li>\n<li>Knowledge of FCA guidelines and UK insurance market regulations (advantageous).</li>\n</ul>\n<p><strong>Job Published:</strong> 09, Feb 2026\n<strong>Closing Date:</strong> 16, Feb 2026</p>",
        "tags": [
            "2-4 Years",
            "CRM Systems",
            "FCA Regulations",
            "Sales Techniques"
        ],
        "summary": "Seeking a proactive Insurance Sales Agent to manage calls, drive sales, and ensure compliance. Requires CRM proficiency, FCA knowledge, and sales skills."
    },
    {
        "job_title": "Audit Assistant",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27488",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2><strong>Company Information</strong></h2>\n<p><strong>Yarab Technologies (P) Ltd</strong>\nModule No: 2706, 7th Floor, Yamuna Building,\nPhase-III Campus, Technopark, Kazhakootam, 695581\n<a href=\"http://www.yrtechnologies.co.in\">http://www.yrtechnologies.co.in</a></p>\n<h2><strong>Job Overview</strong></h2>\n<p><strong>Role</strong>: Audit Assistant\n<strong>Closing Date</strong>: 16, Feb 2026\n<strong>Published</strong>: 09, Feb 2026\n<strong>Contact Email</strong>: jobs@yarabltd.co.uk</p>\n<h2><strong>Brief Description</strong></h2>\n<p>We are seeking an Audit Assistant to support the team in executing audit engagements. Responsibilities include auditing, accounting, data analysis, documentation, and preparing audit reports in accordance with professional standards and company policies.</p>\n<h2><strong>Duties &amp; Responsibilities</strong></h2>\n<ul>\n<li>Assist in planning and performing internal/external audit engagements</li>\n<li>Collect, analyze, and verify financial data and documentation</li>\n<li>Develop and execute risk-based audit plans across business functions and jurisdictions</li>\n<li>Prepare audit working papers, schedules, and supporting documentation</li>\n<li>Reconcile accounts and finalize reports</li>\n<li>Demonstrate computer literacy; ERP financial systems experience is an advantage</li>\n<li>Maintain current knowledge of insurance &amp; reinsurance industry practices, trends, and issues</li>\n<li>Support drafting audit findings and reports</li>\n<li>Collaborate with cross-functional teams globally for audit readiness</li>\n<li>Assist with special reviews, investigations, and ad-hoc assignments</li>\n</ul>\n<h2><strong>Preferred Skills</strong></h2>\n<ul>\n<li><strong>Qualification</strong>: BCom/CA Intermediate</li>\n<li><strong>Experience</strong>: 3-5 years in Financial Audit and/or Finance</li>\n<li><strong>Industry Knowledge</strong>: Insurance field experience is an advantage</li>\n<li><strong>Technical Skills</strong>: Proficiency in MS Office (Excel, Word, PowerPoint)</li>\n<li><strong>Soft Skills</strong>: Strong communication, ability to work under pressure, meet deadlines</li>\n<li><strong>Professional Growth</strong>: Willingness to learn and grow in an audit environment</li>\n</ul>\n<h2><strong>Contact Information</strong></h2>\n<p>For inquiries, contact <strong>jobs@yarabltd.co.uk</strong>.</p>",
        "tags": [
            "3-5 Years",
            "Financial Audit",
            "ERP Financial Systems",
            "Insurance/Reinsurance Industry Practices"
        ],
        "summary": "Audit Assistant role requiring 3-5 years in financial audit, supporting audit engagements, data analysis, and report preparation with expertise in ERP systems and insurance practices."
    },
    {
        "job_title": "Brand & UI/UX Designer",
        "company": "Yarab Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27487",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>Yarab Technologies (P) Ltd</h2>\n<p><strong>Module No: 2706, 7th Floor, Yamuna Building, Phase-III Campus, Technopark, Kazhakootam, 695581</strong>\n<strong>Website</strong>: <a href=\"http://www.yrtechnologies.co.in\">http://www.yrtechnologies.co.in</a>\n<strong>Closing Date</strong>: 16, Feb 2026\n<strong>Job Published</strong>: 09, Feb 2026\n<strong>Contact Email</strong>: jobs@yarabltd.co.uk</p>\n<h3>Brief Description</h3>\n<p>We are seeking a <strong>Brand &amp; UI/UX Designer</strong> to own and manage our group brand identity, corporate design assets, and user-centric digital experiences. This role combines brand storytelling, UI/UX design, and digital creativity, ensuring visual consistency, usability, and brand compliance across all group websites, corporate profiles, and digital platforms.</p>\n<p>The role will also support WordPress-based website management and basic video and digital ad creatives for marketing and brand communication.</p>\n<h3>Key Responsibilities</h3>\n<h4>Brand &amp; Corporate Design</h4>\n<ul>\n<li>Design and maintain group brand identity across all companies and subsidiaries</li>\n<li>Create and update corporate profiles, company decks, brochures, and presentations</li>\n<li>Develop and maintain brand guidelines (logos, colours, typography, layouts)</li>\n<li>Ensure brand consistency across digital and offline assets</li>\n<li>Support leadership and marketing teams with high-quality corporate visuals</li>\n</ul>\n<h4>UI/UX &amp; Web Design</h4>\n<ul>\n<li>Design UI/UX for websites, landing pages, and digital portals (desktop &amp; mobile)</li>\n<li>Create wireframes, mockups, and prototypes</li>\n<li>Collaborate with developers to ensure accurate design implementation</li>\n<li>Maintain a shared design system and reusable UI components</li>\n<li>Improve usability and accessibility following industry best practices</li>\n</ul>\n<h4>WordPress Website Support (Added)</h4>\n<ul>\n<li>Manage and update WordPress-based websites (pages, layouts, media, menus)</li>\n<li>Implement designs using WordPress themes and page builders (e.g., Elementor, Gutenberg, WPBakery)</li>\n<li>Ensure visual consistency and brand compliance across WordPress sites</li>\n<li>Coordinate with developers for custom plugins, performance, or security changes</li>\n<li>Perform basic content updates, layout adjustments, and UI improvements</li>\n</ul>\n<p><strong>Note</strong>: Advanced backend development is not required.</p>\n<h4>Video &amp; Digital Creative Support (Advantage)</h4>\n<ul>\n<li>Create or edit short-form videos for branding, social media, and digital campaigns</li>\n<li>Support video ads, promotional clips, and motion-based creatives</li>\n<li>Work with marketing teams on visual concepts for campaigns and ads</li>\n<li>Ensure video creatives align with brand guidelines and messaging</li>\n</ul>\n<h4>Collaboration &amp; Governance</h4>\n<ul>\n<li>Work closely with marketing, development, and product teams</li>\n<li>Review and approve designs for brand, UX, and website compliance</li>\n<li>Coordinate with external agencies or freelancers when required</li>\n<li>Ensure alignment with business, regulatory, and brand standards</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications</h3>\n<h4>Design &amp; Web Skills</h4>\n<ul>\n<li>Strong proficiency in <strong>Figma</strong></li>\n<li>Experience with <strong>Adobe Creative Suite</strong> (Photoshop, Illustrator, InDesign)</li>\n<li>Solid understanding of UI/UX principles and responsive design</li>\n<li>Hands-on experience with <strong>WordPress</strong> website management</li>\n<li>Ability to translate designs into WordPress-ready layouts</li>\n</ul>\n<h4>Experience</h4>\n<ul>\n<li><strong>3–6+ years</strong> of experience in brand design, UI/UX design, or a hybrid role</li>\n<li>Proven experience with corporate profiles, websites, and digital platforms</li>\n<li>Experience in insurance, financial services, or regulated industries is an advantage</li>\n</ul>\n<h4>Nice to Have</h4>\n<ul>\n<li>Video editing / video ads creation experience (Premiere Pro, After Effects, CapCut, DaVinci Resolve, etc.)</li>\n<li>Basic motion graphics skills</li>\n<li>Familiarity with SEO-friendly design practices</li>\n<li>Basic understanding of HTML/CSS</li>\n<li>Knowledge of WCAG accessibility standards</li>\n<li>Experience working in multi-brand or group organisations</li>\n</ul>",
        "tags": [
            "3–6+ Years",
            "Figma",
            "Adobe Creative Suite",
            "WordPress"
        ],
        "summary": "Brand & UI/UX Designer needed to manage brand identity, digital experiences, and WordPress websites. Requires 3–6+ years of experience with Figma, Adobe Creative Suite, and WordPress."
    },
    {
        "job_title": ".NET Developer",
        "company": "Gruppozenit India (P) Ltd",
        "url": "https://technopark.org/job-details/27486",
        "location": "Technopark",
        "closing_date": "16 Mar 2026",
        "job_description": "<h2>Gruppozenit India (P) Ltd</h2>\n<p><strong>Location:</strong> Ground Floor, Periyar Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"http://www.gruppozenit.com\">http://www.gruppozenit.com</a>\n<strong>Closing Date:</strong> 16, Mar 2026\n<strong>Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@gruppozenit.com\">careers@gruppozenit.com</a></p>\n<h3>Role</h3>\n<p>The candidate will work on backend development using .NET technologies, participate in creating and maintaining server-side views, support frontend tasks, and collaborate with cross-functional teams to deliver robust, maintainable solutions aligned with project requirements.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Develop and maintain backend functionality using the .NET framework, ensuring clean, efficient, and scalable code.</li>\n<li>Work with ASP.NET MVC and Razor to build and maintain server-side views.</li>\n<li>Apply strong knowledge of C# and core Object-Oriented Programming (OOP) principles.</li>\n<li>Support classic frontend development using JavaScript, jQuery, and asynchronous flows via AJAX.</li>\n<li>Write and optimize SQL queries and work with relational databases (MySQL and Microsoft SQL Server).</li>\n<li>Contribute to existing projects through maintenance, evolutionary development, and bug fixing.</li>\n<li>Collaborate across development, staging, and production environments.</li>\n<li>Produce and maintain clear technical documentation.</li>\n</ul>\n<h3>Mandatory Skills</h3>\n<ul>\n<li>.NET Backend Development</li>\n<li>ASP.NET MVC</li>\n<li>Razor</li>\n<li>C# / OOP</li>\n<li>JavaScript</li>\n<li>jQuery</li>\n<li>AJAX</li>\n<li>SQL &amp; Relational Databases (MySQL + Microsoft SQL Server)</li>\n<li>Git</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>HTML5 / CSS3</li>\n<li>Bootstrap or similar CSS frameworks</li>\n<li>Docker containerization</li>\n<li>Angular</li>\n<li>Git (branching, merging, pull requests)</li>\n<li>Staging / production environments</li>\n<li>DevOps practices, CI/CD pipelines, automation workflows</li>\n<li>REST Web APIs</li>\n<li>Web security concepts (authentication, authorization, input validation, roles)</li>\n<li>Orchestrated environments (e.g., Kubernetes)</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>B.Tech / B.E / MCA</li>\n<li>Excellent written and spoken English skills</li>\n<li>Strong communication and collaboration abilities</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li>Minimum 4 years of experience in software development</li>\n<li>Hands-on experience with backend development in .NET and ASP.NET MVC</li>\n<li>Experience with relational databases (MySQL + MS SQL Server)</li>\n<li>Ability to work on existing codebases and contribute to long-term maintenance and enhancements</li>\n<li>Experience in both backend and classic frontend development workflows</li>\n</ul>",
        "tags": [
            "4+ Years",
            ".NET Backend Development",
            "ASP.NET MVC",
            "C# / OOP"
        ],
        "summary": "A .NET Developer role requiring backend and frontend expertise in .NET, C#, SQL, and JavaScript, with 4+ years of experience in software development."
    },
    {
        "job_title": "Software Engineer - .NET",
        "company": "Muthoot Mercantile Ltd-It Wing",
        "url": "https://technopark.org/job-details/27485",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Muthoot Mercantile Limited is a leading Non-Banking Financial Company (NBFC) headquartered in Thiruvananthapuram, Kerala. Registered with the RBI, the company specializes in the gold loan sector and emphasizes trust, transparency, and customer relationships. With a wide branch network across Kerala, Tamil Nadu, Maharashtra, Odisha, Punjab, Uttar Pradesh, Haryana, West Bengal, and Delhi, Muthoot Mercantile handles customer gold assets with care.</p>\n<h2>Position Overview</h2>\n<p>We are seeking a proactive and results-driven <strong>Software Engineer - .NET</strong> with hands-on experience in .NET Core, MVC, WPF, WCF, Angular/React, SQL, and Azure. The ideal candidate will mentor junior developers, deliver high-quality software solutions, and collaborate with cross-functional teams to meet project goals.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Mentor junior team members and provide timely code reviews.</li>\n<li>Develop software solutions using <strong>.NET Core</strong>, <strong>Angular/React</strong>, <strong>MS SQL</strong>, and <strong>Azure</strong> technologies.</li>\n<li>Collaborate with cross-functional teams to translate requirements into technical specifications.</li>\n<li>Troubleshoot complex technical issues and stay updated on .NET advancements.</li>\n<li>Participate in scrum meetings, analyze requirements, and communicate directly with clients.</li>\n<li>Assign tasks to junior developers and guide their growth.</li>\n<li>Prioritize project tasks, meet deadlines, and ensure milestone achievement.</li>\n<li>Convert legacy projects to .NET if required.</li>\n<li>Learn new technologies and business/system domains as needed.</li>\n<li>Code, debug, test, document, and communicate development progress.</li>\n<li>Ensure efficient code reviews, unit testing, and integration testing.</li>\n</ul>\n<h2>Preferred Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>BTech in Computer Science/Engineering</strong> or equivalent.</li>\n<li><strong>3+ years</strong> of experience in .NET technologies.</li>\n<li>Proficiency in <strong>.NET Core</strong>, <strong>C#</strong>, <strong>MVC</strong>, <strong>WPF</strong>, <strong>WCF</strong>, <strong>Web API</strong>.</li>\n<li>Strong frontend skills in <strong>Angular/React</strong>, <strong>TypeScript</strong>, <strong>HTML/CSS/JavaScript</strong>.</li>\n<li>Experience with <strong>Azure</strong> services (e.g., App Service, Functions).</li>\n<li>Knowledge of <strong>Azure DevOps</strong> is a plus.</li>\n<li>Excellent problem-solving and communication skills.</li>\n<li>Familiarity with <strong>Git</strong> and <strong>Agile methodologies</strong> (Scrum).</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Competitive salary and <strong>PF/ESI/Medical Insurance</strong>.</li>\n<li>Career growth opportunities with exposure to diverse technologies.</li>\n<li>A collaborative and innovative work environment.</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Email your detailed resume to <strong>hr@muthootenterprises.com</strong> with the subject line <strong>'Application for Software Engineer - .NET'</strong>, including notice period, current, and expected CTC. <strong>Closing Date</strong>: 16, Feb 2026. <strong>Job Published</strong>: 09, Feb 2026.</p>",
        "tags": [
            "3+ Years",
            ".NET Core",
            "Angular/React",
            "Azure"
        ],
        "summary": "Muthoot Mercantile seeks a proactive Software Engineer with .NET expertise to develop solutions, mentor teams, and collaborate on Azure projects. Requires 3+ years of experience and offers competitive salary and growth opportunities."
    },
    {
        "job_title": "Senior Software Engineer - .NET",
        "company": "Muthoot Mercantile Ltd-It Wing",
        "url": "https://technopark.org/job-details/27484",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Muthoot Mercantile Limited is a leading Non-Banking Financial Company (NBFC) headquartered in Thiruvananthapuram, Kerala. The company is registered with the RBI as an NBFC and primarily operates in the gold loan sector. The company emphasizes trust, transparency, and customer relationships, particularly because it handles customers' valuable gold assets. Muthoot Mercantile has a wide branch network across several Indian states, including Kerala, Tamil Nadu, Maharashtra, Odisha, Punjab, Uttar Pradesh, Haryana, West Bengal, and Delhi among others.</p>\n<h2>Position Overview</h2>\n<p>We are seeking a proactive and results-driven <strong>Senior Software Engineer - .NET</strong> with a strong background in .NET development. The ideal candidate should possess hands-on experience in <strong>.NET Core, MVC, WPF, WCF, Angular or React, SQL, and Azure</strong>, and be capable of providing technical support to a talented group of developers.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Mentor junior team members.</li>\n<li>Provide timely code reviews for peers.</li>\n<li>Develop high-quality software solutions using <strong>.NET Core, Angular or React, MS SQL, and Azure</strong> technologies.</li>\n<li>Collaborate with cross-functional teams to translate project requirements into technical specifications.</li>\n<li>Stay updated with the latest .NET technologies, frameworks, and best practices.</li>\n<li>Troubleshoot and resolve complex technical issues across the application stack.</li>\n<li>Actively participate in scrum meetings and analyze requirements to understand technical/functional needs. Directly discuss requirements with clients.</li>\n<li>Work independently as an individual contributor.</li>\n<li>Assign tasks to junior team members and guide their development.</li>\n<li>Manage and prioritize project tasks after client discussions, ensuring deadlines and milestones are met.</li>\n<li>Participate in project planning, estimation, and documentation.</li>\n<li>Understand code in other technology projects and convert them to .NET projects if required.</li>\n<li>Be open to learning new technologies.</li>\n<li>Demonstrate commitment to completing tasks on time without follow-ups.</li>\n<li>Learn the technology/business domain as recommended by the project.</li>\n<li>Code, debug, test, document, and communicate product/component/feature development stages.</li>\n<li>Ensure code reviews, unit testing, and integration testing are completed efficiently.</li>\n</ul>\n<h2>Preferred Skills &amp; Qualifications</h2>\n<ul>\n<li><strong>BTech in Computer Science Engineering</strong> or equivalent.</li>\n<li><strong>Minimum 5+ years of experience</strong> in .NET technology.</li>\n<li>Proficiency in <strong>.NET Core, C#, .NET MVC, WPF, WCF, Web API</strong>.</li>\n<li>Strong expertise in frontend technologies: <strong>Angular or React, TypeScript, HTML, CSS, JavaScript</strong>.</li>\n<li>Experience in cloud technologies, particularly <strong>Azure services</strong> (e.g., Azure App Service, Azure Functions).</li>\n<li>Knowledge of <strong>Azure DevOps</strong> is a plus.</li>\n<li>Excellent problem-solving skills and ability to troubleshoot complex technical challenges.</li>\n<li>Strong communication skills and cross-functional collaboration.</li>\n<li>Familiarity with version control systems, especially <strong>Git</strong>.</li>\n<li>Proven ability to work as an individual contributor.</li>\n<li>Experience with Agile methodologies like Scrum is a plus.</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Competitive salary.</li>\n<li>Excellent career growth opportunities and exposure to multiple technologies.</li>\n<li>PF/ESI/Medical Insurance.</li>\n<li>Collaborative and innovative work environment.</li>\n</ul>\n<h2>How to Apply</h2>\n<p>If you are a motivated and experienced Senior Software Engineer - .NET seeking a challenging opportunity, apply with a detailed resume to <strong>hr@muthootenterprises.com</strong>. Use the subject line: <strong>Application for Senior Software Engineer - .NET</strong> and include your notice period, current, and expected CTC.</p>\n<p><strong>Job Published:</strong> 09,Feb 2026\n<strong>Closing Date:</strong> 16,Feb 2026\n<strong>Contact Email:</strong> hr@muthootenterprises.com\n<strong>Company Address:</strong> Module No.8, 4th Floor, Gayathri Building, Phase 1, Technopark, 695581\n<strong>Company Website:</strong> <a href=\"http://www.muthootenterprises.com\">http://www.muthootenterprises.com</a></p>",
        "tags": [
            "5+ Years",
            ".NET Core",
            "Angular/React",
            "Azure"
        ],
        "summary": "Muthoot Mercantile LTD seeks a Senior Software Engineer - .NET with 5+ years of experience in .NET Core, Angular/React, and Azure. The role involves mentoring, developing high-quality software, and collaborating across teams in a leading NBFC environment."
    },
    {
        "job_title": "Chief Technology Officer",
        "company": "Muthoot Mercantile Ltd-It Wing",
        "url": "https://technopark.org/job-details/27483",
        "location": "Technopark",
        "closing_date": "16 Feb 2026",
        "job_description": "<h2>About Us</h2>\n<p>Muthoot Mercantile Limited is a leading Non-Banking Financial Company (NBFC) headquartered in Thiruvananthapuram, Kerala. Registered with the RBI, the company specializes in the gold loan sector and emphasizes trust, transparency, and customer relationships. With a wide branch network across Kerala, Tamil Nadu, Maharashtra, Odisha, Punjab, Uttar Pradesh, Haryana, West Bengal, and Delhi, Muthoot Mercantile handles customer gold assets with care.</p>\n<h2>Position Overview</h2>\n<p>We are seeking an accomplished <strong>Chief Technology Officer</strong> with deep expertise in <strong>.NET technologies</strong> to lead the organization’s technology vision, architecture, and delivery. The CTO will drive innovation, ensure scalable and secure systems, and align technology strategy with business objectives.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Provide technical guidance to the team.</li>\n<li>Customize current applications to meet evolving business requirements.</li>\n<li>Create technical designs and documentation.</li>\n<li>Develop and manage systems using <strong>MySQL/MS SQL Server</strong>, <strong>ASP.NET</strong>, <strong>C#</strong>, <strong>VB.NET</strong>, <strong>JavaScript</strong>, <strong>jQuery</strong>, <strong>VBScript</strong>, <strong>HTML</strong>, <strong>XML</strong>, <strong>Ajax</strong>, <strong>Angular</strong>, <strong>MVC/WCF/WPF</strong>, <strong>LINQ</strong>, and <strong>Lambda expressions</strong>.</li>\n<li>Write SQL scripts, stored procedures, and functions.</li>\n<li>Utilize <strong>Git/SVN</strong> for source and configuration management.</li>\n<li>Integrate APIs and libraries (preferred).</li>\n<li>Implement <strong>Microsoft Azure</strong> cloud-native solutions.</li>\n<li>Mentor and lead the tech team.</li>\n<li>Collaborate with cross-functional teams and stakeholders to capture requirements.</li>\n<li>Troubleshoot, debug, and optimize applications with a focus on performance, reliability, and security.</li>\n</ul>\n<h2>Requirements &amp; Qualifications</h2>\n<ul>\n<li>Bachelor’s or Master’s degree in Engineering, Computer Science, or related fields.</li>\n<li>8-15+ years of software development experience, with <strong>5+ years in a leadership role</strong>.</li>\n<li>Proficiency in <strong>.NET</strong>, <strong>Java</strong>, <strong>Python</strong>, or similar languages.</li>\n<li>Experience in enterprise domains like <strong>NBFC</strong>, <strong>BFSI</strong>, or <strong>FinTech</strong>.</li>\n<li>Strong understanding of testing methodologies and quality practices.</li>\n<li>Agile/Scrum environment experience.</li>\n<li>Excellent leadership, communication, and problem-solving skills.</li>\n</ul>\n<h2>What We Offer</h2>\n<ul>\n<li>Lead a talented, passionate team.</li>\n<li>Work in a culture valuing innovation, integrity, and impact.</li>\n<li>Competitive benefits and advancement opportunities.</li>\n</ul>\n<h2>How to Apply</h2>\n<p>Email your detailed resume to <strong>hr@muthootenterprises.com</strong> with the subject line \"Application for Chief Technology Officer\". Include your notice period, current, and expected CTC. Visit <a href=\"http://www.muthootenterprises.com\">www.muthootenterprises.com</a> for more information.</p>",
        "tags": [
            "8-15+ Years",
            ".NET",
            "Microsoft Azure",
            "SQL Server"
        ],
        "summary": "Lead technology strategy and innovation as CTO with .NET expertise in a leading NBFC, driving scalable solutions and mentoring teams."
    },
    {
        "job_title": "CCTV Technicians & Installation Executives",
        "company": "M Squared Software & Services (P) Ltd",
        "url": "https://technopark.org/job-details/27482",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Company:</strong> M Squared Software &amp; Services (P) Ltd\n<strong>Address:</strong> M-Squared Building, Technopark Campus, Phase 1, Thiruvananthapuram 695 581\n<strong>Website:</strong> <a href=\"http://www.m2india.com\">www.m2india.com</a></p>\n<p><strong>Job Title:</strong> CCTV Technicians &amp; Installation Executives\n<strong>Walk-In Dates:</strong> 10-Feb-2026 to 13-Feb-2026\n<strong>Time:</strong> 10:00 AM - 5:00 PM\n<strong>Published On:</strong> 09-Feb-2026</p>\n<p><strong>Brief Description:</strong>\n- <strong>CCTV Technicians:</strong> Senior &amp; Junior Positions\n- <strong>Installation Executives:</strong> Senior &amp; Junior Positions</p>\n<p><strong>Qualifications:</strong>\n- Diploma/ITI/Polytechnic/BMS</p>\n<p><strong>Experience Requirements:</strong>\n- <strong>Senior Positions:</strong> 2+ years in CCTV, Office/Home Automation\n- <strong>Junior Positions:</strong> Minimum 6 months in CCTV, Office/Home Automation\n- <em>Freshers can apply for Junior Positions</em></p>\n<p><strong>Job Locations:</strong> Thiruvananthapuram, Kochi, Bengaluru</p>\n<p><strong>Preferred Skills:</strong>\n- Knowledge in Security &amp; Automation field</p>\n<p><strong>Walk-In Venue:</strong>\n- <strong>Address:</strong> M-Squared Building, Technopark Campus, Thiruvananthapuram 695 581\n- <strong>Contact:</strong>\n  - Phone: (+91 471) 4084000\n  - Email: <a href=\"mailto:careers@m2comsys.us\">careers@m2comsys.us</a>\n  - Gate Passes: Ms. Anagha (9778688276), Ms. Feba (9778688277)</p>\n<p><strong>Entry Pass Instructions:</strong>\n1. Apply for Technopark Campus entry pass via mobile app/website: <a href=\"http://vms.technopark.org\">vms.technopark.org</a>\n2. Pass sent to registered mobile/email; show softcopy at Technopark Entrance Gate.\n3. Non-smartphone users: Print hardcopy at kiosks using 5-digit OTP (SMS/email) at Reception Building.</p>\n<p><strong>Note:</strong> Original certificates must be verified at the Entry Gate. Only male candidates are eligible for these positions.</p>",
        "tags": [
            "2+ Years",
            "CCTV",
            "Installation",
            "Automation"
        ],
        "summary": "M Squared seeks CCTV Technicians and Installation Executives with 2+ years (senior) or freshers (junior) for roles in Thiruvananthapuram, Kochi, and Bengaluru."
    },
    {
        "job_title": "Business Analyst",
        "company": "Cloud Nautical Solutions India Pvt Ltd",
        "url": "https://technopark.org/job-details/27481",
        "location": "Technopark",
        "closing_date": "26 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Cloud Nautical Solutions India Pvt Ltd</strong>\n<strong>Address:</strong> Module No.K12, 2nd Floor, Kabani Building, Technocity, Phase 4, Technopark, Trivandrum, Kerala, India, 695317\n<strong>Website:</strong> <a href=\"https://www.cloudnautical.com\">https://www.cloudnautical.com</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role:</strong> Business Analyst\n<strong>Closing Date:</strong> March 26, 2026\n<strong>Published Date:</strong> February 9, 2026\n<strong>Contact Email:</strong> careers@cloudnautical.com</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Lead and manage end-to-end project lifecycle (planning, execution, monitoring, closure).</li>\n<li>Act as requirements owner, coordinating stakeholder sign-off.</li>\n<li>Conduct in-depth analysis of business processes, systems, and workflows for optimization.</li>\n<li>Collaborate with technical teams to produce detailed project deliverables, including complex business requirements.</li>\n<li>Communicate ideas concisely to audiences with varying expertise levels.</li>\n<li>Review test cases/scenarios and coordinate QA/UAT validation.</li>\n<li>Create wireframes, mock-ups, or prototypes to explain requirements.</li>\n<li>Document requirements, translate functional to technical requirements, and design flow diagrams.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li><strong>3+ years</strong> of experience in a Business Analyst role.</li>\n<li>Certifications in Business Analysis (e.g., CCBA, CBAP) preferred.</li>\n<li>Proficiency in tools: MS Office (Word, PowerPoint, Excel), JIRA, wireframing tools (MS Visio, Balsamiq).</li>\n<li>Strong understanding of Agile Scrum practices.</li>\n<li>Experience working with stakeholders, software development teams, and finance projects.</li>\n<li>Excellent written, verbal, and interpersonal communication skills, including technical writing.</li>\n<li><strong>B.Tech in Mechanical Engineering</strong> as an added advantage.</li>\n</ul>\n<h2>Contact Information</h2>\n<p>For inquiries, email: <strong>careers@cloudnautical.com</strong></p>",
        "tags": [
            "3+ Years",
            "JIRA",
            "MS Visio",
            "Agile Scrum"
        ],
        "summary": "Seeking a 3+ year experienced Business Analyst to lead projects, analyze processes, and collaborate with stakeholders. Requires strong communication and Agile Scrum knowledge."
    },
    {
        "job_title": "Video Editor & Motion Graphics Designer",
        "company": "Tigrid Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27480",
        "location": "Technopark",
        "closing_date": "21 Mar 2026",
        "job_description": "<h2>About the Role</h2>\n<p>We are looking for a creative and motivated <strong>Video Editor &amp; Motion Graphics Designer</strong> who is passionate about transforming raw footage into engaging, high-impact content. This role is ideal for someone who enjoys the editing process, values storytelling, and wants to build real-world experience by working on client-facing projects with clear deadlines.</p>\n<p><strong>Location</strong>: Trivandrum, Kerala\n<strong>Work Mode</strong>: Work From Office</p>\n<h3>Eligibility Criteria</h3>\n<ul>\n<li>0–2 years of relevant experience</li>\n<li>Kerala-based candidates preferred</li>\n</ul>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Edit video content for social media, branding, and marketing campaigns</li>\n<li>Collaborate with content creators and the marketing team to execute projects effectively</li>\n<li>Optimize videos for audience engagement, performance, and platform-specific requirements</li>\n<li>Create motion graphics and visual effects where required</li>\n<li>Ensure timely delivery of high-quality outputs while meeting deadlines</li>\n<li>Contribute to building a strong professional portfolio through real client projects</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Basic working knowledge of video editing tools such as <strong>Adobe Premiere Pro</strong>, <strong>Final Cut Pro</strong>, <strong>CapCut</strong>, or <strong>After Effects</strong></li>\n<li>Hands-on interest in motion graphics and animated video content</li>\n<li>Strong eye for detail, pacing, and visual storytelling</li>\n<li>Familiarity with creating social media content, reels, and marketing videos</li>\n<li>Willingness to learn, accept feedback, and continuously improve</li>\n<li>Ability to manage time effectively and meet deadlines</li>\n<li>A portfolio showcasing personal, academic, or freelance work, including motion graphics–related videos (mandatory)</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Send your updated CV to <strong>hr@tigrid.in</strong>. Learn more about us at: <a href=\"https://www.tigrid.in\">www.tigrid.in</a></p>\n<p><strong>Closing Date</strong>: 21, Mar 2026\n<strong>Job Published</strong>: 09, Feb 2026\n<strong>Contact Email</strong>: hr@tigrid.in</p>",
        "tags": [
            "0-2 Years",
            "Adobe Premiere Pro",
            "Final Cut Pro",
            "After Effects"
        ],
        "summary": "TIGRID TECHNOLOGIES seeks a Video Editor & Motion Graphics Designer with 0-2 years experience to create engaging content for social media and marketing campaigns using tools like Adobe Premiere Pro and After Effects."
    },
    {
        "job_title": "Business Development – IT Services",
        "company": "Elementz It Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27479",
        "location": "Technopark",
        "closing_date": "20 Feb 2026",
        "job_description": "<p><strong>Company</strong>: ELEMENTZ IT SOLUTIONS (P) Ltd\n<strong>Location</strong>: Module No.7(B), 4th Floor, Gayatri Building, Technopark Phase I Campus, 695581\n<strong>Website</strong>: <a href=\"https://www.elementzit.com\">https://www.elementzit.com</a>\n<strong>Closing Date</strong>: 20 Feb 2026\n<strong>Job Published</strong>: 09 Feb 2026\n<strong>Contact Email</strong>: hr@elementzit.com</p>\n<h3><strong>Role Overview</strong></h3>\n<ul>\n<li>Assist in developing and executing business development strategies to grow IT services.</li>\n<li>Build and maintain strong, long-term relationships with clients and stakeholders.</li>\n<li>Identify potential clients, generate leads, and convert them into business opportunities.</li>\n<li>Promote and sell services including Web/Mobile App Development, UI/UX, IT Staffing, and PMO.</li>\n<li>Collaborate with technical teams to create tailored proposals and solutions.</li>\n<li>Support sales team with demos and presentations.</li>\n<li>Lead negotiations, close deals, and manage post-sale engagement for retention/upselling.</li>\n<li>Monitor market trends, competitor activities, and customer feedback to refine strategies.</li>\n<li>Represent the company at industry events, expos, and networking forums.</li>\n</ul>\n<h3><strong>Required Skills &amp; Experience</strong></h3>\n<ul>\n<li><strong>3 to 5 years</strong> of experience in IT services business development.</li>\n<li>Proven track record in selling Web/App Development, UI/UX, IT Consulting, or Staffing Services.</li>\n<li>Strong network and knowledge of IT markets in India, GCC, and the US.</li>\n<li>Excellent communication, interpersonal, and client relationship management skills.</li>\n<li>Ability to work independently, meet deadlines, and deliver results.</li>\n</ul>",
        "tags": [
            "3 to 5 Years",
            "IT Services Business Development",
            "Web/Mobile App Development",
            "Client Relationship Management"
        ],
        "summary": "Business Development role focused on IT services, requiring 3-5 years of experience in sales and client relationship management."
    },
    {
        "job_title": "Business Development Executive-Freshers",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/27478",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<p><strong>Company:</strong> QWY Software (P) Ltd\n<strong>Address:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581\n<strong>Industry:</strong> IT/ITES covering E-com, Logistics, and Hyperlocal Delivery Services\n<strong>Job Title:</strong> Business Development Executive - Freshers\n<strong>Closing Date:</strong> 27, Feb 2026\n<strong>Published Date:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> careers@qwysoft.com</p>\n<h3>Role Overview</h3>\n<p>We are seeking enthusiastic and self-motivated <strong>Business Development Executives</strong> to join our IT Sales team. This role is ideal for <strong>2025 MBA Marketing freshers</strong> with strong communication skills and a keen interest in IT sales and client interaction.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Identify and generate new business opportunities for IT services</li>\n<li>Make outbound calls, emails, and follow-ups with potential clients</li>\n<li>Understand client requirements and coordinate with internal teams</li>\n<li>Prepare proposals, presentations, and basic sales documentation</li>\n<li>Maintain leads and client details in CRM or Excel sheets</li>\n<li>Support senior sales teams in closing deals</li>\n<li>Build and maintain strong client relationships</li>\n<li>Achieve assigned sales targets and KPIs</li>\n<li>Stay updated on company services and market trends</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>MBA in Marketing or related field</strong> (Mandatory 2024-2025 pass-out)</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Strong interpersonal and negotiation skills</li>\n<li>Willingness to learn IT services and sales processes</li>\n<li>Basic knowledge of sales, marketing, and lead generation</li>\n<li>Good presentation and convincing skills</li>\n<li>Comfortable with calling, emailing, and client interaction</li>\n<li>Basic knowledge of MS Office (Excel, Word, PowerPoint)</li>\n<li>Positive attitude and target-oriented mindset</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>If interested, share your CV at <strong>careers@qwysoft.com</strong> with the subject line <strong>\"Fresher-BDE\"</strong>.</p>",
        "tags": [
            "Freshers",
            "MBA Marketing",
            "IT Sales",
            "Client Relationship Management"
        ],
        "summary": "Seeking fresh MBA Marketing graduates for a Business Development Executive role in IT sales, focusing on client interaction, lead generation, and achieving sales targets."
    },
    {
        "job_title": "Manual Tester",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/27477",
        "location": "Technopark",
        "closing_date": "27 Feb 2026",
        "job_description": "<h2>QWY Software (P) Ltd</h2>\n<p><strong>Address:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581</p>\n<p><strong>Industry:</strong> IT/ITES covering E-com, Logistics and Hyperlocal Delivery Services</p>\n<p><strong>Job Title:</strong> Manual Tester</p>\n<p><strong>Closing Date:</strong> 27, Feb 2026\n<strong>Published Date:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@qwysoft.com\">careers@qwysoft.com</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a <strong>Manual Test Engineer</strong> with <strong>1-3 years of experience</strong> in software testing to join our QA team. Responsibilities include analyzing requirements, preparing test cases, executing test plans, reporting defects, and ensuring the overall quality of software deliverables. You will collaborate with developers, business analysts, and project managers to validate applications and ensure alignment with functional and business expectations.</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Hands-on experience in test case creation, execution, and defect reporting</li>\n<li>Solid understanding of SDLC and STLC processes</li>\n<li>Experience in functional, regression, smoke, and integration testing</li>\n<li>Familiarity with bug tracking tools like <strong>JIRA</strong>, <strong>Bugzilla</strong>, or <strong>Mantis</strong></li>\n<li>Basic knowledge of <strong>SQL</strong> for backend data validation</li>\n<li>Hands-on experience with <strong>API testing</strong></li>\n<li>Good understanding of <strong>Agile/Scrum</strong> methodologies</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Ability to work independently and within teams</li>\n<li>Experience with client interactions</li>\n<li>Hands-on experience with performance testing</li>\n<li>Knowledge of domains like e-commerce or BFSI is an added advantage</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email their CVs to <a href=\"mailto:careers@qwysoft.com\">careers@qwysoft.com</a> with the subject line: <strong>\"Application for Manual Test Engineer\"</strong>.</p>",
        "tags": [
            "1-3 Years",
            "JIRA",
            "SQL",
            "Agile/Scrum"
        ],
        "summary": "Manual Test Engineer with 1-3 years of experience required to execute test plans, report defects, and ensure software quality. Must have skills in test case creation, defect reporting, and Agile methodologies."
    },
    {
        "job_title": "Senior Python Developer-AI/ML",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/27476",
        "location": "Technopark",
        "closing_date": "09 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>QWY Software (P) Ltd</strong>\nSecond Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581</p>\n<h2>Job Title</h2>\n<p>Senior Python Developer - AI/ML</p>\n<h2>Key Dates</h2>\n<ul>\n<li><strong>Closing Date:</strong> 09 Mar 2026</li>\n<li><strong>Job Published:</strong> 09 Feb 2026</li>\n</ul>\n<h2>Contact</h2>\n<ul>\n<li><strong>Email:</strong> <a href=\"mailto:careers@qwysoft.com\">careers@qwysoft.com</a></li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Develop and maintain AI/ML-based applications using Python.</li>\n<li>Design, build, and deploy machine learning models and algorithms.</li>\n<li>Work with large datasets, data preprocessing, feature engineering, and model tuning.</li>\n<li>Integrate ML models into production-ready systems and applications.</li>\n<li>Collaborate with data scientists, engineers, and business teams to understand requirements and deliver solutions.</li>\n<li>Optimize and scale ML models for performance and accuracy.</li>\n<li>Stay updated with the latest AI/ML trends, tools, and technologies.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Bachelor's/Master's degree in Computer Science, Engineering, or related field.</li>\n<li><strong>5-8 years</strong> of professional experience in Python development.</li>\n<li>Strong understanding of machine learning algorithms (supervised/unsupervised, NLP, deep learning).</li>\n<li>Proficiency with ML libraries such as TensorFlow, Keras, PyTorch, Scikit-learn.</li>\n<li>Experience with data manipulation tools like Pandas, NumPy.</li>\n<li>Experience in model evaluation, validation techniques, and deployment.</li>\n<li>Hands-on experience with APIs, Flask/Django for model deployment.</li>\n<li>Knowledge of cloud platforms (AWS, Azure, GCP) is a plus.</li>\n<li>Excellent problem-solving and communication skills.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates should share their updated resume to <a href=\"mailto:careers@qwysoft.com\">careers@qwysoft.com</a> with the subject line: <strong>Application for Senior Python Developer - AI/ML</strong>.</p>",
        "tags": [
            "5-8 Years",
            "Python",
            "TensorFlow/PyTorch",
            "AWS"
        ],
        "summary": "Senior Python Developer - AI/ML role requiring 5-8 years of experience in building and deploying machine learning models, collaborating with cross-functional teams, and optimizing algorithms for production systems."
    },
    {
        "job_title": "Odoo Developer",
        "company": "Qwy Software (P) Ltd",
        "url": "https://technopark.org/job-details/27475",
        "location": "Technopark",
        "closing_date": "06 Mar 2026",
        "job_description": "<p><strong>Company:</strong> QWY Software (P) Ltd\n<strong>Location:</strong> Second Floor, Amstor Building, Technopark Phase1, Kazhakuttam, Trivandrum, 695581\n<strong>Industry:</strong> IT/ITES covering E-com, Logistics and Hyperlocal Delivery Services\n<strong>Closing Date:</strong> 06, Mar 2026\n<strong>Job Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> careers@qwysoft.com</p>\n<h3>Job Description</h3>\n<p>We are seeking a skilled and experienced <strong>Odoo Developer</strong> to join our team. The ideal candidate will be responsible for:\n- Developing, customizing, and maintaining Odoo modules.\n- Collaborating with cross-functional teams to implement business requirements.</p>\n<h3>Required Skills</h3>\n<ul>\n<li><strong>Strong knowledge of:</strong> Odoo, Python, PostgreSQL, JSON, JavaScript, Linux, and Git.</li>\n<li><strong>Functional understanding of:</strong> Sales, CRM, Accounts, and HR modules.</li>\n<li><strong>Experience with:</strong> Odoo versions 12, 13, 14, 15, and 16.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Experience with Git, Docker, or Linux environments.</li>\n<li>Odoo Certification.</li>\n<li><strong>Experience:</strong> 3-5 years in relevant roles.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Interested candidates should email their updated CV to <strong>careers@qwysoft.com</strong> with the subject line: <strong>\"Application for Odoo Developer\"</strong>.</p>",
        "tags": [
            "3-5 Years",
            "Odoo",
            "Python",
            "PostgreSQL"
        ],
        "summary": "Seeking an Odoo Developer with 3-5 years of experience in Python, PostgreSQL, and Odoo module customization for E-com and logistics solutions."
    },
    {
        "job_title": "BUSINESS DEVELOPMENT EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27474",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Trainonex Solutions (P) Ltd</strong>\nGround Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<h2>Job Overview</h2>\n<p><strong>Role</strong>: Business Development Executive\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published Date</strong>: 09, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:trainonexsolutions.hr@gmail.com\">trainonexsolutions.hr@gmail.com</a>\n<strong>Basic Pay</strong>: ₹12,000\n<strong>Experience Required</strong>: 0-1 years\n<strong>Note</strong>: Office work only</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Identify and approach potential vendors for business opportunities.</li>\n<li>Contact vendors via calls to explain company services.</li>\n<li>Create and manage professional content related to company services and communications.</li>\n<li>Utilize systems and software efficiently with strong MS Office proficiency.</li>\n<li>Conduct client meetings and maintain positive business relationships.</li>\n<li>Handle calls effectively with a clear, persuasive pitch.</li>\n<li>Support day-to-day operational and coordination activities as required.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Any degree (freshers can apply).</li>\n<li>Basic computer knowledge and MS Office proficiency.</li>\n<li><strong>Lead Generation</strong>: Develop strategies to attract clients and generate leads.</li>\n<li><strong>Relationship Management</strong>: Build/maintain strong client/partner relationships.</li>\n<li><strong>Preferred</strong>: Female candidates.</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>💰 <strong>Performance-Based Incentives</strong>: Earn rewards for dedication and achievements.</li>\n<li>🎉 <strong>Fun Fridays</strong>: Engaging activities like team games and themed dress days.</li>\n<li>🎈 <strong>Special Occasion Celebrations</strong>: Milestone, birthday, and achievement celebrations.</li>\n<li>🤝 <strong>Supportive Team Environment</strong>: Collaborate with passionate, career-focused colleagues.</li>\n<li>📈 <strong>Career Development</strong>: Access training for skill enhancement and advancement.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Mention the subject line as <strong>\"Application for Business Development Executive.\"</strong></p>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Strong communication and negotiation skills.</li>\n<li>Ability to build rapport and maintain long-term relationships.</li>\n<li>Goal-oriented, confident, and self-motivated.</li>\n<li>Basic understanding of sales and vendor management.</li>\n</ul>",
        "tags": [
            "0-1 Years",
            "MS Office",
            "Sales",
            "Vendor Management"
        ],
        "summary": "Seeking a 0-1 year experienced Business Development Executive to drive lead generation, client relationships, and sales growth with performance-based incentives and career development opportunities."
    },
    {
        "job_title": "Business Associate -Inside Sales",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27473",
        "location": "Technopark",
        "closing_date": "14 Feb 2026",
        "job_description": "<h2>Softnotions Technologies (P) Ltd</h2>\n<p><strong>Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</strong>\n<a href=\"https://softnotions.com\">Visit Website</a></p>\n<h3>Business Associate - Inside Sales</h3>\n<p><strong>Closing Date:</strong> 14, Feb 2026\n<strong>Job Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Role Overview</h3>\n<p>Softnotions seeks energetic, tech-savvy individuals passionate about business growth and international sales. As part of the Revenue Operations Team, you will identify global business opportunities, build a lead pipeline, and support the sales cycle end-to-end. This role provides hands-on exposure to international markets (US, Europe, Middle East) and practical experience in prospecting, CRM management, client communication, and sales coordination.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct market research and identify potential international clients in targeted verticals (US, Europe, Middle East, etc.)</li>\n<li>Generate qualified leads via outbound email campaigns, LinkedIn prospecting, and cold calls</li>\n<li>Build and maintain a strong prospect pipeline in the CRM system</li>\n<li>Understand and communicate Softnotions’ service value propositions to clients</li>\n<li>Schedule and coordinate meetings/demos for the Business Development Manager or Technical Sales Team</li>\n<li>Support RFP/RFI processes with background data and documentation</li>\n<li>Maintain reports/dashboards to track outreach and conversion metrics</li>\n<li>Collaborate with marketing and delivery teams to align messaging and client approach</li>\n<li>Assist in proposal follow-ups, lead nurturing, and basic client queries</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong communication skills (written/verbal) with English proficiency</li>\n<li>Understanding of technology trends, software development, and digital transformation</li>\n<li>Basic CRM tool knowledge (HubSpot, Zoho, or equivalent)</li>\n<li>Ability to work across international time zones and cultures</li>\n<li>High attention to detail, responsiveness, and follow-through</li>\n<li>Positive attitude, growth mindset, and eagerness to learn</li>\n<li><strong>Education:</strong> BSC/BTech (CS) + MBA (Mkg)</li>\n</ul>",
        "tags": [
            "Entry Level",
            "CRM Tools",
            "Technology Trends",
            "Digital Transformation"
        ],
        "summary": "Support international sales growth by generating leads, managing CRM pipelines, and collaborating with teams to expand global business opportunities."
    },
    {
        "job_title": "Sr.Wordpress Developer",
        "company": "Softnotions Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27472",
        "location": "Technopark",
        "closing_date": "14 Feb 2026",
        "job_description": "<p><strong>Softnotions Technologies (P) Ltd</strong></p>\n<p><strong>Module No. B, 6th Floor, Bhavani Building, Phase-I Campus, Technopark, Trivandrum, 695 581</strong></p>\n<p><a href=\"https://softnotions.com\">https://softnotions.com</a></p>\n<p><strong>Closing Date:</strong> 14, Feb 2026\n<strong>Job Published:</strong> 09, Feb 2026\n<strong>Contact Email:</strong> recruitment@softnotions.com</p>\n<h3>Brief Description</h3>\n<p>We are seeking a skilled <strong>WordPress Developer</strong> to independently manage ongoing maintenance, enhancements, and new feature development across multiple WordPress websites. The role demands deep expertise in WordPress internals, including Gutenberg, theme/child theme architecture, custom plugin development, WordPress APIs, and performance/SEO best practices.</p>\n<h3>Key Responsibilities</h3>\n<p><strong>WordPress Development &amp; Maintenance</strong>\n- Maintain, enhance, and troubleshoot existing WordPress websites.\n- Develop custom WordPress themes and child themes based on design requirements.\n- Customize and extend Gutenberg blocks and block-based themes.\n- Build and maintain custom WordPress plugins for business-specific functionality.\n- Handle WordPress core, plugin, and theme updates safely.</p>\n<p><strong>Core WordPress &amp; APIs</strong>\n- Work with WordPress Hooks (Actions &amp; Filters) to extend functionality.\n- Develop and consume WordPress REST APIs for integrations.\n- Implement custom post types, taxonomies, and meta fields.\n- Ensure compatibility with WordPress coding standards and best practices.</p>\n<p><strong>Performance, Security &amp; SEO</strong>\n- Optimize website performance (caching, asset optimization, query optimization).\n- Implement basic WordPress security best practices (nonces, sanitization, escaping).\n- Support SEO activities using tools like Yoast or RankMath.\n- Ensure SEO structure: metadata, schema, URLs, performance, and mobile friendliness.</p>\n<p><strong>Collaboration &amp; Quality</strong>\n- Collaborate with designers, backend teams, and project leads.\n- Debug and perform root-cause analysis for production issues.\n- Maintain clean, documented, and version-controlled code (Git).</p>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong hands-on experience with WordPress core development.</li>\n<li>Deep understanding of:</li>\n<li>Gutenberg editor &amp; block concepts</li>\n<li>Themes &amp; child themes</li>\n<li>Custom plugin development</li>\n<li>WordPress hooks, filters, and APIs</li>\n<li>Proficiency in PHP, HTML5, CSS3, JavaScript.</li>\n<li>Experience with page builders (Elementor/WPBakery) and advanced customization.</li>\n<li>Solid understanding of MySQL and WordPress database structure.</li>\n<li>Experience with SEO plugins and on-page optimization.</li>\n<li>Familiarity with performance optimization and caching techniques.</li>\n<li>Experience using Git/version control.</li>\n<li>Gutenberg custom block development (ACF blocks or native blocks).</li>\n<li>WooCommerce customization.</li>\n<li>Headless WordPress or REST-based integrations.</li>\n<li>Experience with hosting environments (cPanel, Cloud, CDN, staging setups).</li>\n</ul>\n<h3>Experience &amp; Qualification</h3>\n<ul>\n<li><strong>4+ years</strong> of real-world WordPress development experience.</li>\n<li>Proven experience maintaining and extending live WordPress websites.</li>\n<li>Degree in Computer Science/IT or equivalent practical experience.</li>\n</ul>",
        "tags": [
            "4+ Years",
            "WordPress",
            "PHP",
            "Gutenberg"
        ],
        "summary": "A WordPress Developer with 4+ years of experience is needed to maintain, enhance, and develop WordPress sites. Requires expertise in WordPress core, PHP, and Gutenberg block development."
    },
    {
        "job_title": "Senior Back End Engineers - Node.js",
        "company": "Iboson Innovations (P) Ltd",
        "url": "https://technopark.org/job-details/27471",
        "location": "Technopark",
        "closing_date": "14 Feb 2026",
        "job_description": "<h2>iBoson Innovations (P) Ltd</h2>\n<p>ACE 1, 3rd Floor, CDAC Building, Technopark Campus, Kazhakootam, Thiruvananthapuram, 695581\n<a href=\"http://www.iboson.io\">http://www.iboson.io</a></p>\n<h3>Senior Back End Engineer - Node.js</h3>\n<p><strong>Closing Date:</strong> 14 Feb 2026\n<strong>Job Published:</strong> 09 Feb 2026\n<strong>Contact Email:</strong> career@ibosoninnov.com</p>\n<p>At iBoson, we push the boundaries of Augmented Reality (AR) and Artificial Intelligence (AI) to build next-gen solutions. We are expanding our team and seeking a skilled <strong>Node.js Developer</strong> to develop robust, scalable, and high-performance backend systems for our products.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Design, develop, and maintain scalable server-side applications using Node.js.</li>\n<li>Develop and integrate RESTful APIs and third-party services.</li>\n<li>Optimize back-end processes for performance, security, and scalability.</li>\n<li>Collaborate with front-end developers to integrate user-facing elements.</li>\n<li>Manage and implement database solutions (SQL/NoSQL).</li>\n<li>Debug, troubleshoot, and resolve back-end issues efficiently.</li>\n<li>Follow best practices in code quality, testing, and documentation.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li><strong>5+ years</strong> of experience in back-end development with Node.js.</li>\n<li>Strong understanding of JavaScript, TypeScript, and asynchronous programming.</li>\n<li>Experience building and managing RESTful APIs and microservices architecture.</li>\n<li>Proficiency in databases (MongoDB, MySQL, or PostgreSQL).</li>\n<li>Knowledge of OOP concepts, authentication/authorization mechanisms (JWT, OAuth).</li>\n<li>Experience with server-side frameworks (Express.js, Nest.js).</li>\n<li>Familiarity with cloud platforms (AWS, Google Cloud, Azure).</li>\n<li>Understanding of Agile methodologies and CI/CD pipelines.</li>\n<li>Exposure to AI integrations and AR technologies is advantageous.</li>\n</ul>\n<h3>About the Role:</h3>\n<p>Be part of a team that thrives on innovation and problem-solving. At iBoson, you’ll work with emerging AR &amp; AI technologies, contribute to impactful projects, and grow in a collaborative, tech-driven environment. Apply now by sending your resume to <strong>career@ibosoninnov.com</strong>.</p>",
        "tags": [
            "5+ Years",
            "Node.js",
            "JavaScript/TypeScript",
            "RESTful APIs"
        ],
        "summary": "Senior Back End Engineer (Node.js) at iBoson Innovations. 5+ years required for scalable AR/AI backend systems."
    },
    {
        "job_title": "Product Support Analyst",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27470",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Address:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">Reflections Global</a>\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Job Published:</strong> 08, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Introduction</h3>\n<p>We are seeking <strong>1+ years</strong> of experienced candidates for this role.</p>\n<h3>Shift Requirement</h3>\n<ul>\n<li>Must be available to work in a <strong>24×7 shift environment</strong>.</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Provide first-level technical support for SAS products via email, phone, or ticketing systems.</li>\n<li>Troubleshoot and resolve issues related to installation, configuration, and usage of SAS applications.</li>\n<li>Escalate complex issues to senior support engineers or development teams when necessary.</li>\n<li>Document solutions, FAQs, and best practices to improve knowledge base and customer self-service.</li>\n<li>Collaborate with cross-functional teams (development, QA, consulting) to resolve customer concerns.</li>\n<li>Assist in monitoring product performance and reporting recurring issues.</li>\n<li>Ensure timely resolution of support cases while maintaining high customer satisfaction.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong>\n- 6 months – 1 year of experience in SAS product support or related technical support role.\n- Basic understanding of SAS software (Base SAS, SAS Enterprise Guide, SAS Visual Analytics, or other SAS modules).\n- Familiarity with SQL, data management concepts, and statistical tools.\n- Strong problem-solving and analytical skills.\n- Excellent communication skills (written and verbal).\n- Ability to work independently and in a team environment.\n- Bachelor’s degree in Computer Science, Information Technology, Statistics, or related field.</p>\n<p><strong>Secondary Skills:</strong>\n- Exposure to Linux/Windows server environments.\n- Knowledge of scripting languages (Python, R, or Shell scripting).\n- Experience with ticketing systems (ServiceNow, JIRA, or similar).\n- Understanding of data analytics and reporting concepts.</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates may forward their detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> along with their notice period, current and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does <strong>not</strong> charge any fees for job applications. We contact candidates only through our official website or LinkedIn. All employment-related emails are sent via the official HR email ID. For clarification or alerts, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "1+ Year",
            "SAS",
            "SQL",
            "Scripting (Python/R/Shell)"
        ],
        "summary": "Product Support Analyst role requiring 1+ years of SAS product support experience. Responsibilities include technical troubleshooting, cross-functional collaboration, and maintaining customer satisfaction in a 24×7 environment."
    },
    {
        "job_title": "IBM Sterling OMS Solution Architect",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27469",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a></p>\n<p><strong>IBM Sterling OMS Solution Architect</strong>\n- <strong>Closing Date:</strong> 13, Feb 2026\n- <strong>Job Published:</strong> 08, Feb 2026\n- <strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Introduction</h3>\n<p>We are seeking candidates with <strong>8+ years</strong> of experience.</p>\n<h3>Job Description</h3>\n<p>As a <strong>Software Architect – IBM Sterling OMS</strong>, you will lead the design and delivery of high-quality enterprise-class OMS solutions and guide teams through architecture, implementation, and optimization of the Sterling platform.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Define solution architecture and detailed technical design for IBM Sterling OMS initiatives.</li>\n<li>Lead and mentor development teams in designing, coding, customizing, and deploying Sterling OMS solutions.</li>\n<li>Translate functional requirements into scalable, resilient, and maintainable Sterling OMS architecture.</li>\n<li>Oversee end-to-end development (design, development, deployment, debugging, documentation).</li>\n<li>Ensure OMS enhancements meet performance, scalability, and security standards aligned with stakeholder KPIs.</li>\n<li>Manage technical requirements for Sterling OMS (v10.0), including configurations, APIs, workflows, and database extensions.</li>\n<li>Estimate effort, cost, dependencies, and timelines for new features and architectural components.</li>\n<li>Provide architectural governance and conduct design/code reviews.</li>\n<li>Lead integration architecture with external systems (WMS, ERP, Commerce, TMS, Inventory).</li>\n<li>Guide OMS implementation (SL, BT, or custom setups) and enforce best practices.</li>\n<li>Collaborate with cross-functional IT teams on logistics, order orchestration, and fulfillment.</li>\n<li>Drive secure, scalable, cloud-ready OMS development aligned with Agile methodologies.</li>\n<li>Contribute to continuous improvements via automation, reusable components, and standardized artifacts.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<p><strong>Primary Skills:</strong>\n- <strong>Experience:</strong> 8+ years in IT with hands-on architecture/design experience in IBM Sterling OMS.\n- <strong>Technical Skills:</strong>\n  - Advanced expertise in IBM Sterling Order Management System (configurations, customizations, workflows, SDF, DB extensions, APIs).\n  - Strong experience with DB2/Oracle databases (performance tuning, indexing, complex queries).\n  - Proficiency in XML, JSON, and integration patterns (MQ, WebServices, REST APIs).\n  - Linux/Unix environments (Intermediate/Advanced).\n  - Hands-on exposure to GCP (GKE, Artifact Registry, Compute Engine) or equivalent cloud platforms.\n  - Strong knowledge of Git and modern DevOps practices.</p>\n<p><strong>Secondary Skills:</strong>\n- Integration experience with MQ, WebServices, and cloud-native components.\n- Knowledge of Kubernetes/Docker for OMS deployment/troubleshooting.\n- Familiarity with CI/CD pipelines (GitHub Actions, Jenkins).\n- Strong soft skills: self-learning, collaboration, planning, organization.</p>\n<h3>Application Instructions</h3>\n<p>Interested candidates should send resumes to <strong>Careers@reflectionsinfos.com</strong> with notice period, current, and expected CTC details. <strong>Important:</strong> Reflections Info Systems does not charge any fees for jobs. All communications are via official website, LinkedIn, or the HR email. Report any suspicious activity to <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "8+ Years",
            "IBM Sterling OMS",
            "Java",
            "GCP"
        ],
        "summary": "Lead IBM Sterling OMS architecture and implementation, mentor teams, and ensure cloud-ready solutions with 8+ years of IT experience in enterprise systems."
    },
    {
        "job_title": "Senior Software Engineer - Java",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27468",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Address:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Job Title:</strong> Senior Software Engineer - Java\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Published Date:</strong> 08, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking candidates with <strong>4+ years</strong> of experience in software development.</p>\n<h3><strong>Job Responsibilities</strong></h3>\n<ul>\n<li>Collaborate with team leads to deliver assigned tasks and provide technical guidance/coaching.</li>\n<li>Translate business requirements into technical specifications.</li>\n<li>Analyze impacts of planned work on existing systems.</li>\n<li>Design client-side and server-side architecture, including high-level and low-level designs.</li>\n<li>Create proofs of concept/demos for client requirements.</li>\n<li>Ensure application responsiveness, develop unit/integration tests, and implement security/data protection.</li>\n<li>Write technical documentation and stay updated on industry trends.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<p><strong>Primary Skills:</strong>\n- Bachelor’s/Master’s in Engineering/Technology or Computer Applications.\n- <strong>4+ years</strong> of software development experience.\n- Expertise in <strong>Java</strong>, <strong>Spring Boot</strong>, <strong>React JS</strong>, <strong>MongoDB</strong>.\n- Proficiency in code reviews, Git, and DevOps tasks.\n- Knowledge of front-end (HTML/CSS, JavaScript, jQuery) and back-end (Java, Python, C#, Angular, Node.js) technologies.\n- Familiarity with RDBMS/NoSQL databases (MySQL, Cassandra), web servers (Apache), and UI/UX design.\n- Experience with tools: IDE, Git, Jenkins, Maven, Gradle.</p>\n<p><strong>Secondary Skills:</strong>\n- Backend system integration and enterprise-level software development.\n- Open-source software experience and enterprise security configurations.\n- Strong problem-solving and communication skills.\n- Ability to translate business requirements into software solutions.\n- Contributions to hiring, training, and team-building.\n- Testing frameworks: JUnit, Jest, JMeter, Selenium.</p>\n<h3><strong>Application Instructions</strong></h3>\n<p>Send resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are via official website or LinkedIn. Contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> for verification.</p>",
        "tags": [
            "4+ Years",
            "Java",
            "Spring Boot",
            "MongoDB"
        ],
        "summary": "Senior Software Engineer - Java role requiring 4+ years of experience in enterprise software development, with expertise in Java, Spring Boot, and MongoDB. Responsibilities include full-stack development, technical leadership, and system design for retail industry solutions."
    },
    {
        "job_title": "Software Engineer - Java",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27467",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India , 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2>Job Overview</h2>\n<p><strong>Software Engineer - Java</strong>\n- <strong>Closing Date</strong>: 13, Feb 2026\n- <strong>Job Published</strong>: 08, Feb 2026\n- <strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h2>Introduction</h2>\n<p>We are seeking candidates with <strong>2+ years</strong> of experience in software development.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Collaborate with team leads to deliver assigned tasks</li>\n<li>Provide technical guidance and coaching to team members</li>\n<li>Translate business requirements into technical solutions</li>\n<li>Design client-side and server-side architecture</li>\n<li>Conduct proofs of concept and demos for client requirements</li>\n<li>Ensure application responsiveness and security</li>\n<li>Develop unit/integration tests and technical documentation</li>\n<li>Stay updated on industry trends and share knowledge</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Primary Skills</h3>\n<ul>\n<li>Bachelor’s/Master’s in Engineering/Technology/Computer Applications</li>\n<li>2+ years of software development experience</li>\n<li>Expertise in Java/JavaScript, Spring Boot/React JS, RDBMS/NoSQL databases</li>\n<li>Proficiency in code reviews, Git, and DevOps tasks</li>\n<li>Full-stack development capabilities (backend + frontend)</li>\n<li>Knowledge of HTML/CSS, JavaScript frameworks (Angular/React/Node.js)</li>\n<li>Familiarity with Apache, MySQL, Cassandra, MongoDB</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li>Backend system integration experience</li>\n<li>Enterprise-level software development</li>\n<li>Open-source software development</li>\n<li>Enterprise security configurations</li>\n<li>Exceptional problem-solving and communication skills</li>\n<li>Organizational contributions (hiring, training, mentoring)</li>\n<li>Testing frameworks (JUnit, Jest, JMeter, Selenium)</li>\n</ul>\n<h2>Application Process</h2>\n<p>Forward resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current/expected CTC details. <strong>Important</strong>: Reflections does not charge fees for jobs. All communications are via official website/LinkedIn or HR email.</p>",
        "tags": [
            "2+ Years",
            "Java",
            "Spring Boot",
            "React JS"
        ],
        "summary": "A Java-focused Software Engineer role requiring 2+ years of experience in enterprise software development with expertise in Java/Spring Boot and full-stack capabilities."
    },
    {
        "job_title": "Senior Data Engineer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27466",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India 695581\n<a href=\"http://www.reflectionsglobal.com\">Visit Website</a></p>\n<h2>Job Details</h2>\n<p><strong>Position</strong>: Senior Data Engineer\n<strong>Closing Date</strong>: 13, Feb 2026\n<strong>Published On</strong>: 08, Feb 2026\n<strong>Contact Email</strong>: <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h2>Brief Description</h2>\n<p>We are seeking candidates with <strong>5+ years</strong> of experience for this role. Key requirements include:\n- Strong understanding of data warehousing concepts and best practices.\n- Proficiency in <strong>Python</strong> and <strong>SQL</strong> for data manipulation and query optimization.\n- Working knowledge of <strong>ETL</strong> and data platforms with <strong>SAP</strong> data (SAP as the source for OLAP).\n- Knowledge of <strong>Snowflake</strong> architecture, features, and best practices.\n- Ability to design and implement data solutions using Snowflake.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Design and develop data pipelines for high-performance, live query access.</li>\n<li>Engage in data exploitation and analytical model development with SAP data using AtScale semantic layer.</li>\n<li>Collaborate with the data team to integrate with existing infrastructure and tools.</li>\n<li>Monitor and troubleshoot pipelines to ensure data quality, consistency, and timely delivery.</li>\n<li>Optimize SQL queries and pipelines for performance and efficiency.</li>\n<li>Implement data governance and best practices for security, compliance, and quality in Snowflake databases.</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>3+ years as a Data Engineer with Snowflake experience.</li>\n<li>Strong grasp of data warehousing and Snowflake architecture.</li>\n<li>Proficiency in Python, SQL, and Snowflake-based data solutions.</li>\n<li>Familiarity with cloud platforms (AWS, Azure, GCP).</li>\n<li>Excellent problem-solving skills and passion for data accessibility.</li>\n<li>Experience with ETL processes, data integration, and pipeline development in Snowflake/SAP.</li>\n</ul>\n<h2>Secondary Skills</h2>\n<ul>\n<li>Cloud platforms (AWS, Azure, GCP).</li>\n<li>Data governance and security practices.</li>\n<li>Agile methodologies.</li>\n<li>Git version control.</li>\n<li>Adaptability to modern technologies and methodologies.</li>\n<li>Strong communication and collaboration skills.</li>\n</ul>\n<h2>Application Instructions</h2>\n<p>Interested candidates should email their resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice</strong>: Reflections Info Systems does not charge any fees for job applications. All communications are via official email or LinkedIn. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "5+ Years",
            "Snowflake",
            "Python",
            "SQL"
        ],
        "summary": "Senior Data Engineer role requiring 5+ years of experience in data warehousing, Snowflake, Python, and SQL. Focus on designing data pipelines, optimizing queries, and ensuring data governance."
    },
    {
        "job_title": "Regional Sales Manager – GCC (Software Sales)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27465",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Job Title:</strong> Regional Sales Manager – GCC (Software Sales)\n<strong>Closing Date:</strong> 13, Feb 2026\n<strong>Published Date:</strong> 08, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3><strong>Job Overview</strong></h3>\n<p>We are seeking a dynamic <strong>Regional Sales Manager (RSM)</strong> to lead and expand our software business operations across the <strong>Gulf Cooperation Council (GCC)</strong> region, including Saudi Arabia, UAE, Qatar, Kuwait, Bahrain, and Oman. The RSM will drive sustainable revenue growth, build long-term client relationships, and position our enterprise software solutions as a trusted choice for digital transformation in key industries such as <strong>Banking, Financial Services, Telecom, Retail, and Government</strong>.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Develop and execute comprehensive regional sales strategies to meet/exceed software and services revenue targets (software solutions, SaaS, licensing, digital transformation).</li>\n<li>Identify and secure new enterprise clients while nurturing long-term relationships with key accounts and CXO-level stakeholders.</li>\n<li>Manage the end-to-end enterprise sales cycle (prospecting, RFPs, proposals, negotiations, deal closure).</li>\n<li>Ensure timely revenue collection and follow-up with existing accounts, driving upselling/cross-selling opportunities.</li>\n<li>Expand the partner ecosystem by establishing relationships with system integrators, VARs, and channel partners across GCC.</li>\n<li>Ensure compliance with regional regulatory requirements (public tenders, data residency norms, SaaS/cloud compliance).</li>\n<li>Collaborate cross-functionally with Pre-Sales, Delivery, Product, Marketing, and Partner Management teams.</li>\n<li>Represent the company at regional trade events, summits, and conferences.</li>\n<li>Provide accurate sales forecasts, pipeline insights, and market intelligence to senior management.</li>\n</ul>\n<h3><strong>Travel Requirements</strong></h3>\n<ul>\n<li>Travel required across GCC for client meetings, partner engagements, and industry events.</li>\n</ul>\n<h3><strong>Preferred Skills</strong></h3>\n<ul>\n<li>Bachelor’s degree in Business, Computer Science, Engineering, or related field; MBA preferred.</li>\n<li><strong>5–8 years of enterprise software sales experience</strong>, including <strong>5+ years in a regional leadership capacity</strong> within GCC.</li>\n<li>Proven success in selling <strong>SaaS, cloud platforms, and enterprise solutions</strong> to large/mid-sized clients.</li>\n<li>Deep understanding of <strong>GCC market regulations, tendering processes, and enterprise procurement frameworks</strong>.</li>\n<li>Established network of enterprise clients and partners in key markets (KSA, Qatar, UAE).</li>\n<li>Excellent <strong>communication, negotiation, and presentation skills</strong>.</li>\n<li>Strong <strong>soft skills</strong>: resilience, adaptability, cross-cultural negotiation, leadership under pressure.</li>\n<li><strong>Fluency in English and Arabic</strong> mandatory.</li>\n<li>Must hold a <strong>valid GCC residency</strong> and <strong>driving license</strong>.</li>\n</ul>\n<h3><strong>Application Instructions</strong></h3>\n<p>Interested candidates should forward detailed resumes to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> No payment is ever sought for jobs at Reflections. We contact candidates only via our official website or LinkedIn. For clarifications, contact <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "5+ Years",
            "SaaS",
            "Enterprise Software Sales",
            "GCC Market Expertise"
        ],
        "summary": "Lead enterprise software sales in GCC, driving revenue growth and client relationships. Requires 5+ years of regional sales experience and expertise in SaaS/cloud solutions."
    },
    {
        "job_title": "Senior QA Automation Engineer",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27464",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Senior QA Automation Engineer</h2>\n<p><strong>Company:</strong> Reflections Info Systems (P) Ltd\n<strong>Location:</strong> 9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India 695581\n<strong>Website:</strong> <a href=\"http://www.reflectionsglobal.com\">www.reflectionsglobal.com</a>\n<strong>Closing Date:</strong> 13 Feb 2026\n<strong>Published Date:</strong> 08 Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></p>\n<h3>Responsibilities</h3>\n<ul>\n<li><strong>Automation Delivery &amp; Ownership</strong></li>\n<li>Own and drive automation for critical business/customer journeys</li>\n<li>Identify, prioritize, and implement automation opportunities to reduce manual regression effort</li>\n<li>Ensure automation coverage, reliability, and execution speed meet delivery expectations</li>\n<li>\n<p>Act as hands-on automation lead within delivery squads</p>\n</li>\n<li>\n<p><strong>Hands-On Automation Engineering</strong></p>\n</li>\n<li>Design, develop, and maintain automated test suites using <strong>Playwright + TypeScript</strong></li>\n<li>Own and evolve automation frameworks with reusable components</li>\n<li>Implement CI/CD integration for automated tests</li>\n<li>Execute cross-browser/environment tests via cloud platforms (e.g., LambdaTest)</li>\n<li>\n<p>Apply engineering practices: version control, code reviews, automation standards</p>\n</li>\n<li>\n<p><strong>API &amp; Integration Testing</strong></p>\n</li>\n<li>Design and automate API tests using <strong>Postman/Playwright</strong></li>\n<li>Validate integrations, data accuracy, and business rules across systems</li>\n<li>\n<p>Support contract/integration testing approaches</p>\n</li>\n<li>\n<p><strong>Performance &amp; Non-Functional Testing</strong></p>\n</li>\n<li>Design/load/stress tests using <strong>K6/JMeter</strong></li>\n<li>Analyze performance results and highlight risks/regressions</li>\n<li>\n<p>Support performance monitoring via dashboards (e.g., Grafana)</p>\n</li>\n<li>\n<p><strong>Manual &amp; Exploratory Testing</strong></p>\n</li>\n<li>Perform targeted manual testing for high-risk/exploratory scenarios</li>\n<li>Validate end-to-end workflows and edge cases</li>\n<li>\n<p>Support usability/experience-focused testing</p>\n</li>\n<li>\n<p><strong>Defect &amp; Quality Management</strong></p>\n</li>\n<li>Log/track/validate defects using <strong>Jira</strong></li>\n<li>Participate in defect triage and collaborate with engineering teams</li>\n<li>\n<p>Use defect trends/automation insights to improve test coverage</p>\n</li>\n<li>\n<p><strong>Test Management, Data &amp; Reporting</strong></p>\n</li>\n<li>Maintain test cases in <strong>XRAY</strong> or equivalent tools</li>\n<li>Manage test data/environment readiness</li>\n<li>Report automation progress/coverage/quality risks to QA Manager</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li><strong>Experience:</strong> 5–8 years in QA/Quality Engineering with automation focus</li>\n<li><strong>Technical Skills:</strong></li>\n<li><strong>Playwright + TypeScript</strong> automation</li>\n<li>Automation framework design/maintenance</li>\n<li><strong>API testing</strong> (Postman/Playwright)</li>\n<li><strong>Performance testing</strong> (K6/JMeter)</li>\n<li><strong>CI/CD pipelines</strong> (Git)</li>\n<li>Cloud-based cross-browser testing platforms</li>\n<li><strong>Test management</strong> tools (XRAY, Jira)</li>\n<li><strong>Professional Attributes:</strong></li>\n<li>Strong technical mindset</li>\n<li>Proactive, accountable, delivery-focused</li>\n<li>High attention to detail</li>\n<li>Cross-functional teamwork</li>\n<li>Clear communication of technical issues</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li><strong>AI-Enabled Testing &amp; Quality Innovation</strong></li>\n<li>Evaluate AI-assisted testing tools for coverage/speed/defect detection</li>\n<li>Leverage AI for test case generation/maintenance/regression optimization</li>\n<li>Use AI insights to identify high-risk areas/flaky tests/automation gaps</li>\n<li>Experiment with AI for exploratory testing/data generation/failure analysis</li>\n<li>Collaborate with QA Manager to introduce AI responsibly into testing practices</li>\n</ul>\n<h3>Application Instructions</h3>\n<p>Interested candidates should email <strong>Careers@reflectionsinfos.com</strong> with:\n- Detailed resume\n- Notice period\n- Current/expected CTC details</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does <strong>not</strong> charge fees for job applications. All communications are via official website, LinkedIn, or the HR email above. Report any suspicious activity to <strong>Careers@reflectionsinfos.com</strong>.</p>",
        "tags": [
            "5–8 Years",
            "Playwright + TypeScript",
            "API Testing",
            "CI/CD Pipelines"
        ],
        "summary": "Senior QA Automation Engineer role requiring 5–8 years of experience in automation, Playwright/TypeScript, API testing, and performance testing. Focus on end-to-end automation ownership, Agile collaboration, and AI-driven quality innovation."
    },
    {
        "job_title": "Cloud Architect - Bangalore – WFO (3 days a week)",
        "company": "Reflections Info Systems (P) Ltd",
        "url": "https://technopark.org/job-details/27463",
        "location": "Technopark",
        "closing_date": "13 Feb 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>Reflections Info Systems (P) Ltd</strong>\n9A2, Carnival Technopark, Kariyavattom P.O, Thiruvananthapuram, Kerala, India, 695581\n<a href=\"http://www.reflectionsinfos.com\">Visit Website</a></p>\n<h2>Job Title</h2>\n<p><strong>Cloud Architect - Bangalore – WFO (3 days a week)</strong></p>\n<h2>Key Dates</h2>\n<ul>\n<li><strong>Closing Date:</strong> 13, Feb 2026</li>\n<li><strong>Published:</strong> 08, Feb 2026</li>\n</ul>\n<h2>Contact</h2>\n<ul>\n<li><strong>Email:</strong> <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a></li>\n</ul>\n<h2>Job Overview</h2>\n<p>As a Cloud Architect, you will join our Engineering team to build high-quality enterprise software for the retail industry. Your role will focus on cloud strategy, DevOps best practices, and infrastructure security.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Create and manage cloud strategies for enterprise adoption</li>\n<li>Evaluate cloud applications, hardware, and software</li>\n<li>Build/maintain CI/CD pipelines (Jenkins, Azure DevOps, BitBucket)</li>\n<li>Implement monitoring/alerts for production/non-production environments</li>\n<li>Execute Blue-Green deployments for zero-downtime transitions</li>\n<li>Perform emergency hot fixes and routine security patching</li>\n<li>Harden computing/networking infrastructure using CIS benchmarks, IDS/IPS, etc.</li>\n<li>Plan and test disaster recovery (DR) strategies</li>\n<li>Automate database backups/restores</li>\n<li>Monitor production systems for outages/performance issues</li>\n<li>Ensure annual VAPT (Vulnerability Assessment &amp; Penetration Testing)</li>\n<li>Provide performance feedback to team members</li>\n<li>Adopt evolving DevOps best practices</li>\n</ul>\n<h2>Preferred Skills</h2>\n<h3>Primary Skills</h3>\n<ul>\n<li><strong>CI/CD Tools:</strong> Jenkins, Azure DevOps, BitBucket Pipelines</li>\n<li><strong>Containerization:</strong> Docker, Kubernetes</li>\n<li><strong>Version Control:</strong> GitHub, BitBucket, GitLab</li>\n<li><strong>Security Hardening:</strong> CIS benchmarks, IDS/IPS, antivirus, network configuration</li>\n<li><strong>Multi-Data Center Infrastructure</strong></li>\n<li><strong>Public Cloud Expertise:</strong> At least 2 platforms (AWS, Azure, GCP)</li>\n<li><strong>Certifications:</strong> CISM, AWS Solution Architect, GCP Cloud Architect, Azure Solutions Architect</li>\n</ul>\n<h3>Secondary Skills</h3>\n<ul>\n<li><strong>Experience:</strong> Minimum 7 years in DevOps (software product companies preferred)</li>\n<li><strong>Education:</strong> Graduate/Postgraduate in Engineering/Computer Applications</li>\n<li><strong>Industry Knowledge:</strong> Retail domain familiarity</li>\n<li><strong>Cloud Focus:</strong> Multi-region, high-availability, scalable system design</li>\n</ul>\n<h2>Application Process</h2>\n<p>Submit your resume to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a> with notice period, current, and expected CTC details.</p>\n<p><strong>Important Notice:</strong> Reflections Info Systems does not charge any fees for job applications. All communications are via official website, LinkedIn, or the HR email. Report suspicious activity to <a href=\"mailto:Careers@reflectionsinfos.com\">Careers@reflectionsinfos.com</a>.</p>",
        "tags": [
            "7+ Years",
            "Docker",
            "Kubernetes",
            "Jenkins"
        ],
        "summary": "Cloud Architect role requiring 7+ years of DevOps experience, expertise in Docker, Kubernetes, and Jenkins, with a focus on cloud strategy, security, and scalable systems."
    },
    {
        "job_title": "Graphic Designer (Motion Graphics)",
        "company": "Globcom Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27462",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<h2>Company: Globcom Solutions (P) Ltd</h2>\n<p><strong>Location:</strong> Module 2502, 5th Floor, Yamuna Building, Technopark Phase 3, Thiruvananthapuram, 695583\n<strong>Website:</strong> <a href=\"http://www.globcomsolution.com\">http://www.globcomsolution.com</a>\n<strong>Closing Date:</strong> 28, Feb 2026\n<strong>Published Date:</strong> 07, Feb 2026\n<strong>Contact Email:</strong> rajesh@globcomsolution.com</p>\n<h3>Job Summary</h3>\n<p>We are seeking a skilled and creative <strong>Graphic Designer (Motion Graphics)</strong> with <strong>minimum 2 years of professional experience</strong> to join our team. The ideal candidate will possess a strong design portfolio, excellent visual aesthetics, and the ability to create engaging, brand-consistent designs for both digital and print platforms.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Create high-quality visual assets including social media creatives, marketing materials, websites, banners, flyers, logos, and print collaterals.</li>\n<li>Design and develop motion graphics for digital platforms as required.</li>\n<li>Collaborate with internal teams to conceptualize and execute designs based on project requirements and brand guidelines.</li>\n<li>Prepare design drafts, mockups, and concepts and present them for review and feedback.</li>\n<li>Ensure visual consistency and brand alignment across all platforms and deliverables.</li>\n<li>Work closely with UI/UX designers, content teams, and developers to enhance overall user experience.</li>\n<li>Maintain and organize design assets, source files, and follow version control best practices.</li>\n<li>Adapt and optimize designs for various formats including web, mobile, and print.</li>\n<li>Stay up to date with the latest design trends, tools, and industry best practices.</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Minimum 2 years of proven experience in graphic design or a related field.</li>\n<li>Proficiency in <strong>Adobe Photoshop</strong>, <strong>Adobe Illustrator</strong>, <strong>Canva</strong>, and other relevant design tools.</li>\n<li>Experience in <strong>motion graphics</strong> is mandatory.</li>\n<li>Strong portfolio showcasing a diverse range of creative design and motion work.</li>\n<li>Solid understanding of design principles including layout, typography, color theory, and visual hierarchy.</li>\n<li>Ability to work independently as well as collaboratively in a team environment.</li>\n<li>Strong communication, presentation, and time-management skills.</li>\n</ul>",
        "tags": [
            "2+ Years",
            "Adobe Photoshop",
            "Adobe Illustrator",
            "Motion Graphics"
        ],
        "summary": "Seeking a creative Graphic Designer with 2+ years of experience in motion graphics to create engaging digital and print designs. Requires proficiency in Adobe tools and collaboration across teams."
    },
    {
        "job_title": "HR Trainee",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/27461",
        "location": "Technopark",
        "closing_date": "20 Mar 2026",
        "job_description": "<h2>Company Information</h2>\n<p><strong>ZenturioTech (P) Ltd</strong>\n<strong>Location:</strong> STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website:</strong> <a href=\"https://zenturiotech.com\">https://zenturiotech.com</a></p>\n<h2>Job Details</h2>\n<p><strong>Position:</strong> HR Trainee\n<strong>Duration:</strong> 3 Months (Unpaid Internship)\n<strong>Work Mode:</strong> Onsite at Technopark, Trivandrum\n<strong>Certificate:</strong> Provided upon successful completion\n<strong>Application Deadline:</strong> 20, Mar 2026\n<strong>Published On:</strong> 07, Feb 2026\n<strong>Contact Email:</strong> admin@zenturiotech.com</p>\n<h2>Job Summary</h2>\n<p>We are seeking a motivated HR Trainee to support our people operations. This role offers hands-on learning for candidates aiming to build a career in Human Resources.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Support recruitment activities and assist in resume screening and shortlisting</li>\n<li>Coordinate interviews and scheduling</li>\n<li>Assist with employee engagement initiatives</li>\n<li>Support daily HR operations and workflows</li>\n<li>Help with internal coordination and HR communication</li>\n<li>Handle routine HR support tasks</li>\n</ul>\n<h2>Preferred Skills</h2>\n<ul>\n<li>Strong communication and organizational skills</li>\n<li>Basic understanding of HR processes</li>\n<li>Proactive mindset and strong work ethic</li>\n<li>Willingness to learn and work in a team</li>\n</ul>",
        "tags": [
            "Freshers",
            "HR Processes",
            "Communication Skills",
            "Organizational Skills"
        ],
        "summary": "ZenturioTech seeks an HR Trainee for a 3-month unpaid internship at Technopark, supporting recruitment and HR operations. Requires communication, organizational skills, and a proactive mindset with teamwork focus."
    },
    {
        "job_title": "Business Development Executive",
        "company": "Zenturiotech (P) Ltd",
        "url": "https://technopark.org/job-details/27460",
        "location": "Technopark",
        "closing_date": "20 Mar 2026",
        "job_description": "<p><strong>Company</strong>: ZenturioTech (P) Ltd\n<strong>Location</strong>: STPI Building, 4th Floor, Technopark, Thiruvananthapuram, Kerala, 695581\n<strong>Website</strong>: <a href=\"https://zenturiotech.com\">https://zenturiotech.com</a>\n<strong>Closing Date</strong>: 20, Mar 2026\n<strong>Job Published</strong>: 07, Feb 2026\n<strong>Contact Email</strong>: admin@zenturiotech.com</p>\n<h3>Brief Description</h3>\n<p>Are you ambitious, driven, and excited about building something from the ground up? We are a fast-growing startup looking for a <strong>Business Development Executive</strong> who can turn conversations into customers and ideas into revenue. If you’re a LinkedIn-savvy professional with a passion for sales and growth, this is your chance to be part of an early-stage journey with real impact.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Build and manage global connections using LinkedIn and other digital platforms</li>\n<li>Handle the complete sales cycle – from prospecting and outreach to closing deals</li>\n<li>Generate and qualify leads through digital and networking channels</li>\n<li>Create persuasive pitches and proposals for potential clients</li>\n<li>Explore and open new markets and partnership opportunities</li>\n<li>Work closely with founders and core team to support business strategy</li>\n<li>Maintain CRM records and track sales performance</li>\n<li>Take initiative and contribute ideas for business growth</li>\n</ul>\n<h3>Preferred Skills</h3>\n<ul>\n<li>Strong communication and negotiation skills</li>\n<li>Proven experience or strong interest in sales and business development</li>\n<li>Skilled in LinkedIn lead generation and digital outreach</li>\n<li>Self-motivated with a go-getter attitude</li>\n<li>Comfortable working in a fast-paced startup environment</li>\n<li>Good organizational and time-management skills</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Passion for startups, growth, and learning</li>\n</ul>",
        "tags": [
            "Not Specified",
            "LinkedIn",
            "Sales & Business Development",
            "CRM"
        ],
        "summary": "ZenturioTech seeks a driven Business Development Executive to generate leads, manage sales cycles, and expand markets using LinkedIn and CRM tools in a fast-paced startup environment."
    },
    {
        "job_title": "TELESALES EXECUTIVE",
        "company": "Trainonex Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27459",
        "location": "Technopark",
        "closing_date": "11 Feb 2026",
        "job_description": "<h2>TRAINONEX SOLUTIONS (P) Ltd</h2>\n<p><strong>Address:</strong> Ground Floor, Carnival Building, Technopark Campus, Karyavattom, Trivandrum, Kerala, 695581\n<strong>Website:</strong> <a href=\"http://www.trainonexsolutions.in\">www.trainonexsolutions.in</a></p>\n<h3>Walk-In Interview Details</h3>\n<p><strong>Role:</strong> TELESALES EXECUTIVE\n<strong>Date:</strong> 11 February 2026\n<strong>Time:</strong> 10:30 AM – 12:30 PM\n<strong>Job Published:</strong> 7 February 2026\n<strong>Contact Email:</strong> trainonexsolutions.hr@gmail.com</p>\n<h3>About the Role</h3>\n<p>We are seeking an energetic and confident <strong>Telesales Executive</strong> to join our growing team. This role is ideal for individuals passionate about sales and customer interaction. As a Telesales Executive, you will:\n- Make outbound calls to potential and existing customers\n- Promote products/services in a clear, friendly, and professional manner\n- Explain product features, pricing, and benefits effectively\n- Handle customer queries and provide accurate information\n- Follow up on leads and maintain customer records\n- Build and maintain strong customer relationships</p>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Experience:</strong> 0–1 year (Freshers welcome)</li>\n<li>Immediate joiners preferred</li>\n<li>Open to male and female candidates</li>\n<li><strong>Fluency in Malayalam required</strong></li>\n<li>Willingness to work from the office</li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li><strong>Basic Pay:</strong> ₹14,000 – ₹20,000/-</li>\n<li>Performance-based incentives</li>\n</ul>\n<h3>Application Instructions</h3>\n<ul>\n<li><strong>Subject Line:</strong> “Telesales Executive”</li>\n<li><strong>Venue:</strong> TECHNOPARK PHASE 1, CARNIVAL BUILDING, GROUND FLOOR, KAZHAKUTTAM, TRIVANDRUM, 695581</li>\n</ul>\n<h3>Walk-In Entry Pass</h3>\n<ol>\n<li>Apply for the entry pass via the <a href=\"https://vms.technopark.org\">Technopark VMS website</a> or mobile app (Android <a href=\"#\">here</a>, iOS <a href=\"#\">here</a>).</li>\n<li>The entry pass will be sent to your registered mobile/email. Show the softcopy at the Technopark Entrance Gate.</li>\n<li><strong>Alternative for non-smartphone users:</strong> Print a hardcopy using the 5-digit OTP (received via SMS/email) at the self-operating kiosks near the Reception Building.</li>\n<li><strong>Note:</strong> Original certificates will be verified at the entry gate.</li>\n</ol>\n<p><a href=\"#\">User Manual for VMS</a></p>",
        "tags": [
            "0-1 Years",
            "Malayalam Language",
            "Telesales",
            "Customer Relationship Management"
        ],
        "summary": "Seeking a Telesales Executive with 0-1 years of experience to drive sales through outbound calls and customer engagement. Responsibilities include promoting products, handling queries, and building relationships."
    },
    {
        "job_title": "Technical Support Executive (Male Candidates Only)",
        "company": "Breeze Brain Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27458",
        "location": "Technopark",
        "closing_date": "10 Feb 2026",
        "job_description": "<h2>Breeze Brain Technologies (P) Ltd</h2>\n<p><strong>Address:</strong> Module 20, SBC, 2nd Floor, Thejaswini Building, Technopark, Trivandrum, 695581\n<strong>Website:</strong> <a href=\"https://www.breezebrain.com\">https://www.breezebrain.com</a>\n<strong>Closing Date:</strong> 10 Feb 2026\n<strong>Job Published:</strong> 7 Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@breezebrain.com\">careers@breezebrain.com</a></p>\n<h3>Technical Support Executive (Male Candidates Only)</h3>\n<p><strong>Brief Description</strong>\nBreeze Brain Technologies Pvt Ltd is seeking a dynamic and enthusiastic Technical Support Executive to join our growing team. You will serve as the primary point of contact for customers facing technical and software-related issues, delivering prompt and effective support. This role requires strong communication skills, a problem-solving mindset, and a willingness to travel for field assignments.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li><strong>Customer Interaction:</strong> Communicate with customers to understand and diagnose technical/software issues.</li>\n<li><strong>Issue Resolution:</strong> Provide timely solutions and ensure customer satisfaction.</li>\n<li><strong>Collaboration:</strong> Work with internal teams to resolve complex or escalated issues.</li>\n<li><strong>Documentation:</strong> Accurately document all customer interactions, issues, and resolutions for future reference and quality assurance.</li>\n<li><strong>Field Support:</strong> Conduct onsite visits to provide hands-on technical assistance when needed.</li>\n</ul>\n<h3>Preferred Skills:</h3>\n<ul>\n<li>2-4 years of experience in technical support or a similar customer-facing technical role.</li>\n<li>Excellent verbal and written communication in Tamil, Malayalam, and English.</li>\n<li>A graduate degree, preferably in Computer Science, Information Technology, or related disciplines.</li>\n<li>Young, energetic, and enthusiastic male candidates preferred.</li>\n<li>Willingness and ability to travel for onsite technical support.</li>\n<li>A valid driving license is required.</li>\n</ul>\n<h3>Application Instructions:</h3>\n<p>Interested candidates who meet the above criteria should email their resume to <a href=\"mailto:careers@breezebrain.com\">careers@breezebrain.com</a> with the subject line: <strong>“Job Application - Technical Support Executive”</strong></p>\n<p><strong>Note:</strong> Applications with a different subject line will not be considered.</p>",
        "tags": [
            "2-4 Years",
            "Computer Science",
            "Information Technology",
            "Driving License"
        ],
        "summary": "Technical Support Executive role requiring 2-4 years of experience, multilingual communication skills, and a valid driving license for field assignments."
    },
    {
        "job_title": "Channel Journalist Intern",
        "company": "Sree Anand Travel & Technologies (P) Ltd",
        "url": "https://technopark.org/job-details/27457",
        "location": "Technopark",
        "closing_date": "28 Feb 2026",
        "job_description": "<p><strong>SREE ANAND TRAVEL &amp; TECHNOLOGIES (P) Ltd</strong></p>\n<p><strong>Address:</strong> SBC-12, Basement Floor 2, Thejaswini Building, Techno Park Campus, Karyavattom (PO), Thiruvananthapuram, 695581\n<strong>Website:</strong> <a href=\"http://www.anandtravel.com\">www.anandtravel.com</a>\n<strong>Closing Date:</strong> 28 Feb 2026\n<strong>Published Date:</strong> 07 Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:anandtravel40@gmail.com\">anandtravel40@gmail.com</a></p>\n<h3><strong>Job Title</strong></h3>\n<p>Channel Journalist Intern</p>\n<h3><strong>Brief Description</strong></h3>\n<p>We are seeking a <strong>Channel Journalist Intern</strong> to join our newsroom team. The ideal candidate will possess strong journalistic instincts, excellent on-camera presence, and the ability to deliver news stories with clarity, credibility, and impact. This role combines <strong>reporting, anchoring, and editorial collaboration</strong> to ensure our channel delivers trusted and engaging content.</p>\n<h3><strong>Key Responsibilities</strong></h3>\n<ul>\n<li>Present live and recorded news bulletins with professionalism and authority.</li>\n<li>Conduct interviews with guests, experts, and public figures.</li>\n<li>Collaborate with producers and reporters to shape editorial direction.</li>\n<li>Research, write, and edit scripts for news segments.</li>\n<li>Uphold journalistic integrity and adhere to ethical reporting standards.</li>\n</ul>\n<h3><strong>Preferred Qualifications</strong></h3>\n<ul>\n<li>Strong verbal communication and public speaking skills.</li>\n<li>Ability to remain composed under pressure and during live broadcasts.</li>\n<li>Deep knowledge of current affairs, politics, business, and social issues.</li>\n<li>Bachelor’s degree in Journalism, Mass Communication, or related field preferred.</li>\n<li>Fluency in English; regional language skills are an advantage.</li>\n</ul>\n<h3><strong>What We Offer</strong></h3>\n<ul>\n<li>Competitive salary and benefits package.</li>\n<li>Opportunity to work with a leading media channel.</li>\n<li>Professional growth and training in broadcast journalism.</li>\n<li>A dynamic and collaborative newsroom environment.</li>\n</ul>\n<h3><strong>How to Apply</strong></h3>\n<p>To apply, please send your resume and a brief cover letter outlining your interest and relevant experience to <a href=\"mailto:anandtravel40@gmail.com\">anandtravel40@gmail.com</a>.</p>",
        "tags": [
            "0-1 Years",
            "Broadcast Journalism",
            "On-Camera Presentation",
            "News Writing"
        ],
        "summary": "Seeking a Channel Journalist Intern to present news, conduct interviews, and collaborate on editorial content. Offers training and a dynamic media environment."
    },
    {
        "job_title": "Business Presentation Specialist",
        "company": "Sentorus Business Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27456",
        "location": "Technopark",
        "closing_date": "21 Feb 2026",
        "job_description": "<p><strong>Company:</strong> Sentorus Business Solutions (P) Ltd\n<strong>Location:</strong> AMSTOR HOUSE, FIRST FLOOR, TECHNOPARK CAMPUS PHASE 1, 695581\n<strong>Website:</strong> <a href=\"https://www.sentorus.io\">https://www.sentorus.io</a>\n<strong>Job Title:</strong> Business Presentation Specialist\n<strong>Closing Date:</strong> 21, Feb 2026\n<strong>Job Published:</strong> 07, Feb 2026\n<strong>Contact Email:</strong> <a href=\"mailto:careers@sentorus.io\">careers@sentorus.io</a></p>\n<h3>Role Overview</h3>\n<p>We are seeking a skilled Business Presentation Specialist with <strong>1–5 years of experience</strong> in creating high-quality corporate presentations and business documents. The role demands a strong design eye, structured thinking, and the ability to translate business content into clear, visually compelling narratives.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Design and develop professional, high-impact business presentations and pitch decks</li>\n<li>Create and format corporate documents (proposals, reports, brochures, executive summaries)</li>\n<li>Ensure consistency in branding, layout, formatting, and visual quality across all deliverables</li>\n<li>Convert complex data and content into clear, visually engaging presentations</li>\n<li>Collaborate with internal teams and stakeholders to understand requirements and timelines</li>\n<li>Review, enhance, and standardize existing presentations for clarity and effectiveness</li>\n<li>Manage multiple assignments while meeting quality standards and deadlines</li>\n</ul>\n<h3>Required Skills &amp; Qualifications</h3>\n<ul>\n<li><strong>1–5 years</strong> of experience in business presentation design or document production</li>\n<li>Strong proficiency in <strong>Microsoft PowerPoint</strong> and related document tools</li>\n<li>Excellent understanding of <strong>layout, typography, and visual hierarchy</strong></li>\n<li>Strong <strong>communication and content-structuring</strong> skills</li>\n<li>High attention to detail with a quality-focused approach</li>\n<li>Ability to work independently and within cross-functional teams</li>\n<li>Willingness to work in consecutive night shifts and flexible schedules, as required</li>\n</ul>\n<h3>Compensation &amp; Benefits</h3>\n<ul>\n<li>Salary: As per industry standards, based on experience</li>\n<li>Exposure to diverse, business-critical projects</li>\n<li>Opportunity to grow in a structured, professional work environment</li>\n</ul>\n<h3>Why Join Sentorus?</h3>\n<ul>\n<li>Be part of a collaborative and growth-oriented organization</li>\n<li>Work on high-visibility corporate and client-facing presentations</li>\n</ul>\n<p><strong>Application Instructions:</strong> Interested candidates may forward their detailed resumes to <a href=\"mailto:careers@sentorus.io\">careers@sentorus.io</a> along with their notice period, current, and expected CTC details.</p>",
        "tags": [
            "1–5 Years",
            "Microsoft PowerPoint",
            "Layout & Typography",
            "Communication & Content Structuring"
        ],
        "summary": "Business Presentation Specialist creates professional presentations and documents. Requires 1–5 years of experience in design and strong PowerPoint skills."
    },
    {
        "job_title": "PHP Intern (AI-Augmented Development)",
        "company": "Timesworld Media And Technology Solutions (P) Ltd",
        "url": "https://technopark.org/job-details/27455",
        "location": "Technopark",
        "closing_date": "07 Mar 2026",
        "job_description": "<h2>About the Role</h2>\n<p>Timesworld Media and Technology Solutions (P) Ltd is seeking a <strong>PHP Intern (AI-Augmented Development)</strong> to bridge traditional backend development with modern AI workflows. This role is ideal for a forward-thinking recent graduate passionate about PHP and AI integration.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li><strong>Core Development &amp; Learning</strong></li>\n<li>Write clean PHP scripts and assist in server-side logic under senior mentorship.</li>\n<li>Create LLM-friendly technical documentation for clarity and AI-assisted context.</li>\n<li>Troubleshoot bugs and perform unit tests to ensure application reliability.</li>\n<li>\n<p>Participate in all development lifecycle phases, from brainstorming to deployment.</p>\n</li>\n<li>\n<p><strong>AI &amp; Prompt Engineering Integration</strong></p>\n</li>\n<li>Use AI tools (e.g., Claude, GitHub Copilot) to generate boilerplate code, refactor functions, and explain logic.</li>\n<li>Optimize prompts to align AI-generated code with security and style standards.</li>\n<li>\n<p>Identify tasks for automation via AI or scripts to boost productivity.</p>\n</li>\n<li>\n<p><strong>Innovation &amp; Knowledge Sharing</strong></p>\n</li>\n<li>Track emerging PHP features and AI/LLM trends.</li>\n<li>Collaborate in code reviews and share prompting strategies to foster an AI-first culture.</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li><strong>Education</strong>: Recently completed a Bachelor’s degree in Computer Science, IT, or related fields.</li>\n<li><strong>Technical Skills</strong>:</li>\n<li>Foundational PHP knowledge (syntax, variables, loops, MySQL).</li>\n<li>Basic HTML/CSS/JavaScript proficiency.</li>\n<li>High proficiency in AI chat interfaces and curiosity about Prompt Engineering.</li>\n<li>Exposure to Laravel, Git, and REST APIs (preferred).</li>\n<li><strong>Soft Skills</strong>:</li>\n<li>Critical thinking to debug AI-generated code.</li>\n<li>Strong communication for collaboration.</li>\n<li>Adaptability to evolving AI tools.</li>\n</ul>\n<h3>How to Apply</h3>\n<p>Submit applications via the link: <a href=\"https://www.timesworld.com/careers/phpintern-ai-aug-dev\">https://www.timesworld.com/careers/phpintern-ai-aug-dev</a></p>\n<p><strong>Contact</strong>: hr.tvm@timesworld.com</p>",
        "tags": [
            "0-1 Years",
            "PHP",
            "AI/LLM Tools",
            "Prompt Engineering"
        ],
        "summary": "PHP Intern to integrate AI tools into backend development, focusing on prompt engineering and automation. Requires foundational PHP and AI tool proficiency for scalable application development."
    }
]