[
    {
        "job_title": "BUSINEES DEVELOPMENT EXECUTIVE ( Immediate Hiring )",
        "company": "Ynot Infosolutions",
        "url": "https://infopark.in/company-jobs/details/21280/262",
        "location": "Infopark",
        "closing_date": "10 Dec 2025",
        "job_description": "<h2>Business Development Executive (Immediate Hiring)</h2>\n<p>We are seeking a motivated Business Development Executive with experience in the IT sector. This role is crucial for managing client interactions, identifying and generating new business opportunities, and assisting customers in understanding our product and service functionalities.</p>\n<p><strong>Job Responsibilities:</strong></p>\n<p><strong>Business Development &amp; Sales</strong>\n- Identify, research, and generate new business leads through calls, emails, online platforms, and networking.\n- Conduct introductory calls with clients to understand their requirements and present suitable IT services.\n- Explain product features, website workflows, and application functionalities clearly.\n- Cold call potential customers and follow up with existing clients to promote services.\n- Convert leads into opportunities and achieve business targets.\n- Maintain long-term relationships with clients through regular communication and professional interaction.</p>\n<p><strong>Client Handling &amp; Follow-Up</strong>\n- Communicate regularly with existing clients to ensure satisfaction and service continuity.\n- Follow up on monthly/yearly package renewals and payment reminders.\n- Explain newly released features and updates to clients.\n- Address customer queries and provide basic functional support when required.\n- Maintain accurate records of calls, leads, conversations, and client updates.</p>\n<p><strong>Technical / Functional Guidance</strong>\n- Guide customers on how websites, web applications, and e-commerce platforms function.\n- Explain step-by-step processes to non-technical users in simple language.\n- Provide product walkthroughs and assist with basic configurations or app updates if needed.\n- Ensure a smooth and positive customer experience throughout support interactions.</p>\n<p><strong>Job Requirements:</strong></p>\n<p><strong>Strong Understanding Of:</strong>\n- IT services &amp; software solutions\n- Website and web application workflow\n- E-commerce fundamentals (catalog, checkout flow, payment gateways, order tracking, etc.)</p>\n<p><strong>Skills:</strong>\n- Excellent communication skills (verbal &amp; written) and customer-handling ability.\n- Strong negotiation, problem-solving, and interpersonal skills.\n- Ability to explain technical concepts in simple terms to non-technical users.\n- Ability to manage multiple leads, calls, and follow-ups professionally.</p>\n<p><strong>Technical Skills (Advantageous but not mandatory):</strong>\n- Basic knowledge of HTML, CSS, JavaScript, PHP, Laravel, or mobile app concepts.\n- Familiarity with hosting, domains, deployments, or basic configuration tasks is an advantage.</p>\n<p><strong>Required Qualifications:</strong>\n- Bachelor’s degree in Computer Science or a related field (mandatory).\n- <strong>Experience:</strong> 6 months to 1 year of experience in business development, client handling, and IT sales.</p>\n<p><strong>How to Apply:</strong>\nInterested candidates are invited to submit their resumes, portfolios, and cover letters with the subject line: “Business Development Executive”.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@ynotinfo.com.</p>",
        "tags": [
            "6 months - 1 year Experience",
            "Business Development",
            "Client Handling",
            "IT Sales"
        ],
        "summary": "Seeking a Business Development Executive for IT client interactions and new opportunities. Responsibilities include lead generation, explaining IT services, and client follow-up."
    },
    {
        "job_title": "Business Development Executive",
        "company": "ALTOS Technologies",
        "url": "https://infopark.in/company-jobs/details/21276/368",
        "location": "Infopark",
        "closing_date": "11 Dec 2025",
        "job_description": "<h2>Business Development Executive</h2>\n<p>We are seeking a highly motivated and skilled Business Development Executive to join our fast-growing team. The ideal candidate will be responsible for lead generation, driving revenue, and bringing new opportunities for our business growth.</p>\n<h3>Required Skills and Qualifications:</h3>\n<ul>\n<li>Bachelor's degree in Business Administration, Marketing, Sales, or a related field.</li>\n<li>Effective communication, interpersonal, and negotiating skills.</li>\n</ul>\n<h3>Experience:</h3>\n<ul>\n<li>0 to 6 months</li>\n</ul>\n<h3>Salary:</h3>\n<ul>\n<li>As per industry standards</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at aiswarya.a@altostechnologies.in.</p>",
        "tags": [
            "0-6 Months Experience",
            "Lead Generation",
            "Revenue Growth",
            "Sales"
        ],
        "summary": "Seeking a motivated Business Development Executive for lead generation and revenue growth. Requires a relevant bachelor's degree and strong communication skills."
    },
    {
        "job_title": "Cloud Arcitect - 10+ Years",
        "company": "Thinkpalm Technologies Pvt.Ltd",
        "url": "https://infopark.in/company-jobs/details/21296/49",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Cloud Architect - 10+ Years</h2>\n<p><strong>About the Role:</strong>\nWe are seeking a highly skilled Cloud Architect with deep expertise in the Microsoft Azure ecosystem, strong hands-on experience in DevOps architecture, and extensive knowledge in building scalable microservices and event-driven systems. This role is pivotal in defining cloud strategy, establishing best practices, and partnering with cross-functional teams to deliver secure, scalable, and robust cloud-native solutions.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<h3>Cloud Architecture &amp; Design</h3>\n<ul>\n<li>Architect, design, and implement end-to-end Azure cloud solutions.</li>\n<li>Build scalable, secure, high-availability architectures.</li>\n</ul>\n<h3>DevOps Architecture</h3>\n<ul>\n<li>Architect and maintain CI/CD pipelines using Azure DevOps or GitHub Actions.</li>\n<li>Drive automation for infrastructure provisioning, configuration, deployment, and testing.</li>\n<li>Implement Infrastructure as Code (IaC) via Terraform, Bicep, or ARM templates.</li>\n<li>Strengthen observability using Azure Monitor, App Insights, Log Analytics, and distributed tracing.</li>\n</ul>\n<h3>Microservices &amp; Event-Driven Architecture</h3>\n<ul>\n<li>Design domain-driven, cloud-native microservices.</li>\n<li>Architect event-driven integrations using Service Bus, Event Hub, Event Grid.</li>\n<li>Ensure system reliability, resilience, scalability, and fault tolerance.</li>\n</ul>\n<h3>Security, Governance &amp; Compliance</h3>\n<ul>\n<li>Apply Azure security best practices in identity, networking, secrets, and data protection.</li>\n<li>Define governance for cost, resource usage, and compliance.</li>\n<li>Ensure cloud solutions align with Zellis and industry security standards.</li>\n</ul>\n<h3>Collaboration &amp; Leadership</h3>\n<ul>\n<li>Work closely with development, data, security, and product teams to align architecture with business objectives.</li>\n<li>Provide best practices, architectural guidance, and technical direction across teams.</li>\n<li>Participate in solution reviews, estimations, feasibility studies, and technical design sessions.</li>\n<li>Mentor engineering teams, conduct architectural walkthroughs, and support production readiness.</li>\n<li>Collaborate effectively with UK-based stakeholders and cross-functional teams.</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications:</strong></p>\n<h3>Core Technical Skills</h3>\n<ul>\n<li>8–12+ years in cloud or software architecture roles.</li>\n<li>4–6+ years hands-on experience with Microsoft Azure.</li>\n<li>Strong expertise in Azure Networking Expertise (Mandatory).</li>\n</ul>\n<h3>DevOps Skills</h3>\n<ul>\n<li>Azure DevOps / GitHub Actions</li>\n<li>CI/CD pipeline architecture</li>\n<li>Infrastructure as Code (Terraform/Bicep/ARM)</li>\n</ul>\n<h3>Architecture &amp; Design Expertise</h3>\n<ul>\n<li>Domain-Driven Design (DDD)</li>\n<li>Messaging &amp; integration patterns</li>\n<li>Distributed systems</li>\n<li>Scalability, reliability, and performance engineering</li>\n</ul>\n<h3>Soft Skills</h3>\n<ul>\n<li>Excellent communication skills, with ability to collaborate with UK customers and stakeholders.</li>\n</ul>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at r.reshma@thinkpalm.com</p>",
        "tags": [
            "10+ Years",
            "Microsoft Azure",
            "DevOps",
            "Microservices"
        ],
        "summary": "Seeking an experienced Cloud Architect with Azure and DevOps expertise to design scalable microservices and cloud-native solutions. Responsibilities include architecture, CI/CD, and security best practices."
    },
    {
        "job_title": "Intern — React Front-End (with UI/UX Basics)",
        "company": "Grapelime Innovations Private Limited.",
        "url": "https://infopark.in/company-jobs/details/21307/296",
        "location": "Infopark",
        "closing_date": "12 Dec 2025",
        "job_description": "<h2>Intern — React Front-End (with UI/UX Basics)</h2>\n<p><strong>Location:</strong> Infopark, Kakkanad\n<strong>Mode:</strong> Full-time (Office)</p>\n<h3>About the Role:</h3>\n<p>We are looking for a React Front-End Intern with basic knowledge of web development and UI/UX. You will learn, support the team, and help build responsive web pages and simple features.</p>\n<h3>Skills Required:</h3>\n<ul>\n<li>Basic understanding of React.js</li>\n<li>Knowledge of HTML, CSS, and JavaScript</li>\n<li>Good understanding of UI/UX and tools like Figma/Adobe XD</li>\n<li>Willingness to learn and work in a team</li>\n<li>Basic understanding of Git (added advantage)</li>\n<li>Knowledge of REST APIs (added advantage)</li>\n</ul>\n<h3>Who Can Apply:</h3>\n<ul>\n<li>Freshers — only 2025, 2024, and 2023 passouts</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@grapelime.in</p>",
        "tags": [
            "Fresher",
            "React.js",
            "UI/UX",
            "HTML/CSS/JavaScript"
        ],
        "summary": "Seeking a React Front-End Intern with UI/UX basics. Learn and support the team in building responsive web pages and features. Open to recent graduates."
    },
    {
        "job_title": "Marketing Intern",
        "company": "Art Technology and Software.",
        "url": "https://infopark.in/company-jobs/details/21272/4",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Marketing Intern</h2>\n<p><strong>Location:</strong> Kochi\n<strong>Job Type:</strong> Full-time / Internship\n<strong>Mode:</strong> Work from Office</p>\n<h3>Job Summary</h3>\n<p>We are looking for a proactive and enthusiastic Marketing Intern who is eager to learn and support our marketing initiatives. This role will involve assisting in campaign execution, content creation, coordinating with freelancers, and helping set up basic inbound lead infrastructure. The ideal candidate is someone who enjoys hands-on work, is willing to learn, and is comfortable supporting field marketing tasks such as trade shows, while collaborating with senior team members across sales, delivery, and management.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Write engaging content for blogs, social media, websites, and marketing collateral.</li>\n<li>Conduct research on industry topics to support content creation.</li>\n<li>Assist in planning and execution of trade shows, events, and promotional activities.</li>\n<li>Assist in creating landing pages, lead forms, and basic CRM entries as guided by the team.</li>\n<li>Assist in executing marketing plans and digital campaigns across channels.</li>\n<li>Support day-to-day marketing activities such as social media posts, email campaigns, and website updates.</li>\n<li>Help monitor campaign performance and gather data using basic analytics tools.</li>\n<li>Work with sales and delivery teams to support ongoing marketing needs.</li>\n<li>Help with proofreading and quality checks for marketing content.</li>\n</ul>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s degree in Engineering, Marketing, Business Administration</li>\n<li>Interest in digital marketing, social media, SEO and content creation.</li>\n<li>Would have been exploring AI-based tools to use for Marketing activities like curating content, building landing page designs and content creation.</li>\n<li>Good writing skills and ability to create simple, clear communication.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at lavanya.a@arttechgroup.com</p>",
        "tags": [
            "0-1 Years",
            "Digital Marketing",
            "Content Creation",
            "Social Media"
        ],
        "summary": "Marketing Intern to support marketing initiatives by assisting in campaign execution and content creation. Ideal for a proactive learner comfortable with hands-on tasks and collaboration."
    },
    {
        "job_title": "Marketing Strategy & Research Internship",
        "company": "KL Koncepts Lab Media and IT Park",
        "url": "https://infopark.in/company-jobs/details/21304/332",
        "location": "Infopark",
        "closing_date": "15 Dec 2025",
        "job_description": "<h2>Marketing Strategy &amp; Research Internship</h2>\n<p><strong>Duration:</strong> 3 Months\n<strong>Mode:</strong> Work from Home (Remote)\n<strong>Stipend:</strong> Unpaid (Certificate &amp; Experience Provided)</p>\n<h3>About the Role</h3>\n<p>We are offering a 3-month virtual internship in Marketing Strategy &amp; Research for enthusiastic students and fresh graduates. This is an excellent opportunity to gain hands-on experience in market research, strategy development, and data-driven marketing, while working directly with experienced professionals.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Conduct secondary market research on industries, competitors, and customer segments.</li>\n<li>Assist in developing marketing strategy frameworks for different services.</li>\n<li>Work on customer persona creation, segmentation, and positioning exercises.</li>\n<li>Support in preparing case studies, proposals, and pitch decks.</li>\n<li>Track and analyze campaign results to prepare insightful reports.</li>\n<li>Participate in brainstorming sessions with the strategy and creative team.</li>\n</ul>\n<h3>Learning Outcomes</h3>\n<ul>\n<li>Exposure to real-world marketing strategy development.</li>\n<li>Practical experience in market research and competitor analysis.</li>\n<li>Skills in strategy formulation, reporting, and presentations.</li>\n<li>Direct mentorship and feedback from the leadership team.</li>\n<li>Certificate of Completion &amp; LinkedIn Endorsements (on successful completion).</li>\n</ul>\n<h3>Requirements</h3>\n<ul>\n<li>Currently pursuing or recently completed Bachelor’s/Master’s in Business, Marketing, or related field.</li>\n<li>Strong interest in marketing strategy, branding, and research.</li>\n<li>Good analytical skills with proficiency in MS Excel/Google Sheets &amp; PowerPoint/Google Slides.</li>\n<li>Self-motivated, detail-oriented, and disciplined to work in a remote environment.</li>\n</ul>\n<h3>Duration &amp; Commitment</h3>\n<ul>\n<li>3 Months (Work From Home)</li>\n<li>Flexible working hours (minimum weekly commitment expected: 15–20 hours).</li>\n</ul>\n<h3>Perks</h3>\n<ul>\n<li>Internship Certificate</li>\n<li>Work-from-home flexibility</li>\n<li>Exposure to live projects &amp; strategic assignments</li>\n<li>Opportunity to publish co-authored blogs/case studies with the team</li>\n<li>Recommendation/LinkedIn endorsement (based on performance)</li>\n</ul>\n<h3>Apply Now</h3>\n<p>Send your application with the subject line: “Marketing Strategy &amp; Research Internship” to hr@konceptslab.com</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at hr@konceptslab.com</p>",
        "tags": [
            "0-1 Years",
            "Market Research",
            "Marketing Strategy",
            "Data Analysis"
        ],
        "summary": "Gain hands-on marketing strategy and research experience in a 3-month remote internship. Develop skills in market analysis, strategy formulation, and reporting with mentorship."
    },
    {
        "job_title": "Frontend Developer (Angular)",
        "company": "Softspace Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21310/361",
        "location": "Infopark",
        "closing_date": "24 Dec 2025",
        "job_description": "<h1>Frontend Developer (Angular)</h1>\n<p><strong>Job Title:</strong> Frontend Developer (Angular)</p>\n<p><strong>Experience:</strong> 3+ Years (Angular 15+)</p>\n<p><strong>Location:</strong> Cochin</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<p><strong>Key Skills:</strong> Angular (15+), TypeScript, RxJS, Angular Material / PrimeNG, Deployment Experience</p>\n<h2>Role Summary:</h2>\n<p>We’re looking for an experienced Frontend Developer with strong expertise in Angular 15+ to build and enhance responsive, high-performance web applications.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@softspace.ae</p>",
        "tags": [
            "3+ Years",
            "Angular",
            "TypeScript",
            "RxJS"
        ],
        "summary": "Seeking an experienced Frontend Developer skilled in Angular 15+ to build high-performance web applications. Responsibilities include enhancing and developing responsive web solutions."
    },
    {
        "job_title": ".Net Core Developer",
        "company": "Softspace Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21311/361",
        "location": "Infopark",
        "closing_date": "24 Dec 2025",
        "job_description": "<h2>.NET Core Developer</h2>\n<p><strong>Job Title:</strong> .NET Core Developer</p>\n<p><strong>Experience:</strong> 4+ Years</p>\n<p><strong>Location:</strong> Cochin</p>\n<p><strong>Employment Type:</strong> Full-time</p>\n<h3>Position Overview</h3>\n<p>We are seeking an experienced .NET Core Developer with a strong background in building scalable, secure, and high-performance web applications. The ideal candidate will have solid expertise in C#, .NET Core 8, ASP.NET Core Web API, SQL Server, and Entity Framework Core. Experience with Angular is an added advantage.</p>\n<h3>Key Requirements</h3>\n<ul>\n<li>Full-time role with 3–4+ years of hands-on experience in .NET Core development</li>\n<li>Strong proficiency in C#, .NET Core 8, and ASP.NET Core Web API</li>\n<li>Practical experience with SQL Server and Entity Framework Core</li>\n<li>Strong understanding of RESTful API design and best practices</li>\n<li>Ability to write clean, maintainable, and scalable code</li>\n<li>Angular experience is an added advantage</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at career@softspace.ae</p>",
        "tags": [
            "4+ Years",
            ".NET Core",
            "ASP.NET Core Web API",
            "SQL Server"
        ],
        "summary": "Seeking an experienced .NET Core Developer with 4+ years of experience in building scalable web applications. Must be proficient in C#, .NET Core 8, ASP.NET Core Web API, SQL Server, and Entity Framework Core."
    },
    {
        "job_title": "AI DEVELOPER/ MACHINE LEARNING ENGINEER",
        "company": "SparkSupport Infotech Pvt Ltd",
        "url": "https://infopark.in/company-jobs/details/21279/63",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>AI Developer / Machine Learning Engineer</h2>\n<p><strong>Location:</strong> Carnival Infopark, Cochin, Kerala\n<strong>Experience:</strong> 3 to 5 Years\n<strong>Employment Type:</strong> Full-Time, Permanent\n<strong>Work Mode:</strong> Hybrid</p>\n<h3>Role Description:</h3>\n<p>We are looking for an experienced AI Developer who will design, build, and implement intelligent automation solutions using cutting-edge AI technologies. Working closely with business stakeholders, you'll identify opportunities for innovation, prototype new ideas, and deliver scalable AI-driven systems that make a measurable impact.</p>\n<h3>What will you be doing?</h3>\n<ul>\n<li>Collaborating with business teams to uncover and define AI/automation opportunities.</li>\n<li>Engineering and optimising prompts to ensure consistent, high-quality LLM outputs.</li>\n<li>Building and deploying AI-powered workflows that connect LLMs with business applications, APIs, and automation tools.</li>\n<li>Implementing RAG (Retrieval-Augmented Generation) pipelines to integrate enterprise data.</li>\n<li>Rapidly prototyping and iterating on AI solutions to demonstrate business value.</li>\n<li>Advising on responsible AI practices, governance, and compliance.</li>\n<li>Staying ahead of the curve with emerging AI tools, frameworks, and trends.</li>\n</ul>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Build, develop and deploy AI applications</li>\n<li>Design and Develop AI services</li>\n<li>Setup and develop data ingestion pipelines and components</li>\n<li>Develop search related components using Azure AI Search</li>\n<li>Developing and deploying AI/ML models</li>\n<li>Built and maintain scalable, high-performance AI apps on Azure</li>\n<li>Create and maintain secure AI platform</li>\n<li>Collaborate cross-functionally to understand requirements</li>\n</ul>\n<h3>Preferred Skills &amp; Qualifications:</h3>\n<ul>\n<li>Hands-on experience with LLMs (e.g. GPT, Claude, LLaMA, Azure Cognitive Services, Azure Functions, and Logic Apps.) and prompt engineering.</li>\n<li>Familiarity with LangChain, LlamaIndex, or similar frameworks.</li>\n<li>Experience using automation platforms (UiPath, Power Automate, Zapier, n8n) and APIs.</li>\n<li>Knowledge of vector databases and embeddings for RAG pipelines.</li>\n<li>Excellent communication skills and the ability to translate business needs into technical solutions.</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at careers@sparksupport.com</p>",
        "tags": [
            "3-5 Years",
            "AI",
            "LLM",
            "Azure"
        ],
        "summary": "Seeking an AI Developer with 3-5 years of experience to design and implement intelligent automation solutions. Responsibilities include prompt engineering, RAG pipelines, and deploying AI models on Azure."
    },
    {
        "job_title": "Service Desk Engineer – Level 1",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21281/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Service Desk Engineer – Level 1</h2>\n<p><strong>Job Designation:</strong> Service Desk Engineer – L1\n<strong>Employment Type:</strong> Full-time | Onsite | 24×7 rotational shifts</p>\n<p><strong>Experience:</strong> 1–3 years in IT Helpdesk/Service Desk</p>\n<p><strong>About the Role:</strong>\nThe Service Desk Engineer will act as the first point of contact for all IT users, providing remote and desk-side support for incidents and service requests. The role ensures timely logging, categorization, initial troubleshooting, FCR resolution, and escalation to L2/L3 teams while maintaining SLA compliance and high customer satisfaction.</p>\n<p><strong>Key Responsibilities (Detailed):</strong>\n- Receive and handle all user issues through calls, emails, chat, and ticketing tools.\n- Log, categorize, and prioritize incidents and service requests.\n- Perform basic troubleshooting for OS, applications, network, and hardware.\n- Provide First-Call-Resolution (FCR) for L1 scope issues.\n- Escalate unresolved tickets to L2/L3 teams with complete diagnostics.\n- Track and follow up on assigned tickets until closure.\n- Monitor SLA response and resolution timelines and flag deviations.\n- Prepare daily/weekly/monthly helpdesk performance reports.\n- Maintain and update knowledge base articles, SOPs, and troubleshooting guides.\n- Conduct periodic user feedback and support CSAT target ≥99%.</p>\n<p><strong>Required Skills &amp; Experience:</strong>\n- Strong communication and customer handling skills.\n- Exposure to ITSM ticketing tools (ManageEngine, ServiceNow, etc.).\n- Basic knowledge: Windows OS, MS Office, printers, and network basics.\n- Ability to troubleshoot common issues (password, Outlook, VPN, etc.).\n- Understanding of incident, request, escalation, &amp; SLA processes.\n- Ability to work in rotational shifts, including night shifts.</p>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com.</p>",
        "tags": [
            "1-3 Years",
            "ITSM",
            "Troubleshooting",
            "Customer Service"
        ],
        "summary": "Service Desk Engineer (L1) provides first-level IT support for users, resolving incidents and requests. Requires 1-3 years of experience and strong troubleshooting skills."
    },
    {
        "job_title": "Datacenter Operations Engineer – 24×7",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21282/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Datacenter Operations Engineer – 24×7</h2>\n<p><strong>Employment Type:</strong> Full-time | Onsite DC | Shift-based\n<strong>Experience:</strong> 2–4 years in DC monitoring &amp; operations</p>\n<p><strong>About the Role:</strong>\nResponsible for monitoring and managing all IT infrastructure components within the datacenter including servers, storage, network devices, firewalls, SSL certificates, and critical applications. Ensures that alerts are captured, validated, logged, and escalated as per SOPs.</p>\n<p><strong>Key Responsibilities (Detailed):</strong>\n*   Monitor server CPU, memory, partitions, and availability.\n*   Monitor OS-level and application services (DB, middleware, AD, etc.).\n*   Monitor SAN/NAS &amp; storage health parameters.\n*   Monitor network devices (routers, switches, firewalls) for availability.\n*   Track link status, bandwidth usage, packet drops, and interface issues.\n*   Monitor SSL certificate expiries and coordinate renewals.\n*   Identify critical alerts, validate, and raise tickets.\n*   Coordinate with L2/L3 towers for patching and maintenance activities.\n*   Ensure correct escalation for Sev1/Sev2 alerts.\n*   Maintain daily DC health reports and monthly MIS.</p>\n<p><strong>Required Skills &amp; Experience:</strong>\n*   Good understanding of server OS (Windows/Linux).\n*   Knowledge of network fundamentals (routing, switching, firewalls).\n*   Familiarity with SAN/NAS storage.\n*   Experience with monitoring tools (SolarWinds, Nagios, OpManager).\n*   Strong analytical and alert-handling capability.\n*   Ability to work in 24×7 DC environment.</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com</p>",
        "tags": [
            "2-4 Years",
            "Datacenter Operations",
            "Monitoring Tools",
            "Network Fundamentals"
        ],
        "summary": "Datacenter Operations Engineer needed for 24x7 monitoring and management of IT infrastructure. Requires 2-4 years of experience in DC operations and monitoring tools."
    },
    {
        "job_title": "BigFix Engineer (L2)",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21284/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>BigFix Engineer (L2)</h2>\n<p><strong>Job Designation:</strong> BigFix Engineer – Endpoint Tools Management (L2)</p>\n<p><strong>Employment Type:</strong> Full-time | Onsite</p>\n<p><strong>Experience:</strong> 3–5 years in Endpoint/Patch Management Tools.</p>\n<h3>About the Role:</h3>\n<p>The BigFix Engineer will administer and maintain the IBM BigFix infrastructure used for enterprise-wide endpoint management and security compliance. This includes managing BigFix servers, relays, and clients; ensuring patch baselines are up to date; troubleshooting agent health; and ensuring all endpoints meet compliance standards.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage, maintain, and optimize the IBM BigFix Server, Relay Servers, and Client infrastructure.</li>\n<li>Configure and update patch baselines, fixlets, tasks, and site subscriptions.</li>\n<li>Monitor BigFix agent deployment, status, health, and version compliance.</li>\n<li>Troubleshoot client issues related to agent communication, relay selection, and patch failures.</li>\n<li>Manage BigFix WebUI, operator roles, permissions, and RBAC configurations.</li>\n<li>Review dashboards for patch compliance and take corrective actions.</li>\n<li>Coordinate patch deployment cycles with Windows/Linux/Infrastructure teams.</li>\n<li>Generate reports on patching, compliance, software inventory, and vulnerabilities.</li>\n<li>Perform upgrades, apply patches, and maintain platform stability.</li>\n<li>Support software deployment and compliance policies using BigFix.</li>\n<li>Document SOPs, patching procedures, and troubleshooting guidelines.</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Strong hands-on experience with IBM BigFix architecture (Server, Relay, Client).</li>\n<li>Experience with patch management across Windows &amp; Linux endpoints.</li>\n<li>Knowledge of BigFix Fixlets, Tasks, Baselines, Action Scripts, and Custom Content.</li>\n<li>Understanding of endpoint compliance, vulnerability remediation, and OS hardening.</li>\n<li>Familiarity with RBAC, AD integration, and role-based permissions.</li>\n<li>Experience coordinating patch cycles in enterprise environments.</li>\n<li>Strong troubleshooting and reporting skills.</li>\n<li>Knowledge of PowerShell, Shell scripting (preferred).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com</p>",
        "tags": [
            "3-5 Years",
            "IBM BigFix",
            "Patch Management",
            "Endpoint Security"
        ],
        "summary": "Manage and maintain IBM BigFix infrastructure for endpoint management and security. Responsibilities include server administration, patch deployment, and troubleshooting across Windows/Linux endpoints."
    },
    {
        "job_title": "ManageEngine Engineer (L2)",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21285/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>ManageEngine Engineer (L2)</h2>\n<p><strong>Job Designation:</strong> ManageEngine Engineer – Endpoint Tools Management (L2)\n<strong>Employment Type:</strong> Full-time | Onsite\n<strong>Experience:</strong> 3–5 years in ManageEngine tool administration.</p>\n<h3>About the Role:</h3>\n<p>The ManageEngine Engineer will administer and support multiple ManageEngine modules such as Endpoint Central, ServiceDesk Plus, Asset Explorer, AD Audit, and Patch Manager. The role focuses on endpoint onboarding, agent deployment, patching, automation, tool upgrades, and software deployment for enterprise systems.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Administer ManageEngine Endpoint Central (UEM) – Patch, Asset, Software Deployment, MDM modules</li>\n<li>Configure and manage agent rollout, auto-deployment, and health monitoring</li>\n<li>Manage user onboarding, roles, access permissions, AD authentication</li>\n<li>Oversee server performance, storage usage, backup schedules, and periodic maintenance</li>\n<li>Configure patch policies, patch approvals, deployment windows, and reboot policies.</li>\n<li>Implement software deployment packages and task automation.</li>\n<li>Manage ServiceDesk Plus functions: incident, change, request workflows.</li>\n<li>Maintain CMDB/asset inventory synchronization through ME tools.</li>\n<li>Perform upgrades, apply hotfixes, and ensure tool stability.</li>\n<li>Prepare compliance dashboards, patching reports, and SLA metrics.</li>\n<li>Troubleshoot agent issues, patch failures, MDM enrollment issues.</li>\n<li>Maintain documentation for configurations, SOPs, and process flows.</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Strong experience with ManageEngine Endpoint Central (formerly Desktop Central).</li>\n<li>Hands-on with ManageEngine ServiceDesk Plus, Asset Explorer, Patch Manager.</li>\n<li>Knowledge of Windows/Mac/Linux patch workflows.</li>\n<li>Understanding of endpoint security, device onboarding, MDM, &amp; automation tasks.</li>\n<li>Familiarity with AD integration, SSO, RBAC.</li>\n<li>Experience with software packaging &amp; deployment.</li>\n<li>Strong troubleshooting skills in agent connectivity and patch failures.</li>\n<li>Knowledge of PowerShell/Shell scripting (preferred).</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com</p>",
        "tags": [
            "3-5 Years",
            "ManageEngine Endpoint Central",
            "ServiceDesk Plus",
            "Patch Management"
        ],
        "summary": "ManageEngine Engineer (L2) needed for full-time, onsite role with 3-5 years of experience. Responsibilities include administering ManageEngine modules and supporting endpoint management tasks."
    },
    {
        "job_title": "IPC Manager – L2 (Incident, Problem, Change).",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21286/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>IPC Manager – L2 (Incident, Problem, Change)</h2>\n<p><strong>Job Designation:</strong> IPC Manager – Incident, Problem &amp; Change Management</p>\n<p><strong>Employment Type:</strong> Full-time | Onsite</p>\n<p><strong>Experience:</strong> 4–7 years (Major Incident experience mandatory)</p>\n<p><strong>About the Role:</strong>\nThis role ensures seamless handling of Major Incidents, Problem RCA, and Change governance. The IPC Manager coordinates across multiple technical teams, ensures communication flows, drives MTTR reduction, and ensures compliance with ITIL processes.</p>\n<p><strong>Key Responsibilities:</strong>\n- Take full ownership of Major Incidents (Sev1 / Sev2)\n- Conduct triage &amp; establish technical and business bridge calls\n- Communicate updates to users, leadership, and stakeholders\n- Facilitate MIR with detailed timeline &amp; RCA documentation\n- Create &amp; track Problem tickets and ensure timely RCA closure\n- Conduct weekly CAB (Change Advisory Board) meetings\n- Validate CRs for impact, risk, dependencies\n- Drive MTTR improvement through KT, knowledge articles\n- Maintain IPC policy documentation and ensure periodic updates</p>\n<p><strong>Required Skills &amp; Experience:</strong>\n- Strong understanding of ITIL Incident/Problem/Change\n- Excellent command &amp; control skills on live bridges\n- Experience handling urgent banking/production outages\n- Strong communication &amp; stakeholder management</p>\n<p><strong>Contact:</strong>\nIf this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com</p>",
        "tags": [
            "4-7 Years",
            "ITIL",
            "Major Incident Management",
            "Change Management"
        ],
        "summary": "IPC Manager (L2) needed for Incident, Problem, and Change Management. Must have 4-7 years experience, with mandatory Major Incident handling skills."
    },
    {
        "job_title": "Asset Focal – IT Asset Management",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21287/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>IT Asset Management Specialist</h2>\n<p><strong>Employment Type:</strong> Full-time | Onsite</p>\n<p><strong>Experience:</strong> 3–4 years</p>\n<h3>About the Role:</h3>\n<p>Manage the end-to-end lifecycle of IT assets, including procurement, tagging, tracking, audits, software licenses, and vendor coordination.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Maintain complete asset inventory (Hardware, Software, licenses)</li>\n<li>Ensure lifecycle management from purchase to disposal</li>\n<li>Conduct periodic physical and logical audits</li>\n<li>Manage vendor relationships for Annual Maintenance Contracts (AMC), renewals, and replacements</li>\n<li>Track warranty, license expiry, and contract renewals</li>\n<li>Maintain asset management tools and CMDB accuracy</li>\n<li>Coordinate with procurement, finance, and IT teams</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Knowledge of IT Asset Management (ITAM) processes and tools</li>\n<li>Understanding of ITIL Configuration Management Database (CMDB) standards</li>\n<li>Strong documentation and audit skills</li>\n<li>Experience managing hardware and software inventories</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com.</p>",
        "tags": [
            "3-4 Years",
            "IT Asset Management",
            "CMDB",
            "ITAM"
        ],
        "summary": "Seeking an IT Asset Management Specialist with 3-4 years of experience to manage the full IT asset lifecycle. Responsibilities include inventory, audits, vendor coordination, and CMDB accuracy."
    },
    {
        "job_title": "Network Engineer – L2",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21288/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Network Engineer – L2</h2>\n<p><strong>Job Designation:</strong> Network Engineer – Level 2\n<strong>Employment Type:</strong> Full-time | Onsite | 24×7\n<strong>Experience:</strong> 4–6 years in DC Network Operations</p>\n<h3>About the Role:</h3>\n<p>You will manage and support enterprise-level network infrastructure, including routers, switches, firewalls, VPNs, MPLS, and SDWAN, for a large banking environment.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Configure, troubleshoot Cisco/Juniper routers &amp; switches</li>\n<li>Support large-scale backbone, access, and distribution switches</li>\n<li>Manage MPLS, BGP, OSPF, EIGRP, IPSec VPN, GETVPN</li>\n<li>Manage HA protocols (HSRP, VRRP)</li>\n<li>Handle SDWAN deployments and monitoring</li>\n<li>Troubleshoot CE links, VSAT, RF, 3G/4G backups</li>\n<li>Configure Firewalls (Cisco FP, Checkpoint, Fortinet)</li>\n<li>Manage NAT, ACLs, IPS/IDS configurations</li>\n<li>Perform firmware upgrades, patching, and compliance reporting.</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Certifications: CCNA/CCNP/JNCIA/JNCIP (preferred)</li>\n<li>Hands-on with Cisco ASR, ISR, Nexus, Juniper QFX</li>\n<li>Strong routing &amp; switching troubleshooting</li>\n<li>Firewall and security knowledge</li>\n<li>Experience in banking DC operations preferred</li>\n</ul>\n<p><strong>Contact:</strong> If this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com</p>",
        "tags": [
            "4-6 Years",
            "Cisco Nexus",
            "Juniper",
            "SDWAN"
        ],
        "summary": "Manage and support enterprise network infrastructure including routers, switches, and firewalls for a large banking environment. Requires 4-6 years of experience in DC network operations."
    },
    {
        "job_title": "Linux / AIX Administrator – L2",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21290/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>Linux / AIX Administrator – L2</h2>\n<p><strong>Job Designation:</strong> Linux / AIX System Administrator – L2\n<strong>Employment Type:</strong> Full-time | Onsite\n<strong>Experience:</strong> 3–5 years</p>\n<h3>About the Role:</h3>\n<p>Handle advanced Linux and AIX server administration including patching, clustering, security hardening, automation, and performance tuning.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Install &amp; configure Linux/AIX OS and applications</li>\n<li>Manage LVM, file systems, access rights</li>\n<li>Configure multipath, clustering, boot processes</li>\n<li>Monitor system performance, logs, alerts</li>\n<li>Automate jobs using Bash/Python scripts</li>\n<li>Perform patching, kernel upgrades, and OS hardening</li>\n<li>Support DC–DR sync, switchover activities</li>\n<li>Troubleshoot Nginx, Tomcat, JBoss servers</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Strong Linux/AIX OS internals knowledge</li>\n<li>Shell scripting (Bash/Python)</li>\n<li>Knowledge of LDAP, NTP, SIEM, PIM</li>\n<li>Experience with monitoring tools</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com</p>",
        "tags": [
            "3-5 Years",
            "Linux",
            "AIX",
            "Shell Scripting"
        ],
        "summary": "Seeking a Linux/AIX System Administrator with 3-5 years of experience. Responsibilities include OS administration, patching, automation, and troubleshooting. Requires strong OS internals and scripting knowledge."
    },
    {
        "job_title": "IT Security Specialist – L1/L2",
        "company": "GRAMPRO BUSINESS SERVICES PVT. LTD",
        "url": "https://infopark.in/company-jobs/details/21291/348",
        "location": "Infopark",
        "closing_date": "31 Dec 2025",
        "job_description": "<h2>IT Security Specialist – L1/L2</h2>\n<p><strong>Employment Type:</strong> Full-time | Onsite</p>\n<p><strong>Experience:</strong> 3–5 years</p>\n<h3>About the Role:</h3>\n<p>Manage and respond to security alerts, administer firewall/DLP/AV systems, and support enterprise cybersecurity controls and incident management.</p>\n<h3>Key Responsibilities:</h3>\n<ul>\n<li>Manage firewall rules, policies, updates</li>\n<li>Monitor firewall logs for anomalies</li>\n<li>Manage DLP tool policies &amp; alerts</li>\n<li>Ensure endpoint AV updates &amp; compliance</li>\n<li>Monitor privileged user activities (PAM/PIM)</li>\n<li>Support SOC in incident investigations</li>\n<li>Conduct security audits &amp; prepare reports</li>\n</ul>\n<h3>Required Skills &amp; Experience:</h3>\n<ul>\n<li>Hands-on with Palo Alto, Fortinet, Trend Micro</li>\n<li>Understanding of SIEM, vulnerability management</li>\n<li>Knowledge of firewall best practices</li>\n<li>Good analytical &amp; incident-response skills</li>\n</ul>\n<p>If this opportunity aligns with your career goals, kindly share your updated resume with us at stiny.bastin@gramproindia.com</p>",
        "tags": [
            "3-5 Years",
            "Palo Alto",
            "Fortinet",
            "Trend Micro"
        ],
        "summary": "Manage security alerts, administer firewalls, DLP, and AV systems. Requires 3-5 years of experience with Palo Alto, Fortinet, and Trend Micro."
    }
]